{
    "name": "Bonrue Bakery formerly Farmstead",
    "place_id": "ChIJEa4aVJ5FyoAR4lQeWj5pbfk",
    "grid": "SI1",
    "address": "18 S 200 W, St. George, UT 84770, USA",
    "rating": 4.7,
    "user_ratings_total": 1248,
    "phone_number": "(435) 986-7777",
    "reviews": [
        {
            "date": "10시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGbk5IQjVVMjlHVFhKQk9EQm1aVFk0YzJ4VFVFRRAB",
            "text": "I have had a few items from the bakery that family brought to me on their way up from California which were very good. This was my first time for an in-store visit. It was overwhelming deciding on what items to take. I got quiche which was so good we bought two more to take home. The tabernacle, a creamed filled croissant, was so delicious. Several in our group had the BLT which they all liked. Too many items we want to try but seldom get down to St George. Are there any thoughts of opening your bakery in Utah County? Pleasant Grove has a new development right along the freeway where it would fit in perfectly."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psTVJ6azVSMGx1V0V3eVRHcFlMVXgxWmpndFdsRRAB",
            "text": "The blueberry tart was amazing"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjMlZ6SkNVRTFuUzBkNVZHaFFRVmRVV0VkSWJFRRAB",
            "text": "So good! We tried different pastries on two visits and everything was delicious."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kb1NpMHdObFZ5ZG5sdlZHSnhNV2RmVG1WYWFsRRAB",
            "text": "Stopped by Bonrue Bakery in St. George after seeing it on TikTok while passing through — so glad I did!  Liza was super friendly and knew her stuff.  I got a sandwich and a slice of key lime pie and both were amazing.  Ended up going back in to grab some sweets to go 😋\n\nThe shop itself isn’t anything fancy, but the food and service are top tier.  Also had an iced coffee that totally hit the spot.  Definitely worth a stop if you’re in the area!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sbk1tMXVUbHBCVERsallURnVOa2w0ZEZWU01WRRAB",
            "text": "Best in U. S."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsaVpXcEhOR1ZJY0V3NUxYbElTRzlDVmxjMVZHYxAB",
            "text": "Bonrue's pastries are the best i have had since i was in Italy a few years back.\nThey are really quite incredible.\nStaff was very freindly and helpful as well."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVE1VUmFUVFJWVWxJdFdFTlRUMlp0TkRGTVZIYxAB",
            "text": "Exactly as I hoped it would be! Such a wide range of baked goods, amazing service, and plenty of seating, indoor and out!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMWFWQTFOWHBHWkVGYVZqUjNjRnBOTlVZMkxVRRAB",
            "text": "The service was so nice! Maybe because the guy kinda knew my sister, but still he was very sweet to all of us. We got a light lunch and some pastries and they were yum. The chai was also splendid. I dont live around here but I would be there everyday if I did"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOUmRHSnFTbE5aWjI0d2MyZG5YeTFrWHpacGNVRRAB",
            "text": "Can't say enough good things about this bakery. We had a chance to try several different pastries both savory and sweet, and all were amazing. Top choices include the pistachio cronought and the chocolate kouign amann. But you really can't go wrong with anything."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25obFNHTkNVblZDYTNsTE9VdFpTMDFyZEZkaFNVRRAB",
            "text": "We go hours out of our way to make a stop here, and it is always a top notch experience. The blackberry pistachio tart, coconut pie, and the chocolate croissant are our recent favorites"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205TU4wb3RNRVJ4ZFV0YVpubzRObko1VkZCSGQyYxAB",
            "text": "I live across the country, but would seriously consider flying back just for their pastries.\n\nEverything is good. Everything. Especially the cheese danishes. The staff is super nice and make good recommendations. I do wish they would offer half sandwiches, but otherwise I have no complaints."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sVGJEQkxSelZVWlVwU2JUQlZTbEJ1TW5Oc1JrRRAB",
            "text": "Sarah was great she answered my questions and was able to suggest a few different pieces I should try."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KbE5rSTVlR0ZEWmxkSVpXNW9kVk0wUVZKeGNtYxAB",
            "text": "Beautiful inside and delicious treats. An absolute highlight of my trip here. Cute neighborhood too."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkVlFuWlBjMlZWWDBrNFdIQllNVkZzTmpSWVRuYxAB",
            "text": "We go every time we're in St. George because it's that good. The almond croissant specifically....10/10."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kd2FGSkRaRloyY1ZoSmMwNVBXa2syUkhsdVZuYxAB",
            "text": "Came here finally! Everyone talks about how amazing it is here. This place needs no advertising. Their word of mouth is strong, and I see why. The atmosphere is nice inside. They play fun music and have a long isle of freshly baked goods. It's very clean as well and staff were upbeat and friendly. I tried 3 different pastries and a latte and was impressed with how delicious they were. If the weather permits, sitting outside on their coveres patio while enjoying their treats is great!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdFdXMTZaMUEzUW5kV1NtMVJRaTFzWDJwMmJXYxAB",
            "text": "High"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NWFrMVFUbXRVVWpkRk9XNTJSWEZZWHpOdmIyYxAB",
            "text": "Love.love.love this bakery! Never had an item that wasn't to die for delicious."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWlUwODFWbmxVVTJ0aVUzaEdTbGhTVEcxeFNVRRAB",
            "text": "Delicious. High quality food and baked goods"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWmJrbE9WRmRPUVdKWllVSTNlVEUxYWxoTWJXYxAB",
            "text": "The lemon bars are delicious and gluten free!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnNVZrZFRiREJmUm1WTFZ5MDRSVmRYU1RocExXYxAB",
            "text": "Don't hesitate to stop into Bonrue Bakery! We are a family of six traveling back to Minnesota and my husband wanted pastries for the road. We happened to see it from the road and stopped in on a whim. We got so much that they gave us a apple cider donut for free! The croissants are buttery and crispy, the donuts fluffy,the fillings were creamy but not too sugary, the St. George breakfast sandwich was perfection. The girls working were smiley and friendly and the overall vibe was upbeat and positive. We will be talking about this place for years to come. Sooooo good and we feel good after eating them!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sM1lXZFhXbEkxTVZoSE5rRkZUblEwY2tKRVRYYxAB",
            "text": "Bonrue French Bakery & Café in Hurricane is like a little slice of Paris that accidentally landed in Utah—and decided to stay for the pastries. With its flaky, buttery creations and cozy charm, it’s become the unofficial carb headquarters for both locals and caffeine-fueled road trippers, like us.\nTheir pastries aren’t just good—they’re “I might fight someone for the last chocolate croissant” good. From delicate quiches that whisper “brunch sophistication” to lattes so smooth they deserve their own jazz playlist, everything here feels lovingly handcrafted by someone who really wants you to eat well and smile while doing it. The staff is warm and welcoming too.\nSo whether you’re a loyal local or just popped in because your GPS said “nearby croissant,” Bonrue is the place to treat yourself, ruin your diet (in the best way), and pretend, just for a moment, that you're living your best life on a side street in France."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWQmQyVTRRVGR2UXpCNlVWVkNWbHA0ZWxSamRFRRAB",
            "text": "Quick stopover lunch before heading over to Zion. Fun choices, settled on turkey sandwich croissant, chicken arugula salad with feta and pomegranate seeds and a pistachio tart. Yum! Everything flavorful and great texture. Service was nice and efficient."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSFkzcExOVlZKUkRrNGFGWm1Semx6TlRSWmVrRRAB",
            "text": "So many options! Delicious!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZd1pYWmpjSEp5UTIxS1FXRkpiamg2TlMxNGRuYxAB",
            "text": "This is a must stop spot in St George, or you’re doing it wrong. Everything here is quite literally perfect (compared to anywhere else in Utah)."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsQ1lXWmFhV2RuYlVKUVMzZGFWelJuU1hwWVMxRRAB",
            "text": "Exceptional pastries and sandwiches.  Truly a hidden gem just outside of Zion NP.  The staff was so friendly, patient and polite.  And the food was some of the best I’ve ever had.  Reminiscent of my vacation in France.  I wish I lived closer, but I look forward to visiting again next time I’m out west."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wb1NYSXdXVkUyZG1sR05EWmpjM0UwTFRoaWNGRRAB",
            "text": "Felt like you are a bakery in Paris but with better coffee.\nHam and cheese sandwich on a baguette and turkey and cheese on a croissant are both best ever.\nBrown sugar and cinnamon latte was heavenly.\nPumpkin donut was unique and yummy.\nReally everything was delish.\nWorth every penny.\nWe ate outside facing the beautiful Zion scenery.\nDoes not get any better than that anywhere in the world."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SbGMySmlhRTF5VVhKc1dVOWhPRUUxUm5aTlZrRRAB",
            "text": "Really disappointed today (September 30) when we stopped in the St George location to grab a couple of slices of pizza before our movie.  Surprised when the pizza came out, it was not the triangle, New York style slices we were used to but rectangular,  thick slices.   Crust was good, but we don't like thick crust, way too much cheese, and not enough pepperoni (compared to their previous).  We felt the previous pies were the best in St George and comparable to any NY style we found in Vegas.  We were told this is a permanent change, so needless to say, no more pizza for us from Bonrue."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xeVdHWnZZMTgzUlVKM09XOUhZMUpoZERNeFlrRRAB",
            "text": "Delicious pastries ans sandwiches. Good coffee drinks. Outside patio has nice atmosphere. Tables could use a good cleaning."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pscGJtdExhREl6VGxKa1FuaDFlVm8wUWxkbVdHYxAB",
            "text": "First time here. I loved the quiche, and the chocalte donut with cream inside was so amazing. The chocolate almond croissant and the ham and cheese croissant were a must too. Great job you guys!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0dFkxSnVTekYxTVVVM1l6TnNNMFF0YkZWa1dGRRAB",
            "text": "The food and pastrys are always delicious. I wish I lived closer because I would go there so much more. It's a bit expensive, but the food quality is fantastic."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFMWVIUnVhR3AxVDFOWVIwRnRaVkJ4WDNadGNrRRAB",
            "text": "Love their coffee and love there pastries."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWRFdEWTFUVE55YWxaUWFFdFpibXR6WDFOdFVHYxAB",
            "text": "This is by far the best bakery pastry shop in Utah not just southern Utah. I feel like I’m back in Paris, France 🇫🇷. Everything is so good. Try the Blueberry croissant!  I hope everyone can get a chance to try this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205M1pHZGhla2MyZEVGcmRsOVNMV2hmYVZaMFZWRRAB",
            "text": "Great"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVmNqZHdiMFJOTFRFeU1WaEpiVUpHYW1wT00yYxAB",
            "text": "Muy bueno el jugo"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nNFRGQjRNbDk0YzBkc2F6QXdOVXMzYUVocFNWRRAB",
            "text": "Absolute great pastries and croissants. Service was very good, attentive, and helpful. Espresso was very good as well, not overly sweetened when I requested flavor.  Will be back as well as tell everyone about this bakery."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xob2FVUm9aV2sxYW1OV2NVcFZValpGZWw5eFdHYxAB",
            "text": "This was such a cool place to go to! And don't get me started on the food..!!! Not only was their chicken sandwich mind-blowing but the selection of dessert was out of this world! I found my new go to place today! 😁 And I totally recommend the coconut lime lemonade!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKTWMzUnhNV3RwTWxSMlkzSk9PSEV4UjJsNFpWRRAB",
            "text": "Farmstead/bonrue has become the bakery locals can’t stop talking about. The pastries are buttery and flaky, the bread is chewy and perfect, and the coffee matches the quality. The vibe is modern and bright, making it a nice place to sit for a while. It’s busy, but worth the wait, because everything feels fresh and made with care."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNNVkxa3RUVXR0V1VwQ2JrbGFaVTlaTjFWVVFYYxAB",
            "text": "Stopped in on our travels for a quick bite and coffee. Was exactly what we wanted & needed! Delish!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkMk1tWXllVlJJWm1JNWExcGZObnBTYTNaT1RrRRAB",
            "text": "My whole family loves this place, everything’s  delicious !!\nToda mi familia ama este lugar, todo es muy delicioso!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaWk5YaEVRWGRDVkRWdlZuTlJUMWhuYW01eVNVRRAB",
            "text": "Dropped in before heading out of Utah after spending a few days at Zion and it was great! I didn't get her name, but the employee that helped us out was lovely. She was very helpful, since it was our first time in the shop, by giving us suggestions, telling us to take our time, and was just overall super friendly. She even made sure to bring my drink to the table and offered to alter it if the taste was off. The latte was great and so were the goods we got. Even took an almond croissant home-- it was delicious. Would definitely like to return if I visit Zion again soon."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4NU1GbG1PVTF5ZVdWVFUwUllYMWxLY1hwYWRIYxAB",
            "text": "We had a large group, so we tried a large variety of pastries. They were all above and beyond a typical bakery. There were unique flavors, like guava, but also interesting additions to more familiar items, such as pistachio cream inside a…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3c19qeTZBRRAB",
            "text": "My friend, her daughter, and I were the first customers on Sunday, March 23rd. We wanted to give it a try and get our coffee and box of pastries for our drive back to Orange County, California. The two ladies working that morning were patient and provided hospitality to us. We even got a sample of the banana bread loaf. It was moist and not over sweet. The young gentleman also working was nice. My friend and I, along with her daughter, sat and enjoyed some of our sandwiches. I made time to read a little about the owners on the wall frame plus about the location. I definitely will be back. I like finding places that provide a homey feeling and very organic pastries. The items I ordered were the BLT & Mozzarella Sandwich, which had the right amount of Herb Mayo sauce on it. I always dislike when other places put too much sauce on sandwiches. I liked all the pastries, and I should have bought at least five more.😅 The hot latte was made good. Thanks to the employees who made our experience awesome, and I'll be back. ( : Hopefully, I am remembered."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLS3R3S2lKeGEtU0pnEAE",
            "text": "High quality bakery and coffee! Everything was amazing! They have other locations and we went to the one in Zion and it was just as good! Also one of the owners was there and he is amazing! Coffee roasted in house and the roster is one of the best. Same with the pastry chef!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOE5Qak1nEAE",
            "text": "Fast, friendly service and great food! You've got to try them out  we had a breakfast croissant this morning...wow! I'll be coming back for this for sure. We also bought a selection of their fancy croissants and pastries to share. They were a great hit with the entire team. I'd highly recommend Farmstead."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvc3QzVGlRRRAB",
            "text": "Fantastic pastry selection! The Chocolate Kougin Amann was AMAZING (a flaky croissant style with caramel and chocolate). The key lime tart was probably my second favorite.\n\nI came back to try the breakfast croissant sandwich - WOW! Honestly what blew me away the most was the egg inside. It was SO custardy /creamy (Gordon Ramsey would be proud)."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVeWNUTkdNa0pUV2twaU5uWlVRMk5DVkhSeE9GRRAB",
            "text": "This is the best pastry shop I've ever been to  we love the Chocolate Crossiant its Devine the taste is out of this world we need you guys to expand like to the Wasatch front. Walking in makes me feel like I'm in Paris it just gives off those french pastry vibes"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBN3N1Sl9RRRAB",
            "text": "We went to Farmstead for donuts and coffee 🍩☕. They had a ton of breakfast sandwich options, both sweet and savory, plus regular pastries and unique treats like cronuts and danishes. The donuts were beautifully decorated and almost too pretty to eat 😍. Their lattes are unique too, which I really enjoyed. The service was excellent—everyone was sweet and kind, making us feel truly cared for 😊. I highly recommend checking this place out if you love a mix of creative flavors and friendly vibes!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBazh5Qi1RRRAB",
            "text": "Visiting from New York, I had high expectations for pastries, and this place completely blew me away! Honestly, it’s better than a lot of the pastry shops in New York. Every bite was perfection—flaky, buttery, and just the right amount of…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuc3JXT0R3EAE",
            "text": "The George Breakfast croissant was delicious! So buttery, flaky, and the fillings were yummy. The eggs seemed to be made from liquid eggs verses individual eggs… so if that texture weirds you out then maybe stay clear. Our Almond croissant was also delicious as was the orange juice. Not a ton of place to eat inside, but there was outdoor seating with shade which was nice for the St George heat."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPYVdsSW5tb19qVzR3RRAB",
            "text": "We visit every time we are win town. Today we walked from our hotel. We always make sure to order a chocolate croissant and the ham and cheese sandwich to eat at the pool. Our kids love to pick out a pasty every day…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tReGMycFdWRXhNUkhKdlF6WXpNaTFVVmtReFVGRRAB",
            "text": "This is the best bakery in StG!  I've been here many times. Fresh chicken salad crossaint sandwhiches.  Best cinnamon roll I've ever had.  The chocolate K.A.'s YES!  Great mini pies especially the strawberry rhubarb.  Awesome kronuts. We…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aSWRFNUxhWFY1WTI1eE1XNXJUV3hEWTNKaU4wRRAB",
            "text": "Oh. My. Goodness. Absolutely incredible. We had a friend recommend this place to us, and it’ll be our new St. George tradition from here on out!\nWe got the chicken salad sandwich, turkey havarti sandwich, and an assortment of treats. The sandwiches were amazing. Great flavor and balance. Plus, everything tastes better on a croissant!\nThe chocolate croissant, Boston crème doughnut, and cheesecake were amazing. My husband’s favorite was the blackberry pistachio tart, and I went back for three more of the world’s best chocolate chip cookies.\nTruly incredible!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VORzZ4Zlg2czRuektBEAE",
            "text": "This place is highly recommended by me, with wonderful tasting pastries, delicious veggie quiche, and fantastic staff (my husband and I met and had a delightful conversation with Tex). Bonrue would be an excellent place to go to for a light Sunday brunch with coffee, or to just grab and go at home.  I will definitely go again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMVNHUk1hM0oyWjAxTE1FNXVTMFp3VVdKQ2JVRRAB",
            "text": "Went here to pick up some snacks and coffee. My husband drinks coffee he really liked it.\n\nGot him an iced vanilla latte. He liked the old fashioned donuts.\n\nWe got two types of sandwiches. We liked the turkey and havarti on the croissant the best. Very great texture not too flaky. Comes with a Dijon mustard. I ended up adding more.\n\nThe cheesecake was very good. I'm not a graham cracker crust person but it was decent. I prefer nilla wafers for a cheesecake crust.\n\nThis place is awesome, service was great."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VLREVyZEhjX2JIeDBBRRAB",
            "text": "Pizza was cold and hard - when asked if they had any not cold and hard - the volunteered to warm it up- gave it back to me slightly not cold. I wasn’t going to ask again. Tasted like frozen pizza - crust could break your teeth. Overpriced…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURud2JqZ2F3EAE",
            "text": "Delicious bakery. The pumpkin bread, old fashion donut, breakfast croissant and chocolate baked item. Definitely worth the visit and price.\n\nHowever, the prices are not cheap. an example of would be a donut is $3.50. So if you’re looking for cheap options you might want to try somewhere else.\n\nNot a ton of seating however there is some outdoor seating available.\n\nOnly one bathroom.\n\nFriendly staff."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0VlYxcENaa1JKUzJGWVgxRXpSa3gyZVdwTGEwRRAB",
            "text": "Immediately walking in the smell of coffee hits you right in the face. Now, I actually don't drink coffee but I do appreciate the smell of a good coffee. It might sound weird but I can tell based on the smell if the coffee will be good or not, and again I don't even drink coffee!!! Lol\n\nThe young lady who helped us was super friendly and patient as it was our first time here and I was overwhelmed with options. I wanted it all! We ended up trying one of their homemade pop tarts (brown sugar) and cronut and a few of their crossiants. Everything was absolutely delicious!! I will be back before we head back home to try some of their sandwiches and get smell crossiants for my boys back home."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQeC1PYm93RRAB",
            "text": "ONE THOUSAND OUT OF TEN!!! We love this new little bakery! Everything we try tastes fresh and amazing! There is always a decent line but I am always impressed at how fast it moves! There is such a huge variety, everyone always finds something they like! We LOVE their sandwiches and their danishes! Cannot recommend this place enough!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwcGRHOUpTSE10ZEZOM01DMVVNV2xaU1VGeE1VRRAB",
            "text": "Stopped here on our way home for a yummy treat and that is exactly what we got! Pastries were so good! We will be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN3Z1RkZ3EAE",
            "text": "My favorite was the brownie and cheesecake. All were delicious. Loved it! Great service, delicious. Area outside to eat and chat. Great place at a great location!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6bHMtV1lREAE",
            "text": "Wonderfully delicious! We absolutely enjoyed everything we tried.\n\nWe arrived 30 minutes before closing and were happy they still had some items available for purchase.\n\nLimited inside seating, couple places to sit outside.\n\nWe tried a peach pie, classic brownie, carrot cake and blueberry coffee cake.\n\nLooking forward to stopping by the next time we drive through St. George."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqN3ZiUWRREAE",
            "text": "The guava cheese Danish and the pretzel hot dog were lip smacking good. The flavours were so unique and the pastry was very buttery and flaky. Very generous amount of filling. There was such a big selection of savoury and sweet foods there, I found it difficult to pick! An absolute must go when driving through St George. Be aware that seating is limited and we found it difficult to find a place to sit and enjoy our baked goods.  Friendly service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5Njh1eVh3EAE",
            "text": "First visit. We stopped by around 11:20 am on a Saturday and the line was all the way to the bathroom area. But don't let that long line intimidate you. Bravely take your spot in queue and shuffle forward. The line moved pretty quickly. You can pretty much point to whatever you want to order, be it salad, sandwich, pizza or a pastry, because it's all displayed in front of you. So many delicious choices. 😋 The prices are reasonable enough. We ordered a variety of sandwiches and pastries as well as different beverages. Everything tasted great. We ordered it to go and had a fun picnic at the park."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJODVPSlV3EAE",
            "text": "Great place to grab some pastries and sandwiches. Stopped here on a golf trip and had a breakfast sandwich on a croissant that was amazing. I grabbed a ham and cheese sandwich on a baguette for lunch that was also so good.\n\nTheir chai wasn’t that great, but overall a really great place. You’ll spend $50 before your realize it, but you’ll enjoy what you eat."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoeUk2QTl3RRAB",
            "text": "Went to Farmstead with a few friends and everyone loved it.  They're are so many delicious treats all made fresh and displayed beautifully!\nThey have some breakfast sandwiches and a couple yummy salads.  There were a couple gluten free salad options.  I loved the avocado ranch dressing.\nThere are so many bakery options.  Over all everyone loved the items they tried and we will be back another time for more.\nBright trendy atmosphere, a clean bathroom and some dining tables inside and out.  Also they make it easy to buy things to go."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuM01hNDlBRRAB",
            "text": "Farmstead Bakery in St. George delivers an exceptional experience! We started our morning with the George sandwich and Quiche Lorraine, packed with fresh, bold flavors. The sandwich was hearty and satisfying, while the quiche was perfectly baked and savory.\nFor those with a sweet tooth, the desserts at Farmstead Bakery are a dream come true. We indulged in the sticky bun, scone, Boston cream donut, and chocolate Kroughnut, each one a delightful explosion of flavor. The sticky bun and Kroughnut, in particular, were a cut above the rest, with their incredible texture and flavor. The cherry lemonade provided a refreshing, tangy balance to all the indulgence.\nThe cozy atmosphere and friendly staff made the visit even better. If you’re in St. George, make sure to stop by this bakery—it’s a must!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURROXFETy13RRAB",
            "text": "This is one of my favorite places in the world! I was not a fan of the pizza, but the chicken salad croissant sandwich is not to be missed. We've tried various pastries, all of which are delicious, but our favorite is the classic cheese…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nd1UwTlhkR3RFYWtadmJXWjFhbmhtWVc5ZlJsRRAB",
            "text": "Beat bakery in the area. I have been to all three locations and the quality of service is consistently excellent. All the pastries are delicious. However, the sourdough is out of this world, if you want a secret tip."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMUt1ZGRBEAE",
            "text": "Cute, trendy bakery with delicious European pastries. Nice selection of drink, sandwiches and breakfast items as well. The lemonade with lavender cold foam was unique and delicious!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNMjNwN2JybDRYTkp3EAE",
            "text": "I love everything French and I’ve been wanting to go to a French boulangerie for a while now. I went to Bonrue and got a key lime tart and a Kouign Amann, they were sooo good. I highly recommend this place for those craving pastries."
        }
    ],
    "reviews_count": 70
}