{
    "name": "20th Hole",
    "place_id": "ChIJAQA7eMpDyoARaXRTczAKc5o",
    "grid": "SI1",
    "address": "1500 E Black Desert Dr, Ivins, UT 84738, USA",
    "rating": 4.6,
    "user_ratings_total": 99,
    "phone_number": "(844) 237-8824",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210M1ozVjRYekpQWVVVelNrTnpNRkppYUhZd1FWRRAB",
            "text": "Great place after golf!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjNWMycFRlbTlEVlcwNE9Va3piVGhzWlRWRWJGRRAB",
            "text": "May this message reach your heart as a sign from God, guiding you to the right path.\nIslam is a faith of peace, beauty, and truth — the true religion revealed by Allah.\nWe believe that Jesus, the son of Mary, is a noble messenger of Allah, and that Prophet Muhammad (peace be upon him) is the final prophet and a devoted servant of Allah.\n\nIslam teaches love, mercy, and justice. It calls us to live in peace and goodness, always remembering our Creator.\nWe stay connected to Allah throughout the day by praying five times, seeking His guidance, mercy, and blessings in all that we do."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWQ1lWVk1abE52Y0c1aE1HTjBaWFp6UjNkUmNVRRAB",
            "text": "I really like 20th Hole. The food is great. The service is equally as great! People are friendly. The downside for me is how dark it is on both the exterior and interior. There is no lit up signage on the outside that indicates it’s a restaurant. I had to pull out my flashlight to look at the menu. I tripped walking to it because the resort is not well lit at night. I’d love to recommend it to friends and family but I worry because of how dark it is, it would be risky for some. Even the hostess desk has no direct light over it and you can barely see. If they could add more lights inside and outside, I’d definitely recommend this to more people."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SMFZrSk1UVlZrYkRSRU1FeGZTVU5UWlhRM1MwRRAB",
            "text": "Janessa is an amazing server always so friendly and attentive! She rocks!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkd1EwczJMV1p5VGxsQ1lYQnVjakJpVmtvMlowRRAB",
            "text": "Hattie is the most precious waitress ever!!!!! We LOVED her so much and we’re 100% requesting her the next time we’re at 20th hole!!! She gave us great drink recommendations (I loved the rosé), had us laughing the whole meal, and suggested the tastiest bread pudding dessert!! 100/10!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CemFteExXVXhpZEhSdWQzcERZVGxhZFhGYVVVRRAB",
            "text": "Amazing experience! Food and drinks were amazing, amplified by our incredible sever Hattie! Will absolutely be back and will be asking for her!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWGRHdzViMTg1VFhwS1ZXZEhPR1p2UzJVeVFVRRAB",
            "text": "Hattie was amazing! 5 stars"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5MVZUbHVjRWRGWVRsUE5FOVpUMUJsVkRkTGRGRRAB",
            "text": "Levi was so kind and funny, and gave the best recommendation on the Mediterranean bowl :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201dVpqaGhkVkl6Ym5jeGFYTlJTMWRpUlhoS01uYxAB",
            "text": "We came in as a golf group of 8, ready to enjoy a night out and spend some money. Unfortunately, the service was disappointing from the start. After being seated, we waited 30 minutes without anyone approaching our table. Eventually, we had to ask if we could be served, only to be told by the host that it would be another 10 minutes before a server could even come by.\n\nWhat made it worse was seeing three staff members standing around the host stand doing nothing while we sat there ignored. It gave the impression that customer service simply wasn’t a priority. The whole experience carried bad vibes, and instead of feeling welcomed, we felt like we were inconveniencing them just by being there.\n\nWe were excited to support the restaurant, but between the lack of attention, the poor communication, and the unwelcoming atmosphere, it was a real letdown for our group."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KRU1IZExWbWR2ZEV0SU1XaGtPRWR1VVhCMFdIYxAB",
            "text": "Great and prompt service. Recommend the bread pudding and he was not wrong."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVFlVeFNVV1EwUWpaWmEyeHZVelpsVkZwRmFXYxAB",
            "text": "Food was terrible. Soggy fries sandwich was gross. Service was good!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210TVRqTlJjVzVpZGtwTWFFOUpOVWR6Wm1wTFZtYxAB",
            "text": "Great food and family friendly entertainment. They have a kids menu that our kids loved with generous portions. The service was great with friendly staff that always was attentive to our needs. They have many games for the kids to play like ping pong, foosball, etc. while waiting for food to come. Highly recommend this place!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pad00wcERPVnBGUkhZMGVqazBiVkYwUTFGVFJuYxAB",
            "text": "Janessa was super sweet and fun. Food was delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkd1JIQkJjVWRCWXpreVMwMVNSMmxUYWxSQ1dIYxAB",
            "text": "Our service was exceptional and our waitress fun, efficient, attentive and knowledgeable!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTFFtaGFVMFpvT1dodmIzWm1UbTVrTWxOYUxYYxAB",
            "text": "Janessa is an amazing server and was an absolute delight"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twS0xXUnBSM0IyUWtaUFRISjBRMDU2YlZkUVNuYxAB",
            "text": "Janessa was an amazing server!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoVU5tOTZVbGs0WDBkc2MzazFWVnBtU0RaUmVIYxAB",
            "text": "BDR is amazing with people like Janessa, smart, beautiful and so friendly! Would highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KS1RtZHhXRWhTZUU1aGNESjBNMGxQYVdwQlZsRRAB",
            "text": "Great attentive service. Food was good. Fish tacos were not quite “hot” but very flavorful and that was probably a fluke. Nachos were delicious and piled high!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOdmIyVnFRbGhNTUU5Tlp6ZEJibE5MY1VsbVNWRRAB",
            "text": "Great service, great food and love the vibe."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWVMycDJjemMyY0ZSME1qVldMVkl3YVdGZk1rRRAB",
            "text": "Great food! Great environment! Love the hide away location and the great service provided! The smokehouse bison burger was incredible as well as the grilled fish tacos!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4ME5XNTNRbTlaYlVGaWR6Sm9WSGsxTVVsWFRGRRAB",
            "text": "Buen lugar acogedor y la comida muy rica"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsRmR6Uk1ZalUzY3psdVFtcDBObUoyZVhadVZVRRAB",
            "text": "Came to have a drink and eat wings and Zack was amazing 👏"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkTVdqSmpTbVpDUTJobFZEZDNZME5VZEdGUlpuYxAB",
            "text": "The place was very nice and fun. The staff were polite when they actually came over. The biggest issue was getting food and check took forever. We had to go for stag several times to get the check after 30 months of waiting for it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGU2NsSlNkMGhLVTBoUmJqaE1ZbHBuUkVGTlVVRRAB",
            "text": "I was so blown away by this incredible and beautiful and very high tech sports bar.  TV’s  everywhere. The golf simulator booths  are outstanding. Great for groups and parties. You can golf anywhere in the world pretty much. The atmosphere is amazing. The vibe and design of this sports bar is beautiful and the service was fantastic. Kudos to Black Desert and Black Desert Resort!\n\nI’ll be back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4Q2VuTnRVVVpLVEZkd1pVOVNSM3B6UldOUFEwRRAB",
            "text": "We love this place. The bread pudding is amazing!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMGMxcGxkR2x1UkdGTGNXZDRVRjlOUWtoM1dFRRAB",
            "text": "Outstanding! Loved the wings, fish tacos, and short rib grilled cheese!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cFQwOTVVV1Z1TFRCVWVuUTJaVVpWUlZWRU1HYxAB",
            "text": "I love the 20th hole except when it’s closed and then we have to go to another great cafe Latitude ❤️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKZldGZE9ZVlpTWmtadFNESmhkaTFWU2pJMVZXYxAB",
            "text": "It was cool my coach was there and I got a birger I like it and I had a tournament there and it was really fun and I played good and It was pretty cool to go to black desert and it was really fun😁😁"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSbmQxRjZYM1Z0YUU5UVFtOW5jR3RETldwUVNuYxAB",
            "text": "I really loved the place, you can watch tv sports, great variety of food! Their tuna dads was delicious"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJYV84NHJzODR2SnRRRRAB",
            "text": "Amazing restaurant with amazing staff and  and delicious food and a fun atmosphere! Gorgeous views all around the whole resort ! Definitely a favorite of mine for sure 🤩🙌🏻"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3a2NIeUpBEAE",
            "text": "What amazing place for food and drinks. Service was outstanding."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMcVA1WVN5eUplQUNnEAE",
            "text": "Loved the honey chicken fingers! Soo good. The bread pudding desert is a MUST! The southwest chicken salad was ok. The fried green tomato BLT on chibatta bread was really good, I recommend it. Fun atmosphere, especially if you love to play golf on one of the 5 awesome golf simulators. Super innovative! And TVs all over the walls to watch any game that's on. Full bar too. We spent $100 for 4 of us including tip. Big deep booths can seat 8 comfortably by the floor to ceiling window with stunning views of Red Mountain. Wow!  Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQdVlwcmFNNFpEaUVREAE",
            "text": "Loved the 20th hole. Bryan was our server. He was super nice and was very knowledgeable. Even gave me a fun fact about bananas. All drinks and food came out very quickly. Definitely coming back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZc2RQRE1nEAE",
            "text": "Everytime we come here we are blown away! Amazing food and drinks! Our bartender Zach Bates is fantastic! We asked him to make us something off menu and he came back with a hibiscus gin sour that was 100/10. We will be back again!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZc2VQNHlBRRAB",
            "text": "I love 20th hole! Amazing food, great staff and fun atmosphere. Zach is a super good bartender, very attentive and fun to chat with. 10/10 everytime we come here!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZX292OFRREAE",
            "text": "Food was pretty good (I got the wings) but service was awsome!! Zach was my server and he was so friendly and attentive! The bartender Auston was also awsome and helpful!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNXBxQzF3RRAB",
            "text": "Great service and the host Braden is very handsome <3"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvXzktTUVBEAE",
            "text": "The food here was amazing! View was so beautiful and unique. Very pleasant staff. Annie was my server and was always smiling. Bryan came over and made sure my water was always full. Would recommend to come visit."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNThMbFlnEAE",
            "text": "Zack was great! He was friendly, helpful and the drink he made me was amazing. He suggested a kale salad and I loved it! The best service I’ve had!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcnZmQ3h3RRAB",
            "text": "The food was so good!  I had the bison burger, excellent!  My husband had the blackened chicken, so good!  Our server, Levi, was so attentive and nice. Great experience!  As locals we will definitely be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NWZ6LVV3EAE",
            "text": "New menu item, Habenero burger is amazing! If you like spice, give it a try! But definitely finish your meal with the Bread Pudding!!! This isn't anywhere close to what most consider bread pudding."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdkpDVHhnRRAB",
            "text": "This place was so good! We ate here for dinner and had the wings, fish and chips, and the Brioche Bread Pudding. Everything was great but the bread pudding was TO DIE FOR. My husband regretted not ordering one for himself! Overall great experience :)"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQdk9tSk5nEAE",
            "text": "Bryan was such a wonderful server and the food was great. Definitely would go back again. The golf part is also a lot of fun."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQclB1V0R3EAE",
            "text": "The food here was a pleasant surprise, the ribs were extremely tender and the hot honey on the chicken fingers was chefs kiss. Service was also super attentive, server refilled my Diet Coke probably five times and gave me one to go."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYaHR5ZXFRRRAB",
            "text": "Property is ten star, service is friendly and 5 stars and they have some issues to work out but it’s 100% the most amazing property the lava glitters and the greens stand out like emeralds. The phone gives wrong directions in and mis information. It’s the second round about not the first is blocked off if coming from St. George. 3rd exit off the roundabout and then proceed to building with all the windows that’s the 20th hole. The other restaurant is down the road on the green. Simple menu. Could do better on menu with more delicacies and mini champagne splits. It was the same food at all these courses. Was hoping for more custom eats. They gave simulated golfing in the sports bar. Very dark going in and out of at night. Overall it’s probably the most awesome property open to the public I’ve ever been to and I’ve been to many golf resorts. It feels like an ai post card. Tremendous compliments to the master builder and finance team."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM1BPa1NBEAE",
            "text": "20th hole is a must go if you’re in or around the Ivins/St George part of town! The bartenders Zach and Eli were very knowledgeable and helpful when it came to menu recommendations! The food here is incredible!! Try the fish tacos or smokehouse burger if you want something substantial, but save room for dessert because the bread pudding is the absolute best thing on the menu. Come for the incredible views of the red rock/lava rocks, and stay for the top quality food and service at the 20th hole!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaVpmM1pBEAE",
            "text": "Jordan at the 20th Hole Restaurant was fantastic! She was warm, attentive, and knew the menu inside out, making great recommendations. Her genuine kindness and perfect timing made our meal special. She’s a gem, and I’ll be back hoping to see her again! The old fashioned’s are stellar, and don’t forget to ask about her Gang Tattoos, and her comedy routine."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQd2J2ZWlBRRAB",
            "text": "This is an amazing resturant with great Food, Entertainment and Milkshakes!💪🔥 Beautiful Resort and fun for all because the staff make you feel at home! Definetly come check them out! You will not regret it!…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMnJURlpnEAE",
            "text": "Food is always good here. Unique spin on dishes and unique beverage options. Very relaxed atmosphere in a beautiful location a d setting. Thanks to our waitress Sham for the most recent service :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYMEppWVRBEAE",
            "text": "Went here to golf and have dinner. This was one of the best golf simulators I have used. I was able to play the black desert virtual course and we had a lot of fun. The food was great. It was fresh and full of flavor. The staff was great…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvanRuWnNRRRAB",
            "text": "Have had just about everything on menu!! Can't say a bad thing bout any of em!  Nachos or the wings might be best in Utah!  Salad,burgers or even fish tacos are 5 star!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvc0tlN0V3EAE",
            "text": "Ate there last night.\n\nThe place was mostly empty, but the hostess sat us way back in the back corner away from everything and everyone.\nI ordered the strip steak , medium.Which came out medium well and well mostly nothing but fat. It was one of the worst steaks i've ever eaten. The fingerling potatoes were hard as a rock and had no flavor whatsoever.\nThis was my first experience there, and I was very disappointed to say the least."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnaXZhMDJBRRAB",
            "text": "Came for lunch during the Parade of Homes. Four of us had an excellent experience. The hostess let us know they were short handed up front but we never had any issue with customer service or our food. Great menu. We’ll be back.\nPS The ranch dressing was excellent…homemade."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQa3JydmJnEAE",
            "text": "Amazing food and service! We ordered the hot honey chicken fingers and fish tacos, which we're both amazing... Maybe the best chicken fingers and fish tacos we've ever had. Also, Radar suggested the bread pudding dessert, which was as good as he made it sound!"
        }
    ],
    "reviews_count": 54
}