{
    "name": "Red Fort Cuisine Of India",
    "place_id": "ChIJtbQjlO9byoARPQwkQVfdsgA",
    "grid": "SI1",
    "address": "148 S 1470 E, St. George, UT 84790, USA",
    "rating": 4.8,
    "user_ratings_total": 5247,
    "phone_number": "(435) 574-4050",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTk4xSjNaV2xUT1RBdFYwRmFMV2hDTWpkdVNrRRAB",
            "text": "Service and speed extremely good. Food was nice enough to come back again."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWQ1RtSnJXRUZWZEVjeFdtTmtRek5mUVd4RmQwRRAB",
            "text": "Service is very good but the food quality is inconsistent; recently the Chicken coconut kurma was grizzly and totally missing coconut, vegetable tikka masala was almost too salty to eat. Previous visit the food was very good but time before that again the meals were below standard. Can’t rely upon consistency."
        },
        {
            "date": "4일 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWQlVuVXhUVTV2WmtkZlltcDFOa0l0ZEVoQmFVRRAB",
            "text": "Wir kommen aus Deutschland und finden es ein sehr leckeres und authentisches Essen. Es ist Mega!\nMango Lassi und Butter Chicken sehr zu empfehlen"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMVdsQjJkV04xWW1OeGVIUXlUVGhHZVhOc01VRRAB",
            "text": "The restaurant is beautiful! It really has a fun feel. The staff were all so kind and helpful."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWGVHTnhaeTB4ZDNsclFrVlVRa2hwTFZKV1FsRRAB",
            "text": "Hands down the best indian food and the service was excellent!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sck1sbGpNM1pIY1hWcVVVZFdSWEpGUW5CRVlXYxAB",
            "text": "Eh. I’ve rarely been to an Indian restaurant where I left feeling underwhelmed by the food and the service. As others have mentioned, the service is nothing to write home about. “Yeah, yeah what do you want?” kind of vibe. Yikes! Add to it, the vibe inside is kind of depressing.\n\nThen the food… I may be spoiled from my travels around the country and the world but this is diluted Indian food, watered down to be more palatable for the locals maybe. It was my first and last time visiting for sure. Kesari Indian Kitchen in Ogden is a longer drive for me but worth it because this place isn’t it."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toVGVTMUpZbXh4YkhCU1NFeDRaVFZLVFZjeWJVRRAB",
            "text": "So clean and delicious!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdlJsTjZURWhxWkdsSFZHOXlNa0ZtWHpoVWNWRRAB",
            "text": "Nice Punjabi restaurant offering HALAL food. We had Butter Chicken, Chicken curry, Rice, Mango lassi and Salt lassi in the end. Prices are fair and it’s a little weird that they charged us gratuity tax for a group of 3. Not sure if it is common. Don’t miss the lassi here."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25welMyd3hjVXcyVGxCcGMwWldOV2RMY0dsSFMxRRAB",
            "text": "I’ve been to India and this is the BEST tikka masala I’ve had since I was there. I was blown away by the flavors. I wish I lived near by so I could eat this all the time. We loved it so much we ate here two nights in a row."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxUmVHRXhZM041VnpaSWJtSkJTR1ZsVUc1Q01WRRAB",
            "text": "We get takeout here at least once a week! HUGE fans!! By far our favorite Indian food we’ve had."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dGFtWkRXRXBpVTBVd01WOUJOM2hNVVRoSFgyYxAB",
            "text": "First time there. Excellent food and the service was superb!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kclYwOTZTWEJTVmkxdE1rOUNNMHhDTlZocGFIYxAB",
            "text": "I am glad they have this resturant in remote Utah.  It is not like the best food but it is good."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KbGMyeGlUbFZOUzBaVGQxRlJkWHBQWDJ4eFZHYxAB",
            "text": "Wonderful atmosphere. The service was great. We got the Vegetable pakora, chicken Tikka masala, and lamb karma. They were all delicious! We think the Tikka masala was the best.\n\nSide note: Ladies, the bathrooms have a lot to be desired. Don't look up, one or the two stall was not in service and the one that was in service didn't have a toilet seat. Floors were very sticky."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSllrMXRWakpzTjNrNFkwNTZNMlZKTjNkTFVIYxAB",
            "text": "Our family loves it here, the food was fantastic and the prices are pretty good. Love the decor too! The service can be a tad iffy, mainly because they are so busy. Servers don't come around as often as they do in other places, you may wait longer for refills or your check. Highly recommend."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FNVkzUkhSekZEZGpZMFMxbENZazlWYXpkNWFHYxAB",
            "text": "Delicious food, excellent service and great customer service"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25acmEzVXpjbU4wV0dsV2FTMVBaMGxaU0V4UmRFRRAB",
            "text": "This restaurant staff is to much bad specially who wear a glasses."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWa1FrNDFSWE15VVcxcWQyUlpOR1l3UzJFNFFrRRAB",
            "text": "The food is amazing and the service was even better. Our battery was dead and our car wouldn't start. Thank fully one of the employees let us use a jumper to get home. I'm so grateful, we would've been stranded in the heat without their help!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkTWFFMTBNa2haUjFKbGNsWk1NRWw2TW14cmRrRRAB",
            "text": "Had a wonderful dining experience at Red Fort Cuisine of India! The ambience was warm and inviting, and the service was excellent from start to finish. We tried the Vegetable Pakoras, Malai Kofta, and Chicken Tikka Masala — every dish was bursting with flavor and perfectly cooked. Highly recommend for anyone looking for delicious Indian food in a great setting!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25salYyUTBWR1JCWjBWZllVNUZjMmN0U1ZCVExVRRAB",
            "text": "This is the BEST place to go for authentic Indian cuisine!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoQmIxcHVkWE5aYVdkbVgwNW1NMjVzVFdWdGEyYxAB",
            "text": "Great food and wonderful service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1UWN6WjRSak52V1ZWQ2NXVjNhbXgyTjJsSFMxRRAB",
            "text": "Great food. I loved that they allow for different levels of spice and that they stick to what you ask for. The staff were all very friendly. The pineapple coconut chicken dish was great. It was really busy. But with the faster service than what you normally get in a lot of restaurants, the wait wasn't bad at all."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNmVtRnRjazB0ZUZkeFVXVnlRMnhwUXpCSGJtYxAB",
            "text": "Absolute best Indian food I’ve had in Utah. Their naan, especially the onion naan, is to die for. I’ll definitely come back!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Fd1ZXTkRhWEEwYjNaS2VWOUJNMFYzWW5OSE1XYxAB",
            "text": "Their food is incredible, and the people are extremely incredible as well! One of their employees, Jas, helped us jump start our car in a Costco parking lot right before our trip to Vegas. Thanks to him, we were able to go on trip. Give this man a raise, he deserves it!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psblRVWlllRTA1UjBONVozUm9XVzVRWm5vM01FRRAB",
            "text": "Slow service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CR2JuQlFaazVzVFUxRGVGTjVlbGN5VFhBNVgwRRAB",
            "text": "Nice atmosphere. This place was busy, but we were seated immediately. Service was efficient, but \"cool\", i.e. hardly a smile from anyone--the person who seated us, our server, nor the person who brought our food. Not unfriendly at all, just oddly almost robotic.\nFood was quite good, but not at the top of our Indian food experiences."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GWVVsZEthbFJ3ZVdwM05UVjZZMmRQWTJ0c1JsRRAB",
            "text": "I have always loved Red Fort. The food is fantastic and service is always top notch. Today, I placed an online order for a business lunch and went to pick it up. Unfortunately. I ordered from the wrong location by mistake. When I explained to them what happened they didn’t hesitate, and moved the order (that had already been prepared at the wrong location) to the proper location. They were unbelievably understanding and helpful. I already recommended Redfort to a lot of people, but this kind of service is exceptional. Everyone should eat here and support this restaurant! I promise you won’t regret it!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GSlR6TnNjM2xYVUZWSlRHNHdjRkJvUmxOVVlYYxAB",
            "text": "Red Fort is amazing! Love the food. The service is quick and good. I highly recommend red fort for lunch or dinner."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdmFscG5SVVJCTURaTGNubzFMVFpOUm5kM1QxRRAB",
            "text": "We ordered medium spice and it was just right.  A ratio of 2 orders for 3 people is about perfect without having leftovers."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSVJrWXlTV0UzUmpkZlVWOTJaRkp4Ymt0UVVIYxAB",
            "text": "Food is tasty. Plenty of vegetarian options. Great menu and nice ambience. It seems to be a local favorite."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psNVVFaEJOWEJ1WDJadmMwTjBaVlZXUVRaVlRWRRAB",
            "text": "The best & most important about the restaurant is the food ! Absolutely fabulous flavors & quality & would suggest to anyone to try. The service needs a lot of work. Our particular server didn’t make eye contact with us once and was always disappearing - we had to ask the other staff members for anything we needed. They seemed to work quickly together to get tables turned over & rush people out."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201VWFsWm1kVXh5TjFZdFh6ZERVWEpaVjJJMmJYYxAB",
            "text": "This is nowhere near the best Indian food or the best place to eat in Southern Utah. Lemonades were rancid, lassi is just ok at best, ordered multiple dishes and appetizers and none of them were good. Bad meat, bad sauce, all of the appetizers are not fresh, if you want Indian food that has flavor go to the East Coast or make it yourself. To top it off the service was the usual Indian experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjMVVrRlBWbEo0TnpWU1VFMDVWMDE1TFdWNmJIYxAB",
            "text": "I had paneer masala, basmati rice, naan and vegetable samosa delivered. None of the items were good. I threw out more than I ate. The food did not have good flavor.\n\nI hope I remember not to order from here again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sNFIwMURjWGcyUWxsemJGOXlWbXRsVlVsWWVHYxAB",
            "text": "The Rogan josh is the best!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ScGNFTkhialJqTVhaUGIzSjBVV1ZCVEU1cFYzYxAB",
            "text": "I have no idea how this establishment is getting such great reviews but I had a pretty terrible experience with the food today during lunch. The service was great but the food is really not up to par. I eat at Indian restaurants all the time and was passing through St George so decided to stop over for lunch. Chicken tikka masala had chicken that was overcooked, tough and the gravy was sour in taste (not the rich gravy we expect from CTM). Too much tomato or yogurt in it. Rice was not basmati and it was partially cooked and hard. Naan was good though."
        },
        {
            "date": "1달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xb2FqTkJibk0yV2tWVmRsaHZjMlpyWWtzelVXYxAB",
            "text": "👌"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoeTRucmVBEAE",
            "text": "Super yummy food, and the wait staff was amazing. Will definitely be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ReFV5MUtkSFpwUW1sRGFXMUtRbk56ZFhOdlZXYxAB",
            "text": "Incredible food, inviting atmosphere and wonderful service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trNGNETmZRM0F0ZEdGbVZuWkJORE5VT1Zac1ZHYxAB",
            "text": "I've had Indian food from all over the U.S. including D.C., Red Fort easily topped all of them.  I had the chicken tikka masala,  chicken biryani, and of course the garlic naan.  Both the chicken tikka masala and the chicken biryani had that extra little bit of authentic flavor that is missing from most other Indian restaurants; making this place the BEST!  The naan was excellent, cooked to perfection, and was soft in the middle. A little more Indian decor, and I would have given it five stars on the atmosphere."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GQ1RtSktZVFJKYkdRek9FUktOSE5CZFRRelJtYxAB",
            "text": "Cash money!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210U2FsTndlVzVvZFVodlNTMVhVMlZsWlhoak5WRRAB",
            "text": "I had worst experience in this restaurant food was no good and not complete"
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjbVlySFVBEAE",
            "text": "우연히 가게 된 곳! 정말 맛있고 인테리어 인도에 온듯 잘 꾸며져서 기분이 더욱 좋았어요. 다 맛있고 양도 푸짐해서 배불리 먹었어요. 1박 하면서 저녁 다음날 점심 두번 먹었네요. 맵기 조절 되는데 핫으로 했더니 불닭볶음면 잘 먹는 아들들도 상당히 매워하네요. 천천히 올라오는 매운 맛이 상당해요. 담날은 마일드와 미디엄으로 맵기 조절하니까 싹싹 다 먹었어요. 인도 음식 좋아하시면 강추!"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQycmFQQmNnEAE",
            "text": "너무 맛있어서  라스베가스에서 1시간 반 걸리는데 2번째 왔어요.  맛은 내가 먹어본 인도 음식 중 최고였으며,매우친절한직원의서비스는 훌륭했다."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlMjh5a3hBRRAB",
            "text": "카레 진짜 개맛있어요. 갈릭 난 꼭 드세요."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUFFrTnFVa2h4VDBRelZEY3RUME5FVUVwVmVFRRAB",
            "text": "Easily *the best* Indian food we have had out of all the restaurants we have been to. The vegetarian selection is exceptionally large. We strongly recommend ordering the Mango Lassi for beverage. (I forgot to take a picture of it unfortunately, we drank it too quick) We are so glad we visited and will be back often. Maybe too often."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxd2JrdGxUR0ptVEZrMVlrbEZZbVJFWWt4eWJGRRAB",
            "text": "We liked the food and ambience of the restaurant. We were on our way to Vegas and wanted to stop here for lunch reaching 2.15pm, we had to take a to-go order, as they wouldn't seat after 2 pm due to closing at 3 pm - wish they had said that on their website or on Google. However they were quick in giving us our to-go order which we ate in our car. Plenty of parking. Recommend this place if you are in the area."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMcVBpSmFHOE4ybFR3EAE",
            "text": "Red Fort Cuisine Of India offers a delightful journey through authentic Indian flavors. The restaurant is known for its warm and inviting atmosphere, making it a perfect spot for both casual dining and special occasions.\n\nThe menu features a wide variety of dishes, from rich and creamy butter chicken to fragrant biryanis and an array of vegetarian options. Many guests rave about the freshness of the ingredients and the bold spices that bring each dish to life.\n\nThe service is often described as attentive and friendly, adding to the overall pleasant dining experience. Whether you're a fan of spicy food or prefer milder options, there’s something for everyone at Red Fort.\n\nOverall, Red Fort Cuisine Of India is a must-visit for anyone looking to indulge in delicious food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0b0xXNTVSR1J4V21OMGJIZHdRM2N0TUcxSGMwRRAB",
            "text": "No wonder this place has such high ratings. Ordered Saag Paneer & Garlic Naan’s along with the lime soda. The Service was so\nquick we were in and out in less than 45mins great when someone is in a hurry and yet get great quality food. It reminded me of Dhaba feeling from back in India.\n\nI had an absolutely wonderful meal — the palak paneer was exceptional! The flavors were well-balanced, rich yet not heavy, and it felt so light on the stomach. What truly stood out was the paneer — incredibly fresh, soft, and smooth, unlike the rubbery texture you often get at other places.\n\nThe garlic naans were another highlight. They were perfectly prepared, and I really appreciated the attention to detail — the waiter ensured they were made with garlic powder, not just fresh garlic like at many other places. That extra effort made a noticeable difference in both flavor and texture.\n\nThe only thing I didn’t enjoy as much was the lime soda — it just didn’t hit the mark for me.\n\nOverall, though, it was a fantastic dining experience with excellent quality food and thoughtful service. I’ll definitely be returning when back in SLC."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2treVRtWnFXSEp0T0doc2JYVmlkVmRhU0dGdVkwRRAB",
            "text": "I went by this place because it was across the street from my hotel. The naan was great the shrimp masala was okay. The cucumber salad was not what I was expecting. The service was okay and could improve. I had to call the waiter over every time I needed something. I would give this place another try."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdnQ2TURnEAE",
            "text": "First time here. Was passing through from vegas and was looking for vegan options. Lots to choose from.\nPros: new building. No reservations. Was seater super quickly even though there were TONS of cars in the parking lot and on the street.\nFriendly staff. Quick service. Nice decor.\nOrdered the lamb curry. It was good but I guess I prefer goat due to it's tenderness. The sauce was a little too \"tomato-y\", too tangy for me. Ordered the mushrooms and samosa too. And 2 types of naan. All ok.\n\nCons: you have to pay for naan. That's equivalent to paying for chips and salsa at a Mexican restaurant or bread at an Italian restaurant. Naan should be complimentary.\nThe bathroom was disgusting. Toilet paper and paper towels everywhere. Door has 2 locks. And the worst part: soap was watered down. Like it's running out so let's add water. Lots of water. And there was hand sanitizer next to the sink. What's up with that??? After seeing that, I questioned the cleanliness of the restaurant and the employees.\nWould I come back? Nah. Food was ok. I've had Indian food and Himalayan food everywhere and this was nothing spectacular."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VLcWZ3dDdLa3RuTGpRRRAB",
            "text": "When you see a restaurant gets over 5K+ reviews with 4.8 ratings, there is no way to doubt their credibility. I am a frequent visitor of St. George area, and in recent past I have tried this place multiple times. Their grand restaurant with beautiful decorations inside amazed me. But to my surprise, each time me and my family were disappointed by the taste of the food. I am not questioning the quality or the quantity of the food - rather their foods are just tasteless.\n\nThe prime factor for any food considered to be good is its taste and somehow we felt that none of their dishes taste that good. We are Biriyani lovers, the very first time we were here, we didn’t even looked at the menu and ordered just Biriyanis. It was not good at all. It has everything, the meat, the rice, spices, cashews and rasins but was missing something. We may call it a pulao but not Biriyani. We know Biriyani can be cooked in many different ways and in a vast country like India, every parts of it has its own unique style of cooking. But this was not about style, rather taste. Instead of doubting their credibility, we thought may be Biriyanis are not their specialty, so we decided to try something else in our next visit. After all so many people who have rated this place so good, cannot be wrong.\n\nIn our next visit, we skipped Biriyanis and with much expectation we sticked to curry items only. But, again we were disappointed. Tried one chicken and one lamb curry, both were very creamy. It seems they are using boiled chicken instead if making tikkas. Cashews and rasins cannot be part of everything. We tried their tandoors and samosas as well, but to be honest, didn’t like either one of it. Tandoor was cooked with onions and peppers and was almost turned into a gravy item. Frozen samosas tastes better than this place.\n\nNot sure, whether I completely avoid this place or may try few other items from their fancy menu in my next visit, to figure out how they are so highly rated. There are plenty of other great Indian restaurants available in Utah who offer much better food, which tatse really good and the prices are also moderate."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SUE5IQTJkMVZ5VVhRemVXTlNiMEZpYmswMWJFRRAB",
            "text": "Great setting, very friendly staff (though you may need to reassure them you want Indian level spicy 🤣). The Rose lassie was a first first for me, but delicious. The samosas were quite good and the mint sauce was extremely refreshing! The chicken biryani was very tender and moist, quite good 🥰 and the naan was fluffy and flavorful"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvMVJrOUJTaTFsTWsxMFJGbE1kbkk0UkVWTVdXYxAB",
            "text": "Wow I can’t describe how delicious this food was. Service was amazing and food came out very quickly. The mango lassi was my favorite, I think the best one I’ve had."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdVoyZlFBEAE",
            "text": "We had a great experience at this Indian restaurant! Despite arriving with a large group of 13 people just before closing time, the staff went above and beyond to accommodate us with a warm and welcoming attitude. Their hospitality was truly commendable, and we never felt rushed, even though it was late.\n\nThe food was fresh and flavorful, with every dish showcasing authentic Indian spices and excellent preparation. It’s rare to find a place that maintains such quality, especially toward the end of the night.\n\nThe only reason for the 4-star rating is that we could sense a slight strain due to the late timing, which is understandable. However, their effort to make us feel comfortable and serve delicious food definitely deserves recognition. We’ll happily return and recommend this restaurant for its great food and accommodating service!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbF9HMUV3EAE",
            "text": "This was our second visit to this location. While out of town, we were going to try somewhere else, but the allure of the aroma, taste, and service we had previously was such that we decided to go back. Once again, we were not disappointed.\n\nWe were greeted quickly, within 30 seconds. We managed to arrive when there wasn't a wait, so we were seated immediately. The server greeted us promptly and with a smile to get out drink orders.\n\nWe ordered a strawberry Lassi, pineapple chicken, and a garlic naan to share. I like spice, my spouse doesn't. We ordered mild, and I asked for some extra spice on the side. That's exactly how it was served. The flavor was spot on and was enough food to feed the both of us with no leftovers.\n\nWe love dining here. The cultural atmosphere with spices from the other side of the world makes for a fantastic dining experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTk0xWXRUalJUT1ZWblpXUkZlWFkyWkRoeFltYxAB",
            "text": "Such cool decor inside! We had three different servers checking on us all the time. Service was insanely fast! I don’t think I’ve ever had food in a sit down restaurant come within 10 minutes of me ordering it! The food was by far the best Indian food I’ve ever had!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLbV93T3F6NUtMS0tREAE",
            "text": "Great Indian food!\nSuper friendly staff.  It was pretty crowded and a bit noisy.\nI would definitely recommend it and I’ll go there again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21waFJIZ3hOa2Q2VTJWd2NtbFpjRzh3ZGpZNE1WRRAB",
            "text": "Very delish! Family style and very filling.  We tried new dishes and of course the garlic naan.  It was so good....I will be back when im in town!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvM05uT2l3RRAB",
            "text": "Great place to eat. Took my family here while on vacation to St. George. Food was decent. The service was excellent. We walked in and we're sat down right away. The waiter was quick to take our order and the wait on the food was not long. All in all a good experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNLWY1c3lJdnRhd2JnEAE",
            "text": "Never had a bad meal here. Step inside and let their painted walls whisk you away to India. This is a great place for a date, family dinner, or out with friends. The food is served family style  and packed with flavor."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeEltSXJBRRAB",
            "text": "We stopped here while passing through St. George on Christmas Day. Glad that they were open. The food was delicious, service was quick and great. Loved their Mushroom Makhani which is something unique and tasty different from other usual curries. Naan was very soft and fresh as well. Loved pickled onion on the side"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRaWVMVXFBRRAB",
            "text": "Red Fort Cuisine came highly recommended by both locals and tourists, so I've had it on my list to try for a while. I finally got the opportunity to give this touted establishment a try.\n\nOur group of 10 was seated immediately, which was mind-blowing considering it was a busy Friday night during peak dining hours. We ordered various spice levels of the Chicken Tikka Masala, Butter Chicken, Chicken Coconut Kurma, Chicken Tandoori, and Lamb Saag, along with butter and garlic naan. The butter chicken was my favorite, and the Tikka Masala was my least favorite. Between the naans, the garlic was the way to go. I didn't notice a dramatic difference between the mild and medium spice levels, so if you like spice, go hot.\n\nThe service was phenomenal from start to finish. From getting us seated quickly to taking our order and taking care of a big party, they provided excellent service. Drinks were kept full, and everyone was extremely helpful. The interior is very cool. There's not a bad seat in the place, and it's got a great vibe.\n\nIt may have been a consequence of overhype, but I wasn't overly impressed with the food or the prices. I thought it was average Indian food, but my entire party loved it. This was a first experience for many, so I concluded that this is the perfect place for people who have never eaten Indian food or who have been anxious to try it. Overall, I thought it was too expensive for what it is, and it's fine, but it's not a place I'm rushing back for. But it's a place you can count on great service and a fun environment to dine in."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuc29YTnF3RRAB",
            "text": "Food was great! I ordered a the shrimp coconut Kurma and I thought it was so delicious. I wish I would have ordered medium spice though. The mild spice is absolutely no spice so don’t be worried if you have no spice tolerance! Everyone at my table was pleased with their meals. The drinks were a separate thing though. Ordered mango lemonade and it tasted like powder and artificial sweetener. Mango lassi wasn’t very cold and also tasted like they just added a mix in for the mango flavor. The other drink was okay but I forget what it was called. It had mint in it."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbHQ2bUZ3EAE",
            "text": "Sadly I have to admit I've never eaten in an Indian restaurant. By word of mouth our group was recommended Red Fort Cuisine of India in St. George. We primarily had the Chicken Makhani (Butter) with Garlic Naan bread. It was absolutely amazing!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMHFlM0NnEAE",
            "text": "Hands down one of the worst Indian food we’ve ever had. Also found hair in the curry. 🍛🤮🤮🤮 DO NOT WASTE UR MONEY HERE. Spent over $40 for two curries, and they were horrible.\n\nI cannot believe it has such high ratings, these ppl must have never had Indian food. 🫣😵\n\nThe meats in the curry we got were so tough dry and disgusting(chicken and lamb) - the curry itself was worse than curry from a jar…. You’re better off going to the store and grab a jar of curry and throw in some meat with it yourself. It’ll cost much less and taste much better.\n\nSo disappointed in the quality and taste - would not recommend and would not recommend to anyone."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxclNXWnlWVkZpUjNBd09FSmhaQzFpWVRoak4xRRAB",
            "text": "This place is good but quantity is not great for the $$$ .. garlic Naan had powder garlic not real garlic..thats a sin !!! Lol\n\nNot ur authentic Indian food but since we r traveling we don't mind ..but if I live here I will be seriously disappointed 😞"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbWRPblJREAE",
            "text": "This was our first trip to Red Fort.  I like how you can order your spice level so everyone gets what they like.  The hot Indian tea was amazing and my husband loved his Indian coffee.  The booths are more family style than intimate, but we enjoyed the art work and the vibe."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKcXNUTmNBEAE",
            "text": "Best Service I've Ever Had!\n\nThe Best Indian Restaurant I've been to!\n\nService is absolutely quick and efficient. The food is one of the best I've ever had and I would definitely be back.\n\nI ordered Chicken Korma, but this dish was different than most I've had. Instead of adding cashew nuts and raisins there was a unique twiest using coconut. TASTED AMAZING!\n\nPlease come to this place you won't be disappointed.\n\nHIGHLY RECOMMEND!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeE1VVTNORVEwY0ZwWlYzWnlTSGxoTFdoVFdHYxAB",
            "text": "Best Indian I have had.  So many choices.  We had the Tandori Chicken and the vegetarian Kofka."
        }
    ],
    "reviews_count": 68
}