{
    "name": "RUSTY CRAB DADDY",
    "place_id": "ChIJ-QYHyclFyoARYSbdOo4FWdY",
    "grid": "SI1",
    "address": "932 S Bluff St, St. George, UT 84770, USA",
    "rating": 4.8,
    "user_ratings_total": 1571,
    "phone_number": "(435) 274-2777",
    "reviews": [
        {
            "date": "수정일: 1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dGRMZ2dnRRAB",
            "text": "We ate at Rusty Crab Daddy and had such a great experience! Our waitress, Spasa, went above and beyond to make sure everything was perfect. The food was delicious, and her friendly, attentive service made our visit even better. Highly recommend!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WTVJ6SXdVVEZTVGs4MVpHcFlkMW8wVFZOTGMyYxAB",
            "text": "Spasa was great! We enjoyed her service and she was sooo kind!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWNGVHbDJZakZ4TFc5bGFUQjVObVJUVDBsWVRIYxAB",
            "text": "It's a great flavor explosion! 💥 A must hit for its location!\n\nWhen compared to other seafood in the nation or country obviously because it's so far inland it's not a true 5 however for its limitations on freshness due to geography it's a fantastic option!  A 5 within those parameters.\n\nRemember your seafood isn't directly from the ocean so anyone from a coast will probably be disappointed with the frozen seafood but the quality of seafood, amount, size and especially the flavor is fantastic!\n\nI'd definitely suggest to get the 'daddy' seasoning where they mix all the seasonings together.\n\nThe shrimp, mussels and clams I can attest are great!  I'd lean to a pound of shrimp 🦐 🍤. If you're on the fence about freshness of the clams and mussels. But truthfully I think with the seasoning you'll be extremely happy with any of those options. I didn't try and other seafood.\n\nThe service was great!  Location is above average and is clean."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psMlIyRnVkRXB0Wm1oNGRuWXRWREpNU0ZOMU0wRRAB",
            "text": "Spasa is a great server! Super attentive and great with recommendations! She was awesome!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GSGNrVjROR3BaWVZaUFNqUjJZek10VlRsR1NIYxAB",
            "text": "Spasa is amazing! The food is good too! 🏜️🏁"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SU1ZuRmxVbTFQWkU5WE5VVnZlbHBNTUhOcVNHYxAB",
            "text": "Spasa was the best server ever! She was so fast and answered all our questions. Thank you Spasa for being amazing"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkR1ptdGhaRmRYT1dscVNFaHBSamRJUjBkZlpuYxAB",
            "text": "The food was served fast and hot. Our server Spasa was wonderful. One of our dishes was not as expected but our server made it right!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNdGJEQkdZM0Z2V1VobFIyeGpTazkzYVd0WGVsRRAB",
            "text": "Spasa was the best, will definitely be coming back."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WTWVsOU1ZbkZJU1VSVVF5MTZTbDlwUjJwU2RVRRAB",
            "text": "Great food, but the service is always amazing. Passy is the sweetest, most attentive server !"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sd0xXbFVVRFpPVjFkb01VSjRWMWM1TVRsNGFuYxAB",
            "text": "This place always has the best boils! The crab daddy special sauce with medium spice is the way to go! Spasa was a great waitress. She made our celebratory night extra special."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcVprVkhjSGhsWkU1cU5GQmlkbFJQVldGSFJXYxAB",
            "text": "Great service! Spasa was an excellent waiter :)"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwM1VHOXJObVpsYkVoQloxODNXV3g0TTBsNVpWRRAB",
            "text": "Amazing it was like a fast food joint but for seafood, GOOD seafood. We got the family four deal and split it between four adults plus half dozen oysters and half dozen fried oysters idk which was better but I've been thinking about them all month 😂😭"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoalNFb3llbTQxUzFFMFdYVkxWa2g2YVVkbE9HYxAB",
            "text": "Seasoned perfectly. So yummy and buttery. Staff is very helpful. They brought our order pretty quick too. We love this place."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5MFNqaHJXRWREU1ZVMVMzZEpMV3RpVjFGMWRFRRAB",
            "text": "Spasa has been are server the last couple times we have come down for dinner, we very much enjoy her cheerful personality and kindness. We will  continue to come back bc of it. The food is always great."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sak9EVmtlbGc0WmpONVdsbGFVMVZVT0hKcWNVRRAB",
            "text": "We had a great time, what a fun new experience and the was delicious. We had the shrimp special and added an extra pound of shrimp and crab legs. We definitely left full! We celebrated a birthday with their delicious Beignets, which is a must! Loved our server Spasa!!! Super fun!!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RWMwdEJhRlYzTVhCWFEzZzRjbGxLYW1NNVZYYxAB",
            "text": "Food is amazing and we stopped here on way back from Bryce after stopping here on the way in.\n\nWhat really made this second meal was Spasa who was amazing in all aspects. Excellent service and took such good care of all of us"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOb1VuaE1aR0ZQTUZOc1NrRktNRWxETmt4V1RXYxAB",
            "text": "Spasa was absolutely amazing! Even with how busy it was and how much she had going on, she did not fail to absolutely impress me and my husband. She was so kind and helpful and made sure we always had refilled drinks and wet wipes and anything else we needed. She was so awesome even the table in front of us couldn't stop talking about it either. For my first time there i was very impressed and had an amazing time."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNVFtNTBTMnN5VGtKa1REZElSVjlhTjNwU05HYxAB",
            "text": "This is my family's favorite place to enjoy good food, our server Spasa is always so attentive and goes above and beyond everytime.\n\nThank You"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkcWFXWXRTVlUxVm1aTE5GZzFOR3BOT0ROdk5VRRAB",
            "text": "Oh my goodness everything is so amazing when I say from beginning to end Ladies and Gents!!!  The food omg!!! If you want Cajun crab Boil 🦀 😋 😍 this is the place eve ryone is so friendly and they go a-bove and beyond !!!!! Just stop in you won't regret it!! Love you Spasa you are such an awesome waiter and treated with such kindness and just an amazing woman.  Thank you"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4elYybERjWGRMWVdOcVZYWkJSRzlhWjBGQ1FtYxAB",
            "text": "I was pleasantly surprised. Really enjoyed everything brought to the table.  My fried shrimp porboy was filled to the hilt with shrimp. Very filling. I will be back"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZM2JrWjFkREZYY0ZCVFpFa3dUVkZWVkcwMWMwRRAB",
            "text": "Spasm was amazing!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4SlRGZExZMmRxVTBKNFJ6WnlhVGs1ZDJaa2MyYxAB",
            "text": "Spasa was AMAZING! Great service, great smile, great attitude…She deserves a raise - was very accommodating with our platter request and had good recommendations - checked in, got our waters filled speedily, etc - all done with a smile. THANK YOU for great customer service and a yummy meal!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcmRrdHZUa05YVGpCc1l6SXlPV1ZzYjFOMlJIYxAB",
            "text": "Food was soooooo goooood!! Sbasa our server was AMAZING there are those few times when you get a great server that goes far and beyond - she is and it will make people want to return again and again for the exceptional customer service!  She deserves a raise! Thank you so  much!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsa05VMUROVFZxTjE5WFlqQnpjbXd0VXpaWVNGRRAB",
            "text": "Incredible experience from start to finish. Our server Spasa so friendly and helpful!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvemNsTnBTbWRMVlVFMlJWWnJlWGcyUkZKbVNuYxAB",
            "text": "Best food love the king crab"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWb1pVUk9OV1ZsTkhFeWQyMU9Va3RLVjBrME1sRRAB",
            "text": "We used to come here once a week and we love this place. The food is amazing, but today Spasa surprised us with the service. It was incredible. We'll love how she treated us. She's our favorite waitress because her service is wonderful and she's very attentive. We love how Spasa treats us."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200eWJWWk1lbUoyVFZCcFowYzJiR04yUjJabWIxRRAB",
            "text": "Thank you Spasa! The Rusty Crab Daddy food was delicious and this service was excellent! We will definitely be returning. Great customer service!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWRU5IQkVZMjAwVTFkNE5qWm1jbWs0TTFNeVprRRAB",
            "text": "Spasa was AMAZING - super helpful. Attentive!  We’ll be back❤️"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kU1VXd3RjM2huUW5oNmJrc3djM1ZCVWtZd2MyYxAB",
            "text": "Spasa provided excellent service and food was great!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ONE5qQnpNREJZUVdWTGJYSTFZV1owUjJaa01sRRAB",
            "text": "Great food! Super tasty! We loved getting the baskets! The pasta also tasted great! Thank you very much!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SbVFsUllYelZPWVRaclJYZHRjVUpHU1RZNGFsRRAB",
            "text": "We loved our visit to Rusty Crab Daddy's when we were in St. George. The seafood boil was delicious and large enough that we couldn't finish! Will definitely return when in town."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKQ1puZHFOVXN3ZUZOR1JGSnFRVmwwVFd4T05FRRAB",
            "text": "This is what this area needs. The food was excellent, been waiting for a Cajun joint for a hot minute. If you get Spasa, she's an absolute delight."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odldFdGZVMmd0TkROT1VuUk9hM1JqVTFSNFgwRRAB",
            "text": "I wasn't too sure about sea food in Utah. It was however,  some of the best I have had! I had the shrimp, oysters and flounder basket with fries. SO good! Waitress was super!  Food came out quickly, and was hot! Delicious! Now a St George favorite!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFNFppMDNZMDl6ZGpGZlUwMHhha001Ym5oT1dWRRAB",
            "text": "Food was amazing and Spasa was incredible as our server. We appreciate her thoroughness in giving us custom options on the menu and her going out of her way to give us a great experience. Great attitude, great gal."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210MlMyMU1URTFPTnpKVllXMWpaV2RDYjI5cFoyYxAB",
            "text": "Spasa was amazing waitress. She made the visit the best ever. The food was fantastic too"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WblVrMUNkRVJaZUdGdldXSlRUQzEyVUhONVEwRRAB",
            "text": "I live in the south but when I tell you that none of these Cajun restaurants down here can compete, you better believe me! The seasoning is like nothing I've tasted and is now going to be on my to do list every time go to Vegas. Angie was our server and she was fantastic. Gonna ask for Angie every time! The hour and forty-five minute scenic drive is worth it! I HIGHLY recommend this place. You will NOT be disappointed!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFeGRFUmZVRGs0WkVReVUzVXpibWhMU0ZSaWExRRAB",
            "text": "The food was amazing. I got the shrimp boil and each bite was infused with buttery goodness. Spasa waited on our family and her care and service was above and beyond. She made sure our birthday boy was spoiled  and treated, our food was served hot and drinks were filled and refilled, with a drink to go as well.\nShe was thoughtful and made sure we would have everything we would need to indulge in our leftovers which she also packaged up for us in bags that could be reboiled the next day.\nShe provided customer service unmatched.\nFive stars across the board."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxeU5sZDBMVFIyYzFWc1RtVlBWMGhwY2pSSE1uYxAB",
            "text": "The gumbo was some of the best I have had. My husband loved the shrimp po boy sandwich as well. Great lunch stop."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214d2NqSllObFl3TUdNd1owNUxZMlJqTFhvelpYYxAB",
            "text": "Spasa was our server and we had the best time, wonderful service and wonderful food. 10/10"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poaGJtZFJkRGRhWTNVd09HZ3lSamw1VlhWNk1YYxAB",
            "text": "Rusty crab daddy’s is my favorite restaurant. We had great food tonight and the service from spasa was above and beyond. 10/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdVRubEVjRzVYYjBnNU5ESXhkSE5WZFU1Mk5uYxAB",
            "text": "Once again back in St George and out trying new places. My wife and the rest of the group wanted seafood and this place has it all.\nWhen we arrived the lot was pretty full and we got the last 2 spots.\nOnce we walked in we were greeted right away and a table was available. We were seated promptly. The table and restaurant were clean and comfortable it wasn't too noisy even though it was busy.\nOur server Bryden came over right away and got our drinks going. Shortly after we placed our orders. There was some confusion with wanting to sub out shrimp due to a shrimp allergy but we worked it out. It did seem off that you couldn't sub something due to an allergy but what can you do.\nI'm not a seafood person so I got some chicken and fries. It was ok but this isn't a chicken joint so I wasn't expecting perfection. The huge boils came out and were massive. There was plenty for everyone and nothing was left behind. Everyone really enjoyed all the different morsels and I don't think much was left.\nOverall the service was good as well as the food. We would definitely visit again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNWFYbE9nEAE",
            "text": "The food is fantastic- I got a shrimp po boy, potato fries, and calamari.  The shrimp and batter was fantastic, and the calamari was the size of onion rings!  Everything was so good, and my waitress (Spasa) was so sweet and very attentive in all the best ways.  She kept apologizing for the restaurant being understaffed (there were only two waitresses at lunch time), but I not once felt it.  I live 50 miles away and will drive down again just to come here.  Well done!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3ME9DX1ZnEAE",
            "text": "Great restaurant.\n\nThe service is quick. The servers were helpful and kept checking on us. The food portions are large and the flavors are good. We got the shrimp basket, they were pretty large, butterflied, and the batter was also good especially on the fried pickles.\n\nWould come back.\n\nThe bathroom is not so good though, wasn't clean."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oRFVWWjJWV1pmUzNWWVluTlZUMll4YkhrMFZuYxAB",
            "text": "We was skeptical of a \"Southern Louisiana Style\" cooking in the St. George area of Utah, but being from Indiana we like to try all new things.  Just wow, I wish this place was close to home.  I had the Snowcrab Boil bag and it was so good.  My family of 4 left there stuffed with some amazing food.  The service was very friends as well, we had Bryan that day and he was awesome.  He was very helpful in helping me pick what I wanted.  If you are in the area and 2nd guessing rather or not this place is any good, just stop and try it out.  You'll be glad you did."
        },
        {
            "date": "수정일: 3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWM1J6VXRaVFprTW1Nd2FqUmlOMjl1YzIxWVJtYxAB",
            "text": "Excelente lugar . Servicio excepcional . Nuestras meseras Canyon  y Spasa\nfueron insuperables y muy amables .!!!\n\nLos mariscos son frescos  precio de wow.!!  . !\nRegresare siempre ! Mi lugar favorito en Snt  George . Utah\n\nExcellent place. Exceptional service. Our waitresses, Cañón and Spasa,\nwere unbeatable and very friendly!\n\nThe seafood is fresh and the price is amazing!\nI'll always come back! My favorite place in St. George, Utah."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21veFNsaFNNbGhZVERCS0xYVlZOa05XT1VkdVltYxAB",
            "text": "This is my second time coming here and we had a blast. Very accommodating for a table of 10, the food is amazing, atmosphere is great,  and they bring birthday beignets! Look at the size of those crawfish!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toU1ZIVnpVbmMwYW1VemRWWlllV1pST1RoSmRFRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\n\nWe had such a fantastic experience here! The food was absolutely amazing, so fresh and delicious. The atmosphere was perfect for a fun night out. Our server, Holly, took such great care of us and made everything easy and enjoyable. She even made sure knew how to open our crawfish, as it was our first time.\nCandy/Kristi was also incredibly kind and helpful, especially when our car broke down, she went out of her way to make sure we were okay. Outstanding service all around. Highly recommend this place!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSVNYVkhSalpzUmxoSmF5MUJjR3B1ZDIwNVgyYxAB",
            "text": "AMAZING! This was our first time here, Holly was our server and she was so sweet and accommodating! Definitely recommend getting the Crab Daddy’s Special seasoning, so so yummy! We will definitely be coming back 😋"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJeWJ1R213RRAB",
            "text": "We were on vacation in St. George and it was my brother’s idea to try this place. We loved it! Fun decor and atmosphere. Our waiter was really nice and gave good recommendations. We tried the gumbo and it was way good and a decent size. They have lunch specials that were reasonably priced. I got the fried tilapia basket off the lunch menu. It came with 4 pieces that were a decent size. All baskets come with hush puppies and a choice of of another side. I got Cajun fries with mine. The tilapia was crispy and delicious. They gave me a ton of fries and I also enjoyed the hush puppies. The meal was very filling. I will for sure be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKVlNtd3ROekpoU0dablpqZFdNMXA0Y0V4S2JWRRAB",
            "text": "It is so amazing here. The food is always so delicious, all the servers and hostesses are so kind and helpful. Special shout out to Holly, she was a wonderful server. The atmosphere here is also super nice. It never feels very cramped, nice and open."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oRk1sQmxTaTFZVGs5Q2FtMWpSMjQzTUZGcmVuYxAB",
            "text": "Food was great, with good sized portions. Our server, Spasa was the best! We will definitely be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKUGx6NV9EMTlHYXZ3RRAB",
            "text": "The first time we dined here was about three months ago, we decided to stop in again while traveling through St. George. Definitely a wise decision! Since it was only my wife and I, we ordered a smaller seafood boil than last time. Our choice included Cajun sausage, corn on the cob, headless shrimp, Alaskan crab and Snow crab. We chose the medium hot Cajun mixed spices for the boil juice. We also picked up three lbs. of mud bugs to take with us. Our Server, Spasa, took excellent care of us and helped us with our choices. There is something about  digging into your meal with your bare hands, definitely a finger licking good experience! I recommend wearing the provided bib, you'll need it. They also provide plastic gloves... don't use them, you are allowed to lick your fingers!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdXZtVjFBRRAB",
            "text": "Our first time visiting here and we plan to go back. Portions are huge and everything we had was great (except for coleslaw,  lacking in flavor and too wet). Surprised by the size of the catfish fillet, I preferred the baked better than fried (husband liked the fried better). Shrimp po' boy sandwich was massive and oh so good. Kids meal options were great and well received by a 6 y/o. Looking forward to trying the boil next time."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdXZqMlFnEAE",
            "text": "A very good dinner experience we had at this joint offering a wide range of seafood menu Louisiana style, awesome plates especially the Gumbo, Seafood mix plates, Shrimp Fried Rice and a magically created Garlic Butter Sauce that makes every dish on the menu so good to the taste!!!, If you want to have a nice seafood dinner in a cozy and family atmosphere with great service, this is the place to be!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4c1pqVkVWWGh4ZFZaalZVRnpjbk5UWDJsdGVVRRAB",
            "text": "We had our very first visit to Rusty Crab Daddy as a family, and it was nothing short of amazing! From the moment we walked in, we were welcomed with warm smiles and an inviting, clean atmosphere. But the real highlight of our visit was our server, Spasa. She was absolutely amazing, kind, attentive, and full of positive energy. She went above and beyond to make sure we had everything we needed and truly made our first experience a memorable one.\n\nEvery staff member we encountered was friendly, but Spasa stood out in the best way. Her service made us feel right at home and left a lasting impression on all of us. We’ll definitely be back, and we’ll be asking for Spasa again!\n\nIf you’re thinking about visiting Rusty Crab Daddy, don’t hesitate. Amazing food, amazing service, and an overall amazing experience!\n\n10/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvNVVGQjVkSG8wTVd4c1EwMHhSekJRVG01cmNsRRAB",
            "text": "Dylan was an amazing server. Food was amazing got the platter to share with my brother and still had plenty to take home later"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNROTVlUHB3RRAB",
            "text": "Food was AMAZING, mildly short wait. Food was delicious, we got the $150 family meal that says it serves 3-4 but comfortably served all 6 of us with leftovers. Food was for sure worth the $$$. At the end we got a complimentary little donut-powered sugar thing that was great for our birthday."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aS1VHNUtiMjlhYzI5eVJUazNNRmh2VmtsakxYYxAB",
            "text": "We came here for a date night, and it did not disappoint! I’m not a seafood person at all, but my husband absolutely is. I ordered the chicken basket, and he went all out with the lobster tail and snow crab. Everything was delicious—perfectly cooked and full of flavor.\n\nOur waitress, Krista, was incredible. She was patient, friendly, and really knew the menu. She took the time to walk us through the options we had questions about and even showed us the proper way to eat crab, which made the experience even more fun.\n\nWe had such a great time and will absolutely be coming back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dE43NnpnRRAB",
            "text": "Our first time here with our excellent server Tracy, was really fun and very delicious!\nOur hostess, Rose, seated us in a booth with a large table that the 4 of us needed for our drinks and GIANT SEAFOOD PLATTER! It included every kind of seafood on the menu and was excellently steamed and served piping hot!\nWe went back the next day to try the beignets!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbGFmdHFnRRAB",
            "text": "Service was super great! We got seated very quickly and they were super kind throughout our meal and questions we had. Food was super good as well! The hushpuppies were amazing and I loved the way the fish was fried. Not too heavy and oily which was very nice. Definitely will be back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmczVqLTd3RRAB",
            "text": "Fantastic! Great experience, great service and a great atmosphere. Haven't seen my son-in-law from Louisiana that happy in a long time!\nWe really loved having Spasa serve us, she was wonderful.\nWe'll be back"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OZlpITnpSaTB3Ym1sYWJXTlBkVXRJZEVONlQxRRAB",
            "text": "We love eating at the rusty crab daddy! We come here as often as possible, and although we’ve had great service here in the past, tonight was even better thanks to our excellent server Spasa! She was kind, considerate, helpful, and overall made the experience absolutely wonderful. Thanks Spasa and Rusty Crab Daddy team!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVM2VrWkliWFZqUVd4WmRXeEtaR28zYlhKaGVrRRAB",
            "text": "My husband and I were visiting from Ohio and stopped in for some crab legs.  Our server Spasa came to our table immediately and asked us for drink order and gave a brief overview of the restaurant.  The food was great but in my opinion Spasa made our dining experience!  She seemed to walk circles around the other server and did it all with a smile on her face. I highly suggest this restaurant and if possible ask for Spasa as your server."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214MWEyWkpPVmxPUlc5MU1FbEthMXBDVW1ndFZWRRAB",
            "text": "We waited over ten minutes after being seated before anyone acknowledged us. When my friend asked about the Jambalaya pasta, the server candidly said it wasn’t very good. We should have left right then, but my friend ordered the pasta anyway.  I ordered a pound of snow crab, and when it arrived, I requested drawn butter. What was brought out was clearly not butter. Upon asking for clarification, the server confirmed it was margarine — as was the “butter garlic” sauce listed on the menu. I explained that I’m sensitive to certain ingredients in margarine, and he offered to bring real butter for an additional $2. When it arrived several minutes later, it tasted rancid, and I chose not to eat any more of my meal. The server reassured me that, despite the taste, the butter was “totally fine” after checking with the manager. Still, I didn’t feel comfortable continuing. Unfortunately, I became quite ill the following day with gastrointestinal symptoms. At $42 per pound, I expect real butter as advertised. I will not be returning."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBanNUMVJ3EAE",
            "text": "Looking for decent seafood to celebrate grand daughters birthday. We were pleasantly surprised by this restaurant. Place was clean and our Server, Shantelle, was pleasantly attentive. We had a party of seven and were seated with no waiting. We ordered the House Platter Boil, it was loaded with a full variety of Cajun grub and fed us all with plenty left over. Ask for Shantelle when you get there, she will help you with choosing an enjoyable meal experience."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ZzdMV2hnRRAB",
            "text": "Spasa was WONDERFUL! So attentive and accommodating! Visited our table many times during the meal to make sure everything was OK. Extra drinks when we’re ready as well as better in a new bucket. This place is amazing and we will be back often! Thank you so much."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WZlJXTkdWVGhpZFZkNlZrbEdPRlpLY0U1d1gxRRAB",
            "text": "My husband and I decided to try this place for our anniversary. We loved it! Good food and amazing service. We shared a meal and it was enough to feed both of us. Our server was Spasa and she was such a sweet heart. We enjoyed everything they had to offer. We definitely recommend it if you are a lover of seafood."
        }
    ],
    "reviews_count": 67
}