{
    "name": "Pica Rica BBQ",
    "place_id": "ChIJ7e7UE8lFyoARrr9IwqJQajI",
    "grid": "SI1",
    "address": "25 N Main St, St. George, UT 84770, USA",
    "rating": 4.6,
    "user_ratings_total": 1122,
    "phone_number": "(435) 200-4420",
    "reviews": [
        {
            "date": "12시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCQ1RtRm9hRlZJZG1kdWFuQlZiMUp5UVhZMFNWRRAB",
            "text": "I had total food envy.... didn't get guacamole and chips....my tacos were delicious but that guacamole looked mouthwatering"
        },
        {
            "date": "13시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMGFsWkhRbFpUWkROTVZrOWlWbFppV1hOYVJsRRAB",
            "text": "I really hate leaving such a harsh review, but Pico Rica’s prices are just too high for what you get. I stopped by during normal lunch hours, a little later in the lunch hour, but still very much lunchtime, and the place was completely empty, which honestly made sense once I saw the prices.\n\nI ordered two tacos that were normal-sized but $7 each, for a total of $14. The tacos were okay, but very salty and a bit too juicy, so they fell apart and made a mess. I’d call them nominal overall, not terrible, but nothing special either.\n\nWhat really got me was the cost of sides. I would’ve liked some chips and salsa or queso, but they wanted $9 just for chips and queso. If I had ordered that along with my two tacos, it would have been $23 (before tax) for one single lunch. That’s just too steep.\n\nLiving in the Southwest, there’s no shortage of Mexican restaurants offering more authentic flavors, larger portions, and much better value. I wanted to like this place, but between the pricing and the mediocre experience, I just can’t justify coming back."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wNU1qSkpNMk5XWXpVelVrcGhlbTA0Y1hadWVVRRAB",
            "text": "Amazing pulled pork!! Bbq sauce was the perfect amount of sweet,smoke, savory. The barbacoa taco was one of the best tacos we’ve ever had!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wNVJWYzRWRUp2Y2tWMlNsWTFhVVZsVVc5NFZsRRAB",
            "text": "Really good food! Definitely recommend the brisket!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210M1RVWTNXV1JNWlU0NE1XdHBXSE01YmtGbmVGRRAB",
            "text": "Best BBQ I've had! Brisket was great, the Texas Twinke is a must have! We decided to sit outside...they had the smokers running out back. Great atmosphere."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGUWRHTkViVE55V2kwMmMwNXdhelpEUmxocGQzYxAB",
            "text": "Expensive food & small small portions!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aYWJqTkZhRzlEZERCWGVUbGZYMFpaWkdJNFNFRRAB",
            "text": "Great place. You can build your own BBQ plate, we chose brisket, sausage, esquites, slaw and then it came with pickles and sauces. Super tasty. They sell out when they sell out so you know it’s all fresh."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kc1JUWlhUV3cxV1c5SFNrUnFXREo2WlZkT1FsRRAB",
            "text": "Way too overpriced. Food is okay. Ribs were the best part. I had the barbacoa taco that is nothing more than shredded pot roast in a deep fried tortilla. Heartburn city. They only have soda in bottles and cans. They overcharge for soda but I guess it solves the free refill problems too. A 6-8oz of rice is $6. RICE! Okay. I’m done. Won’t be back."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205alUzVjNNbE53Y1hCcGFXeEpRbVkwVDNKWk4wRRAB",
            "text": "If you're visiting St. George, you have to stop here for lunch or dinner. The prices were great and the food was plenty! The brisket was amazing. We got the brisket esquites and absolutely do not regret it. It was a highlight of the dinner."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoNmN6QTBjSFJhYm5NNVJtczRkMkYwTkVaV1JHYxAB",
            "text": "Would have given a higher rating but they had run out of numerous things by 5 and our group had to change what they wanted.  Brisket was very tender and delicious.  Mac and cheese very flavorful.  Son in law really liked the smoked turkey."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGSGNWTXhRMUJXWlVwdFMyUnhNMFpqTmpocFprRRAB",
            "text": "The BEST brisket I’ve ever had!!  Love the food. Macaroni & Cheese Balls appetizer is incredible. Comfortable. Excellent."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNlYybDRaMjVCVTBsNVkydHpTM3B0WWxsSWJtYxAB",
            "text": "“By far the best BBQ place around town! The ribs and brisket were so delicious..!!\n\n💯% Recommend to try."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kblptZExTVzVGUXpOelNUUkJYME5xTmxoZlpXYxAB",
            "text": "One of the best bbq places I’ve been to. The mixed berry cobbler is mmmmmm"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUWFsaG1OMFIwYlZOcE1GRm5VR1pFV0dWMVpsRRAB",
            "text": "Check it out! It’s exactly what your palette needs."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wb2JEVnZWVTlMTVRoblduaFpUR2hFT0RNNFpFRRAB",
            "text": "Easy to pay at the register once you ordered your food staff was friendly and helpful and easy to order.What we wanted"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxT1VsZHNSVTEyWTJSNE1EYzBSekpYUzB4NlIwRRAB",
            "text": "The manager was absolutely delightful and so helpful! Definitely have to order the breakfast taco!! So delicious!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sU1ZuazBVa3MyU2xWa1pUWnZWMUJVTWtzd2JXYxAB",
            "text": "As a big fan of BBQ, I was looking forward to eating here. We went on a Tuesday and unfortunately, they only serve tacos on Tuesdays. There is nothing on the website that indicates this, and I didn't see that information on IG either. This past Tuesday was the last day of our St George vacation, so I had no other opportunity to come back to try the full menu.\n\nThat being said, the barbacoa taco was fantastic. The chicken taco was a sloppy, watery mess that had more lettuce than chicken.\n\nObviously this place has fantastic reviews, so I will try it again next time i'm in southern utah and hopefully I can update my review then."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5R2FubFpTazkwVm5abFFqSnNhRFpGVFVKR00yYxAB",
            "text": "Best chopped brisket sandwich I’ve had! The bun was perfectly toasted and the house BBQ sauce was delicious!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xcVZVc3dZbEp2WkhWUVMyWkdTMDFFYlMxMU9IYxAB",
            "text": "Visiting from Georgia, known for BBQ and we’re blown away by this place! Huge portions, excellent quality, great service!"
        },
        {
            "date": "1달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVlJXbHRXbkZMVFU5bGRFeG5lbVZWZUhGTFJtYxAB",
            "text": "Excelente. Comida deliciosa, um pouco apimentada, vc chega pega uma fila rápida e escolhe o q deseja e é colocada na sua frente as carnes e guarnições, td mto limpo e mesmo não falando fluentemente o inglês, eles tentam ajudar na escolha e o prato é mto bem servido. Recomendo"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwUFkzTnVaRFJCWTBwcllrcE1aWGhRWlRnM09YYxAB",
            "text": "This is not your run of the mill bbq joint.\n\nThe moment i walked in i was immersed, in this small town, homemade bbq spot. I mentioned to the cook and i assume the manager, that this was my first time. They provided me with a slice of their fresh brisket. It just fell apart in my mouth, it was sublimely perfect.\n\nI ordered the texas trinity platter with 3 meats and mac n cheese for a side. Im not a mac n cheese guy and theirs just blew me out of the water. So so good. All of it. The house bbq sauce is to die for, i will definitely be returning. With friends.\n\nThanks yall so much. By far the best barbeque in the southern utah area."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psYUxXczJaVWM0UzJVNGVUaERPRkk1ZUhCYVFXYxAB",
            "text": "We were told by locals that THIS is the place for brisket. We were misinformed. Brisket sandwich was dry and sparse. Sandwich, taco and 2 sides for $40 was way overpriced.\n\nAnd the music was horrendous.\n\nStaff very kind but the ordering process is super confusing for a first timer. Bummer. Was hoping for so much better."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Od2RURnZZMkl6VnpsUVZXeDVVRlZxUkdOa2JrRRAB",
            "text": "Best smoked meats in the entire  region.  I prefer them over several texas smoked bbq houses, hands down."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wMlUzVkpVeTF5UVhkeGJrVkJUa1J0TmxCSE5uYxAB",
            "text": "Someone mentioned Franklin’s, I go with Micklethwait’s as a comparison. The Briskets bark, smoke ring and rendering is top notch.\nOnly two things held me back from a five.\nThe brisket was a little dry and not having baked beans. The potato salad has a little bite to it and personal tastes would put a dab of yellow mustard in it. Mac-N-Cheese way very Good. Staff very helpful. Thought the decor was a little industrial leanings. Accountant won’t be happy with the tab but will just have to get over it. Worth every penny. Complements to the Pit Master."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUVltZDJNMmhtTTBWdWREUmZZa2RsUzNkQlRuYxAB",
            "text": "Second time eating at Pica Rica and just amazing. It’s not just great BBQ- you can tell they take pride in it all. The homemade tortillas are sooo much better than the serving white bread or rolls. The sauces are all amazing and the sides do not disappoint. Finally, I had the fish taco (from the daily features menu) and it was a huge portion of perfectly breaded fish. Honestly haven’t such a good piece of fried fish since I was in Maine!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TE9WaHVObTFzTTFGelUzSlZURkY1VVUweWQxRRAB",
            "text": "They were out of a couple meats when we went. It was fine but didn’t live up to the hype for the price."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGSE5sOU9MVEEwV0hwbU1YQnlkazB4T0VVeFVuYxAB",
            "text": "Best brisket I’ve ever had! Try a dinosaur bone; OMG! The pork ribs are fantastic here I just don’t like pork ribs personally but the beef ribs are to die for!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cFpVOXJOakpxWlZJd1RIWnRWa0o1UVVKb2RXYxAB",
            "text": "Amazing BBQ! Amazing people! This is our first time at Pica Rica but IT WILL NOT BE OUR LAST! We have a new go-to restaurant in St George. Thank you Pica Rica!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRk1IRXlVVUo0V0c1eE5GQmlOelZLY0V0RWNFRRAB",
            "text": "The food is delicious and the customer service was really great! Love it!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cVIwRnNNakEwTldoMlZGbExSSEoxZFVaSE1rRRAB",
            "text": "Best BBQ in Utah easily… probably the whole Western US. I lived in Memphis. This place is unreal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkUFpYTnRXVGxqVlRKME5WVlZlWEZEY2xOSFdrRRAB",
            "text": "Skip taco Tuesday, we were the only ones here when we walked in for lunch in the place. We waited 15 minutes for two tacos, the chips and queso were good, but the fish taco didn’t come out until after we had completed our meal, and I had to go ask for it, while it sat and got cold on the counter."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVU1VazJlWEptVVhsbVFXMUxSVWhPVUhSTGRrRRAB",
            "text": "We went here for a late lunch on a Sunday afternoon and it was outstanding.  We arrived about 3pm and they close at 4 on Sunday. There were four of us so we ordered the Smoke Show which was supposed to feed 4-5 people.. It was ribs, brisket, sausage and pulled pork. They were out of the pulled pork so we got extra ribs. We choose mac n cheese, elotes ( Mexican corn) and coleslaw  for our sides. The meats are all so delicious that my mouth is watering just thinking about them. They had 3 different sauces to choose from. The Mac was very good, the elotes outstanding and the coleslaw average. They were out of tortillas so they offered us potato rolls which were sublime filled with brisket and sauce. The portions were generous, we had leftovers. It was my birthday lunch and my husband snagged the last piece of chocolate and the last piece of vanilla cake for us to take home. The chocolate cake is fudgy madness and the vanilla had a delicious custard filling and whipped cream frosting. Both were fantastic.  I can't wait to try everything on the menu. Go get yours!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WVlNESlVlVFUyUmpNeFQzQmlkRVE0V1hsNlMxRRAB",
            "text": "Tasty BBQ ribs and brisket. This Vegas local was impressed"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210a2FUZFlPVzVmVW1aWVFYTXdZbXQyTFVaWlNXYxAB",
            "text": "A MUST eat in St George. Do whatever you can and come a bit early cuz they run out of food. Phenomenal"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOVWNFWjZTbkZ6ZERCaE9EY3hNeTFvV1RsQ09VRRAB",
            "text": "The Double X experience is 🤤"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oQmF6bGxObmt0WkVRd2R6aHlNVloyVW1WaU5rRRAB",
            "text": "This place is legit. I’m here on a work trip from Texas and this is as authentic as you can get. Up there with Truth BBQ and Coopers. Olivia and Maria were super cool and helped out. Definitely come eat the brisket, extra fatty, burnt ends."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaNV83N2ZREAE",
            "text": "One of the best places in town to get brisket! I have never ordered anything here that wasn't delicious. A bit on the pricey end, but worth it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGb1FrMHdTMWc1WDNSR1VGZHZaWFZvTnpJMmNsRRAB",
            "text": "Got the breakfast taco, the brisket was incredible. Really thick and tender. Went during lunch time it was a lot less crowded. There were less menu options at this time, but any food item here is worth it"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vdE1rTnZiVTFwYmpkR1VYUnFWVkJVYW5aMmMzYxAB",
            "text": "3 stars simply for the price. Its so good but way too expensive for what it is."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WdllYUkNlUzFxZVhJNGRYRkpYMUYwTlMxVFFYYxAB",
            "text": "Straight 🔥 if you’re reading this review, STOP 🛑 and go get some meat 🔥get the brisket pulled pork and smoked chicken"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWVoybGtMV2hDVlc5SWJHVkdaMWRRWW0xTk4yYxAB",
            "text": "What are you doing with your life if you aren’t here eating some of the most incredible Texas-style smoked meats outside of the Lone Star State! This is a can’t miss spot of BBQ Nirvana in St. George, Utah. We followed the Texas Monthly BBQ Trail into the #7 spot outside of Texas. The sliced brisket was perfectly smoked and tender. We loved the Mole BBQ sauce with it. Serrano and Cheddar Sausage had a great flavor and snap. Burnt ends were just right. Don’t pass on their legendary smoked and then fried Chicken Sandwich or the Philly Cheese Steak with White Queso dipping sauce🤯🤯🤯! Service was phenomenal and we can’t wait to go back. What a meal!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJMlU2c0hPNzdmUmVREAE",
            "text": "Food: 10/10\n⭐️Service: Great, but they run out of food!\n⭐️Atmosphere: clean, chill, comfortable\n⭐️Value: worth the wait, get there early\n\nIf you’re rolling through St. George and craving some seriously good BBQ, you’ve gotta check out Pica Rica! Pro tip: get there early! We made the mistake of showing up around 2pm on a Sunday and they had just run out of most of the meats—heartbreaking. We went back the next weekend around noon and barely beat the rush. Totally worth the early lunch!\n\nThe brisket and ribs were melt-in-your-mouth good, and although it didn’t really need it, we couldn’t get enough of the house sauces. We also tried the mac & cheese and esquites which were total comfort food heaven. The whole vibe is super chill but still has great energy, making it the perfect place to kick back and enjoy some BBQ. We’ll definitely be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOTFpqVmpUeTExYVZObmNpMTBaR3B3YkRCc1psRRAB",
            "text": "EAT HERE!!!\nIf you appreciate the fine details and craftsmanship that go into great BBQ, Pica Rica goes above and beyond. I usually avoid eating BBQ at restaurants because most do a poor job.  It’s an art that demands time, patience, money, and love.  Pica Rica absolutely nails it.\n\nI live in Utah County and am honestly bummed they don’t have a location here yet. The food was incredible, truly beyond words. The staff were friendly and attentive, the restaurant was spotless, and the décor perfectly matched the restaurant’s theme and vibe.\n\nIf you love BBQ done right, this place is worth the trip."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Rek1sSlBkV1JQWjBSc00wUkNiR2xUYnkxcFlVRRAB",
            "text": "Pica Rica for the win!  I was hesitant to go because it sounded too good to be true. I am from the south and have not found any BBQ that tastes like home in Utah. Pica Rica…tastes like home.  They know what they are doing.  It is fantastic. Has all the tried and true smoked meats, as well as other great additions. The house sauce was awesome, but none of the meats needed it. Smokers are out on the back patio. Everyone was welcoming. Can we give it a 6 star rating?  We will be back for sure!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOT1EtdWk5ak5IRDNBRRAB",
            "text": "Food was just so good. We got the Double X with Spanish rice as our side. Absolutely amazing! We added on Mac and cheese & the brisket esquites - both great!! Everything was above an 8/10. We are some judgey food critics! We have mammas and grandmas that beat everything so it’s hard for us to say anything is the best but. The meat was some of the best we have had, the sides were not disappointing in the slightest. Total we spent was $90"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsWlgyeGtOa3BoUWtSS1owUlpOVVJtUjNaYU9GRRAB",
            "text": "This is the best TX BBQ in all of Utah the brisket is incredible cooked to perfection and the ribs are really good we bought the smoke show which is a platter with an assortment of amazing meats including the Brisket and Ribs you also get to pick 3 sides so we got the corn, mac and cheese, and the potato salad."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ3YwTzcxdE9mUW9BRRAB",
            "text": "We were in town for a quick trip and were told we had to go to Pica Rica for brisket and mac and cheese. It was almost 6pm on the day of the ironman race but despite that it wasn’t very busy when we got there. However they were already out of sausage and the guy before our group took the last of the pork ribs (which was my husband’s reason for going) and as soon as it was our turn they said you couldn’t get the Double X anymore. Fortunately our friends convinced the lady cutting the meat that we were with them and should be able to get it too. Anyway long story we got brisket, turkey, corn, and mac and cheese. It all tasted good…better than R&R but equally expensive. The mac was a little bland and runny but it didn’t dry out so that was good and it tasted good. Maybe not the best I’ve ever had though, as touted. The brisket lived up to hype and the turkey was so good! ❤️ I don’t know that I’d go back except maybe at lunch or right when they open to make sure we got ribs. 🤷🏼‍♀️ Overall it was a nice place with a nice atmosphere and they gave us free cookies and donuts. Seemed like what they did when they ran out of stuff. Give it a try but go early, unless beef ribs is your fave then you’re good whenever. 😂"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaExhcnJ3RRAB",
            "text": "Got here on a Wednesday at 5pm and they were sold out on most of their food.  I ordered whatever they had left.  Mac and cheese, barbacoa taco, and 12pc wings.\n\nMac and cheese is 7/10.  Tasted great but I found it watery.  Felt like I was eating cheese soup.  It needed more cheese boldness.\n\nBarbacoa tacos is 7/10.  The “tortilla” felt like a pancake.  It looked like a grilled, crusted, flat pancake.  I didn’t care for it much but the meat tasted great.\n\nWings was 8.5/10.  I thought the flavor was great.  Just need some ranch with it.\n\nOverall, good meal.  Would like to try their other meats."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214c01uWjFhRXMxZUZsM01UaDFXamh1T0hsQ2FIYxAB",
            "text": "Best BBQ you’ll find within 500 miles. Only other place I’ve had BBQ at this level was Franklin’s in Austin TX. Amazing to have this in St George. This is a must visit place. The family particularly loved the ribs but the brisket was equally incredible. Mac and Cheese was a favorite of the sides."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvc3VPRzFnRRAB",
            "text": "Fun little spot serving up LEGIT proper brisket. It is seriously hard to find a place that does it right and this is the spot. Juicy, super tender, great crust, nice mild smoke and spices. Great with their Mac N Cheese as well.\n\nThe dessert Tres Leches was light and perfect as well.\n\nIf I had ANY complaint, it is that the brisket is $18 per 1/2 lb. That photo is 1/2 lb so two slices. But I get it when they have mastered their craft."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPX241Y0N5NU95TzdnRRAB",
            "text": "A little twist to traditional bbq. Be careful when you order. The weight adds up fast and the bill can surprise you. But that’s how most true BBQ places charge food.\nI had their special sandwich of the day - Porky. My friends got slabs of meat. It was done well, they could use some more sauces. The sandwich had too much mustard. It would have been better to get it on the side, it overpowered the taste of the meat.\nThey often run out of food, so go by earlier in the day if this is something you want to try."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeUtDVm1BRRAB",
            "text": "Amazing bbq. The owner and staff were so kind. They ran out of certain meats but that is expected with bbq. We ended up getting h the pork bbq and it was amazing.\nThe street corn needs cayenne and sour cream to be perfected street corn in my opinion. -Texas style.\nWe would recommend this restaurant to everyone and we will be back for more."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLSDZrdktjaS11NTlBRRAB",
            "text": "Best pulled pork I have ever tasted.  Brisket was done to perfection as well as the ribs.  Chopped brisket sandwich and brisket torta were amazing as well!  Definitely a must try!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkbWVWQjFYMVp5YTJ0aU1XVm1hMlZ2WWxZM1JuYxAB",
            "text": "As a Southerner who's been on a 14-year hunt for authentic, mouthwatering BBQ in Utah, I can finally say the search is over — Pica Rica is hands-down the best BBQ I’ve ever had. And I’m not the only one who thinks so — it was just named one of the nation’s top 10 by Texas BBQ Magazine! That’s no small feat, and once you take your first bite, you’ll understand why.\n\nThe brisket is butter tender — melt-in-your-mouth perfection with just the right bark and smoke. The ribs? Fall-off-the-bone tender and bursting with flavor. And let’s talk about the sides: the pickled onions are heavenly, adding the perfect tang to balance the richness of the meats. And those tortillas? Soft, warm, and pillowy — the perfect vehicle for soaking up every last drop of BBQ goodness.\n\nHonestly, order anything on the menu and you’ll be begging for more. This place has completely restored my faith in BBQ outside the South. Pica Rica isn’t just good BBQ for Utah — it’s world-class BBQ, period."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLdnhuN19INU9UQkpnEAE",
            "text": "Best BBQ i’ve ever had. The brisket was so juicy. The spare ribs were so smokey and flavorful. They even had good mac n’ cheese???? They can do it all. The ordering style was also something unique that I’ve never encountered before- you order your meat by the pound and they bring fresh cooked brisket/ribs whatever you want out of the warmer and cut them in front of you, then they weigh it out, and send it to the register. It’s pretty neat."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xacWIzaEpaM1JYZVU1RGIzVnJXVXR3U1dkME5rRRAB",
            "text": "It lived up to the hype!! I think I’m a bbq snob. And this was amazing. On the same level as the top Q in Texas! I wanted a full sample of everything so went with the Smoke Show. I was extremely pleased!!\n\nThe tres leches was also great!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNWVreHJVa1J0ZFUxcFR6VXhjRFZFTFdaVlJFRRAB",
            "text": "First time in and all I can say when I walk around down town and all you can smell is those smokers. Food was so delicious!! We got the $120 meal that feeds 4 and it was 6 of us. Customer service was 10/10. Easy to order much easier to eat. Will be coming back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvai1LQWF3EAE",
            "text": "This place has the best BBQ! Husband had the Pork Spare Ribs and I had the Barbecoa Taco with Mac and Cheese, both were amazing! 🤤 Fun  atmosphere with Smoke Show photo backdrop for pics."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveTlIUUZnEAE",
            "text": "Let me drop some love for Pica Rica BBQ in St. George, Utah—this spot is straight-up fantastic. I swung by on a sunny Sunday  afternoon, stomach growling, ready to dive into some legit BBQ. The place has that perfect BBQ joint vibe: smoky aroma hittin’ you as soon as you walk in, chill music, and a crew behind the counter who clearly know their craft. It’s nestled in downtown St. George, pulling in locals and road-trippers like moths to a flame.\n\nI went big and ordered the Double X—brisket and ribs, baby, because if you’re gonna do BBQ, you gotta do it right. When that platter hit the table, I was in awe. The brisket was melt-in-your-mouth tender, with a crispy, smoky bark that screamed hours of low-and-slow love. The ribs? Fall-off-the-bone perfection, juicy with just a whisper of seasoning that let the pork shine. They smoke everything with Post Oak, and you can taste the woodsy depth in every bite. Here’s the wild part: they set me up with their house-made sauces—Carolina mustard, a cherry glaze, and this killer mole-inspired one—and I legit felt like I was committing a BBQ cardinal sin by even thinking about saucing up the meat. It was *that* good naked. The brisket had this rich, smoky soul, and the ribs were like a love letter to pork. I tried a dab of the mole on a rib just for kicks, and it was dope, but honestly? Didn’t need it. The Double X is a masterpiece on its own.\n\nI paired it with some sides—mac and cheese and esquites (that Mexican street corn vibe). The mac was gooey, cheesy, and pure comfort, soaking up the meaty vibes like a champ. The esquites brought a zesty, slightly spicy pop that balanced the richness perfectly. Oh, and I gotta shout out their beef tallow tortillas—homemade and next-level. I wrapped some brisket in one, and it was like a flavor bomb went off in my mouth.\n\nThe staff was mad cool, letting me sample a slice of brisket before I committed, which sealed the deal. The Double X with sides set me back about $40, but for the quality? Worth it. This ain’t no assembly-line BBQ—they’re smoking fresh daily with all-wood pits, and you can tell they pour their heart into it. Word is, they ranked #7 in the U.S. for Texas-style BBQ outside Texas, and after chowing down, I’m not surprised.\n\nOnly heads-up: they can sell out of meats later in the day, so don’t sleep on getting there early. Pica Rica BBQ is the real deal, blending Texas tradition with a Mexi-Cali twist that slaps. I’m already dreaming of my next Double X, and I’ll probably skip the sauce again just to keep it holy. If you’re in St. George, hit this spot—you won’t regret it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeWZyTlJBEAE",
            "text": "Overhyped, overpriced, and incredibly underwhelming. Almost $50 later and my wife and I are both half-full.\n\n$9 taco (not large, anyone would need 4 of these to fill up)\n$13 pulled pork sandwich (which had almost no sauce on it, what the heck?)\n$11 Mac and cheese (not worth it)\n$13 chicken wings (6 small chicken wings, I was shocked at how small they were)\n\nThe food we ate was tasty after we added bbq sauce to the pulled pork. Maybe they deserve another star for the food tasting good?\n\nWish I would have looked at the poor reviews and given them a little more credit. Maybe this is just a consistency issue and most people don’t get cheated on portion sizes?\n\nTo go on a Thursday night at the beginning of dinner time (6pm) and be told they were out of half of the things on the menu was alarming. “WOW, people must really love this place!” I thought. So I ordered a bunch of wha they did have and waited for my order.\n\nThe order came out packaged to-go and my immediate thought as I walked out the door was “this bag is light. That’s weird. I’m sure it will be great.”\n\nGot home 7 minutes later and somehow the food was already pretty lukewarm-warm. Poor takeout packaging maybe? (Yeah I’m getting a little petty at this point) I opened the packages and saw what you see in the photo.\n\nI lived in Kentucky for two years and have eaten great bbq at some world-renown places. *Pica Rica does not live up to any of them.\n\nHeard about this place from my cousin, who saw it advertised on TikTok and said it looked great. As one who has both eaten a lot of bbq and smoked a lot of bbq myself, I figured we’d give it a go. Pictures looked great.\n\nWon’t be returning, don’t recommend it, will be shocked if they stay in business without changing some things."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNVNsWmtSRkF4TjFkUVpXZDVXRVZLTVROMllVRRAB",
            "text": "Best bbq I’ve ever had and best dining experience we’ve had in a long time. We ordered the ‘Double X’ plate which I highly recommend. Plenty of food for 2 adults, and a great way to sample several of their delicious items. We ordered Mac and cheese for the side and added a side of the potato salad.\n\nRibs - 2 generous sized ribs. Best ribs I have ever had and I am not typically a ‘rib person’. Maybe the best thing on their menu.\n\nBrisket - outstanding, tender, flavorful - best brisket I have ever had. As great as their sauces are, I recommend eating the brisket solo to appreciate the amazing flavor.\n\nSmoked sausage - very good with a mild kick of spice without being overwhelming - recommend dipping in the Carolina mustard based bbq sauce.\n\nSides:\nMac n cheese - excellent flavor, not too heavy, great texture, highly recommend as a side.\nPotato salad - highly recommend, great flavor, not too heavy, perfect texture, perfect potato salad.\n\nService - outstanding - quick, friendly, generous with portions.\n\nAtmosphere- very clean, great playlist, was here on a Friday during lunch and we got our food right away.\n\nOverall, easily our best dining experience in recent memory. This will be a staple every time we come back to St. George."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcC1YLTdnRRAB",
            "text": "Summary. Service is “meh”, out of multiples items including the torta bread and we didn’t know until we had stood in line for just under 30 minutes and had to figure out what we wanted at the last second.  Food was cold. The ribs were 10/10. Everything else was decent. Just wish we had known they had no torta bread or sausage before we stood in line for 30 minutes wanting tortas and sausage.\n\nLike any good BBQ place it will be extremely over priced. Starting with the service, we got there about 11:20pm on a Saturday morning. We stand in the very slow moving line for 20 minutes and when we finally get to the first station where you order meat, we are told there is no sausage, so we get a small\nPortion of pulled pork in its place. Sausage was the thing we wanted most but ok. We got a single person tray to share for $35. 13lb of brisket (1 slice) so we ordered another 1/2lb (2 more slices). Then we wait for another 10ish minutes in line with our meat already cut and on a tray. We get to the register which is where you order sandwiches, and I order one of the tortas, to find out there is no torta bread. So I hurry and decide on a sandwich. We get our tray and pay and sit down. All of the food is cold by the time we finally start eating and it’s been on the tray for 20-30 minutes under a heat lamp. I would gladly order a rack of ribs to go. Their ribs were insanely tender and good. We finish the tray and wait another 10-15 minutes for the brisket sandwich. It was fine. Kind of dry brisket, flavor was good, Kole slaw was bland. The Mac and cheese was really good though. Overall, we won’t be going back as we paid $89 before the tip for our single person meat tray, with 1/2lb (2 slices) of extra brisket, one sandwich and 2 drinks."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RdFExUXlhSEo1VDA5V05sZEdSR2gwWkVKVkxVRRAB",
            "text": "Food was great, plenty of parking and seating and the staff was great. Stopped in while on vacation and had pork tacos, which tasted great. We also tried a bunch of random tacos and liked them all."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSSlVFeFpVbEJ0U0VRM0xXTjVaa2s1VGpsNExWRRAB",
            "text": "This place was a 10/10! The taste/smoke flavor, presentation and customer service was a 10! I don’t ever give a 10 but today was the day. The best bbq/smoked meat I’ve ever experienced! They have this place dialed in!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNWNEejZ3RRAB",
            "text": "We got the Double X platter and it was Incredible!! Hands down the best BBQ we’ve had. Brisket was delicious! Ribs and Pulled Pork also amazing! Fantastic Sausage! Both house sauces were also incredible too! We had to try the Brisket Esquites was also out of this world and the Mac N Cheese too. Everyone was super friendly and attentive! Atmosphere was pretty rad too! Next time I am in St George will be stopping by without a doubt! 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twdlRURjBlVlphWlc5R1pHTTVSeko1ZUVsWVIyYxAB",
            "text": "Having lived in Texas for years.. this place nails everything BBQ is supposed to be. From the Cole slaw, to the sandwiches, to the chicken quarters.\n\nAND…\n\nThe service. The owner brought out some of the mole enchiladas and they were 🔥🔥🔥\n\nThis place is a MUST on every trip here."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZa2FfXzVBRRAB",
            "text": "We absolutely love Pica Rica and come every time we are in St George. They are hands down the best bbq we’ve had in Utah. The staff are always super friendly and efficient. The restaurant itself has a great atmosphere. The food is always super tender and flavorful. I will however say that I think they are a small amount over priced. The food pictured was $32… We can only bring ourselves to eat here once every trip because of how expensive they are. If they were slightly cheaper they would be extremely well rounded."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvZ3BUUkVnEAE",
            "text": "Service was ok. Not great but average. Restaurant was cute and inviting. Food was ok. It didn't blow us away and the price to serving was ASTRONOMICAL! I will say, the ribs, though not very meaty, were some of the best I have had. The brisket was very average for smoked brisket. It needs more seasoning. We got Mac n cheese and esquites for the sides, they were both just ok. Will we be back? Probably not... but glad that we have it a try."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMjRHWGlRRRAB",
            "text": "Stopped in mid-afternoon & was surprised to see no other customers.  Learned the glass partition is where you order meats & you move over to the cash register to order other items, such as sandwiches, sides, etc..  We ordered a smoked turkey sandwich, barbacoa taco, side of mac & cheese, & a can of pop.\n\nWe were handed a tray with our mac & cheese, & our service wear.  Stood there for a moment for the balance of order before we were told the rest would be brought over to our table.  Sat down & waited a few minutes & decided to try the mac & cheese before it cooled off.  Found it very creamy & tasty.  Glad we ate it when we did, because it was almost 15 minutes before the server brought over our sandwich & taco.  However, needed to ask for our pop.\n\nFound the sandwich to be hot & tasty, with a nice amount of meat.  However, the taco was somewhat cold & as we bit into the shell, found it to be a bit too greasy / oily for our likely.\n\nIn summary, excellent sandwich, decent side of mac & cheese.  Not impressed with the barbacoa taco or service.  Also, would prefer everything to be delivered at once, rather than spread out.\nTotal - $38.10"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRek55YmFREAE",
            "text": "Pica Rica lives up to the hype! Easy to see why they’re one of the top 10 BBQ places in the country! The meat is smoked to perfection. The sides are complimentary to every bite. And you want to go back for every dessert, despite being stuffed! (tres leches is my fave!)\nOn top of all the great food is an attentive, cheerful, and energetic staff!\nGet there early as once the meat is “86’d” there’s no more for the day!\nTuesday’s are taco Tuesday only! Delicious in their own right, just don’t go with eyes set on brisket!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuLVktYkp3EAE",
            "text": "What an awesome place! On vacation stopped in to try it. Don’t regret it one bit! The food was amazing. Stopped at the 1st station and they let you taste test the brisket and what an amazing experience. Best I’ve ever had. They take pride in all the food they make.  Very stream lined process and they answer all your questions if you are new. We had the pulled pork sandwich and the breakfast taco. Also added the rice and street corn and that didn’t disappoint either. Will definitely be back next time in town."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMmRHOWZNVVEyVFRaQmRrOTNkM2haZEdaUGExRRAB",
            "text": "BEST BBQ IN UTAH!! I loved the atmosphere, and the food was unmatched! I loved that you could taste the smokiness in the meat. And not to mention the tres leches... Best tres leches I've ever had. Love the McHenry Group restaurants!!"
        }
    ],
    "reviews_count": 72
}