{
    "name": "Nonna Ina Italian Restaurant",
    "place_id": "ChIJMwNkEQBFyoARwwLt6mWjoBM",
    "grid": "SI1",
    "address": "567 S Valley View Dr, St. George, UT 84770, USA",
    "rating": 4.5,
    "user_ratings_total": 123,
    "phone_number": "(435) 301-3838",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kRlNqZHZOelpoY3pCNmNERnhTMjFLZVhOVFZtYxAB",
            "text": "Atmosphere needs upgrading."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OUFZWUnNWRlJKZVV0UFFtVnZkRk4zVDJWUGIzYxAB",
            "text": "Excellent food & service!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKNlRWbGxRVWR0V0dsVk5EUXpRV2xKYkZOZk9IYxAB",
            "text": "Large portions! Great food!! Great service!! We loved it!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KUGNVdFZNVWt0YkhWdGFIbzNRa3d6TjBkRWRuYxAB",
            "text": "We came here for our anniversary dinner. The food was delicious and the service was top notch!! The owner greeted us at our table and was so kind. We will definitely come back on our next visit to St George."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCaVYxWkhWblV3ZVRseFUwOWpNbHBXTUhoRk1GRRAB",
            "text": "We went for lunch on a weekday and there was no wait. I ordered the Alfredo ravioli and my husband got their signature carbonara. The Alfredo sauce was the best I’ve ever had. And the carbonara was delicious too. They bring it out and do a little presentation in a cheese wheel with their carbonara. Definitely recommend. I wish their lunch menu was a little more robust, but overall it was great experience. It’s on the pricey side but well worth it."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oTmMxOTRUbm8xWmpOSVFYWlFMV0ZQVlUxaWVGRRAB",
            "text": "Some how the review when I tried it years ago was deleted? Maybe the owner is inflating their ratings by reporting bad reviews? Also the owner is know for being unhinged in the replies to bad reviews and if you search every one of those have been removed so im sure they are inflating the reviews and trying to save their reputation. Havent ate there in about 3 years but was some of the worst Italian food and service ive had, especially just coming back from Rome the week before eating at this place. They were basically empty and forgot to make our dish, after a 45 minute wait, we mentioned to the waiter who then had to walk outside and tell the chefs who were smoking outside to go and make it. He then said hed get us a free dessert which was then put on our bill at full price. Maybe they've become better but not worth the price to try it again."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFNVluaExaa1JGUzFwVE1FVlNjRU0wVTNaVGVsRRAB",
            "text": "Haven't had such a great meal in a long time and that's after being in Italy and Greece for 6 weeks. So happy we found this place."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sR01XWTBhSFF0UmxSa2JrY3plVzU1Y0RGTlYyYxAB",
            "text": "Great food, rich and authentic. Though they were busy the service was fantastic. Reserve your table."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnd1kwWlFabkZNUXpsVUxWY3llVGhzYVVSb1pWRRAB",
            "text": "Great Italian restaurant with delicious food and very good service in St. George, Utah. Huge Texas-sized portions! We had the mushroom risotto, pesto gnocchi and a chicken and pasta dish I can’t recall the names of. My kids were offered Italian ices to take with them, as well. Recommended if you’re looking for some home style Italian food."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOQ1pXdzVUak5tU1VwSGNrcHNXa3hPWjBWMGExRRAB",
            "text": "Amazing Italian food!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWWRFVmxlakJrTjIxaE5ERmhORFo0ZWtWRFdYYxAB",
            "text": "This place was GREAT!  The negative reviews have opinions, but I highly disagree after reading what they said.\nWe went w a group of 8. Service was incredible and friendly and food was spectacular! I have been to Italy a few times and the food here was truly authentic.\nAlso, the owner was very engaged and friendly also.\nIf I lived closer to Utah, I would eat here weekly."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GbmVsUllSR2RXUjFOYVYyOTZNMmxOUm05UFJWRRAB",
            "text": "Small family-run Italian restaurant with a large menu with a lot of variety. Gluten free options available!\n\nWe’re here visiting Zion and stopped here for my birthday. We got Prosecco, burrata, lasagna, and carbonara.\n\nPortions were generous (carbonara is easily 3 meals for me), staff was kind.\n\nWould come back next time we’re in Zion :)"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTWRVdEVhRVpRV25WNmRHcDRTa05VU0RrNFprRRAB",
            "text": "We really wanted to love Nonna Ina. The service was truly top-notch; friendly, attentive, and made us feel welcome from the moment we arrived. Unfortunately, the rest of the evening didn’t quite live up to the same standard.\n\nThe food was just okay; not bad, but not memorable either, especially for the price point. What really took away from the experience was being seated outside, where ants were everywhere. It made it hard to relax and enjoy what should’ve been a romantic dinner.\n\nWith a little more attention to outdoor dining conditions and consistency in the kitchen, Nonna Ina could easily become a go-to spot. For now, though, it was more “so-so” than “Nonna’s magic.”"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzNFVGTmxPV2gwWDBJMGJWTkZSVmQ2WkhNd2FIYxAB",
            "text": "This unique restaurant is a gem. We were a hour late for our reservation because I forgot the time change coming from Mesquite but they sat us quickly outside anyway which was better because the inside is very noisy the only drawback the reason for 4 stars for the atmosphere. The portions are very generous, the food is delicious and the entire staff is so friendly and efficient. The owner is very friendly and helps wherever needed plus Vincent who is their smoozer as he calls himself is a delight!! Treat yourself to this wonderful restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WWFUQllSazlPVUhKTWQxTmxaekZFZG1wVlRGRRAB",
            "text": "I was excited to try this place. The food was good, the service was awful.  They were extremely slow the food didn't come out all together,  had to beg for drinks, didn't have enough glasses to give us all the drinks we ordered.  The service wasn't attentive at all.  We were overlooked.  I asked for a side of marinara,  it didn't come till all others had finished eating. By then my meal was cold, and was still charged 10.00 for a tiny dipping size side of sauce. If you arent in a hurry and you dont mind being ignored, and paying more than the food is worth.   Then the food was ok"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoUmFVRkdORkl4WlhRMVYwSk9OemRLVDBrM04yYxAB",
            "text": "Yes!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poRFUweDRaMU5hTkRkWU1YbE9RV3d0V0VwS2RtYxAB",
            "text": "This place is phenomenal. It has the best lasagna I’ve ever tasted in my entire life. I am 64 years old and I’ve tried a lot of Italian restaurants and this beats all. Thank you for having such a wonderful chef and a great staff."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210NFdXeHZObEEwYzE5M1FsaHlVRzVwVEdwc1RGRRAB",
            "text": "Very nice Italian food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTk9EWjJWVzVTTjI0NWR6ZHRRWEowUVZoWGRWRRAB",
            "text": "OMG! Excellent everything! We went here for our 10th anniversary dinner and set outside in the grassy, shady courtyard. Kara was our server and took fantastic care of us! There was live Italian music and a very authentic Italian atmosphere. I had the spinach ravioli with cream sauce. Large portions, which means I get to eat it again tomorrow! Yay!! No cooking. Kara gave us a free dessert 🍨 for our anniversary gift 🎁 I highly recommend this place! Marissa has done an excellent job and it is now our favorite restaurant in St. George Utah."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNeFJUSmFSa1J3VHpocFFraDFVRTQxTmpGQlJtYxAB",
            "text": "Great food - Great Service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQmVHVnJZa2xtYzJwdk4xVnhiR2d0UzE5aFRtYxAB",
            "text": "Fabulous food, generous portions, great service, lovely atmosphere. Appetizer, meal and dessert. Delicioso!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRVQwWkJNWEJsTURkU2NYQjNiMHBYZVdSeGExRRAB",
            "text": "Great food and great atmosphere.  Staff was very cordial and professional.  Cannot say enough good about Joe and his committment to his customers and community.  Saw first hand his value of caring for his customers and friends. Will recommend to everyone I come in contact with."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201d2JreENkVzh4YVc5bGRUSnZVM2gwUnpGSlpGRRAB",
            "text": "Absolutely outstanding! This family-owned Italian restaurant delivers both authenticity and warmth from the moment you walk in. I ordered the signature carbonara with Parmigiano Reggiano cheese, and it was perfection — creamy, rich, and bursting with flavor without being heavy. You can truly taste the quality of the ingredients and the passion in the cooking. The atmosphere is cozy, the service is genuine, and it feels like dining in Italy. A hidden gem that I’ll definitely be returning to — highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSeVp6QTVSRjlYT1djNFJIQjRPVFpwZUdwV1QwRRAB",
            "text": "Kara provided delightful service, a huge Caesar Salad to start, then scrumptious Gnocchi with creamy pesto sauce, and a glass of white wine...a wonderful finish to a productive day on the road for work. And the fresh bread was perfect, slightly chewy crust but oh so good. Highly recommended!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVU9XNUZVWGRmU0dwbFRYUldTVzVSTFhWQldtYxAB",
            "text": "My my spaghetti was not cooked all the way through.. The sausage was  a Oscar Meyer Wiener.. I won’t be going back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNeFpYcHVhbGRVUVc1YU5pMUxUelpsVWxJemJYYxAB",
            "text": "Very authentic"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214SFRYaFpXVEJ1YVZBNFlucHlTblJLTkVFMlkyYxAB",
            "text": "Bruschetta was amazing best in America! Live music was great - the boss was mingling with wine with guests - the entire staff seemed liked they LOVED where they worked - fantastic old school Italian spot - Emily was amazing - she caught wind that I might have been slightly not happy with a dish and she basically Insisted I change it out while simultaneously made me feel comfortable to do so - replacement dish gets 100/100 simply amazing food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzNVVWOUVMVXBWWDBGRlF6azVXa0YyV0V0TVUxRRAB",
            "text": "Definitely a bonus find! An off the beaten path gem. The food is delicious, staff incredible,  atmosphere is awesome.  The live serenading was the best."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUWNIRmpRakJYY2xWa2IxaHNUMjlyTTBka1JYYxAB",
            "text": "We got there as soon as they opened for lunch I ordered the carbonara. Which when they brought out had several flies on the cheese wheel My daughter ordered the risotto she couldn’t eat because of the overwhelmingly taste of mushrooms first of all there were several flies, annoy us throughout our wait for our food, and as soon as our food arrived, somewhat long lengthy time later we noticed a dead cockroach belly up under the table next to us. The food was so horrible. Neither of us could eat it. We took it home to add our own ups to it to make it palatable I would not recommend this place to anyone. The over priced wine and bread they gave us were the only good part of our lunch experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kd1MyUTJWbFZ3WVdwTVpUQldla28wUm5SUWNWRRAB",
            "text": "The smallest portion sizes ever. I paid $25 for a gnocchi dish that literally only had 5 gnocchi, so $5/gnocchi. Every Italian restaurant I’ve ever been to has had solid portion sizes, but you’d get more food in a happy meal than an adult entree here. Kinda tasty"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5TVVqaFRZVlZ2TjBKeWRFMHliMEpqTkVaUVZYYxAB",
            "text": "We had a lovely time here and loved our meals. The Cesar salad was delicious, complimentary bread was so fresh and soft. I had the pesto gnocchi and my friend had the penne pasta with Alfredo. Absolutely huge portions which made the price feel even more worth it. I have at least 2 more servings for leftovers.\nThere was the most charming live music because it was Saturday night and the staff was so kind and attentive. After driving around looking for something other than all the chain restaurants in town we were so delighted to find this spot. There’s just nothing like locally owned and operated."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOaFNVNUxMWGR2YzBFeGVVbDBMVTFZYm5kdFQwRRAB",
            "text": "I love Nonna Ina!! I had the Filet Minon al Gorgonzola and my husband had the lasagna. The food was authentic, the service was fast and friendly and the atmosphere was quaint and relaxing!! I've eaten there many times and it's always fantastic!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSdmJsZHBWMFJQZEdJdE5URTRaa0U1ZVRKRFoxRRAB",
            "text": "Our third visit to Nonna Ina was just as enjoyable as the first two. We had a reservation for a group of four, and were seated almost as soon as we arrived. They were, as usual, extremely busy, with every table occupied throughout our meal.\n\nOn our earlier visits I had tried the carbonara, and the lasagne, so today I ordered spinach ravioli and my wife had the filet gorgonzola. We always start with the small Caesar, split between us, then go straight to meat or pasta. I promised myself that next time we'll order from every section of the menu and eat \"family style.\"\n\nThe food was excellent, though beware that the dishes I've had have all been very rich, and filling. Don't be afraid to take a good chunk of it home to enjoy the next day.\n\nThe atmosphere is what I call \"large family dinner with a lot of cousins I've never met.\" The space is small and is always busy. Tables are close and, on this trip, that made it warmer inside than usual. Even so, our experience was enjoyable & we know we'll be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wd1VFdDNhM0ozVURnelVtTlBPVkpYY25aVFlsRRAB",
            "text": "Went in for dinner with the mrs. Our waiteress was amazing ,very informative and had great energy,even for the end of the day. We orderd Aracina for our appetizer, and it came out cold and I kindly asked my server to take it back and she did. Again, great service. As I waited for my appetizer to come back, I decided that if this meal was going to start with cold food, then perhaps we werent going to be having a true experience of Nona Ina. I give a 2 star for food quality, 5 star service. Again our waitress fantastic and definitely still deserved her tip. I would love to experience Nona Ina for what I have heard. So far ,very uninpressed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WcFN6TkRWRU5mYXpOUWJUUktPV1poZGkxbWRGRRAB",
            "text": "Unbelievable little Italian restaurant!  A slice of heaven. Big servings. I had the Talapia (wonderful) and my husband had the salmon (delicious). And then the Lemoncello cake. Save room as it is delicious. Atmosphere was exactly what you would want and very friendly and attentive staff."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVVpqQmxjSEp5UTJSV05uZFZabVJOTWtnMVVsRRAB",
            "text": "Yummy authentic Italian"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SUlFrMVFRV1JrYjNod2IyZDJNVk5xZEZnd05VRRAB",
            "text": "This food was absolutely divine. I just don't know how to describe the the flavor and the smooth texture of the steak. It was just really really good. When I googled it it said 20 to $30 but it is definitely $35 to $70. I alone spent over $100. I got the filet which was one of the more expensive things but like I said it was just so good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSlpqbFpiRWt0TjE5RVIwVjZUamx2ZFVscVVYYxAB",
            "text": "I was looking for a restaurant to celebrate my anniversary that wouldn’t let me down, and Nonna Ina did not. We were able to choose where we wanted to sit due to the special occasion, we didn’t feel rushed at all. Our server was very kind and informative of the food and options, I was even able to customize my own dish with pasta and ribeye. Seriously one of the most flavorful meals I’ve ever had. Thank you."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sNWIzbFJhRkF3WVdJM1dIZE9jbkYxTUVwQmJHYxAB",
            "text": "One of the best meals I have ever had in St. George!! Hands down!! Will be coming again for sure. It is filled with extraordinary flavors and presented very well. The waitress we had was very familiar with the menu and provided great options & suggestions. Consistently checked on us and wanted to ensure we were happy with our service. Everything felt like it came straight from Italy in a homemade kitchen filled with passion. It’s definitely a MUST TRY!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSE1XbElOMDFvYkU5R1owdFVTMko1YnkwNVpWRRAB",
            "text": "Amazing food! And the staff is always super nice!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSQ1lXcGhjMVJqTWtZM1dXTXdRMGx1VkZwR1pWRRAB",
            "text": "We had such a lovely time. Staff and owners were very nice. They kept asking if we liked our food and offered to make my daughter something different if she wanted. Everything was delicious and gave huge portions. I think very fairly priced for what you get. We never had a cheese wheel experience and it was so cool to see. Made a difference in taste. They gave us bread to go. They offer gluten free options and it tasted great. Will go back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0WWVHeG1ObVIwV20xTFpXSnljM2hGYVVsRGVrRRAB",
            "text": "10/10 best Italian restaurant I have ever been too! My family is Italian and the food here is authentic and hit so close to home, the food was magical. Our server Kara took great care of us this evening. We also got to meet the owner, friendly and welcoming and had some rich history.\n\nBeautiful atmosphere and table settings, we got to sit outside and enjoyed the night air with nice music and our AMAZING food!\n\nIf you want authentic, this is it!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNWJ1M3d3RRAB",
            "text": "ago\n\nWow!! Went there on April 2nd for the very first time. We had reservations for 3 at 4:30pm. From the moment we walked in the staff made us feel welcomed. The restaurant is not very big but that made it even more inviting. Our waitress Marissa (I hope I got the name right) was amazing! She was super attentive and always checked that everything was to our liking. The food was delicious and flavorful best Italian food I had outside of Italy. I just want to say thank you to the staff and Owner. This was my first time but definitely not my last time. Wish I could give you all more than 5 stars because you deserve it. With sincere thanks Michelle Louray"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTE9WVnZNV296ZEZZek0yaFJSV05tYkMwMlVGRRAB",
            "text": "Nonna , it’s a place that you wanna like, but it just underachieves. We ordered the caprese salad, which basically was more shredded Parmesan than anything else .signature carbonara which is good and the mushroom risotto which was not it was our second time trying the place we were hoping for more, but doesn’t make me want to recommend it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMVGE0TVNZOHVlRjl3RRAB",
            "text": "Awesome, authentic Italian. Started with a Caesar salad with grilled chicken — hands down best I’ve had. For the main meal I had the carbonara. Got to love the flaming Parmesan wheel. My wife had the spaghetti & meatballs. The red sauce was SO good. Also tried a bite of the pesto gnocchi. Also amazing."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcnVPS1JnEAE",
            "text": "So let me talk you…I love the carbonara. Love the experience. Fantastic dish! Carbonara was my comfort zone. But I ventured out to try a new dish…the Ribeye with caramelized onions. The flavor palette is so diverse and unique. Now mind you….it is a lot of onions but that’s what makes the flavor so unique. Like I seriously can’t downplay this dish. It’s a sleeper dish. Check the picture. And Emily our waitress was phenomenal. 🤌🏽"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wNE9YTm5ZVEY1YWtOdWIzbHFaWEU0Y25selVuYxAB",
            "text": "Been wanting to try this place for so long and LOVED it. My fiancée and I are big Italian food lovers, and this place did not disappoint. Pricing is high, but the quality of the food is definitely worth it. We’ll be back for sure!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveVltamRREAE",
            "text": "Best Italian food we have eaten! My husband absolutely hates red sauce and inhaled their lasagne. It truly is amazing and worth coming for just for that. Their carbonara was amazing as well and so flavorful. We also tried the fried ravioli as an appetizer they were so delicious and their deserts are yummy the Limoncello cake is #1 and the cannolis are good."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMHYtWWRBEAE",
            "text": "DO NOT BOTHER. What a sad excuse for Italian food 🤢🤮 served us hard uncooked risotto… cost almost $25 for a meal of uncooked rice and it was so oily and watery\n\nI can’t believe the is is how they serve food😵 a can of chef boyardee would taste better and be much better price.\n\nWould give 0 stars if I could. 🤮🤮"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbXJtYlF3EAE",
            "text": "Best  Italian food in St George by far!  I have eaten here several times and the food and service is always excellent. Huge portions and an amazing atmosphere make this my favorite place to dine."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaVBxLTN3RRAB",
            "text": "We went last night. Food was fabulous. Server was amazing. The owner was gracious and spent much time chatting with us. The carbonara was a special treat. Get a reservation and go!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKS05WVjZia2hyY1ZOb1FVWlBiWFJJYkZoc1IwRRAB",
            "text": "Absolutely amazing experience. Went for the first time and every single dish at our table was phenomenal. Best Italian food I have ever had. Staff were fantastic and attentive, the owner was friendly and went above and beyond. He made sure to stop at every table and greet every guest. Cannot wait to go back and try more dishes."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvb2ZHaGZBEAE",
            "text": "Oh my goodness, this is the best Italian place ever. I love the lasagna - the red sauce has a wonderful savory sweetness that I can't stop thinking about. The carbonara is sooooo creamy and delicious, and the cheesecake is heavenly. The calamari and shrimp appetizer was awesome as well - not too greasy and really fresh. The staff is so friendly and welcoming, they treated us so kindly. My family and I will be back to try everything else on the menu. I am so glad we have an authentic, delicious, and (I believe) family-owned Italian restaurant here in St G!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnM2VIRTBTakZQZDFSWlVHcElOVVpvYTFGUVpHYxAB",
            "text": "First time here and we were impressed with the food and service. Excellent. We visited with our daughter and son in law. Everyone of us enjoyed the night.\n\nThe atmosphere was like a nice cafe. No way is this meant to be a bad comment. Very nice setting.\n\nThe food truly was legit with large portions. The service was outstanding and friendly.\n\nThe placed was packed and everyone seemed to be really enjoying their food/experience.\n\nThe owner checked on us and was very pleasant.\n\nExcellent experience. We’ll be back.!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPM3M2ODNTLXBpNkJnEAE",
            "text": "We just had the best experience at Nonna's. The food was amazing! The staff was amazing!  We got to meet the owner, and he was the nicest. My son wanted me to give them a five-star review. My mom, who is the biggest picky eater, loved her dish! We will definitely come back bc we didn't get to eat everything we wanted."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNRHZ4S0NpMlBhZm1BRRAB",
            "text": "They were short staffed, really only saw one server. But others helped her out...\nShe was phenomenal as she had 6-7 tables to tend to...\nStarted with the bruschetta, which was fabulous, fresh and abundant.\nI had the seafood risotto, it was great.\nMy wife and sister in law shared the carbonara and that was a treat to have it tossed in the wheel of cheese, tasted good too. No room for dessert but dinner was very good, look forward to returning when back in St. George.\nTry it, you won't be disappointed !!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUFNUSnVhbGwxZUVoWk0wbGFWeTB3ZVZoblJFRRAB",
            "text": "Food was pretty good. The filled pasta tasted nice but the sauce was a bit too sweet. The side of grilled veggies was massive and tasty. The steak was hugeee and worth it for the price. Complimentary bread was also very nice with the oil."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvX0lHS1BBEAE",
            "text": "Everything was wonderful! We just ate there for our Anniversary. The food was amazing and the service was just as good! Will definitely be back."
        }
    ],
    "reviews_count": 58
}