{
    "name": "George's Corner Restaurant",
    "place_id": "ChIJQ6bimM9EyoARkP86Y1Mr4HY",
    "grid": "SI1",
    "address": "2 W St George Blvd, St. George, UT 84770, USA",
    "rating": 4.4,
    "user_ratings_total": 4319,
    "phone_number": "(435) 216-7311",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWMGQwdFFTR1pLU1dkUVEydFFNMnhoWTI1VVExRRAB",
            "text": "Tucked away on the bustling corner of 2 W St. George Blvd, George’s Corner Restaurant is a charming nod to the town’s storied past, evoking the spirit of the original Big Hand Café from the 1930s. This family-owned gastropub blends quirky nostalgia—think black-and-white photos of yesteryear St. George lining the walls—with a vibrant, laid-back vibe that’s perfect for locals and travelers alike. Whether you’re grabbing breakfast amid the morning buzz or settling in for dinner under the stars on their outdoor patio, the atmosphere feels welcoming, like stumbling into a friend’s lively kitchen.\nThe menu is a love letter to American comfort food, elevated with fresh, local twists. Start with the crispy salmon sliders, their flaky fish paired with zesty slaw that bursts with citrus notes—pure perfection for sharing. For mains, the Philly steak sandwich is a standout: tender, shaved beef piled high on a toasted hoagie with melted provolone and caramelized onions, served with truffle fries that add an indulgent crunch. Vegetarians rejoice—the black bean burger is hearty and flavorful, topped with avocado and chipotle aioli, proving plant-based can be downright decadent. Don’t skip the tableside steak preparation if you’re feeling fancy; watching the chef sear that premium cut right at your table turns dinner into theater.\nService here is the real MVP: attentive without hovering, with staff who remember your name and preferences, making you feel like a regular on your first visit. Portions are generous, prices reasonable (entrees hover around $18-28), and the craft beer selection pairs flawlessly with everything. On a recent Friday, live music from a local acoustic duo filled the air, transforming our meal into an impromptu celebration. If you’re exploring Southern Utah’s red rock wonders, George’s Corner is your savory pit stop—unpretentious, delicious, and utterly memorable. Five stars; we’ll be back for those pork chops next time!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MU1WRkpWMlZuZVdGQ2JuSkJXVms1ZW1SU1ZYYxAB",
            "text": "The food was ok. Nothing outstanding or unbelievable but also not below expectations.\n\nHas a very diner-ish feel and food fare experience.\n\nIf you're in the mood for dinner then a good stop.\n\nService was great and the atmosphere is dated but feels clean."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twNVFWbGlVSFJGVEhBdGIwaGlkRFJxUVZOVlZGRRAB",
            "text": "Loved it!  Staff was friendly, good prices, great food!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKclZWcHpkVWRLVVhoZmVqTlJibFpSVEc1ZlIyYxAB",
            "text": "Loved George’s Corner! Sat at the bar with the most friendliest bartender! I wish I remembered her name - long red hair and the prettiest smile. The food was fast and great. Had the Turkey club and the fries were so good my husband ate them all!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRlFYaFhZbGt5UW1oUExUUnFSbUpUVERoWWFIYxAB",
            "text": "Good food and service"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcTl1U3d3RRAB",
            "text": "Caught an early dinner here on Sunday afternoon. I was impressed with the quality of food, the portion sizes are enough especially if you get appetizers. Solid place to eat and worth dining in. Would recommend the French dip or cheesesteak. Fish and chips aren’t bad either, enjoy!  @faithful_forker"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONGVGRkhWMlZGTjFWNFQxbElTMGt3VVhWVlIzYxAB",
            "text": "The guy at the front was so friendly and we got seated quick. The waitress was also very nice. Food was not bad, my husband got the fried chicken which he thought had maybe sitting for a while and wasn’t super fresh. But still a good experience."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nMFNtWnJWV2hwTXpNMU9ETk1iRTVpTTA1M2JtYxAB",
            "text": "The service was terrible and the fried chicken was then worst I’ve ever had.  It was dry and vey tough.  Lemonade tasted terrible."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwSWQzUlZZbUZpV1VOcU1FUnBSa3RLZEZKQlEyYxAB",
            "text": "BRYCE was incredibly helpful when I called in. Bryce was kind and efficient and so very sweet. Thank you for your help and love 🤍…"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWS2RXbG1ORXRXU2xwWlkzZEJOVXhUVnpKSFZYYxAB",
            "text": "Map it out and look for back parking lot.  In the restaurant every thing was awesome"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poS1RUUmlhMHQxYTFwWU1EUjNTVFZYV2tWdWNFRRAB",
            "text": "The Tavern Salad was so good, fresh and just what I wanted; the Moscow mule added some pep, Gabriel our waiter was super attentive and friendly."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21weVZYVm9UbkkxVVdzMVlpMVdkMmhCVHpGUldWRRAB",
            "text": "Fun atmosphere, great service, food was really good."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwbE5TMU9VRzFxUjJod1RqUmxjVzl1UlZOUFFtYxAB",
            "text": "Had the harvest salad with chicken, sweet potatoes etc was very delicious!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1c2QzaHdPVUo1VjBOc1RHaGtUMEUzTFhZNWNrRRAB",
            "text": "As much as I want to give this place a higher rating, I have to stay honest. With my last experience, on my birthday, the Food was underwhelming and the service was not that great."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWFlYb3lRVFp1ZFZCUldWQmFZakpMVm1SU0xWRRAB",
            "text": "Decent food although a bit pricey. Great location and environment and service."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2djdYN1NBEAE",
            "text": "One of the best restaurants I've been to in years! Great food, drinks, service and atmosphere! 👍\n\nReturned on Wednesday 10/15/2025 and food/service was just as good! 😀"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGSVdsTkNkVUl5YldoS1F6SkNMWEk0YjBwRlRFRRAB",
            "text": "Very cool restaurant with lots of local history on the walls. The food and service were perfect. Best sweet potato fries I’ve ever had."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taSFoxVk1UMEpMWTNWdlZsTndkVEpGTTJOMGFuYxAB",
            "text": "We went with friends from out of town on a Thursday night because we had noticed that was a time when they had live music. Even though the place was packed, we felt like we got very attentive service. The food was all excellent, and the beers were outstanding!"
        },
        {
            "date": "3주 전",
            "language": "cs",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOeFFsTlJOVVZQVEVKeVRXTnVVRTlGY1RGTk1sRRAB",
            "text": "Včerejší večeře i dnešní snídaně byla vynikající 👍😎"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxdFFraG9Xbk16VUdOcmRqUmpPRWR3YkZKNlVYYxAB",
            "text": "I got the wedge salad. The blue cheese dressing was super yummy. I have a peanut and cashews allergy told the staff before and they were awesome about it. Also had some of the nachos I would get extra guacamole and salsa with the nachos"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sb1RXSlNSRzR0YWw5ek1rUnNSbGN0VVRBemRVRRAB",
            "text": "Second time having breakfast here, this time with my kids and everyone really enjoyed their food. Service was great and friendly, prices are good and quality is excellent.  Haven't had lunch or dinner here, so can't comment on that, but for breakfast? Highly recommend!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVM2NGZzNSWFZqU2tkb1ltOUNUekpVVkZsNVEwRRAB",
            "text": "Absolutely terrible service and wait time and also the least friendly staff! Hostess (both) were not willing to help or give any info that was helpful and making super sarcastic remarks! Food took insanely long! Would NOT recommend at all"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvNVUyb3dSRE5OWDNwNGJqbFlkbGg2VWxReVFYYxAB",
            "text": "Great place! Tasty food and a friendly atmosphere."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpNFBLRTVRRRAB",
            "text": "Employees who who hypoglycemia aren't about to eat there if they come in 15 min early and need to order something at full price.  The food is almost as good as fast food that is overpriced, the servers aren't aloud to show kindness or any emotion, go to a restaurant that cares about and are kind to their guests.\n\nGood location.\nInhumane owners, who don't let that that fire people with low blood sugar, no discounts on food, can't talk to your family if they are dining there, and the owners, are are so fake that it makes me want to vomit.\n\nNo customer service.  I'd go to in and out because they pay you, the burgers are better, they are kinder, they get breaks, and don't fire people because they have to eat before work when they need food.\n\nIf you have diabetes, hypoglycemia, have to take any medications that you will die if you do not take than don't work their.  The owners are horrible and treat everyone, including guests, like a robot.\n\nBTW the kitchen does not meet health code standards.\n\nIt is a nice location, but their standards are the same as hitters Mein Kaumf.\n\nMuch love.\nBe kind.\n\nI have no I'll will, I just like kind owners, staff, and food that taists good and isn't just overpriced pub food, and friendly servers that know how to smile."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkRFNWbGFWazAwV2w5WllsQk5hRWxvTlZGcVZsRRAB",
            "text": "We were greeted friendly and was sitted down quickly. We ordered the BBQ rib platter and short rib with bowtie. For the Bowties were over cooked an mushie. And the ribs were over sauced and caked in seasoning, the mashed potatoes were a glob and the green beans were over cooked and oily"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUWVWcE5ka1ZsZURFMmFGSm5VRlp5VkU1WWRtYxAB",
            "text": "The building itself is nice and well taken care of, and our server was an extremely nice woman who was pleasant and thorough with our order.\n\nUnfortunately the food we got, specifically the burgers came us somewhat mushy and undercooked. We didn’t really feel like complaining since we were hungry after driving all day, but my daughter and I spent the rest of the night sick after eating there."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUcDlfZ0NBEAE",
            "text": "I had the pleasure of eating here three times during my National Parks Road Adventures in Utah, and I Highly Recommend this place. The food is amazing and delicious, and there is a large array of items to satisfy any appetite. Kudos to Whitney and Julia for there fantastic customer service, and my appreciation for serving me..... SPECIAL KUDOS To Julia. I have encountered many servers during my travels and very rarely do you meet one that invites you to come back and sit in their section, whose face lights up when you return, and that treats you like family. Her warm, welcoming, and pretty smile perfectly compliment her bubbling outgoing personality. Julia's knowledge of the menu is spectacular, and her enthusiasm for her job is infectious. My sincerest appreciation to her, and it was an honor to meet such a wonderful person. I'll definitely eat here again the next time I'm in southern Utah. Returned on 9.20.2025 and was served by Ember. She recommended the salmon special that was pure perfection."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prMVoyaG1TMGhMZVVSbVQwVnJhRmx5YTB4c1FVRRAB",
            "text": "Great breakfast and a friendly staff.!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GMlVUaEtUR3d0UjFGalEwWkZTbFZRZWxCblgzYxAB",
            "text": "A cozy hole in the wall dinner with live music, great food, and good service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RMk5UUjNSRFJaZFUxcVVYZFZiR2hKYmtGblJXYxAB",
            "text": "Great food, super attentive staff, and a very good atmosphere. Everyone was so kind.\nFrench dip was delicious. So was the elderflower margarita I got!\nBartenders were very helpful and even gave me some recommendations for what to do in town, as a tourist."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xndFlsOVpRamRzVGxCSFZrSTJVM050TmxGaVYwRRAB",
            "text": "The food was awesome and the service was first class.  The pear cosmo wasn't too bad either 😄"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SU4wRllhWEprTWt4eGNuaFJhM0ZJV1U1cmJFRRAB",
            "text": "Great atmosphere. The lamb burger and chili cheese were both good. The chili mint lemonade was a hit."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsV1NGOWpjSGRYVkhVMk1VRkpialJXU2xCNFFXYxAB",
            "text": "We are passing through....Wait was long after food was ordered. Arrived to table cold. Requested waffle and husband's Mexican rice to be reheated...(figured that was faster than a remake of order). Chorizo tasted like McCormick taco seasoning. We noticed those leaving near us left a lot of food on their plates. Seem very short on cook staff, but many servers. Servers walking around with food they do not know what table it goes too. Seems to be a newer restaurant...I hope they get it figured out for their sake."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wTVptbFRPV0l4Vm5KVU0xWkRlVUZoVHpaMlRYYxAB",
            "text": "I have never been here before till I came to visit last Friday for a nice dinner with my wife. They let us have outdoor seating and George’s Corner took exceptional care of us the whole time. I got the French Dip and my wife got some Italian Pasta. 10/10 would recommend to anyone wanting a good place to eat here in St George."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSdlRGTlJia2hxY1ZWSFpHNXdVRk15YkRoQ2FuYxAB",
            "text": "We had such a Delicious dinner, we went back next morning for breakfast and were just as pleased. Delightful spot."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVVZqTXlaalEwY1VKbU5IZzNZMFZIVDNwcmRrRRAB",
            "text": "When did the restaurant become a daycare? Poor for business when you got your server watching her kids more than the people she is serving. Thumbs down."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUWRESjFPRWR5ZWxoNU0xVlZjVFpDYWxwT1lVRRAB",
            "text": "Soggy. Tasteless food. Good cocktails.\nCalamari was the worst."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVlNrSm1PSGxKU201cVlqZHlUVzgxUW5SS1dWRRAB",
            "text": "It was not good.  Soggy food. Soggy calamari. Tasteless burger. Old tomatoes. Really disappointed. Good cocktails."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xacVozUlVPRmQ1UkdZM1dEVnZWVFZPTmxKeVlVRRAB",
            "text": "Excellent everything 👏"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMFJGZDVSRjltY2t4Q1RteGFNbEZzZUdKelUzYxAB",
            "text": "We had a great meal. My family and I really enjoyed it."
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNeTlLRGR3EAE",
            "text": "로컬에서 먹는 맛있는 식사  강츄"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMlBtRnNRRRAB",
            "text": "Wanted to continue to support some local businesses while we are travelling to Zion.\n\nStopped at George's and ordered the Turkey Club, Reuben, 2x Roast Beef Dips and the Buttermilk Chicken. Everything was tasty except the chicken wasn't very good. It wasn't at all crispy. All came with fries which were fresh and crispy.\n\nService was great the food came quickly and everyone was friendly.  Parking can be a bit if a challenge especially of you drive a larger vehicle.\n\nOverall a good experience"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONGFWcENRMDVtYlhkaVMxOVhUMDVpVkZSamRHYxAB",
            "text": "Wanted a smaller meal so I could also enjoy a bit of dessert.  My waitress, Tori, was very helpful with her suggestions. Had strawberry rhubarb \"pie\" for dessert. It was served in a dessert cup,very warm.  It was wonderful.  My salmon slider sandwiches were delicious.  So many choices to consider, regular menu items and specials.  The atmosphere is quite pleasant, with old photos on display as well as two videos of several old photographs being shown simultaneously.  Nice place to enjoy a drink with your meal, family and friends."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eGJfejN3RRAB",
            "text": "Great spot! Atmosphere was awesome with multiple levels of seating as well as great outdoor space as well. We only waited about 10 minutes for our party of four on a Wednesday. Service was good, but nothing special. Had a couple great old fashioneds. Thefish tacos were delicious and the fish sandwich was well balanced also. The fried chicken has a little bit of spice in the batter, but was good as well! Definitely would come back when visiting!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOX1FxUFhmbVlHSFBnEAE",
            "text": "I wanted to love it so much. The food isn't bad, I found it plain. The fish sandwich needed more flavor, it seemed like a bulk frozen fish patty with some coleslaw. The coleslaw lacked depth of flavor. My wife's salad was hard to eat with the included mixed greens. Parking can be a challenge as the center is crowded with restaurants and shops. The staff was very friendly and got us seated quickly, although it was busy. The server seemed as if he was new. Seems like a great place to go with friends or meet there."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUlVWcFJMVGxyY2tkMFMyeFBia2xuYlhGbGFuYxAB",
            "text": "Beautiful restaurant in charming ancestor Square that just adds to the warmth and ambience of the restaurant. The waitress and hostess welcome us and we’re very friendly as soon as we got in. The service was superb and the food was Fingalicking delicious. We especially recommend the double latte avocado toast and Huevos Rancheros. We love the fact that they would allow dogs on the patio."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WR2MwRndNM0Z5YzI5ck5EWnBUa2RLZW5aM1ZIYxAB",
            "text": "Came for family breakfast.  We had chicken fried steak breakfast, breakfast burrito, eggs and hash browns some kids pancakes options and also the biscuits and gravy.   Mostly pretty good.   The biscuits and gravy, which is not easy do do for a place without a lot of effort to get it right.   That was the low point for us.  Pre made gravy mix and hard dry biscuits.   Besides the biscuits and gravy it was mostly good.  The decor inside was really nice.   If you stick to the basics this place will foot the bill."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twSlZ6aDJkMGRHYVRkYU5WSkdha1J4TUdoRFIxRRAB",
            "text": "Always a 10/10 here!!!\nIndoor/outdoor seating. Misters for hot days outside.\nThe drinks here are amazing. HIGHLY recommend the Sangria Margarita.\n\nJust know parking is difficult and busy in this area."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjd2JtOUNUbVl5Y1hvd1VUbHBZVVV0U0dneE1FRRAB",
            "text": "Really fun restaurant! Fun ambience and good food! On Sundays they do breakfast till 1 so we were bummed to miss the lunch menu but breakfast was really good! They had short rib enchiladas as a special I think which were really tasty! The pancakes were some of the best I've had! The breakfast burrito was decent not amazing. We'll definitely be back when we visit again!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBZ05TckRnEAE",
            "text": "George's is a must visit for a delicious meal!  It is a chef owned restaurant and will not disappoint. The food will not only make your mouth water of delight, but it is reasonably priced. The service was impeccable from the moment we walked in. Our waiter did an excellent job of describing the dishes as well as the menu. The atmosphere is quaint and perfect for the location.  I'm definitely going back!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWV1ZEWllkekZxYmswNVJXOW9aMWxEUzBsSlQzYxAB",
            "text": "We stumbled on George’s Corner while looking for brunch in St. George. Brunch had already ended at 1pm, so we missed it, but we were pleasantly surprised with what we found instead. Not being familiar with the area, I loved that it brought us to the charming historic downtown. Sitting right on the corner where the very first stoplight in St. George once stood made it feel extra special. The old-town vibe was the perfect backdrop, even with the bustle of the city around us.\n\nWe chose the patio, and even in the summer heat it was comfortable thanks to the shade and the misters. Relaxing outside with a cold, crisp peach sour from a local brewery was such a treat. The food was incredible—honestly some of the best we’ve had in a long time. We started with the Queso Fundido, which was fresh, spicy, and absolutely addictive (we devoured every last chip). Then we split the special, a tuna melt with avocado. It was hearty, messy in the best way, and so filling. If I could change anything, I’d skip the regular fries next time and try the sweet potato fries or onion rings instead.\n\nThe service was just as memorable as the food. Our server, Ally, was attentive, friendly, and upbeat. She answered our menu questions with ease, checked in often, and made us feel like regulars. She was truly lovely.\n\nAll in all, George’s Corner exceeded expectations. Between the historic charm, amazing food, and stellar service, I’d recommend this place a hundred times over. Thank you for a wonderful experience!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kS1FXVnZlRjlVU2xwSU0zUTJielV6YkUxWmVGRRAB",
            "text": "Loved the experience here. Drinks and food were fantastic and came out relatively quickly. The server was amazing and on top of it."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3d29QVmNREAE",
            "text": "Great spot for families—very kid-friendly with a fun vibe. No alcohol for us, but the creative cocktails looked amazing! Local desserts were delicious, and the service was excellent. Definitely worth a stop!"
        },
        {
            "date": "4달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTGJWOVhSbFpwVjNaZk0yUndTMVpCTW5JM1gxRRAB",
            "text": "Tipico locale, staff molto cordiale, ambiente molto piacevole. Sandwich vegano OTTIMO!!! Gustosissimo. Per non parlare delle sweet potato fries.. da provare assolutamente"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSNGVtVlliV2RrY0VGVlRIVkZPR0pRWTBGbFFuYxAB",
            "text": "This place was BOMB! The food was amazing, and the restaurant is super cute. My husband and I stopped in on a whim for something new while on vacation and went back the next morning again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPbmczOHpLcl9yQUlnEAE",
            "text": "Nice upscale restaurant in St. George's downtown area with wonderful memorabilia to give it a warm hometown atmosphere. The food was delicious, the service was friendly, the options were various. The only problem is trying to find the entrance, which is not well marked and is around to the back of the restaurant opposite of the corner and the street."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNQ0Y5TE9UczltR2FnEAE",
            "text": "Nice surprise! About a 10 min wait. Service was great. Drinks are tasty! Food was excellent! Birria tacos were amazing. I ordered a Hawaiian burger and could barely fit in my mouth! My son had the Crabby mac and cheese. . .everything was excellent!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NUwyd2NBEAE",
            "text": "I’ve been here a few times and as I usually enjoy myself, the food never blows me away. More like a basic burger joint wrapped in fancy paper. The fried pickles were flavorless, however, the pretzel was tasty and my salmon was cooked well and had interesting flavors! I also had a lavender lemonade that was decent. I’d go again to give them another try."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNW82X0Z3EAE",
            "text": "This place is one of the best places I’ve ever been in the US! You can feel the quality of their products in every bite. We had dinner and got back for breakfast. Perfect! Just perfect! I usually don’t like American food but now I’m going to change my mind! My first review on Google because you deserved it hundred times!\nThank you all for doing this! Special thanks to Zac, you made our experience even better!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMVpuVkJnEAE",
            "text": "3.5 Stars\n\nI visited George's Corner Restaurant, and the experience was a mixed bag. The staff was very friendly, which I appreciated, but I was surprised by the 30-minute wait to get in, especially since most of the customers were senior citizens. It seems to be a popular spot for locals.\n\nThe menu is written in a creative and appetizing way, but unfortunately, the food didn’t live up to the expectations. We ordered the lobster roll, salmon sliders, and fish tacos. While everything was adequate, it wasn’t particularly impressive. For about $15 per person, I expected more from the quality.\n\nOverall, if you're looking for a local favorite with decent food, it’s worth a try, but don't expect anything too special."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abGRYTTNaMGgwYzIxdlFYQndiRXQ0U0RaeWRuYxAB",
            "text": "Leaving this review while I’m still sitting here because once I leave, I’d rather not think about this place again.\n\nWe originally asked to sit outside and were told there’d be a 10–15 minute wait. No problem—we were visiting from out of town, so we took a short walk and then returned, sitting in the chairs provided right outside the restaurant. We watched the party ahead of us get seated, so we figured we were next. We had already received the confirmation text saying we were on the waitlist, so we patiently waited for a call or text to be seated.\n\nThen a party of four walked in, also asked to sit outside—and they were seated immediately. Confused, we went inside to check and were told, “There’s a 10–15 minute wait, I can add you to the waitlist.” At that point, we showed proof we were already on it. Bad vibes from the jump—we were skipped and then told we weren’t even added when we clearly were.\n\nEventually, we were seated, and honestly, we were willing to let that mistake go. Things happen. But the service after that was awful. Menus and straws were basically tossed onto the table, we weren’t checked on, no one asked if we wanted drink refills, and our drinks came out way after we’d already finished the appetizer. Meanwhile, we watched other tables get attentive service and constant check-ins.\n\nAs two people who work in the restaurant industry ourselves, it was frustrating and disappointing to feel so overlooked and unwelcome. The food itself was solid—no complaints there—but the service left a bad taste. We won’t be returning."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbjdMTW1RRRAB",
            "text": "We were recommended this place. I am not sure I would go back. It's just average bar food with nothing special. The burger was fine, overlooked but fine, the jalapenos were ok too. I did like my drink! So there was that!  The service was nice too. Looks like they could accommodate a few people here."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrMDhyWHFnRRAB",
            "text": "Update - We went for breakfast and it was delicious! I have been to George's Corner three times now and I really love the atmosphere, the food, and I love the choices they have. Tonight I had the George burger with cheddar. I love that they put the tomato, onion, and lettuce on the side so you can build a burger the way you want it and it keeps the lettuce from wilting. The bun is perfectly toasted. They have the best fries also. The fries are fresh and gluten free. I had the chocolate caramel custard which has whip cream and hazelnut brittle on top. In the past I had the bratwurst on the pretzel bread, and they have really tasty salads. I also tried the Cucumber Chili lemonade tonight . I really liked it. It definitely had a bite. The service is wonderful. Update - I go to George's more frequently, especially because they will lettuce wrap sandwiches and burgers. They also have live music. I have had breakfast at George's and just like everything else it's delicious."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLNjkydWlOOXZTbUhREAE",
            "text": "This was our second time here and our first time for dinner!! The service was excellent, our drinks were top notch, and the food was good. Our first experience here for brunch a few months ago was also excellent. We will definitely be returning."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNTU3N1VBEAE",
            "text": "Interesting eatery in an interesting little town. Diverse crowd, busy on a Friday night. Quality menu with something for everyone and an impressive selection of draft beers with plenty of local Utah options. Fast and friendly service. Stayed at a place nearby so it was nice to walk. Clearly popular and for good reason."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqM3RLMXRnRRAB",
            "text": "Had a decent dinner at George's the other night. The vibes were lively, and it was pretty bustling, which probably explains why the service was on the slower side—but nothing too frustrating. Our server was super pleasant though, which made the wait more bearable. The food was mostly hits with a couple of misses. The fries were standout good—I could've eaten a whole bucket! The drinks were solid too, definitely kept us happy while we waited for our mains.\n\nThe lamb burger was a bit of a letdown, though; it was kind of plain and could have used a bit more flavor or toppings. The sandwiches were alright but could've done with a bit more meat packed in them. On the upside, the prices didn’t make my wallet cry, which is always a plus. Would go back to give it another try, maybe on a less busy night to see if the service speeds up!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJczlmclN3EAE",
            "text": "The restaurant was clean and beautiful. It is very open feeling with multiple levels. We choose to sit on the patio as the day was beautiful and comfortable. We were seated immediately and the service was quick and pleasant. The food was excellent and we enjoyed the atmosphere. We plan to visit again soon."
        },
        {
            "date": "6달 전",
            "language": "zh-Hant",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeWIyWTB3RRAB",
            "text": "路過st.geprge找到這家餐廳，據說是本市必嚐的餐廳，果然名不虛傳，是間古樸舊美式餐廳，服務人員親切，餐點美味，如果路過，不要錯過"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxbGV5aDBBRRAB",
            "text": "Not a bad place to visit at all. If you want a decent cheeseburger in St. George, this is a great choice. Located in an easy to get to place, just off of Main St. and 100 N. The fries are really good. The staff was great, smiling and very helpful. There are options for both indoor and outdoor (covered patio) eating. The whole place was well kept and very clean. I’ve been to this restaurant a few times and I’ll keep coming back. Thank you!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkaFpGbExiM1ZqUkVkdVFWRlVSQzFMYW1WZlUyYxAB",
            "text": "George's Corner was one of the best stops on our trip. The bread with honey and goat cheese was unbelievable. Soft, warm, and full of flavor. We also had the Desert Sunset with lavender lemonade and it tasted like something from another world. So fresh and fantastic.\n\nNicole was our server and she was fantastic. She made us feel welcome right away and took great care of us. The food, drinks, and service were all top notch. We will definitely be coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURueUxYVm1BRRAB",
            "text": "What a great place to get a meal. Homemade tartar sauce is phenomenal. Prices are reasonable and service was great. Full bar! Not an easy find in Utah. We were very pleased with our experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINU9fU1ZnEAE",
            "text": "Such a great place to eat!!  The service is always amazing and the food is delicious!!  We had the summer salad - a beautiful grilled salmon salad garnished with strawberries and sliced almonds, and the delicious fried fish sandwich with coleslaw on top and a choice of fries or house side salad. Both dishes were perfect!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfbk5PekhREAE",
            "text": "There is nothing on the menu that isn’t wonderful. I would highly recommend what I got. The frito and salmon sliders with the house salad. And to finish the visit off the potted Banana cream pie! The decor is super nice and my bartender Katie was delightful and friendly! Just go eat here. You won’t regret it!"
        }
    ],
    "reviews_count": 73
}