{
    "name": "Tifiny's Creperie",
    "place_id": "ChIJdd_BC_JFyoARTwm48YS04hA",
    "grid": "SI1",
    "address": "567 S Valley View Dr, St. George, UT 84770, USA",
    "rating": 4.7,
    "user_ratings_total": 1569,
    "phone_number": "(435) 879-3363",
    "reviews": [
        {
            "date": "10시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKaFdYQnlOM0JXY21GRlZ6VTFYM1ZxVXpkTVgzYxAB",
            "text": "The savory crepes were new to me.  The server was great,  and attentive.  No problems with anything during visit. If you like crepes, try this place out when in Saint George, Utah. The variety of crepes is there and you can make your own."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RMlVGTTJNWGx3UjJObWNtcHFURlJ1UmtGUWNVRRAB",
            "text": "Best food in St. George and service is great."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWelFYVjVjMDVHUkV4V1J6aHlVVll5TXpCSVpHYxAB",
            "text": "I almost don’t want to give Tifiny’s five stars because I don’t want to have to share it with more people, but I just can’t deprive the people of the world of this experience. I started coming here in November of 2020 and now I come every single time I’m in St. George. The service is good and I’ve never had crepes this amazing (and yes, I’ve been to France—although they probably wouldn’t make crepes like this). I always get a make-your-own sweet crepe with custard, candied pecans, whipped cream, and caramel sauce. Yesterday I even threw some graham crackers in there. It was, in a word, stunning. I’ve met the legendary Tifiny and she is super sweet. It can get really busy here around 11:00/12:00 on Fridays and Saturdays, so I would advise coming at a different time, but it’s still worth the wait. Their classic crepes and breakfast crepes are also good, as are their Italian sodas. Pictured is the crepe of my own invention, the Triple Treat, and the breakfast crepe with bechamel sauce."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsVWRXSXRiSGQ0Y1doblNVUmxUVkk0TUc5NU9YYxAB",
            "text": "Very good crepe. I got the triple threat. Highly recommend."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBM056QkZPVzAwWlVKb2VucFVhRGRvUlZOU1ZXYxAB",
            "text": "We really enjoyed eating here. There are outside and inside dining options. The prosciutto sandwich and the chicken salad sandwich were amazing! The crepes were great - my kids felt they were a little sweet for them but still liked them…"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OM2MzcFlSekU0UlU1S1JIVjViRTVsUjBkNVgyYxAB",
            "text": "We ate here over the weekend with our kids and we loved the atmosphere, and the crepes were delicious! They were busy but our food was brought out quickly and the waitress was very attentive. The coffee came out on a little tray with cream…"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taZmVtcFNUblpWT1VkSVRqazNibkpSWkVSeE1XYxAB",
            "text": "I've heard some express concern there aren't any good restaurants in Southern Utah...to them I say, \"Have you been to Tiffany's?\". Thank you, Tiffany, for a brilliant, amazing, delicious experience.  The Saturday Creme Brulee French toast is the best we've ever had!!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psaVNUUjFOMVZUY1V0c056SjFNVWRSVG01alFYYxAB",
            "text": "Best crepes in all of Utah."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwOGZ6NGh3RRAB",
            "text": "Breakfast croissant was excellent service also! Back again. Service was excellent again. Had the Crembule French toast lots of Strawberries unfortunately the coffee is no longer what it used to be. It still has the dark color but no flavor or body.Custemers used to come just for the Great coffee"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWU1JVTldSSFI1Wm14dVVscFRjV1I2Um5KNmFGRRAB",
            "text": "Massive crepes! Legitimately bigger than some 3-egg omelettes I've had. The food is great. The atmosphere feels a bit cramped inside, but it's much nicer on the patio. The food can take awhile to come out, but it's well done and the servers are pleasant. Prices are very reasonable for how big the portions are."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taT1NHMWxORGg2U214bmFIRXpZWEl4U0hSVGFHYxAB",
            "text": "Ordered the Florentine Crepe (savory). Flavors were good. Food was cold.  Which was wierd bc I was the only order at my table. Disappointing 😞…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWSk1GTkpTMkZKWVhKMmFuVTFSMlJpWVhCdE1GRRAB",
            "text": "Great selection of sandwiches, savory and sweet crepes, and sides.  Highly recommend the turkey melt crepe with carrot slaw, and for dessert, le crepe. Delicious food, great service, reasonably priced."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oaU1rWkNUMmhFYmxCc05VVnRORE5NVjJwcmRWRRAB",
            "text": "Tifany’s crepes are the best I have ever tasted anywhere!!! The service is always excellent too!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwSFlsUjFVVmcyU21jdFlubFpSMjlOVXpWR1RHYxAB",
            "text": "Great food in a comfortable atmosphere."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKRkxUWnZNSFZKVlhwUU0ybFlNek15VHpVMGRVRRAB",
            "text": "The crepes are wonderful! Whether  buying sweet, savory or both, you won't be disappointed. Order a coffee just for the fun of it."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaGZPZ2d3RRAB",
            "text": "Such a fun place for crepes. Love that they have a gluten free options"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ORlEwdG5hekJKVDFobmNWUlpiVmxxWVRjNGQzYxAB",
            "text": "It was so good. I loved that they had both sweet and savory options, because I am not a sweets gal. I ordered the California Crepes Benedict and added mushrooms. Needed a bit of salt, but was delicious! Everyone loved their meals. Our waitress was super nice and helpful."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rMk56TTVORXROTVhJMlNtbFFVekJZWVY5UmFWRRAB",
            "text": "Excellent little gem. Such a nice little creperie, and delicious as well. Would highly recommend a stop in here."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoLTlYVFZnEAE",
            "text": "This is the perfect spot for brunch! I love the crêpes here - they are served stuffed and are always uber delicious. I love to get a savory crêpe and then split a sweet one with my brunch date. The staff are always very friendly which is a plus."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdFZqaEVhSHBMZFhwbWQwOU5iMWRwVFRGUlVHYxAB",
            "text": "We were seated pretty quick. There 4 of us. This is definitely an upbeat place. It’s not a place you go for a quiet meal. There were a fair amount of customers, having a good time and everyone was talking and laughing. We loved how the…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjM00wUjNSbXB4YkVaelNWQndYemxzY2xkVVQxRRAB",
            "text": "Serving both sweet and savory crepes that are prepared beautifully and taste even better. They really pack each crepe full of quality ingredients. You will leave satisfied! This is our new 'must stop' place to eat anytime we're in St George."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRdE1GWjFTaTE0TFZkMU0xUktaRmcwYUZkaE4xRRAB",
            "text": "Me encantó crepas fabulosas y muy frescas"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kMlYxVTJSelJKTkVoemIwd3pNRXcwWkMxM1RrRRAB",
            "text": "Great place for a delicious brunch"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWVGJtOXJTazAxTlhWa1JFaHFiM2xSY1dZeWRXYxAB",
            "text": "Ordered a french dip but either sat to long in the warmer or they spilled the hell out of it on the way to the table and it showed up slopping wet and nasty .   If they are busy stay away , they cant handle it"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScVprNVJjbmR5TkRGNWN6SnJXV0pDYTNWdlYwRRAB",
            "text": "Food good\nInitially the interaction was confused"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ScmMyWjFjR0ZmUkdKcFRWWm9kVUkzUlRGVlpIYxAB",
            "text": "The food was great and so was the service! Very nice and clean."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GbGRUQktWMjFzYVdwdloycHNZakZQTFhJNU1WRRAB",
            "text": "Amazing food great service. Love that they sweet and savory crepes."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paclVEUmFXVEZ0U1haMldrWkJlRjltYUhFMlpWRRAB",
            "text": "The crepes were really delicious!! We enjoyed the sweet and savory crepe options. The crepes were a decent portion and the Béchamel sauce on top was really good. The only thing we didn’t enjoy was the unoptional 18% gratuity added to our…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNmJrRnJaa0Z3ZG1zNWEybEZRMk16WldkbE0yYxAB",
            "text": "Excellent food with good prices and nice portion sizes. Establishment was clean, cute, and had a nice patio area. Only down side is a single toilet. So there was extended waiting to use it for a toddler who needed to pee immediately.  Other than 2 thumbs up!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poYWNWVXdjazVoYVVkWlRtTnJUV2MwZEhwUlYyYxAB",
            "text": "The best crepe in Utah!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0MWR5MU1jR0ZxU2tWbE1FRXhSbGRSWlRaUmNFRRAB",
            "text": "Really good eating.  Great crepes, large portions and fresh fruit.  My entire family loved it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGR1JGZGtPRU4yTmtObFJtVnhiRkZ2ZEhWTFNrRRAB",
            "text": "I ordered the La Crepe and the Beggars Purse Pasta and let me just say — they were both PHENOMENAL! This is by far my favorite crepe place I’ve ever eaten at! 10/10! For sure the most surprising thing to me was just how good the pasta…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVWFHNUtTRXRVZG5aUGF6ZDVNMUJUTUZSME5GRRAB",
            "text": "Huge Crepes ! Sauces on point, and excellent atmosphere.The patio is simply beautiful. One thing to consider is the wait times for food as it is really excellent quality and a popular spot for both locals and tourist. Patience is key and…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21keE9UYzFNVjh4U0hOblZuaHdhbmM1Um1KaVFVRRAB",
            "text": "Always so yummy!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xS1FUaFpRMnAzWW5OelRsWTNXamR6ZVVWaVpVRRAB",
            "text": "I loved this place! We had a great mix of sweet and savory plates that left everyone happy with what they ordered and we all had plenty to share. I would definitely recommend. Can get busy. We had a party of 10 and they still got us in quickly. Can't wait to go again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOd01XdEdRV1UzTkZwbGVteHlMVEZWTjFwVVRXYxAB",
            "text": "This place was super good, I really liked the savory crepes and it is decorated very well. It is a little out of the way but that also makes it a great date spot."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwMWRrdFRZVEp1WlRCaWMzZzJiMGxZUWtOS2VYYxAB",
            "text": "My family and I enjoyed the lunch and the desserts! Never expected to find such a cute place on our vacation! This is a must try!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KdFp6QnJablZVV0djelpYaHdUbGx5Y2tOWFVFRRAB",
            "text": "Loved the menu and really enjoyed the crepe I chose."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4aVJqWnlWVFk0VTBrM2VVTnlZVzVqYjNSb05WRRAB",
            "text": "Food was perfection. Cozy atmosphere. Great service. 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTGNHcGxVWE5xUVdwMVZIRnBWRXBaVUhGeVdHYxAB",
            "text": "ohmygod heaven"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkWmJuTXhjMUpQUkZkcWNqUmtXbEphY3pKQmVGRRAB",
            "text": "How have I not been here before? What an adorable place as well as wonderful servers. But the food is amazing! Nice prices too. The California Benedict crepe was amazing. I also tasted the turkey swiss crepe and it was even better. I can’t wait to come back again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3b3FYZ0tBEAE",
            "text": "Delicious food, fun atmosphere, great service! Their menu is so much fun filled with sweet and savory crepes. (They also have none crepe options.) The dessert crepes were the best part, the portions are huge! My kids loved it and are already asking to go back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbmZtT29BRRAB",
            "text": "This place has delicious crepes! I’ve been here twice now. They have both savory and sweet crepes. The s’mores crepe is a great sweet one to try. Last time we went we ordered 3 savory crepes. We go the very veggie, chicken Diane and chicken…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJelBxaVZREAE",
            "text": "These crepes were a great size for the price. So many other crepe places have $10-15 crepes that are the size of cannoli. These were nice and big, and they were also delicious! The Melt and La Crepe were delicious, one savory and the other…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUVZqZE9hWGxQWTFaVmFGWXhNa0ZzTlZWRlpWRRAB",
            "text": "Best restaurant in St. George and honestly this seriously might be my favorite restaurant in the state!! The tortellini is one of the best pasta dishes I've ever had! We had a berry crepe which was the best crepe I've ever had.. definitely a pattern of lots of bests! The crepes are tall and about a foot long too!! This is far beyond your average crepe (which is still good!)\n\nThe design is really fun including the outside seating with a pergola and plants.\n\nWe were visiting from the wasatch front and seriously will look to come back every time we're in St. George!\n\nIf Tifinys ever opens up north I'll be anxiously waiting to tell all my friends about it!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNW9QYjB3RRAB",
            "text": "The food is delicious!  My Brie burger was the best burger I've had!  The crepes are amazing.  We did have to wait 40 minutes for a table, but it was well worth it.  The service was a little slow, but that's because everything is made fresh.  We didn't mind having time to chat while waiting.  We'll be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybXUtT2hnRRAB",
            "text": "I absolutely was blown away by the size of the crepes. The savory and sweet crepes we ordered were phenomenal! This is our new “must go to” every time we visit St. George.\n\nI would have given 5 stars but I was a little turned off by the dirty floor. The ambiance was awesome but then you’d look down at the dirty floor. Could have easily been swept up."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnekxiaU5REAE",
            "text": "Food was really good. We got a veggie crepe and a mixed berry crepe. Our waitress was super nice but the wait was insane and I wish they would have just told us how long it was going to take. It was also Saturday afternoon so shame on us. But food was great. Staff was nice. We sat outside in February which felt amazing"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxcU9ySC1BRRAB",
            "text": "Update:\nWe love this restaurant and have been coming here for years. We always make sure to stop and eat here when driving through town, and it's always been an A+ for service and food. However, today's experience was not up to par and I'll explain why:\nFirst, the whole restaurant smells like mold and mildew, all throughout the inside it stinks like mold. Secondly, the young hostess girl has an attitude (makes a person feel bad for requesting a patio table).\nThird, the outdoor patio was not clean, trash all over the ground. And the patio chairs were very very dirty (definitely had not been wiped today, or even this week possibly).\nLook, we love this restaurant, we want them to be successful, and we will definitely come back. I am always willing to change my review if they step it up and fix the problems.\nOur food was great, and our server was also great.\n\nOutstanding! First time my wife found crêpes in America that remind her of home (she is eastern European). And the eclairs are homemade, and delicious. Our server Kyleigh was amazing, and went above and beyond for us. We will definitely be back for both the service, and the food. 10 out of 10! Highly recommend this place. And when you dine here, request Kyleigh as your server, you'll be happy you did. (P.s. All the staff was pleasant).\n4/22/22 Edit: again it's a good or better than ever."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwaWVycW1RRRAB",
            "text": "A must stop place in St George!!!\nWe have gone there so many times in the past year and have tried a majority of the different foods. My favorite is the Le Crepe which is a sweet crepe. We love the Chicken Alfredo and Cordon Blue Savory crepes.\n\nThe grape salad is the best side by far that we have had there.\n\nWe miss the mixed berry beignets. They were some of our favorites.\n\nThe place is so fun and very family friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiaVozcEx3EAE",
            "text": "A taste of French dining in affordable prices. Crepes  are delicious , pasta, and  the savory onion soup. To top it all is our polite, sweet, kind, and generous waitress, Alexa who went all out to please us with photo and  a cup coffee to go. The service is excellent  that makes  “bon appetite “ a reality.\n❤️❤️❤️"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbkx5d0ZnEAE",
            "text": "absolutely adorkable! we came for Valentine’s Day, and the dinner had healthy portions, beautiful spinach salad and a dessert.\nLove the decor and the service is TOP notch. Thank you Earl & Tiffany for all you do for our community"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqeVlERXlnRRAB",
            "text": "Atmosphere was fun, wait list of about 30 minutes with 4 which wasn’t an issue. The coffee was a fun experience and was good coffee. They have Savory and Sweet crepes and I got the breakfast crepe, but most of the table got the Le Crepe which was delicious and sweet. Would love to come back!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6Z0lUS3lRRRAB",
            "text": "We love this place! The food is fantastic, good prices, and the BEST French onion soup we've ever had. The staff is great, just sometimes they are short staffed so be patient, our servers have always been wonderful. This is currently our favorite place to eat."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPNXZmWUFnEAE",
            "text": "This was a fun experience. They have done a fantastic job decorating and creating a unique atmosphere. The crepes are huge! They have sweet and savory choices. The sweet will crave even the worst sweet tooth. Great experience especially…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNXZ6Z3pnRRAB",
            "text": "Preferred the sweet over the savory crepes. Not fans of their Benedict sauce, but loved my fruit crepe. Small place inside, but plenty of extra seating outside. Service was wonderful."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaOXEtQVpnEAE",
            "text": "Food was amazing! Even though we went for brunch one of us got the Pasta (get it loaded 😉) and it was some of the best pasta we've had!\nThe crepes were delicious as well!\nWould recommend!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1bC1uLXd3RRAB",
            "text": "The food was delicious and beautifully presented. The le crepe dish was the biggest crepe I’ve ever seen. Enough to Feed 3-4 people! our server was very friendly and helped us decided what crepes to get. Loved the strawberry and lemon in the water."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIODd2R3dBRRAB",
            "text": "Food was incredible, as was our waitress! She was quick, responsive, and kind. If you’re debating on a sweet or a savory, get both and split them with someone! We chose the “La Crepe” and “The Melt” and enjoyed them immensely!  The only sore points in our visit was the experience with the young girl manning the front desk. She was impolite, immature, and rude.  The person chosen to interact with your customers as they walk in the door is truly the face of your business and will forever leave an impression.  This girl sorely lacked proper training and basic manners.  Regardless, we will definitely return to try the rest of the menu."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXLTVfRjlnRRAB",
            "text": "Um YUM! and how cute is this place???\nI felt like I was in France. Food was great, service was great. They have indoor and outdoor tables that both bring a pleasant and happy feeling while enjoying the food.\nI ordered dine in and needed to take some home, it was so good. They have the cutest candy store with all kinds of varieties.\n\nIf I even am back to St. George I am coming again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0aUtUYVpBEAE",
            "text": "This was my first time. It is a cute and cozy place. Once we were seated we had very fast and attentive service. The atmosphere is warm and inviting. We ordered a sweet crepe, La Crepe, the berries were so yummy and filled the crepe generously.  We ordered a savory crepe, the breakfast crepe. The flavors were so delicious. Each crepe was very large and filling."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXek5MdC13RRAB",
            "text": "SO STINKIN GOOD! We’ve been meaning to try Tifiny’s since we moved here and we wish we would have come sooner! Both the savory and sweet crepes were perfectly cooked and flavorful. We highly recommend the Greek, California Benedict, and Le Crepe.\n\nThe only note we have is the wait for our food was pretty long. We came on a very busy Saturday morning and we weren’t in a rush so we didn’t care too much. Just keep that in mind if you stop in on a busy day."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCM01UY1hREAE",
            "text": "Update: they added a Banana Cream Crepe which is really good if you like that kind of stuff. I think a little more Graham cracker would make it even better.\n\nI eat here at least once every time I'm in St. George. The Alfredo chicken and the Cinnamon crepe are amazing.\n\nI've also had the Strawberry Mango crepe which is very good too. I might try one of the sandwiches next time since they looked good when others ordered.\n\nThe Cream Puff was really salty though which was weird. I'd give it another try.\n\nStaff is always nice here and happy."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNzZMODlRRRAB",
            "text": "I had Breakfast At Tifiny's 😁😁 They served up the best crepes‼️ As busy as they were, we were able to get in and get our food relatively quick. When I go again 😁 I will get Le Crepe (middle left in pic).…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkbF9UT1Z3EAE",
            "text": "We absolutely loved going to Tifinys crêperie! The service was fantastic from Kate, the food was incredible, and they even brought us some blankets to keep us warm on the patio as it was a bit chilly. This is definitely going to be a place where we revisit over and over again in the future."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kckxUbERaVUZUUjBGSmNHTm9WSGxNYm5GWVgxRRAB",
            "text": "When visiting my daughter and family in St. George from Washington state, she took me to this restaurant recently for brunch. This place was absolutely amazing. We had a savory crepe and a sweet crepe. Yummy 😋 Great food and good service! If you haven't been there, definitely go!…"
        }
    ],
    "reviews_count": 66
}