{
    "name": "Black Bear Diner St. George",
    "place_id": "ChIJ03TcEzBFyoAR9eYhDVccGGY",
    "grid": "SI1",
    "address": "1245 S Main St, St. George, UT 84770, USA",
    "rating": 4.4,
    "user_ratings_total": 6150,
    "phone_number": "(435) 656-2327",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTVFqWkxOSHBtU0MxRWQzWlRVMDQxVVVNNFNsRRAB",
            "text": "We always enjoy our visits to the Black Bear. 🇨🇦"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kME9FSlVTak53U1dsa1ZHTldja3A0TkRKVk1YYxAB",
            "text": "An interesting atmosphere, friendly service!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkS1p6ZzRlVzlqU25OZmVIVlVjMjVrYjFJeVJGRRAB",
            "text": "Black Bear is one of those places we take for granted as it's a chain but wow is the food amazing! Total comfort food and very reasonable prices. Try Tip Melt was enough for two meals and the breakfasts are also hardy. Highly recommended."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FeVFqQnlSMVZwYkhsbmVrOW9OVlpEWkRrNVIzYxAB",
            "text": "Waitress seemed very uninterested in her job, did not take correct orders or ask what sides were wanted. Previously enjoyed our dinner here but this time not so much. Ham was chard, mashed potatoes were cold and either they were out of the item we requested or the waitress was not understanding the request."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201Q1NHbFpjRmxJVkRCblRGTXlhVFZLYlZwa2RHYxAB",
            "text": "I went here with my daughter and it was fantastic! It was super busy but we went right in. Our server was fantastic and I had a great time with my daughter ❤️"
        },
        {
            "date": "3일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCaVVtbE5TMDlUZG5vMmFHUlliMGhWVFhBdFluYxAB",
            "text": "Excelente"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxV1ZqbFFOa2R4VDNFMlpHWXpMVmxqTTJsUVdVRRAB",
            "text": "Absolutely loved every bit of our meal.  The biscuits are ginormous!  Gravy is like grandma's home cooking.  Great price for what you get.  We will be back!"
        },
        {
            "date": "수정일: 3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGeDl2MkpnEAE",
            "text": "The service is ok. Very friendly. It's always busy. The last couple times we've gone our food has come out cold. Our potatoes were raw. But the coffee and the chicken fried steak was always hot. UPDATE!!. We gave it another shot. And everything came out cold this time too. The eggs, bacon, potatoes. Steak. The coffee still was hot. And the manager did give us a small discount. But still paid $38 for food that was unedible.  We took what food was salvageable back home to warm up. But disappointing. This use to be one of my favorite places. But 4 times in a row over the course of a year and we've gotten cold food. Also the waiting area out front was gross. So much trash. Granted it's not black bears fault that people are jerks and leave empty coffee cups everywhere . But clearly they don't check it often. Doesn't make a good impression walking up."
        },
        {
            "date": "수정일: 3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5dm9fX0d3EAE",
            "text": "Service was quick and friendly even with our large group. Food was excellent! This continues to be one of my favorite Black Bear Diners in the state. Never had our food come out so quickly, it was awesome!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KcE5XUXpiSGxzYzFORFpIcEVUR3hQTWxVeWQxRRAB",
            "text": "No crowd.  Breakfast all day.  Large portions.  A great value."
        },
        {
            "date": "수정일: 5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3Mk5ENGVnEAE",
            "text": "We went for the Canadian Thanksgiving dinner...the food was great and the portions were large...our ball team had a great time."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KeVUyOURXbVExTTNad1gxaHRZbXhIZEcxRU4wRRAB",
            "text": "Ordered the New York steak medium, but it arrived closer to medium‑well and was dry and tough to chew, which was disappointing for this dish and price point"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4c1VVWndZa1kyUkZndFFtSlJXWFZFVWsxaGJVRRAB",
            "text": "Amazing place HIGHLY RECOMMEND"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjeVdXNUpia1ZXYzB0RFNHaFZRbEZ3V1ZWRUxXYxAB",
            "text": "Wonderful service, quick and good food!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZNVlubHlUV0U1ZG1vMFRXVXhURVpuT0MxWE1XYxAB",
            "text": "Good food but it's a Black Bear"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2todWJXazNNVlYwUkRSTGRXSnlMVzlQVTNsemFsRRAB",
            "text": "Me and my mom came to have breakfast today.we ordered eggs hash browns and toast..the waitress was courteous  but not talkitive..the food came out fast..the hash browns were ok ..no seasoning tasted bland ..water was tapwater tasted bad..it was ok ..but not great.."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5MlJtMUVjVWRhWXpsVVUwOW5WVzlqY1doR1RVRRAB",
            "text": "Great food for both breakfast and dinner.\nFriendly and attentive staff.\nGreat value."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4aWIxWXRWR0UxYm10V05FRjNPVWxtYkZwaVZHYxAB",
            "text": "Go hungry, but go!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCcFQwMU9RVWd4VHpnNVJrUmxUVUZvWkcwd1JFRRAB",
            "text": "Coffee in white cups. great service and decisive recommendations from the slightly overwhelming menu. Food was solid. Good spot for hangover breakfast"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wbWRqZFhlbFoxYTNkZlYzUkhlbU5FUW5aSmFXYxAB",
            "text": "I ordered the caesar salad with chicken.   Very delicious."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5Vk1HVmlRM3B3UWxCalh5MVhWRTlGUVdSaGRHYxAB",
            "text": "Best food around as always. Exceptional service. Extremely huge portions."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5bWRGVkRjMGRrWlhoWFFpMDJTR0pzVG5aVlgwRRAB",
            "text": "The pancakes my granddaughters and I ordered this morning had chocolate chips melted into the bottom sides. Never seen that before and I have been eatting there several yrs now.  Didn't like them at all. As I checked out I asked the checkout/waitress girl about it. She had no idea."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBclluWDV3RRAB",
            "text": "Fantastic food.  Always really good.  Kiki was fantastic"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210TlVGWTRPR1JOV0dSSGRHdGFRMUphT1ZkdFptYxAB",
            "text": "We come here a lot and our go to is the orginal scrambowl!\n\nWhile cheap its usually very flavorful!\n\nWell unforthantly today as usual we got 2 scrambowls and everything was under cooked, no flavor, we got the meal compted but thats not the point, we wont be back for a while (also as a side note they were not busy, especially for a saturday morning and the staff seemed overwhelmed)"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdVluZEhMV3BRV1ZWbWFtNXNWMUZWZURkT2FWRRAB",
            "text": "The food was good. Our server was set on doing the absolute bare minimum. After our food was brought out we never saw her again until she brought the check. We asked for boxes and she acted put out by the task."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaQ2VYbHhTSGRRZUhsNlpITlBNVzVXTVRKT1QxRRAB",
            "text": "Delicious as always!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWdk0waDFNVXh6Wkc1clVUWktURmxPY25OR1IxRRAB",
            "text": "Excellent food and service."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kc04ycFBSVFZvYTJsQlZFbG1jbTVKZDBRMlVXYxAB",
            "text": "Great food at a great value.  Bonnie was great and very efficient"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBOGNHVmF3EAE",
            "text": "We dined here for a late dinner.  We ordered NY steak, Tri tip,  pancakes, & Mac n cheese.  The entrees came out within 15 minuses or so.   Waitress was excellent.  All the meals tasted great."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pReVFsUkVTVzh6V0VSbWNYaHliMmxqZEdoSGJFRRAB",
            "text": "Classical diner, everything as expected. Asked for nedium-rare meat, and we were served medium-well. Well, it's a diner... Friendly service, reasonable prices, good food."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBd0tlNDZ3RRAB",
            "text": "UPDATE…..\nThe quality of the food has improved.\nThey have a cook that gets my eggs done perfect. I think her name is Sara.\nEither way, i increased my rating\n******************************************\nThis place is hit or miss when it comes to quality of their cooks.\nThe first time i came the food was delicious. The next time i visited, the food was overcooked, dryed out and tasted like a dirty grill. I did ask to speak to the manager and they immediately went on the defense.\nI didnt go back for a long time, but when i did the food was ok.\nThe last time i went, i asked for eggs and hash browns to be light and they were overcooked and the eggs were brown. The bacon was burnt and not edible. It was so bad that i took pictures so i could send it to corporate, but Instead I decided not to go back. The waitress did take my dish off of the bill which was not expected but appreciated. Never saw a manager.\n\nPros: Nice atmosphere, decent to good service, large portions and it appears the company tries to deliver a quality product.\nCons: The cooks! Someone there doesnt know how to cook and preparing the food so far in advace, and having sit on a grill is a big problem. You will probably have better quality if go when they are busy instead of early morning."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oNFZHRTVZMnRUZFhKbVZWRnhjbVZwY2tRM1NYYxAB",
            "text": "Good food and great service!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VeGRGOHdaM0JrUkc1c1VYTjZUSEEwWkZsdE5VRRAB",
            "text": "Kenia was amazing, thanks for the service"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OdWJEUlJMVFZoUmxZNVNsQmFkMUpUWlVSRlgzYxAB",
            "text": "First time eating at a Black Bear Diner, I will be coming back! Our waitress, Kenia, was the sweetest, and the food is so good! I'm glad I ordered a smaller portion size because they give you a lot of food, and the biscuit was the size of my face!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWMVdVNWZlbXRXVEhkVGNteHRVV1JZTUVvNE9FRRAB",
            "text": "The fried chicken was a disappointment (let’s face it, fried chicken is difficult to do), but Dina made up for it with her smile and cheerful conversation."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200d1ZtWjNTSGRZU1d3M1JsRldZVVJvYmsxc1pVRRAB",
            "text": "Dina was such a joy, efficient and very personable"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5bldGa3pORXhqY2tabmFYUkpPVXBXV0VScFNGRRAB",
            "text": "Dina is awesome! We had 8 people, 4 being our crazy picky kids and she handled it all perfectly! Changed up almost everything to our kids picky needs. Food was large serving sizes, almost all of us brought some home b/c we couldn’t eat it all and it was all good!\nWe all had something different and everyone was impressed with their food!\n\nThank you Dina!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMVJuazNkVVp2YjJKWFMzcGpWa3gxZEhkU1lrRRAB",
            "text": "Dina was a great server. Food was likewise spectacular"
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRNXJtR0t3EAE",
            "text": "다시오고싶은 곳. 여행중 가족과 함께. 양은 엄청 많고 수제 버거와 질좋은 스테이크"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwamFxMlZREAE",
            "text": "콜라 후함"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvMFNqSm9NVE5HTWpjM2FraHRkVXRZYTNCU1UwRRAB",
            "text": "Stopped in for breakfast on our way to the North Rim of the Grand Canyon. The food was delicious and plentiful. The service was excellent! I'm not typically a breakfast food person so I love that you can order some lunch or dinner type foods in the morning."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4NFoySTVaSEpRZDE5Sk0zaE9OR1JUUXpKdVdFRRAB",
            "text": "Super friendly, kept the water full, and attentive. Definitely follow the \"credos\" of the company. Never felt rushed, good food, and the menu was what I love in a food place: hard to decide because it all sounds good. Being this is a close walk from the hotel, I'll be visiting again in the future!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQdlFyOXFHMGJtMEZnEAE",
            "text": "I love Black Bear Diners! And this one was no exception. If you like home style cooking and lots of it,  you can't go wrong with a Black Bear Diner. Portions are enormous and the quality is good. Our server was wonderful and attentive. She also was helpful answering questions about the menu."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Oc1ZrUmxOell4WTFSelEzQmxhbVZGZUZrdFpuYxAB",
            "text": "We were driving down the highway when I spotted the sign for this place at the next exit and I could not have swerved the car off to make that exit with more joy in my heart. I am from the East Coast and we don't have Black Bear restaurants out where I live, so when I spotted this on our drive I was delighted to share it's awesomeness with my friend. I adore the huckleberry lemonade and Huckleberry milkshake."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201bldUZFNjbTF6V1hGd1dEVldTa0ZWVkc1dFRGRRAB",
            "text": "The food was delicious, the atmosphere is very cozy, the service and attention was different from other restaurants where I go with my family for breakfast, the waitress hardly attended us, she took our order very lightly and did not want to solve our doubts."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NUxQaGl3RRAB",
            "text": "Our Server Chris, Sunday, for a Party of 10 was amazing! Great service even though he was slammed. All our food came out together and orders were perfect. Chris was attentive and had a great personality but not too extra, you know what I mean. This guy knew his job well and was very skilled! Black Bear always has good food, so it was his service that rated 5 stars"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBX2ZQV3d3RRAB",
            "text": "Great breakfast with outstanding service in a very thoughtfully themed country restaurant. This is a locally owned and operated restaurant with only a handful of locations. It is very popular with local citizens but they dont mind a few tourists popping in for a great meal. It is easy to find using Google Maps with plenty of free parking."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KRk4wSlBibmRWYzE5ZldpMHpaMk14T1VFd2NtYxAB",
            "text": "Service was good. Mine and my wifes food was not great. I got the chicken pot pie and it was full of mushrooms which was just not right because it didnt say it on the menu. My wife had fish and was not very happy. My kids all were happy with their food. Not really a place I would go back to."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205R1VtUlNNMWxIZEZWbVFtRXdObEJXTUd0Nk4yYxAB",
            "text": "Wonderful food served in a very pleasant environment. Our server was very friendly and patient with us deciding what we wanted to eat. Our drinks were kept full and empty plates were removed quickly. Overall it was a very pleasant dining experience for our group of seven weary travelers. We look forward to dining here again soon."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUGNuTXlWWHBLZVVWNGNVNUNNVXRoTVZONVFWRRAB",
            "text": "We had over 100 people at a Rally at Temple View RV Park and Brenda (the manager of Black Bear Diner on Main Street) catered 5 breakfasts and one of our dinners.  It was fabulous.  She not only had PLENTY of food but her personality fit our group so well.  I was in charge of finding the caterers and she was so easy to work with and great communication.  If you need any event catered definitely call Brenda."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVFRrZFJaa1IzY2t3eWQxbHRkMnhxVDFsRFRHYxAB",
            "text": "My friends and I usually stop here on our way from our annual Duck Creek trip, and it’s always a great experience. Today we went and had the pleasure of having Ezra as our server. He was nice and welcoming and was very genuine when it came to serving a large party (9 of us). His attitude was great and was very patient when it came to splitting the bill! Thank you Ezra!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WSlpXRllUVzlMTm5kTWJXSXhWWEZxYUVSNGQzYxAB",
            "text": "Haven’t been to the Black Bear diner in quite a while, and everything was perfect at this location in St. George, Utah"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdEtYMmd3RRAB",
            "text": "The food was really great, the service also was good, our waitress Gracie was so friendly and helpful.\nThe chocolate shake was awesome, so creamy 🤤\n\nMy only advice to you is, please, could you be more detailed about the cleanliness?! I noticed some parts of the table next to the window were really dusty and dirty."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdU1pTy1RRRAB",
            "text": "Typical diner options.\nWe ate breakfast here and will most likely not return.\nI asked for my corned beef hash to be crispy, it clearly was not even cooked on the flat top (potatoes were barely soft, meat texture felt like it was boiled), and portion was small. Served with a big bay leaf, yuck!\nEggs in the omlete were crisp and crunchy,  while potatoes and pancakes were cold.\nKids' meals were priced great, and portions were appropriate.\nMaybe it wasn't great as they were really busy and were in a rush to get orders out.\nWe expressed our disappointment to the waiter, and he did offer replacements, but they were busy, and we were just ready to go. Staff was friendly enough, but we never were offered refills."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUVkxRnNkRmhtUzNwcFZXdEpWV1ZYTkdFMmVtYxAB",
            "text": "Love coming here for breakfast the food is 10/10 & usually the service is great but not this time. The hostess sat us quickly but our waitress was either very tired or just rude. We didn’t get seen til 10 mins later, our drinks didn’t come til 10 mins after that, and we got no beverage refills. She seemed more annoyed and was rushing us to order & quick to give us the receipt."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdXBDdTF3RRAB",
            "text": "Our server Kiki was great! She was super nice and made sure our drinks were full!! The food was great especially for the cheap price!! Loved it!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGS2VqSnhRa0owVVhNeFNIaHNiMVJ0VUdORlFuYxAB",
            "text": "Great service, biscuits were a little tough but overall very good.\nGod Bless C.K. and his family!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdFJrcHdjRFZ4YmxabVlVMVJibGRPWWxkd1kzYxAB",
            "text": "We have been to a Black Bear Diner in Oklahoma City and liked it then. This one was just as good. We had a group of 6 and were eating super kind of early. The food was good and the service was good as well. My wife had purchased something at the counter and when it got left after checkout,  the staff put it to the side for us to come back and get it later. So good service all around."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swelVuUkpSVEpMVm1WWlRuRkZTWFZJVUc1RVZYYxAB",
            "text": "After a long 9-hour drive, stopping at Black Bear Diner was exactly what we needed. I ordered the classic breakfast pancakes, eggs, bacon, and sausage. While breakfast food usually tastes similar everywhere, what really made this place stand out was the service.\n\nThe portions were absolutely massive, easily the most food I’ve ever been served at a diner. None of us came close to finishing everything.\n\nWhat impressed me most was how attentive the staff were. Our server went above and beyond by constantly checking in, keeping our drinks filled, and making sure we had everything we needed. He even took the time to chat with us about our trip.\n\nAll in all, it was the perfect stop after a long day of travel—great service, huge portions, and a cozy atmosphere."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWU1FNUJkVzV3YVhaTFZFeE9RV3h0Tm5sQ2JVRRAB",
            "text": "This is what a diner should be! Friendly, prompt service, filling breakfast and big portions. Your coffee will never get close to empty here. For me, 5 stars!"
        },
        {
            "date": "5달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMcUs1X1hub1luZEhREAE",
            "text": "Auf dem Weg nach Vegas haben wir hier gegessen. Top Essen, super frisch und lecker. Die Mitarbeiter sind sehr freundlich. Preislich voll in Ordnung."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WR1JuWjRXVTlmTFV4eWNuWkdOWEJ1U2tkWVpYYxAB",
            "text": "After leaving Las Vegas and being shell shocked at the food prices, Black Bear was a wonderful find! The service was stellar! The food, amazing home cooking!  I had the pot roast and my husband had the turkey.  When they say the portions are huge, they aren't kidding; we really should have shared. I wish I had taken a picture, but we were very hungry."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSFdrVXhRV2hhV1hsR2NqVnBkMTh5TW5GWk9GRRAB",
            "text": "We eat here every time we visit St. George. Great food and the staff is always very friendly and helpful. Overall 3 stars because the bathrooms are always dirty and is a big turn off.  Additionally, the cleanliness of the restaurant area is pretty bad as well. Dusty windows and dirty floors. Management needs to do better in keeping the place clean.  Won’t likely go back for this reason."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKa1UzSlFhbEF4UW01RmRWSk9hQzB0TFdObU0xRRAB",
            "text": "Don't go to Black Bear Diner if you're not hungry because this wonderful diner serves A LOT of great, tasty food!!! The atmosphere is casual with a contemporary log cabin feel. Prices are are very reasonable and service is excellent. We loved it! You will, too!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTE1YRlZia2h6YkU1TGJreHpOMXBHT0VoYWFGRRAB",
            "text": "Dina was super!! She has such an amazing humor, so kind and helpful!! Definitely worth the visit!!\nThanks so much Dina!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNVlxem5nRRAB",
            "text": "We stopped in here for breakfast two days in a row.\nThe food like always was excellent.\nIt seemed to me that the weight staff was a little bit grumpy and then as I listened, they were having a situation with the way things are managed at that restaurant with scheduling time and someone and so forth I think they would be happier if they could work these problems out"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3OF9XdXp3RRAB",
            "text": "It’s a run of the mill box restaurant. It was good enough and as expected. Eggs were underdone, bacon was rubbery. Ordered the cinnamon roll French toast but I will stick to the pancakes instead. Close this restaurant for the friendly and vast kids menu."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201NlgwbFBTM0JPWm1kYU9XZzVNbEp0VW5SMVJXYxAB",
            "text": "Fantastic as always! Dina killed it and just kept making the rounds making sure the drinks were filled and needs were met. Very personable staff, and prompt service for 2 very hungry blue collar guys coming in from a late day"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdzl2aE53EAE",
            "text": "I absolutely love Black Bear Diner. Over the years, my family and I have dined here in a few different states.  When on vacation, we always chose to eat here over the other predictable chains, because we know the quality of food is great, the food options are plentiful, and the portion sizes are satisfying. Speaking of portion sizes… OMG, they are huge. The amount of food you received here is well worth the cost, and you will definitely walk away stuffed and satisfied that you got every bite of your money’s worth. For the kiddos, they definitely have something for even the pickiest of kids. There are also options for vegans, vegetarians, as well as meat lovers.\n\nOn our visit, we arrive on a Sunday around 4pm. There were only a few other diners there when we walked in. We were quickly greeted and sat at a booth. Our server was friendly, welcoming, and prompt to take our order. The food arrived hot, fresh, and was fantastic as usual.\n\nFor the most part, the restaurant and bathrooms were pretty clean. The carpet really needed to be swept, but I’m sure that’s probably because they must’ve had a busy breakfast/brunch crowd.\n\nOverall, we had a great visit here. I’d definitely return again the next time we find ourselves in St. George.\n\nHighly recommended."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLNjQtLWZ0eHBIb3BnRRAB",
            "text": "We stopped on our way to Page, and what a lovely surprise! Served very quickly, very good food, and a huge thank you to Kiki for her service, everything was perfect!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKRVdUbFhWRXRvV0c0eFVUbElOa0pyVW5neVZrRRAB",
            "text": "Typical dinner.  We are from east coast where diners are plentiful.  The portion sizes were huge,  good variety of menu items and entrees called \"a little less\" which gave you smaller portions or order 1 and share,  bill was about $35 for 2 entrees and a soda.  Cute gift shop and plenty of parking."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poRk9GSnJNVWhUTFRkSGNWSTJVbDl2ZEd0d1VFRRAB",
            "text": "Had a wonderful experience at black bear diner as always! We went later at night and our food was delectable and came out so quick! Dina was an amazing server and helped so much! Would recommend again!"
        }
    ],
    "reviews_count": 72
}