{
    "name": "Hana Hou Kitchen Utah",
    "place_id": "ChIJ3zAbOAxbyoARaVij7uHLeqI",
    "grid": "SI1",
    "address": "2190 S 1400 E, St. George, UT 84790, USA",
    "rating": 4.8,
    "user_ratings_total": 125,
    "phone_number": "(435) 627-4405",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xb1pGRTFZeTAxVG1NeWVYUTNWWFZEUjJ0dlZGRRAB",
            "text": "This place was fantastic! I thought the food was even better than what I’ve had in Hawaii. Each item (including the Mac salad) was well seasoned and had a lot of depth to the flavor. We tried the teriyaki beef, garlic chicken and Poke — all of which were 5/5 on texture and taste. It seems like they’re using high quality meats and ingredients. The gentleman at the counter was also very helpful in giving some good recommendations.\n\nI was a little skeptical because it’s a small place inside the St. George Golf Club, but it was super easy to locate and you don’t have to be a member or anything to eat there. If they opened a standalone location I’m sure it would be a huge hit."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVk5FaFRTSGhDVVVGblNXcE1SWEJ5YUdsV1RWRRAB",
            "text": "best hawaiian food in all of utah for sure! truly speechless"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUlEzTjVTR0YyVHpsZk1HSk5VRzlFUm5vd1FWRRAB",
            "text": "GO one street past what the GPS tells you, we got lost, but  don't give up. IT IS SOOO GOOD!!  The restaurant is next door to the pro shop which overlooks the golf course, such a cool view.\n\nWe got the Poké bowl, the short ribs and garlic chicken combo. Everything is made fresh to oder, right there.  It is the most flavorful, best Hawaiian food I have ever had!  I want to eat lunch there again tomorrow!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poVWEwOUdiRTgyWkRCelNIRnhRelV5YW1OblNrRRAB",
            "text": "The garlic chicken was good and so was the hamburger patty.  Next time we'll try the poke."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0NVgyVkdVaTB4Y25oWlQxaFRSSE5hYmxnMmMyYxAB",
            "text": "Just stopped in here to grab a bite before golf, some of the best golf course food I’ve ever had! Great customer service!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTUxWazFiRUpvVUROblpsVjJjM05qTkZKR2JYYxAB",
            "text": "Love the food, service, just all around awesome."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSQ1JVWTVhMlZuVTBOS1dFMDBMVFJoTVVaUGRGRRAB",
            "text": "Good thing we didn't drive from an hour away to eat here... And they were closed. The restaurant doesn't have a website listed on Google; just Instagram. Instagram doesn't say this restaurant is closed at all - but it's very much closed. It would have been nice if the restaurant updated its google entry."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOTFpqSnhiV2huYm5Ga2JYRnFVelp1UXpKa1VWRRAB",
            "text": "My Portuguese sausage was burnt, so I kindly asked the lady if I could get ones that weren't. Well looks like they didn't like that because the ones they brought back out looked like they were cooked for 5 seconds. I just ended up eating the burnt ones and threw the new ones away because they tasted like they weren't cooked. Don't own a restaurant if you can't take customer's feedback without being petty. The garlic chicken was delicious though."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBeU5uSndhM2hEV0VOb01FTkZTa2Q2YTA1c1QxRRAB",
            "text": "Amazing poke and garlic chicken bowls. Guava bbq chicken also was great. Large portions and good vibes. 10/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxUmQzTlZSbFpVZUdaUVlVSnhWV3BDZERWVFFXYxAB",
            "text": "Actually authentic Hawaiian food!! Don’t waste your time at Mo Bettas this place is fire!! 🤙"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbVdVdFFaR1pIUjA5alNWSlJXRFV4YVZKUVIzYxAB",
            "text": "Food was average at best. Teri beef was tough. Garlic chicken was bland. And the owner was rude and disrespectful."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWFNYQkRRMGhSV0Y5eGVsZFNWVkZoY2tac2RFRRAB",
            "text": "Hidden gem! Best Hawaiian food in Southern Utah."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNWFqTk5TMkZZT1V4WVF6SlBNbkUwY2psZmQwRRAB",
            "text": "Omg love this place. The Teri beef was so tasty. Great service. We'll definitely be back. Can't wait to try the poke!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5QlJrZG1hMWhJUm1ZMWJETlFlRzVhYXpGQ2FsRRAB",
            "text": "Came to visit our son for the weekend and he told us about this place, knowing they close at 4pm we made it in by 338pm, seems that one of the owners was bothered to have another client (new client) inside the establishment as it seemed that he and his staff (family) were closing shop. The owner was bothered that we had 4 orders only because we had to wait on a text .. order placed and completed by 444pm.. didn't feel welcomed at all, and as he said , \"we do well here and we can close early\" I totally get it, work life balance is important,  I know that especially being a bank manager and running large offices in California,  so I understand work life balance, just don't be rude and cocky,  I also know business , but also know patience and extra buck coming in through my doors! Have a good day 😊"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VMGJVa3hObU5OTkdselZHYzRPR3B1TjJKbVJuYxAB",
            "text": "Crispy garlic chicken, melt-in-your-mouth Kalbi ribs, and poke nachos you’ll dream about. 🌺🤙🏽🌊\n\nWe stumbled across Hana Hou Kitchen while looking for a dog-friendly restaurant in St. George and ended up eating here two days in a row — it’s that good! If you’re craving authentic Hawaiian food in St. George, this is the place to go.\n\nDay one we tried the Hana Hou Bento (crispy, juicy garlic chicken with rice, eggs, and spam) and the Hamburger Patty Omelette loaded with Portuguese sausage, green onions, and gravy, plus a side of smoky-sweet Kalbi ribs. Day two was all about their fresh, flavor-packed poke nachos on homemade wonton chips and the hamburger steak… with another order of Kalbi ribs, because we couldn’t resist.\n\nEvery dish came out looking amazing, with generous portions and bold island flavors. The garlic chicken had the perfect crunch, the poke was fresh, and the ribs were tender and full of flavor.\n\nThe service made the experience even better. We met both owners, Josh and Paki, on different days, and each gave us great recommendations and made us feel right at home. You can tell they genuinely love sharing their dishes and their aloha spirit with customers.\n\nLocated on a golf course with a clean, open dining space and great views, Hana Hou Kitchen is a pleasant surprise. It’s easily one of the best Hawaiian restaurants in St. George, Utah, and we’ll definitely make it a regular stop whenever we visit. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sd2FTMUNPRzExWTJZM2FWbFZXbE55VmpVNFVrRRAB",
            "text": "Best island food out there!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trMlZXSlBZV05ZZWs5R1ZrRTVjbFJIU0RaSVpGRRAB",
            "text": "Really great place to stop and refuel on the way back to Vegas after a long weekend in Zion.\nOwner really made us feel at home too.\nAnd hey, if you call the big guy by his childhood nickname which is ‘faka’ he’ll give you something for free!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoQk0ycFVWbGx5U1V4RldEZG1NMWgzV0RrNVRGRRAB",
            "text": "Great food , even better people. I got the surf and turf and loved everything on it. Garlic chicken was money too! Will definitely be coming back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OU1RuUlVjblZWTW5admNHaERUVmxTY1ZsRGIyYxAB",
            "text": "Great view, delicious food, super passionate owner. Secret gem."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psSlEwTjNTbFp5UjAxVWVWazNiRlI1V21ZMFprRRAB",
            "text": "Great food. Very friendly. Garlic Chicken was incredible."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCYU1tZHRTMjFEUzB0cU1UaE1Za3hMTkdwdE4wRRAB",
            "text": "Great food great service!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKcU5IRldYMU5NVDNKaVpIQkZUV3gwUVU5dVMwRRAB",
            "text": "This might be some of the best take out I’ve ever had no joke. It is seriously amazing it’s just hard to find bc it’s in a golf course but it’s a must try. Garlic chicken or poke."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OVWFHZDNaR0V6YW1oSFIzVkliMDltU0VWcFpsRRAB",
            "text": "Some of the best Hawaiian food I’ve ever had! Came to St George on a family vacation, some of which are picky eaters, and everyone LOVED the food. Amazing service as well! You can tell the owner really loves what he does and makes it a fun, happy, and inviting environment! You also can’t beat the views! 10/10 highly recommend! We will be coming back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OMmNsWjZSRkZxTUZrNUxWSnROV0pLY3paR2FGRRAB",
            "text": "food was so amazing and the owner was so awesome i will be coming back !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKZmJXeHhNbTl5TTNWckxVbE1TbFJvUzBORFRsRRAB",
            "text": "The food was absolutely delicious and perfectly prepared! The customer service exceeded our expectations. We can't wait to come back the next time we're in St. George!I’m"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4MVIyUTJhbnBFT1ZJdFRWcEJkRkZTU0hGdGIzYxAB",
            "text": "We were craving some Hawaiian food, so we decided to stop in. We got the garlic chicken and the teriyaki beef plates. They were wonderful! Nice big plates of freshly made food. The staff was friendly, and the view of the golf course was pretty nice. We will have to come back to try the ribs :-)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kMlNrNU1VMHBqVUZONk4xbEdUV3B1VTFGNU1XYxAB",
            "text": "WOW! Just had Hana Hou for the first time. Loved it! The Garlic Chicken is so good I cant wait to have it again.  May have to wait until tomorrow."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FMVZqVXpXbTVxVjNwa1JscGlMV1Y1WjB0TU1uYxAB",
            "text": "Great food and very friendly owners. Its inside the golf club house but its amazing g food and service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WRFUzZElPVEphUjJOcE0xaEZhbTVDVmtrM1EzYxAB",
            "text": "The food is delicious and the staff is friendly! I highly recommend the garlic chicken. They also sell homemade banana bread that is really good. It seems like you can’t go wrong with anything you choose!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRU5rWllSR000VDBWUU5ERjJPVEpJUzJOWWJsRRAB",
            "text": "The food was absolutely delicious! The owner came out from behind the counter and asked us how everything was and had a whole conversation with us. The garlic chicken ws crispy, and went well with the Mac salad. The poke was amazing!!! Super fresh and refreshing. I hadn't had poke like the before but it was the best one I've had ! If we lived in the area, I would eat here more often that's for sure!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psT2Nra3lkemxJWlcxMlMyOUtTemhIV21KTlNtYxAB",
            "text": "Simple, relaxed restaurant in the St. George Golf Club clubhouse.\n\nThe service was great. The food was pretty quick, considering it was all made fresh. I ate the Garlic Chicken and Guava Chicken in a combo. They came with rice and Mac salad! It was delicious!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poRU5uQjNSVlJwZVhGWVVXaFBlR3ByWTIxeFNVRRAB",
            "text": "This place was one of the best in Stg.  Great views,  friendly staff.  I had their chicken and their poke.  Both were very delicious!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOMzF2SlNxbjZud25BRRAB",
            "text": "Best Hawaiian food outside of Hawaii"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMU1g3N3FmbnQyT1V3EAE",
            "text": "Food is very “Ono”(delicious). This place never fails. You’ll get more than enough food for the price. Atmosphere is very relaxing.  The owners makes everyone feel like family. You won’t be disappointed."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMX3RtZEN0anRtLTB3RRAB",
            "text": "Hana Hou Kitchen is spectacular! I got the garlic chicken plate & my partner got the guava BBQ chicken plate. Both were extremely delicious. And the people are so kind! Josh & Paki have done an incredible job!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOXzFwNlRWcXRQWkNREAE",
            "text": "Went here for a networking meeting. Everyone in our group said their food was amazing including mine. I got the poke bowl. I tried a couple of the other items and they were delicious as well. The service was also awesome. I will be definitely be taking my family back for a try."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMRGpzYnEzNWI2alBREAE",
            "text": "Kind people and great food! Would recommend to anyone here in Southern Utah!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPLXEtTUdQeHFTZ0RREAE",
            "text": "The Short ribs are fantastic!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQUGxtcDJfdTVfLUx3EAE",
            "text": "Great, delicious, fresh. Give it a shot 👌🏽"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOQ1o4SUhENU5yZzdRRRAB",
            "text": "Yummy !!!! It’s so good, garlic chicken, spam breakfast, loco moco and the kale I brings me back to Hawaii! The owners are so awesome!"
        },
        {
            "date": "11달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcWR1aWNBEAE",
            "text": "갈비가 아주 맛있다"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLX3d1TS11eWNIU0JREAE",
            "text": "Great lunch with a view. Husband had the garlic chicken and Teri beef. I had the Teri beef plate. Portions were large; we could’ve shared one meal. The food was delicious, and I will definitely come back to eat here when visiting the area. Their Mac salad isn’t the traditional way you have it in Hawaii, but still great in its own way. In fact, I may actually like it better."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MXBucjl3RRAB",
            "text": "Garlic chicken was tasty! I liked their spin on Mac salad, it had a garlic taste to it that was quite good. Also tried the short ribs. Awesome flavor.\n\nI found myself wishing I had a little more sauce or something with my meal, maybe some kind of drizzle or something would’ve been really good over the chicken and rice. Price was a little high, $22 for my platter.\n\nLocated in the golf club in the middle of a neighborhood, so you’ll be unsure the first time you go, but it’s in there!\n\nI’d love to go back try out more from the menu."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMzlDNHJRRRAB",
            "text": "This is simply the best Hawaiian food in St George! The flavor is amazing. I tried the\"Surf and Turf\" plate today. I selected the Sweet and Spicy Poke and the Garlic Chicken. The plate came with rice and a Mac salad. The whole meal was fabulous! Truly!\nGetting to the restaurant may be confusing to you... It's actually located inside the club house of the St George Golf Club. There is seating for about fifty and the view over the golf course is beautiful. The service is friendly and accommodating. I HIGHLY recommend you give Hana Hou Kitchen a try."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3Z0xiN2pRRRAB",
            "text": "This is a hidden gem in St. George. Grab a plate of the best Hawaiian food in Utah, and sit with a view over the St. George golf course. The service, atmosphere, and mouth watering deliciousness can’t be beat! Definitely will visit again when we are back in town!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRZ2JQUzF3RRAB",
            "text": "This is the absolute Best Hawaiian Food ever! So fresh, flavorful, and consistent! The poke is out of the world!\nEnvironment the owner has created is welcoming and the views are spectacular"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQM3REdEl3EAE",
            "text": "Not only is the food delicious but the service is amazing as well.  I’ve gone three days in a row because the food is so delicious it is almost addictive.  The garlic chicken is the best fried chicken I’ve ever had. The poke is fresh, flavorful. the Kalbi and Teri beef is seasoned to perfection and cooked perfectly.  When I got my kalbi the owner looked at it and said “this is burnt, that’s not what we’re about” then proceeded to cook us more, no questions asked.  I’ve never understood starting a restaurant and not putting everything into making each dish memorably delicious.  You can tell they put their all into each dish.  Amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuMFBMNHVRRRAB",
            "text": "Food was super good!  Broke da mouth!  It's legit plate lunch from Hawaii.  It will definitely be a regular place to go when I am craving poke and local Hawaii food.  Atmosphere was nice.  The restaurant overlooked the golf course.\nOwner was super friendly.\n\nMahalo for the awesome food and service!  Will be back soon!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfc0ttQ3pRRRAB",
            "text": "Found this gem while driving back to Vegas, and I’m glad I did. Food was amazing, even better than what I had in Hawaii! My favorite was the garlic chicken. The owner was super friendly, and they’re one of the few places in the area open on Sunday’s as well."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3c05laTd3RRAB",
            "text": "The owner is so friendly, the food is super flavorful. Great portions too! They have a unique twist of their own!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzM0p2OG9RRRAB",
            "text": "We were craving Hawaiian food after a weekend in Zion, and this was the only Hawaiian place open on a Sunday. We were hesitant because they didn’t have kalua pork (my favorite), but my mind was blown by the garlic chicken! It was so moist, crispy, and flavorful! We also got teri beef and tried the guava teriyaki sauce, both incredible! Everything was hot and freshly cooked. Some of the best Hawaiian food we’ve had! The owner was so welcoming and the view was beautiful overlooking the golf course. Don’t be intimidated by the location.\n\nIf you want Hawaiian food in St. George, this is the place to go - don’t waste your time going elsewhere!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIN2N2VjZ3RRAB",
            "text": "10/10!!! The quality and freshness of the food was great. We love to support family owned businesses. It was super clean inside, they have a great view & the owner and his daughters were super friendly. Would highly recommend & we will definitely be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuLVBHemFBEAE",
            "text": "The food is excellent and perfect for the early bird golfers (they serve 7 a.m. breakfast), a pick me up lunch, or a beverage to brag about scores, or a beer to just cry in.\n\nService is quick should you be rushing for a tee time or grabbing something to much on the course.\n\nAmbiance is quiet as the \"kitchen\" is nestled lower on the street with no audible street noise, yet anchored by views of the St George Golf Course.\n\nMy lunch partner and I shared a poke bowl, which can only be described as melt in your mouth yummy. The ahi was delicately sliced, with slivers of onions, edamame, honey, soy, and probably a bunch of secret ingredients. If using fingers, you'd lick them for sure (we used our forks).\n\nFollowing previous diners & Paki's recommendations we ordered the infamous garlic chicken. It's a bit spicy, but not too much. The garlic was perfect and a nice ratio to the deep-fried bite-sized boneless chicken pieces. This dish is packed with flavor.\n\nKalabi short ribs were ordered by my companion, anxious for a taste of home. These thinly sliced and cut into 4 pieces each were succulent and bone sucking (it's all about the marinade/sauce).\n\nEach dish was accompanied by the traditional scoops of rice (clumped/sticky) and the omnipotent side of mac salad. There is also fountain sodas as well as Hawaiian canned sodas and juices.\n\nThe cherry goes on top of this sundae as locals were getting takeout when we arrived and a table of 8 \"Islanders\" were happy as could be for homestyle cooking, vowing to return the next day for another meal.\n\nThere is more eating than talking, and quiet hums, ums, and smacking of lips which is a testament to the cook. Nothing like comfort food.\n\nOh, we'll be back. Mahalo for making Saturday's excursion so much fun and rewarding.\n\nPaki & Josh we wish you much success. St George residents Google the address and set your GPS, oh be sure and check hours.\n\nBTW 4 stars is because I know there are more tricks up your sleeves and other services you'd like to add. The missing star allows for growth and dreams.\n\nAloha"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNicW8yUFVnEAE",
            "text": "My fiancé and I went to lunch at Hana Hou to try out our newly found FAVORITE local spot! The Hawaiian food was delicious. If you haven’t had time to try it, you’re missing out!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbEtucTVBRRAB",
            "text": "Amazing food, I had the garlic chicken and it was incredible. The Ahi Poke bowl is also amazing, they source their fish straight from Hawaii. Great spot to relax and eat as well with a view over the golf course. Decent beer selection at reasonable prices. Truly one of my favorite spots in St. George and some of the best Hawaiian food I've ever had."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2b2FlZnpBRRAB",
            "text": "No fuss place. Great food and service. Highly recommend Hana Hou if you crave Hawaiian food in St. George."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLTER2X3FIbWZxT2RBEAE",
            "text": "This is the real deal!!! Finally!!! After growing up a bit on Oahu, living on the big island for years and again on Oahu raising our keikis. We moved to St George, UT. Always craving a true authentic mixed plate or poke. None of the Hawaiian food places truly satisfied this. Hana Hou is da kine!!! Everything made fresh, treated like Ohana and brought us back to cruising the Island and stopping to grab some mean grinds. Thank you Hana Hou for keeping it 💯"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMVp5eEZnEAE",
            "text": "We found this place as it is the only Hawaiian food place in Saint George that is open on Sunday.  Until we ate here, we didn't even know this area of town existed!  Although the facility itself is nothing fancy....it is a golf course cafe, after all.....It does offer a spectacular view!  The food was outstanding, seriously the best Mac salad ever, and the service was great too.  This might be our new go-to for Hawaiian!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3Z0tpb1RREAE",
            "text": "What incredible food. Authentic island food at a great price. Serving sizes are amazing. And I cannot say enough about the guys running this place. They came and checked in to make sure we liked our food and they are the kindest."
        }
    ],
    "reviews_count": 59
}