{
    "name": "Viva Chicken",
    "place_id": "ChIJG-SJXiZbyoARBuLyQJ6BDtA",
    "grid": "SI1",
    "address": "1183 E 100 S, St. George, UT 84790, USA",
    "rating": 4.7,
    "user_ratings_total": 5499,
    "phone_number": "(435) 319-4632",
    "reviews": [
        {
            "date": "8시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVNVRtSm1OVTlOWVZBNE5WbHVVR2x1YVhkRFltYxAB",
            "text": "Brooklyn is the bomb. Great help, awesome food!"
        },
        {
            "date": "14시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKS1gydzBVRmM1VDNKNlNETmFVR3AxZVRjNWExRRAB",
            "text": "I received very good customer service from Norma. The chicken was very good, but the avocado was not fresh (black) in some parts."
        },
        {
            "date": "15시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkTVdsVmxPRVpqYXpReFZXTktaSEZ1WVdsVU4xRRAB",
            "text": "Delicious! Yolanda was super kind and helpful in deciding what to order and helping me sign up for the rewards program."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrMkxVWXRkV0ZIT1dSNlpHMU9Yek5DZERCSlQyYxAB",
            "text": "Deysi assisted us while ordering. She was so friendly and extremely informative about the menu. She was great about reminding us about other menu items we could add on, without pressuring us to do so. This is a great example of customer service."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbGFtTjVXbVZEUlZCeGVWbFBNWGR1UTNOb2VHYxAB",
            "text": "Absolutely amazing chicken."
        },
        {
            "date": "수정일: 1일 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGeHFtOEtREAE",
            "text": "Este lugar nos encanta, vivimos en la costa este del país pero cada que vamos de vacaciones por el área obligado tenemos que comer ahí,  la comida es super rica, sus ingredientes frescos, relación calidad precio muy bien, todo limpio y no importa si hay fila  te atienden amablemente y super rápido.\nMe encanta el menú es muy variado y lo mejor es el pollo a la braza.\nTiene un área acogedor y amplio para comer en el lugar."
        },
        {
            "date": "수정일: 1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sQ1EzSkdTMjQyY205VVZFNUhaVE40WVVWZlZVRRAB",
            "text": "SO YUMMY! This place is just IT! I've been to this place three times now and every time it gets better! Two times I've rolled in 10 minutes before closing and they are so nice about it and still serve me! The sauce is BOMB, and the food is delish. The workers here are absolutely amazing and I'm coming here every time I'm in St George no matter what!.... *I'm back again and this place still slaps!!! Still so yummy and the workers are great! Fernanda has taken my order a few times now and she's great 👍"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2podFdUWTFjSFJYV1ZwVk0yVnJSV1pwYWtoVWEwRRAB",
            "text": "Yum! Thanks !"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1U2NYaHhTMlU1U1ZWT1RFZE9PVjlqY2pWRVRtYxAB",
            "text": "We love Viva Chicken. Good food, always clean, and friendly staff. Fernanda was so helpful and accommodating."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSGJFazJTMmRITTNrdFNVZ3hZMHhIUkRKc2FsRRAB",
            "text": "Love this place and Fernanda is the best!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oaFZGOWpSRkZPYkZCVlpGSk9XVTB6UTI5bmJYYxAB",
            "text": "Fernanda was very patient when taking our order."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2padUxYaDZTbWxzWVZRNWIydzFabTVKV0VaTE4yYxAB",
            "text": "Great time with a friend.  Brooke was attentive and made sure to check on us often."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WNGNtMWZSMnRaTVhSUmJXSlBia3RMY1hrMFZWRRAB",
            "text": "Me and my sister went to viva chicken and had an amazing time there. We had the half chicken with double French fries and tasted delicious, just like a Peruvian pollo a la brasa. Kate gave us an amazing service, she was very attentive to us and was there for everything we needed. Would 100% recommend."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wMldDMUtSRzlHVTFNellXZDZWM05rTTJ0VlkwRRAB",
            "text": "I love this place and I love their employees! Kate was so helpful and sweet!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCV1RVOVJPV1kzYlRCT2FFeG9la1pYUlMxNVFtYxAB",
            "text": "I got to try Viva Chicken for the first time today ! I ordered the Inca burrito with regular fries and AJ took my order really fast and recommended his favorite option and I loved it and after he got done he got right back to cleaning tables and restocking stuff he’s such a hard worker and is really funny!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21abWRtOWZPRUZZV1ZkdWJEWnFOWE5QYzFKTVNIYxAB",
            "text": "Johan was great"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swMFZrNTBjbk5HV2xwSFRsRjFaRk5UVUUwMVlWRRAB",
            "text": "I love the food here. The plantains are amazing. I wish they had a SLC location. Seating arrangement could be improved."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sR2IzTmlia1V6WDA4MVVWZHhUMDVNT1dSRlVWRRAB",
            "text": "It was great to dine in."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NE9XUlJhVzl1WW0xb1gzZEZjVEpETmtoaFpGRRAB",
            "text": "Brooklyn is the best!!! She was so kind and professional and had the best smile to brighten anyone’s day."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SeFJuTkNMVkk1TUdzMU9ERTFhRXR1TlY5TlVuYxAB",
            "text": "I was assisted by Yolanda on Halloween night, and I was amazed by her customer service. She was helping a very high quantity of holiday customers with an incredibly cheerful presence—and with such great efficiency! She deserves a shout out!!!"
        },
        {
            "date": "수정일: 3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVemFWZFNhazVsYVRrMFF6aHJaWE50UjFOck1sRRAB",
            "text": "Brooke did a great job taking our order."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210clVXTkZSbWxOUTE5VE1HbHdaamN3U0RSMFRsRRAB",
            "text": "Great food! Thanks Brooke."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFNVJYQkpiV3RWVEZWNWJVeFlRbVU0UkZKU2EyYxAB",
            "text": "Brooklyn was amazing!!! Always love this place!!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toQ1UycEpjRmhvT1Y4eVdFRkVYelJOVEZwUGRXYxAB",
            "text": "Food was good, service was great and great atmosphere. 😊"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMlNuSlBVRXBUVWtscFkwUjRSa3QzZVRGNmRuYxAB",
            "text": "Never drive through St George without stopping here."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWVFlXUjZPRzR5VkdSS2JHTXRhVzFPTVRSamVIYxAB",
            "text": "First time trying this restaurant and it was great overall. I had the 1/4 chicken (white) with cilantro rice, beans, and plantains. The chicken was a little dry and the cilantro rice a bit over cooked. The beans and plantains were very good. Brooke at the front of the house was helpful and very polite. I will return!!"
        },
        {
            "date": "수정일: 3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzLTdqSERREAE",
            "text": "The food here was sooooooo flavorful, healthy and good. And it came surprisingly fast! We eat here every time we are in St. George, even when it's out of our way! Wish there was one closer to home!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kSlMwSk9iMnBuWlhWa1owRk5ha2RDUzBkdE5FRRAB",
            "text": "Brooklyn was so cheerful and helpful as well as efficient!  Great place to eat!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVWIxUjRkbFp2VEZwV2VFZHpNWE5RTUdKSlJWRRAB",
            "text": "Brooklyn was so cute and so sweet, she was amazing!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZNFF6SnFXVTl5U1ZCdFpVWkhOazlMVWxBMlIwRRAB",
            "text": "Brooklyn was great"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxb1ZIbzVWakpZY0ZCM2FXUlpUVGg1YjFsc1JXYxAB",
            "text": "Brooklyn was great!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkbWNUWnhkSGcyV0VKdmNsaFVNMWxGU1dWb2RsRRAB",
            "text": "Brooklyn was our host and she was so friendly and helpful"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMFJEVmhjR0ZYUTNKZlEwZDZkMjE2ZFRFMk1FRRAB",
            "text": "Brooklyn was so sweet! She made us feel very welcome!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRE1EYzJWMWRCTWpkcVNERjFWREEyTW0xd2JVRRAB",
            "text": "The food was great no complains from me. Our server AJ had a really good energy and supplied some of the kids with some candy and always rebounded with our jokes. Great kid. And he made sure to ask the chefs if anything was gluten free for us."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTlozQmxiWEE0TURkWU5XY3phVEZOTWtkR05HYxAB",
            "text": "The food was great the chicken was a bit cold but not bad. AJ our server was amazing he really took time since it was our first time here to help us get the best choice"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSd1IzZGhMVE0yY1U4MmMzZFZNRE5VY0ZKTk5VRRAB",
            "text": "Love coming here every time I visit St. George. I had AJ at the register help us out this time around and was the sweetest guy and very patient with us, will still be coming back!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNdFVHdDVOWGgyWDFOTU1GSTFNRmxHUm1OWGVuYxAB",
            "text": "AJ took my order. Great employee. Great food as always. I come here about once a month and it’s always great"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zeFgzbDFSbTFQV25vMVpsWlBWVm8xYzJsRFkxRRAB",
            "text": "Multiple menu choices. Great flavor and value."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSUGIxcHpkblptVkdReFJYbzRZemt4YlhsdE1IYxAB",
            "text": "AJ was very quick to greet us and friendly! Great experience! Food was superb as usual!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNd1JteENkazFmZEc1UlIxVlVVV1ZVWWpWelEzYxAB",
            "text": "AJ was super helpful. Food is great!"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0eUxYbE5nEAE",
            "text": "마싰어용"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOcWVWRTVVMnhuZDFwYVpHaE5OalJDT1hoaWMzYxAB",
            "text": "4.5 stars! Great spot for Peruvian style rotisserie chicken. We came here on a Friday afternoon for lunch on our way to Bryce and I'm so glad we stopped by! They have a limited menu, which is great because that means they can do a few things very well. You order at the counter, get an order number and find a seat. The service is super quick. My husband went to the restroom and by the time he was back 5 minutes later, the food was already at the table.\n\nWe ordered the Peruvian half chicken with fried plantains and purple corn salad, and the tacu bowl without chicken. We also got the chica morada juice. The food was excellent! The chicken was cooked to perfection and it was actually quite a bit, so we ended up eating it by itself and with the tacu bowl. They have 3 sauces available - a sweeter amarillo based one, a savory cilantro/huacatay based one and a spicy rocoto pepper based one. I liked the latter two and my husband liked the first and the third one. The fried plantains were very good - not overtly sweet, not overtly chewy. The corn salad was very interesting! We haven't had purple corn before but basically, it is much bigger corn than usual. The salad had a mix of blue cheese, beans, onions, etc and it was delicious. The tacu bowl was also very good but it definitely needed a little more seasoning. Once we added the chicken and the sauces, it was perfect. We ended up taking 1/4 of the chicken and about half the tacu bowl as leftovers. When we ate it the next day, it was excellent! The chica morada tasted like a spiced cider. We thoroughly enjoyed it.\n\nOur price tag was less than $30 for two people and it was great food. We highly recommend coming here if you plan to be in St. George!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WU01ucGxaM1JvYlhsTkxURnZjMEY0VVZWaU1GRRAB",
            "text": "One of my all time favorite lunch spots in St, George, UT just off 100 South. Norma assisted us today and she is so sweet! I love the vibe here and the food is exceptional! The naked wrap, fries and this refreshing drink are my go to!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJTEE5LXZnLWJ6SWxRRRAB",
            "text": "If you are coming from Vegas towards Salt lake and looking for lunch places, this is it. The food here is really good. We ordered chicken burrito, a limero chopped salad and half a chicken which came with cilantro rice and fries. We also ordered sweet potato fries which were really amazing. If you are looking for a side of your dish, do opt for sweet potato fries. The only disappointment was the rotessrie chicken which almost feels like the one sold at Costco. Special mention to the sauces. They are amazing and doesn’t taste like your usual hot sauces.i also loved the mint lemonade. Its refreshing. A special shoutout to the staff there, how I wish I asked for his name. I asked him a favour of cutting up the avocado which I got from come for my 10 month old kid, not only did he cut it up but placed it is a bowl of lettuce.\n\nAtmosphere is really lively."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sR2NrMXhSR0ZTZFhKSVIwWXRabkpNVFd4MGRuYxAB",
            "text": "Very fresh. Reasonable prices. Nice break from the typical burger joint. Easy with kids. Clean. Friendly staff. Fingers crossed that these guys stick around a while. Really enjoyed eating here and will be back again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVmFXcHVlWEZoZGtSWmQydHVNMVZTT1VsRk5sRRAB",
            "text": "Perfect spot for a quick bite! Despite the lunch rush our food came out so fast.  Fairly  priced with high quality ingredients, and a hardworking staff who gave wonderful service and maintained the dining area despite it being so busy! Special shout out to Yolanda, she was very friendly and helpful! We will be back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKc2FFRlhZbU0wVDFCdFh6ZzJObkZJTmsxM1VVRRAB",
            "text": "I dropped by this restaurant on the way back to Nevada after visiting Zion national park. The food was amazingly delicious. I had the chicken breast with the yuca and plantains. Very good 👍."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkUFFXSlRaVXRHVlVwc01HTmpVRTFyYWtOQ2NXYxAB",
            "text": "Johan was great, he made recommendations on the drinks and sides. Fresh hot food, I would recommend bring orders together when there is more than one order on the ticket."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJakU5UERLcFlTR0hREAE",
            "text": "Quick and healthy meal and good value. The salad was a bit disjointed but fine—it felt like it didn’t fit together all that well, but the separate parts were fine, and there was a good amount of chicken when I added that. My friends liked the half chicken and a steak dish. The aguas Frescas were nice. Plenty of searing in a sort of chipotle arrangement with both low tables and high-tops."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLMzFucnFueTlEcWJREAE",
            "text": "The best chicken I've ever had, and I can't put it any other way. The staff were excellent as well, Norma gave excellent service. Oh and the restaurant was impeccably clean. I stop here EVERY time I drive through St. George and you should too!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTVEyUTJSR3AwWVhwaGVYQk1ZV05mYjBoT2RVRRAB",
            "text": "Honestly this is one of the most impressive restaurants I’ve ever been to. It’s honestly hard for me to think of an aspect of my experience that wasn’t 5 stars. No joke! The food is fantastic and the value you get for the amount of food you get cannot be understated. This will definitely be a place that I will continue to come back to every time I’m in the St. George area. They really outta expand Viva Chicken into the Salt Lake valley. Amazing food, service, and value! What more can I say."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poaVJtMVVXRjlXUzFWclNubHZVRVpvVEc1T1NHYxAB",
            "text": "Norma was amazing and so nice, she let me taste the different drinks and the salad I ordered Tasted amazing. Definitely coming back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbjlybFl3EAE",
            "text": "This is one of those fast casual places where you order, sit, and they bring you your food. The person who took our order was nice. The food was super tasty, I highly recommend the green beans. I know unconventional but they were the best . The fried rice and rotisserie chicken was also good. We got a lot for the price. There was a lunch time rush, but it was not an issue getting a table."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KQ1ZWVk9WekpqVlRCaGJuTTRlR3RuWDJSck1tYxAB",
            "text": "Best place I have ate at in a long time. I would for sure recommend to try viva chicken. They have many options and the staff is kind & welcoming. I was helped and taken care of from the moment I walked in to the moment I left. So yummy!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CRVgzSjRSemQ0UWs1M2JscDZlSEJGWlZodmVIYxAB",
            "text": "I’ve been eyeing this place since we moved here a year ago and today I finally went. Why did I wait so long?! Norma was super friendly and helpful. I let her know it was my first time and she recommended the steak saltado with the green and yellow sauce. Food was amazing. Great flavor, hot and fresh. Definitely would come here again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201MFVYUlVVVXB5TFRacmFraDVWMFJ1Y25sU1UxRRAB",
            "text": "I absolutely loved my experience at Viva Chicken! The food was incredible – the chicken was so juicy and flavorful, and the sides were the perfect complement. Every dish tasted fresh and authentic. But what really stood out was the service. Everyone was so friendly and welcoming, making me feel right at home. I can't wait to go back! Shoutout Jason shoutout Lyla shoutout FROM KADE ROBINSON"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toRVlUTmxYMFpVVDNkWFkybzRRbWhoZFhjM01tYxAB",
            "text": "We love Viva Chicken and our local restaurant, but would not recommend their catering.  VERY high price for what you get.  They delivered on time but tortillas were missing and there weren’t enough sauces - and the cost was not worth it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xT2JtOUpha1pXZWtOd01tVXlTMDFyTmpKTVFrRRAB",
            "text": "This is some of the best, wholesome, and most flavorful food I've ever had. Everything was so fresh! I was especially impressed with how clean the restaurant was. Lots of delicious choices on the menu. I couldn't decide so I made the nice young lady who was helping me, pick a plate for me. She didn't disappoint! I'll definitely be coming back here again and again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vdGRtTjROVFptZDNWRmFETlBhVk42TVMxM01uYxAB",
            "text": "I love viva chicken - good food and friendly staff! Huge shoutout to Sistina! She greeted us with a huge smile and was super helpful with our order!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4VGFVbG1UalpSZG1zeVEzSXdkMmxrYlhNeFZIYxAB",
            "text": "First timers.   Brooklyn was very nice and helpful in guiding us through selections. Food is excellent! Love the sauces, especially the green medium sauce.  I had the fried rice with pulled chicken. He had the 1/4 chicken with a side of canary beans. All great!  Plenty of seating & parking, clean but a bit loud."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taSldHY3RWak5pUlZvM1NHbHlNVUl4T1VsaGFIYxAB",
            "text": "We love Viva chicken. The food is always so good and the staff is super helpful. Whenever we visit St George we always go out of way to eat here!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201TU9XVjZZbWxVWkV0UlowRlpRbEJyT1ZSS1dHYxAB",
            "text": "The food was very nice and we were attended by Norma. She was super."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214MlJWSlJjbWw0T0hkMU9IQmxia1IzZUd4VmRFRRAB",
            "text": "Steak Saltado and the chicken soup are both carb heavy and delicious. If you are on a low carb diet, avoid these two. Services were not bad, they kept the restaurant tidy and clean."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWQ1JEbEdWVVEwYVZaS2JrTndPRzlpVm1weVVtYxAB",
            "text": "I got Tacu Bowl\n\nThe rice was perfect and the chicken was very soft! I love how they have 3 different sauces. My favorite was the yellow one."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJakp1dEpREAE",
            "text": "Lots to commend about this place.  The maracuya and churro bites were great.  The fries had a nice coating on them.  The aji, huancaino, and other sauces were tasty.  They didn't bring me multiple items on my order though.  Also, while this…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMWJuRGFnEAE",
            "text": "So happy we stumbled upon this place! Absolutely delicious chicken dishes. The fire roasted chili was one of the best with just the right amount of spice. The rice with chicken dish was my favorite.\nWe’ll definitely stop by when we’re back in town!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxSFl6RTRNMVZFZW1FMFJGWTFjbXN4YkRRd1VuYxAB",
            "text": "I love coming here! The food is fresh and delicious. Fernanda and all the employees are so kind. I once forgot my wallet and thought I’d be able to pay with ApplePay, but they didn’t have it yet (they have ApplePay now). Instead of canceling my order, they covered it for me! Will definitely keep coming back."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMFozTlVUVW95ZDFaS1RVMUJkMUpGUzJOMFozYxAB",
            "text": "Viva chicken has the most flavorful and delicious food combinations, and plenty of healthy options but it doesn’t feel like health food. It’s just good food. It’s a little bit noisy to dine in, but it’s clean and well designed and worth talking a little loud in order to enjoy the rest of everything. Service is great and shout out to Deysi who’s the most friendly hostess and always greets us with a smile."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFM2RrUXdiV04zZFVwSlpsRmhURVpUVDNaek5WRRAB",
            "text": "Norma the person at the register was so polite and professional, it is so nice to be welcome to a restaurant with such a great service, the food it’s outstanding, thank you for making this my favorite restaurant in Saint George."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaaGRFWmhka1l6Y0Y4NGNsQkpVVWRhVVVoVE5IYxAB",
            "text": "Love eating here when I’m in St. George. Food and service is great! Norma especially makes sure to provide phenomenal service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SUGFHNXRiMWhSWTBweVVXSTVhVVZsUm5CWE4xRRAB",
            "text": "This place has the best chicken I have ever tasted anywhere. The sauces that go with it are homemade, daily and delicious. They have excellent people renting the restaurant. Arturo today was very friendly and informative and Brooklyn works hard and has a great attitude. Every time we go through St. George we stop here and we are never disappointed."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WME5XRjRPVmRQUkdscVlXNW5WVEo2VjBwaWMwRRAB",
            "text": "The Perfect Road Trip Find!\n\n​We stumbled upon Viva Chicken during a road trip, and it turned out to be one of the best and most memorable meals of our entire journey! The flavors are just incredible, and it's a fantastic experience from start to finish.\n\n​Let's talk about the chicken. It's the star for a reason. Incredibly juicy and tender, with a perfectly seasoned, crispy skin that is just to die for. You can tell it's been marinated and slow-roasted with care because it falls right off the bone. It's hands-down some of the best rotisserie chicken I have ever had.\n​But the chicken is only part of the magic. The sauces are next-level! The mild, yellow Aji Amarillo sauce is creamy and delicious, and the spicier green Huacatay sauce adds the perfect kick. They complement everything perfectly. I paired my meal with the cilantro-infused rice and sweet plantains, and both were fantastic sides that you shouldn't skip.\n\n​On top of the amazing food, the service is always fast and friendly, and the restaurant has a clean, vibrant atmosphere. It was the perfect spot to recharge before getting back on the road. I can't recommend Viva Chicken enough. Finding a gem like this was a highlight of our trip!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOHBUZVVnEAE",
            "text": "I had the Peruvian Wrap with chicken. The chicken was juicy, flavorful, and hot. The wrap had the perfect amount of delicious sauce, luxurious quinoa, and fresh vegetables. Sweet potato fries were crispy and nicely seasoned. Some of the best food in town."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKbXNfTVNGcWJlaWxBRRAB",
            "text": "We had the Tacu Bowl with Chicken and Naked Peruvian Wrap with Chicken and yuca fries. It was literally so unbelievably delicious. All of their sauces are wonderful, my personal favorite is their green sauce. Then to top it off their Maracuya passion fruit juice is BOMB. 10/10 service and food. Can get a little loud inside during peak hours making conversation difficult, but I like the high energy environment! 🥳"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3NnVIUHV3RRAB",
            "text": "Viva chicken is the best. I wish they had one in Cedar City. Chicken always taste fresh and delicious. Their fried rice is awesome and so is their churros. Norma our host took our orders with patience and a beautiful smile."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RWEzcENhVTFSUWpZekxWSlpOMFZWZVRka1JIYxAB",
            "text": "Yolanda took extra time to help me order food for other people and gave great suggestions. I haven’t been there for a while and her service made me grateful to have some good recommendations and great service. I will definitely be back sooner.."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abVZYWm9ZbXhGVGtGVlVtcEpNekl0UkRGNlpXYxAB",
            "text": "Viva Chicken was so good. I highly recommend to try the Tacu burrito. They serve your food super fast, and there's always a staff going around cleaning for the next person. It look like it's very popular since its busy but again, the food comes to you fast."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkUmNqUnJUMU5IVmtSS2RISlVhakZvVjJoclNYYxAB",
            "text": "Lyla took my order and was great at explaining the menu. This is my first time and it was so helpful to have a friendly staff to help. We ordered 2 family meals for a family of 6. (Teen boys)"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0U05FVlllVll0Y2xCM1dXNUNWR0pmYmpKUlJYYxAB",
            "text": "50+ couple looking for somewhere slightly different to eat early on a Thursday evening.\nWe are highly unlikely to visit again!\nThis is simply because we're on vacation from England 😆.\nThe chicken was well cooked, flavourful and moist. The green beans were superb and the fries were excellent.\nKeep up the good work."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkMlJrMU1XbXh6TFU1MVFtNXBTVnBGWTI1dmNGRRAB",
            "text": "FAV PERUVIAN JOINT IN TOWN!\nHad the pleasure of meeting Norma from Lima working today, she was super nice. All the food here is amazing, my go to is always the Steak Lomo Saltado!"
        }
    ],
    "reviews_count": 80
}