{
    "name": "Quench It! (St George)",
    "place_id": "ChIJXzIV7VFbyoARG0WuNBMPtdk",
    "grid": "SI1",
    "address": "1407 1450 S, St. George, UT 84790, USA",
    "rating": 4.9,
    "user_ratings_total": 199,
    "phone_number": "(435) 817-8493",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaelRXdHNOMDVrZWtGRmJYVlVSVzQyYUdjM2FrRRAB",
            "text": "This is, by far, the best place to get drinks. The staff is consistently exceptional, and I'm always so surprised and impressed by their friendliness. They make truly amazing drinks. While I don't go here as often as I used to (I'm trying to cut down on my sugar), I wouldn't go anywhere else for a drink."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoR2VWZ3dhMko2WVhrMVpITk5aVTh6UVVGcWFGRRAB",
            "text": "Great drinks and gluten free cookies"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRk1sQnRhbVV6U21GUFVFSkNhQzB6Y1U1S1ZsRRAB",
            "text": "Best customer service. Nicest employees. Love that they have fresca."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0RVh6aFdVa053UkdwNFIxUlNMVXRoWms5TVdWRRAB",
            "text": "The best soda shop in town! The staff is super friendly and they are super quick"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4RlJWWkhjemg2V2xSSk1IcG1iMVZDTWxsaGFXYxAB",
            "text": "I have a lot of co-workers who are gluten-free and dairy-free. It's hard to find cookies for people with those dietary restrictions. I found quench it and they had yummy gluten-free and dairy-free products."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxcFFVbzRaR0ZpUzJwRVlVTjRjblY2U21VMFQzYxAB",
            "text": "I’ve tried all the soda shops around and these guys hands down have the best, most flavorful drinks available!! And there’s rarely a long line They are fantastic!! And thank you for offering such a yummy gluten free brownie for us Celiacs!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1TVZWRmliblZOYmpWdVdGTnpURlp5WXpsMWVGRRAB",
            "text": "Best drink place in town. Owners and staff are awesome!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CT1oxOW1OSEpDZEV4c1lUbEZjbkJPVUdGblFrRRAB",
            "text": "Love their drinks! Cindy is my favorite and their cookie dough is super tasty too."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKcVJwZEhZeFBtdTJnRRAB",
            "text": "This is the BEST soda shop in Southern Utah. They have the nicest staff ever. Always so polite and helpful. Their drinks are amazing, not to mention their menu has so many yummy options! I go here anytime I’m craving a drink and they never disappoint."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNN05xSS12OWY3VHJ3RRAB",
            "text": "I love this place!! They are always so friendly, drinks are delicious and affordable, and they have really fast service. Sometimes they give away free ice cream too, just for the heck of it. They also have a reward system, and it will remember your drinks, so you can reorder your usual custom drink if you want to, without having to say all of the ingredients every time. I also appreciate their hours because of my crazy work schedule. Keep up the good work, you all are very appreciated.🩷"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLajVpZW5sbEsyZmJREAE",
            "text": "Good drinks and service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcTZpVlh3EAE",
            "text": "Won’t be coming back. There’s been a 75% increase in their pricing. $4.60 for a large drink is heinous! Their menu board says $2.60 for a 44oz but they don’t honor that price. 👎🏼…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJallMempRRRAB",
            "text": "I liked this place! As good as swig!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJc3VMcmFnEAE",
            "text": "Quench It is the best soda shop in town! Friendly, welcoming staff that brightens your day."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3ai1DU3B3RRAB",
            "text": "Always amazing"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OTZMVjhBRRAB",
            "text": "Ice is cheaper than your local gas station, and the service was awesome!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MV9UTFNREAE",
            "text": "Great drinks - very generous with the ingredients & always consistent! The owner & the staff are wonderful, very kind and patient. Sometimes I order for myself while other times I pickup several drinks for the office, and the service is always excellent and efficient. Highly recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3ZzZ5QjRRRRAB",
            "text": "I get great suggestions and love their drinks."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aFkyRTJ3RRAB",
            "text": "Like"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3LWYtMzJBRRAB",
            "text": "This is my favorite place for a drink! There is something special about Quench It, they definitely beat all of the other soda shops in town. They are always consistent with their mix ins so I always know what I'm getting. The employees are amazing, and so kind, they always go the extra mile to make me feel like the most important customer of the day."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bHEtWUlnEAE",
            "text": "Friendliest place in town and the best drinks."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eHUtWDJRRRAB",
            "text": "Always a pleasure"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3LXRlTWNnEAE",
            "text": "I got here at 7:15 because my maps app said it opened at 7. When I pulled up to the order screens, they were all off, and I had a feeling they weren't actually open, so I got ready to just pull through the drive through and leave. Then I heard the sweetest voice from the speaker asking if I could hear her. I replied yes and she said \"we aren't technically open yet so my screens are off but I can get you a paper menu at the window!\" I immediately apologized and said \"oh no I'm so sorry, I can just leave!\" She told me that was nonsense- she said \"you're here, I'm here, at least let me make you a drink!\" I pulled around to the window and ordered. The service was so quick and the drink was INCREDIBLE.\n\nWhat this sweet angel of a woman didn't know was that I was up ALL night editing a wedding shoot (I'm a photographer) and had scoured the internet looking for a soda shop open at 7, as that's right after I drop my husband off at work. I saw that quench it was open and developed an immediate craving for a frostbite 😂 by the way if you haven't tried a frostbite- this is your sign. Anyways, I had had a rough night and morning, and she very well could have turned me away and I wouldn't have blamed her one bit. But she went the extra mile and made me feel welcome and comfortable when she didn't need to. The world needs more people like this quench it queen!!! 💕"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3X0pHZm9BRRAB",
            "text": "Next to my daily Diet Coke, Bri and Shawna are the best part of my morning!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3X0pERWRBEAE",
            "text": "Best drink place in town!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3X09ESk9BEAE",
            "text": "Best drinks and service!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bEp1ZDhRRRAB",
            "text": "I love this place! My drink consistently tastes amazing! The staff is super friendly and is happy to serve. If you want the best tasting drinks ever and always then come to Quench it!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OE9XYnR3RRAB",
            "text": "Out of all the drink places we will drive further to go to this one. They are so nice! Service is great! It just brightens your day. Great drinks great communication everything 100%."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bDktdlBnEAE",
            "text": "Fav drink spot"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3azh2bU5REAE",
            "text": "She was super nice 😊"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bWJpOEhREAE",
            "text": "I have never had a bad experience here. Drinks and snacks are always great. The customer service is absolutely amazing. Love love love!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MHRyLTJRRRAB",
            "text": "Love the hometown feel of this soda shop… Owners are great my favorite soda shop in town"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3d01lcUtREAE",
            "text": "10/10"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcF95andnRRAB",
            "text": "So friendly and generous with their ingredients. Better price and taste than all other drink places we have tried."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURReDd5STF3RRAB",
            "text": "They’re always so kind when I go through the drive through! They’re super quick when making drinks! Quench It is amazing!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRalozQjNRRRAB",
            "text": "Best Drink and Snack shack in town!! Quality and customer service are top notch!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbHNIX1pnEAE",
            "text": "We love quench it. Their cookies are the best from all the shops and their employees are always awesome."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMnR6cHRBRRAB",
            "text": "The friendliest people in the whole city and best drinks!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNU5QUWhRRRAB",
            "text": "I LOVE THIS PLACE!!!!!!!!’ IT IS SO YUMMMMMMMMMMMMMMYYYYYYYYYY"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNk1QMXh3RRAB",
            "text": "Great service and great drinks better than Swig."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNmJqeXB3RRAB",
            "text": "Quench it is #1. Their cookies are by far the best out of any soda franchise I’ve been to. More than anything, the owners of Quench it are kind, hardworking and just one of a kind. I will choose this place every time! This is my freezer stash I keep on hand because they’re just that good."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRcDlUXzRnRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️ Our favorite soda shop has been our go-to spot since it opened! The staff is always friendly and welcoming, making each visit a joy. We love the incredible variety of flavors, especially the customer appreciation ice cream—what a delightful treat! The nachos and pretzels are a perfect snack, and we can never resist finishing off with their delicious cookies. This place truly feels like home, and we can’t recommend it enough for anyone looking for a fun outing and tasty treats! 🍦🥨🍪"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibjRXWmtnRRAB",
            "text": "I’m here to brag about the Cinnamon Sugar Pretzel Bites. They were warm, fresh, and delicious! The drinks were great, and service was quick🤩"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGZy0zRGtnRRAB",
            "text": "I prefer quench it over swig any day. The staff is always so nice, some even know me and my dog (my dog by name 🤣).\nThe drinks are always full ( the photo below shows my drink without a sip taken). The pup cups are a perfect size for dogs.\n10/10!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbzVDVFh3EAE",
            "text": "Quench it has become my new favorite drink spot! The staff here is amazing! My order is ALWAYS correct and the drinks are yummy! I always feel like I’ve gotten a personalized and friendly experience, unlike some of the other local places!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbVlMOHRBRRAB",
            "text": "Love my local quench it! Everything from the friendly staff, to the cookies and the best drinks ever of course!  Always a daily stop!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbXJDZGJnEAE",
            "text": "If you haven't tried this place, you’re missing out on the best customer service! Yes it does still exists 😊! I always order extra whip and they remind me everytime to watch my lid so it doesn’t spill on me.  They were closed on a holiday…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdHFYYlZBEAE",
            "text": "Very friendly service and just kind people -- for that reason alone, it's worth going back! Besides that, they work quickly to get your order right; you can create your own or choose from the menu. (There's even a secret menu of sorts, including the Creamsicle 2.0 and Butterbrew, both of which I'd highly recommend). Also, the cookies are absolutely divine. Even the gluten free ones are some of the best GF options out there. This is one of my favorite places to go when I visit or pass through St. George!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MjVudnBRRRAB",
            "text": "I am usually pretty loyal to another soda shop in town and haven’t ever been to this location. After trying quench it, we will definitely be back. The girl who took our order this evening was so friendly, patient and we felt totally welcomed. The drinks are huge!! I would definitely recommend this location to anyone looking for a drink! 🥤"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRX3VXb2dRRRAB",
            "text": "Quench It is now my favorite drink place! They have more flavor options than the other soda shops in town And I don’t know how they do it, but their drinks just taste better! Also, their employees are so happy and kind. We always get a free pup cup too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuc01xVGdnRRAB",
            "text": "It is soooo clean and nice! They have a regular drive through set up which I actually prefer. The app is so much more user friendly than others like swig. The workers were so nice and I had a huge order. Mackenzie helped me at the window and was very sincere and personable. Will definitely be coming back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaemQtVUJnEAE",
            "text": "Shauna is the best! She was so nice and patient while we ordered some pretty complex drinks. Made my day—will be coming back regularly!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcV9uX3B3RRAB",
            "text": "Quench It is my favorite drive thru soda joint in St George! Not only are they always so happy and friendly there, they make my favorite drink the very best (Diet Coke, coconut cream, fresh lime). And they have free pup cups for our furry friends 🐾"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbVo3MmRnEAE",
            "text": "I’ve been a loyal customer for a long time and been meaning the make this review for a long time as well. Quench It is the best soda shop in all of St George for sure! They have a very friendly stuff and haven’t gotten my order wrong even once and I’ve gone probably close to 100 times. I would reccomend the Mountain Meach which is Mountain Dew + mango and peach…it’s super good! Try Quench It and I garuntee you’ll be back for more."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdWNQbXpnRRAB",
            "text": "Quench is our favorite soda shop! Seriously will not go anywhere else in Saint George. Staff is so kind and drinks are 12/10."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcDQyNV93RRAB",
            "text": "Quench it really quench my thirst when it was my mistake by saying the wrong size, they corrected it and made me one happy customer. Love they’re super, over the top friendly service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6NTRpcld3EAE",
            "text": "I love stopping at Quench It! My son calls it \"lemons\" because of the logo. He loves their sugar cookies but I love their service. They are incredibly friendly & track my drink orders so if I forgot what something was called they can tell me!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbnM3UnJRRRAB",
            "text": "I love Quench it! They have the BEST employees and customer service! Everyone who works there always has a smile on their face and look happy to be there! They are so personable and I love that."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibTZIUXlBRRAB",
            "text": "First time trying a fancy soda. The owner walked me through the sodas for first timers. Oh boy, did she hit the nail on the head! Wow! I’ll definitely be back next time I’m in St George. Please open one in Cedar City! The very next day I tried Swig. Took my drink back & tried another - same recipe as the one you guys have. It was horrible (not to mention their half baked cookies). Quench It really knows what they are doing! Thank you!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNob2JlaFFBEAE",
            "text": "I LOVE quench it. seriously the best soda shop in town, every time I go I am greeted with a smile and have a great experience. I go out of my way to go to Quench it to get my favorite drink the Sweet Crush. The owners have taken the time to…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURiN0xvZBAB",
            "text": "My very favorite soda shop in STG. The staff is amazing and so are all their drinks and treats! They sell some of my favorite cookies from a shop up north that we used to go to all the time. My daughter also loves that their gummy’s on the kids drinks are about 5x the size of any other ones from a different soda shop😂😂"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcmZ1S0NBEAE",
            "text": "This place is amazing. There are a lot of soda shop options in St George but this place tops them all. The soda tastes better here (and we drink a lot of soda so we can tell a difference) and they fill your drink to the top! But they also have some really great choices here for all sorts of good things to drink. The mango purée was especially yummy for our sodas.\nFrozen hot chocolate was so good.\nSmoothies all tasted great and were well blended.\nLemonade was a good quality, not too sour and the lavender in it was not overpowering but added a great taste.\nRoot beer floats were tasty and the ice cream was all frosty!\nAnd to top it off the service was exceptional. They are seriously so friendly and helpful and they were so kind and patient when I showed up with 8 kids who were not sure what to order they helped offer suggestions and explained about the drink choices. This is my go to shop now!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoeWVpTjlBRRAB",
            "text": "LOVE this place!! The customer service here is top notch and the drinks are always mixed so well. 10/10 recommend!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRX3NQZVBnEAE",
            "text": "Quench it is our favorite! Best service and best drinks! They are far and away better than the other drive thru soda places!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRM3JtYlRnEAE",
            "text": "Best drink place in Washington County! The staff is incredibly friendly. Always greeted with a happy voice and smile!"
        }
    ],
    "reviews_count": 65
}