{
    "name": "Xetava",
    "place_id": "ChIJiYpuR9BByoARXHdsIilJBGc",
    "grid": "SI1",
    "address": "815 Coyote Gulch Ct, Ivins, UT 84738, USA",
    "rating": 4.6,
    "user_ratings_total": 993,
    "phone_number": "(435) 656-0165",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xocWJWOVpZMmR0VUZKR1QzbFhTRU5MVkRVelJtYxAB",
            "text": "Great brunch, great service."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsV2JsWnBYM1JITm1ZMVIzaG5iRTVrY2pkUk5tYxAB",
            "text": "I loved the Mai fish taco. That was my first time there"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGV2FWSnBPVGRMT1VsM1VXdDBSbFpCY25SaVRsRRAB",
            "text": "Amazing food and service! Beautiful setting on patio- blue skies and a slight breeze! Hummus platter was fresh and healthy! Chicken Picatta was delicious and my husband loved his steak gyro. Dessert was a pumpkin chai cake - so good! Great place with fresh and delicious food!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjMmJqY3laVTV1U0VFMlNGOURNVVZ1VGtoSE9VRRAB",
            "text": "Delicious drinks and dishes! We had the chai, lemonade, piccata and chipotle chicken. Great service. Very attentive and personable. The drive to this place was beautiful right as the sun was starting to go down."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CMmMyaE1kRWQzTVhSNk1VeGFWMUI1TUdwVGFWRRAB",
            "text": "This is a great place to eat. We really enjoy the atmosphere in the food. There’s a little on the expensive side, but it is very delicious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVdE5sOTZWVVpLTlVadlh6SnBZbFJTWVVjeU5WRRAB",
            "text": "Always excellent food and service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUmFHVm5iMHgyVG10cFVIZFVjVkJuYW5aMVdYYxAB",
            "text": "The Kayenta burger was crazy good! The fries The restaurant was beautiful and well decorated and had an amazing view from the outside eating area. The service was mostly good. The bathrooms are outside of the restaurant and in the Kayenta art village."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5MlFWQnFSMGMyV25kaVNsTmxORlF6YXpsSmRHYxAB",
            "text": "A little spot of heaven in the middle of the desert. Absolutely love this place and highly recommend to anyone who visits St. George. The Mahi tacos are amazing and the corn dip with chips is beyond addicting - phenomenal!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxdVEyNVlWR1JYYldaUFp6RlVVREJtUVU1ek5WRRAB",
            "text": "We always love coming here because a Tuacahn visit. Great food. I had the salmon and loved it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sdk0xZElVRjlqUTFKMVlUQXpTM1o1TFhCMVNrRRAB",
            "text": "Great place to eat in Ivins!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxclZUUTBVR3B2VWtwelRIRm5NV2xLZEdWS1IxRRAB",
            "text": "What an awesome place to go get lunch I had their beet salad and I truly must say it was the best beet salad EVER."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4dFVFOXpSaTFDV0hwNGFVRkRWVU5EUW5oZkxWRRAB",
            "text": "Food was absolutely gas I will definitely be coming back and Wendy was so sweet and everyone was so helpful and kind love this place!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201S2QyTjBiMGR4WlhCcVMzRnNNVkZXY1daak5HYxAB",
            "text": "I have been coming here for years for food, service and atmosphere and have never been disappointed! Me and 2 friends rode our bikes 15 miles to have brunch there last week. 1/2 order hummus, bowl of fresh berries and Mexican corn dip with hot, fresh chips; perfection but my secret ‘draw’ will always be the Royden beverage (lemonade, coconut, vanilla and mint puréed with ice)…..outstanding as always.  I think our server checked on us no fewer than 6 times….❤️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNM1kxSkJXVWROVWtGT2NWUmlXa1Z0VFZFNWFIYxAB",
            "text": "Wonderful original food. I had mahi tacos that I’ll end up dreaming about."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLX3U1ZnpTOXA2bzNBRRAB",
            "text": "Excellent food. A good choice of menu items  and generous portions"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsa1AySVpBEAE",
            "text": "***UPDATED RATINGS*** 4/12/25\nOkay...we gave them another chance.  New owners in place and they have turned around all the bad attitudes! MUCH better service, the food was better, and guess what....ACTUAL MENU'S! Simple changes can make a big difference. 20 & 30 somethings can learn a thing or two from people who have been on the planet a little longer. :-)\n*************************************************\nNever again.\nWe have given this restaurant 4 or 5 chances and it always end up bad. The service is always slow, the food is really not great, and the attitude from the 20-something staffers is beyond obnoxious. Everyone needs some serious customer service training from the Manager down. They argue with customers and refuse to listen to input. You are forced to use their QR code menu on a very poorly designed and cumbersome app. No actual menus are allowed or exist at this \"restaurant\". If it were not located in the Kayenta Village, they would have been out of business years ago. Skip this place and head over to the Cliffside Restaurant on Tech Drive on the hill by the D overlooking St. George. Much better food, much better service, and an amazing view!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VKNzU5TUtrZ1BxNFlnEAE",
            "text": "After hearing that this place was under new management, my partner and I decided to give it another try as we were underwhelmed with Xetava when it was under the old management.\n\nWe went there for brunch on a Sunday and were shocked to hear that they didn’t do drip coffee. You have to buy a $5 americano every time you want a refill. I had the breakfast burrito with grapes as my side which was $21 and pretty small and nothing to write home about. My partner had the steak and eggs and at $23 was also incredibly little food for that price and wildly underwhelming.  When he asked for them to cook his steak to medium rare, the waitress told us that they only cook it one way, and that was more well done. He asked for a piece of toast to go with it and, at $4 for a slice of white bread, I do not recommend. Don’t ask for jam for your toast. They don’t have it.\n\nThe restaurant had so, so many flies flying around our (indoor) table. We waited a wild amount of time for our check and we eventually had to get up and walk to the front and ask to pay because we had to leave.\n\nIf you want to drop $60 before tip on breakfast for two people, go to Wood Ash Rye. Xetava isn’t it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPM0FsYmpHMk9XWkJ3EAE",
            "text": "We loved having lunch here! Great atmosphere and views. They have ample outdoor seating but we ended up sitting indoors which was nice as well. We ordered the cauliflower tacos which were delicious but the green beans were very undercooked. We also got the mushroom Philly with the short ribs and the matchstick fries which we also enjoyed. Lots of vegetarian options!Definitely would come back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VNQ1JoZFc4dEwzc0lBEAE",
            "text": "I went expecting something unique in flavors and presentation considering the wait time I would not do this restaurant to get fish tacos and a hamburger I was expecting some kind of Mexican flavors in a unique dish and to me. It was like any menu you see anywhere my husband received his dish before mine so he had to wait. However, the coffee is fabulous. Overpriced for what you get"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcmFhWGJ3EAE",
            "text": "Artsy little village with a nice menu"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeGNhcGR3EAE",
            "text": "Once again this place knocked it out of the park! I cannot recall a bad experience here, and this time was no different. They added some new menu items since I’ve been here last and I’ve gotta say, the street corn appetizer was ridiculously good! I also tried the mahi-mahi with pineapple salsa (subbed the fish for chicken though because I’m not a fish girl) and it was really good too! My friend had the cauliflower tacos, which is also one of my favorites. My one complaint is my favorite green curry dish is no longer available. Tear."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaGR6VzJRRRAB",
            "text": "I liked this place a lot. I got the wild mushroom sandwich with prime rib added and it was fantastic. We got the brussel sprouts appetizer for the table and they were great as well. Our server was great."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJN1AzN013EAE",
            "text": "Wow. Food was amazing. The view out here is amazing. 🍻"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJLTlLbmVBEAE",
            "text": "Not worth the drive. The food was less than par and the service was in need of some coaching."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNXZxa2J3EAE",
            "text": "Thankfully, I had some places in mind that I was planning on dining and asked my significant other if she had somewhere magical she would like to take me. I'm so glad I asked. She led the way as we enjoyed the beautiful views on our way to Xetava. The hostess got us a perfect table by the amazing stone in the middle of the place. Our waitress was so kind and helpful in getting exactly what our pallets were needing. Delicious food. Very captivating atmosphere. Wonderful service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaHUzdlh3EAE",
            "text": "Had lunch here and the Service was fantastic, the restaurant is located in a beautiful setting. The food is good, but not blow your Sox off good. Was just slightly better than decent. Please bring a heavy wallet though, my bill was $111.00 for an appetizer, one soft drink, 2 waters and 3 lunches, and the portions are definitely not what others have pictured here. We got lunch dishes, French dip, and quesadillas. Probably won’t go back anytime soon."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNHFYUll3EAE",
            "text": "Haley deserves 10 🌟 for putting up with our group of 9 rowdy diners! From appetizers, keeping drinks coming out,  moving us outside, and serving us excellent food we couldn't have been happier.\n\nShe was an amazing server and hopefully very happy with the tip.\n\nCrab cakes and corn dip appetizers were great choices.  I think the Mac and Cheese with short ribs were the top item ordered.  We also had the mushroom Philly with prime rib, chicken club,  and more.\n\nEverything was top notch! If I'm ever back in the area I'll be hoping Haley can be our server again!\n\n(What we spent per person was so high because of the amazing drinks. )"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMk1qV0N3EAE",
            "text": "Awesome food.. Great service!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaU1iMVlREAE",
            "text": "This was my first time and I will come again.  We had to share bites around the table because everything tasted amazing. Our server was sincerely friendly and took care of our wishes beautifully. Be sure to walk around the lovely location."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURvaTZ3YhAB",
            "text": "It's good, not great.  The food and service used to be better .    Most of the food is over seasoned with salt and pepper.    The fish tacos are only available with fried fish, not grilled.   They no longer offer green curry mahi which was one of our favorites.  The brussel sprout appetizer is excellent.  The French dip is good.   We like the cauliflower tacos and grilled Caesar salad (although it is over salted most of the time).\n\nIf the weather is nice, sit outside.  The views are great.     If you do sit inside, sit as far away from the entrance/ coffee bar at the front as possible.  Tonight we we seated between a large loud table and the front coffee station where the coffee grinder and ice filedl blender were going the entire time.  It was a very unpleasant experience.  We ate quickly and left as soon as we could.    When we were seated we asked for a different table, but were told all of the empty tables were reserved.\n\nWe have had better experiences in the past seated elsewhere."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ejlMSHdRRRAB",
            "text": "The atmosphere and scenery are amazing. The service was great and the food was good but expected more. Disappointed they didn't have a full bar, but overall a good experience."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NDczVEtREAE",
            "text": "Amazing ambiance and amazing food!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3X3B2SkpREAE",
            "text": "My husband and I stopped in for lunch on Tuesday, March 18. The dining room was very busy. Our waitress Emily was quite the server. She was nonstop sprinting from table to table taking care of customers all while keeping a smile on her face. She kept our drinks filled and had a very pleasant demeanor. Her service was top notch for us and everyone around us. Our food was excellent (steak salad & wrap), but Emily made our dining experience exceptional, and she is the reason I chose to do this 5 star review!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MXR1YWRBEAE",
            "text": "this is easily the best restaurant i’ve been to. the honey lavender latte was insanely good, and i can tell the coffee is high quality. were were greeted and sat immediately!! everyone here is so kind and the food is so good!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRczduam9nRRAB",
            "text": "Great food! We have eaten here several times and always had a good meal."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcnZfZFpnEAE",
            "text": "Upon arrival, we were immediately greeted and seated. Our server was quick on the beverage order. We enjoyed the grilled Caesar salad…tossed with a dressing with a little kick, a nice serving of grated cheese and croutons. We also enjoyed the French dip…roasted beef on a roll, with horseradish, provolone, and au jus with a side of fries. We finished the meal with a piece of their home baked coconut cake. All in all, we really enjoyed our dinner. And worth noting, there’s an outdoor patio which offers a great view of Snow Canyon for some great ambiance."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRd3ByWjZRRRAB",
            "text": "Great food and service. Nice location and atmosphere but music was loud making it difficult to converse."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRd3NyVDNnRRAB",
            "text": "I was very disappointed. JUST KIDDING !! This place was amazing !! Definitely worth the 45 minute motorcycle ride here, we are coming back definately!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRZ3ZQOHR3RRAB",
            "text": "Our request to have the heater that was next to our table turned on was ignored….. Once by our server and once by the manager. Partway through our meal, the server came back to our table to see if everything was OK. we told her that the heater had not been turned on yet. She said she had told someone to do it and then just laughed it off. Very poor customer service!!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6NXRxaW9BRRAB",
            "text": "2024: Love Xetava. This place has a special place in my heart. I have been coming here when i visit southern utah for 10+ years. 🫶🏼\n\n2025: Updated Review: Took awhile to be seated with no one else waiting to be seated. We asked to sit outside and then we got seated near the street and the wind was bad so we requested to be seated inside. The we had to wait like 45 minutes for our food. I don’t know they didn’t see terribly busy. Our 2nd server was really nice though :)  A little disappointed with today’s stay."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5aE5XV0ZBEAE",
            "text": "My daughter Piper was so excited to bring me to her favorite place. It was most excellent. The food was delicious and presented very well. The craft cocktails were exquisite. Our server was very friendly and ensured everything was good. They even brought blankets by as the sun went down on their patio. We had the small plates. Such a great way to try multiple dishes. Will definitely  come back next t time I visit from Idaho."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOGZ6RV9BRRAB",
            "text": "We had a lot of fun at this restaurant!  Starting with the staff; they're so warm and they made us feel welcome.  The atmosphere is lovely, and the food was just out of this world.  I recommend the cauliflower tacos...I cannot describe how delicious that was.   Hubby had the Kayenta burger and absolutely loved it.  Not too quiet, not too noisy, it's just a perfect place to have a meal.  And all for a reasonable price...we were super impressed!!  Do not miss out on this gem of a restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0dS1xZnRnRRAB",
            "text": "Xetava Tapas Bar has amazing delicious food, service, and drinks. I love the small plates and I love sharing dishes. I love everything I have tried and can't wait to try new things. They have a beautiful outdoor patio and I love sitting at the bar. Drew and everyone else who works there are so helpful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqeU5QYk5REAE",
            "text": "We were staying in the Kayenta area and Xetava was right next to our VRBO. We ate at both the restaurant and bar side during our vacation. The food was really delicious and the atmosphere is fabulous! The restaurant side has really interesting decor and we loved the layout. We were a little hesitant to take our children after reading other reviews, but our toddler and 5 year old loved the kid quesadilla with grapes and the kid burger at the bar. They had special plastic cups for them and were very accommodating. They do not have booster seats but it worked out just fine. Our favorite menu items were the salmon with lemon sauce, brussel sprouts, and mahi tacos at the restaurant, and then the corn ribs and seared ahi tuna at the bar. Can’t wait to come back next trip!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwbEtlajd3RRAB",
            "text": "I tried this for the first time with some girlfriends.  The service was incredible and the food was awesome.  The only reason I gave it a 4 for atmosphere is because it is far out there but that has its charm too.  The waiter had great recommendations and knew the menu well.  He was great.  The food was awesome.  We had Patella, braised short rib, wings, a variety of cocktails and so much more.  All were really good.  My favorite was probably the braised short rib.  Amazing!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLXzlmRXFRRRAB",
            "text": "We went here for the first time and had an incredible experience! Outdoor eating was excellent and the ambiance was lovely. Our waitress was darling and super nice.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5c2NTUXlBRRAB",
            "text": "Excellent food, creative menu. We ended up ordering all the appetizers because they all sounded delicious and they were. Our server was very nice, spent time chatting with us about the area (wasn't super busy when we were there). Surrounded by art galleries and in a very unique area. Worth finding it!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXbnZXTy13RRAB",
            "text": "Amazing food, great experience. We came for brunch and the wait time was 40 minutes, so by the time we were seated we missed brunch by a few minutes. We had to use lunch menu, which worked out great in the end. We were in the mood for…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaTdLVUxBEAE",
            "text": "the coolest hidden gem in Ivan's. Super fresh delicious menu. And great staff that work there"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdXRuemtBRRAB",
            "text": "I really enjoyed my wild caught mahi with bok choy and a type of pilaf. Slightly overcooked but super tasty good portion size too. The sauce was to die for. My waitress was beyond sweet so I will be back to ask for her again. I also got the beet salad tasty but did not have enough beets. That I would not get again because it’s small for almost $10. The views are amazing with a cactus garden to walk through after the meal. Restrooms are directly behind restaurant and very clean. I will be back soon, They also have a sister property that is a little cheaper for those wondering.I will also try the bar and kitchen next time which is different food."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUMzeTZRbxAB",
            "text": "Really great place for lunch and very popular! Located in a charming art village. Stop in for some yummy food with great service."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcEtPeVd3EAE",
            "text": "Love this new place! We tried 4 different drinks. Our favorite ended up being the watermelon martini. We also loved the short ribs, sweet corn quesadilla, and crab cakes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaEpXWEhnEAE",
            "text": "we went for brunch and had a lovely time. always nice to find a good gluten free waffle - it has a nice corn flavor too. my husband's burrito was a little salty but the fries were absolutely perfect."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtbnRyaHF3RRAB",
            "text": "This place is amazing. I ordered the chicken melt and my wife ordered the cauliflower tacos. We always share meals. My first bite of that chicken melt and I was hooked and the cauliflower taco was spectacular. The sauce on it has so much…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdDdQX1B3EAE",
            "text": "This place is amazeballs. The tapas are beautiful and absolutely astonishingly delicious. We had the Thai shrimp nachos; they had a yellow curry like sauce and big fat shrimp. The Vietnamese noodles with crispy chicken was like a Bahn Mi in a bowl, with bright flavors and downright drinkable sauce. The ancient grains was perfectly crisp and fresh and a compliment to the other dishes. The pan seared crab cakes were really well balanced with seaweed salad, not too rich and perfectly crisp. For dessert we tried both the fried chocolate chip cookie; why in God's name did I not think of this before?! It was outstanding. The key lime pie was refreshing and exactly the right tartness. The watermelon martinis complimented the key lime pie and the fresh squeezed watermelon won the day. The Earl Grey haiku was like a boozy Arnold Palmer, but I ended up back at the watermelon martini. Our server, Luke, was fabulous, fun and totes cute. He recommended the crab cakes to us and did not steer us wrong."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnd05MNXV3RRAB",
            "text": "Had a wonderful meal and great service to match. We ordered a mimosa, salmon tacos with avacado added, and the gyro salad. Everything was super delicious and fresh. We left full and satisfied. A little on the pricey side, but worth it for great food and the location of The restaurant is lovely. Will definitely be returning."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2OF9ubDl3RRAB",
            "text": "Took my dog and sat in the lovely outdoor seating area. Was met by kind staff. Loved the view from my table and there was a water bowl for my dog too. The food was delicious and my server was super nice! Can’t wait to make this a tradition!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjc05Ic0tREAE",
            "text": "When I give a place five stars it's because they exceeded in five different categories: uniqueness, taste, presentation, service, and the vibe, I'm so glad we got the recommendation to come here for brunch on Sunday. When we got there they were pretty busy, but we were still able to sit down within 15 minutes of arriving. The wait was well worth it though because not only was the food worth waiting for, but we got to check out the art district around the restaurant. The vibe of the whole area is really great. It's an art district in the middle of a desert. Because of COVID19 their ordering system is online and luckily it's quite user friendly. I ordered the Heaven Waffle which was beautifully presented, and a side of bacon, the mint coconut frozen lemonade, and a fruit bowl. The Heaven Waffle is a blue corn, gluten free waffle with berries, home made tasting whipped cream, peanut butter, and a delicious agave syrup. I'm not usually a fan of gluten free products because I feel like they don't taste as great as the original, but I loved this spin on the waffle. It had that familiar waffle taste to it, yet it had a little bit of a rougher texture that really vibes with my taste buds. It was like a symphony of flavors with each bite and unlike most waffles it was not overly sweet even with the agave syrup, berries and even the whipped cream. It was also incredibly filling despite it being only one waffle. The service was top notch, and although there was a mix-up with one of our orders it was handled amazingly. Greg (the chef and/or owner) easily helped us out and was incredibly friendly and a great host. The mint coconut frozen lemonade was alright and a little overpriced I thought. You couldn't even really taste the coconut which was unfortunate, but their mimosa's were apparently great according to the other people at the table. Overall a great place that I would definitely recommend to anyone."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4bjVuYndBRRAB",
            "text": "Very creative southern Utah feel. Fun place to visit. Cute little restaurant. Yummy food! My wife is gluten free and they accommodated her, no problem."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDd2V2TUR3EAE",
            "text": "Great atmosphere, amazing flavor combos, and wonderful service. Came with a group of 4 and had to wait maybe 30 min or so for a table right after lunch rush (no reservations) - definitely worth the wait! We got a lemonade mint drink and walked around the art galleries and jewelry shops nearby while waiting for them to call us that our table was ready. Really cool tile work inside cafe and nice big tables for easy food sharing\n\nOur favorites:\n\nFull  Beet Salad\nchilled beets, organic greens, candied walnuts, goat cheese, balsamic reduction, dill oil\n\nCajun Brussels Sprouts\nserved with warm peach chutney\n\nXetava Burger\n1/2 lb grass fed patty, melted dill havarti, house slaw, cilantro avo mash, with matchstick fries\n\nChocolate Cake\ndecadent triple chocolate cake with fresh strawberries, homemade whipped cream and a drizzle of chocolate sauce\n\nDirty girl\n1% milk, coffee and chocolate blended with an extra shot of espresso, peanut butter and ice, topped with homemade whipped cream"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXNElySURBEAE",
            "text": "Went here for the first time for Valentines dinner. It was a very well thought out menu with delicious food. Atmosphere was great and the staff was even better. Chef Ben came table side to make sure everything was just right. The 5 course…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMybEtQZTd3RRAB",
            "text": "I CANNOT SAY ENOUGH AMAZING THINGS ABOUT THIS CAFE.\n\nWe stopped in for lunch and were wowed beyond our expectations. Our server was very informed on how to accommodate a gluten free request, which is a major plus!\n\nDrinks:\n\nHoney Lavender Latte - OMG there’s not enough hours in the day for me to enjoy this drink!!! It can be ordered hot, or cold, and after trying both I recommend the hot version. The flavors are bold and add a large variety of taste into your day.\n\nLemonade Mint Supreme - the refreshing drink you want to enjoy while taking in the vast patio views. Don’t skimp on this, order to go if you must!\n\nAppetizer:\n\nCajun Brussel Sprouts - Pro tip: opt to add the bacon and goat cheese, as it compliments the dish and adds a lot of flavor to your palate.\n\nEntree:\n\nSteak and Avocado Salad - SO. MUCH. FLAVOR. The steak is cooked to perfection and topped over the most flavorful salad combination in all of Utah.\n\nDessert (not pictured):\n\nGluten-free Carrot Cake - we took this to go, and I’m honestly surprised it made it out of the parking lot!! It’s so difficult to locate gluten free cake, and this is one of the best I’ve had!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCak1xTzF3RRAB",
            "text": "A very atmospheric restaurant.  Fast service.  Delicious beer, highly recommended.  The inconvenience that there is no toilet inside the Restaurant, you need to go outside.  We had a big company and we ordered very different dishes, everyone was satisfied"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbXUyS1l3EAE",
            "text": "Xetava has some of the best food in the St. George area! I love the limeade slush, the breakfast burritos, the avocado toast and the waffle from the brunch menu. The green curry mahi is a must try for dinner and I lived the steak salad this last time too! My favorite thing on their menu is the pita and hummus plate with veggies! Everything I have had here is amazing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUdEpQX1JnEAE",
            "text": "Tried Xetava for a girls night out. The vibe was great, we sat out on the patio. Not very busy for a Saturday night, we had no wait before being seated. Small plate format was ideal for sharing bites of everything, we tried a couple food items each plus dessert and drinks. Flavor profiles of each dish were exciting & diverse (some were spicy!) A truly enjoyable experience."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwdzlqRTNnRRAB",
            "text": "It has a really nice terrace. Food is always great at this place. The Brussels sprouts are delicious, all burguers are great! And the \"dirty girl\" drink is awesome!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtN3FIRkdREAE",
            "text": "Xetava Gardens Cafe is INCREDIBLE!!! It was love at first bite. Every dish had me gushing for more. Fresh, delicious, and savory. The bacon blue burger was off the charts tasty. Also a notable mention was the mahi tacos. The mint lemonade…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxbXNmOHlBRRAB",
            "text": "It’s perfectly located at the Kayenta bike trail ending/beginning and is the PERFECT after 🚴🏼 stop!! Mindy- our server - raves about the cookies and was spot on for the molasses cookies- she recommended their turtle ones but it turned out some dish soap 🧼 had gotten into them or something— they were awful- but she quickly replaced them with their Oreo cookies which were delish!\n\nWe went with the half beet salad and a garlic mushroom dish that were spectacular\n\nWanted to top it off with the recommended chai frappe but didn’t have the room!!\n\nWe will be back for their salmon and other delicious recommendations!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqbHVpdE9REAE",
            "text": "We were on a weekend getaway and decided to try something new. Xetava did not disappoint! The scenery was spectacular, the food was divine, and the artwork was astounding! Worth every penny!"
        }
    ],
    "reviews_count": 69
}