{
    "name": "Cappelettis Restaurant",
    "place_id": "ChIJofnY189EyoAR4ErKGHviQIo",
    "grid": "SI1",
    "address": "36 E Tabernacle St, St. George, UT 84770, USA",
    "rating": 4.5,
    "user_ratings_total": 1402,
    "phone_number": "(435) 986-4119",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaQ1dIaHFRbE15V1Y5dGVVWnpNRmRMUkVReVFYYxAB",
            "text": "We dined here as a family and it was so charming! Great food, great atmosphere and relaxed, friendly service. Kids had fettuccine and spaghetti (add the meatball!). We shared the chicken Gorgonzola. It was delicious and my husband wanted more sauce to dip his bread in. Spinach artichoke dip was great too."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRVdWSktXVFZ3TjB4aFZWQkVSbnB0ZUVwcFYxRRAB",
            "text": "Food was amazing, service was great! Went here for our anniversary and loved it!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1b1EzQkdRMUJzT1RGVE5ITkhUMU40U3pNeFJHYxAB",
            "text": "When Cappelettis opened, I would have given them 10 stars. This celebratory lunch was a disaster! The. Chiabbati steak was dry and tough with a handful of chopped greens covered by a burned bun. The onion soup was flat. The pastas? were stiff, tough and dry. The noise level for 6 others diners at lunch around us  was so loud. Sounds bounced over chairs, floors and ceilings so we could not hear each other across the table. The chocolate dessert was great!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkQ0xYQndVVVZOTW1sSVlWbGZNMUZNY1dSb1gxRRAB",
            "text": "Love the music, the bruschetta, lemon, salmon, salad, and French onion soup was fantastic! Service was awesome! We would definitely recommend this place!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCMFFUVmpabmRuUWxnNFVXNXZabXd0VUVGbGVuYxAB",
            "text": "It was alright. If you really love classic dishes like lasagna or spaghetti this may be your spot. I didn’t think it was worth the price"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ReVYwaHBkMFl3UzA1V2EwTmFPV3R1UmpOcFMzYxAB",
            "text": "Classic cheesesteak with the sweet peppers for me!\nThank you Carrie for the great service"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paTE16VTVZMWRtTnpOeFlscEZjeko2UW5CU2JrRRAB",
            "text": "I was excited to see that the seafood linguini was popular as I feel mixed seafood dishes are rarely done well. I'm excited to say I was not disappointed. Every element was the perfect texture.  I enjoyed it so much I didn't think to take a picture till I was half way done.\n\nHad the tiramasu which was amazing.  Many places have their own version of tiramasu but this is a traditional tiramasu which i can rarely find."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWdlV6UlplR3g1VDFWTWNUVXpUM0Z3U1ZBeWIyYxAB",
            "text": "The food was delicious! Everything was fresh and homemade! The service was fast and friendly Will visit again when in St. GEORGE."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tad1FqVjFSRmN5WkRobE5FaFNVR0oyWTBNMVRVRRAB",
            "text": "The food is very good! So much flavor and so tender for every meal! I was not a fan of the table as any movement would move the whole thing. The wait was long for the food but they kept us entertained with bread and staters/ appetizers…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aak5FazNkRGRpWVdOdlZGTTJRMnBEU0VSbWRsRRAB",
            "text": "I was surprised at how much the food quality/experience here has gone down. From the service, wait time, food quality, it was a truly horrible experience. our server was non existent, we waited an hour+ for the food, and when it arrived it was COLD. I got the fettuccine alfredo with chicken, and the pasta tasted fishy.. I will not be coming back ever again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204dGNXNUZOelZPY1d4TVJtWlNUbDlIVm01MFdXYxAB",
            "text": "The food is incredible! Everything is made fresh with real, quality ingredients! And the staff was amazing! Very attentive and paid attention to details! Very cute and clean atmosphere too!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twMGIxRnFUelJaVEZObmJtbHZVM1JJTVRGdVExRRAB",
            "text": "The service was terrible! We had to remind our server 3 times for a soft drink. The peppers and sausage sandwich was mostly bread and very little peppers or sausage. The order took forever to come. We will never go back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xad2VUSlVMUzF6WlhscmIyWllPVWRoT1VSTloxRRAB",
            "text": "Had a steak here and the cooked rare to my liking. Got there late with 3 others and they still invited us in for a late dinner."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OelgxZEhVa2hzTjI1M2FUZ3pjMWMzZVc5dldVRRAB",
            "text": "toothpick in lemon."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210b0xXOTRWbTl1TldOcE4wSXdkVFZ1Umt4V1ExRRAB",
            "text": "It was great food and service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGRWNtTlhlbGxxVVc1V1QxbElka05GYlhsa1ZVRRAB",
            "text": "Very good! 👍"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zMFdrOVVZVTFWYUROM1lXcG5jVWR5V0ZCd1RrRRAB",
            "text": "Delicious food. Great, informative waiter. Nice place. Definitely will go there again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ONVMyUXRWRlUyTlZVMlpWWndTVTVvZFhKT1FVRRAB",
            "text": "Very disappointed with the experience, We had a reservation at 7:30 at 7:32 I called the restaurant and wanted to let them know we would be about 5-8 minutes late; the hostess assured me they would hold the table as part of our party was there.\nWe arrived at 7:40. Told them our whole party was there to which the owner responded because you were late we had to give your table away but the wait time will be about 5 minutes. Okay, no biggie.\nI did pull her aside and let her know about the phone call to which she started telling me about their policy that I somehow was supposed to know about as her employee admitted that she did say she would hold our table but because it had been over ten minutes she had to give the table away; which it had been exactly ten minutes when we arrived. She didn’t hold her employee liable but the customer for not knowing their policy which was a joke.\nWe got sat down 25 minutes later and had our food at 9pm.\nTrain your employees correctly and hold them Reliable for their miscommunication not the customer.\nI thought she would compensate us at the very least but owner customer service is 0/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2padmJXVXhVR05WY0Vrd1JITnhVWGszVUdSV1YxRRAB",
            "text": "Food was made to perfection. Fresh and light. Perfectly balanced. Services was excellent. Only one complaint,  fix the AC. Other than that, this restaurant is wonderful."
        },
        {
            "date": "2달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kMFUyNWZSakZoVHpkQ1oxbHBRa3BmY20xWlEyYxAB",
            "text": "Als deutscher Tourist: eins der wenigen Restaurants, in denen uns das Essen auf unserer Reise wirklich gut geschmeckt hat. 👍🏻😊"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONE4zaHRVRXh2UWtSV05EbGZSMEpyYTBoclRXYxAB",
            "text": "You might want to make a reservation. I think we got lucky."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21STVFqUkROMVpwVFRWS1JUQkViMlpIYkdwM2RIYxAB",
            "text": "Very nice 'Argentine' Resteraunt."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRb3NHVVhnEAE",
            "text": "This is my favorite restaurant in Saint George.  Everything is amazing, from the appetizers to the entrees to desert.  I've tried almost everything on the menu and have never been disappointed.  The sandwiches are great (roast beef with au just is amazing) the sea bass is incredible, as are the gnocchi.  Great service, and such good food.  The Cappeletti family are also great hosts."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OZlpVeEdXbEEzWlRGVVpYQTBOSFZyY1d4eFFWRRAB",
            "text": "Excellent!  Brooke is a superstar server. The food was reminiscent of grandmother's kitchen.  Don't miss this gem!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wM1NsZG1Ta1JmTTFwWE1FdG9OV3BpWTBSVWVXYxAB",
            "text": "I have been going to Cappelettis since they first opened. Their customer service and food are devine. I love their flat iron steak, and the gnocchi, is mouth watering! I have not had a bad meal there, ever. The prices are reasonable, which as a person on a budget, I appreciate. The only thing that is a little crazy is, when you make a reservation, you best be there or you may loose it. Do not be late. Other than that I would recommend this restaurant to anyone who is a foody, and loves great service. This is such a hidden gem."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnMXF2VWdRRRAB",
            "text": "Love this place! Great food, great service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNNE9ETnlOVTl6YXpCSFdGbDZjakl6ZFVoWk9YYxAB",
            "text": "Pasta was excellent.  Seat Bass was very good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tadlNUaE9lSE5KUTJSbWFFMVJPWE13TTBaV2NWRRAB",
            "text": "Food and service are great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVeFUyZFVWV2h5TTBNMmVtbHVla1owWVdkdlVWRRAB",
            "text": "Great pasta great meatballs, overall pretty nice food and service. Recommend going here👌…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGMmFUbDBZelJpUlhka2FGcExWSGhLTTBJNU9IYxAB",
            "text": "This charming Italian restaurant has become a cherished tradition every time I visit St. George. With its warm, homely ambiance and consistently delightful cuisine, it’s a place that always leaves a lasting impression. Every dish I’ve savored here has been a treat for the palate—rich in flavor, generously portioned, and undeniably satisfying. I often find myself ordering more than I can finish, which only means I get to enjoy the deliciousness all over again later at the hotel.\n\nIf you find yourself in St. George, this spot is an absolute must. An experience that feels like a comforting embrace—one you’ll want to return to time and time again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5QlkyZEdVMHBTV1RZd1RXMVhWbDlGWmpWdldtYxAB",
            "text": "Charming little place, excellent service.  Food was good, but somewhat under seasoned for my personal taste.  The wine list…could be better.  A bit overpriced for the quality.  The room we sat in was bit warm, thus a little uncomfortable."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1d2NtRnZVV2RwTUVwV1pUaHlTalpZYlhKSVNuYxAB",
            "text": "Friendly staff.  Food below average."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aVmJuSlhVM00zU0hkYWFsZDZjamQzZFZkV1gxRRAB",
            "text": "Kind of weak marinara sauce but the sausage was great.  Could have used more meat in the meat lasagna.   Service great, very pleasant atmosphere!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5Nk1pMXFUbWx0TlRWVlNHaE5UMlJLTUhaU1NXYxAB",
            "text": "Foods ok. Over priced."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUVJtVkdhMDlrWWpKU2RERmxTbGxGVTBOM1pGRRAB",
            "text": "We were very disappointed with the customer service during our recent visit. Our large group of 10 people was not accommodated, and we were told we couldn’t split up the party, which seemed unreasonable. While the younger hostess was courteous and welcoming, another staff member was noticeably rude. Unfortunately, this experience has led us to take our business elsewhere, which is disappointing given how much I used to enjoy coming here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WUFJsTkRhVkZPU2pkWmQySlNSQzFuYjNvMmRYYxAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\n\nHighly recommend Cappelletti’s! I absolutely loved everything I ordered—from the rich, flavorful onion soup to the perfectly cooked Chicken Marsala. Really good! The bruschetta was fresh and delicious, definitely a must-try. Our table also shared the calamari, which everyone enjoyed, though it could’ve used a bit more crispiness.\n\nThe white Moscato paired beautifully with the meal, and you cannot skip dessert here. The tiramisu was creamy, well-balanced, and generously portioned (easily shareable for two despite what the pictures online may suggest).\n\nService was excellent! Our server was attentive, friendly, and made the whole evening feel special. The only downside was that it was a little hard to hear each other over the ambient noise, but the quality of the food made up for it. We’ll definitely be back! 🍷🍝"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KSE9GRnJlRU01WVVoUVFWbG9RamxJVDJseFZuYxAB",
            "text": "Visiting from San Diego and gave this place a shot. Family owned, which is nice. The atmosphere was good. Food was tasty and prices were reasonable.  The rib eye steak was tender and was well seasoned. The sea bass was the daily special and was excellent.  Had the gnocchi appetizer, and it was great. You can tell it was made fresh and not frozen melt in mouth, not chewy."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trd01rWkdOMlIyYlRGVVYyaGFPV3hzZEZwU1VWRRAB",
            "text": "Restaurant is in an old department store of sorts, it is what it is. Food and wine by the glass seemed reasonably priced. Ordered chicken Marsala and the meat, potatoes and veg were swimming in a pool of Marsala flavored water (not a sauce) so everything tasted exactly the same. Service was excellent and everyone was pleasant."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUmVqZ3piVGMyVlU5Wk4zbHhZMFp5VUdka2IwRRAB",
            "text": "Good service and food!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5R2NYTlRlbEJLVlc1YWJEVTJVa0pFVDFCQ2RrRRAB",
            "text": "Our meal tonight was amazing.  My Ribeye steak was cooked and presented with perfection and my wife’s chicken gorgonzola and its sauce, were outstanding.   Air conditioning was out and the fans solved the heat problem but affected our conversation. However, we will definitely return."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZZ3Blb2xnRRAB",
            "text": "Now I’m sure to a local this spot would be deemed top notch but sadly for me it misses the mark. The bruschetta was tasty but could do with a greater volume of toppings and calamari was chewy and poor. The mains were decent I personally had the meat lasagna which tased homely but the gnocchi tasted like frozen.\n\nThe service on the night, however was fantastic. The waitresses were attentive and knowledgeable of the dishes.\n\nI would visit again, but I wouldn’t bother with having a starter and would just stick to the pasta dishes."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJamZienNBRRAB",
            "text": "Great service and atmosphere. My rib eye was cooked to my desire and tasted fantastic! Everyone else was as pleased as me with the Fettuccine Alfredo, Spaghetti and Lasagna. Salads were great as well. Table bread was fine but nothing special."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMZlhnOUdRczZUYnNBRRAB",
            "text": "The food was incredible. We started with the mushroom potato gnocchi, which was creamy, rich, and full of flavor. The ribeye with mashed potatoes was cooked to perfection, tender and juicy. We wrapped things up with their tiramisu, which had a nice light coffee flavor and wasn’t overly sweet.\n\nThe service was just as amazing as the food. Lara is a total rockstar. She's super attentive and genuinely pleasant. She really made the evening feel special.\n\nThis restaurant is great for a date night or special occasion.\n\nWould I recommend Capelettis? Without a doubt. It’s worth every penny, and we’ll definitely be back again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNy1hTHR3RRAB",
            "text": "AMAZING AMAZING! I dream about the Empanadas, house salad dressing, and the MASHED POTATOES. The best steak I’ve ever had. Service is incredible!! I’ve been here 4 times and it’s been a 5 star experience every time! I’m from out of town but when in town it is an absolute must. May God bless this place! THANK YOU"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUN0llNDJBRRAB",
            "text": "We went for an early Mother's Day dinner, and it was fabulous. Their French onion soup is the best I've had anywhere ever. I didn't get a picture, but the mushroom gnocchi was incredible! Just the right amount of bite and seasoned to absolute perfection. I ordered the mushroom ravioli with marinara rather than Bolognese sauce and I got no cheese. It'll look different if you order it. Everything was fresh and tasted homemade. Thank you for a wonderful meal! Also our server was a delight. Very accommodating and friendly. We already can't wait to go back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4ajdqWXFnRRAB",
            "text": "Wow! I ordered the flat iron steak. Absolutely fabulous. The mashed potatoes were delicious. I was hoping to try the homemade pasta, but she talked me out of it. She said the steak went better with the potatoes. She was right. The salads were delicious—especially with the house dressing. Oh, and the veggies were great! Super friendly staff."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbFktZzZBRRAB",
            "text": "We had our first meal in St George at this lovely restaurant. We sure were glad we found this place. Location was tops. There was a little bit of a wait to be seated, so my daughter and I walked around and took photos in the quaint historic arts district. We ordered the calamari for our appetizer, and that amazing morsel got us all excited about our entrees. My daughter ordered the sea bass and gnocchi, and I went full carnivore and ordered the rib eye. Both dishes were delicious and priced quite well. I can't say enough about our wonderful server who received a generous tip for her friendly and attentive service. We will definitely patronize this business again next time we get a craving for fine Italian food while in St. George. The capper of the visit was creme brule, and it did not disappoint!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cjd5VlRREAE",
            "text": "I went there with my girl on a whim and had a blast. I had just enough food to fill me but not to much,  even if you have to much they have to go boxes to reduce waist. It was really sweet and I liked the art on the walls. Our waiter was also funny so thar helped."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURucnFLYWRBEAE",
            "text": "Good food, atmosphere and service. Seafood pasta, even this far from the ocean, was great. The chicken Gorgonzola was tasty also if a little rich ( I should have listened to my wife)."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNweElLWWJnEAE",
            "text": "This is such a great place to eat. Awesome family atmosphere. The staff is friendly the restaurant is clean. The food is so good. I try to eat here once a week because I enjoy it so much. Make reservations ahead of time especially Friday and Saturday. This is a place you will enjoy."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlaE15ZGh3RRAB",
            "text": "Is this really a business?  Our second time visiting this restaurant. Last time was so so, but this time was the last.  We were seated around 7:00 pm and servers walked back and forth, with an occasional glance in our direction.  Finally, around 7:15 pm, one of the servers who had glanced our way came to take our order.  She was not friendly to begin with and being in the fine dining restaurant business for over 15 years, I told her she should smile more.  She grinned and said is there anything else you want me to do different?  My partner said being a little quicker would be helpful, to which she replied “this was as quick as I could get to you, I even skipped taking another party’s order even though they were here before you and if we had any other complaints , we could talk to the owner”. She had just taken an order at a nearby table with four people and certainly, they were there before us and we understood that, but the only other party near us had just been seated next to us, long after we had been seated.  The owner or manager happened to be at the table behind us and my partner asked, “are you the owner? “ to which she replied “yes”.  He told her that our server has an attitude.  She said she was aware of the situation and had reassigned our table to another server and that he would take care of us and if he didn’t, to let her know and she dashed off without an apology of any kind. I became upset and decided to leave.  I stopped by the kitchen area  and told the owner to cancel our order that we were leaving, to which she replied “okay good!”.   Okay, good?  Are you kidding me? Is that how you treat your customers?  I walked out and she approached my partner and said “if you disrespect one of my servers I am not apologizing for that” and stormed back to the kitchen area.  What????  If there was any disrespect, it came from the server and the owner.\n\nOne of the keys to management is getting both sides of the story.  We have no idea what the server told her and she didn’t care about the truth or her customer. How do you treat customers like that and expect to stay in business?"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQalk3cm5BRRAB",
            "text": "The staff is absolutely adorable and the ambience in setting of the restaurant is vintage and beautiful. My husband ordered the flat iron steak and I ordered the fettuccine Alfredo with chicken and the chicken was juicy and had a really good grilled flavor and his flat iron steak Was seared on both sides Perfectly and the middle was the perfect temperature. It came with a side of creamy mashed potatoes and some sautéed veggies seriously delicious A+ in my book."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dzdmZ3l3RRAB",
            "text": "Everything was perfect for a wonderful evening out with 3 of my 4 daughters!!\nOur server, Laura, was great!  The food was great exceptional!!  ♥️"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNDlQMFdnEAE",
            "text": "My absolute favorite place to eat in town! We are there for every birthday, anniversary & celebration! The staff is wonderful and the restaurant atmosphere truly transports you out of St. George. Love Love Love!!! ❤️"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtZzRPUkF3EAE",
            "text": "My favorite place to eat lunch and dinner in St. George! The staff and customer service is on point! Salmon salad and steak salad are super good! Chicken parmesan is good, and the fish and chips. The Dinner menu has a flank steak and ribeye steak with a super tasty mashed potatoes and vegetables that's the best steak I have had in St. George. Everything has lots of flavor and taste fresh! They have a good selection of gluten-free options as well! Highly recommend eating here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkc2J1Y2hBRRAB",
            "text": "I am glad I found this place.  For some people in my party whose top restaurant choice isn't Italian, we had a great experience. I really liked that the menu had several non-pasta based options for my party.  However, the pasta they did have tasted fresh made in-house. The Caprese Bruschetta was amazing. Definitely order this. The Lasagna was great and had great flavor so I would order that again as well. However, the salmon was a bit overcooked and lackes flavor so next time we would choose a different meat to add to a salad.  Our server was attentive and did a great job. Overall, I would definitely recommend this place for a local Italian restaurant with good menu variety and an upscale feel."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3OU5PdER3EAE",
            "text": "I had the spaghetti and meatballs. I don't know if my taste buds were just off because everything looked good and the temperature was great. The Marinara sauce have the appearance of a salsa. I'm sure it was fresh it just looked different. Maybe I've become to Americanized in my Italian food lol. The meatballs look good but it just felt like it was missing some seasoning or something I can't place it. The creme brulee was pretty good (pictured below ) Salad was a little weak. However... the bread alone was worth the trip!! SO good, perfectly soft and tasty!! Service was fantastic and the ambiance I thought was really good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtczdYTE9nEAE",
            "text": "Best Italian food in Utah,  I'd drive down from Salt Lake City just for dinner.\nI had the special Sea Bass,  my wife had the Gnocchi Bolognese with chicken.  The pasta is all handmade . The owners work in the restaurant along side the staff\nMy wife had the French Onion Soup, she said it was the best she'd ever had."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURicHMtMTV3RRAB",
            "text": "Upscale Italian food, as in sea bass over gnocchi and not just pizza and pasta.  French onion soup is a must for those so inclined.     Service was a bit forgetful for a solo eater on a busy day."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPNzkzdUh3EAE",
            "text": "Cappellettis was a nice Italian restaurant away from the business of Zion. We found out that parties of 5 or more need to make a reservation, so we had to wait a bit. However the wait was worth it! Chicken Marsala, Fettuccini Alfredo with…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMG9MRGtBRRAB",
            "text": "Food is so authentic & lovely! Ask for Jaimie as your server... Outstanding friendly service. Even though we don't go too often, she always recognizes us! My husband had fettuccine Alfredo with chicken & I had their lasagna, both to die for! Lasagna has both the \"Sunday\" sauce & the Bechamel sauce as well. Definitely make reservations for dinner as they\nare so popular!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4OFpEMlhBEAE",
            "text": "Awesome food and good atmosphere. Being in one of the older buildings in town. Almost every dish can be shared by two people. We split the classic chicken Alfredo with two dinner salads and the calamari appetizer. The blue cheese and cranberry vinaigrette dressing were full of flavor. The wine is a little bit pricey if you ask me."
        }
    ],
    "reviews_count": 62
}