{
    "name": "Positano Italian Kitchen and Wine Bar",
    "place_id": "ChIJz7yregBbyoARJ6C--DpWf64",
    "grid": "SI1",
    "address": "1501 S River Rd, St. George, UT 84790, USA",
    "rating": 4.6,
    "user_ratings_total": 374,
    "phone_number": "(435) 688-8100",
    "reviews": [
        {
            "date": "6시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214SGVFSTNlbFJ1WjNobmQyUm5VakJvV2tOSU0wRRAB",
            "text": "Food is great. But it's 8:45. They close at 10. We are still in the middle of dinner and the server is swiping the floor like right in my feet. Ridiculous. It looks fancy but that's just gross."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JeWNFNVlXRWhYYVhSNVNFbEJRMHM0UlZZeWVsRRAB",
            "text": "Good food, good service, but uncomfortable feeling rushed during a nice dinner, and there was a long line of people waiting very close to the dining area.  We felt pressured to hurry up and finish. In and out in 1 hour flat, which is too fast for an upscale restaurant.  Couldn’t relax and enjoy our wine.\n\nFilet Medallions were chewy at Medium Rare (not tender like you expect) but Brussel Sprouts and Calamari appetizers were tasty.  Seafood Pasta was also very good.  Excellent mashed potatoes too."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poa2VXOWtjVGN0VEVGUU5GOU9SVU40TkRGSFQyYxAB",
            "text": "Very delicious."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21adWRubGFaRWxvUm1od09VRnFWVXRzVTNaa1NtYxAB",
            "text": "The lasagna was excellent.  It was Halloween and there was no wait."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poV2NYbHdaWGwwTVZaQ1FWVXpRblpZYjNaVFpWRRAB",
            "text": "We were very impressed with our experience here. The food was great and the service was top notch. We will definitely be back soon."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tORk5XbE9ZMUkwTXpnM1JrZG9RMGt5YWt4d1gzYxAB",
            "text": "Really great service and good food. A lot of the cocktails seemed alcohol heavy so I ordered a Citrus Mule that was very good. Pretty strong alcohol taste but still really well balanced in flavor.\n\nWe started off with bread (not included for free) and it was nice and warm. The oil and vinegar served with it was good. We ordered the bruschetta and arancini appetizers and they were both great. The bruschetta was my favorite thing that evening.\n\nI had lasagna and a side caesar salad for my main and it was pretty good. The lasagna fell apart pretty easily but the flavor was nice.\n\nWe finished off with chocolate cake and it was probably my least favorite part of the meal. It was fairly dry and not super strong in flavor. I would skip that but the rest of the food was great.\n\nOur waitress Sunny was super attentive and and kind. The hostess was very nice too.\n\nOverall, I'd give it a 9/10 and would stop here again if I was in town."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSVNsaDJVV1Z1ZDBkVlRHVmpabk5FYm1sdlprRRAB",
            "text": "2 pieces of bread 1 small scoop of Lasagna and bowl of soup, throw in a Rude forgetful server for good measure and 70 bucks,  and I won't be back.\nFood was tasty and super fast,  but just not worth the price and pain."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aYWVVRTFhMFZVUlZCMlNuZDFRVTk2YlZsT1gwRRAB",
            "text": "Just visited and was not impressed for the price. An average meal was $25+ and did not include any sides. I got ravioli which was 6 small size raviolis and 5 shrimp and cost $28, and the rest of people in our group had similar experiences with small portions for high prices. The food tasted good, nothing particularly special. If the place was 40% of the price I think it would be a fair deal. Bread was an additional $6+ for two pieces, it cost $18 for our group of 5 for each person to get a single slice of bread. The waitress was VERY proud how the bread was \"shipped from SLC daily to be made\". I left still hungry and spent almost $50 just for myself. Not a fan of our waitress, but obviously that varies by server. Purely from a price/quantity/quality ratio its just not remotely there."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRdE1XSktSMjlXZDNoeVkwbHNOSEZyVUhocFluYxAB",
            "text": "Fantastic vegas vibe. Delicious food. Fettuccine Alfredo was more creamier than Little Italy restaurant in san Francisco. Chicken parmesan was delicious. Large portion. Bread and herbs were delicious! Cristina was a fantastic waitress. Recommend."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkalJFa3RabmxRVVc5Slh6bGthMEpKVDA0MlQxRRAB",
            "text": "While not a five-star Michelin super fancy restaurant, this is very cozy and the food is excellent!\n\nCustomer service was off the charts and the drinks were very good.\n\nThis is a must-stop and visit."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVmQyNUlSSGRzUzNkNU4ycFNaRlJpY2poaFRrRRAB",
            "text": "Long wait to get in but fabulous food and good local wine."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRmFqazJZWGRaYldGSWIwaHRlamRXY1ZJNFlYYxAB",
            "text": "We were excited for a “cozy wine bar”. Instead we were greated by glaring bright lights, wide open dining space, no candles on tables, laminated “Applebees “ style menus, and a poor wine list. The food was okay, but not a ton of flavor. It’s really too bad because we were excited at the possibility of an upscale place in St George but unfortunately this isn’t it. A few tweaks to the atmosphere and menu and they could get there, but as of now it’s a no."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJMmVESnJaRXBNUm10elEySjJlSFp0WTBkMVNtYxAB",
            "text": "Jamie was our Server and she was absolutely PERFECT! All the workers were dressed very nicely and all were attentive and cordial as can as if they “love their jobs”! Awesome dining experience i highly recommend."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWSWRIRjNaVWRrU1dGc1NVUldUSE0zVEVoQlpFRRAB",
            "text": "Went on a busy Friday night with events in town at peak hours and our wait was 40 minutes for a group of (4). The food was great so it was worth the wait. I will definitely be getting the Chicken Parmesan. The entree meals will fully fill a single person. I’ll be coming here again."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ka1p6TldNemRJZUZSQlNqbHlWbll6Y1V4eGQzYxAB",
            "text": "What an awesome experience. Service was some of the best we’ve had in St George. Justin was our waiter and was prompt and professional. He was also knowledgeable about the menu and we took his recommendations and were incredibly pleased! You can tell they use really quality ingredients and everything was priced appropriately. Thank you to Justin and Sky for such great service.  We will absolutely be back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vNVlXaFFYekJ0YVVrNFlsZEVSa2xxYTNJeldtYxAB",
            "text": "The food was delicious. We tried the Positano pasta and the shrimp ravioli and would absolutely get both again. Jaime was a great server and took great care of us. Highly recommended!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSblFXbzBSVEZqUVRoaldUVk9kMGw2UVVwUWJWRRAB",
            "text": "The food was not very good! Lack taste!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4bVMyUklMVkZaWlZOSmNHVnBUblEzVEVOV1NVRRAB",
            "text": "Delicious Italian food and great atmosphere. The service was friendly and prompt. Definitely worth the wait. Be sure to go early before the lasagna sells out, it was amazing!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWV1pqQmFTMDFETWpSaVlsZzNlSHBZV0hRMlpXYxAB",
            "text": "Great experience! Really good food!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWRE5uUXpUSEZHY25GcGJHVjJjVGhYTmxKTloyYxAB",
            "text": "Absolutely delicious food. Lasagna, smoked ribeye and salmon were amazing! Service was great! Nothing but good things to say about this place!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WWWRqWlJUblJqZEdaTkxYRllTak5hYUV0NGJtYxAB",
            "text": "A true Italian Restaurant in the Washington/St George Area. Our dinner was delicious. We will be going back for sure!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RMVFsZEpTVEkxYTIxV2NUVkNabWRzWjNsSVlXYxAB",
            "text": "What an amazing experience!  From the moment we sat down, our server, Tyler was absolutely incredible. Super friendly, attentive, and really made the night feel special. You could tell they genuinely cared about making sure we had a great time. If you go here make sure to ask for him.\n\nThe food was out of this world, everything tasted so fresh and authentic. The drinks were just as impressive creative cocktails with the perfect balance.\n\nBetween the amazing service, delicious food, and vibey atmosphere, this place is definitely a new favorite. Can’t wait to come back. Thanks Tyler!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xadFYwbGZPWG81VlhkWk9WOTBlbE5sUWxCZlVXYxAB",
            "text": "Tonight was our first time at Positano. We were pleasantly surprised. The food and drinks were delicious! We will definitely be back."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSWVIzcDNUbFJJVm5sS09FMWtNRzlDTlY5NlNVRRAB",
            "text": "This place could be amazing but lacking a few things. We came for date night around 8pm. When we were sat we noticed how extremely bright it was. Hospital bright lights don’t pair well for a romantic dinner. My other suggestion would be to section off smaller dining areas. With the current wide open tables it’s extremely loud. I think these small tweaks would really help.\n\nAs for the food it was really good! The portions are small though. For the prices I would have liked the pasta to include a salad and bread.\n\nOverall experience was fine. If these changes were made I’d definitely go back."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKeWRHeHlTekk0TmpSS1V5MWlWVFZtTjNWVmNHYxAB",
            "text": "Food was perfect and the service was great. Restaurant is beautiful but the tables are crowded and can hear everything being said at the tables next to you so it’s a little too distracting if you are looking for an intimate dining experience.  We ordered the Truffle Gnocchi and the Positano pasta dishes for our entrees. I added a side of asparagus to the gnocchi and sliced it up and added it to the gnocchi, it was VERY good!  We always order calamari but wanted to try the fried artichoke hearts, which we have never had before and we thought they were great.  For dessert I had the tiramisu which was as good as I’ve ever had. My husband ordered the dolce al limone lemon cake, which was light and flavorful and also very good.\nWe highly recommend and will definitely be coming back and getting the calamari next time."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tReVJtNVBUVUV4Y2s1MExUZ3plVkJTTm5wVmRXYxAB",
            "text": "What a Pleasent surprise. Eating here was delightful, and delicious. The service was excellent and personable."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OelMwVlFRVFJrVWxoNVNIQnBlRlJ5WkU4MFVGRRAB",
            "text": "Food was incredible!  It started to rain and the staff was immediately there to lower the out door shades to not interrupt our dinner.  Recommend highly"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSNmJFUmlTRzAzTFhka2Jta3hORXRsVDJzNE1sRRAB",
            "text": "The lasagna was delicious, restaurant is beautiful, and staff gave us excellent service. Highly recommend and we will be coming again soon!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVFUzQkNSRVZmVDNCMldUQlphbGRHZVdaWldGRRAB",
            "text": "Food was very good, service left something to be desired."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjdFFYcFBkRlF4U3pKbWQyODRNRTVTYm5sa1JsRRAB",
            "text": "This place is amazing.  So many food choices. I was skeptical of an Italian restaurant having a couple of dishes served with mashed potatoes. but why not!  they have plenty of pasta dishes too! Tuscan Chicken and Lemon Shrimp Ravioli are sooo good! I love that there is a bar. The bartenders were fun and friendly.\nI will definitely go back!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25reFdHNTRRMnhOZDFabmFIbFFOSGsxVFZwTk1uYxAB",
            "text": "Great Italian food and great service.  I really wanted to try lasagna but they were out at 6pm!  A friend said he's tried to order 3 times and they are always out.  I ordered Fettuccine Alfredo.  It was good but not the best I've had.  My wife had Chicken cacciatore and loved it.  It's definitely worth giving it a go."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CamR6RklXVU5RYWpCdFl6bHpSVlJMWW01YVUwRRAB",
            "text": "I ordered the Positano pasta and was really disappointed. The noodles were hard and overly chewy when I brought it up to the waitress, she said that was “normal,” but it really shouldn’t have been as bad as it was. The dish lacked flavor and just didn’t taste good overall. If it had at least tasted better, I might’ve powered through, but I couldn’t finish it. I also wish the waitress had offered to speak with a manager to see if something could be comped, given how inedible the dish was. You would think if the pasta shares the same name as the restaurant, you’d expect it to be one of the best things on the menu."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGUldVRmhSblJDYlMxMVZsVnZXWE4yTUc1Q2VYYxAB",
            "text": "I took a group here for dinner on a Tuesday evening. We got there around 4:20 (they open at 4). We sat inside and were seated without a wait. The restaurant had several people already there. The decor is beautiful and refined. The seats are very comfortable. There is outside seating available and a bar area. The food was very good. Everyone really liked what they got. Most of the party got pasta. In the pictures is the spaghetti, lasagna, and ravioli with shrimp. The bread service was delicious and worth the $6. The bread is softer than you would expect. I can't wait to go back with my family."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oWFFrRnZNMEpXVUVkWExXMHdiVUZ4VkRWVVNFRRAB",
            "text": "Good portion for spaghetti. The place is nice and clean."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRlJsaEZSMWg2VUdSTExVUlFObkZTY21weVNrRRAB",
            "text": "This is my new favorite restaurant in St. George! The atmosphere is cozy and inviting. I like the lights on the trees inside. Adds a nice touch.\nThe service is excellent. Our server Jamie Lynn is superb.\nThe cocktail 🍸 is divine. Could easily drink more than one.\nThe food is delicious. I recommend the pasta 🍝 and my mom loves the pizza she ordered.\nWill definitely be coming back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GRFlrTmhaa2g1TmpKdU9YWkVibmxCZW05dWQwRRAB",
            "text": "Very good, presentation was lovely, but overpriced. For what they charge, the 4 pieces of bread should be included."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWbmJtNWFjM1pXZUVWblkxUjZiWGxhVTNkVmEzYxAB",
            "text": "The good: our server was friendly, the restaurant looks nice, and atmosphere would be decent for a date or with a group of friends.\nThings I didn't like: No kids menu - or option of smaller portions, 'bread service' was $6 for two small and dry pieces of focaccia with some basic oil and balsamic, pasta was ok but flavors didn't hit the mark as expected for a more 'premium' restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdVFWWlpkRTl2U25oRGNuVjJhRWxvZGpoa1VFRRAB",
            "text": "We have had the pleasure of dined here a few times now with family and friends. Everything we'd tried from the apps to the main courses have been so distinct and flavorful. The atmosphere is tastefully decorated and laid out perfectly to allow a main dining area, with just enough separation for a nicely spacious bar area. I am looking forward to the fall temperatures to see if they'll open the bay doors. Most recently my husband & I sat at the bar while waiting for our table, but chose to spend our evening there because the staff were all so personable. They offered excellent menu selections for alternate dishes to try. As a fan of citrus drinks I was pleased to see the option of a lemon meringue martini and was not disappointed. It's crisp, lemon flavor with the sugar rim and meringue topping was as near a slice of the actual pie one could enjoy. If you appreciate lemon, this is your sip."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tST1Z6WXhlVGxWV1RNMmNGcE5PVEZqTlU4eVptYxAB",
            "text": "We’ve been several times with friends & family. Most recently, my husband & I sat at the bar while waiting for our seats and the bar staff were so welcoming and friendly, we gave up our table & thoroughly enjoyed the rest of our evening right there. The food is always fresh and delicious, from apps to main dishes. This particular visit I tried a lemon meringue martini. It was fresh, with a crisp cistern tase you’d expect, but just like an actual slice of pie! If you enjoy lemon spirits, this is your sip!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xb1dGSTFVelZoU1VkRk1rbDVTRXMxWVhCeGIxRRAB",
            "text": "I am leaving a 5 Star review because  Positano has FANTASTIC GLUTEN-FREE PIZZA.\n\nI am not sure about all of their other menu items, but the gluten-free pizza is exceptional in quality and taste."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wMmRVMXFXalEzUmsxVVMwNXJUbW95YzA4MGRIYxAB",
            "text": "Visited Positano today.  Seated right away- Savannah our waitress was amazing, gave feedback on selections- attentive and friendly-  even gave us recommends for our next visit on things to try.  The food was tasty but the pasta needs cooked just a little bit longer for our liking.  Can’t wait for the temps to cool down a little to enjoy the patio!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ScFJtVmhNMnQyY3pneGFHOHpZakprYm5aTmJVRRAB",
            "text": "Walking up the building is beautiful. Then you walk in greeted by the hostess's with a smile. The atmosphere is elevated, and the decor is unique and stunning. We sat at the bar. The staff was amazing. Friendly and had wonderful suggestions. I like when staff is helpful but doesn’t rush you. My drink was beyond my expectations! Really good! We also had the bread service, the garlic herb butter was my favorite.We shared a pizza and a pasta to get a taste of a couple things. You can tell everything is fresh and made by hand. Such a great addition to St. George!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21obk1EbGxaSGxOTVRWNVh5MW5WR3cwZUVFMFoyYxAB",
            "text": "Just what St. George needed! This place is a true gem. The pizza is spot-on, the bread is a solid 10/10, and honestly, we can’t even pick a favorite appetizer because they’re all so good. The drinks are perfectly refreshing, and the staff makes you feel right at home. If you’re lucky enough to sit in front of Sky at the bar, you’re in for the best service, she’s amazing! The cozy atmosphere makes you want to linger and stay awhile. If you’re craving Italian comfort food, look no further."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTVJrZFVkemQwV1ZjdFJYWlphRk52VDBSRlMzYxAB",
            "text": "We had a great experience tonight with Amanda! The fried artichokes were amazing, the bread was great, pesto pasta was great, lasagna was not what is expected and super good. We also were in and out within 30 minutes! Amanda was an excellent server and very attentive. We’ll be back 💜"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xdFNUSnhUWEpUUkhGRlRFOWZZeTFxZDJ4bE5IYxAB",
            "text": "We had dinner last night at Positano. The food was delicious and the presentation was stunning! Our server Jamie provided top notch service, she was a true gem. We  absolutely loved the atmosphere! We're already planning to become regulars."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTVdYbFhWa3BrUmtkeGVFdDVTMk00UmpocFNIYxAB",
            "text": "This piece that St. George was missing. Positano was a wonderful fresh Italian wine bar. The food was cooked well, even on the 2nd day of opening. The staff were friendly and quick. Management and ownership were both present and not over bearing. The drinks were wonderful and the wine selection is amazing for the area. Local wines as well and plenty of foreign and domestic options.\n\nOverall it was an amazing experience. The price isn't too much for what we paid. You'll be happy you came here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsU2REaE5SemxaYjBKR1oxQnZSWGt6YkZseFNsRRAB",
            "text": "Got the arancini balls and it was an amazing party in my mouth!!\nHighly recommend!! Vance was our server 10/10 he knows his stuff and is the type of waiter you want because he’s well versed on Italian fusions.\nWe got the mushroom goat cheese pizza and chicken parm which was a foodies dream. It blew our minds. The balls are unbeatable!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNWExRlFTMnRhWjJsWWFFTjNaVmhVWDE5V2ExRRAB",
            "text": "St George has been waiting for a place like this. Outstanding food - the apps are some of my favorite in the area. We tried the Brussel sprouts, artichoke, calamari and bruschetta. I loved all of it but the bruschetta was out of this world. The ribeye is a very smokey flavor. Positano’s pasta is a must try. The lasagna is also very good - the pesto sauce around it is such a nice touch. Shout out to Scarlet for being so attentive and helpful! We will be back (and have been already)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213elduUTJhR3hRU1VzMlkyVTNaSFk1ZUdreVFuYxAB",
            "text": "St. George FINALLY has a chic spot to call our own! First of all, wow, it is so beautiful inside! Love the vibe. The service was amazing!! But let’s just talk about the food - OMG! We started with the Fried Artichokes and Brussels sprouts. Holy cow, both were amazing! The artichokes were perfectly fried, and the dipping sauce was a lemon-y masterpiece. We had the Truffle Gnocchi, Positano Pasta, and the Pepperoni Pizza as our mains. I can’t even handle how good that gnocchi was! Every single item was delicious. Even our youngest said the pizza was “the best pizza ever” (high praise from a 6 year old). We ended with the Cannoli cake which was delightful (the pistachios on top were the best)! I cannot recommend this spot enough!!! Can’t wait for our next date night to go again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSmJWVkNVVkk0V1RKb1JubHlTbk5UYVVOSk5VRRAB",
            "text": "Went to dinner Tuesday after hearing all the good things about Positano’s and they were all correct! Everything we had was delicious, the server was great, we only waited 10 minutes until all our party arrived. We shared the calamari & arancini balls for an appetizer, for dinner we tried the lemon shrimp ravioli & Tuscany chicken. So delicious I could order them both again but I want to try everything on the menu. The lemon meringue martini was perfect and refreshing. You must try this place! Great for a date night or girls night out."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkak9UTTNiMFIyT0dsSldqZDJaVkJCYVdSMk5GRRAB",
            "text": "First time dine in experience was lovely! The food was tasty and flavorful. Our kind server Amanda brought warm vibes to us! Would definitely go again 🙂"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214a2VGQkhiR3c0YmxKd2QzRlJRVXhUYnpWemRrRRAB",
            "text": "This was a excellent place to eat. Our server Vance was the best. Everything I tried or tasted was amazing. The sauce on the gnocchi was so delicious I wanted to bathe in it. The marinated tomatoes on the Bruschetta was so delicious 😋. I love the focaccia bread. The chocolate and the lemon cake were moist and divine. I look forward to our next visit."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201bmJXdGtRVVJQVlZKSFZ6UnNMWFV6UlhkcFRWRRAB",
            "text": "The lemon meringue martini is absolutely the best drink in town. I had the lemon shrimp ravioli and it was so full of fresh flavor. The bread was soft and delicious and the pistachio cream and oil, vinegar and oil were perfection! I can’t wait to come and get a drink at the bar and get some bread. Open til 10 on weekdays and 11 on weekends. I’m so happy to find a place nearby to hang out with a great wine and drink menu!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxUFdFUkJTMmM1V2pKeFJUazROMFZyVEZwUlVIYxAB",
            "text": "We waited for 90 minutes for our table. Once sat we noticed how loud the restaurant is with minimal sound barriers. Way loud with all conversations going on. The seats are comfy and the environment is pretty. Tables are decent sized too. We ordered the fried artichokes which was yummy. However our main meals were very lacking. Tuscan chicken was dry, overcooked, and bland. No seasoning at all. I did wonder if they didn’t season the chicken because they were worried about the salty toppings over salting the dish. The sauce wasn’t very flavorful. Potatoes weren’t seasoned at all and were bland too. The parmesan chicken was okay according to my husband, but his potatoes were bland as well. He didn’t have any sauce or anything to help so he didn’t care for his meal much either. This place is more expensive than Olive Garden so you would expect better tasting and such. We were disappointed and don’t know that we care to go back for that price and what we experienced. The plates looked good and yummy. Food didn’t translate to being that way though."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZMmNucFZNMGswUzJaUlpWTkhiR2h3V2xsb2FFRRAB",
            "text": "Absolutely loved this place! I had the swordfish and Brussels sprouts - both were cooked to perfection. The flavors were incredible, and you can tell they use fresh, high-quality ingredients. The atmosphere was warm and welcoming, and the service was just as great-friendly, attentive, and kind. Can’t wait to come back and try more of the menu!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aNFlWZG1OelpsWjBSbVVuWlBSekYyWXpjMlNVRRAB",
            "text": "I had the pleasure of dining in the beautiful establishment on Thursday night and I have to say I was so extremely impressed from beginning to end.\nFirst the Hostess was dressed beautifully and she was so nice and greeted us immediately. She then asked how many on the party I told her 3 she said that the wait time would be a 30-45 minutes (which we were fine with) but actually ended up being ONLY 13 minute wait.\nOnce we got seated, our server McKell was at our table welcoming us almost\nInstantly with a beautiful smile as she was pouring us glasses of very cold waters and Taking our drink orders at the same time.\nShe repeated back to us the drink orders and said she will be right back with those.\nThere was hardly any kind of a wait with our perfectly made cocktails. McKell then took our food orders with promptness and also repeated that back to confirm.\nWithin what seemed like 10 minutes (I’m sure it was longer than that) our food arrived beautifully Plated and at a Perfect Temp. The flavors were amazing and the portion sizes were bigger than I thought they would be (I couldn’t eat all of mine so I took the rest home - which McKell boxed up for me.) Next Day Lunch Was AMAZING\nWe paid our check McKell thanked and wished us a great night.\nThis place has a Beautifully Decorated Interior - The Staff was Super Amazing - The Drinks were ON POINT and the Food was MOUTH WATERING DELICIOUS!\nI WILL Be Returning!\nThis Place did NOT Disappoint!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCcmFHOHhNVkkzUmsxamJqaGtlSEptUWpsalNuYxAB",
            "text": "We had a fantastic dining experience at Positano Italian Restaurant! The service was warm and attentive from start to finish, and the atmosphere felt both elegant and welcoming — perfect for a night out.\n\nWe started with the bruschetta, which was fresh and full of flavor. The wild mushroom pizza was rich and earthy, cooked to perfection with a crisp, wood-fired crust. The swordfish was a standout — perfectly seasoned, tender, and delicious.\n\nFrom food to service to ambiance, Positano delivers on every level. Highly recommend for anyone craving a top-notch Italian meal!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KNVJYWnRjWGhRYkhBM01HWnNhelpJYUROaVdVRRAB",
            "text": "Visiting from Orlando Florida. My daughter and SIL suggested we have dinner at Positano and am I so glad they did! We were immediately greeted when we walked in, the atmosphere is stunning, visually pleasing, clean and inviting. The staff is very friendly and prompt. The food is absolutely delicious and the bread service was exceptional, well worth the price. My only suggestion would be a smaller menu. They were a bit large to hold and quite flimsy. I definitely plan on coming back on my next visit!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OMFFVUklaRVJHZGxWc2JVOU5XRjlhVTJkaldtYxAB",
            "text": "This place was just amazing! We got an appetizer, two entrees, and one dessert and spent roughly $65 including a 25% tip(which Matt, our waiter, was totally deserving of! He was just amazing!). I would absolutely recommend this place to anyone!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4SGVqaFNiVTVuTW5kak1rZDJUVUZoVW5weVpVRRAB",
            "text": "Well I was looking forward to this place. I am excited that St. George is growing up. And I’m hopeful that they just had an off day where things weren’t jiving. The wait for the food was a little too long. And when it did come out both the food orders we had were cold. My wife’s lasagna was cold not just on edges but in the middle. My chicken and mashed potatoes were cold. And my dish was bland. My wife’s lasagna the sauce was not as good but maybe that could be because it was cold. I will give it another chance and see if that’s the case but hopefully they iron some things out. The pricing there dis not match service and quality of food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0amJWZGthSFI0TURGUWFtbHdiazFRUzFWRlRHYxAB",
            "text": "On 8/20 my Wife and I went to Positanos in Saint George for the first time.The decor was beautiful throughout. There was a one hour wait, however, we were offered to sit in the bar. We were seated in 3 minutes. The bar is very spacious, Tyler, especially was warm and welcoming and very attentive, watching him move from each customer making each feel like you were a longtime friend and had all you needed. Justin was our server and very attentive and kind as well. The food was spot on, we had the fettuccine Alfredo and the chicken parm. The bread- we had the garlic butter and the herb dip, wow, it was amazing! The wine and the white sangria were delightful. We had no room for dessert but will be back to try. We never felt so welcomed at a restaurant, or have witnessed such sincere attentiveness. Positanos stands out above the rest 💯. We needed a place like this in Saint George!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204eVQyVk5XR050Y2xSSWNrUnlPREpxZFZGa1IwRRAB",
            "text": "An unforgettable dining experience!\nPositano Italian Kitchen and Wine Bar is a true gem in St. George. From the moment you walk in, you’re greeted with warm hospitality and an inviting ambiance that feels both upscale and cozy. The food is absolutely incredible! I had Ribeye and it was to die for! Every course was beautifully presented and full of flavor!  Absolutely amazing! Wow wow! Our server Scarlet was the nicest! Highly recommend!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taTFRHVTRMVEZuWVhGUWFYZ3RUWEZUVXpsRVlVRRAB",
            "text": "We just tried the food tonight. The bread plate is 6 dollars and it was nothing special! Not sure I have ever paid for bread before? I had to ask for more bread and more oil twice! Portions were very small on the bread plate but the garlic butter was very garlic and good tasting. My wife ordered the Rigatoni and it was very little flavor. The sausage had zero flavor. The need to use an Italian sweet sausage or something better with flavor. The noodles were not quite ready to serve, too Al dente. I ordered the lasagna and again very little flavor! The waiters was very sweet but had problems with her computer. Very slow and brought out my soup with everything else. The soup bowl was 1/4 full for 7 dollars! Way over priced for the amount.  This food was no where near 5 star. We were very disappointed! Might come back to try the pizza. Maybe? If you don’t come before 4:30pm on Friday you will have a very long wait. Not open for lunch! The bar was packed and very loud."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWalZqazRPRlY2Tm5sWmFrSlBSWGh1VWpaYU5WRRAB",
            "text": "I ordered the pesto with chicken and had what can only be described as a religious experience like the basil itself whispered “mangia” directly into my soul. We also got the margherita pizza, and let me tell you, if this pizza were a person, I’d write it love poems and text it back immediately.\n\nThe vibe in the restaurant? Chill. Cool. Like, “I could totally be in Italy right now if I squint and ignore the red rocks” kind of cool.\n\n10/10 would trade my passport for another plate of that pesto. Bravo, Positano you’ve raised the bar and my carb intake."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paMmNHc3RZVVZoT1ZjeGVGYzRabmRRYVVnME5GRRAB",
            "text": "Great addition to St. george!! We were served quickly and our waitress was attentive. Brussel sprouts were awesome. Pizzas looked amazing and tasted pretty good. We will be back to try the pastas next time!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NmRUQm9WRFJyUTJoZlgyZGtaMmwxUzA1cVFYYxAB",
            "text": "The fried calamari was a crowd favorite at our table of nine — well-prepared and enjoyed by all. The atmosphere was lively, though it leaned a bit loud for easy conversation. One suggestion for the kitchen: consider slicing the chicken before serving it over the fettuccine alfredo. Having to use a knife made the dish feel less refined than it could be.\n\nFor large parties, it would be more practical to provide individual water pitchers at the table — maybe two or three — to avoid the awkwardness of reaching across others to pour. Lastly, it would be great to see the option to book reservations through OpenTable or another online platform for added convenience.\n\nAll in all, a solid dining option for St. George with just a few areas that could improve the overall experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOUmVHaFphazkyWlZkUWF6ZEpWR2RHTlRWQmEyYxAB",
            "text": "I ordered the Lemon Shrimp Ravioli, and it was delicious! Gave me a reason to come back and try some of their other dishes. We finally have a GOOD Italian restaurant in St George that is not olive garden (if you can even call that place real Italian food?) I just wish they were open for lunch!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCcmRYaHFOVGxDZG5GUVFYaGlkVkV4UTJGb2RIYxAB",
            "text": "It was a 30 to 40 minute wait tonight so we went and sat at the bar. It seemed ment to be! We stayed there for dinner and it was amazing! Our bartender Justin was so cool and knowledgeable, friendly and suggestive! The two  owners, Royce and Cameron, brothers were right there as well making drinks and even doing dishes! It was just amazing to be right in the midst of it all! Did I happen to mention the food was also amazing and priced right! Can’t wait to go back! Highly recommended!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twWWRsbHhhbmx2UkVwQ1NuSjJZbXRuYjNWQ2JVRRAB",
            "text": "Positano Italian Kitchen and Wine Bar in St. George felt like stepping into my long-lost Papa Georgio’s villa on the Venetian coast, minus the smell of sea brine and also our family trauma.\n\nThe warm lighting, the pasta, the way the waiter said “bolognese” with authority, I was transported back to the homeland.\n\nI haven’t spoken to Papa since “The Incident of 1992” with Grand Mama (we don’t talk about the ravioli accident), but if I did, I’d tell him this place does his memory justice.\n\nEvery bite of gnocchi felt like a soft kiss from the ghost of our family’s shattered legacy…\n\nI ordered the chicken parm and blacked out from joyful bliss halfway through chewing. I couldn’t say if it was the chicken parm that knocked me out, or the 14th cocktail we had tonight.\n\nBut when I came to, I had a new appreciation for Italy, forgiveness, and of course parmesan cheese!\n\nThe wine poured like silk, and at one point I swear the host started levitating. My date cried twice, once from the tiramisu, and once when the bathroom mirror whispered a blessing in Italian to her.\n\nIf you want to feel like your soul was adopted by a Mediterranean grandmother who never judged your life choices, this is your place. Positano was warmer than Papa Georgio’s heart… and thankfully less violent than his fork throwing tantrums.\n\n10 out of 10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkYWNrWlZXVWxXYzNsb0xXRkNNa05UTURoQ1pYYxAB",
            "text": "If I only had 50 dollars left to my name, I’d use it to eat here.\nIt was definitely some of the best pasta I’ve had in awhile. I got the pesto fettuccine, and my husband got the truffle gnocchi. He practically licked the plate clean and I kept eating even after I was full— this stuff was that good!\nWe got calamari and brussel sprouts as appetizers, both very good but not astounding.\nThe hostess and our waitress were both so kind and accommodating. Our waitress especially, chatted with us like we were friends. It was very refreshing.\nReally, even if the staff was rude I would’ve come back for the creamy pesto sauce. But it’s definitely a plus that they’re so nice!\n\nWould 10/10 recommend!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWc1pVUjVNVk5HUjJ4cmNHVTNSM0JxTkV4bmRVRRAB",
            "text": "We had an amazing experience.  The food presentation was delightful and the service was exceptional!  The portions were perfect and we loved what we ordered! We will highly recommend Positano to everyone we meet!"
        }
    ],
    "reviews_count": 71
}