{
    "name": "Sakura Japanese Steakhouse",
    "place_id": "ChIJ1cL9qC9byoAREPC-LkJ7mto",
    "grid": "SI1",
    "address": "81 N 1100 E St, St. George, UT 84770, USA",
    "rating": 4.7,
    "user_ratings_total": 3592,
    "phone_number": "(435) 275-2888",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RVdsTkNORWd6WkZkdlJVbDVNMHhwUldneVdsRRAB",
            "text": "Phenomenal sushi and hibachi"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWlRtWXhjMHN4WlRZeE4wZEtMVUpLZEY5QldIYxAB",
            "text": "Fantastic food and the cooks are great in personality and skill. Staff is very friendly, welcoming and easy to converse with. 10/10"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4cE0xSmtiMUV5WVZwRlYzazBSVlowUjFCVFYyYxAB",
            "text": "I can see why this place wins best of Utah. It is literally the most delicious restaurant in St. George! The service is excellent and the food is the tastiest around."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RlJ6WklNbFZITjA5Nk1ucE5SMFZzZUcwelVGRRAB",
            "text": "Beautiful restaurant, we dined in and got sushi (it was ok), it was delivered by a robot. They seated us in a private room, which was perfect so we could talk."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WYVdYbGxjRlF3TFY5TlVURkJjRzVuTkhsZlEyYxAB",
            "text": "Super good, little busy but the owners are amazing and make sure everyone’s taken care of!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVME1UaGpTa1pYUzJ0U1IwVjFTVkJmVGxsMFZuYxAB",
            "text": "I highly recommend this restaurant, family has been many times and we always have a great time and the food is always amazing."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVFNHaHlVSGxUYWxaWWVrSlZSazVxTTFGZlpFRRAB",
            "text": "Place is fabulous. Been there 30 times at least. Never been let done"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wVU4zQkdSbEpNWkhwclYySnpUakpaWmw4NVMzYxAB",
            "text": "We came to Sakura Hibachi on Sunday evening with a group of eight and were seated right away—no wait at all! The food was outstanding—both the sushi and hibachi dishes were fresh, flavorful, and beautifully prepared. The chef put on a…"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWbE1XVXpXbWhtT1Uxc1pHUnNTV2xvVXpKTVZtYxAB",
            "text": "I really enjoyed this place. It was our first time trying it. It had a very cool atmosphere. They had one of those robots delivering food and to go boxes. The food was cooked to perfection. It was very flavorful. We enjoyed all of it. We will definitely be back."
        },
        {
            "date": "2주 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxbU1qVnFUSGxNV0cxTFRHNU9lRmhuTFMwek1IYxAB",
            "text": "Es war sehr lecker. Hibachi hatte ich zum ersten Mal und ich fand es klasse. Der Koch war sehr freundlich und hat auch etwas smaltalk betrieben."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aRFprMVphVUY1WldWRWRGazJiVzFsYUUxUVMxRRAB",
            "text": "Price to quality ratio was outstanding"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkUVJFNXZlVXhxTW5aSmMzWnBjVXhKTW5Sd01uYxAB",
            "text": "We stopped by Sakura Japanese Restaurant in St. George on our way to Zion National Park, and it was such a wonderful surprise! The food was absolutely amazing.  everything tasted fresh, flavorful, and beautifully presented.\n\nOur server Zach was incredible.  super attentive, friendly, and made us feel so welcome the entire time. You can really tell he cares about his guests. The owner also came by to check on us, which shows how genuine and hands-on they are with their restaurant.\n\nOverall, great atmosphere, great people, and delicious food. Definitely a must-visit spot if you’re passing through St. George before heading to Zion. Highly recommended! 🌸🍣🍱"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCTWJ6Um5UbmRzUmpCek4wZGxTM1Z6UmtWTGJGRRAB",
            "text": "Sakura is pure eye-candy and atmosphere goals. From the moment you walk in, it feels like you’ve stepped into another world. Rich, authentic décor, lighting that sets the tone, and every detail clearly chosen with intention. The vibe? 10/10. Even the robot server deserves its own standing ovation — delivering dishes and little treats like a futuristic sidekick.\n\nNow, the food itself? Mid. Not bad, just didn’t quite match the magic of the setting. But the overall experience still hits — the visuals, the service, the creativity all pull it together.\n\nCome for the ambiance and the wow factor — stay for the story you’ll tell afterward."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pod1luZFhkbmxUY0VSdWVESmlTR1UzTkd4WWVVRRAB",
            "text": "We went last week and didn’t sit at the tempankaki tables we sat on the other side. I had the steak and scallops. The dinner was good EXCEPT for the steak.  From the outside the steak looks right, until you cut into it, or taste it.  It’s…"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOcWJIVXpkMk54YzBack1HOXJRMDFPVURRd00yYxAB",
            "text": "This place was.. over the top. I have been to handfuls of Sakuras, but this was FANCY.. and VERY pro.\nThe staff were all in traditional Japanese outfits. The front hall had a giant fish tank and an interactive projection for the kids to stomp on and play in.\n\nThe food was spectacular! Truly unique, every roll, with nothing alike. The fish was fresh. The veggies were perfectly cooked. The pricetag was.. a bit high. But worth the experience.\n\nA new favorite."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnME1USTNVamRIVVZFeFR6Y3dabGc1WmtSSlUzYxAB",
            "text": "We loved this place so much we went twice during our trip!!! The food was amazing!!!! And the service was so sweet!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVNWIwSXdTSFZhTVMxd05sVldZbGh2YW1aWFRGRRAB",
            "text": "This place had the best service we have ever had for sushi 🍣. Everyone in our party enjoyed their food. (Even our daughter with food allergies). The atmosphere was great and we finished at a reasonable price. Will definitely go back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oRVMzVkhhbFJKTUhOc05HcEZZbll4YldJeFdFRRAB",
            "text": "Fun an tasty"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xVVYxcG9UR0pGZFRWaldWZzVOazF1Ykd0alQwRRAB",
            "text": "Our family was celebrating a birthday so we opted for the entertainment of the Hibachi style dining. The chef at our grill was fun, talented without being overbearing and got all orders correct and cooked to each individuals liking. I highly recommend the Sakura when in the area of St. George, UT."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsM1NrZFZlbFpLWDFaWExXUTNZbUk0VTFFMFYzYxAB",
            "text": "Had to come and update my review. Everyone who like me with a gluten allergy, needs to know about this place! They are SO good at taking care of you!\nI told them I had a gluten allergy and wasn’t sure what I could order. And they basically said to just pick what I want and they’ll make it gf!\nThey have a separate area in the back where will cook gf hibachi meals (the scallops are to die for!)\nAnd they basically helped me pick a roll/make a special one adapted to my gluten allergy.\nSo I got the yum yum roll and the lobster roll adjusted to be gf and it was SO GOOD!\n\nThe workers are always 10/10 nice and know what they’re doing.\nThe atmosphere is super cool.\nDefinitely keeping this place in our top pick of restaurants in the area! I even got takeout and they gave me a whole box of gf soy sauce. Love these guys!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWlpFaDRXSE5sUTBsdVkyNHlVbGh1T0dkUlkyYxAB",
            "text": "On a recent business trip and looked for nearby sushi and this place came up. Had no idea what to expect and were shocked at how awesome it was. Amazing atmosphere and the food was fantastic.  It was very busy but we got right in and got a table. Hoping to get another trip to St. George soon so I can go back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUmF6RlBkbFZJVEZGeWFWQndjV2cyTXpKclkxRRAB",
            "text": "Great service..Jean the owner helped us out made sure family was ok proposed at my girlfriends favorite restaurant and she said yes"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pac1JXWlVXVkZ5UmtKMGVsaFpXRzFRUzJGWU1GRRAB",
            "text": "We had the best night at Sakura tonight! We went later so it was a shorter wait, atmosphere is always so fun and clean, and service was incredible. We got a bunch of sushi rolls and apparently one piece of one roll fell on the floor in the kitchen, we didn't even notice when it was brought out, but they made us an entire new full roll to make sure we got everything we ordered fully. And Kallee our server, was so incredible. Truly the best server we've had in such a long time, she's a huge reason we had such a great experience and a huge reason we will definitely be back and recommend Sakura to friends and family! Give her a raise!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKSGJscEhiV2hTVUZOSE0xTXdaRmhJVTNOcFRVRRAB",
            "text": "We really enjoyed our visit to Sakura Japanese Steakhouse. The show and cooking at the table were fantastic – the chef involved us guests and made it a real experience. The quality of the food was excellent, and the price-performance ratio is very fair compared to Europe. We were lucky to get a table because we arrived right at opening time, so a reservation is definitely recommended. Overall, a great restaurant with top-quality food and an entertaining show – highly recommended!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOQlh6WlBVbHA0TnkxTE1YWmtSbkl4Y3kxU1prRRAB",
            "text": "This place was amazing. Drajat(Zach) was one of the best servers we have had in a long time. Will definitely be back! The food was also top tier, we travel all over the coast and the sushi was just as good here in the middle of Utah!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnM2RWSnVOekpqUjJJemN6aHhTRGgwYzJseGJYYxAB",
            "text": "This is the best restaurant in town!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NNFVYTmpjRmRtZEdoSk0yZEJUVFJyZGxocE9WRRAB",
            "text": "Loved my first visit here while traveling! Baked roll was super yummy! Fiancé got the pad Thai and was very satisfied."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsclZsOU5UMnBKVEhwS2FFcExjRlJvVjBFNE5FRRAB",
            "text": "What an absolutely delightful restaurant! Beautiful, so much thought and detail into all the decorations. Staff was amazing. The sushi was perfect! Wonderful experience!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkSFVteE1PVmRRYmpkYWNVOXBhMmMzYVdSUGJrRRAB",
            "text": "My granddaughter loves this place. I think it has to do with the LED screen on the floor or something else. Either way we made the trek from Colorado and ate at the hibachi bar. The staff was receptive to the granddaughter fear of fire and did a small one. The sushi rolls are good sized for the price and delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paemMxRmhNakYyUWtwVmNFMVJXRk0wVEU1RGJHYxAB",
            "text": "The best Sushi any where!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVFMxODFSbkk1YURSblFVZFNjVlpaZG5wVk1IYxAB",
            "text": "Just an amazing steakhouse"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25adlRIQmFiSGg1Y205bFFWTlhXbEJmWkU1U05sRRAB",
            "text": "Food was excellent and the staff was very nice and friendly would highly recommend\nThis place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWFowOXFlVWxNTVZOb09FTmhaRTFrUlVsVlowRRAB",
            "text": "INCREDIBLE EXPERIENCE This is our second time coming to the St. George Sakura and man we LOVE THIS PLACE!! We got the best of the best tonight with Zach and man he was so ON IT AND VERY REAL AND PERSONABLE!\n\nHe made sure we got the best and he checked on us and Grandma Bair, got on her level and talked with her for like 5-10 mins getting to know her story.\n\nWe also had Jeff which to a FABULOUS JOB cooking and making us laugh with unforgettable travel experiences as a family while he is throwing food and connecting with us.\n\nTHANK YOU SO MUCH"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FeVgzaExSREF6ZVV0R2MxazFSVU5GYmxOSFQzYxAB",
            "text": "Great food, even better atmosphere.  Huge restaurant"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsdFdYTjBjbTAyV0hoa1ZYVkdaMlJKY1dkMlRHYxAB",
            "text": "!!!!5!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRemEyeHFSVTlGUTAwdExWOVRhbU54VFdGc1kzYxAB",
            "text": "I could not have been more surprised by how amazing this restaurant was. The atmosphere, an entire room for hibachi, the service, the food - all incredible. Only regret is that we didnt do the hibachi due to the wait.\nThey were super accommodating to our 2 gluten allergies in the party. Oscar was an incredible server and double checked everything was gluten free. Was able to have sushi, rice dishes, and noodles they made from scratch despite being busy. We even had mochi and it was delicious.\nHighly recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210WlVVTndiSG95WkhSV05VaGZXRGx1TVdGbk5XYxAB",
            "text": "We ate at the sushi bar. Megan was our excellent server and the sushi was Delicious!!! Highlly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGNWQyZE1iVEF6U1ZsTU4xQm9XRTE1VmpGa01HYxAB",
            "text": "This place had excellent food. There's a bit of a wait for seating and food from 5pm on for Friday and Saturday. Put in reservations."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JeE5HMWtRVmhSYTNCSWFuSmFORU5CTmtFMGRGRRAB",
            "text": "Service with a fun and friendly atmosphere."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WVlUydEhZbUZSU3pWRWRsRjJTazgxYUROc1IzYxAB",
            "text": "Love the vibe here!  We like to go for sushi during off peak hours, early lunch, early dinner to beat the rush. Good food, pleasant service keeps us and everyone else coming back for more."
        },
        {
            "date": "5달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJYk85X0tTcnVyMWdRRRAB",
            "text": "👍🏻꼭 한번 들리세요\nRecommend reservation\nLove this place"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVX19xX01REAE",
            "text": "브라이스캐년 방문길에 항상 드러서 식사합니다."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KcWRVWTBhRzVSVkZSQlJWWnBPVGt6TjBwM1dXYxAB",
            "text": "The cleanliness is noticeable, something you don't always encounter in Hibachi Grill restaurants. The food was delicious, prepared professionally on the grill with just enough theatrics by the chef to keep things interesting. The meat was tender, and the vegetables looked and tasted fresh. The prices have gone up but still reasonable for the portion and the experience."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvX0pPc1RnEAE",
            "text": "I love hibachi! First time here and they did not disappoint. Elegant entrance with the Japanese Cherry Blossom trees. Active floor at the entrance will captivate children. Large menu offers a variety of dishes. Loved the soup and salad. The teriyaki chicken is quite tasty. I asked for a side of white sauce as I don't care for Dijon or horseradish."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKQ09yLWFxbjRfTUpBEAE",
            "text": "Wow! Where do I begin. The hosts at the front were so friendly and prompt. Our server was very attentive and made sure everything was right in its place. The chef was a master at his craft and made my filet and salmon to perfection. The atmosphere is so comforting."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWdE4yUlRRV0V6YjBaR09FeHNSREJwY21jdFFrRRAB",
            "text": "Outstanding service! Great atmosphere. The food at the sushi bar was excellent. Look forward to trying other menu items."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21neFJIcDBiV3N4WmpCQmQzUlVTV3AxU1hCTU5GRRAB",
            "text": "Really great restaurant. The new building accommodates tons of people. The service was on point and the chefs were great as always.\n\nI do think they could benefit from some competition, because their portions and food has gotten a little blander over the years. But, it is still great food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJX0lUaWF3EAE",
            "text": "Always make a point to stop and have sushi here whenever in town. The quality of the rolls and fish has always been excellent. Never had a bad experience, and we eat at good sushi places regularly whenever we travel. Worth the wait if necessary to eat sushi or hibachi."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZbEpmMWtBRRAB",
            "text": "Such an amazing experience! The food was 10/10! We did both sushi and hibachi grill and it was great! Their sushi is quite fresh and our group really enjoyed their Sashimi! Very fun place to get dressed up and go out for a date night or group date!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMnF1YUdBEAE",
            "text": "Great chefs. Entertaining and cook well. Almost perfect food. Hard working waitress and cleaners at the end.  The only minus one star was the rude blonde hostess.   When she said we still had to wait for our reservation I responded, \"That is cool.  Is there a bar where we can grab a drink and wait?\".  She rudely said, \"NO. It's full\".  The other hostess in green was nice.  I also thought her kimono with tennis shoes showing was pretty funny and unprofessional for the overall good look the place was going for."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvc2JmSUJnEAE",
            "text": "Billie is a king. Came here for a bachelorette dinner, and gave us a free cheesecake! We had a group of 8 and they got us in in 45 minutes on a Friday night. Great food. Great service. Definitely recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWU1tWjFRems1YUZObWJWTkpkM1IwTldSRVJtYxAB",
            "text": "Great food. Great place to eat.\nWainting before service because of popular place.\nService was a little bit messed up.\nBut they all resolved it very Friendly with a huge discount on the Bill"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPbWV1cC1sdjVEZmFnEAE",
            "text": "Everything was great! The food was amazing and definitely worth the price. Same for the service. Our waiters we're both really funny and made us feel more than welcomed. I got the teriyaki chicken with white rice. There was some extra fried rice, so our waiter gave it to me for free! And the mochis were amazing. I'm not a huge mochi fan, but we got the mango mochis and I couldn't stop eating them."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4S05HWXdhMHhtTmxoR1JqRkZWalpzWnpZM2JWRRAB",
            "text": "Delicious food and great portions. Staff is super friendly and you get your soup, salad and sushi super quick after ordering and before you can finish those your Hibachi chef is already there throwing shrimp at your face.\n\nSushi was great. Soup was great. Salad was great. Hibachi steak was some of the best steak I've ever had. And we had leftovers for lunch the next day 👌👌👌\n\nOnly complaint was our server (not our chef) was hard to hear. Perfectly understandable when I could hear him, just a quiet speaker and that took away from the experience just a tad.\n\nDefinitely going back though. 😋🔥🔥"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3aU16QUpBEAE",
            "text": "4 stars because we didn’t experience the steakhouse side but definitely want to come. Just shocked we never noticed it until the last time we went because it’s right by the highway & you can’t miss it . Great atmosphere & I love that the receptionist are in the traditional outfit 🤩…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiXzhxanlBRRAB",
            "text": "Great service from the start! Waited like maybe 30 min tops, but so worth the wait and money well spent.\nOur Waitress \"V\" was attentive to our needs, great talking stories with her and overall just love her customer service!\nRecommend to everyone!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqMmJYN253RRAB",
            "text": "Quick visit to St George and we decided to eat at a more upscale restaurant for dinner. We tried to gauge the wait time through their automated service and it started there was not a wait time at 4:45pm. However, when we arrived there was a considerable wait time for the hibachi grill and a shorter wait for the dine in. We opted for the dine in. Menu was expansive and included meals from the hibachi which is what we ordered. The food arrived timely. Staff was very pleasant. Taste and quality we're great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuMGNpSlNnEAE",
            "text": "It's offers a mixed experience, starting with a frustrating wait for a tablet—typically around 25 to 40 minutes. This can be a real hassle, especially if you're eager to dive into the menu. However, once you do get your hands on that tablet, the sushi shines as the highlight of the meal. Fresh, flavorful, and beautifully presented, it’s clear that the chefs take pride in their craft. If you're patient enough to endure the initial wait, you'll be rewarded with some of the best sushi in the area. Overall, while the service could use some improvement, the quality of the food makes it worth a visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqM2JXVFFREAE",
            "text": "Absolutely amazing experience from beginning to end. Eric (server) was totally amazing. The food was so, so good with amazing presentation! We (4 of us) ordered salmon curry (AMAZING!), vegetarian noodles, Zion and Yum Yum sushi rolls, potstickers and hibachi chicken.....all amazing! The little robot server was a surprise but so fun!!! The cost was expected for the most amazing food. They had a drink menu and a kids menu. Highly suggest getting on the list when you can! This will be a fave destination every time we are in St. George!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyczZpTkpnEAE",
            "text": "One of the best dine-in restaurants here in Southern Utah! Employees are all kind and respectful, food is delicious, and the atmosphere is admirable. Our server Cindy was excellent 😊👌🏾 They also have this new cool cute cat robot device that brings the food to your table! & will bring you a special dessert and sing happy birthday to you! (if it's your b-day ofc)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbS1xclp3EAE",
            "text": "Saw this place as I exited the freeway.  A few hours later came back to eat. Beautiful light up trees. Amazing entrance. There’s a screen that reacts as you step on it.  So check in and they take your number so they can text you when table is ready and do a follow up text to see if you’re coming or cancel the table.  Hostess was helpful getting us situated since we took up the whole side of the grill and spilled into the area of the other grill.  Our chef came out. Verified orders. Asked how we wanted our meat cooked. And went ahead interacting with us all.  Food was great. The show was great. Walked out of there stuffed. Being such a large group they automatically added 18% gratuity to our bill.  Would definitely return."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxNGRIYzVObGhFU0ZCTlRqSkxha2gzZW5WTU5sRRAB",
            "text": "I come here every time I come to St.George and it is always perfect!\nTonight all the hostesses were so busy yet so attentive and kind. My server was incredible. Her name was Lexi! She went above and beyond. The chef was a delight. The food was perfect with a lot to take home. Great value also! I will be back next time I am here."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSE5YcHdiRWhaTkVWVlpHSjBiWE40UW5sMGJFRRAB",
            "text": "Clearly I had a different experience than others that ate at this restaurant.  Maybe I just went on a bad night.\n\nThe cherry blossom trees on the way in suggested that a lot of thought had been put into this place.  It made me think I could look forward to a nice, quiet dinner.\n\nBut upon entering the waiting area, there's an interactive floor (when you step on it, it mimics breaking glass and explosions) so there were 3 to 5 kids jumping and stomping on it as hard as they could.  As we waited for a table, it was just loud.\n\nWe followed the seating hostess to our table.  She was wearing traditional Japanese dress and again I thought this was going to be a great place to dine.  But while sitting at the table, a waiter robot thing continually came out singing happy birthday to people at other tables.  After the birthday song, it would loudly play other music.  We couldn't converse until it had finished.\n\nThe food came (I got the Pad Thai) and it was... edible.  Not a ton of flavor.  I ordered it with medium spice and I could taste the spice, but not much else.  Not because the spice was overpowering.  It was just sort of boring.  My wife gave me some of her shrimp. This time the flavor was there, but I said, \"it's kind of overcooked\".  She said, \"yeah, it is, but it's always overcooked at Hibachi places\".\n\nThe waiter came and did the usual \"how is everything tasting\" and said, \"it's ok\".  He said, \"great, great\" and hurried on about his other duties.  I'm not sure he really heard me.\n\nUnless you're looking for mediocre Japanese cuisine in a Chuck E Cheese atmosphere, I'd go somewhere else."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbEstWU9REAE",
            "text": "SUCH a fun place, with delicious food. We did the giant couples boat and loved it. The sashimi was in really nice thick slices, too. We finished off with the mango sticky rice, which was also amazing.\nI will definitely go back next time I'm in St. George!"
        }
    ],
    "reviews_count": 64
}