{
    "name": "Aubergine Kitchen",
    "place_id": "ChIJMes_onBbyoARjbIfv5UgJQs",
    "grid": "SI1",
    "address": "613 S Mall Dr Suite G3, St. George, UT 84790, USA",
    "rating": 4.6,
    "user_ratings_total": 792,
    "phone_number": "(435) 414-9851",
    "reviews": [
        {
            "date": "16시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xd1N5MVNTR3h5YTJoWFMxWXpabVpQWWpSRmFsRRAB",
            "text": "The food is some of the best I've ever had. I'm actually hooked on their chicken caprese sandwich. It's great quality, a little on the expensive side but it does make sense why. You will want to go back again!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOalYxUTNZVlptTVZkV1F6RktVbkZDYldWMWJrRRAB",
            "text": "Delicious, fresh and healthy food."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMldHWjBTSEYxYUhwbFVuVlhXbUo0VlhsdFUwRRAB",
            "text": "All the food was amazing. I had the Mediterranean protein plate. Very filling and so delicious. I want to try everything on the menu."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KbFgyWnFNMWRTYW5GMlQyTTVXRGRYYjAwMVoyYxAB",
            "text": "Flavorful, fresh, nutritious menu items. I eat at Aubergine every chance I get"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOXEyT2hnRRAB",
            "text": "Great food. Service is quick. Clean. Nice atmosphere."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWZmJYVlZaREYwYW01T1kyeHBXbDlKY0ZGWU5HYxAB",
            "text": "Great salads with many vegan options!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JNU9HcHdUVVE0VjJzMFdEbEtSWEF4YW5OQmRtYxAB",
            "text": "So yummy and hyper allergy aware!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOb2VWVlZNamxGWmpCVVNqQkVNRmhsV1V0Q1RFRRAB",
            "text": "Soooo good it’s the only place I ate at twice during my trip here! Clean food, great service!"
        },
        {
            "date": "3주 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Od2N6SXdkR2xQVm1aVmEwRkhaWGh6YWs4eFkzYxAB",
            "text": "Es war sehr lecker, frisch und vor allem mit Allergenen gekennzeichnet! Tolle Auswahl an Speisen, freundliches Personal und schöne Atmosphäre. Kann ich sehr empfehlen."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoM2RsRktPVkpGUzBRMVl6QjBNMnRZYjBacVdtYxAB",
            "text": "Superb quality and utterly delicious healthy food.  We went back twice in the 24 hours we were in St George and found ourselves. Wishing we had this place back in California!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuX0lUMTlnRRAB",
            "text": "Excellent healthy choice of quality food!\nA remarkable choice for good healthy food in the Saint George area. Excellent management and staff!\n10/2/25 This place has fantastic customer service and excellent food. The staff is first class and I highly recommend this place for a great healthy meal!"
        },
        {
            "date": "1달 전",
            "language": "iw",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNmFsUjVkemhOVkVwM1RWaHZhMnBhU2t0bFUyYxAB",
            "text": "יופי של מקום לעצור בריא וטעים אפילו חומוס טוב"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdVRpMXlla2xUVkRrME1sTlVOM1pyVEdSbE1XYxAB",
            "text": "I ordered the curry bowl and it’s was so good, low salt for me but good and delicious. The place is good options for ones who like healthy and delicious food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWd1RFWldXRGxqZVRCek1ESjBMVzAzVXpWbE1VRRAB",
            "text": "Food very good. Orders were correct, and we got a bunch of different orders. Disappointing that they were out of chicken at 6pm on a Thursday night. Don't see how that should happen."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xveE4wWjBNemRwU1hWaVJVVTRkamR2VHkxU1ZHYxAB",
            "text": "Great healthy option was delicious!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201dFJuRnJSMjg0ZEhjemVrWkNiVTF5YlRReVlXYxAB",
            "text": "Vegan options were decent"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5WU9GaFpPRmx4T1ZkTldsZEVabGx3VW1nNFVuYxAB",
            "text": "I ate here a handful of times last week while in St. George for work as it adheres to my dietary restrictions, and this location did not disappoint. The staff is very friendly and helpful and willing to make accommodations. The dining area is clean and there’s plenty of tables."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rMmQycEtObkZtYkdScVdGcEpVV3hTYlhNMlExRRAB",
            "text": "This location is the best! The food is absolutely delicious and I feel so good after eating such a healthy meal. I got the very berry salad and some lemonade."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLN0docWp1NTVXc29nRRAB",
            "text": "I’ve been here twice, each time the food was fantastic! My two kids loved the food as well. My only gripe is the tip request on the computer when paying. I’m not against tipping, but you’re not exactly served here. Great food though!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aMmQxOW5UR3h0VG5Gd2JFaFRTMEUwTVVvelpHYxAB",
            "text": "We ate here several times on a recent trip. The food was delicious and we felt great after eating unlike most restaurants we eat at while traveling. There is so much variety that it was hard to choose what to order. It is a little more expensive than other “order at the counter” places but worth it for the healthy quality ingredients and still less expensive than a “sit down” restaurant. The staff was very friendly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCalpYWjBabFJWVTJjMmNXY3hhbFZDY1VGaGRuYxAB",
            "text": "Gluten free heaven!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdVdHNDRVa2hQTTJaT05qUnBUbGhWUms5clZsRRAB",
            "text": "First timer here. Got the Thai bowl, delicious!!! Also got the sweet potatoe bites, also very very good!! And I tried the immune boost smoothie....highly recommend. Love the healthiness of the food and will definitely be going back for seconds and more!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wUVRHOUpXa1p5UmtoclVITkZZbTExTm14UmNrRRAB",
            "text": "I’ve been an Aubergine’s customer for years. I love them. But the location here in St. George is seriously struggling lately with consistency. My last four delivery orders have been wrong or missing items. In addition, certain dishes, or bowls that are not supposed to be spicy at all are absolutely spicy as if someone doesn’t know the recipe and is dumping just straight up pepper all over it. With how many problems and issues of inconsistency that have occurred over the last six months with them I am probably done going to this location entirely. It’s unfortunate. Or management please train your team better."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25STWNGZDRTVU5HTkRFdFdGOU5XbGxhZUVNNVZGRRAB",
            "text": "My absolute favorite restaurant! I love having a go-to spot where I can completely trust the ingredients and know the food will not only taste amazing but also make my body feel great."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWdmFraFVibE5OT0dNMFRVWlBPWFZRWnpObFFuYxAB",
            "text": "Great food, staff and price!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWmFVeG5SazVhZEdsaE1GQTBRM3B2ZVZKVlNIYxAB",
            "text": "Great food and healthy! From a food snob I stand by my word… gotta try them!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMGFuQnlUa1pGUzFGd1JGOVJSa3R1VTNGSk9GRRAB",
            "text": "Delicious and healthy spot for breakfast. Loved the avocado egg bowl."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkRWJHWkVNVFpNTlRaT1gzbzBWRUZ4U2t0UVJHYxAB",
            "text": "Unbelievable. What a great experience after the temple. Healthy food feeling food!!! Will come here every week now"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdmJYcExOVGMwZW1kbE5reFJTMkZKYkRSNmFGRRAB",
            "text": "Absolute favorite place to go to in southern utah"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOMU5IVjRhbXgxWTJvek1sRXdka3ByYzFoWWNVRRAB",
            "text": "Aubergines is one of my favorite places to go. Every food choice has been delicious, clean and totally worth its value in price. Come check out this yummy piece of food heaven"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MlJtMW1MV3hoWjB3M1kyUTFWbmRQUzBoc1FsRRAB",
            "text": "One of my favorite places in St. George!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSbFpEZGZaa0p4UlZwaWMyTnNTbkJEVjBOaE5YYxAB",
            "text": "I love aubergine kitchen! The food is always amazing and it’s such a good place to go when you have dietary restrictions like gluten and dairy free. They have lots of different options to choose from and you really can’t go wrong with any! My personal favorite is the Mediterranean bowl! If you haven’t been you definitely need to try it out!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tac01HRlNaRVpmVmtZeFZEa3dNekZOYUU5V1VGRRAB",
            "text": "Absolutely love everything about Aubergine! It is so refreshing eating whole, healthy foods. Everything I’ve had there is incredibly delicious -  with my favorites being the Rio Bowl and the Mango Salmon Bowl. The staff are all kind and friendly. The order ahead is super easy to do online and pick up at the drive thru in St George is always a breeze. We also love dining inside. It’s a clean, well lit, happy environment. Thank you Aubergines, you’re one of our most favorite places to eat!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WYWVUaHRabXh5Y25OQ1prRkJWV001VUdGTE5VRRAB",
            "text": "Great tasting dairy free and gluten free food options. The Mediterranean bowl is the best!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205WU1XNDJaV3BrU0daQmJqVlJhbWhmUVU1T1VGRRAB",
            "text": "Delicious, fresh, fast, and laid back beautiful restaurant!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214eWJXbzFTVkpyYTFaWE1rRklhV2QzWmpOc2JtYxAB",
            "text": "First time here. Kind of a weird set up where you pass the ingredients and thinking they're going to make your dish in front of you like cafe rio or blaze pizza or Chipotle. But you just pass the ingredients and go to cashier to order.\nI downloaded the app bc I saw a sign for rewards. Employees were neither welcoming nor helpful. They just existed.\nI ordered the wild salmon bowl. Very good. The flavors were perfectly blended together.  Nice addition of a Brazilian cheesy bread. Also ordered the Mediterranean bowl. The falafel was cold. I've always had it hot/warm so it was unexpected. It was just ok, in my book.\nThe drinks were self serve. I didn't really like any of the drinks. Tasted like kombucha without the fermentation.\nOverall, I'd come back again to try the acai bowls and smoothies."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwZmQwUkRWVFI0Y1haMlRHMTFObEZoWTIxd1gzYxAB",
            "text": "So delicious and healthy! Always feel great after eating here, I love the ingredients."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWTFJXTXpkV0pIUWpScFJEQndTbU0zZEROa1ZrRRAB",
            "text": "Great smoothies! Love the cheese bread bites. Always feel good after a meal here"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200d2RtMXlYMHRDY21sTVQxWm5NalZoTXpGRU9GRRAB",
            "text": "Yummmmm I’m mostly Paleo and this place checks a LOT of boxes! Love that they are so affordable and allergen etc friendly! And have so many options!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FNWIweEliR2xCWVhObldXSjFXVmxKV1RSUVJHYxAB",
            "text": "I’ve been to two other Aubree kitchens both located in Northern Utah and this location in St. George is by far the best one I’ve been to. At the other locations, staff were unfriendly and worked slow slowly. However, at the St. George location, they were very friendly, accommodating, and worked rather quickly."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ZzhtdmVREAE",
            "text": "Aubergine Kitchen is a health-focused restaurant chain in Utah, known for its fresh, nutritious meals, including salads, bowls, sandwiches, and smoothies. Customers appreciate the flavorful food, large portions, and variety of dietary options, including vegan and gluten-free choices. The restaurant avoids added sugars, frying, and soda. While generally well-reviewed, some diners have noted concerns about the use of single-use plastics for in-house dining. Overall, it’s a popular choice for health-conscious eaters."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3N2ZHRVpREAE",
            "text": "My wife and I ate here for the very first time yesterday.  The atmosphere, food, and service were all excellent.  There is a wide range of healthy foods to choose from.  The food is very fresh and full of flavor.  My wife got the Coconut Curry Bowl and I got the Tri Tip Salad.  I also got the Super Protein Berry smoothie.  We were both really satisfied with our choices.\n\nThe only odd part was when you come in, you go down a chute similar to Qdoba and we didn't see any menus.  It wasn't until we got closer to the cash register that we got menus and chose our meals.  Chalk that up to us being newbies here. :)\n\nI highly recommend Aubergine Kitched for lunch or dinner."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNXRqTFZREAE",
            "text": "So disappointed!! The food is unique and tasty enough that we've  been here more than 10 times. Sadly, more than half of those times are accompanied with painful wait times, missing items, and poor communication from staff. Tonight I waited in the drive through for 25 minutes to get my food (with no acknowledgement of the wait from the staff) - which the drive through is for pickup only on advance orders that are supposed to already be done. Then when I looked in the bowl the amount of food was honestly pitiful!! The bowls are much more shallow than they used to be and it was about half the normal amount!! Will not be coming again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5M1pVTjVkV1p1V1VaeU0xQnRZbEpDZUhaQlgxRRAB",
            "text": "Jael had great recommendations and was so sweet. The food was delicious, and the bowls were large. Drinks are delightful. Don't hesitate to give it a try.. Thank you!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdW92Q3VRRRAB",
            "text": "The wait time can be a bit long, but their acai bowls are totally worth it! They put toasted coconut and pumpkin seeds in their granola, and they also offer a gluten-free granola option. The size seems a bit bigger compared to Tropical Cafe or Ever Bowl, but the price is about $4more expensive. 😋"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOVEFuX2phaHFQbEZnEAE",
            "text": "The food is absolutely phenomenal. I started with the chicken caprese melt. Yum 😋🤤 and am ending with the new menu item, a peach shake. It doesn't look like peach lol but sure tastes like it! Just the right amount of sweet and freshness of a ripe peach. Feels very organic. And no added cane sugar! Rather,  Monk fruit. The employees were able to answer all my questions and seem educated on their menu items which is very appreciated. Oh and I almost forgot to mention their raw kombucha cans. Also superb. Give this place a try if you're looking to find some healthy and nourishing fast food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJN3M0UC15cEpyUE9BEAE",
            "text": "The best healthy food in town. People are nice, haven’t found anything I didn’t love.\n\nHighly recommend the thai coconut curry. For a white dude born and raised in Utah… it’s just enough flavor to be interesting."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyNF9hc2d3RRAB",
            "text": "Updated Current Review: I made the first review when they first opened and I couldn't recommend them highly enough BUT It's been a while since we've been here and I was so surprised and disappointed today. We spent $50+ on two salads and 4 rolls. We had to go back in to get 2 of the 4 rolls because they were missing from our order. My salad did not come with dressing like it was supposed to. The lemon even has a sticker on it still which makes me think it wasn't washed obviously before it was put in my salad. The salad was also almost all cabbage even after I picked a whole pile out. The menu screens were not working so we had to rush to order from a paper menu at the counter which didn't have the nutritional information on it. The restaurant was also so very dirty. We picked a place to stand next to a table while we waited for our Togo order because all of the tables we could see were dirty. It was really surprising and disappointing. Based on our earlier experiences, this feels like a plummet into disaster.\n\nSo yummy. Highly recommend. The cheese bread is to die for."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMGREbEhkVzVEY2pCSlVHbE9XV1JvUkdweVZHYxAB",
            "text": "This place is absolutely amazing. I wish I would have come sooner. The portions are amazing!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQbmVwT0haNE1TUFhBEAE",
            "text": "I’ve only been to Aubergine Kitchen a couple times, but I already can’t get enough. I literally drive all the way from Mesquite just to eat here — it’s that good. Everything is completely natural and organic, and you can genuinely taste the quality in every bite. The food is absolutely amazing, the prices are super reasonable (especially for how clean and healthy it is), and the service? Incredible. The employees are always so kind and welcoming. It’s rare to find a place where everything — food, service, atmosphere — is this consistently excellent. Can’t wait to come back! The Coconut Chicken Curry is my favorite, iconic. I’m also allergic to gluten and never got sick from here"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMWJuU01nEAE",
            "text": "I loved Aubergine Kitchen!  There were tons of healthy options and the sauces were delicious!\n\nThere were tons of gluten free options, as well as vegan and dairy free options.  I like my meat though and the chicken was delicious.\n\nThey're sweet potato bites were amazing and I love the gluten free rolls.\n\nI love the cilantro jalapeno dressing!  I don't normally like spicy things (I'm sure it's probably pretty mild but still spicy for me), but I live this dressing so much!  Lately I just create my own bowl with wild rice, kale, chicken, sweet potatoes, feta and the dressing, it's Delicious!\n\nAlso I loved the clean look and feel if the dinning area and the bathroom was beautiful 😍😂"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROc2U2ZTdRRRAB",
            "text": "This was my first time eating here and it was an absolute pleasure! The place was very clean and tidy with all the beautiful colors of fruits and veggies seen in their clear refrigerators. The staff was friendly and the food was AMAZING!! I had the Greek Salad with Baked Falafel and it was enough for 2 meals in that one bowl! It was not only extremely delicious but beautiful to the eyes with all the many colors and textures of the freshest ingredients. My daughter ordered the Wild Fish Bowl with Salmon and she was equally pleased! We also tried the Baked Sweet Potatoes and they were fantastic! With all the different choices on the menu, we are definitely going to be going again and again!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzLTg2b3BBRRAB",
            "text": "I had the Mushroom Avacado Toast. It looked too healthy to be tasty but it was delicious. The husband had the Egg Avocado Bowl and said it was good. I ordered a peanut butter bomb smoothie, but didn’t taste any peanut butter. It tasted like cinnamon tbh. Didn’t love it. Service was ok."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOWFZwNnZLNzlXNnhnRRAB",
            "text": "My family and I enjoyed our meal at Aubergine! We loved the sweet potato bites and sauce was so good. All the dishes we got were excellently seasoned and spiced with nice flavors. I tried the peanut tofu bowl, my husband got the Mediterranean, father in law tried the aubergine melt, my mother in law enjoyed the curry, my brother in law had the steak plate. We enjoyed everything ☺️\nMatias and staff were very kind and we will definitely be back, thank you! No photos because we are everything before the post, sorry 🤭"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtajViNUVREAE",
            "text": "The location is clean & staff kind. Because it is incredible! It’s the freshest most delicious quick service meal in town! I love that everything is served with Brazilian cheese bread, which is naturally gluten-free, and that almost everything on the menu is or can be made gluten-free, and even dairy free. We had one of their strawberry nice shakes and it was delicious. We also had, chicken Parm, little nuggets and a Mediterranean bowl. We will be going back again and again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcU5PeGp3RRAB",
            "text": "I found this place by accident and I'm so glad I did. The dishes weren't just nutritious, they tasted wonderful and looked beautiful. The staff was very friendly and answered all of our questions. The cucumber mint lemonade was my favorite"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLbVYtS3ZjbW9lNkNREAE",
            "text": "I LOVE aubergine. It’s healthy and sooo delicious! Most places hurt my tummy but not this place. It’s my favorite place\nI always get a cocoa nice cream shake (so good)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUOFBqZ2JREAE",
            "text": "I absolutely love this place!! I have genuinely enjoyed everything I have tried here. This is my daughter and I’d go to lunch spot. We even secretly go here for dinner and leave the boys home. We like to share the Harvest Bowl and Açaí Bowl. But the tritip bowl is good too. Salads are yummy. Breakfast is great also. I love the avocado toast with a balsamic drizzle. If you have not tried this, it is a must! I tell my friends in Las Vegas they need to drive to St George to try this or open a location there."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2b043NWJnEAE",
            "text": "This place is excellent and incredibly diverse. I tried the wild salmon salad, and it was fantastic. My friend had a vegan dessert, and she loved it. We really needed a restaurant with such variety in St. George, and we would definitely go back again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GQ1UzUmFPRmRVWDFFeWJGSkZWVWwwVkhaU2RWRRAB",
            "text": "First time coming here and the food was so clean and fresh. Very  relaxing environment as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKMnYtbnRnRRAB",
            "text": "I’ve been here a handful of times and I think the food is amazing.  It’s fresh and I’ve enjoyed everything I’ve ordered including the cheese bread.  The restaurant is very clean and the vibe is cute.  The only reason I gave it 4 stars was due to the Service.  Our food was brought out to each person individually instead of all together.  I also feel for the price you pay here (which again, the food is great) the staff could be friendlier.  Parking can be a bit of a challenge, this location if this restaurant doesn’t have a lot of parking options close with the other local businesses and getting out of this shopping complex can take some time."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQaUluTlRQal82Y0NnEAE",
            "text": "Great food: clean, bold, imaginative. There were a couple of flavor pairings I never would have imagined could exist. The sweet potato bites were phenomenal. The whole family went nuts over them, so we ordered a second plate. For myself I got the steak plate (tri tip), but we only chose the place because they had vegan options for two other family members. Everyone was happy, especially mom, who is extremely difficult to impress. So we're coming back again tomorrow night. A guy named Matias (Mateo?) hooked us up. Great service, great personality. The food could have been served a little warmer, but that did not take away from the flavor. Will find out tomorrow if that was a fluke not. It's super bright in there, which is cool if that's the atmosphere you're looking for. Very much a Tendergreen vibe. Pay and eat. Fast and consistent from what I can tell."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VQSFh2ZXVQMmFQQ3VnRRAB",
            "text": "Salmon was a bit over cooked. Servers weren’t able to answer our questions about ingredients, still learning. Food was flavorful. Pitas were very fresh. I love that it is a healthy alternative. I thought it was a bit pricey. I’ve tried the Salmon plate and Tri-tip melt. Over all, what I had, tasted good. I will be back for sure."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkaVEwTnRaRGhCVFVGSFRrMHlTRmhrTVdkMGQwRRAB",
            "text": "Mariano and Leandro were awesome. Chicken caprese keeps on doing what it’s supposed to, wonderfully. They made me laugh dude, I’m satisfied."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPekwwcUxMNFk3bTRnRRAB",
            "text": "I have been looking forward to going here as I am vegan and my husband is not.  Perfect combination of food choices for both of us. He got the chicken caprese melt and I had the Mediterranean bowl.  They were fantastic!! My bowl had such a great blend of flavors!! Can’t wait to go back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQUGNydlRJaU9mZ01BEAE",
            "text": "Was craving some healthy food yesterday and ended up at Aubergine Kitchen ordering the mango salmon bowl. Great food, tasted fresh and delicious!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWM09XRTVYMWd4TVZaUFJIbDRNSFptUzJsbWEzYxAB",
            "text": "So many delicious options here! I like a medium rare steak and black coffee (not severed at Aubergine) but this place really pulls together some delicious meals. Sandwiches and salads alike are packed with flavor. I have tried new things every time I visit and have yet to be disappointed!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ST01rcDZVelZMY1VrMlJXRm9hbFJSTTNKR1VrRRAB",
            "text": "Spent $50 today on lunch for a healthy meal. We got home after 40 minutes of driving and we had no sauce which was supposed to be included in my salmon bowl. and my bowl was completely dry- when I called management didn’t do anything for me… okay. We won’t be back.. too expensive to have crappy service and no sauce"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbWVmR0JnEAE",
            "text": "My husband and I are loyal customers of Aubergine Kitchen where we live. We go practically weekly to the Riverton restaurant, which we adore. Tonight was our first time at Aubergine in Saint George. Wow! We were impressed with the cleanliness and service here. The food is equally delicious but the restaurant looks nicer than the other stores we’ve been to and it’s super clean! We will definitely be back when we drive to Saint George again. I highly recommend this restaurant!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNmQwZFRNMEZ5U0hZMVRsTjRVbHAwVW1oU09IYxAB",
            "text": "Me encanta comer saludable, me encanta el lugar y las personas que hablan español :) son muy amables todos en general"
        }
    ],
    "reviews_count": 70
}