{
    "name": "Book Club Bistro",
    "place_id": "ChIJJba_m3dbyoARx2IEIdvO710",
    "grid": "SI1",
    "address": "26A, Next to Skechers, 250 Red Cliffs Dr, St. George, UT 84790, USA",
    "rating": 4.9,
    "user_ratings_total": 115,
    "phone_number": "(435) 288-3323",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkWmQxbENjREJVVEdOS1JIZEJXWE55TjFWemFWRRAB",
            "text": "Stumbled on this place and it was worth it! Love the atmosphere and the drinks and food were great. Definitely will be back."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMFlrOWFXRGhYZW1wTGFtdDVjbGRGWkRWNmNtYxAB",
            "text": "The Book Club Bistro is such a hidden little gem in St. George! From the moment you walk in, the moody, bookish atmosphere sets the perfect tone — cozy, inviting, and full of character. The food was absolutely delicious, beautifully presented, and full of flavor. The drink menu is creative and fun, with unique cocktails that perfectly match the bistro’s literary theme. It’s the kind of place you want to linger, chat, and try something new every time. Definitely one of my new favorite spots in town!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pad0xXNVdaMVp2T1doS1pHWTNNbTh0ZW14aVVrRRAB",
            "text": "I hate spending $ on places that I feel I could do a better job at home. No way could I do better! This place is amazing and we will be back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wME9YbHRZMGc1YmxkTWRIRlRjalpTYlVGd1UzYxAB",
            "text": "In a world of sameness, ordinary, food-service-frozen-to-cooked meals, this delightful quirky little saucy restaurant shines. From the greeting by the boutique clerk to the surprise entry and cavelike speakeasy environment, to the food to the servers and owners, there was nothing to be improved upon. The menu provided good options and everything was a delight for the taste buds. Craft cocktails were outstanding. Payton and Christine really knocked it out of the park! Brava! Signed - a restaurant snob. ;)"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwaFEzSm5TV2xrU21ReGExOXhUV05uTm1sak1uYxAB",
            "text": "Wow- what a cool spot in St G!!! The vibes were amazing, very small and intimate inside. The drinks were off the charts, and all of the food we ordered was unbelievable. Our server killed it even though she had a giant party of women she was taking care of, we never felt forgotten about. Make sure you get the deviled eggs- best I’ve ever had! We will be back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxalIyTXRUbnBCVEVZelVIWlBNWE5UWHkxRVFVRRAB",
            "text": "This place was awesome! The food and atmosphere was fun! We had a large group and the staff was attentive and gave wonderful recommendations. Our waiter Gabriel (aka bat boy) was awesome! He made it look easy and got our check split 13 ways without blinking an eye. He gave awesome recommendations and was kind and attentive to our table. Best service I have had in awhile! If you get Gabriel he is the best! 10 out of 10 experience"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkR1VrZG1Sa2M1VFRaM09YRnFkMVF0WlZBelRWRRAB",
            "text": "The first rule about Fight Club…\n\nI hesitate to write this review, because the best way to ruin the best kept secret in St. George is to gush about it in a public forum. However, I would be doing this wonderful establishment, and, indeed, the rest of St. George at this service if I didn’t share a little bit about my experiences.\n\nMy family and I have eaten here three times in as many weeks, with all of us getting something different every time. We have yet to come across a meal that we are dissatisfied with. The cozy atmosphere, darker interior color palette and prohibition-era music make this little speakeasy an absolute must visit. In my experience, best experience if you dine “family style”, so everyone gets a little taste.\n\nBy all means, do yourself a favor and make a reservation for dinner. Either tell Gabriel I said hi, or don’t tell them I told you about it. Honestly, I’m kind of torn over which way I want it to go."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsM1drNUlTVnByVVcxTVJuZHlXbmhQYVVFeGNWRRAB",
            "text": "✨Just go here already✨"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKd1pYUkZabFo1V1hGYVlrWXlWRUpPWjFVNVprRRAB",
            "text": "The food was amazing- best Alfredo I’ve ever had. Brisket sandwich was also delicious, as well as the crudo. The service was excellent- attentive, timely and friendly and passionate. The portion sizes are ridiculously small though. If the food wasn’t so delicious I would rate it lower. We got an appetizer and two main dishes and we’re both still so hungry we need to go get second dinner. We are average sized people, but do not go here if you’re actually hungry. It seems like it’s best for drinks and snacks. The sandwich was 1/2 a sandwich, and the Alfredo came with about 10 noodles, and two small meatballs for an extra $8 on top of the base price. They seem to be in this weird middle place of not a real entree size, but also overly priced for the portion to be tapas or share plate size where you would normally order several plates and share. They need to either up their portion sizes to normal sizes and bump up the price if they need to, or cut down the size even more as well as the price so it can be tapas type experience."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WWWQwRjFOR3BZYlVWQmMxbHdXSFJIYzBKcGNGRRAB",
            "text": "This is a magical place! The food is served in style and flavor. The drinks are amazing! Pictured is the Hibiscus mint mimosa and the deviled eggs appetizer! The chicken Kabobs are Yum! Bon Appetites!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ReldreDFaMDltZERaWmJHaDRlWFJzWlZGdGRsRRAB",
            "text": "My new favorite place in St. G BY FAR!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMFVFWTBSRlpxVnpWUlVUQmtkRnBuTUhwd2RrRRAB",
            "text": "Tucked behind a boutique and accessed through a sneaky bookshelf, this speakeasy is a hidden gem that delivers an unforgettable experience. The vibe is pure magic—dim lights, cozy yet classy, with a nod to old-school charm. The drinks? Absolute perfection. Each cocktail was crafted with care, bursting with flavor and creativity.\nThe menu is a total knockout. The flight of deviled eggs was a fun, delicious twist—each one a little masterpiece with bold, unique toppings. The crab cake? Hands-down one of the best I’ve ever had—crispy, flavorful, and packed with fresh crab. Every dish felt like it was made with love and precision.\nService was top-notch, with staff who knew the menu inside out and made us feel like VIPs. If you’re looking for a spot that’s equal parts cool, tasty, and memorable, this is it. Just don’t tell too many people—the secret’s too good to share"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGcFIyUlFhbVpqVVdOVFdFWTNlSFl3U0RKSk4yYxAB",
            "text": "An unexpected experience and delight. Great food, bevs, and atmosphere. Christie, Barbi, Gabriel and crew are engaging and make you feel at home."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oRGR6bENjamMwTFd4blMxZHBNMjR4TjFCamRsRRAB",
            "text": "What an excellent dining experience!  Gabriel was a superb server who spent time getting to know us while providing perfect service. The food was unique and was some of the best we’ve had. We would recommend the Book Club Bistro to anyone who wants a fun night out with excellent food and service!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKYVEwUmhZbTFIWDJsVFVWaFVaSFpRYlVSV1ZWRRAB",
            "text": "From the service to the food to the drinks everything was excellent it’s reservation only so make a reservation but you won’t be disappointed"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4NlRFeFVTR2s0WlhWNGNIbDVORlJEY1UxemJXYxAB",
            "text": "We had an amazing experience and the food and drinks were so good. Gabriel was the best server we have ever had! We will definitely be back when we come back to St George!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWFYyUnNhMWxKZFVGdFNIRmlTMVEwZEdGVlVFRRAB",
            "text": "Place is awesome go there for a good and awesome food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWFlsSkZUMlJMVkZGdlgzUndialE0ZGpGNlMxRRAB",
            "text": "So pleasantly surprised with this bistro! The food was some of the best flavors I’ve had in st george. On top of good food the service is incredible. Our server Gabriel was so kind and very knowledgeable about allergens. This is a great spot for gluten free !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFd1dHWlZUak5uYkZOcGVrb3laRzl0TlY5R05GRRAB",
            "text": "This was a pleasant surprise and a fun experience. Friendly staff and delicious food. A bit tricky to find....it's got that speakeasy vibe."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRVRreG1NRWRKVlRaRFUzWTBhVjgxV1VWalpWRRAB",
            "text": "The food was delicious and the atmosphere was fun! I would definitely come back again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201VU9HNUNiV1JUVldGS2JrRXdNVWxmVDNRMlZWRRAB",
            "text": "Wonderful food and wonderful atmosphere! Fun little secret restaurant"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SdFZHTXhUalJKYVhwNVZXVnZTV1ZHU0hsS2RGRRAB",
            "text": "The speakeasy vibe is so cool. Their service was friendly and attentive, food and drinks were delectable. Definitely will be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jeVJsUnhaV2hWUmxsdWNFNUVTbXB6Tms5VlFWRRAB",
            "text": "Best Bloody Mary in town. Props to the adorable bar tender. The vibes are immaculate. The food is delicious 🤤 I love it here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21STFQzcFhhWEIzYkdoaE1qQnVNVGxuY0hOMVNIYxAB",
            "text": "By far one of the coolest dining experiences I’ve ever had. I went with my daughter and we were both amazed at the mysteriousness of this hidden gem of a restaurant. It makes you feel like you’re in a secret club that you never knew you wanted to be in 💯 The food was absolutely incredible. The menu is simple, elegant, and familiar. However the chef really elevated each dish we tried! I will be back to try them all out. 10 out of 10."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUGRXaHFhSFpvY2tNM1VHTk5RbTg1ZVdRM1JtYxAB",
            "text": "What an amazing experience at The Book Club Bistro!! From the moment we walked in, the atmosphere felt both cozy and elegant, the perfect spot to relax and enjoy a meal. Our server, Gabriel, was fantastic, friendly, attentive, and really made our dining experience memorable.\n\nWe started with the meatballs and beet salad, both of which were bursting with flavor. The meatballs were perfectly seasoned and tender, and the beet salad had the perfect balance of earthy sweetness. For my main course, I had the brisket with smashed potatoes — absolutely incredible. The brisket was melt-in-your-mouth tender and packed with flavor, and went perfect with smashed potatoes. Every dish and drink was beautifully presented, and the portions were generous. Not only do they get creative with their drinks, they were so good!!\n\nHighly recommend The Book Club Bistro if you're looking for great food and a wonderful dining experience. Thank you Gabriel for making our first time experience unforgettable, we will definitely be back!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4eWNVOVlVa2xhWTA0eFNrMXRjSGcxWlVWSFltYxAB",
            "text": "Beautiful atmosphere, wonderful playful drinks and delicious food. Wether you’re a local to St. George or just stopping through add this place to your list! Our sever Gabriel was extremely knowledgeable and anticipated our every need without being asked. 10/10 recommend this place to anyone.\n\n- note, it is quite small so I would recommend making a reservation beforehand!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGc1lqaFhOWHBHUVV4aVNHdEJUVk5YYUdwVVlWRRAB",
            "text": "Great place.  Service was fantastic, food was Devine.  Awesome addition to St. George eateries!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210aVRIWjBSVGt6WjIxcVlscGhaMEpwTm1sSVQzYxAB",
            "text": "Literally the most beautiful place I have ever stepped foot in. Gabriel was the most amazing server, he went above and beyond. The food and service otherwise was awesome, dishes and drinks are so fun."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsUVNGUTBObXRLVWxKWlgyY3pXWHBhY1RWRFFYYxAB",
            "text": "This was hands down amazing, the food was super delious, the boutique has really cute feminine style clothing, jewelry and purses. The drinks however, stole the show, taste was phenomenal, presentation was stunning, definitely plan on having a few different ones. Kiely was our server, she was kind, knowledgeable, and quick."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoT01XbFRTRVYwU0hCamVXdENiRWhHT0hwd1RYYxAB",
            "text": "Looking for a speakeasy after a 3 day hike extravaganza at Bryce and you couldn’t imagine a better place. Book Club hit it out of the park. Every detail was thought out. Vibe was low key big city with low key jazz in the background. Drinks were the best on our trip.  Staff (Jaycie especially) was knowledgeable and made the night flow well. food presentation was creative and was the best food we have had at similar places hands down. If we lived here,  we would be back every week!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NM1NEZGFiVkl0Tkdwek9FaFJWRXAxU21GbGRtYxAB",
            "text": "Small. Get a reservation. Well worth the visit. Fun vibe, tasty food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdlVHZ3hlazh3YUc1d2FIRm1NMDVvY1VWRmJHYxAB",
            "text": "We were blown away by the boutique and bistro’s service. Not only do they have cute clothing, the food and beverages we had were amazing. We tried the pumpkin ale and the a plum vodka sour specialty they had there and we adored it. Barbie, one of hosts and the bartender, and our server were amazing! The food – a deviled eggs appetizer, and our two entrees, miso salmon and the beet salad – wow! We wish we lived in St. George so we could come back but we’re only visiting the Dixie area for vacation from Texas. Whenever we get back to this area, we will be sure to revisit."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MU1FSmpaVEkzUW1SWE9XdFZPRk0xTTBSNWRHYxAB",
            "text": "A+ all around. the second we walked in we were treated like celebrities with extreme attentiveness and genuine kindness. the place itself is a super-fun-secret-library-door-speakeasy behind a boutique, something you don’t stumble upon often. everything we got from the menu was just incredible. from hanging chicken to mystery novel desserts, expect the unexpected when you walk through their secret door. loved our time here!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGNU9YTkRRVmxMVjJWM1YzUnpNVXRpVUhocVkzYxAB",
            "text": "Incredible staff, wonderful food and delicious cocktails. Service was top notch and an amazing atmosphere. I will return to try the multitude of cocktails I didn't have a chance to try."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taNlJHSndlbWsxUkRSUmRtNVhZMEozZDJGcVVFRRAB",
            "text": "Absolutely amazing in all aspects! The atmosphere, the decor, the food, the service! 🔥💯🤩"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOUGFqUXdXWGxrYWt4SmRtWlRlbkkxVWt4aFZtYxAB",
            "text": "This is the coolest little “speak easy like” restaurant. The drinks are amazing and unique. Everyone is so friendly and the food and speak easy theme was amazing!!! Barbie was very entertaining as well if you’re lucky enough to sit at the bar."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xc1QwSmhibGx5V0RGRU0xZDRXRmhYWVhsR1ZFRRAB",
            "text": "We came here last week, I would say it's 3.5 stars overall. Great concept, but for the prices they're charging it was just ok.\nWe waited about 10-15 mins past our rez time to be seated. The first thing I noticed was that most of the menu cocktails are sweet. I requested the drink I ordered to be less sweet and it was still sweet. There were 3 of us, our cocktails came one-by-one spaced 10 minutes apart. We inquired about the last cocktail because food had started to be served before it arrived. The Martini and Old Fashioned were literally half of a normal-sized cocktail. If you're bound by the pouring laws, $17+ per drink is outrageous.\nThe food was good but on the pricey side. Bacon jam shows up on multiple dishes and is insanely sweet.  The deviled eggs were probably our favorite dish.\n$200+ before tip for 3 people, I was hoping this place would be better given the reviews and stories we heard.\nI'll try BCB again but IMO they need to balance the sweetness out (bring in some Amari?) and tighten up the service for the prices they're charging."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWVlVrUTJWVXh5Y1RaUE4yNHRhbVJ3TTJsbGJHYxAB",
            "text": "Honestly one of the best places to eat. Started with the meatballs. They were the best I’ve had. 10/10. For the mains we got the brisket sandwich and the salmon. Both were absolutely beautiful and could not fault it. Cocktails awesome too. Affordable and great atmosphere. Highly recommend this all the way from Australia."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BeFZFZDRMVFZQU0daRmFETkNjWFZVVTJkMGEyYxAB",
            "text": "A must visit-although it feels like a good secret that I hesitate to share! The decor and design is gorgeous. We found the cocktails and food to be delightful and very nice service. After dinner, we enjoyed the darling boutique with great clothing and jewelry at very accessible prices. This place and the whole set up is just too good to be true."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aemJIQnZibk51UTFGVFYyVjFXa1V3ZUZWZlJrRRAB",
            "text": "This was such a fun experience! The ambience, staff and food were all top notch. I would highly recommend visiting. The Tuna app was refreshing . The hibiscus mocktail was so delicious. I had the chicken kabobs over risotto 🤤 so good. My only complaint is that I didn’t go sooner! 100/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsMk9WQkJlRWRSWDNWYWMxZGZkVEZZUkdweVRIYxAB",
            "text": "We recently enjoyed a girls’ brunch at Book Club Bistro and absolutely loved it! The Marry Me Chicken Crepe and biscuits and gravy were both incredible, and the mocktails and cocktails hit the spot. The service was top-notch—friendly, attentive, and checked on us several times. The ambience was perfect too—cozy with great lighting. Can’t wait to come back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVd1EzaEJVR1ZmTTB0MGRtaGhiMmt5U2tNMk5IYxAB",
            "text": "Such a surprise to find this hidden gem. It’s a hidden small restaurant in the back of a girls clothing boutique. Only found it while looking up date night places to eat. Fun kind of dark atmosphere with old stylings making you feel like you are in an older era with music and a dark room with small lights on tables and wall sconces. Felt like great gatspy times. Food was absolutely delicious and portions were perfect! Not too much or too little food. We enjoyed the perfectly cooked and moist/flavorful meatballs with bacon jam, crab cakes with corn relish, and brisket loaded potatoes. Even the mystery dessert was delicious other than the hard to cut crust. Needed a knife to cut through the graham crust. Mocktails were delicious too."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaWE1XUnlYMVpQVGtGelZsVmhSSGRmUW05cVRsRRAB",
            "text": "such a wonderful surprise! we had a staff dinner here & just loved every second of it! from the decor to the food & drinks, it was perfection! did I mention there's an audio book playing in the bathroom? Bravo to them.  they thought of everything!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WTFgxWXlORjl0YVU1RGFuTTBlRVIyTUhreGNFRRAB",
            "text": "Book Club Bistro is an absolute gem! We came for dinner and were instantly impressed — the miso salmon was to die for, perfectly cooked and packed with flavor. I also tried the lychee cocktail, and wow… so unique, refreshing, and totally delicious. It’s the perfect place for a classy night out with friends — fun to dress up a little and get a bit boujee in the best way!\n\nThe Mystery Novel dessert was not only delicious but such a creative touch. We loved the whole experience so much that we came back the very next day for brunch — and we’re so glad we did. The crepes were incredible, and the Orange Julius Caesar? Hands down the best brunch cocktail I’ve had in a long time.\n\nThis place nails it on food, drinks, and atmosphere. Don't miss it — already planning our next visit!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bDdyWU93EAE",
            "text": "I am impressed! I really hope this spot sticks around for a long time because it is the most unique eateries in the area! The speakeasy theme is fantastic, the decor is on point, and it’s cozy and intimate. I ordered a couple different cocktails that were delicious that didn’t taste too watered down (thanks Utah), the beet salad which had a beautiful balance of flavors and textures, and the meatballs that had a bacon jam on top that was to die for!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPT2kyOERnNzRLN19nRRAB",
            "text": "OK. Cute little bistro! Hidden door in a boutique.\nNot busy, we just went for appetizers and drinks.\nAll the drinks were spot on and delicious. It was fun to 'assemble' my old fashioned and martini.\nHummus and meatballs were super yummy!!\nAnd Lex was an exceptional server. Personable and her recommendations were fantastic.\nI will definitely return when I'm back in town."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xemNtRnZXRUZqVFhGWFZtOVZVMjB0WWxsSWIzYxAB",
            "text": "OMG!  This place is beyond description of fun and delicious adventures!!!   Barbi is the very best server and drinkologist!!  Christi the owner is so wonderful!!!  The food is above and beyond your desire knew it wanted to be!  Don't miss out!   Make your reservations today!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZcHEySmRnEAE",
            "text": "Wow!! What an incredible experience, the food was absolutely delicious!! We had the meatballs, the deviled eggs, the beet salad, and the French dip - all were so good, but the meatballs were our favorite.\n\nWe loved the experience of the old fashioned and the hot honey Manhattan, so creative!\n\nIt was fun to meet the owner and our server Lex was great! We can't wait to come back, it's our new favorite restaurant in St. George ❤️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdGZqZUdnEAE",
            "text": "Hidden Gem Behind a Bookshelf!\n\nBook Club Bistro is hands down one of our new favorite spots in town. This speakeasy is tucked inside a boutique, and yes—actually hidden behind a bookshelf. The vibe is intimate, moody, and thoughtfully designed.\n\nWe’ve been a few times now and keep coming back for the incredible dinner and cocktails and the cozy atmosphere. We also came for Sunday brunch and loved the Savory Crepe and The Hash—everything is so flavorful and made with care.\n\nHuge shoutout to Payten behind the bar. She’s so welcoming, down to earth, and makes every drink feel and look like a little work of art. You can tell she knows what she’s doing.\n\nWhether it’s date night or drinks with friends, this place is a total win."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJemUzZkl3EAE",
            "text": "This is such a cool place to eat! The vibe, the food and service were all fantastic.  I had the Beet Salad and by husband had the Miso Salmon and they were both delicious.  I’ve been craving it ever since.   Our sever was so sweet and kind, I wish I had gotten her name so I could give her credit!  The owner was there and was so sweet and checked on us several times.  We loved the atmosphere, it’s beautiful and charming. We will definitely be back! If I could give more than 5 stars I would."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWV1JtY3dlRmxqU0Y5aVRUUmhkVVZRWjFCdFJVRRAB",
            "text": "Talk about a cute little find! We stumbled in here by accident, but I'd make a reservation if you want to be here. We luckily got a bar spot and had a cocktail and mocktail. Pear gin fizz and a passionfruit mule. The ambiance was stellar and love the speakeasy appeal."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJa3NPQXh3RRAB",
            "text": "What a spot!! We had the most wonderful night at Book Club Bistro. The cocktails - gorgeous. Food - amazing. Vibes - perfect. I have celiac and the menu was well-marked for gluten free options and I felt safe eating there. Special shoutout to GM Payten, who took great care of us. Can't wait to go back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLRFhrNEd6aXJuSkJBEAE",
            "text": "Book Club Bistro is a gem of a speak easy and restaurant hidden behind a bookshelf in The Social District boutique. The cocktails and sexy ambiance are only outdone by the expertly prepared dishes. What a find!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBa3VLUUlBEAE",
            "text": "INCREDIBLE EXPERIENCE!!!!! Its a speakeasy vibe behind a book shelf. The music is relaxing and perfect volume,  the vibe has a 1920s feel to it. We started with the bruschetta and then as the main meal got the salmon and crab cake dish.…"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTFJuUTNNVGhLYzJ4WVNEVlpUMGhOUjFCeFVrRRAB",
            "text": "Such a fun, unexpected place for dinner. We had the meatballs, and the cigar dessert. Crab cakes were excellent. Would recommend for a first date."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcHJQZHN3RRAB",
            "text": "This place is a hidden gem, literally behind a bookshelf in a boutique! What an amazing experience, the cocktails were unreal, and the meatballs would be my last meal request. Our server Lex was super great and it was fun meeting the owner Christy! Such a unique and creative restaurant. Can't wait to come back!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZOUpPN0dREAE",
            "text": "Book Club is a total gem. The atmosphere is cozy but elevated, the food is next level (seriously, every bite was incredible), and the staff is so friendly and on it. You can tell a lot of heart went into this place. Can’t wait to come back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRcF9DRy13RRAB",
            "text": "What an awesome place! A unique experience with a 1920s-1930s vibe. Perfect place for a date night. The food and drinks were amazing! On par with the quality of Wood Ash Rye with a much more intimate experience. Be sure to make a reservation!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JNU9WRnBVRjgwTldSQ01tSnphemRqVGs4NFlYYxAB",
            "text": "I recently visited Book Club Bistro and had an overall mixed experience. Even with a reservation, we waited about 20 minutes to be seated. The space is small and charming, so a reservation is a good idea, but they may need to rethink their pacing between seatings.\n\nThe staff was warm and welcoming, which helped set a positive tone. However, the bar experience was disappointing. Three people in our group ordered cocktails (lots of unique options) that seemed to lack any alcohol—perhaps a result of Utah's notoriously strict liquor laws. I usually stick with wine in situations like this, but the wine list was extremely limited and consisted of basic grocery store options, sold by the glass for more than you'd pay for the bottle.\n\nI ordered a vodka martini that arrived with a strange yellow tint. I was told it was a dirty martini, but it was extremely salty and unlike any dirty martini I’ve had before. A replacement dry martini was brought out, but it tasted watered down.\n\nThe food presentation was beautiful, and the menu had some unique and appealing options. My dish—salmon on a salad—was delicious, but the portion size was surprisingly small for the price. The salmon was maybe three ounces, which felt underwhelming.\n\nThere’s a lot of potential here: thoughtful food, great ambiance, and friendly staff. But with some improvements to service timing, drink quality, and portion sizes, Book Club Bistro could really elevate its experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjNVRFdzFiMngyYXpsMldXeHdVMDEzU1dNeFNHYxAB",
            "text": "After a few visits now, I can confidently say Book Club Bistro isn’t just a one-hit wonder — it’s consistently excellent across the board. From the drinks to the appetizers, mains, and dessert, you really can’t go wrong. Every single thing I’ve tried has been worth coming back for.\n\nThe variety of deviled eggs are way more exciting than they sound — full of flavor and super creative. The meatballs? I can’t even describe how good they are. The crab cakes are right up there too — crisp outside, packed with flavor, and perfectly balanced. The miso salmon is so good I could eat it every night and never get tired of it. But the real standout for me is the brisket French dip sandwich — easily my favorite thing on the menu, hands down.\n\nAnd if you’re into giggle juice, don’t skip the Old Fashioned. It comes hidden inside a book with a flask so you get to pour it yourself — a fun touch, and honestly, it’s delicious.\n\nBottom line… this place nails it. It’s a made to order, creative, fresh flavorful food with a thoughtful presentation. Book Club Bistro has officially earned a spot in my regular rotation."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toRWJHbHpNMGhhWmpoclkwRnJjM015UWtoSFdsRRAB",
            "text": "My wife and I have been here a few times now, and honestly, it hits the mark every single visit. Food's awesome. The pasta is delicious, filling and super tasty. Drinks are always on point (wife loves the mocktails), and the vibe inside is just cool and relaxed.\n\nService is exactly what you'd want, friendly and quick. It's the kind of place you can actually kick back and enjoy your meal.\n\nIf you're looking for a solid dinner spot with great food, chill atmosphere, and drinks your wife won’t stop talking about later, this place is it. Highly recommend."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBc3ZmeWdnRRAB",
            "text": "Such a cool spot! Love the speakeasy vibe. Stepping through the hidden bookshelf entrance feels like being let in on the best-kept secret in town. The atmosphere is cozy yet lively, perfect for a night out or a special date. Everything we tried was fantastic. Can’t wait to come back to try everything else on the menu!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psTGVra3hWRGx4UkVOV00wUlpSbk5ST1RoRlIxRRAB",
            "text": "Such a fun experience! The espresso martini is to die for! I love a unique dining experience, and this one was certainly top-notch! The little details like a magnifying glass with the menus and an audiobook playing in the restroom really add to the uniqueness. My husband loved the salmon dish and the crab cakes were delicious.\nWe can’t wait to come back and have brunch ."
        }
    ],
    "reviews_count": 63
}