{
    "name": "Painted Pony Restaurant",
    "place_id": "ChIJYbhFms9EyoARR6kx4a4528g",
    "grid": "SI1",
    "address": "2 W St George Blvd 22 Tower Building, St. George, UT 84770, USA",
    "rating": 4.6,
    "user_ratings_total": 1443,
    "phone_number": "(435) 634-1700",
    "reviews": [
        {
            "date": "수정일: 13시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveXBmTmVREAE",
            "text": "Tried to make a reservation. A month in advance. They are very snooty here. They wanted a deposit to reserve for a lunch. We will go somewhere else. They acted like we were bothering them . They do not treat you well. I will never Eat here."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoemJqaDFORUZ5Vld4elZEZHpjSFZoUjJaVFlrRRAB",
            "text": "It has been a long time since we went 10 years. Went the other day with some friends. The food a nd drinks were amazing alongbwith the service."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGQldYVk9jbVk1YzB0VGNXbFBWRlJYVW0xWE1uYxAB",
            "text": "Super nice atmosphere! Very calm and relaxing. I feel like they need a bigger menu. Super expensive"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWS1JXVlZjbW94YWtseVZXWjZhVUowTms1WGIzYxAB",
            "text": "Out of towners from Chicago looking for a good dinner spot. This place was really good. The French onion, bone in pork chop, salads and carrot soup were all fantastic"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMmQyVndWMGc0V0RaUlIzYzVOelJxYUVSSFJGRRAB",
            "text": "Atmosphere is nice and even the outdoor seating is good. We have been coming here for anniversaries and date nights every so often. Maybe 5+ times so far. Our first time was great and even the second time was nice. The food always looks good when presented. Most of the time it is pretty good. We have noticed the last few times that the seasoning is going downhill and even general flavors. We went again last Friday night. We sat outside and enjoyed the fresh air. We ordered crab cakes, french dip onion soups, ribeye, and venison. Expensive and plenty of food for 2. The server when he told us about the venison special said the price was $49. Then after I got my food we heard him telling a new table $65. I had ordered the venison instead of the other item I was thinking because of the $49 price tag and being cheaper. We asked our server Nate about the price and why he was saying two prices? Asked what it really was. Apparently it was $65. We weren’t happy about it considering I didn’t taste any salt or seasoning on the venison at all and that was my way and making our meal more affordable. I know it came with a berry sauce, but it needed finishing salt or something. You can’t serve steak without being seasoned at all. The sweet potato cake was stringy and weird textured. My husband’s was so so as well. Nate the server didn’t ask his manager or notify him of the mistake or make it up to us. So we made it up ourselves and took it out of his tip due to mishandling us then. Not good customer service when told a different price than the actual and no real apology or anything. We pay a lot to eat here and expect great fine dining food that is properly cooked and seasoned to go with the price tag. We just have been less wowed eat time. The season menu is fun, but hard to get a favorite when it keeps going away. We feel like going here less with how it seems to be going down more and more."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SVGNqZExNbEJXYUZWUVJGWlZUekp4TWtKR1NFRRAB",
            "text": "Had our team dinner here during Huntsman. Cyndy was knowledgeable, enthusiastic, and guided us through the chef's offerings. All nine of us were delighted with our choices. Highly recommend the stuffed dates, brie, beet salad, and the bison. Everything was outstanding!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFMlNUbHdTRkF0VEROclIwVnNhSGRHU204NE9GRRAB",
            "text": "One of the best restaurants in st George. Visited every year for 5 years. Had tenderloin steak with mashed potatoes and asparagus. Glass of cabaret from Napa. $86 with tip for one."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4elkyUXpNbTFZVXpJemRrUTBPR0ZzWVhWamFuYxAB",
            "text": "This was one of the most memorable dining experiences I’ve had, but for mixed reasons. The service was absolutely outstanding. The staff were friendly, attentive, and genuinely enjoyable to talk with. They made me feel completely welcome from start to finish though my reservation was for 815, I was sat at 830, even being 20 minutes early. The atmosphere was beautiful, setting high expectations for the meal.\n\nUnfortunately, the food fell far short of what the setting and service promised. The steak was perfectly cooked and incredibly tender, the gristle melted in my mouth, but it was also heavily oversalted to the point of being inedible. The mushrooms and sauce that accompanied it were just as over-seasoned, making the entire dish nearly impossible to enjoy. I love salt, but this was overwhelming. It was the first time in my life I’ve ever left a steak unfinished, as shown in my photo—I had to stop halfway.\n\nThe crème Brulé was supposed to be butterscotch but tasted closer to pumpkin. It had never set properly, soupy and grainy with curdled eggs, and the top was burnt black instead of a crisp golden brown.\n\nFor a meal totaling around $130 for one person, the lack of quality control was unacceptable. If I were the owner, I would have a serious talk with the head chef, as this meal showed no standard of consistency or care.\n\nThat said, I want to emphasize that the staff were phenomenal—some of the best service I’ve ever experienced. Their professionalism and kindness were the highlight of the evening.\n\nAlso the Weekend at Bernie's painting was low key awesome. well played on that."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CNmNqSlFZbWx2U2xCUWEwaEVNRzFKYm1zNFdWRRAB",
            "text": "Great service, excellent good atmosphere good!!! A little spendy for us not so rich class!! But worth it!?"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CbU5VcERSME00TlZObFN6ZHZTa2t3VlU1dmFtYxAB",
            "text": "Booked in july for our 30th wedding anniversary. Stayed in st George for an overnight stay. Restaurant knew about our celebration but did nothing to make us feel special, no flute of champagne or prosecco. Plonked us on a table behind a wall on our own. The restaurant was buzzy and vibing, except for the naughty corner we sat in!!! Complete lack of atmosphere and certainly didn't feel romantic or special in any way sadly. The place was busy so didn't want to make a fuss by asking to move. Food was what i could cook at home. My tenderloin was chewy and stringy inside. I asked for medium rare and it was definitely on the rare side. Left everything apart from the tasty outer. Asparagus was hard and woody. Should be peeled and snapped to get what is the edible part. Mash was minus the promised herbs, bland and not what I'd expect from whipped. The butter wasn't to my taste, too much rosemary in it. Hubby had the ribeye which he liked. He had to order carbs as an extra as his dish didn't come with it. Please either add a carb to all items or don't, it irks me when restaurants do this. my meal was dry and lacked a jus or some such, dessert was hit and miss. Loved the coconut key lime pie but the chocolate blackberry torte had little taste and was very sweet, and i have a sweet tooth!! All in all a really disappointing evening, we didnt want to linger either, just wanted to get out and back to our bed and breakfast. Spending hundreds of dollars on a meal is ok for a special occasion, but not when you can do better yourself.\nStaff friendly and attentive\nMemorable for all the wrong reasons"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taU1MzUjFVekpqZURWUmNHOUJNMVoxYjJSSU5IYxAB",
            "text": "Our last dining experience for our trip discovering southern Utah. We ordered peppers with pork belly, carrot jalapeno soup, pear, mussels in curry, halibut cheek with arancini, deep fried rice ball and duck confit. We liked the peppers but not the pork belly, seemed more like salty thick bacon. The duck was a bit dry, as well as the halibut. Mussels with curry sauce was nice as well as the pear. Plating was pretty. Service initially was good and efficient until it got busy in the evening. We did not get the bread we requested and water was not refilled. We did not find the waitress to give her the money, had to give to another helper. Food was fine but service needs to finish strong."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oVVNVeFRhVzEwZFVoS1EwZEZZV1ozWDNkTlRIYxAB",
            "text": "Absolutely fantastic experience. Beautiful, intimate atmosphere, kind and tentative service, and a creative and vibrant seasonal menu. Our dishes were exceptional. I didn't want to leave! Totally worth the splurge. Plus they gave us a complimentary dessert for our anniversary and accommodated my allergies graciously!!"
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTdG9HOVlBEAE",
            "text": "Amazed with service, shocked by service( meaning excellent!) And our taste buds were dancing with joy....."
        },
        {
            "date": "1달 전",
            "language": "iw",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jNGRIUndUakZQUzFSNVEzVjZhR0Y1YlRneGNtYxAB",
            "text": "מעולה!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTE1VOWlUMHBFYzE5WFJITnZXa3RUU2xGUVRXYxAB",
            "text": "Went with my husband for our anniversary and had a great experience. Gabby was our waiter and she was so helpful with explaining the menu and recommended great food. I got the Bone in porkchop and my husband got the sirloin. Both were delicious along with the brussel sprouts and fall harvest salad. We wish our stomachs were bigger so we could all the yummy food! The atmosphere was warm and inviting. Next time we are in St. George we will eat here again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210WVFXOXNVaTFUUW1aM2JVRXhaM042T0RSMVpsRRAB",
            "text": "Walking into Painted Pony in St. George felt like teleporting onto the set of a spaghetti dish, directed by Salvador Dalí.\n\nOutside, a life sized chef statue with a smirk that screamed “I know where the bodies are buried” while pointing at the French Onion Soup sign like it was a coded warning.\n\nInside, the walls were alive, portraits of strange singers with Medusa looking red hair and wine sniffing men with purple lightning leaking from their scalps, a gallery of spirits trapped between entrees.\n\nThen the food started and reality wobbled. Baked Brie arrived in a molten black cauldron, bubbling like a portal to another timeline; the crostini were charred planks from a haunted shipwreck, and every bite was equal parts buttery luxury and apocalyptic omen.\n\nDon’t forget about the Bacon Wrapped Almond Stuffed Dates? Forget it. Those things tasted like a shotgun wedding between a devil’s candy shop and a rodeo concession stand; sweet, smoky, salty, crunchy…I swear one blinked at me before I ate it.\n\nAnd then…the mains. The Grilled Ribeye didn’t just sit there; it pulsed. It breathed. The microgreens quivered like they were trying to crawl off the plate.\n\nThe Bison Tenderloin was less a dish and more a ritual, juicy and tender, yes, but halfway through my bite I heard the low rumble of distant hooves and felt a spectral buffalo snort on the back of my neck.\n\nThe mac and cheese glowed with an orange radiance like molten iron. The risotto’s surface swirled on its own, whispering in brussels sprouts tongues!\n\nCompared to Buca di Beppo, which is basically an overcaffeinated Nonna stuffing you into a meatball coma under flickering Christmas lights, Painted Pony is a mirage of the Wild West after dark!\n\nSeductive, unhinged, and possessed. Buca fills your stomach; Painted Pony opens a third eye in it. This isn’t dinner. It’s an interdimensional cattle drive, and the bison spirits are leading you home."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGMGRGUmpNMFJaZGtKS2FIQTVVMlF0VlVGaExVRRAB",
            "text": "Price versus food doesn't do it for me. Very simple menu with very few choices."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paZk4wbEVSVWxVYXkxNWNGbFBNM0p0TWprdExXYxAB",
            "text": "The restaurant is a bit hard to find using GPS so we had to call and get directions. It’s located on second floor above another restaurant. The ambiance is very nice and artsy. Our waiter, Will, was excellent. Very knowledgeable and helpful. I had the Bison tenderloin and it was delicious. My wife had Sea Bass which she enjoyed. The food and presentation was very nice. We would definitely recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSS05FcHRkV2xrZEZZMFZFbzJRMk5FZHpSV1UzYxAB",
            "text": "Stayed overnight in St. George this month (September 2025) and dined at the Painted Pony. Fantastic meal and welcoming staff."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sdFZqWXlkRTFYTlhWVlNubExRbXh6Y2xwcWRGRRAB",
            "text": "Tenderloin was melt in your mouth perfectly done.  Weary travelers were given plenty of water in metal challace. Nate was right there when we needed something and not when we didn't."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kaFZVTjFVamgxWVdOdFRVSkJZbmM1YkV4S1kyYxAB",
            "text": "An absolute must do in St George! We had an unforgettable dining experience at The Painted Pony. Every dish was crafted with such creativity and flavor that it’s hard to pick a favorite!\nThe Bacon Wrapped Duck was perfectly cooked, with just the right balance of smoky and savory.\nThe Corn Ravioli was delicate yet rich.                                           The Blue Cheese Walnut Stuffed Pear was a true standout — unique, beautifully presented, and absolutely delicious.\nThe restaurant itself was beautiful and welcoming, offering a warm yet sophisticated atmosphere. Service was impeccable from start to finish — attentive without being intrusive, and every recommendation from the staff was spot on.\nWe left completely impressed and can’t wait to return. Highly recommend for anyone looking for a memorable fine dining experience! ~ Hollie 30a Beach Girls"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taemVEZFNUazVIU1ZWQ1REZGtYelI0U21GVGMzYxAB",
            "text": "You can tell a chef runs the kitchen. The front of house is very competently run, although maybe some extra training on some of the unique things about the restaurant, like their wines (best list I've seen in Utah--a difficult task), would add that last touch of polish. After a few visits, the quality is consistent and the front of house staff is prompt and professional."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RemIwZDVNMDlmU25JNWQxY3paSE5GYVU1TlNsRRAB",
            "text": "Early dinner , our 3rd time dine there,  we love ambiance of restaurant, the colors of wall, teh Tables , the olive couch , event the Goblets , calming & warm  -so  this time , for starter we had mussel in curry sauce- was good &  crab was delicious , for entree this time we had  chef recommendation : Grill halibut , after 1st served  fish too salty. We ask for re serve without no salt for fish  & turn excellent as we expected , we also order sheered  scallop  its wow , juicy , sweet , fresh seafood its best  &  dessert we had  coconut lime tart  , It's nicely closing our dinner , & yes  we had great sparkling to for our pairs ,  waiter Brynn also served us well, thank you Painted Pony you keep your  outstanding dine place for us , we will be back definitely ❤️🙏🏻🌺"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWVgxRnphRWhtWm5CdllqTkVSVXRqUm1SYWIyYxAB",
            "text": "What a pleasurable experience we had last night with a reservation made the night before.  Fairly busy BUT not packed, as the outdoor seating was cozy and comfortable.  Hannah took extremely good care of us, very attentive bringing out our shared meals in different courses.  The cod special was flaky and cooked to perfection.  NO regrets selecting The Painted Pony for a Friday evening !!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVFdUbFJWME5pYkVkMlIxSnFTMnBVV1ZodmJWRRAB",
            "text": "A good spot for dinner and a drink. It’s a bit confusing to get to this restaurant. Overall service was great but slow for the food to arrive. The steaks were fantastic, duck and peppers were tasty. Overall fantastic place for a bit to eat if you’re in the area. Recommend the Bison."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swNVJVTkllRXBaTkZOMWFqUnhYMUpYTjBSSldIYxAB",
            "text": "An absolutely incredible dining experience at Painted Pony. We started with the crab cakes and perfectly balanced old fashions — both were outstanding. For entrées, the ribeye was cooked to perfection, rich and flavorful, and the ravioli was equally impressive, with just the right texture and depth of flavor. We paired it all with a beautiful bottle of St. Émilion Bordeaux that elevated the meal even further.\n\nThe service was warm, attentive, and professional without ever feeling rushed. The ambiance strikes that perfect balance of upscale and comfortable, making it ideal for a special night out. Painted Pony is hands down one of the best restaurants in southern Utah, and I’d recommend it to anyone looking for an unforgettable meal in Saint George."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOTVVFNXNhRXBCZUVkMGVtbGZObEZFVEhodFZtYxAB",
            "text": "Can’t wait to go back! Food and service was outstanding."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTGQycGtMVGd3T1ROWlQyWlVObXhXWlRCMGJVRRAB",
            "text": "Everything was fantastic. And the place is beautiful. The tarragon chicken and grilled steak were incredible."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZNVdWTmZaVmxOYTNscmNHNVdNekJIWVdsdVVXYxAB",
            "text": "Very respectful and professional."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTmMwUk1WMDF6TXpjM2JsQjBhelJHU0V0YVprRRAB",
            "text": "A must-try in St. George! My family and I make sure to visit this place whenever we are passing through the city. Everything we have gotten here has been high-quality, delicious, and reasonably priced.\n\nWe ordered off the lunch menu last time, with pictures attached. The crab cake appetizer was probably the best crab cake I have ever had! I loved the fruit garnishing. The cured salmon sandwich tasted almost like a poke bowl in a sandwich, just as the waiter described. It was light and refreshing, and the flavors were very well executed.\n\nI hope to visit many times again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSVZYUk9UV1JrZFVOVE1sWk1aSFpFVURWMFVGRRAB",
            "text": "Good food and nice atmosphere. Would return"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twQ2NrWTBNVm80WDJSSE1HRTNibmw0VFRaV2NXYxAB",
            "text": "The food is consistently good as is the service. You can always count on a great meal here."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210UWJtZFlRalp0WTNBdFdXSXRkM010ZFZwblEzYxAB",
            "text": "We very much enjoyed our dinner at Painted Pony. We ordered an appetizer (crab cakes), two entrees, and dessert. All items were fantastic! I would certainly recommend the bacon wrapped duck! There's numerous wine options to pair with entrees.\n\nService was incredible! Anjuli was very attentive, welcoming, and offered great recommendations. We enjoyed having her as our server.\n\nWould certainly recommend Painted Pony to anyone looking for a finer dining experience!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNOWNpUklBEAE",
            "text": "Ryan never disappoints.   His wine recommendations were perfect and he handled our group with ease.  Thank you for making tonight so special!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5VE5rWmtOMFYyZG1OTE1GOWFNbGQwTFVsSGJYYxAB",
            "text": "Our first time at The painted Pony and it was amazing. Great food atmosphere and service!  Had the filet. So good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RmNGbFdOMVpoZW1sTmVWRlpiWEUzU1daeWQxRRAB",
            "text": "so-so experience for the price"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGeExUQkNNUzFuZFRjME5EVjVSVUpaZWs5MU5rRRAB",
            "text": "Always amazing, great drinks...."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGd1VIVjBkMFJpZFhKUGJVTkpjMloxY1RJd09IYxAB",
            "text": "TL;DR: Overall, if this were a meal that is easily affordable for you, then I would recommend it. However, if this were going to be a splurge or a very special occasion, maybe look for something with less thoughts on elegance and prestige and more on flavor and experience.\n\nAll this should be read bearing in mind that it is incredibly easy to critique and suggest improvements when one neither has to prepare, nor wager potential loss. These are just my thoughts on my meal tonight.\n\nFrench onion soup has a touch of sweetness, well balanced with the nose of the toasted cheese. Good, but not incredible.\n\nServed brie a bit too early, or maybe I take too long with the soup..\nDelicacy of brie overpowered by topping, only the mustiness coming through, holding out hopes for bites with garlic...\nGarlic definitely adds to the bite, but leaves a bitter finish, maybe if it were roasted in an aus ju before hand...\nGarlic cloves untrimmed, so much could have been done esteticly with these instead...\nInstead we are left with hardened inedible stumps.\nThe sauce by itself brings to mind both fresh delicious strawberries and cooked hot preserves, with the fruit not gently handled..\nI feel like if it were a light, softened citrus, maybe kumquat, it would have amazing possibilities to open the cheese and elevate it spread warm over the toasted bread.\n\nThe balsamic and olive oil with crusty bread is very nice, bringing back memories of the kitchen (note to chef, warm the bread so it's not cold?)\n\nCarrot puree is quite delicious!!!\nThe bacon wrapped duck is quite tasty, very elegantly plated, and the roasted root vegetables surrounding are delectable. Taste and appearance it is definitely the highlight of the meal.\n\nThe chipotle bread pudding is quite good, lightly spicy with a good cheddar undertone. Unfortunately rather dry though... Maybe this was unintentional, maybe it had been prepared before, then refrigerated and lost moisture. Or maybe it's just what the chef intended and we just have diverting preferences ☺️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kaVZFSmxla010VTFsMFlrMVZhemRGVEVWeWJrRRAB",
            "text": "Excellent food. The best I've eaten out in quite a while. Cooked to order, plated as requested. Top notch service. I'll go back, for sure!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdFRFMWFNRmRRVDIxNWNUWmhhWGhVVTNVeVduYxAB",
            "text": "Waitress was absolutely wonderful and other staff made sure we always had drinks refilled and everything we needed. Food was ok but not great especially for the price of the plates. Steaks were not tasty. Over cooked just made them burnt tasting. Presentation was nice."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVGNrTmZla2MyV0U1Q1UyNHhVaTF5Tm1VeFkzYxAB",
            "text": "The service was exceptional, the staff were incredibly polite and friendly. The restaurant itself is gorgeous, and relaxing.\n\nThe best part of the meal were the crab cakes. The balance of tartness with the crab flavor, all with very light salt and sweetness from the fruit topping, made the most delicious appetizer I have ever eaten.\n\nThe spring pea puree, whipped potatoes, and caramelized carrot were all delicious and unique. The prosciutto wrapped chicken was well cooked and the flavor balance was just right.\n\nI was dissatisfied with the lamb shank. Though well cooked, the sauce had a bitter coffee-like flavor that pretty heavily overpowered the lamb's natural flavors. The sauce itself was reminiscent of a strong home-style roast flavor; if you like that sort of thing, you will probably like this dish."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCTlZUTk1NMmxXZEd0WE1XcDRjMloxVm1rM05FRRAB",
            "text": "Service was excellent. Hannah was kind, attentive and gracious during our visit. The food was phenomenal. We started with the crab cakes which were filling and surprisingly well balanced with the fruit it comes with. My wife had the balsamic chicken, wonderfully balanced and fresh. I had the bison filet, cooked to the chef’s recommended rareness, was perfectly tender and not over or under seasoned. My one negative takeaway was not because of the restaurant itself, but because some of the rude looks and stares from other guests. That being said, the staff was more than welcoming and kind to our diverse party."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvLXJLcHNnRRAB",
            "text": "Nice place with a great dining room. We couldn’t get an inside table so opted for the patio which was very comfortable. Started with complementary bread with olive oil and balsamic vinegar- very tasty. Ordered the bacon wrapped dates which were good. Then we shared the Beet Salad (pictured) and it was amazing. Lots of different flavors going on with many different beet preparations, including the dollops of puréed beets that left us wanting more. My wife enjoyed the prosciutto wrapped chicken with the peas and risotto (also pictured). My Grilled Tenderloin Steak was the only disappointment: ordered medium-rare and it arrived well done. Once we got the attention of our server Kyle he had it remade, which took a lot longer than I had expected, and unfortunately it was also overcooked but not as much. I ate the center pieces that slightly pink and left the rest. A Floor Manager named Cindy came by our table to check on us since we had to send something back to the kitchen, which in my experience is the mark of a classy place. We just shrugged and acknowledged that it happens. She appreciated our understanding. Server asked if we wanted dessert and we agreed to look at the menu. However, we didn’t find anything exciting so we just asked for the bill. Great atmosphere and vibe and we would try it again."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRd2Rianh3RRAB",
            "text": "⭐ 4/5 – Delicious Steak, Worth Stopping For\n\nI stopped by Painted Pony while driving through St. George, and I was really impressed with the steak. It was perfectly cooked, tender, and flavorful. The quality of the meat was outstanding, and the seasoning was just right—definitely one of the best steaks I’ve had in a while.\n\n🍽️ The Food: 4.5/5\nSteak was fantastic—cooked to perfection, juicy, and flavorful\nThe menu has a good variety, and everything seems to be well thought out\nSides were great, complementing the main dish perfectly\n🏡 The Setting: 4/5\nCozy and upscale vibe—perfect for a relaxing dinner\nGreat ambiance, though it can feel a bit crowded at times\nNice and intimate without being overly formal\n🛎️ The Service: 3.5/5\nFriendly service, but it was a bit slow\nThe staff seemed a little overwhelmed, but they were still courteous\nService didn’t ruin the experience, but it could have been faster\n💰 The Verdict: A Great Stop for a Meal\n✅ Great steak and quality food\n✅ Cozy yet upscale atmosphere\n✅ Good menu variety\n❌ Service was a bit slow, but not a huge issue\n❌ On the pricier side, but worth it for the quality\n\nWould I return? Absolutely. This place is now one of my favorite stops when passing through St. George. If you’re driving through or staying in the area, definitely check it out for a great meal!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIX29IMlVREAE",
            "text": "Lovely place, excellent decor.  Outdoor sitting has these mist sprinklers making it refreshing and pleasant to sit there in warmth.  Good size portions.  Duck was amazing!  I also had fried olives, tomatoes salad and special of the night - French onion soup.  Excellent quality mixed drinks!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbnFIc25BRRAB",
            "text": "My pictures don’t do this place justice. It was amazing and everything ordered was yummy and tasty. The carrot jalapeño soup was so good I wanted seconds. Service was top notch and very patient. We enjoyed many courses and lots of visiting and never felt rushed to hurry and eat and leave. Reservations recommended as they seem to be full all the time. Overall very impressive!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213dFdtVlVNMHhUTjNKc05sOHpZVk5qTW5aSmFFRRAB",
            "text": "So glad we have the painted pony. Great seasonal menu. We recently tried it for lunch and really enjoyed it for a cheaper smaller meal but still painted pony quality. Got to love the metal goblets 🏆"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6dnRxczl3RRAB",
            "text": "We were traveling on our anniversary. What a delightful surprise to find this restaurant. ABE was our server. He had a very good wine recommendation. The food was very good. My steak was cooked just right. Dessert was the best. Don't skip dessert."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREbm9yMGFBEAE",
            "text": "One of my favorite restaurants of all time! Whenever I’m in St. George, it’s a plan to go to the painted pony for at least one meal! I don’t think they even know who I am but I’ve been coming here for years and years! The food is yummy. This time I had the Spanish dip with a fresh green salad with shoestring green apples and the pony old-fashioned cocktail is perfect. Really good like grass fed beef. Their cocktails are fabulous and their wine list is great! Plus, it’s a beautiful atmosphere with quiet classics playing and lovely ambience and art on the walls! I highly recommend the painted pony. Ask for Nate!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6c3RXS2l3RRAB",
            "text": "Exceptional service and delicious food. The flavor combinations are delightful, and the straightforward menu is easy to navigate and enjoy. I highly recommend the pork chop, which was cooked to perfection and accompanied by excellent sides. The charred ribeye was incredibly tender and flavorful, with a fantastic blue cheese fritter on the side. The drink menu was diverse and offered something for everyone. We felt comfortable in the inviting atmosphere, with a casual dress code and attentive service from Abe, our very friendly server."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQSFVtdFdDNHY2Q01BEAE",
            "text": "Perfect food, wonderful atmosphere, on the quiet side which we enjoyed, great decor, nice service… one of the best meal we had in the US. We have lived in the USA for 30 years!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtbjRpUm9nRRAB",
            "text": "This place is absolutely amazing My new favorite restaurant in St George! Went here for my birthday, staff and chef are awesome! Brian was our server he was very knowledgeable of the menu and had great recommendations. We had the French onion soup, steamed mussels, clams and linguine and the hanger steak rare was absolutely fabulous! drinks were perfect followed up with the best bread pudding I've ever had! If you're in St George you need to treat yourself to this restaurant!! You will love it oh yeah and the deck outside is cozy and comfortable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYME52RHFRRRAB",
            "text": "This has to be one of the greatest restaurants I’ve ever accidentally stumbled upon. While in town for a golf tournament, I found the Painted Pony. Everyone on staff was extremely friendly and very impressive at their respective jobs. The menu we encountered was elegant, intentional, and exceptionally crafted. From the crispy bread to the sensational duck ravioli, everything tasted incredible, and that is without mentioning the decadent chocolate cake dessert. Since the Painted Pony has a premier chef, the menu rotates seasonally, so there is always a reason to visit. My compliments to the chef and all the incredible wait staff. Do yourself a favor and snag a reservation ASAP!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJd2RuZDNnRRAB",
            "text": "Unparalleled fine dining experience. Will was my server, he was the best. I ordered the beet salad and the bison tenderloin. You get what you pay for in the state of Utah, so when you need a real treat, swing by."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCZmNGRk1NVUV6TldKR1MzWlBWMGgxV1dsNlVIYxAB",
            "text": "We were pleasantly surprised with the menu.  Ordered a blackberry margarita that was delish.  The calamari special was the perfect mix of sweet and savory.  The beet salad was unique and tasty.  We ordered the bison and sea scallops and they were superbly prepared and delicious.  We had a 5/5 experience: hostess, bartender, chef and especially our server."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURScnFDRjVRRRAB",
            "text": "I've heard so much about the Painted Pony I had to try it. We had the Quail as an appetizer, the hanger steak and lamb chops for an entree, and the white chocolate cheesecake tower for dessert.\n\nThe food was fantastic and cooked to perfection. My favorite dish was the dessert! I would go again just for dessert. The atmosphere is welcoming with all the natural light and a great view of the plaza at night."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIamVqNThRRRAB",
            "text": "Enjoyed our dinner at Painted Pony. I do have to admit some of the combinations were not to my taste. Loved the heirloom tomato salad. My husband loved his boar steak and dessert was delicious!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKZXU5NjdZeEozdFl3EAE",
            "text": "A coworker recommended the Painted Pony as having the \"best bang for your buck.\" He was not wrong.\n\nWhile the query about a reservation at the front desk causes me to think reservations may be necessary, they clearly aren't all the time. We walked in and were seated immediately.\n\nThe atmosphere is upscale, and yet, this Idaho boy wearing shorts and a t-shirt was treated as though he were wearing a tuxedo. (Nicely done, Kyle!)\n\nMore importantly, the food was excellent! We started off with crab cakes which were moist and delicious. For the main course, I had the Bacon-wrapped Duck while my wife had the Braised Lamb Shank. Both were delicious! The meat was tender and the sauces in each dish complemented the meat exquisitely.\n\nThe Painted Pony is a bit on the spendy side, but from the atmosphere to the food to the service, it is worth every penny. I could not recommend it more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYa3NucFJnEAE",
            "text": "Had lunch with friends here. Excellent food and services. The premise is decorated with southwestern vibes and it felt very comfy.…"
        }
    ],
    "reviews_count": 59
}