{
    "name": "Smash House Burgers Queens",
    "place_id": "ChIJ2djqmG9hwokRlFGSzmnHNsA",
    "grid": "QN8",
    "address": "69-44 Main St, Kew Gardens Hills, NY 11367, USA",
    "rating": 4.7,
    "user_ratings_total": 486,
    "phone_number": "(718) 640-1762",
    "reviews": [
        {
            "date": "17시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oWVZtMXRaVXB0T0Y4d2NHOUdUbk5sTjNWVlNGRRAB",
            "text": "My favorite Smash Burger Place!\nHad a wonderful time with the family at Smash House Queens. The manager Ben is amazing! He made sure my family and I had everything we needed! Excellent service! Definitely will be coming back soon! Must trys are the Loaded Smash, Dirty Fires and Philly Cheese steak! Definitely want to try the rest of the items on the menu!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkZlpYbDFTakZyZVhwcFlsWk9XSGd3YkRKM1FYYxAB",
            "text": "Always amazing. I’ve been here multiple times and it’s consistently 10/10 — great food, great service, great vibe. Highly recommend. You won’t be disappointed"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WR2F6Tm5XVjgzYTJWc1ZIZGhNVkJ2TUdaRFZsRRAB",
            "text": "Absolutely loved Smash Houser Burger in Queens!\n\nFrom the first bite, you can tell they put real care into their food. The burgers are perfectly smashed—crispy on the edges, juicy inside, and packed with flavor. The buns are soft and fresh, and the toppings are high-quality and generous.\n\nThe staff were super friendly and welcoming, and the place had a great, casual vibe—perfect for grabbing a bite with friends or family. Everything came out hot and fast, and you could tell it was made to order.\n\nHighly recommend trying their signature Smash Burger with fries—it’s easily one of the best burgers I’ve had in Queens. I’ll definitely be coming back! 🍔🔥"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1WmFrcEJOalJOTW1WdE0wSmxZV3hSTm1kTGFIYxAB",
            "text": "Delicious food. You get a huge variety, but most importantly quality.\n\nThey got burgers, various meat options, chicken options and secret menu items. Just ask and they will deliver.\n\nSmash your way there and you won’t regret.\nA++++++"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdFVUVXhaREJaVDFWeloxQklRMlJJUjNaR1ZrRRAB",
            "text": "I must say this place is a 11/10. It’s by far the best kosher fast food restaurant ever. Let me first start by saying that when I entered the restaurant the employees were so friendly and polite. One of them recommended me try the chicken tendies dipped in the popper sauce, that was so good especially with the garlic sauce they gave. On top of that I had a double cheeseburger!! Who knew kosher cheese would taste so real 🤭. The best of all this place is so kid friendly, my brother got a toy with his kids meal that just made his day. Can’t wait to come back and let all my friends know about this gold mine!!!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prM1VIZGFXbVF0VkZGV1lYbzVhbGhaVWxGbFFrRRAB",
            "text": "Best Kosher smash anywhere!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxcGRtVlNkbTFGVEdkVldGVk1MWE5FWXpaV1UyYxAB",
            "text": "I genuinely wanted to like this place, but unfortunately, it didn’t live up to the hype it has on TikTok. At this point, I’m beginning to wonder if some of those glowing TikTok videos are paid promotions, because the food was simply not up to par.\n\nUpon entering the establishment, we were not greeted, which immediately set the tone and the fact there's waa a bit of trash on the tables and floors. When we attempted to ask a few questions, the young man at the front seemed preoccupied with his cellphone and was not attentive, even after a fewl attempts to get his attention. He was polite once engaged, but first impressions matter — especially in hospitality — and this one fell flat.\n\nPricing is another concern. For the quality provided, the menu feels overpriced. We ordered three items, and the total came to just over $60 — quite steep for what is essentially fast food. To make matters worse, there are additional charges for minor add-ons: lettuce, for example, costs extra, as does any additional sauce (50 cents each). Even asking for garlic mayo on a sandwich adds another 50 cents to the bill.\n\nOn a positive note, the food was served promptly. We began with the Dirty Fries — seasoned fries topped with BBQ brisket, more BBQ sauce, and two additional sauces. While the portion was generous, the overall flavor profile leaned excessively sweet, lacking the balance needed to make it enjoyable. The dish could benefit from some acidity or spice — perhaps jalapeños or another vegetable element — to offset the overpowering sweetness of the BBQ sauce.\n\nNext came the Schnitzel Sando. The chicken itself was juicy, but the sandwich as a whole lacked flavor and depth. It desperately needed a built-in sauce to complement the protein, or the chicken should have been more boldly seasoned. While there were plenty of side sauces available, I didn’t feel this particular sandwich should rely on add-ons to deliver its flavor.\n\nFinally, we tried the Loaded Smash. 11/2/25 This item had potential — the concept works — but it was overwhelmingly salty. I even had to ask the staff to take it back so the turkey bacon could be fried longer, as it was initially very chewy.\n\nIn the end, after spending over $60, we left feeling rather unsatisfied.  As per other reviews about the lack of PROPER customer service  it seems like this is an on-going issue. While the speed of service was commendable, the experience as a whole didn’t justify the price or the online hype."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210MlNYQjVSamREU0c1TE9VVXRNVGRRTVdsRGIxRRAB",
            "text": "Worst smash burger I’ve ever had, made me feel sick 10 minutes after eating. Gotta be some fake meat or something"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WclRsbENiVE14Y1ZCVlJYWTBOM0pRYUZkdk9HYxAB",
            "text": "Consistently serves a FANTASTIC smash burger time after time. Combo #3 is gold and a large portion of crispy fries. This place is a winner."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paTWRUbE9XRE5CVEdwNGJuVm9Nazh3TkZjNWJYYxAB",
            "text": "I walked in and I was greeted by the amazing manager benny he recommended me the jalapeño burger w cheese and bacon and I kid u not that was the best burger I've ever had"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSZmNVaEdRekl3YUdkRmFVWjFNUzEwWTNJdGFIYxAB",
            "text": "We ordered the Loaded Combo burger and the cheese steak sandwich. They were both delicious 😋 and pretty big portions. I recommend this place."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdHRUV2pBRRAB",
            "text": "Excellent food with decent prices.\nGreat assortment of flavors and everything is made to perfection.\nGreat, courteous and expeditious service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zNExXZFpORGxsYUVWV2VHMHpaVXcxYmpKbFRXYxAB",
            "text": "One of the BEST kosher fast foods in NYC! The food is always fresh and tasty. The staff are always sweet and efficient. Plus, the prices are great. I love coming here!! 10/10 recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBeGQxZHhZVmxHT1VoS1YyTkpMWFF6VlZKSmJHYxAB",
            "text": "Always hits the spot !"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbkt6aEx3EAE",
            "text": "Perfect"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUFZFZElZV2hFVVhOZlVGaERNRWcxVEVOTFdIYxAB",
            "text": "Benny is the best"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nMGFYRTVaR1E1ZFVFMmJYZElSR1kwTTFCQlgxRRAB",
            "text": "Very good chicken tendies with hot popper sauce, 10/10!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZNE9WSTRSVTlqYVZWalprMWxORkV6UmtaelVVRRAB",
            "text": "Great"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kd2QwMVNWVVUwV21SQ1NXdHFWbWRuYlVORFVsRRAB",
            "text": "Incredible Mexican grilled chicken tortilla with authentic ingredients, and I am a big fan of the Cobb salad (also the grilled chicken variety).\n\nAlthough I became accustomed to eating meat substitute burgers over the years doused in condiments and cheese, one smell of a SmashBurger Burger drew me back to the carnivore side.  No vegan cheese needed.  No vegetables needed.  No condiments required.  No seasonings even considered.\n\nReasonable prices for reliably high quality food.  Good selection of children's meals"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VelQwNUNhMUozUlhreGJXWjVRa1ZtZUd4eWFtYxAB",
            "text": "Burgers here are incredible. I had a Double Smashed and a Loaded Smash. The sauces are the cherry on top. Service was great, very attentive. Highly recommend this spot for burger aficionados."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GR1QzWnFkRVpQTUhWVGRuaFZjWEV5VTBsVWNsRRAB",
            "text": "Wings and burgers are to die for"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xadGRqUTRObEpMYW5Ca1ZFTjJaWHBPTUZWWWFHYxAB",
            "text": "This place got the best lemon pepper wings I ever had !!!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWcjlUTHNnRRAB",
            "text": "Great food!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMWVleTZRRRAB",
            "text": "Classic burger, jalapeño burger and blooming onion were all excellent. The blooming onion was, in fact, exceptional. We were under the impression that we couldn't eat in, but there are in fact a few tables (with chairs.)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOS1EwczJRemw1YjI5TlFsOVBlbTlzTTJGdWRtYxAB",
            "text": "Very good food!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ORFFXSXRibGhHUW0xbVExVndWMFJEYlY4dFpGRRAB",
            "text": "Very delicious food\nHighly recommended."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jd1MxcHdMVFJTY1daMlNVaHBja3BVT1MxSmJWRRAB",
            "text": "Disappointed in size of the burger. Other places give u a much larger portion for that price!\nSeemed mini but was reg size bacon burger!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTWRtbHpOV1phY2xNMWJHeHplRnBLWkcxek5GRRAB",
            "text": "Pure fun and wildly delicious. Get the double with fake cheese."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0S1ZrdzBWbmxxY1hkRlNWbExVV0ZCZGtkR2JVRRAB",
            "text": "Food was fantastic! They never disappoint"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oa2NVRlFaR2RNWDBWWE9WaEdXV3RGT1haSFZsRRAB",
            "text": "If you're going to a Mets game at Citi Field, skip the lousy kosher stand with dry pre-made burgers sitting in a warmer. Go a bit earlier to smash house for a burger & mouth watering fried wings. It's only a 10 minute drive from Citi Field."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWUVNVNHpSMnh5VlV0R1gxcG1hbmgxVDNaeFVVRRAB",
            "text": "Love this place. Every single thing on the menu I have tried so far was a 10/10. The service is amazing. The one thing that makes this place stand out is THEY LISTEN TO INSTRUCTIONS!!! If I order online and write in the “notes box” they do exactly as I say! Highly recommend if you’re craving a great burger that actually hits the spot!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWcmVpWjdRRRAB",
            "text": "Excellent food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wT2NGOXhlVGMxYTFreFp5MDRTblJ6WTNCWVgxRRAB",
            "text": "Smashhouse Queens Burgers offers juicy, well-cooked kosher burgers with a good crust and fresh buns. The toppings add nice flavor without overpowering the patty. Their fries are crispy and a satisfying side. The staff is friendly and service is efficient, making it a convenient choice for a casual meal. Prices are reasonable, and the portions are filling. If you’re looking for a straightforward kosher burger spot in Queens that delivers on quality and value, this is worth checking out."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOM1NrOW9aVFpzWm1WeFgzQk5RbEJZZHpaeWVGRRAB",
            "text": "Great spot for quick dinner! Ordered 10 minutes in advance- my food was waiting for me to pick up. They have an actually good tasting in house sauce- smash sauce- and chopped steak was thin so very soft not rough and un-chewable. Big plus- Very generous with protein options."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paemMyMTFYMHQzUkZRd1oyUjVlSEZVYVZkRk5IYxAB",
            "text": "Great place"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNVNUVlZXa2cyTmtWWWJtMXlWbUZaUVVwVGFXYxAB",
            "text": "The best most delicious finger licking kosher food in town!!!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xa09VdHBWRkZKVTJGaWRHaHNibEZTTXpSMVJWRRAB",
            "text": "Good basic American food burgers, fried chicken, some salad with above meats\nKosher McDonald's basic. Please get olive oil and lemon juice make dressing and expand salad options. Add fish items or falafel for those who don't want meat. Also staff can clean table area better."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CdWVqaDJOamhRV0dWS1ZIcG5VMXBoU1ZOMVJFRRAB",
            "text": "I came in for a quick bite to eat before work I ordered the smash burger .The gentleman at the register was super nice ! He gave me a complimentary drink and fries because it was my first time eating here at smash house ! 10/10 would definitely come again ."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjNFJFeHZZbms1VXpKRk16QlVSV0pQUkhOck5GRRAB",
            "text": "This was the most delicious meal I’ve ever had. Not greasy, not soggy. Fresh. Delicious, savory and fast!!! Love love this for us because it’s kosher!! Thank you !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kR05XTllOazV0WWswMFUySXhUbXMzYW1scFpVRRAB",
            "text": "Issac number one worker. Give this man a raise!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSeFVXdEhNbTVKUnpCc1UzUnhTbEp6VHpKMFYyYxAB",
            "text": "I’d rate this place 8.5/10. Smash House Burgers definitely stands out, especially when it comes to the food—it’s honestly some of the best kosher food I’ve ever had. I was seriously impressed. The vegan cheese tasted like real dairy cheese, which is rare, and every item we tried was a hit. We ordered the classic smash burger, dirty fries, churros, a Brisk can, and a Snapple bottle—came out to about $50 and totally worth it for the quality.\n\nThe ordering system through the screen was convenient, but the overall service left a lot to be desired. No one greeted us or even said “thank you,” and the food came out at all different times instead of everything arriving together. It felt like there wasn’t much care given to the dine-in experience. It also would’ve been helpful if they had trays to carry everything more comfortably—or better yet, if they just brought the food out to the table. The fridge is behind the counter and not accessible to customers, and even though we ordered drinks on the screen, instead of the drinks being given with the food we had to ask specifically ask for them.\n\nThe space itself feels cramped because there are just too many tables squeezed in. One small but nice touch is that if you ask for sides in person, they don’t charge you, whereas ordering them through the screen adds a 50¢ charge per side.\n\nOverall, this place has gourmet pricing and quality but with fast food service. I’d come back again, but hope the service improves."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQNm8yX19qbmVXQS1RRRAB",
            "text": "First time ever trying kosher food and wow — Smash House Kosher did NOT disappoint! Pulled up with my friend Isaac and we were both blown away. The flavors, the quality, and the portion sizes were all on point. The smash burger was juicy and packed with flavor, and the fries were perfectly crispy. You can tell they care about what they’re serving. Super clean spot, fast service, and the staff were really welcoming and helpful since it was our first time. Definitely recommend if you’re looking to try something new and fire. I’ll be back for sure! OH LAWD!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jNE1HTjZZVGgzTXpReGVqRTNTREpWZEhkS00wRRAB",
            "text": "Super friendly place.  They comped me on lemon pepper wings which kicked ass!  Double smash with crispy onions and brisket burger was killer. Will be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dV9DaVhnEAE",
            "text": "Food was fresh hot and delicious. The kids absolutely love the kids meals and the new toys were a hit! Cobb salad was delicious and big enough in our opinion to feed 2-3! Philly Sando was another awesome choice for us. Smash house for the Win! We also got crispy chicken salad and blooming onion…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMjd2ZS13RRAB",
            "text": "Definitely a fan - one of the only places to find a Kosher cheeseburger in town. Definitely come on on a light stomach - the food is filling and tasty.\n📍Located on the heart of Main Street, Queens.\nFood comes very quick, and when ordering on the tablets in the store, or online, you have photos next to each item.\nCome visit!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abVNWbEVVMkV5V1UxRFpGZGFkMWt0TWtsQ2JGRRAB",
            "text": "Wow first time eating a cheese burger, and holy tastes like really cheese!!\nService was INCREDIBLE,  and prices were solid. Gonna recommend to all my friends!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VNFgwRXliM2RIYm0xblNuZFFlbFp4UmxsbmVGRRAB",
            "text": "Heard about this spot from my friend. And OMG the food was super tasty. Service was phenomenal and kid friendly. Definitely gonna bring my friends to this gold mine!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOMzlxZUwzc1BEdTZnRRAB",
            "text": "Hey guys SMASH HOUSE burger was definitely satisfying🔥. The sauce given for the burger was different yet decadent. The fries were fresh and can be a meal ALL by itself if you are into fries like that. The wings were ordered well done. They ate with that. The sauce is spicy for the wings. Another thing others may enjoy. I had to wipe the table off. Aside from that, they definitely deserve a high rating. Also the environment is safe and very welcoming for ALL. This summer will be the spot for the after 8pm foodies for sure.😋 DELICIOUS ENJOY"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNseXRMZHlBRRAB",
            "text": "Hands down my favorite food establishment in existence.\nI cannt stress this enough, drop what you are doing and give this place a try. There is nothing like it.\n\nWhen I visited Smash House in Miami, I was amazed as to how good kosher food can be, and they finally opened their NYC location.\n\n9.5/10 would highly recommend!\n\nThank you Smash House!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfc3J6a01REAE",
            "text": "A review of the burgers lead me to smash house, but they’re not just burgers. The chicken is cooked perfectly and they are so generous with the sauces. I had an amazing lunch and would highly recommend the place. So much flavor. Try the popper tenders that sauce is banging"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmM0lxQjlRRRAB",
            "text": "Loaded smash burger was probably the best burger I've ever had in my life. We also got the chicken sandwich which was good and the popcorn chicken with was alright. Definitely will be back just for the burger"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOcG83UkJ3EAE",
            "text": "Great fast food restaurant!\nThe burger was definitely the best thing on the menu.\nThe others were great as well.\nThe food comes out in a blink of an eye.\nDefinitely recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROamZiM2tRRRAB",
            "text": "Let's start with the popcorn chicken perfectly fried nuggets with a light breading.  Juicy and tender and served with a popper like sauce.  Absolutely delicious.  The loaded smash burger was as solid of a burger as I have had.  The two patties were crispy on the edges and soft and juicy in the middle, the caramelized onions and beef bacon finished off the burger to perfection.  And the crispy fries were the perfect texture counter balance to the soft bun and burger.  I will be back."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGX2EtazBBRRAB",
            "text": "Excellent food! The popcorn chicken fingers are soft and seasoned really well. The dirty fries are out of this world! Absolutely delicious! The owner, Benji, was right there at the register, very hands on and friendly. Not a surprise at all, because his business management and customer service at all his other restaurants has always been superb. Can’t wait to try some more of their stuff!\n\nUPDATE: went back and got the dirty fries and loaded smash, which was even better than I imagined it! Wow! My wife got the cob salad, and loved it. Hands down one of the best restaurants in the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiMDdybnFnRRAB",
            "text": "Best Kosher spot! The food was so good, the services were great as well.  I had the Double Smash with crispy onion fries- Phenomenal! The Crispy Tendies w/ there spicy sauce was rite on the money! Loved this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3Z0lTWVl3EAE",
            "text": "Nice local place. Burgers have good flavor. Crispy onions are great."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCamVreEtNVlJQWVU0ekxYbDFOVzFPZUc5clNHYxAB",
            "text": "Went to this spot for the first time, seen it on IG and it did not disappoint. The gentleman taking care of you when you come in recommended many options and they did not miss. If you want a fire smash burger this is the spot. The wings and chicken sandwich on point."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMDlTdnhBRRAB",
            "text": "Great place , food was amazing ..I had the classic smash and it was great. Fries well cooked and the staff are cool. Will be coming back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMMS1YM0R3EAE",
            "text": "I love, love, love the lemon pepper wings. The single Smash burger is yummy. The staff are so wonderful especially Yoni. Oh, don't forget the signature Smash Sauce. You'll thank me later"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndU43UEp3EAE",
            "text": "Get the off the menu burger!!!! Best burger I’ve ever had in my LIFE!!! Service is incredible. Can’t wait to come back and try there other things."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wa1owOUpjMFV6YVVOSlgwWnFiRFkwTTFocFpGRRAB",
            "text": "They nailed it! The burger was juicy, flavorful, and cooked just right. The toppings were fresh, the bun was perfect, and the fries were crispy and golden. Great service and a fun vibe — I’ll definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIaE5Tb2RREAE",
            "text": "I was super impressed with the gluten free options, even had gluten free buns. The food was amazing and really hit the spot! Will definitely go there again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6OGZ1bmRnEAE",
            "text": "This was my first time at Smash House and everything was AMAZING! The housemade vegan cheese was the best I've ever had. 10 out of 10 recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROdWFyaHdnRRAB",
            "text": "I was really excited to go here and I finally went and I had such a bad experience. The smash burger was so dry and the sauces looked nasty I couldn’t even bring myself to try the maple bacon sauce. So disappointing, 16$ in the garbage. They need to do better"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMXE2WTBRRRAB",
            "text": "Wow first time trying cheese on a burger.\nBest thing ever yall gotta try.\nService was phenomenal as well. Shout out to the siblings in the front very patient with us and knew exactly what we wanted. 10/10!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsaHZxQ0F3EAE",
            "text": "Decided to give a try to new place in the neighborhood. Was very disappointed with quality of food. Sorry but there is many other burger places that are way better then this place. Burgers dry, tasteless so as chicken. Also very pricey for tasteless  food. 2 people for a lunch $65."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sUlVqQTBTbEI0UzNaeWRrdEdhM281WVY5VWJYYxAB",
            "text": "Just got my order and the burgers are so dry they crumble as soon as you touch them, also was shocked that they only have an option for vegan cheese.......on a BEEF burger...... dont waste your time with the burger, this has got to be the worst burger I have ever had the displeasure of trying.\n\nNow, the other food might be great i dont know. Im only going based on the burger"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25acVEyeHpkMkZtZVhsa1NqRTFka2xvTFZob1ZuYxAB",
            "text": "The food was very expensive for one and it’s not worth it at all. I went in there and the staff were kinda of rude. When I tried to speak to them they act like they don’t know I’m there. And again the food was 2/10. Trust me when I say this save ur self the trip and don’t ever come here again."
        }
    ],
    "reviews_count": 68
}