{
    "name": "MEHMAN",
    "place_id": "ChIJUd_un81hwokRoWIwppiOAY4",
    "grid": "QN8",
    "address": "87-52 168th St, Jamaica, NY 11432, USA",
    "rating": 4.8,
    "user_ratings_total": 259,
    "phone_number": "(929) 418-2356",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkTE1XcG5PRzl1VFVSUmRuSlpiVEZSTTBVdExXYxAB",
            "text": "We had a great experience at Mehman. The restaurant is clean, cozy, and has a calm, relaxing vibe. We ordered the lollipop chicken, biryani, and malai tikka, and everything was fresh, flavorful, and delicious in its own way. The staff was friendly and the service was smooth. I’d definitely come back again."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toVFdVMTBaMW95YVhKelJVaHdMV1pXTWxWb2RVRRAB",
            "text": "Raj took good care of us. Good vibes. Clean. Quality food. Massive delicious authentic portions esp the lamb shank!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaS1dEYzNNbFpoUlY4eFpXUjJjMlZ2VDI1bFVGRRAB",
            "text": "I ordered the Motka Dom Biryani. One bite in and i’m instantly transported to biryani heaven. Every part of the dish was exquisite, from the perfectly spicy rice to the goat that fell right off the bone. Can’t wait to come back when i’m in Queens again!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SUlUzaHFWVzloTURKalVVVklkMEV5VGpkRk9XYxAB",
            "text": "Such amazing food made with kindness and love. Raj was a wonderful and caring post. Thank you!!!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTFdHTkdObDh4VkhKVWJURlhVaTF5VDJSTldWRRAB",
            "text": "COME HERE FOR BENGALI FOOD! My friend took me here and I left with a full belly and motivation to write a 5 star review. First of all, the owner is very kind and the staff was attentive. The food was INCREDIBLE… the biryani pot was out of this world. Get it. I also got the chicken tikka which had a very unique sweet flavor. The chicken lollipop (appetizer) was unique and delicious. I asked for my mango lassi less sweet and it was so good.. fresh. To top it all off, they gave us desert on the house (doi). All I have to say is come here."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxdFdtSnpWMkV5Y0ZOWlVYSklWMlZaUlhGV1NYYxAB",
            "text": "Thee food is delicious and the staffs and the owner is so nice to the customer as well.Love the atmosphere as well"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkVWVHOVhUM1EzWkVNelFtcE9la05rTkdGV2VHYxAB",
            "text": "Delicious. Kind!!! Clean. Warming."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUk0xOVVXRFZHZW5SMFIyazBXVkl3U2tkbmMzYxAB",
            "text": "Amazing food! Especially the chana masala and tandoori roti! Its bomb, my girl loved it! 😍 Great environment to chill with your friends and family. I will surely come again."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfa29lLUZBEAE",
            "text": "Amazing goat dum biryani. So delicious, very good. Honestly, I want the biryani lovers to come and have the test. Enjoy 😉"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WE1uZHdiREJxU0doUlVrTlViME5uUm0xdE1HYxAB",
            "text": "Delicious food and excellent service. I recommend everyone to try their foods. Definitely Dum Briyani on top of the list."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxRWVtUldVbEY2WW1SNmJtWmpaSFZIU2tST04yYxAB",
            "text": "Had dumb biriyani and special handi beef curry both were really good and taste was 10/10"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1blptdGhUbWc1VVU4MGJHMXFYMmxFUW1aeVJHYxAB",
            "text": "The food was really great specially the dumb biriyani was awesome loved it ❤️"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FeVFuZElWM0ZDTjJOWlozUlNiVlJQV1V4T2FVRRAB",
            "text": "My mom and I randomly decided to come in here today and the food and service was amazing. The owner immediately greeted us, seated us, and was very attentive with what we wanted.  We ordered the lolly pop chicken and lamb shank and they were both cooked perfectly. This is probably the best food we’ve had in Jamaica and we’ll definitely be coming back with the rest of our family."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4UVdrbG9jR2RhV0hwbU1rUmpjVkJhZVhBdFdYYxAB",
            "text": "Good food, great service"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OcWJXRkNSemxLU0dWNVpHZHlSR3hXUzBsYWRWRRAB",
            "text": "Small but super friendly!! Was looking for negative reviews before we went but found none and I was thinking “how is it possible?” But most certainly they proved me wrong.  Food was great!! Place is very homely."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201UFkxWXhZVEZFZUVsUFMwVkJWRkJIY3pKNVJsRRAB",
            "text": "Deepika is Amazing."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSE0zQnhWVmQwYzAxTVZETk1XRXc0WkY5WWRFRRAB",
            "text": "Staff was very attentive, food was on point and timely , quite and relaxing and private"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaTmJ6WlRSazFsWXpST2VqVjNVSFpCUmt4aFUxRRAB",
            "text": "Absolutely delicious food! Service is excellent. Please stop by there and try their tasty food. Don’t miss it."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcVlscGhkVjl5ZDNoU1RtZFhNVTFmWW1wU01HYxAB",
            "text": "Had the Motka Biriyani and it was fire 🔥 full of flavor! The tea was smooth and hit just right. Definitely coming back everyday."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prd1NXOUJlR3hTWDJNNFVVbFRSVWhKU0hneVRHYxAB",
            "text": "Had mix platter and Motka Dum Biryani. Food was amazing and freshly made. Really liked the environment and overall service. Highly recommend them for a tasteful experience with friends and families."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNMFIxSnNNM0V5ZEVoRFN6Tk9PVzlMVEVsM2VGRRAB",
            "text": "The food was extremely delicious, very friendly service, calm and family friendly environment. The motka dum biryani is a must try and combine it with their signature milk tea. Highly recommended!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMloyRlZXbWh2ZUVveE4zbHpiRTVzUlVSYVJXYxAB",
            "text": "Food is absolutely unbelievable.. the butter chicken /sauce with the garlic naan bread was to die for.\n\nWill be back without a doubt !"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paeE5FeHVVbUZvVTBKQmJEWnRNbEpyVjJKTlNYYxAB",
            "text": "Oh man where do I start! The owner is so sweet and the food is just incredible. The food that stood out to me the most was the motka dum biriyani with beef and the butter chicken with garlic naan. Both were very flavorful and the butter chicken was sweet and creamy, and so fresh. I posted a TikTok on this place and got over 5,000 views on the video but google doesn’t let me upload it. You def have to try it!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNk5TMXJOMGxQWmtkd1FtMDROemxYUW05emNVRRAB",
            "text": "We get food from here almost every week. The biryani is amazing. Probably the best biryani I’ve had so far. This is how it should be. Perfect blend of spices and tender meat. Must try!\nService is spot on. The hosts are very welcoming and hospitable. Definitely coming back!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xONk1FbExRVlJSVURsUllrUTFXRVl4VWtKeFJYYxAB",
            "text": "The food was good. I had the tandoori mixed platter and biryani. The tandoori was very good, flavorful and good portions. The service was excellent. If you are in the mood for a relaxed atmosphere with good food, you should this place out."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KUU1HWnVSbmRUUTNaQllYQlRhRk0wU2pCbmNYYxAB",
            "text": "Mehman’s Motka Biryani is a must-try! The rice is fragrant, the meat melts off the bone, and the spices are perfectly balanced. Pure comfort food done right."
        },
        {
            "date": "3주 전",
            "language": "bn",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oT1dUSjFhVEl0Y1cwd2JGQkNhV2haZGxoTVUyYxAB",
            "text": "আমি সাধারণত কোনো রেস্টুরেন্ট রিভিউ লিখি না, কিন্তু এই জায়গাটা নিয়ে না লিখে পারলাম না।\nসেদিন রাতে পরিবারসহ অতিথি আপ্যায়নের জন্য গিয়েছিলাম।\n\nআমরা অর্ডার করেছিলাম বিফ ও গোট কারি, কাবাব, আর বিফ বিরিয়ানি। খাবারের স্বাদে আমি একটা পাকিস্তানি ধাঁচের অনন্য ফ্লেভার পেয়েছি — সত্যি অসাধারণ! স্বাদ, ঘ্রাণ, আর রান্নার মান সবকিছু মিলিয়ে নিঃসন্দেহে ১০/১০ দেবো। প্রতিটি আইটেমই দারুণ লেগেছে।\n\nসবচেয়ে যেটা আমাকে মুগ্ধ করেছে, তা হলো রেস্টুরেন্টের মালিকের আতিথেয়তা। উনি নিজে এসে প্রতিটি খাবার গরম গরম সার্ভ করেছেন। আমাদের প্রতিক্রিয়া মনোযোগ দিয়ে শুনেছেন, খোঁজ নিয়েছেন খাবারের স্বাদ বা ঝাল ঠিক আছে কিনা — সত্যি বললে এমন কেয়ার আমি খুব কম জায়গায় দেখেছি।\n\nশেষে উনি আমাদেরকে নিজ হাতে কাস্টার্ড পরিবেশন করেন, যেটা ছিল একদম বাংলাদেশি স্টাইলে, হালকা মিষ্টি, পারফেক্টভাবে ব্যালান্সড — এক কথায় অসাধারণ।\n\nআমি ১০০% এই রেস্টুরেন্টটাকে পরিবারসহ অন্তত একবার ট্রাই করার জন্য অবশ্যই রিকমেন্ড করবো। এমন মানসম্মত খাবার ও আতিথেয়তা খুব কম জায়গায় মেলে। ❤️"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oQ05GZHNlblYxVW5VemMwUlplRTFYVlRaSVNrRRAB",
            "text": "Small place for family of 6 but they made it work. Food was amazing. Service was great, with wonderful menu suggestions. But the food was of course the highlight. Lollipop chicken, lamb shank, tandoori sampler and the biryani were all delicious."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1aFowVjZjMHBpVEZReVVVaGlSSEJrZGpKZk0zYxAB",
            "text": "I visited Mehman for the first time this evening with my mom, and we were pleasantly surprised by the quality of the food. We tried the goat biryani, mango lassi, and doi — all of which were absolutely delicious. The customer service was warm and welcoming, which made the experience even better. We're definitely looking forward to returning to try more dishes."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKT2VqUlpTa3AxTjE5UlEyRk5OMGxDUm1WTVZHYxAB",
            "text": "This place is amazing!! The owners were so friendly and everyone was so attentive and kind! Butter chicken is 10/10."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oSFNUQlpNazVIYVdWQ2NISk9ZVGQ0V25scWRXYxAB",
            "text": "Food was great with healthy ingredients and less sugar. They use brown sugar for yogurt."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdFdXVnFSMlZxYTJWNVUxSlhYemR0WTFsMFowRRAB",
            "text": "Best food ever. Love the atmosphere and the food."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2treGJscEhRelJVVmtKdFJtUkRTMmhEVWt4R1dHYxAB",
            "text": "Hospitable and hearty! You truly are the \"mehman\", a guest. The owner genuinely wants to cater to various tastes and seeks feedback. A rare quality these days !"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WSFRXeGtiMVJtUWxOcVFXb3RVSGRPYWprd1EzYxAB",
            "text": "Very clean place and friendly staff, naan was fresh and well made, good experience overall!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0eVEzWlRablJ5TW5aNGRsWlJZMXBIYVRGclkxRRAB",
            "text": "One of the best chicken Loli we have ever had thanks for the best service"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1QlRsaFBkMWQwU0ZkSWR6TmhibFowZGpZelprRRAB",
            "text": "Fresh and delicious meal. Behavior of the staff was amazing."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5WVZXSjJNUzFxVWxWYVpUTm1jbFkzWjFFNWRFRRAB",
            "text": "I had the pleasure of dining at Mehman in Jamaica, Queens, and it was an excellent experience from start to finish. The food was simply outstanding — fresh, flavorful, and beautifully presented. Every bite tasted authentic and made with care.\n\nThe ambiance was warm and inviting, creating the perfect setting for a relaxed meal. The staff were attentive and polite, making sure everything was just right.\n\nA special mention to the owner, Raj, who is not only professional but also very humble and welcoming. His hospitality truly adds a personal touch to the entire experience.\n\nOverall, Mehman is a hidden gem in Queens! I highly recommend this restaurant to anyone who enjoys delicious food, great service, and a pleasant atmosphere."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCTFJUSkZaVmxmVkhkSWVGOXpRelZYYmxvNWJYYxAB",
            "text": "Food was good! Came with my parents they enjoyed a lot"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5RFIzTnhNVzlyUnpoaFNqa3RiMk0zVW5wRmMzYxAB",
            "text": "I wanna start off and say that raj was very welcoming and so kind ! This place is extremely clean and beautiful I love the customer service it’s definitely amazing & not to mention the food 😍 definitely out of this world I’m not kidding 10/10 I’m very satisfied"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SQlRHSnBZVmxCVlRWMlFYUlNZMTkzV1V0Wk9FRRAB",
            "text": "The host Raj was so hospitable and kind. He made sure we knew the best items to try and he was right . The lamb chops, lamb shank, butter chicken, and even down to the rice was so good and flavorful . I would definitely recommend especially the prices being pretty good as well to be honest. Make sure to come try them out if you are ever in the area !"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSGFtazNNVEo1V25aQlIxbDRaV3hQU1ZGd1IxRRAB",
            "text": "You have to start with the chicken samosas and green sauce! The combination is so good. The decorated menu item is their Beef Biryani. Served in a hot clay pot and umbrella’s by a naan roti, it is very good. To finish off you have to get an order of cha and dhai (yogurt). Make sure you come with an empty stomach because everything is filling and the portion sizes are good."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKZWJfTzN5Ny1mcFdnEAE",
            "text": "The food was delicious, and the service was great. Perfectly balanced flavors, beautifully presented, and cooked to perfection Thank you from the bottom of my heart! Everything we had was absolutely delicious and made with so much love.\" must try 😌"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbV9ibXhBRRAB",
            "text": "If you're looking for an authentic taste of Indian and Bangladeshi cuisine, look no further! The flavors in every dish are absolutely outstanding. From the rich, aromatic curries and tandoori specialties to the flavorful biryanis, every bite is a delightful explosion of spices and fresh ingredients. The balance of heat, sweetness, and savory notes is perfection."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkaFN6ZHlSVzFxU1hadVEyaFpMVnByUWs5VlQzYxAB",
            "text": "Without knowing about this place before I entered into the restaurant and found a nice environment in a small but well organized restaurant. The food was fresh and delicious. I experienced the best attitude and hospitality in this place. Their courtesy was very generous. This place is highly recommend who loves to explore different test in NYC. I received two cups of generous Tea and two Singara, gives me an understanding of how much they valued their guests."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sYU1rTlRhR0YyZFV4R2FWWllVVkEzZEZaWGVXYxAB",
            "text": "For a restaurant that just recently opened, Mehman is already exceeding expectations with both their food and their staff. The flavors are unique, and truly on another level. While everything was enjoyable, I felt that certain dishes, like the Mughlai, could benefit from slightly larger portions.\n\nThat said, the overall experience was excellent. The beef byrani, chicken roast, chicken lollipop, and other items we tried were all flavorful and well-prepared.\n\nIf you’re in Queens and want to try something a little different while still feeling welcomed and at home, I highly recommend giving Mehman a visit."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cmFsWnZOMDF6V0RWSmRYTTRVR2h6VFdOa1RtYxAB",
            "text": "Their food and hospitality stays unmatched! The chicken lollipop is so delicious as well as the butter chicken. Can’t recommend this place enough!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfajlxdzdBRRAB",
            "text": "very good food, loved every single dish, already went to this restaurant almost every night, has become one of my favorite restaurants!\nthe service is excellent, the owners are super nice and welcoming.\nthe presentation of the food is also excellent!\nwill be going again, we almost always have dinner there everyday since it opened."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJck5YZEtBEAE",
            "text": "I am pleasantly surprised with the taste of the food here. Menu is not so different from other places around here but all the foods are freshly made after order. First we had papad on the house with delicious green chutney. Some food has a little twist on taste like chicken chaat which was tangy-sweet-hot , simply tasty. Tarka daal was fresh and really tasty and complemented the kalaa vuna which melted into our mouth. The owner Mr.Rimon is really a friendly and nice person answering my hundreds of questions patiently and explaining his food enthusiastically. My only concern- can you keep this up in the long run? Food quantity could be increased a little. Best of luck."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaTltbXd3RRAB",
            "text": "Great food! Everything is made fresh to order with no microwaves, and you can really tell!\n\nThe lollipop chicken was super crispy and sooooo flavorful (absolute standouttt), chicken samosa were filled to the brim with meat and just the right amount of spices, and the the shashlik chicken came out sizzling hot and juicyyy. I had everything with garlic naan which was ofc fresh. oh and mango lassi was creamy and thick as it should be!\n\nA must visit bc you can really tell the restaurant knows what its doing and CARES about the food its cooking! Great vibes, aesthetics, and hosts. Highly recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3LWFUbDlnRRAB",
            "text": "Everything I have tried from here has been incredible and the owners are great people. I would especially recommend the lollipop chicken as it is STELLAR. Super flavorful, amazing texture and large sized pieces. THE BEST lollipop chicken I have ever had!! Some other standout dishes I have tried are the beef tihari and chicken roast."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBOGVPM2NBEAE",
            "text": "Had their naga wings and butter chicken naan. So far they were one of the best I had in a long time. In this place they cook the food after you order, so you are getting freshly cooked halal food which is a  rarity in the area.\nFinally this is a unique gastronomical experience in Hillside, Jamaica’s culinary scene.\nCan’t wait to try their other freshly made mouth watering menus items.\nUpdate:\nWent for the naga wings and chicken lollipop. They are a must have🤤"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMHNyM0JBEAE",
            "text": "Food Lovers!*\nI recently had the pleasure of dining at Mehman Restaurant in Jamaica.   From the moment we stepped inside, we were greeted with warm smiles and a cozy atmosphere that immediately made us feel at home. We can't wait to go back and try more of their delicious dishes! 😋"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCMFluUXdkbXMyWDNBNWJsOTRVMHBqZVhsNlkyYxAB",
            "text": "If you are looking for an authentic Motka Goat Biriyani then this is the place to go.\nCheck out and thank me later. Too good food"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndmVTanpnRRAB",
            "text": "The atmosphere is very welcoming. Food is delicious. You guys have to check it out and let the food speak for it self."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ST1JXSm1iMWQ0WTFBMU9YZGhTVE41ZFU1TlEwRRAB",
            "text": "I have been there 3 times and the food is very good. The food is fresh, the prices are very good, and the atmosphere is nice. It is very clean and the calm music at a low volume is nice. It also seems to be a place where a lot of friends like to hang out so it is nice. I am personally pescatarian, so the only thing I would say I personally wish is I wished there were more fish and vegetarian options, but I do know most of the community eats meat. This place is the real deal and very delicious."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURndEpfU0Z3EAE",
            "text": "I try Matka biriyani today  i like it, so yammy.. The Beef amount was so good 10 to 12 peace beef for 1 person was enough i think..  ❤️🤤🤤.  And also Customer service (10/10)..,❤️  Dinning Are so clean..."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCaFNFbFdaRGswYjFVdFYxQm9OMkZXTkVweFRGRRAB",
            "text": "So far I tried 30% items of their menu and I must admit they're the best!!!\n\nTried some other restaurants in this area and none can beat the taste of this restaurant fr!\n\nBest wishes to the owners."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfa3BDT2xRRRAB",
            "text": "MEHMAN foods are amazing, Specially their Chicken Lolipop, Butter Chicken with Naan Bread, Sizling kabab platter etc. You should bring your family and friends to try their food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeTdybGNnEAE",
            "text": "Amazing food and this is coming from a foodie. Very very different tasting must try if you are Jamaica Queens."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBXzhqSVJ3EAE",
            "text": "Went to eat khichuri there but they don’t have it. They didn’t want us to return and they made khichuri for us and served ua within 30 mins. Great great respect and service. The taste of the khichuri was delicious and really amazing. I will recommend all to go there and enjoy the foods."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VQWDI1NHZTbEtLTWp3RRAB",
            "text": "First of all, I'd like to say, this is the best beef biryani i've had in the Jamaica/hollis area !!! HANDS DOWN !!!\nWith that being said, and you and others may not agree with me but  I'm giving my very honest review of what I have ordered and eaten. All takeout as I've never had a sit down experience here.\nMotka Beef biriyani,  Aaaa+++++Tender meat,  incredible... flavor explosion. I have raved to everyone about and will not stop.\nI ordered last week and got the beef biryani and lollipop chicken and a cheese naan. The Naan came plain but I couldn't be bothered so late in the night to get a replacement, as it was a grubhub order.\nI didn't care for the chicken lollipop so didnt reorder  it tasted more like sweet and sour chicken with a weird sauce  and not crispy at all. I did not eat it.  I left it for the next day and I still could not eat it taste was just too different and strange.\nToday I ordered beef biryani  which was amazing as usual and I decided to get the roast  chicken  for lunch which was a heavy disappointment... The flavor itself was nice, but the chicken was hard dry and stringy almost as if it was deep fried or something and then baked. The rice was so undercooked and dry that it was scattered and  would not even absorb the sauce from the chicken.No flavor to the rice, just some fried onions scattered on top.(yummy sauce)  i had to make rice at home defeating the purpose of takeout.\nI also ordered  the tadka dhall which was the biggest disappointment...no tadka ...no onions, no garlic, no jeera nothing. Just raw tasting boiled dhal with cilantro sprinkled . Waste of time and  money  to order..lesson learned .\nThe mango lassi was basic nothing special. I honestly expected like a more fresher mango taste based on customer reviews.\nI know I would like to give this restaurant another chance because they are fairly new.\nI'll definitely keep ordering the biryani.But I doubt I will be ordering anything else. So much can be improved. Your cooks/chef  need to eat at every restaurant around the area and level up ....there is so much promise here.(premium dhall and chal has the best roast  chicken  in the area)\nSuggesting also  .... when you're doing takeout especially, don't forget the customer is paying tons of fees like service fees, tip to drivers, and delivery fees to suppprt your business.. At least give them the respect to send  what they paid for and ensure its  correct and complete as advertised.  Make it worth the while especially with  the long wait for delivery.\nYou would do the same for someone sitting inside of the restaurant so put the same effort into takeout and you will  shine.\nBest of luck to you guys !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTWIyMXBSbFZNYkU1SVFtNXRiakIxUzE5b05WRRAB",
            "text": "Everything is  good. The customer service is really nice. We tried the motka biryani and karahi chicken. The food is really tasty."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKRWNVaGtaRzVwUzFWSU0yVmpkRVJPTVVJNU1WRRAB",
            "text": "Had a first visit. Everything was really good. More than I expected.\nSorry for empty motka. I couldn't wait to finish it!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMVJXdHlTR2RmVFZKSVpVVTFObkozVmxCcmJYYxAB",
            "text": "Karahi best one delicious food.and the plain naan also better then other stores."
        }
    ],
    "reviews_count": 64
}