{
    "name": "Homemade Taqueria Kew Gardens",
    "place_id": "ChIJ12nu9M9hwokRsESTBWioPQ4",
    "grid": "QN8",
    "address": "80-60 Lefferts Blvd, Kew Gardens, NY 11415, USA",
    "rating": 4,
    "user_ratings_total": 239,
    "phone_number": "(718) 480-1565",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdWFsSXRVV1ptWkRSVlZuVTBObGRzYWtWSU1rRRAB",
            "text": "Came in super hungry from a workout. Saw the place was kinda busy, but decided to stay because at least that would mean the food would be fresh. I was wrong.\n\nI ordered the birria platillo, and everything on the plate was room-temperature. Plus I could tell the rice wasn't fresh because it had a big clump in it. I choked down my lukewarm birria, which I couldn't even finish because birria is really only good when hot/warm, and paid $18 for the disappointing meal.\n\nI could have gotten Taco Bell for half the price and been way less disappointed, which is exactly what I will do next time because I won't be coming here again."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twTGNXRjNkRWRXVW5WQ05VSnNkbFJUTkZkeE0wRRAB",
            "text": "Fresh and on time"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wcFJHVm5RVmMzZURScGVYcDVTVzl5TlhWb1dHYxAB",
            "text": "Quick delivery .. but terrible burrito and nachos. I recommend nearby Fresh Tortillas instead."
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbFA2Zk13EAE",
            "text": "Great food and service!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoLXByS1JBEAE",
            "text": "Their Chicken Tortas are awesome!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BelZIUTBUSE10T0ZOTlMwYzBRbE5KYlY5UlJHYxAB",
            "text": "after waiting for about 35 dam minutes for 1 burrito i had high expectations, but boy was i disappointed, it felt like the burrito was pure lettuce and midway through eating it i realize that there are pieces of meat undercooked ended up puking the rest of what i ate. I will NOT be coming back to eat here"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsbFJVOURkQzAxUVhGME1FRkZZa1l4UVRKM1kzYxAB",
            "text": "The open taco was soo good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSbWFWWk5hMkpTWkc5VE5uTnNjbmxaVERkM1lVRRAB",
            "text": "I love this place!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5eWVFZDFOVEpwZW01V1RXRkJabVV6Ukdac1duYxAB",
            "text": "they're good enough.\n.\nit feels authentic enough, and their tacos look good.\n.\nthe tacos are a bit dry though, but that was easily supplemented with their sauce and limes (you'll need them).\n.\nthe staff are chill enough and the food does take a bit of time to be ready."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWWMwRnZVVUpDTTJGVlUwNVpOWFptT1VzelpGRRAB",
            "text": "Amazing as always.. but don’t understand why I can’t order delivery when I place my order.. you guys are only 2 blocks away the second time this happens"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGaVJIbDJMVWx1YjI5V2NYWnNTRmx1WXpoNFpsRRAB",
            "text": "When there for the first time and this place is amazing, Super clean The people are awesome and the food is great.i recommended  100%"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dFQwWk9RM0IxVGtVNFRUbDNSR013Vm1kNU9IYxAB",
            "text": "I absolutely love this place! The food is delicious and affordable. Download the app—it makes ordering food so easy without the up charge of apps like Uber Eats and DoorDash. Also, the rewards programs is very generous. Every few orders we qualify for a free meal—it’s unparalleled."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjeWRGRkhaM2hhWlhOWE16TTJhbWxZVlVWT09HYxAB",
            "text": "I ordered via grub hub for the first time the steak tacos with onion it was so oily and taste like old oil and soggy also I finished it but it keep running through my system horrible"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkNE0wbHBPRTh0YldoVFdHeFZPSGhLVW5KSk5sRRAB",
            "text": "Genuinely the nicest staff and the food is delicious, steak tacos were on point. The manager was super accommodating"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGa2VsTTBVbWc1VGtKcVdGcHhUVlkyY21STVJFRRAB",
            "text": "I ordered it with uber eats and it was worst than trash. I spent a lot of money throwing my food in  the garbage. YOU HAVE TO IMPROVE! I BELIEVE IN YOU BUT NOW YOU ARE AWFUL! bye bye"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aWGFFVjBkVXBVTFMxRE4wdHlPREJ0VVdoT1FsRRAB",
            "text": "Had the Al Pastor burrito and thought it was very very good for the price. Tender meat and pleasant sweetness from the pineapple. Lots of sauces and chips to accompany. Service was a little slow and people around me seemed to be a little frustrated with how long their food was taking but my experience was pretty solid."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VONzR3c2VBN2VmWE5BEAE",
            "text": "Great good, great service! Really appreciate the staff’s kindness and down to earth vibe."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VOYmI2Tm12c2VEanRBRRAB",
            "text": "Guys, it’s a quesadilla. The simplest, most beautiful combination of cheese and tortilla. How do you mess it up that badly? Is the chef Mexican? Please tell them to stop using SO MUCH OIL. I say that with love for traditional Mexican cuisine. This is just so awful.\n\nBoth of my quesadillas are sopping wet, and I ate it within 5 minutes of taking it home. There’s maybe a salads worth of peppers and veggies packed in there, so I can’t taste the cheese at all. Just revisit the basics."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPWHF2X0xwMlA3OXJRRRAB",
            "text": "I usually get take out from here, but they’ve expanded their dining area nicely. The combo meals are pretty good and affordable. Staff has always been accommodating and friendly."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPcTg0UGlON1lISTd3RRAB",
            "text": "Several times have received spoiled empanada."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbC1DaXJnRRAB",
            "text": "I was here yesterday with my friend and the food was amazing! The waitress was also very nice and understanding😊"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcjgyV1J3EAE",
            "text": "Estaba super rica la comida. Ordene un burrito de alpastor con guacamole y una horchata."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJekp6b3pnRRAB",
            "text": "We hadn't visited since they expanded into the space next door on the corner. Prior to that there was like no room to sit. It's such a nice little place and if you like Mexican food/ tacos, it's a great place. The atmosphere is a little sterile. It doesn't yet have a personality per se. Food is great. I had a dish which had three different fillings, steak, shrimp and chicken. It was delicious.\nA great alternative to any of the other places in town."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3Z3J6dl93RRAB",
            "text": "The food is so good, big portions and inexpensive.  A little gem in Kew."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNk5tZE9BEAE",
            "text": "The customer service is terrible I would not order from here"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1d2N2RWNBEAE",
            "text": "Updating: we ordered nachos. They gave us tortillas covered in cheese. It’s a tortilla pizza with 12 pieces. Not worth the money. What a waste. I want my $$ back. 😒 I just called to speak with a manager. They weren’t there. I asked the young lady who answered the phone when they would be there and she mumbled “I don’t know” with an attitude. This is at 9:10pm on 2/21/25. I said I wanted my money back; she hung up on me. Unreal.\n\nI want to add that I edited this review down from 5 stars to 1 star. My first experience more than 2 years ago was good. I don’t know what happened but I don’t recommend them in 2025."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfamVETVFREAE",
            "text": "busura de comida don’t come here - rosmeri"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmcFoyMUhnEAE",
            "text": "It's real weak the taco birrias come with Consume but not the quesadilla. I've lived here for years, and now the quesadillas stopped coming with consume??\n\nCan't tell if they forgot or started getting cheap about it.\n\nI'll leave it at that."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNGVydHVBRRAB",
            "text": "Still waiting to pick up. Over 30 minutes late, so far. I found a few items on the receipt that I also didn't order. I had to have that corrected.\nAt this rate, I don't care how it tastes, not worth the headache. Appears to be one line cook trying to prepare for the entire place. Ridiculous.\nAlso, even though just picking up an order, they try to slip in a 20% tip.\nPlenty way better!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmenBQYl9BRRAB",
            "text": "Tried promotional meals for my family of 4 and we all agreed everything was dry and flavorfuless except the Augas Frescas - 'Jamaica'. The green sauce was so spicy and didn't even help the food. About $50 wasted!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2NDdhZmt3RRAB",
            "text": "Service was fast and friendly. Taco's came out piping hot. Would recommend."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2LUt1azJnRRAB",
            "text": "Been going here for over 2 years to get the chicken torta. Great sandwitch my favorite on the menu. Never have any issues with service or staff."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQOWZXbWZnEAE",
            "text": "Delicious enchiladas, and tacos! Horchata was a huge size! Friendly workers and very cute atmosphere!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQbHFHOE13EAE",
            "text": "My family dined in today and loved everything we got, especially the spicy pork taco. It was flavorful and had a great char. They have great portions and love the expanded dining room. Definitely recommend!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzeGRPLWV3EAE",
            "text": "Recommend"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzN1BpS1NnEAE",
            "text": "Wow I was very impressed by the quality of the service and food!\n\nThe burrito was delicious and FRESH. Like it was actually delicious which is so rare for these mom and pop style places. It was authentic and they made it perfectly. And the sauce was actually home made and unique to this place. Also the chips they included is actually very tasty because u can taste that it was deep fried by them. Its not generic salsa chips."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdzdfcXJnRRAB",
            "text": "I spend almost $50 for 2 burritos and a small plate of rice and they wouldn’t give me sauce. The girl working was adamant on charging me an extra dollar per sauce for my burritos. SMH I was shocked. I would like to have a conversation with their management."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzemNTaGVnEAE",
            "text": "Keepin it real out here in Kew Gardens\nGot these thru my app cause it was giving me discount. I usually go to more mom and pop spots for tacos but have frequent this chain for some time. Friendly cashier, tacos are good, not the best i've had this particular time but I still devoured 3 tacos in 5 mins"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYNXJ2bE1BEAE",
            "text": "My spouse and I have order twice from there and and each times the food has been absolutely amazing. Large portions and just delicious"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpbHRUcTZRRRAB",
            "text": "I gave this place another try and decided to change my review. Tacos and nachos have not disappointed!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5Z0xxUzBBRRAB",
            "text": "The food is good. I had the chicken torta, and the jalapeños in there gave it a good amount of spice.\nThe chicken nachos were very flavorful!  The chicken empanada for $3.25 could've been a bigger size it was like a mini bite size."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsMC1PRFB3EAE",
            "text": "An amazing place for Mexican classics!\n\nTheir birria items are incredible. Juicy, cheesy, meaty, crunchy. Each bite delivers a blast of flavor.\n\nTorta was fantastic. Packed with amazingly fresh and tasty ingredients.\n\nThe food here really soothed my soul. Would recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaOE1xY1ZREAE",
            "text": "Ordered on Grubhub and the order was incorrect. We were missing three tacos (someone's entire meal). When we called to explain what happened, they actually asked for the wrong order to be returned back to them!!!!! Omg, are they going to re-serve them to someone else?!? Vile! To top it off, the food we did get was not impressive at all!!!! Very greasy and tasteless."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHbDUzVjlRRRAB",
            "text": "Generally this food is amazing, me and my friends happened to stumble upon this place cause we were hungry and were around Kew gardens. I've never eaten authentic Mexican food in my life and this happens to be the first time, so to eat from…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKcnFudFdBEAE",
            "text": "This is my 2nd time ordering from here. Reasonable price for the food you're getting. I ordered the combo and birreria taco and it never failed me. Customer service is wonderful. Also, parking is a hassle, so I recommend ordering online or through the phone so the process can be as speedy."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDeDdIcHFBRRAB",
            "text": "Love this new addition to the neighborhood. Homemade Taqueria serves mainly authentic Mexican food.\n\nDo order their Horchata drink. They are light, refreshing, and delicious. Not overly sweet.\n\nI got steak & mushroom burrito as well as a chicken & steak nacho. Both are delicious and nicely portioned. Definitely will be back for more of this amazing food!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTNXJ5MFRnEAE",
            "text": "This has been a great addition to the neighborhood! They have some really tasty food and gives a new variety to the usual burger and pizza deal in the area.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtaWJXV2xnRRAB",
            "text": "I Got Lucky!!\nI was driving by, saw the place, went in and It was worth it ! The staff is so nice, the place is clean, and the Food was Great!  Really tasty and fresh. Writting this makes me want to go back tomorrow! No Joke!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbXAtRUR3EAE",
            "text": "Worst nachos ever. How dare they calle theses nachos and the salsa tasted old and disgusting. To top it off the cream was bubbly which usually means it's gone bad."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudjk3dEtnEAE",
            "text": "Do not waste your time here. This sign display combos which differ from the combos they actually offer inside. I ordered a steak quesadilla combo 1 with chicken empanadas and the waitress brought out two tacos and a tostada??? when i questioned her she laughed and said that i didnt order the SPECIAL combo. such stupid advertising. wasted my lunch break"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhenV2dHNnRRAB",
            "text": "Delicious authentic Mexican food at this little place in Kew gardens, the prices are fair, the horchata drink is a must try. The Birria tacos are good too, it's hard to find good birria in NYC"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHX3N5akR3EAE",
            "text": "Their Birria tacos are as good if not better than Birria-Landia in Jackson Heights. Their tostadas are also really good. Take out service is a bit slow since they make the food to order so call ahead."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyMjhLV0J3EAE",
            "text": "I’m obsessed with this place. The portion sizes are pretty awesome for the price, the food is super fresh and super tasty. I will definitely come back. I hope soñar they Can get a bigger location."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5eGUyR2JnEAE",
            "text": "Almost THEE BEST tacos (second only because Tacos No. 1 also exists) this side of Texas. We will be coming back again and again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuaXJqbjVnRRAB",
            "text": "The food here is absolutely delicious and the service is remarkable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiMXZhY1NnEAE",
            "text": "Strangely I didn't take pictures of my food and this was my mistake. I got the steak quesadilla and 2 empanadas (1 chicken & 1 cheese). Everything was super delicious! They were all stuffed real good, tasty, juicy, and filling. The green salsa was perfect as well, not overwhelming, not spicy, just right. I will definitely be back soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNk42ZjNRRRAB",
            "text": "I bought a chicken burrito to go. This was actually not my first time eating this particular meal from there. The food is actually good HOWEVER … when I opened up the container.. the burrito was so wet and soggy and the chips were almost getting soft as a whole lot of liquid was coming from the burrito. The tortilla came apart and it was just so messy and wet to eat. I’m not sure if the liquid was from the chicken or the beans … it was more like a gravy color so I’m thinking it’s the chicken. Burritos are usually in tact and not wet and soggy so they need to work on that!!!!"
        }
    ],
    "reviews_count": 57
}