{
    "name": "Taste Of The Town Diner",
    "place_id": "ChIJvd6me65gwokRO1Owb5zRHLU",
    "grid": "QN8",
    "address": "120-21 Jamaica Ave, Richmond Hill, NY 11418, USA",
    "rating": 4.6,
    "user_ratings_total": 38,
    "phone_number": "(718) 850-8862",
    "reviews": [
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toaFZYaFhhbTV0U25VMlkyOWpUR05aYzFwR1pVRRAB",
            "text": "I started coming here with my girl and I absolutely love the food it’s so cheap we used to go to classic dinners and we would end up spending like 60-70 lol so we come here it’s like 30$ JUST COME HERE GOOD EATS AND CHEAP"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPelp6cjNvd0pyNXNRRRAB",
            "text": "Love the bacon cheeseburger,, fries, and coffee here. Great little hidden gem."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvZy1yWlJBEAE",
            "text": "This hole in the wall diner is amazing. I knew it was gonna be good when I walked in. The lady at the counter said, \"You want coffee,\" instead of \"Hello, welcome to...\" Please don't sleep on this place. It's not much to look at, but it's really good and cheap food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNTZUVmJBEAE",
            "text": "I’ve been eating here since I was 8 years old. Im 24 now and the food is still amazing, with the best prices around town. Hopefully Manny and the Mrs hold this place down for a long time, a diner for the people indeed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubU5UZzRRRRAB",
            "text": "I used to come here years ago as a kid. The burgers were always fresh. I was around the area and decided to stop in for a burger, only to realize their burgers are now not fresh but frozen.\nFresh vs frozen makes a BIG difference."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5OWVfbUdBEAE",
            "text": "Excelente 👌 lugar 100% recomendado sabor espectacular y megaaaaa delicioso 😋.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROdUltRmpnRRAB",
            "text": "Excellent breakfast, their prices are even better & Manny he’s the best! Nice and cozy for a cute date ♥️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNadllmWDh3RRAB",
            "text": "Manny the owner/cook has been here for a long time and I’ve been getting breakfast and lunch here for over 10 years. Well-made food at excellent prices. Place is a bit cramped and paper plates and plastic tableware but saves money not having to pay for a dishwasher, and that savings gets passed to the customer. Also literally steps from the subway entrance for extra convenience."
        },
        {
            "date": "수정일: 2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLcHY3NzVBRRAB",
            "text": "Muy buenas Amburguezas"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1aHBHOElBEAE",
            "text": "Classic little diner, I grew up eating here, food has always been great. Appearance may not be the best but the food makes up for it"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyMWNYRzJBRRAB",
            "text": "Good place to grab a quick bite.!! Gets a little busy sometimes, but portions are worth the wait."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtdE9uYWF3EAE",
            "text": "Always good"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHdE56MU5nEAE",
            "text": "Where is JOSÉ!!!!!😡…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHMkpXLU5BEAE",
            "text": "This is a small business own diner that is very affordable.  It's one that takes you back to your childhood or youth when many of these places were plentiful in NYC.  Almost every neighborhood had one or two outside of a regular larger diner.  They offer simple basic comfort food.  Open for breakfast and lunch, but I don't think it's open for dinner, b/c I seen it closed at that time.  Their service is friendly and pretty accurate. You get what you ordered.  The food is, as I said, simple, decent and very affordable. Yet, it does need a makeover as far as appearance.  You can still see dated signs above, old stools and counter-top.  But, I wouldn't prejudge b/c the food here is better than your fast-food stops."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2LTRLU1B3EAE",
            "text": "i know this place for more than 30 years this is one of my favorites."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2d29peXVRRRAB",
            "text": "The chicken cutlet sandwich is bangin."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2aTlTNGRBEAE",
            "text": "I have a storage unit at CubeSmart which is just down the street on 121st. My wife and I walk down to just double check some stuff double check it and we're going to go someplace to eat. They're across the street on the north side of Jamaica avenue so we decided to stop there. Walk them sat down in a little booth there are counter stools and a couple of little areas to eat or a set of tables. We got menus from the woman behind the counter and once we decided what we wanted to eat we try to get her attention. Eventually we got her attention and she said oh and pointed in the back and said to sell the person will take care of us. Is that other person a woman would come up and pick things up in our area and then bring them in the back. The people in the back seem to have her attention. We stayed for another 17 minutes and never even put an order in. Not the best experience in the world. I wouldn't recommend this place to anyone."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhZ3UyMUlnEAE",
            "text": "Very nice staff and delicious breakfast items!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5ay1qZ2tBRRAB",
            "text": "Very good cheese burger very good meat fries were perfect at 7:00 in the morning can't go wrong 9.75 with BACON"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLMGMtSnZ3RRAB",
            "text": "Best Gyros around"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5OTVuSmd3RRAB",
            "text": "Quick and great service"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5eHQtc3VBRRAB",
            "text": "I come here as much as I can.  Support local business"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTM2ZHRkZ3EAE",
            "text": "Great good"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjNnA3V2d3RRAB",
            "text": "I loveeeeee this place!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNdEtQX0VBEAE",
            "text": "Great food and triple AAA sevice love it"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwejZLMllBEAE",
            "text": "Ok"
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvNjdMX0lnEAE",
            "text": "Este lugar es un lugar de emergencias porque solo de bajas del tren J y enseguida puedes calentarte con un té o café caliente y unas tostaditas o pastelitos o otras Repostería que el lugar ofrece es un lugar tranquilo y lo atienden rapido ."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvcUtPTHdnRRAB",
            "text": "Pretty decent cafe for the morning"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJaUstTS1RRRAB",
            "text": "The grease been coming here since I was a kid  I’m 26 now still come here food always fresh and tasty"
        }
    ],
    "reviews_count": 29
}