{
    "name": "Village Diner",
    "place_id": "ChIJg_4XuaRgwokR8xGVL_DP8co",
    "grid": "QN8",
    "address": "81-74 Lefferts Blvd, Kew Gardens, NY 11415, USA",
    "rating": 4.1,
    "user_ratings_total": 528,
    "phone_number": "(718) 850-3787",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NGJHNWFlbFZyTVZwS1luTnBPVTVXUkdsaVIwRRAB",
            "text": "Service is friendly and welcoming. Food is okay a little pricey."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taMVozaEllbFZDWVZGVk5sOVRYemhPV25neVJsRRAB",
            "text": "Paid $6 for this. Damm Shame, waffle was trash too."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prdGVFSlZkR05pVm05UWNtZHlaRkZJZDJkSU5GRRAB",
            "text": "Had breakfast this morning.. new management place looks amazing!!! 😻"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVlNIUlViWGw0VVhObmRtUlZjVVE0VnpORWNWRRAB",
            "text": "Very tasty food and excellent service. We’ll definitely be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOT1ZqRlljek52TFV4R2VqTkRaWFJqY2poUVpFRRAB",
            "text": "Fluffy pancakes, quality meats, friendly service, and they aren't stingy with the butter. 😁"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfcExXVVpBEAE",
            "text": "Delicious food, and the new owners are super friendly. I come here regularly.\nSo far I’ve tried the Croissant french toast, Blackened chicken panini, Patty melt, Char-grilled veggie salad.\nI tried my cousins onion ring fries and they were so yummy! (I usually don’t like onion rings) they were crispy and with lots of flavor\n\nThey updates their coffee, the new coffee is delicious, I would highly recommend it ☕️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSbE9FaEZiSFZmTFhSUlUyTnlNbXd0TWt4MVdVRRAB",
            "text": "Super recommendable!!!   Attended by the whole owners family.  Great food and ambience.\nA gem in Kew Gardens!!!!\nA must place to go"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ORk5WSlFkRTFGTVVWalVGUjVaR3d4TkcxTU5XYxAB",
            "text": "One of the best diners I’ve ever been, the owner Rosa is amazing. Actually all the people working at this diner have been so welcoming and great.\nThank you for the wonderful brunch.\nCan wait to be back soon."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMFkyUm9iQzFWTVV0dlYxVXRNVTFpYVhsSFMzYxAB",
            "text": "Stay away from this diner as it serves nothing but frozen foods.The has a terrible attitude. The food and service is the worse.\nWould not recommend to my worst enemy."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNReWNPUkZBEAE",
            "text": "It's a diner! It's not a Michelin five-star restaurant. It has diner food and very good diner food. It has comfort food.\nIt's a good place to go. Hell of a meal, and the portions are are big.\nIt's not pretentious. It's just good solid food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oWWRtWkxSRmhTYWpCMVJIWkpZVk5SVVRObWVtYxAB",
            "text": "Great place. We are never rushed and I think the food is good and prices are very fair"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKU1ZWUm5SbU5OVGxsbVlqRnpaMGhPWlRGVE5VRRAB",
            "text": "Improved significantly. The diner went from local dive to a great place for diner with a large group. Service is wonderful and friendly. They are still modifying things from previous to new management.  Can't wait to see what comes next."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJYkx6Sy1lNGZlUDNBRRAB",
            "text": "Great place for a home cooked meal. Gracious staff."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205aFpWTlBVRzVvTVRZeFdtUlhkRzE0WjJaTFEwRRAB",
            "text": "Salmon was delicious and generous servings."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLbjdfY21DbTcyT0NnEAE",
            "text": "Great place for a quick bite. Amazing number of great tasting options."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNT2Vvb1BDck82Nnd3RRAB",
            "text": "Fantastic! I was in the area and stopped in for a meal. The owner and all of the employees were so kind. The food was great. I had an omelette and it was great. Huge portion and also very tasty. They accommodated my food allergy to onions and made the home fries without them, which was awesome. Will definitely be coming back when I’m in the area, and also will start ordering on Uber eats!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VNVFRtTWJHd1BHZ3FnRRAB",
            "text": "Had foor delivered. Eggs and potatoes.. extremely dry.  It wasn't made with love."
        },
        {
            "date": "6달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTURvMC1oTxAB",
            "text": "Tutto molto buono, colazione salata ottima, personale gentilissimo e gioviale! Ci tornerò!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdmV5NkRnEAE",
            "text": "Solid diner food with good prices!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvajhPdFVBEAE",
            "text": "I have been eating at the Village Dinner since I moved to the area in 2022.  The prior owner was not very friendly, but it was close to home.  The Dinner currently has a new owner.  They are making changes to the appearance of the Dinner.  Rosa the owner along with her two sons are very friendly.  The staff is very accommodating and I find that very helpful."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdGJuaUtnEAE",
            "text": "Great vibe family owned.\nExcellent choices.\nA place to sit clean.\nDecent amount and good prices."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbGJmUjN3RRAB",
            "text": "Great diner! First time there and food was delicious! Went for breakfast and we got an omelete dish and a french toast dish, and both were pretty solid!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTUR3dEt0ZhAB",
            "text": "Very nice people."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3a05uTlR3EAE",
            "text": "Good place to get food for good prices. Classic diner food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNzdXX2lBRRAB",
            "text": "Delicious breakfast delivered every time we order from here!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbF9MT3FnRRAB",
            "text": "Ordered Village burger well done fries,two ice coffee.Delivered burger tasted nasty no ketchup."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdFliLXpnRRAB",
            "text": "Great food and service, the servers are great love coming here w my mom and grandma 💕"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbWJYcDhRRRAB",
            "text": "Came here a couple years ago, roach was crawling on our table. We left and haven't been back. Then jan 22,2025, we gave it another try. We'll 1st of all no free refills on coffee and then don't mention theres no free refills. Plus after we ate there was a big roach in the ladies room. My wife told the waitress and like nothing, was just another day to them I guess. Keep away from here. No wonder there's no grading on their window. Beware if you eat from there. After this I will tell everyone I know, not to go in there at all. KEEP AWAY FROM HERE"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbWVITXlnRRAB",
            "text": "This is a real New York diner. There are so few of these places left that just serve an honest menu full of comfort food cooked with care. You're getting the same syrup in a cup anywhere you go so it's the vibe and the people that make all the difference. The people who were there seemed to all know the folks behind the counter. I don't live in the neighborhood  butI hope this place stays open forever."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdUtyUzhBRRAB",
            "text": "Lovely diner experience. Food was good, exactly what you’d expect from a diner, but our waiter Kevin was SUPER friendly and made our experience even better. Definitely recommend! Clean and chill environment."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNXB1TDhBRRAB",
            "text": "like any diner, its not the cleanest and the food is oily. but the food is still really good and the staff is very nice. the place is small so big groups not recommended if you ask me. also parking here is an issue. but again the food is great and its not expensive. This is my favorite diner in the area, so all in all i would recommend this place. definitely worth giving it a try if your in the area or if you're new and looking for that local diner spot."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBeE1uQ3pnRRAB",
            "text": "Good service,  food is ok.."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNWVEbDB3RRAB",
            "text": "Good fresh food great people  and great service! I enjoyed the hospitality! Totally recommend it!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2djdLbWZREAE",
            "text": "I hate to even have to do this as we need to keep some kind of neighborhood diner, but this is just unacceptable.\n\nI ordered the Chicken Marsala over Linguini. What I recieved is, well, I don't even know what this is. It seems to be chunks of chicken in some kind of tomato/onion sauce over spaghetti.\n\nI understand this diner is under new ownership. But, if you're going to keep the same menu, the least you can do is actually learn how to make the items on said menu. There was absolutely no hint whatsoever of Marsala wine in this dish, and as previously stated, it's clearly some kind of tomato sauce with tomatoes, onions, and mushrooms. I don't want to say that I'll never order from them ever again, but I will wait for quite some time in the hopes that they learn how to make the dishes correctly."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmOTRxaW93RRAB",
            "text": "Great food will come back again for breakfast!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmZ2FTRmRnEAE",
            "text": "If you’re looking for a spot with fresh, delicious food, this is it. The menu has so many good options, it was hard to choose! Everything we ordered was super tasty, and the service was on point. The vibe is perfect for a relaxed family meal or catching up with friends. The staff really know how to make you feel welcome, and you can tell they care about the quality of what they’re serving."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmLTVHZ29BRRAB",
            "text": "Good food and fast service"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmek9Tek1REAE",
            "text": "Found a piece of lettuce and bacon in my waffle and fried chicken. i found the waiters to be very accommodating as should the food but I found the very satisfaction of wanting waffle and chicken unappetizing and dry.ordered a cup of fruit. rotten from top to bottom. least appetizing meal I have ever had. thank you for reading my review."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQZ3BMQTdRRRAB",
            "text": "Great service and great food"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2M0lmSG5nRRAB",
            "text": "Went for Thanksgiving dinner good food reasonable price. Should stop using garlic bagels and make regular sweet potato next time"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuc1p5N0NBEAE",
            "text": "I love trying new places to eat so this was no different. Ordered scrambled eggs with three meats and toast. The breakfast was excellent and cooked how I had requested. Also ordered iced coffee which was good, not strong but had a fresh taste. What made me give this place the 4 stars is the cake we ordered, the tiramisu was stale and had an old taste to it, did not enjoy it, my partner’s cheesecake wasn’t terrible but wasn’t the best, at $6.50 a slice this knocked this eatery’s stat one star down.  The place was busy being it was Sunday morning and we never got water service until we had to ask for water, not a huge deal. Place is comfortable and love the seating arrangements which are booths which offer privacy. Overall food seems tasty here but stay away from the cakes or have the cake and mention it to the manager if it has a stale taste."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWcHNxR0ZBEAE",
            "text": "Went here for brunch and I got the egg plate with perfectly cooked, poached eggs. I also ordered ham and was disappointed that it was sliced lunch meat however it was good. Then they offer breakfast potatoes with peppers and onions or fries so I got fries. My friend got the veggie omelet and it looked amazing. Had zucchini and squash, mushrooms, onions and peppers and it was done just right. The price was fair for New York. Coffee was good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMk9UdS13RRAB",
            "text": "We went on a Saturday, around 11am - 12pm and it was pretty packed. We did get seated right away but I think we got the last booth. The food was delicious - I got the chicken cordon Bleu panini and it was delicious! It is a bit on the plain side in terms of flavor bc there's no sauce on it but you can add your own hot sauce or ketchup on the side. Or you can just ask for a sauce on the side later when you try it. I added avocado to mine as well with fries. Fries were hot coming out which I loved. My husband got the lumberjack. He got three plain pancakes, 2 eggs, and bacon. Overall, great meal and service was quick. Also I got the fresh squeezed lemonade but if I'm honest, it didn't taste fresh squeezed but what do I know about that...really...but was on the sweeter side as opposed to sour. And my husband got a coffee which they came by to refill for free which was a bonus. Hope this helps!"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQaEtfQXFnRRAB",
            "text": "I hate that I'm even writing this, but the place has been mid at best for the years I've been a customer. It's been good in a pinch and convenient to my location. Last year, I ordered the Thanksgiving dinner, which was surprisingly good for the portion and price.  Tonight was something completely different. The turkey that came with the meal could only be described as rancid. I have never eaten feces, so I can't describe what it tastes like, but this turkey was long gone by the time it was put in my takeout bag. It stunk up my house, tasted just as bad as it smelled, to the point where not even my dog would eat it. I'm so sorry to leave this review, but it has to be said. Someone in that kitchen and in that restaurant needs to be held accountable. This experience was the nail in the coffin for me."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHbk42Zmp3RRAB",
            "text": "It’s a decent diner with decent food. I ordered a sandwich with turkey bacon, egg, and cheese and it was good. Food also came out very fast. Only issue was it wasn’t as clean. Rag they used for cleaning smelled like mildew and there were crumbs everywhere. Wished they focus more on the cleanliness."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMU1fN25BRRAB",
            "text": "Good experience! Service was great and waiter was very attentive, food came out hot and fast with really great portion sizes. I didn’t notice any issues with cleanliness so they may have stepped up their act since previous reviews. Such a large menu of items to pick from, I’ll be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoMjhPOU9REAE",
            "text": "Great food! We tried breakfast here and now it’s our regular. Cost is similar to other places in the area, yet you get such big portions in comparison. It’s great leftovers, too! I also appreciate that you can call if you don’t want to use a delivery app."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlMFB1b2NBEAE",
            "text": "Awesome spinach salad with chicken at a reasonable price for the big portion they give you! Will definitely go here again"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlbjdlc2hnRRAB",
            "text": "Estaba buena. Me hubiese gustado que estuviera más caliente, pero estaba bueno. Best toast bread ever 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYaGJDRE53EAE",
            "text": "I'm embarrassed to say but I spend about 200$ dollars a week here and I regret nothing. It started during a kitchen remodel and just persisted. Its gonna have to end at some point but I loath the day. Great food. Consistent. They remember your name. (also, more importantly, your order). They're certainly a mainstay. 👍"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpdnVLc2ZREAE",
            "text": "My first time but it won't be my last. Nice and clean. Good service and great food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUNThtTk1REAE",
            "text": "Nice young man served us...we had brunch."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNa0l1NUp3EAE",
            "text": "I rarely and I mean almost never leave 2 star. But the food was horrible. The pancakes were like rubber. The eggs were wet and slimy. I didnt put 1 because I got refunded."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5aTZPUWlRRRAB",
            "text": "I really wish I liked this place more. I’ll always support a small business and will keep coming back but the server and busser combo is painful to watch. All the tables were dirty when we walked in and somehow became dirtier as we waited for our food. Server needed to be coached through the entire meal (tableware? Check?) Every time we come it’s like watching someone on their first shift. Food is mediocre but whatever."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1dGVmR2ZREAE",
            "text": "I’ve been looking for a basic good old diner breakfast and honestly you guys are it! Everything was good"
        }
    ],
    "reviews_count": 55
}