{
    "name": "Tikka Indian Grill Kew Gardens",
    "place_id": "ChIJ_wK6OqVgwokROBENiTUYLGU",
    "grid": "QN8",
    "address": "119-30 Metropolitan Ave, Kew Gardens, NY 11415, USA",
    "rating": 4.1,
    "user_ratings_total": 591,
    "phone_number": "(718) 480-1307",
    "reviews": [
        {
            "date": "14시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1U1NWaGlNRTVLTUd0T2JWRXpWM0Z4T0hacU1IYxAB",
            "text": "Came here for lunch on Election Day, was given the menu for lunch specials and after ordering the sever says they don’t offer the lunch special on “holidays”.  Very disappointing bait and switch."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210UlQzUkpaVU4xY0ZOd2JWSTJWM0ZYV21Gc1lWRRAB",
            "text": "the food was so delicious and full of flavor. first time going there and the service was very good;  very thoughtful people working there. loved it and my family enjoyed the food!\n\nHalloween decor was a nice touch too!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TVYwNU5VR3hGY0VoT01VUlpaMVJvVGtsbGJFRRAB",
            "text": "I would like to give more than 5⭐️ because the food is delicious, I love it, the mango lassi is my favorite, wonderful place, very good prices and a lot of food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSRWQzSk1Tbkp5VlhCMGFVTnRXa1ZHZVd0cFNuYxAB",
            "text": "The atmosphere here was very modern. It was clean. The food was very flavorful and tasty. The food presentation was good. If you are looking for a good lunch/dinner spot this place is worth trying."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdUxXazBPV1poT0dkQlVWSlFXbE5JTVZsbFRGRRAB",
            "text": "I ordered Chicken Karahi with mild spice/chilli but it was like extreme 🌶️ and it totally doesn’t looks like Karahi, it’s more like Chicken Jalfrezi with bell peppers 🫑. I won’t recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRE9HZE9kVkJIU0hSRVFYa3lNVGQwWVhKbU5tYxAB",
            "text": "Food is horrible , don’t recommend this restaurant. That’s the only review can give ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nd2RXNVNkWE5PUVZFeVNuRnpjakl4Y1ZjM1lXYxAB",
            "text": "The restaurant was very clean, staff was wonderful, the ambiance is truly something unique.\n\nWe loved their integration of technology and humour. We loves the ipad menu with vivid photos, videos of the food, just wow! They have a complaint dept with a grenade which is hilarious!\n\nThe food is wonderful and halal!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOeE9FSnJlV1ZST1ZoaExWWnlUamx5UldjNFpsRRAB",
            "text": "An over priced marked up menu with no parking in the area .\nA $3.99 glass sparkling water is $8!!!!!!!\nWhen I did take  my meal home Chicken Tikka Masala it was not what I expected. And my $5 Roti was hard and stiff.\nThis just wasn't it for me not authentic indian food.\nOn top of everything there is no parking in this area I am hardly likely to return. Stars for good service with attentive waiter."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0YVZYaFNURGR4VVZSdFZUSmhUMmx5TVVKVlpWRRAB",
            "text": "The food options were wonderful and reasonable for the area. The service was excellent, albeit a little slow. Everyone at our table loved the appetizers we ordered and were also happy with their entrees. I had the Tikki Masala, which was delicious, but I could have used a bit larger portion.  Everyone else was good with their portions and had leftovers to take home. My sister talked about her meal a number of times the next day, 😆."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxeGMxZGZlR1ZhVGw5MWRGRk1ibEJZVWtZNVZrRRAB",
            "text": "Not sure why this place doesnt seem to have much eat in clientele.  Nice indoor space, great out door space. Though we never eat much the food has always been good as has service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTVUwMXZUV3B5TjJaalNGRmFTVVYxUjJKT2FVRRAB",
            "text": "I recently visited Tikka indian Grill with a small group of five, and while the food was decent, the experience left a bad taste in my mouth. They added a mandatory 20% “large party fee” to our bill, which I found excessive given that we were only five people—not exactly a “large party.” I wouldn’t have minded tipping generously if the service had been exceptional, but we weren’t even provided with a proper receipt to review the charges.\n\nTransparency is key when it comes to dining out, and this felt like an unfair cash grab. If you’re going to enforce charges like this, at least communicate clearly and give customers the ability to see what they’re paying for.\n\nUnfortunately, I won’t be returning or recommending this place to others. Dining out should feel enjoyable, not like you’re being taken advantage of."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNMm16TVR4bmJpSEhBEAE",
            "text": "Bad service    i order the food almost $50 doller\nthey send me food. when i check inside the  bag  they not put any spone or fork any napkins indide bags.\n\nIf you anybody order food u should have eat by hand 🤣"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMZnpnTXpBdi1DRXdRRRAB",
            "text": "This has become one of my \"go to\" Indian restaurants. The food is freshly prepared with tantalizing spices, delicious sauces and generous portions. Must haves are the Chicken Korma, Butter Chicken, Paneer Tikka Masala, Paneer Saag Kofta, and don't miss their specialty Rosemary Naan. There is a large vegetarian and vegan selection. The waitstaff are friendly and eager to make suggestions, the dining room is clean and they also have a large outdoor dining area."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VQTFN2dHVlakpMYi1nRRAB",
            "text": "The food is very good and tasty.  We have ordered from here many times and mostly from door dash. The problem starts whe\nyou find hair in their food and when they try to overcharge you for the same items by replacing them with the same item.\n\nI ordered the peshawari naan. Very delicious.  Problem was halfway through the meal, there was a big hair in the naan. See attached picture.\n\nI ordered a regular naan also. They replaced naan with naan and upcharged $1.50. In the same order I ordered a peshawari naan as well. They upcharged by replacing peshawari naan with peshawari naan. See attached pictures from door dash. Such Crooks!!! I contacted door dash to get the extra money back. This is a typical tactic dishonest resturants pull on 3rd party apps.\n\nFood taste good,  usually no issue. But be careful as they are not as hygienic. And they are a bunch of crooks especially if you ordered online. For a 35 dollar order they wanted to upcharge $2.5 for the same exact thing. And if your price was wrong than that is on you to fix, don't pull a bait and switch scam. Crooks and cheaters!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLdTlxTUcxcWEzRDBnRRAB",
            "text": "Their Chicken Tikka Kebab, the best ever had in Queens, NY.\nGreat Atmosphere, friendly waiters and peaceful ambience and tons of options for Chicken and Lamb."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRa0lxME1REAE",
            "text": "Quality of food was good. 😋…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPZl96WjYzNHFhMTFRRRAB",
            "text": "Everything tasted great, we had butter chicken, garlic naan and chicken tiki Marsala. Everything tasted great! Will definitely visit again 😇"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOT3ZtZmVvbWN5YnFnRRAB",
            "text": "The spice level and flavor along with the service is always great here! Thank you Cam for your hospitality"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZb2R5ZXNBRRAB",
            "text": "I have been coming here for years, love the food and the staff is very friendly."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZd1pIQ193RRAB",
            "text": "I absolutely loved the chicken korma. I have it every time I come."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbDg2aGNBEAE",
            "text": "Is a good Indian restaurant, very consistent with their food taste and good service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbDhLdW9RRRAB",
            "text": "Every time I come here the food is always amazing. The staff is so kind and gracious. One of my favorite restaurants. Can order in or out and also eat inside or outside."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveS1xb2FnEAE",
            "text": "Butter chicken amazing and very kind service with complimentary dessert."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdmJTSU9nEAE",
            "text": "Indian inspired American food - absolutely the least authentic Indian food I’ve had in the US. Everything is edible and the food is decent but I shouldn’t have to season my takeout order at home….\n\nThis restaurant is definitely catered toward Americans who aren’t used to too many seasonings or spice…. The dishes were shamefully under seasoned, surprisingly lacked salt.\n\nThe seasoning were interesting - it seems like the have a generic “curry” blend of ground seasonings that gets lightly sprinkled into each dish toward the end of cooking - instead of blooming whole spices or aromatics in the beginning of cooking and layering spices throughout for a more complex flavor in authentic Indian style cooking. Each dish seems to have the same exact seasonings, same ratio/flavor, which was really odd, and makes me believe they are using the same house or generic “curry” or a garam masala blend for everything. For example, the Rogan Josh seems to very literally be “fresh tomatoes” raw, straight out of a can, mixed with a pinch their house “seasoning” blend and not cooked/simmered at all, with no salt, so it mostly tasted like raw tomato with a hint of spices…. The Rogan Josh had the SAME exact spice flavor profile as the tikka masala, which should taste vastly different."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvemVxczNRRRAB",
            "text": "To the owner please check the quality of your food menu and bring back the old taste.\nI was using this place since 9 years, but didn’t go from Oct/2024, this time everything was change very low quality & tasteless food, I believe the management has been changed or the cook is changed I never had such food there.\nI couldn’t eat half of the meal even this time."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvemVEZzlnRRAB",
            "text": "Came in for a weekday lunch. Restaurant was very clean, staff was very friendly and helpful when asked about the food. Great vegan options! Will definitely be back"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbnFmbWJBEAE",
            "text": "The worst indian food and service I have ever had, they were very rude, especially the lady. Also, tge ripped us off by charging extra service fees. BE AWARE. I will never ever eat their again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbnNlVXV3RRAB",
            "text": "Bad service\nWoman Waiters treat us very bad\nShe was screaming to our face because she wants to go home quickly\nFood doesn’t taste good no salt no spicy\n\nHigh price\nDeserve NO STAR\n\nNot recommended"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJd0tiVjNnRRAB",
            "text": "The service was horrible! The server was on his phone the whole time watching videos! Couldn’t even get his attention to order or get a drink refill. Wanted to walk out without paying. Our food was bland too. Yuck"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3Nzh2eXV3RRAB",
            "text": "Best Indian food compared to others. Service is good and very affordable 👍\nThe Paneer is a must have"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3LVp1alhnEAE",
            "text": "Run. Disgustingly rude & bland food. There are others Indian restaurants in the area. I’ll name a few Tikki N Talk, Nabhya, Tandoori Hut, Lucky Dhaba, Definitely go there. Literally one of the worst restaurant experiences of my life. Literally the only customer in the restaurant is me. It’s completely empty. Maybe that should’ve been a sign to leave like the others who came before me . No welcome or greeting. I was asked to move to a different table after sitting down which was less comfortable in case some magical “crowds” arrived 2 hours before closing . Mine you I am the ONLY CUSTOMER THERE the entire time. I’m polite the entire experience and just watching how bad this can get. I ordered food. My server or any staff never came to ask me what I would like to order or check on me for a refill or ask if I was enjoying the food. Not once. I had to get up to ask if I could put in my order as they stood chatting at the register.\n\nThe food came and it was cold and bland.\n\nI watched the server be on his phone at register and chat extremely loudly and laughing about some video with the other restaurant staff but never checking for a drink refill or anything service related. No one even came to pick up my check. My server remained hidden the entire time or out on his phone. I could’ve walked out WITHOUT paying that’s how BAD the service was. The music was painfully loud.  If you wish to be treated subhuman for giggles then yes this is the restaurant for you!\n\nI’m a foodie, I’ve worked in the service industry and food industry for over 15 years. Never eating here again and will be telling my numerous colleges and friends who live in the area to not come either."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dkp2NVp3EAE",
            "text": "Ordered two Tikka and chicken was out of this world...juicy, fresh and delicious, just like it's supposed to be. Best Indian food in area."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ejZtdTZBRRAB",
            "text": "I have always had the best food, quality and service for my money. I have friends from abroad (London) that say the same!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3ak9lQ0dnEAE",
            "text": "Okay so the food was not good. It was very bland. Did not taste anywhere close to what Desi food should taste like. Only reason I'm giving two stars is because the staff was nice, the mango lassi was good, and the appetizers weren't bad.\n\nI would not come here again. There are waaayyy better indian food restaurants all over Brooklyn."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNFpIUkhBEAE",
            "text": "Great food goos prices decent service. Try the mango lassi!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBamMtRXdRRRAB",
            "text": "The person in the ftont Very rude and unprofessional with the nasty attitude"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBeWVxSDhnRRAB",
            "text": "I had a terrible experience at Tikka Indian Grill in Kew Gardens. The customer service was shockingly poor, with staff showing more interest in delivery drivers than actual dine-in customers. One staff member in particular, Riya, was extremely rude, unwelcoming, and unhelpful. She seemed completely uninterested in answering questions about menu items and aggressively tried to upsell dishes without even knowing much about the food. Honestly, her attitude is detrimental to the restaurant and should be addressed if they want to survive.\n\nThe food portions are ridiculously small for the price, which is sky-high compared to other Indian restaurants in the area. With bland food, poor service, and an uninviting environment, there’s absolutely nothing special about this place to justify the inflated prices. Unsurprisingly, the restaurant was practically empty even during peak lunch hours—a clear reflection of the subpar experience.\n\nWhether it’s dine-in, takeout, or delivery through apps, I highly recommend avoiding this place. Save your money and go somewhere that respects its customers and offers better value for the price."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbFlQX053EAE",
            "text": "Tried lunch special and it was delicious. Will definetly go back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmX2VPN3ZRRRAB",
            "text": "Ordered delivery, food containers arrived broken and covered in oil. Saag is suspiciously green and very oily. Lentil soup is very sweet and watery. Pakora were moist, dense, and flavorless. Raita and lassi are both good, everything else very terrible and expensive, poor value. Don't bother going in person or ordering online."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MnR5aEFnEAE",
            "text": "Very good Indian food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bC1Td2h3RRAB",
            "text": "I was craving good food, and when I saw this place, I decided to walk in. Everything was amazing! I got chicken tikka and samosa chaat, and every dish was delicious. The portions were really good! I even have leftovers for today. I was genuinely surprised by how good it was since I didn't have high expectations, especially in the kew garden area. The tikka chicken even came with rice, which was a nice touch. I'm definitely going to order from here again! The ambiance was nice. The staff, she was wonderful n kind and asked us if we needed anything. I'm definitely recommending this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyMkplU1dnEAE",
            "text": "My first time at Tikka Indian grill and am happy I stopped by. Everything was yummy including the chutneys, mango milkshake and veg kababs. The food presentation was impressive. Will return to try more. Location is great."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsOXBER3JnRRAB",
            "text": "The food at Tikka Indian Grill was a delightful burst of flavors. Each dish showcased authentic Indian spices, creating a harmonious blend that left my taste buds satisfied. The lamb curry was perfectly grilled, tender, and infused with rich spices, while the naan was soft and complemented the curries beautifully. The ambiance added to the overall experience, making it a memorable culinary journey. Highly recommend for those craving a delicious Indian feast!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2LTlqTW1RRRAB",
            "text": "I ordered DoorDash from here, and the portions were great and everything was delicious.\n\nI got the tofu mushroom jalfrezi, which was a little spicy in a good way. I also got the tarkari, which was so flavorful. Both came with good size portions of rice. To eat with them I got some roti, which was thicker than I’m used to, so it was a little difficult to use the bread to pick up the veggies.\n\nI really appreciate that the menu also had clearly labeled vegan dishes, and a variety of vegan options!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0eUtXVW9RRRAB",
            "text": "Some great dishes (lamb Tikka, samosa chaat, goat biryani, chicken chop), but also some not so great dishes (mango shrimp, pakoora). No liquor license, not even beer/wine was a bummer. Food rating would have been 4 stars instead of 3 as I consider drinks important for a meal. Didn't feel like doing BYOB. If you don't drink alcohol then it won't matter to you.\n\nService was good, no issues, other than it was odd we were a table of four in an empty restaurant and they only gave us two menus. We had to ask for two more. Also, they cleared my utensils after apps but never replaced my spoon which I had to ask for when my entre arrived - my Lamb Tikka sauce needed a spoon to serve it onto my plate.\n\nNice use of android tablets for menus, although one was at 3% battery. Is that why they only gave us two? After about a half hour other people started to be seated, which  improved the atmosphere. There was an annoying sounding electronic bell going off from the kitchen once in a while."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4XzhycHVBRRAB",
            "text": "We love this place a lot! They have the best, creamy Dal Bukhara. Their Saag Chana is so flavorful and delicious. Love the rosemary naan and rice pudding as well. The waiters are very polite and friendly. We live close and love coming here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNla0xiVG5RRRAB",
            "text": "I’ve never tried Indian food until I moved to New York, and I highly regret it. The buttered chicken and onion naan was amazing! Had to go back again the next day to get more naan for my leftovers!\n\nHighly recommend!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bk1uUndBRRAB",
            "text": "Very good Indian good cozy spot on a quiet block in Kew Gardens. Dishes aren’t heavy very good presentation. Menus are on an iPad kind of a nice touch. If you like spicy Indian food be sure to ask as it is average spice by default. Good atmosphere friendly staff I bet it gets loud when busy. Will return for solid Indian food"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVbk1TMm13RRAB",
            "text": "Food was delicious and the portions were hearty, the service is exceptional and the staff were very attentive and friendly. The restaurant itself has a very relaxing atmosphere and I felt at home there. They also have outdoor seating during summer. I'm very satisfied with my experience here and I will be back!!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBMjlubFlBEAE",
            "text": "This was my first time here and my friends had nothing but great things to say about the restaurant.  Service was very friendly, helpful with menu suggestions, and checked in with you to see how you are doing.  I love how you can just sit,…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdE15S3FBRRAB",
            "text": "My family and I were in the mood for Indian food and my sister recommended this place. Everything was so flavorful and seasoned 😋 So affordable - The portions were generous! We got tandoori chicken, chicken tikka masala, chana masala, eggplant side dish, poori, and garlic naan 🤤 Galub Jamun and their famous rice pudding/kheer -> must try! Def had this at other restaurants, but they got it right 💯 Most importantly, the service was attentive and genuine. We will definitely be coming back soon! I took two videos of the entrees and dessert, but can’t post ☹️ contact me and I’ll gladly send to you! Eat at Tikka Indian Grill in Kew Gardens 👀🔥"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxc09peDJ3RRAB",
            "text": "I came with a party of 3. We liked the vibe of the place, they had some bollywood music playing on the tv (which was a nice touch). We ordered chicken vindaloo, chicken biryani, mango lassi, chicken & lamb chops and the chicken tikka masala (which was cooked to perfection) and the gulab jamun which so warm and tasted fresh. Our server Rasidul was very accommodating, attentive to our party, and was really nice. And the two other servers working there, nowshin and riya also made our dining experience very comfortable. I’ve tried many mango lassi’s at different Indian restaurants in queens, but in my opinion theirs is on top. Food & service was amazing. Definitely recommend to try if you’re in queens and wanna try an Indian restaurant."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlaGV1QVRREAE",
            "text": "i had lunch here about a week ago and it was very good, had some very good appetizer and under the chef's specials I had naan bread stuffed with chicken, never had it before and really enjoyed it.\nSince it was a very pleasant experience I decided to have dinner here again.\nIt didn't disappoint. Chicken tikka was very good, as well as the appetizer.\nNice atmosphere, good service and reasonable prices. I'll be back for sure."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnd00tLUlBEAE",
            "text": "Ordered from this place and I have to say it was not worth the wait. Delivery took long! Got the chicken vindaloo which was hella spicy with a ton of curry and hardly any bits of chicken. Portion size was really small and you would expect…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDb2ZEV0lnEAE",
            "text": "Did a couple time takeouts, finally got to dine in in their outdoor space. It was nice. And dine in has lunch special and it was great. I like my lamb."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPM0pYY2Z3EAE",
            "text": "We already want to go back for more! The food and staff were excellent! We asked for mild and they definitely delivered, next time asking for medium to have some of the spice come through."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtNmN6cFRnEAE",
            "text": "Second time to eat here and not disappointed. The first time we were here, we ordered chikken tikka, lamb chop, rogan josh and everythings sooooo good! Second time we ordered balchao and korma (pictures below) balchao is good and sweet. it tastes coconut-y."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtczU3d0VREAE",
            "text": "This restaurant is excellent! The dal and naan alone are outstanding and worthy as a great meal. The food is authentic Indian and well priced. The menu is exactly what it should be. Great place."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNX0szZlR3EAE",
            "text": "Small but cozy. Our party of five was seated without a wait. We had chicken Tikka masala, lamb Chennai, bhindi, lamb mirchi, samosa chat, and a few different types of bread. The chicken Tikka and Chennai lamb cooked in coconut milk were favorites.\n\nWe were also happy for the byob with no corkage and close liquor store. I would return!"
        }
    ],
    "reviews_count": 59
}