{
    "name": "Smile of the Beyond",
    "place_id": "ChIJSdvHaN1gwokRazUf9UCwvBw",
    "grid": "QN8",
    "address": "86-14 Parsons Blvd, Jamaica, NY 11432, USA",
    "rating": 4.8,
    "user_ratings_total": 802,
    "phone_number": "(718) 739-7453",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2preVVrNXRSVm80WkZKMmNGWmhWRFpaWW0wemNWRRAB",
            "text": "Their food is amazing, tasty and very reasonable. Very serene atmosphere and incredible staff. Love and recommend a place to eat."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsT05teFFiazVyUkRKeGVGcHNSVXBJZFhaUlgxRRAB",
            "text": "I had this place bookmarked as my first breakfast back in the states in over a year.\n\nSo polite, hand sanitizer at the table to clean off the airport, the colors and atmosphere are intentional and amazing. Would have known it was vegetarian/ vegan unless you had told me.\n\nBottomless coffee, great prices, generous portions. Don’t think twice come try."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWclJYQnZSV0YwY2pWS1h6ZGxRMFpUVlcxSGVrRRAB",
            "text": "The vegan philly sandwich was amazing"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KM1RsWnNPVFZpUWtkRk0wbEtTM2d3V2poTGRWRRAB",
            "text": "Best vegan food I've ever had by far. The philly cheesesteak tastes exactly like the real thing."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMldYWnJWMVJyUW5kWWQzaDFhMUJKTjB0WFJGRRAB",
            "text": "Wanted a vegan diner since Champs closed in Brooklyn, and this was a neat find! It's run by followers of a spiritual teacher, so the vibe is very zen and peaceful, and tons of classic diner food options, all being vegetarian or vegan. Friendly service too. Glad I went!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNZd3VJehAB",
            "text": "The food is fantastic! I always look forward to coming here because I love the breakfast and it feels like a classic small diner. But unlike most diners, the Smile is very clean and bright. It has been six years since I was last here, and the physical upgrades look great!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KT1FsZFNja0pGY0hGeFdtcGhVRGh6Y2toWldXYxAB",
            "text": "Food is always well seasoned and flavorful. The restaurant is a little small"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oSWNHaFlaVVpYU2tWSmQyWkNWR2RTVmtKUWFsRRAB",
            "text": "Can't believe I slept on this place all this time. Killer, old school diner food at realistic prices! And really one of the only places left to get a full menu of vegan breakfast food left in the city. Looking forward to coming here often. Pancakes were really good. Vegan scramble was killer.\nAlso, the service was great!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRU1VdHVWMXBOZERGMk9FaFFlRVl6YURCdlpHYxAB",
            "text": "I was going to come here with my staff for a late breakfast but after seeing the establishments response to someone speaking up after being a victim of drinks being spilled on them is Completely disgusting. I would rather keep my money. What a communist business"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KUWMzWXdXRGd0ZWpWemRVUTFWR0ZDVUhwVU9FRRAB",
            "text": "Today is Sunday September 21 2025 and I had the utmost horrible experience at this establishment. I was with my sister after a work out for a nice healthy meal We ordered and everything was going great until…..: one of our servers deliberately spilled all of our drinks on me ( a carrot juice and a orange juice). No one helped me or offered to comp the meal . I was given a towel and was told I can have my meal packed to go) COMPLETELY UNPROFESSIONAL! Do not come here !!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oWllWcEplVkpwTlRsUFgwb3RjMVZ1Y1RCZmJXYxAB",
            "text": "I cannot even fathom how much of a great time we had over weekend brunch! Great customer service and food was next level!!!!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4dlJVSTRPR3RrVXpWcGRUWjFhbGhzV201SU5sRRAB",
            "text": "Delicious food, great coffee and very friendly staff. Generous portions of food at a good price. My go to place for nutritious and variable food. The pancakes are as fluffy as marshmallows. My favourite is the breakfast special."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNVZGQmlTRTB0YzFaaFVuZGhSVFZDWTFCYU1tYxAB",
            "text": "It was my first time here and the mushroom burger was SO amazing that I’m afraid anything I order next time will be disappointing! Dario was very nice."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taamRVMTNUbEZtYjNSRVNFOHpkamxaZDNwTFkwRRAB",
            "text": "Delicious, I love coming here!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sa1dVczVibEJQUVdKd1NWQXdSRUZxZEZwNFZWRRAB",
            "text": "Excellent vegan and vegetarian food. The service speaks the name of the restaurant, all smiles and positive vibes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTk1YbzFWRlpXVUhabE5EbERUSHBOTFVneFpYYxAB",
            "text": "Seating area was a little tight but other than that I had a wonderful experience. Friendly staff and food was delicious. I tried the Vegan French toast deluxe, Vegan Buffalo chicken wrap and the Veggie Delight wrap."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxeVRuaDVjVlIxWm1kWWVIZFdhbWN6TWxCNE5VRRAB",
            "text": "One of my favorites in Queens. The staff is so warm and accommodating, pleasant exchange always makes food more enjoyable. And the hot chocolate is simply the best! I love it here 💛"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFeVpGTnlWbUZxWDA4MFZqRkNaVUZ0ZUdnM1lVRRAB",
            "text": "For non-vegetarian/vegan adherents, myself and my family absolutely enjoyed not only the food but also the service. I think the blueberry coconut pancakes (vegan option also available) were a limited special in the menu I’d go back for very soon! So glad we shamelessly wolfed it down after very filling brunch entrees of chilaquiles and omelette platters ✨"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toRGNXMU5URU0xUnkxaFRtTnBZWEJxUWpBdFpWRRAB",
            "text": "It feels like a small cozy seascape restaurant in the middle of Queens. The indoor colours are bright: light blue, white, and colorful paintings. The food is amazing. Had the aumlette supreme, chilaquiles, and a small oatmeal with fruits for baby.\nThe place is only open for breakfast and lunch, and it's a small place but very busy. Nice vegetarian/vegan spot. I feel healthier already!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvNE1HcGhNbkJEZURBM1NGRlhTMkZYVVZVeVpuYxAB",
            "text": "Second time here, super impressed and great vibes.  Delicious food. And I really like the service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SWFTMTJZMVJUVVhSV0xXa3pSMWMxVFdoME1sRRAB",
            "text": "This place has delicious fresh food.  You cannot beat their vegan mango shakes .  They have an entire vegan menu and they will modify most of their items to be vegan upon request.\nI took one star off because while I was there I had to listen to two coworkers argue about a travel size bottle of mouthwash.  (Take it outside boys and maybe try some mindfulness meditation.)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aM1YxbHNaM3BOYVVwTFVWbFlXV05VYTFSTVpHYxAB",
            "text": "Great little vegetarian and vegan diner in Queens. Huge breakfast and lunch menu with tons of options. We loved the house made vegan bacon, we couldn’t believe the flavor! I had the soy chorizo breakfast hash, it was delicious. Highly recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KcmFESlBNVE13TTJ4cmFqQktTMFpLWkdSWVJGRRAB",
            "text": "Food was great, and how exciting to have vegan options.  We got the vegan BLT, vegan omelette and the vegan berry smoothie.  All delicious.  It’s a small, cute diner space.  We ordered out.  Everyone was so kind.  Very courteous service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GUWMxUnlNbXh1Y1ZCcmQwdHFWbkJXTlc1RGVWRRAB",
            "text": "The food here is fantastic!  I highly recommend this place.  Most options on the menu, they are willing to make vegan, but they also have a large vegan menu.\nI had a vegan mango shake that was made without bananas (yum!)\nI took two stars off the atmosphere because I had to listen to the boss chew out a worker for a totally honest mistake.  (I'm not sure why I needed to hear that but honestly felt like it could have been handled better)\nAnd one star off service because we had to ask for more water and for the bill and to go boxes."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBdE4yaFlUR2haV1VoTU5qZDBWRGRUUzFwalUwRRAB",
            "text": "Healthy, spiritual,  and intelligent food and service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGb1RUUnVlRWxrZG5SaGRUbHJlR1F3WkVOemVsRRAB",
            "text": "This place is fantastic. We had vegan steak sandwich, frittata, wrap, and some milkshakes. Everything was delicious. Highly recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVFgzSmFOMk5uVURReVMxRlFXWFpvUjNOSWRGRRAB",
            "text": "What can I say … a lot lol man as soon as you walk inside it feels like peace ! I love the music and most of all the cards of beautiful words that you can take with you !\n\nFood review below\n\nI ordered the vegan omelette 10/10\nI didn’t know it came with potatoes and toast other wise I wouldn’t have ordered the French toast\n\nThe French toast was soooooo cinnamonnyyyyyy OMG IS WAS SO GOOD !!\n\nEvery was good my bf eats meat and loved every!\n\nWorth the money worth the time worth the walk lol  will definitely come back all the workers was nice 😊."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTlUwNURiR2xJTXpCeGNHTXlla2czTTB4eVQyYxAB",
            "text": "Excellent place for a peaceful breakfast"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUVZVUlJXVWRVYkU5Tk9TMUpUVk0zVTFoMU1WRRAB",
            "text": "Best breakfast i have had in a long time. I got the avocado eggs Benedict and it was cooked to perfection. Prices are very affordable and service is impeccable. Definitely a must try!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCeVRHWjBYMmwzTWpWYVVHRnBUMG8xUzFkSFMxRRAB",
            "text": "Excellent food!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKV1JtdHNXV1pFYjNwUlJYbFhVRGhVVEU1TlluYxAB",
            "text": "This is one of my FAVE bfast/brunch spots.  The staff is friendly and the food is ALWAYS on point. They gave vegan and gluten free options."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPYXQ5TktpMDRMSU13EAE",
            "text": "Review: Smile of the Beyond\n\nI ordered rice, vegetables, and beans at Smile of the Beyond, but unfortunately, it didn’t meet my expectations. The vegetables had almost no flavor—they tasted like nothing. The dish overall felt bland and uninspired. I was hoping for something more satisfying, but it just didn’t hit the mark for me. I wouldn’t order this again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25saGRVdDVWMU4zVlRCSWJta3dTMnhpVlUxWVptYxAB",
            "text": "The best breakfast spot in queens!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLdno4WUtGeDR6YTFnRRAB",
            "text": "Great food, great atmosphere, great prices. Absolutely amazing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLS3o3cWZBeV9MazF3RRAB",
            "text": "I got a vegan pancake breakfast and it was really good. Their pancakes are delicious!!! Very filling and a good value for the price. Very cute inside too and good service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKYWQzNWpBN29PYUx3EAE",
            "text": "Delicious vegan and gluten free restaurant! Something for everyone. Refreshing juices. My family and I went on a Sunday midday. We tried omelettes, pancakes, and eggs. There were folks coming and going. We had to wait just a little bit but they had a clean and nice waiting room. Would definitely return, and highly recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJeXNqT0RCMU1hN2RREAE",
            "text": "Excellent food parade choices.Customer service is absolutely the best\nWould definitely go back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNLW4tcG55cS1pcEdnEAE",
            "text": "this place is great.\ni remember back in college i used to go to Oneness Fountain Heart (now closed), and it wasn’t until very recently did i learn Smile of the Beyond existed— so of course i had to pay a visit to celebrate the work of Sri Chinmoy.\nupon entering the diner, the immediate feeling of calm hits you, and the ambient music in the background is relaxing. the staff are all pleasant and the cashier is full of smiles.\ni ordered Tropical Nectar drink and the Chipotle Bacon wrap. the smoothie was light and fresh and citric, and i gotta say i was pleasantly surprised with how crispy the chipotle bacon wrap came out.\nthese items were delicious, and light on the stomach. i enjoyed the food so much i went ahead and ordered another item- the steak on a kaiser roll. the cheese and steak tasted just like the real deal.\noverall, 10 out of 10, i’d definitely come back but their hours seem to be exclusively breakfast and lunch."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQV2NfY0NNNXIyZHRBRRAB",
            "text": "I love this place! So happy I found it a couple of months ago. I go at least 1-2 times a month. I love the vegan BEC, the eggs benedict/Florentine, the vegan burrito and pancakes are great as well. And I can't forget about the iced maple latte with almond milk. Everything is delicious and the staff is always welcoming and warm. Peaceful ambient. Definitely recommended!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOdUdxTGlMMkxhTXZBRRAB",
            "text": "Great spot The food is really tasty, the prices are fair, and the service is top notch. Definitely coming back and highly recommend it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzM01DQkZ3EAE",
            "text": "Super cool all vegetarian/vegan diner in Jamaica that is a must-visit if you’re in the area. They have the veggie version of all the comfort foods of an American diner: pancakes, eggs, French toast, etc. Also great coffee and smoothies."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bS12YXFRRRAB",
            "text": "Overall Great Experience (First time):\n\nKind customer service from the waiter. Very patience with my request.\n\nNice, compact, small atmosphere.\n\nHas a lot of vegan/vegetarian options which is why I originally chose this place. I cannot eat eggs and pork so their vegan eggs and sausage were a great alternative.\n\nThe food tasted great! Actually exceeded my expectations a lot.\n\nThe only negative was the price was way heftier than anticipated. Basically $100. I suppose that is my fault for not confirming pricing from the menu so not their fault.\n\nI recommend the pancake deluxe. I also got the French toast deluxe. The bacon, egg and cheese (vegan), the blt (vegan), the simple berry drink (delicious), hash brown meal, ginger drink, and that was everything I believe.\n\nHighly recommend!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmOThhZ0xREAE",
            "text": "Nice looking vegan and vegetarian diner. The servers was nice and greeted us when we arrived. They provided tap water with lemon. My boyfriend and I ordered the Masala Chai, Vegan Pear Pistachio Pancake and Vegan French Toast Deluxe with a side of vegan bacon. The vegan whipped cream and Masala Chai was tasty.\n\nThe Vegan Pear Pistachio Pancake was tasty. The French Toast Deluxe was undercooked and the brioche bread was soggy. The vegan bacon was also over cooked and tasted dried out. Perhaps they should look into a another vegan bacon brand."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmaE5helFBEAE",
            "text": "As many times as I've been here, I can't believe I'm reviewing it for the first time. I'm the sole vegetarian in my family and this is the one place that serves plant based options that my family doesn't complain about. The service is great and the food was served fast and it was delicious.😋 The space is small but the skylight and mirrors on the ceiling brighten up the space and make it feel larger than it is. Highly recommend for anyone whose diet is meatless... or not."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLbTYtWUZ3EAE",
            "text": "Best authentic vegan and vegetarian food that I’ve had personally in Jamaica, Queens. Both food and drinks taste extremely fresh, everything is prepared with care. They make non meat taste just as good as meat if not better. They have a ton of options that even the pickiest of eaters could choose from.  The staff is both friendly and professional. Definitely my go to spot for when I’m staying away from the meat. Prices are affordable. Only downfall about this place is it closes at 3 so hurry before then."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5aF9xTzJBRRAB",
            "text": "This place is a gem! It was our first time eating at this diner and we absolutely loved it. There aren't many vegan/vegetarian options near Jamaica Queens, so finding a place that caters to our dietary preferences was great. We will definitely be returning because everything tasted fresh and delicious; we give it a 10/10. The staff was friendly and the establishment was clean."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcGFTbXpRRRAB",
            "text": "Mother and Son Brunch … just because💕 at this quaint, tucked away secret gem in Queens. Truly the first place that I,ve found in Queens that does BOTH vegan and carnivore options WELL!  If you’re like me where your household has a little bit of everything going on, this is your spot for breakfast, brunch or lunch!  They are a vegetarian diner with an extensive menu so lots of good eats to choose from that are not salty or oily and well seasoned 🎯\n\nWe had fresh carrot juice made to order, the pancake special with plant based bacon, eggs, home fries, sour dough toast, fresh fruit and avocado.  Magnificent! They also have vegan desserts like apple crumb pie, frosted cookie crunch and so much more. The service was wonderful and we felt right at home. There is also a lovely gift shop right next door that has some unique knick knacks. Tell ‘em Avery sent you💕\n\nDownside is parking is sparse so Uber or subway if you can. Note their hours are 8am - 3pm, closed on Tuesdays and are open on Sundays. Bon Apetit 🥂"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfX1plSnp3RRAB",
            "text": "This restaurant is one of the best vegan and vegetarian restaurants I've ever been to for many reasons: the phenomenal food made with love and quality ingredients, the inspiring and spiritual atmosphere, and the dedicated people who work behind the counter. I already cannot wait to go back. Try the omelettes and vegan avocado migas!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMeC02SWZ3EAE",
            "text": "Love this place! Food was incredible!! Old school diner vibes.  We had the mango pancakes and the veggie supreme omelette.  They have veggie and vegan options. So yummy will definitely be back!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwLTZyZ05BEAE",
            "text": "Wow!! Favourite diner by far!! Gluten free pancakes are awesome. Omelets are incredibly tasty. Portions are big. There are so many delicious choices of vegan and vegetarian meals.\nHealthy juices and smoothies.\nThe people are super friendly!!!\nWould come every day if I could.\nNot expensive, either.\nOpen 8am to 3pm."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1OEstc0N3EAE",
            "text": "Amazing! Really nice place to get tasty fresh food. Great service and a tranquil ambience.\nFood was too yummy to await photos.\nWe had\nEggs Benedict (best, not in photo though)\nVege omelette\nCalifornia omelette\nPan Cake Deluxe\nAll were fantastic.\nTheir coffee was good! Surprising for a “diner” and even had free refills but like everything else you can taste the quality of the ingredients honestly. Even the egg yolk color tells you they have the good stuff.\nThey even brought out toys and dinosaurs for the toddler!\nWe spent $57 (before tips) for 4 adults and 1 toddler but we had a whole dish left to bring back. You can do it quite manageably for much lower.\n\nLook forward to going back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqcUp5RzJnRRAB",
            "text": "Fresh and calming atmosphere, very friendly and delicious food, definitely a Sunday retreat with family! Will come again 👌 Ordered the peach passion fruit pancake with avacado benedict eggs and pomegranate acai smoothie, along with a warm chickpeas soup 👍 Pleasant place of a gem💝"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbjdPZ3lRRRAB",
            "text": "Delicious vegan/vegetarian food! I really recommend the vegan sausage, egg and cheese deluxe. The ingredients really melt in your mouth and work well together. I also got the pumpkin pancakes, it's a very large dish and feeds two people. The egg Benedict was also really yummy but I found the vegan sausage, egg and cheese to be more tasty."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKOEphYTNBRRAB",
            "text": "It was good.  And so nice to be able to go somewhere that had Gluten Free.  Too bad the cross contaminate... ugh!  The pancakes were just ok.  The cherry chocolate ones were definitely the best!  The oatmeal was outstanding the the potatoes were inedible.   They were not cooked all the way and the seasoning was just weird.  All in all, it was ok"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4b3BxNXN3RRAB",
            "text": "I recently went vegan and was looking for a vegan restaurant close by. I started coming here to eat as well as go to Guru health foods next door for my organic groceries. The food is delicious and cheaper than going to Mc Donald's to poison myself. The person preparing my meal wore gloves and the use the same type of juicer I use at home. It's the little things, like the Devore and something simple as biodegradable straws . My orange juice tasted real fresh also and was fresh squeezed. I hope not many people read this review because I don't want this place crowded the next time I visit. The only drawback to this place is that they close at 3:00 pm."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURld1lmNFRREAE",
            "text": "this is a nice establishment, peaceful environment, prices were fair esp for vegan food, and portions were large. the employees are mostly white, while most of the clientele was black, everyone seemed kind and decent. retro feel, and accommodating to kids."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxb1ltcHl3RRAB",
            "text": "Searched online for ‘healthy breakfast in Queens’ and this is one of the restaurants that came up. Service was quick and food was served hot and fresh. Its good that they have regular and vegan options. We’d definitely recommend and come back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJa3JfUGpBRRAB",
            "text": "Quite often I crave a traditional pancakes breakfast and unfortunately ihop can do nothing for me as someone who doesn’t consume dairy. Smile of the Beyond is the best vegan breakfast in Jamaica, Queens. This quaint diner offers a full range menu and the staff are very knowledgeable and wholesome. I enjoyed the pancake deluxe without walnuts and with an addition of vegan whipcream and maple syrup. I also ordered chai tea which was a bit too watery for my liking however the flavor was good. My partner had the berry smoothie and our bill came up to about $33 !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMGJMSUh3EAE",
            "text": "Absolutely amazing vegan food! Everything is seasoned well. Extremely flavorful and everyone was friendly."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKLW84cFNGOHQyWGRnEAE",
            "text": "My wife and I came to this diner for a vegan brunch as a reward for walking the entire length of Manhattan and we were very happy we did. I was so hungry I got 3 vegan pancakes that were fluffy and they were very filling. I decided to get the berries, walnuts and banana on the side. Also on the side I got the vegan bacon that came in pairs and was crispy and was not too salty. The 4 soy breakfast sausage patties seemed to be an in house patties which I liked as well. My wife really enjoyed her omelette she said the vegan cheese was the right melted and gooey consistency and that her breakfast potatoes were at perfect crispiness.\n\nWe can't wait to go back. We were very sad when Champs / Ro's diner closed down and are now happy to have found this Vegetarian / Vegan diner."
        }
    ],
    "reviews_count": 60
}