{
    "name": "La Rondine Pizza",
    "place_id": "ChIJMT9JWL1gwokRX-X0gp6wyDk",
    "grid": "QN8",
    "address": "120-38 Queens Blvd, Kew Gardens, NY 11415, USA",
    "rating": 4.4,
    "user_ratings_total": 692,
    "phone_number": "(718) 793-2556",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5c1EwMVVUM2RWUTA1NmFrRnVVMXBuVFd3NVNsRRAB",
            "text": "Order food food never came call store no answer"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GdU5IaFlibFJvUTNoVUxYa3phMkl6WkdWNFZIYxAB",
            "text": "This place is a pleasure, from the gentleman named Jack in the front all the way down to my my favorite slice the MARVELOUS (Honey BBQ chicken) that I can't get enough of. The service is always something to look forward to, especially the way Jack always remembers the small details and somehow always manages to make us laugh.\n\nThe place is warm, no gimmicks, just good energy and people who clearly love what they do.\n\nI Highly recommend, especially for a tasty late night snack.\n10/10"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNlpsbzVhR2x5WVUxb1JWaEJlV1p3ZGtSSFIxRRAB",
            "text": "I usually stop in whenever I’m back in NYC. Been coming here since I was a kid, and the pizza’s still perfect — same flavor, same crust, same magic. One of the best slices in Queens, hands down."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xMU4xUllWR2RDVm1kTVVWZEdTVkZDT1hRMWNXYxAB",
            "text": "Service is great and so is the food. You can sit in a welcoming atmosphere."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsVVpHRkxXVlUwZFdONFQxQkRkWGR3WldSUFIzYxAB",
            "text": "Wish I had stopped by here sooner, the pizza is surprisingly amazing! Most pizza places today if you order one slice it comes out soggy, basically half the slice is trash. My slices here even tho they were sitting there came out of the oven and from crust to end nice and crispy!! Def a repeat customer anytime I have to go to court. Dough, sauce, and cheese all amazing."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wa1dHVkVNMHhJYkdwMGJEVjFOalp4U2poUk4xRRAB",
            "text": "My friends, staff and I went to this place this month and that friend ordered ham with pineapple pizza. The service was wonderful, and the food was wonderful. The atmosphere was that a person was making pizza."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSb1ExUmhlVzl2ZEZvMFpVOVVWbUZ5TkRoc1dYYxAB",
            "text": "Best pizza / food in the kew gardens neighborhood! Affordable cheese / specialty slices, also open until 3:00 am everyday~"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twZlVXUkNTa1pmVlZoVWVXNWxXRkZDVUdwcVFtYxAB",
            "text": "The food is good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGSlJXdHhVbU5ZTURaMlJXeFNkalY2TWtScU1FRRAB",
            "text": "Pizza arrived 1 hour later, completely cold."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkQ2JsTjBPVnBwTTFkZlozaFpVRk54WVdaSVpWRRAB",
            "text": "The calzone is something else, heavily stuffed with ricotta cheese - they don’t skimp.\n\nThe pizza is great too and the owner is super friendly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUFptSk1RbTlxTW5kdlNHd3plVzFLVVV0dmNVRRAB",
            "text": "Everyone working was so friendly.\nI ordered a caesar slice and it was delicious. 10/10 definitely coming back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxdVNrTnpUMDVoV1ZKck0yaFdSa3h3Y1dGNWJXYxAB",
            "text": "Best pizza in town!!! Thank you"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkTWJVeFdkMGhCWlhoZmJXSjNlRmRuU2xScFJsRRAB",
            "text": "Staff were incredible and so was the food. What more can you ask for!!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTUxYSnNNVUpuYkZKWU9TMVlWa1JzZWxsNk0xRRAB",
            "text": "If you can get there before Lunch rush like I did, its perfect. I had the vegetable slice and BBQ chicken slice, both were excellent and surpass most other Pizza spots I've been to in terms of quality. The cheese has perfect pull every bite, the crust is cooked well, and the sauce is fantastic, probably the best sauce I've had on a pizza. Really, im going here more often for Lunch."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMFFVaHNOemh5YUV0T1ZsUlFVRlpNWkdSVFVIYxAB",
            "text": "Un restaurante muy recomendable, buena calidad de comida, agradable ambiente por el AA y seguirá creciendo, apoyemos a los restauranteros Cozumeleños"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oeGREaHVaMDkzU2xjeVJFbHBkWFZ4WVV0SU1GRRAB",
            "text": "BEST pizza around, 100% recommended"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRd1dWWnBSbE5GYjBodlZuRkZkMTg0Wm5aVlpYYxAB",
            "text": "It is true. The pizza is good but the touch the pizza with the same fingers the receive the money.\nThe staff can also  be a little nicer"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJek9VdElTR1pZVjBaUlRreFNOMWRDU25GVlZHYxAB",
            "text": "Awesome pizza 🍕"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWUlIweE5NWFo1VGtVM1NYRkxTR3BoWVhVNFprRRAB",
            "text": "The best Penne Alla Vodka with fried chicken cutlet I've had in years. 😋 😋 😋"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwckxYVlFZV2h4ZG1aWVR5MDNVWFppWldVNVIwRRAB",
            "text": "Five Stars!\nThis is hands down the best pizza! The crust is perfectly airy yet crispy, that only a true pizza master can do.\n\nEvery bite is a masterpiece, the sauce is rich, tangy, and bursting with flavor. You can truly taste the love and tradition in every pizza they serve.\n\nIf you’re looking for authentic, timeless Queens pizza, this is the spot. Don’t miss out!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQ1ZIZEdRMkkwV0VoNlpXbExNekJ5VjBaWU9XYxAB",
            "text": "Very busy spot, people are in and out…It’s pizza, you can’t go wrong with authentic Italian pizza. It’s good!…my issue is the staff, some of them can be very nasty when you make additional requests, after placing the initial order. Another thing is, they have ppl cashing the food, and touching the food directly after, that’s gross. I said it to one of the men I directly saw doing it, and his response was “if you don’t want it, you don’t have to eat here”, which was rude! And on top of that, his fingers weren’t the cleanest. Manners and respect go a long way, and because of that, I will NOT be going back there."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paUFVHNTBibmxpV1RkNFJHUk1WRmw2U2tjeGMxRRAB",
            "text": "Probably one of my favorite pizza spot around kew gardens, honestly. I like it better than Danny’s and Alba’s “ sorry, no sorry “. Owner is such an amazing person and pizza is always really good, fresh and not oily at all. Their cheesesteak sandwich is probably my 2nd favorite thing, after pepperoni pizza with extra cheese."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCelVrSjBVMUJxVEZWQk9UQXdWMDF3Y25oR1gxRRAB",
            "text": "Excellent pizza"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTk5WcElUVjgwTjNVMFZHWlFPRWRsV1Y4MlluYxAB",
            "text": "God bless this place as long as His Earth remains! Beauty of a shop!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdkxVdEpVMUZuVEZkbldFeFFMVmRXUmpkUlVIYxAB",
            "text": "I order pepperoni pizza which they did not have on display. The guy took the cheese pizza which was already made and put pepperoni on it. Also the pizza smelled really bad"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMlNrVjNkRXRoUW5SYVNqZGhibUp3Um1kcWNtYxAB",
            "text": "Found a new local pizza place that I'm absolutely in love with. I think a lot of pizza places in the area are lacking, but I ordered delivery last night and La Rondine did not disappoint! Crust and pizza dough were perfectly crispy + soft with a nice chew. Tomato sauce had a nice tang to it as well, a lot of places tend to use very sweet sauce. Will definitely reorder."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKYk0xY3JpN2JXeVVBEAE",
            "text": "Phenomenal sauce, phenomenal pizza 🤌🏽👏🏽"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLU19fdi1EbTk2ZVVBEAE",
            "text": "Amazing selection of delicious varieties of slices. They never disappoint."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyaWF6b3pBRRAB",
            "text": "Friendly staff, delicious pizza, the beer is available, I love the paintings on the dining walls"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPYmNpSUdIbHVyTmx3RRAB",
            "text": "Very nice people .. pizzas look fresh.  They do have varieties and that’s always a good thing .. and place is really clean .."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMHN5NzBBRRAB",
            "text": "What drew my friend and I in was the delicious smell coming from inside of the store, and it was such a good decision that we went inside. The food was superb and what was better is the service. Employees where smiling and welcoming and that is top tier customer service. I loved it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdmJ2QzlRRRAB",
            "text": "Do not even know how to treat customers, Rude people? Go there!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaU9URFRREAE",
            "text": "Very friendly staff and the pizza was great. Highly recommend if you’re in the area or can order."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bXV1ZVFBEAE",
            "text": "Their pizza is delicious! The crust is light and crispy while still having a nice chew to it. The cheese slid a little on delivery but I will definitely be ordering again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdWVTQ2J3EAE",
            "text": "This is a great place to eat. The pizza and food is delicious. Jack and the other people behind the counter are awesome, very friendly and personable. A great experience all around!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNROGVUR1JnEAE",
            "text": "Really good pizza came at 1 am got some cheese pizza and bbq chicken pizza and was not disappointed will be visiting again"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndE5YaF93RRAB",
            "text": "Highly disappointed. I eat from here all the time on the go. My 6 year old son had to use the bathroom today. THEY MADE ME BUY A SLICE JUST SO HE CAN USE IT. disgusting. That's what loyal customers get treated like? NEVER EATING HERE EVER AGAIN. Money hungry!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnNE1taEtnEAE",
            "text": "I waited over 1 1/2 hours for pizza and soda. I called and spoke with the owner he took down all my information and said that my order was on its way. I call back 30 mins later speak with the same man who ends up asking for all my information all over again. He calls me back to say the delivery guy delivered it to me and described how I looked. When I asked him to describe me he couldn’t give an answer. Then he switched to say that I must have ordered for pick up and someone picked it up for me. Then he went in to say I gave him the wrong address. After giving several excuses the owner hung up the phone on me. I call back to speak with the same guy and he was very nasty and disrespectful to me. He had the nerve to call me a liar. I asked him if they can correct the mistake by just sending a new pizza and he said sorry I can’t help you and hung up. Disgusting customer service. I will never order from them again."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnanNYRktnEAE",
            "text": "This is one of the most clean places to eat, and the pizzas, calzones chicken rolls, very tasteful and fresh as well. The passes from the kitchen, the salads, one of my favorite places to eat Caesar salad as well.\n\nThank you Jack for always taking care of us"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnZ0s3QVVREAE",
            "text": "Food quality too bad."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1cDRHbnBRRRAB",
            "text": "Always fresh, handmade pizza. Their regular slice is delicious but my favorites are the grandma, check Parm, chicken Alfredo, and margarita slices are the best. They have amazing chicken cutlet, chicken rolls, beef patties, and penne a la vodka pasta as well. Great service, very friendly family owned business so you know you'll always get taken care of."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXbTlmdXFnRRAB",
            "text": "Went in for a quick few slices. The regular was very good. The Buffalo chicken was good and unique. They make it like a normal slice with Buffalo chicken on top, so there is in fact tomato sauce.\n\nThe staff were all very friendly and the place was extremely clean. Prices are very fair."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGOFlmTXFnRRAB",
            "text": "Employees are the best! Super friendly service and fantastic pizza!! Top delivery!!! Bravo for Jack!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBeWFmZWZ3EAE",
            "text": "Super friendly makes you feel like you’re in Italy walking into your favorite pizza shop and they’ve known you since you were five! The food never disappoints, take out is always in a reasonable time! I’m a regular Here and the best pizza hands down in queens and is the only thing open that’s Quality after midnight!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMklycUp3EAE",
            "text": "Ran into this place by accident, but wow! The mushroom slice tasted like it was from Naples, Italy. 🇮🇹 Tasted way better than a typical American pizza slices. The buffalo chicken slice was hot out the oven and very delicious!! The guys making the pizza were so welcoming, smiling and sweet. You can taste the love they have for making their pizzas when you have a slice. I got 2 slices with toppings and a small Diet Pepsi all for $10.38. Very reasonable prices for the excellent quality of pizza! 🍕 This will be my new pizza delivery place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxazVfZkRREAE",
            "text": "Good pizza and friendly staff! The guys in there make you feel very welcome, oh and the pizza…it’s good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNseHJlM2FBEAE",
            "text": "Have jury duty and stopped by for a quite bite. A bit expensive than most pizza place I have been to. Pizza have good crust and flavor."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlZzhxaENBEAE",
            "text": "Great pizza. No matter what time of day. The rest of the menu tastes like a high end restaurant. Always a good meal."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0dFkyLTdRRRAB",
            "text": "I really love this place, great pizzas and pasta. My favorite is the cheese pizza but also the chicken parmigiana pasta. The owners are so nice and courteous. I usually order delivery but is good for dining they have space."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJOGNqUHJRRRAB",
            "text": "Pizza is extremely good!!! Pricey but well worth it!! The pizza in general is crispy and it's not burnt and grease is just about right and the pepperoni ratio is reasonable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubjhTRGxRRRAB",
            "text": "The experience at this place was awesome this was because my friend and I came to this store and my friend ordered 2 slices of cheese pizza for lunch and the pizza tasted wonderful. This is a place where people should go because they are open till 3 am nightly. The service was awesome and fast and the atmosphere was quiet."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzd3FMSWFBEAE",
            "text": "As a regular customer always order a penne a la vodka with grilled chicken which it cones served with a nice piece of toasted hero. For me is the best in Kew garden which is the reason I got to this restaurant. The flavor of the sauce is so delicious, tasty, yummy. Today I was served a tiny tiny piece of toasted hero which made me think they were running out of hero bread. So, I decided to leave it maybe they are saving for other customers since Im a regular customer doesn’t mind if I don’t get served toasted hero. But it is a big offense to serve a tiny piece of bread when the purpose of the bread is to enjoy the flavorful homemade sauce on the pasta. It is so delicious but today I didn’t even finish the pasta knowing wouldn’t be able to enjoy the sauce."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqazczRndRRRAB",
            "text": "HIGHLY RECOMMEND! This spot is open till 3am! The owner is one of the nicest people I’ve ever met. Came in at 2am and he just took a fresh pie out. The pizza was delicious and the owner was very welcoming! Recommend this gem to anybody passing by."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLOThtNjJnRRAB",
            "text": "Half pepperoni and half regular cheese pie. Holy moly these guys can bake a classic New York pie! This rivals Gabys pizza any day...might be better dare I say! I snagged a picture before we finished it all. Ordered tonight for dinner on Uber Eats. Came piping hot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbHE3SFF3EAE",
            "text": "Love their pizza. Best counter slice in Kew Gardens - not a fan of Dani’s sweet sauce."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURob1pMZDJ3RRAB",
            "text": "Food was EXCELLENT. Service was impeccable!"
        }
    ],
    "reviews_count": 56
}