{
    "name": "Mikado",
    "place_id": "ChIJheSe5TxhwokRoHOVTVZt0fo",
    "grid": "QN8",
    "address": "116-09 Metropolitan Ave, Jamaica, NY 11418, USA",
    "rating": 4.7,
    "user_ratings_total": 386,
    "phone_number": "(718) 559-0088",
    "reviews": [
        {
            "date": "5시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOb1luaFNlV0ppU0RaMU9VRnRia2d0TFZSV1pVRRAB",
            "text": "Always super nice staff, great sushi and quick service!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210WE9GWkhMVkpqZEhwdmJFSnNiMXBmTms1c1YwRRAB",
            "text": "Love this place the sushi is great, my only thing is they never get the uber eats order right, this is 3rd time i’ve ordered on uber eats and it’s the complete wrong order. Everything else is great the sushi is the best around here for the price i just wish they were a little more careful with who is picking who’s food up"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poeU1FcFZVMmsyYUZrMVZEZE1TRWxZYlRCbE5GRRAB",
            "text": "Very good food small place but love the decorations and best sushi in the area."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCak5scHhUV3QxZDB0MlNpMHRlR2hWYWxkNFJGRRAB",
            "text": "I'll try to keep this to the point —\n\nI gave Food/Service/Atmosphere 5 🌟 because they were on par for me. For a local spot, this really took me by surprise.\n\nWhat I ordered:\n\nMiso Soup:\nStandard Miso Soup, nothing groundbreaking, but very tasty. Would have loved a tad more tofu & scallion, but that's just me.\n\nSalmon Avocado Hand roll:\nNot the hand roll I expected meaning it wasn't in the cone shape I'm familiar with, but it came presented like a taco with the seaweed as the shell. Salmon cuts were huge, and with great colour, avocado was bright & ripe, coupled with the perfect amount of rice. Everything tasted clean, and fresh.\n\nYellowtail Jalapeno Nigiri:\nI messed up with this, originally I wanted a sushi roll, but my brain flubbed. Great mistake though, because the yellowtail was delicious, practically melted in my mouth, topped with a delicate cut of jalapeno on top.\n\nLove Milk Tea:\nHonestly, just a really delicious milk tea topped with osmanthus flower. It was light, refreshing, and not too sweet thankfully.\n\nWagyu Tataki:\nTataki is meant to be briefly seared on the outside, but the center remains raw. Was this seared to the degree I wanted? No. But, was it delicious? Yes. And the meat was incredibly tender, flavour of the sauces really complimented everything on the plate.\n\nI finished off with a matcha cheesecake to go, I'm sure it'll be good.\n\nWith tip, I spent $67\n\nAgain, for a local spot in Richmond Hill/Kew Gardens, I was thoroughly impressed and satisfied. Personally, with slight adjustments, these folks would do great in midtown. I spent a little under what I would spend at a restaurant in the city, and got an incredibly satisfying meal, and left full."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xS1F6QTBRVWxPYVc1dlZqVkZURTFVVFU5cGExRRAB",
            "text": "The service is good, sushi yummy and I loved the packaging. Def my go to for sushi!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xeWFra3phM295TmxKU2IxcFBVRjlZUWt4UGRrRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\n\nMikado is an amazing Japanese spot! The decor is beautiful and sets a really nice atmosphere. The food was outstanding – I had the lunch bento box and everything was fresh and delicious. The salmon hand roll was overflowing with salmon, and the miso black cod was some of the best I’ve ever had. Service was friendly and attentive. Definitely one of the best Japanese meals I’ve had in a long time!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCS1JHZExWMWxtVnpWUVVURnZiamxvVTBSTmQyYxAB",
            "text": "Our experience was disappointing from the start. We had a 7:00 PM reservation on a Friday, but even before we arrived, we were told it might be canceled soon. That was confusing and unprofessional.\n\nAs a group of six, we felt rushed the entire time. The staff kept pressuring us to order quickly, and when we asked to replace a plastic chair for my father, the request was met with reluctance. The service overall was curt and unwelcoming.\n\nThe food was also underwhelming and didn’t make up for the poor service. I’ve never felt so rushed at a restaurant. I would not recommend this place, especially for families."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sRWRYZFVkV2RwTldaWFJHWklTelk1WWpjMmFFRRAB",
            "text": "Great service great food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WZk0yMWtRazlVWVhFNFFWVkRYMWhKU3pkWVNuYxAB",
            "text": "It was a middle of road visit to the establishment. I was expecting better service and food quality . The ambiance was great. Parking and location are great. For half the meal it felt as if our server had forgot us. He did not mention any specials or recommendations. The mashed potato’s were bland . And 2 out of the 3 rolls we ordered were the same. And when we questioned which roll was which we were answered with a blank stare as a response. Our drinks were good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwMmRXeGxSVXB6WmtsTGJGUnlhVGREU0ZWQ2JrRRAB",
            "text": "Good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoVVNrUm9NSEpNVTBoM05sSlRjMWxmYmtKVE1GRRAB",
            "text": "My all time favorite Japanese restaurant! I’ve been here many times and it never disappoints. Great food, amazing service I’ll definitely be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLdUVpWnY5b2Fma19BRRAB",
            "text": "Told 7 minutes but it took an hour."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSQ1oxUmZTMHN4UnpCT1N6UlRPUzFuYTFweVpVRRAB",
            "text": "This restaurant is the closest to perfection when it comes to freshly made entrees and service!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNVDNfTnJva2JTMG1nRRAB",
            "text": "Very nice sushi bar\nLocation is awesome\nThe sushi taste really good\nThey have a lots of choices.\nService is ok"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKR1Bwb1hFeFBteVpnEAE",
            "text": "I have had food from here 3 times now. Dined in once and take out twice. Really high quality food. Everything is made to perfection. Fair prices. Exceptional quality.\nUpdate 6/9. Dined in again and blown away by the quality of the food served here. I really recommend the Hamachi Kama, the miso black cod, and the Lion roll. As always great service and great value. Thank you Mikado staff for the amazing food and experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNMmM5Y0stdWVuZllREAE",
            "text": "High quality and delicious."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOMzVxNUNsNE0telBBEAE",
            "text": "We ordered via seamless. First time ordering. We were impressed! It was a late Sunday evening order. Delivered in a timely manner. And OMG, the box  container , the sushi was so classy. Will definitely order again 👏"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQTEp0ZWFaNHFMLWRBEAE",
            "text": "MikadoQueens had Salmon Cucumber Maki 8 piece Matcha Pudding is tasty. Sushi is good comes in a cute box with wosabi & ginger on the side in little plastic cups."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOVHB0Y0xzdW9tTkF3EAE",
            "text": "Love the presentation, and the food was delicious! Wasn't able take a picture because I couldn’t stop eating! Yum!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPUFRoN1gyN29DVGt3RRAB",
            "text": "The only thing I look forward to every week"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJLUY2UFRuOWF2QVV3EAE",
            "text": "Always do good and the staff is very kind!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZZ1lubWtnRRAB",
            "text": "Nestled near the border of Richmond Hill and Kew Gardens, this charming neighborhood restaurant offers a cozy dining experience.\n\nA quick note: their Maki rolls are served as 4 pieces instead of the usual 6. Everything is prepared to order, resulting in minimal wait times. I also tried their Nigiri Sushi, which was incredibly fresh and delicious.\n\nThis restaurant offers a straightforward, no-frills experience and is perfect for a quick lunch or a laid-back afternoon meal."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaFo3NEJnEAE",
            "text": "The food was great and so was the service!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOFl6QW9BRRAB",
            "text": "Such a hole in the wall.  But super amazing. From the moment you walk in , you fell transported to Japan. Small, quaint, highly decorated. Food was delicious."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvZ3NYQ1p3EAE",
            "text": "I loved this restaurant.  Would recommend and go again. Great staff. Sophia and the chef and waitress were amazing 👏. The caviar topped dumplings were too die for. Crispy rice good n tasty. The deluxe set and salmon avacado roll, spicy yellow tail roll and salmon kura don all had fresh, buttery fish. The eel was yummy.  The mango redbean icecream delicious."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbU9pX1RnEAE",
            "text": "📍Miakdo Sushi in Queens, NY is a super fresh sushi spot right in Kew Gardens Queens, NY. They have a great food and drink happy hour and the decor inside is super fun! It’s cozy and inviting. I loved the special rolls and they even have hot food options. Very yummy!\n\n🌀Yuzu Margarita\n🌀Lion Special Roll- Spicy salmon, tuna, yellowtail, avocado, tobiko, kani, crunch inside with seaweed outside\n🌀S-Bomb Special Roll- Salmon, avocado, rainbow tobiko on the outside & spicy tuna, shrimp tempura wrap inside\n🌀Gyu Don- Beef, onion, soft boiled egg, pickled radish and scallion\n🌀Spicy California Roll\n🌀Spicy Salmon Roll\n🌀Spicy Crab Roll\n🌀Ice cream sundae"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJei12NmVBEAE",
            "text": "Gotta share this hidden gem tucked in Richmond Hill called Mikado, and honestly. You know those spots that just feel right the moment you walk in? This is it. Got a cozy vibe with various Japanese artwork all over the walls. You could say it’s a small escape without leaving town. Grab a seat in this Japanese restaurant, order some drinks, and choose your meal on their menu. Mikado’s friendly staffs and their recommendations were on point. This is the kinda place where you get to chill and have a meal with a laid back energy that’s hard to find. Pricing is very reasonable especially for the quality you’re getting. Skip the congestion fee, dodge downtown traffic, and come get great dining experience with Mikado!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOF9xM01REAE",
            "text": "Fantastic ❤️"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2aHVYeHBnRRAB",
            "text": "(Came for dinner) Very small portions for the price—4 pieces of maki roll for $8. Got spicy tuna, salmon avocado and eel avocado roll. The eel avocado roll was the only one that tasted fishy and not fresh. The nori sheets on the sushi were harder than usual to chew. My partner got the truffle mushroom fried rice w/o bacon and it was a great fried rice but not for the price. It barely had a slight truffle taste. The cucumber salad with sesame sauce was not worth getting, it wasn’t flavorful.\n\nNonetheless the decorations and the plating were really nice! They have such cute plates and chopstick rests. And not all seats have a back rest to them."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbUozMkRnEAE",
            "text": "i got food poisoning and the service is really bad, the people are very rude and i would NOT come here again and it is really expensive do NOT recommend going here to anybody."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJZ3ZITW5BRRAB",
            "text": "Food was 10/10. Everything we ordered was delicious. Their hand rolls were (chefs kiss) delicious. The vibes were vibing, and we were not disappointed. Perfect spot for a weekend date night or a girls night with some amazing sushi. Definitely coming back!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNad01xeDF3RRAB",
            "text": "I love this place their really clean and their food is amazing great ramen sushi im so glad i found this place the food is sooo good and the best part is that its healthy. Mikado roll, S bomb roll, dynamite roll, shrimp tempura Maki buy it you won't regret it. It's expensive but it's quality, quality ain't cheap this is the best sushi place i love this place."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NE1IemJREAE",
            "text": "Mikado sushi is the best sushi in the world! So cute and so delicious!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3b19xNkdnEAE",
            "text": "First and last time ordering here fish from sushi smelled fishy I thought that was OK ate it anyway and my stomach hurts don't recommend 😕 😢"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3akpiUjFRRRAB",
            "text": "Feels like you’re actually in Japan! The decor is awesome. Fresh fish- we got the set for 2. Loved the matcha pudding dessert. It wasn’t overly sweet. The service was also very good."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3a0lEM1F3EAE",
            "text": "Little expensive."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQdzlQczJ3RRAB",
            "text": "Okay, so it's tucked away, it's tiny, it's Queens on Metropolitan Avenue- not high expectations, but-\n\nBOOM! High quality, delicious sushi- every piece!  Gorgeous presentation and adorable details like caviar/roe tastefully topped with gold leaf.\n\nWagyu is the real deal.  I would eat uni here every day if I could afford it.\n\nSure, maybe you can get a sushi party platter of low grade imitation crab meat and weird deep-fried rolls of  'mango, spicy, cheese, mayo' or whatever, and that's your jam.  That's great.  I love that for you.  Tell me how the buffet at Golden Corral is this week too.\n\nBut if you're looking for high quality, delicious sushi- you could do worse than throw down some shekels here.  Treat yourself.  Treat a friend.  Treat a date.\n\nIt's worth it.\n\nUpdate; Service is still great as it's the food.  10/10"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnNzVuaVh3EAE",
            "text": "Everything i ordered from here has been delicious. was planning on getting again this weekend but the deal on ubereats is gone. Hopefully it comes back someday!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNneVk2OEd3EAE",
            "text": "Went for lunch. The food was good and the service was great. Will definitely go back again."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnZ3RySXlRRRAB",
            "text": "Lovly place and services are on point, we will definitely come back"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdklfQThRRRAB",
            "text": "This was my first time eating at the restaurant as opposed to ordering takeout. It was a quiet Friday lunch and our server was nice enough. The fish was fresh and the truffle fried rice was tasty. Three stars because the portions were ridiculously small and think at the prices they were charging, they should at least offer a free miso soup during a weekday lunch."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmejUydi1nRRAB",
            "text": "I went with a friend on a week night, it was pretty quiet but people began coming in closer to closing time. The service was pretty good. The food was definitely the star, the crispy rice was delicious and I loved this crispy chicken dish. The sushi was great as well. Not pictured are the chicken wings I ordered later on. Those weren’t my favorite, but everything else was good. I’d revisit for the crispy rice and that chicken dish for sure!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyM0wtLTFnRRAB",
            "text": "This Japanese restaurant is a gem! The aesthetic is stunning, with a beautifully designed interior that creates a serene dining atmosphere. The food is exceptional, especially the fresh sushi, which is some of the best I've ever had. The service is top-notch, with attentive and friendly staff who make the experience even better. Highly recommended!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBcmFIN2tBRRAB",
            "text": "this hidden japanese eatery is located in queens and the sushi here was super fresh. they have such a huge variety of donburi, ramen, hand rolls, and so much more. service was amazing. their hand rolls were huge. the deluxe set of 8 premium pieces were super fresh and presented so well. can’t wait to come back to satisfy my sushi cravings!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0MnZiTXFRRRAB",
            "text": "I am always a big sushi fan.  When my family and I came across this restaurant after a long walk in forest Park, my stomach started to roar, so we decided to have a try.  The foods were very fresh and tasted so good that even our stomaches were very satisfied, we still ordered one more roll.  Fishes were juicy, tender but still chewy.  Hot sake was a perfect match to our dishes.  The waitress was warm and friendly.  I told her that it was our first time there, she introduced each roll/dish to us.  Definitely will come back again!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBODZHUjFRRRAB",
            "text": "Must try in queens it’s a hidden gem!! Service was excellent! Was given a free cake for a birthday lunch which was so thoughtful! Food was delicious! Uni with toro was bomb! 💣💣"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMnVHclZnEAE",
            "text": "My roommate is a fan of sushi with reasonable price so he asked to visit Akagi sushi when he saw it opening in the neighborhood. The decor is wide-spaced and cozy with Japanese elements. The staff was really friendly and it’s perfect to have family gatherings.\n\nWe got Sashimi Deluxe, Chicken Teriyaki and 2 Special Rolls to share with a group of four. It was overall decent with great portion and proper price.\n\nMy daughter loved their Chicken Teriyaki. The chicken was soft and tender with appetizing sauce. Both Special Rolls looked beautiful and delicate. I am personally not a fan of sushi rolls but my roommate is extremely into it. He loved the Lion Sushi Roll so much which is in the front."
        },
        {
            "date": "1년 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsMFl1MUlREAE",
            "text": "味道真的不错，朋友都喜欢吃。今天还是比较幸运的，去了没有排队。\n环境很好 适合打卡拍照📷\n🍣食材非常新鲜，做得很用心。\n店员很贴心的介绍店里比较特色的美食\n还会再次打卡！"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUMDlXVzNBRRAB",
            "text": "The atmosphere was very happy and gave off a very cultural vibe- cool figurines with great music. The food was incredible and was served rather quickly! We ate the dynamite roll, edamame, gyoza, shrimp fried rice with strawberry bubble tea and Japanese soda. Serving size were perfect and the ingredients tasted very fresh. 5 out of 5."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUbWVxa2ZnEAE",
            "text": "Great atmosphere, the food looks like art, the presentation of the food is 5 🌟, the taste is also very good, really enjoyed the Kani salad, the Tempura appetizer was very delicious, lobster roll actually had good amount of lobster meat in it and it was very visible must try out this place. Awesome and friendly service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNC16SjR3RRAB",
            "text": "If you're in Queens and craving some fresh sushi or authentic Japanese flavors, Mikado is the spot to be! From beautifully presented sushi to comforting ramen, bento boxes, and crispy katsu don, every bite is a delight. 🍜🍱\n\nThe ambiance? Absolutely stunning—it feels like a little slice of Japan right here in NYC. 🇯🇵✨ And the service? Top-notch!\n\nDon't miss out on this hidden gem🔥👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMaUl2d0tREAE",
            "text": "I really like coming here! The food is excellent and the decor is so beautiful and different. Our waitress Helen gave A1 service!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcnNILXVRRRAB",
            "text": "Highly recommend this cozy place for everyone. Prices are fairly reasonable, especially for the freshness and quality of the fish.\nAdditionally, the servers were attentive and polite."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKZ2V5ZXdRRRAB",
            "text": "I'm not sure if it's new owners, but it's a new look and a few changes on the menu. More Japanese apps and dishes sushi is delicious and fresh as always. Great neighborhood spot. Service is good. The new added bar and decorations are amazing!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNF9QdFB3EAE",
            "text": "This spot is our new favorite japanese food spot in the area. As soon as we walked in, the japan feel like is just awesome. The food we ordered are very good, nothing to complain. Sushi are very fresh! Totally recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGMm96elBnEAE",
            "text": "Wow, truly a special place! Popped in on a Sunday night with a craving for yummy sushi. My boyfriend and I were both blown away with how delicious the food was. The atmosphere is great, servers were kind and responsive, and the restaurant itself was SO cute. I highly recommend the akagi roll! The akagi roll was truly one of the best rolls I’ve ever had. 10/10 stars. Do yourself a favor and grab some dinner here!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKam9xSXNBRRAB",
            "text": "One of the hidden gems of Queens! Must visit if you are craving Japanese food!\n\nLocation: It is located in Jamaica Queens. You can easily spot the restaurant because of it’s cherry blossom exterior. The inside is super nice with a lot of Japanese designs.\n\nService: they are super nice. They even gave me some complimentary appetizers. They are not rushing you unlike other restaurants.\n\nFood: Everything was delicious! SHUMAI: the color despise you, i thought it was not good because its too white but omg its very tasty! MISO SOUP: very comforting! SUSHI SASHIMI for 2: omg it’s a lot of sushi and sashimi, they were all made fresh in front of you! Every piece they took time to make! It was a plate of goodness! TEMPURA ICE CREAM: omg this was good as well, i finished the whole thing! I love how cream the red bean is! And it was fried perfectly!\n\nPrice rating: 7/10, it was not bad for food that you will get.\n\nDefinitely will come back here and try other items! Must try what I listed!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeGRQREpnEAE",
            "text": "wow wow wow!!!!! Finally something DIFFERENT!!!! I believe they have a new owner. The PACKAGING is so LOVELY. Its perfect for small party, company lunches!! Although the prices went up a little bit to due inflation or what so ever. But they are still much cheaper than most of the sushi places, their sashimi and rice quality is not even as good this MIKADO. The new owner improved the FOOD QUALITY!!! it's much better than before. You can literally taste the different! STRONGLY RECOMMENDED!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSeGVYbEd3EAE",
            "text": "The food was super good! It was hot and fresh! The service was super great! The waiters were so kind. The place was so cute with the lights and poster.I love how they were playing kpop music though.🤭It filled me up so much! I recommend coming here! 10/10! I would definitely come again!…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqN05uOWVBEAE",
            "text": "The food was incredible at this hidden gem. Wish I knew about this place earlier. My personal favorite was the california roll and tuna avacado roll.\nWill recommend everyone to try this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMUxqRmlnRRAB",
            "text": "As soon as I walked in with my son , I was greeted , very loving and welcoming ! The place is just Beautiful!!!!!! Food was a 10/10 . I would recommend this spot to everyone ♥️🥰 we lovedd everything about this spot and thankfully its in KEW GARDENS !"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6c3E2d3NRRRAB",
            "text": "Very nice authentic sushi place. It smelled very clean as i walked in. I sat down and was handed a menu. I ordered Yuzu cocktail and enjoyed the refreshing taste ! I ordered the 4 handroll set (which you could choose 4 diff handrolls) & an appetizer of shishito peppers that came with a side of yuzu. I chose Toro Scallion, Spicy Tuna, Yellowtail Scallion, and Salmon Ikura hand rolls. T\n\nLet me tell you, every bite just melted in your mouth. I also ordered the “Super Bowl” which was AMAZING !!!! It had Uni, Sweet shrimp, o-toro, & caviar with a little bit of gold flakes. It was $36 but it was worth every single bite.\n\nCustomer service was excellent and the ambiance of the entire place was delightful. Will be coming back to try more !!! Thank you for everything !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqaGQtdU5nEAE",
            "text": "I highly recommend Mikado! The sushi was so fresh and delicious, and my children loved the ramen! They even got kids training chopsticks. The service was friendly and the atmosphere is great—the decorations are bright and inviting."
        }
    ],
    "reviews_count": 63
}