{
    "name": "Tous Les Jours",
    "place_id": "ChIJjZstyWRhwokREkEfZXGTqFw",
    "grid": "QN8",
    "address": "81-07 Kew Gardens Rd, Kew Gardens, NY 11415, USA",
    "rating": 4.4,
    "user_ratings_total": 98,
    "phone_number": "(347) 644-1020",
    "reviews": [
        {
            "date": "8시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRFVtc3dOMkpYY25oaWNqQjFSbXhWTTNCM1RIYxAB",
            "text": "The almond croissant is delicious."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOc1VVTk1NbGg0UmpsT1pEWjNORkozY0dFeFkzYxAB",
            "text": "Great addition to the neighborhood"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213NVozYzVUVWh1WjJ0M2F6SjNTbFowVWpKUVZGRRAB",
            "text": "Me and my girlfriend came here for the first time and when I tell you to order a “Iced caramel macchiato extra sweet” it is to die for as well as the pastries, so good !!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsemNuRkdiMHh3WWpOd1p5MTZjREkwYTFoU1RsRRAB",
            "text": "Blonde girl at the register has too much attitude, I also work in a customer service but would never act the way she does with innocent people, food is delicious and space is cozy but i’m not coming again to this location and telling my friends too\nVery very rude"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SV1pGQkpZMlYyT1RoaWIydGhPRkpUTlRoVU4wRRAB",
            "text": "Very well kept with good music ambience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsR2MwRlpZVUo1VlROWFdIUldTMnB6TkVKSlJuYxAB",
            "text": "LOVE the muffins here and the may different fruit-including pastries"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KQkxVOUdjSEZ0VFdGT1EwWlllamx5YlVJMmVsRRAB",
            "text": "A great addition to our neighborhood. Very friendly staff. Great pastry, always fresh with large variety of items."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVmFHZHFURXh6T1RsRmJuVnRPV3M0Ylhrd1IzYxAB",
            "text": "This place is so fun, and great if you want to go with someone and try a few things.\n\nThe fruit tart was great, the tart itself was like a donut and it was filled with cream. I hate when fruit tarts have that gelatinous stuff covering the fruit and there wasn’t really any present on this.\n\nThe cinnamon cloud bites are like little mochi donut versions of the cinnamon bites you get at tacobell, sans cream."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vMVF6RXpNSFZFYVhneGVsVTVVVzlmVFdVeFZsRRAB",
            "text": "Never buying drinks here again. Order a chai latte... which was almost all milk with ice. No tea flavor whatsoever"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxU1VuaGtPRUZZUW5ONmNrOURNV0l4VUVaaGVVRRAB",
            "text": "Love love this place it’s my forth time coming here I definitely recommend a100 percent everything is delicious and fresh"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205dGVrcG9UblZxYmtobVZYVTFVa3hKTVhaVVMzYxAB",
            "text": "The fruit pastry is 💯"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWQmJFRlZSSGw1WjE5d05GbEVkM05rUkc4MWFsRRAB",
            "text": "Tous les Jours is my #1 favorite bakery! Hence I’m excited that they opened a new spot in Kew Gardens. The floor was spotless, items properly labeled for allergens. Servers were knowledgeable on food allergies and guided my selection of safe items on the menu.\n\nOverall, this bakery gets a 5 out of 5 stars."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCMlRIbGFla0k1VjBscU1GbGZTMjFIVjNBdGVtYxAB",
            "text": "Very dedicated and helpful workers"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4dVJGWm1jVUpmUjFocmFubEplbGs0VFZBM09GRRAB",
            "text": "This place I discovered a few months ago walking around on my hot girl walk as I like to call it and I came in here downloaded the app got some free cookies but still ordered a matcha. I come here from time to time now and the cookies are really good! I have had their coffee as well very strong and smooth and slightly fruity if you like that taste. I’m not sure what beans they used today but it tasted like a dark/medium roast. And I had their almond coconut chocolate cookie. I remember taking a video and raving how most cafes play music with lyrics or harder beats and it’s distracting when you want to hang out and get some work done but the instrumentals they play here is so calming and soothing and the overall aesthetic of this place is beautiful."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SRlNtMUhZMVpVVEZBMlVGOUtORFpHWW01NkxWRRAB",
            "text": "I don’t have to be a/indind"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSmIwOTZNazU0ZDBsc1ZubDVRV3g0UzJobk4zYxAB",
            "text": "Tous Les Jours in Kew Gardens is one of my favorite café escapes when I need something beautiful and peaceful. Their strawberry cream cake is chef’s kiss—light, dreamy, and not overly sweet. The pastries were perfectly crisp, and the coffee hit the spot perfectly complimentary. Bonus: it’s a gorgeous space for catching up with a friend or people-watching solo.\n\nStaff is friendly, the space is clean and airy, and everything in the pastry case is dangerously tempting (in the best way). Highly recommend going in the late morning for the freshest selection.\n\nIf you’re craving soft luxury in Queens, this is your spot!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNM01FRkpaM2gwTldaSlNFNVdNVGRHVkU1V1EzYxAB",
            "text": "Amazing service,  exceptional staff"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkMlVIbEljMWN6U0VsdWQyTkhVekptV2pKdmRtYxAB",
            "text": "My friends, staff, and I have been to this place and that the food there was wonderful that my staff got a croissant, croquettes, and many others. The service was wonderful and the atmosphere it was quiet."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRWNtbENSamhaVlVaS1NVeHVaeTAwTUhaWWFXYxAB",
            "text": "Rude employees. Both times I went, no greeting, no welcome,  and was ignored until I said something. They’re in their own bubble. The drinks are bland. The only half way decent items are the pastries. Due to poor service I won’t be back to this location."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0VGFVa3dSbmxrZGxSRWRXOVdZMFJCYjNweU0yYxAB",
            "text": "They gave me a small cake which was literally $43 dollars. That’s ridiculous!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sNWVFVnNiVTVzWDNabmR6a3liWFZQWkd4U01rRRAB",
            "text": "Pastries are usually not fresh, and there aren't many options available"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210WU9XOUtjMUZXWldKT1pVOVVObTVWY0VOaVgyYxAB",
            "text": "Very expensive! 6$ small latte!\nNo WiFi!!!\nSo unfriendly employees.. grumpy !!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsVVpFWkZSR3B2TjNFNWJIbEhORk5KTVMweFkzYxAB",
            "text": "Came here once with my gf. Staff are very nice, place if very clean, coffee is great. Pastries are amazing. Definitely recommend if you just need a space to study or a quick coffee."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQV0g0TnlpM196RUZ3EAE",
            "text": "One of my favorite bakeries in Kew Gardens. The pastries are always fresh, the drinks are great, and the space is clean and cozy. The staff is friendly and everything I've tried, especially the iced tiramisu latte and croissants, has been delicious. Highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKLVV3OUdNMTRqQmVnEAE",
            "text": "Got a tiramisu latte and after one sip realized it tasted extremely water down and disgusting. At this point we were still in the store and requested the worker if our drink can possibly be switched or remade. They made us wait over 20 mins to text and call the manager. After the wait the lady said she’s waiting for the manager to send over the recipe of the drink LOL. Absolutely pathetic customer service. Will def not be returning"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJbUEwSzZHNGF5ZnV3RRAB",
            "text": "We got my mom’s birthday cake from here and it was sooo good! Perfect consistency. I’m not a chocolate person (it’s my least favorite flavor). The chocolate cloud cake was fantastic though with the contrast of strawberries.\n\nAlso, they included candles and a knife set for the cake, which is very thoughtful as we did not ask them for it"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOMmRIWnpVbnBLWjE5bFRVNVNVVWhYT1RabmJtYxAB",
            "text": "Horrible service. I came in and asked for tiramisu matcha latte which has espresso in it. They gave me a regular matcha and it was a higher price than the one I ordered the day before. When I very nicely explained to the girl that yesterday they had put espresso in it and if she can please fix it she said she would have to charge me more. She was not nice at all or accommodating when I told her that yesterday they made me the drink correctly and for a cheaper price , (I even offered to show her the receipt on my phone) and today she was trying to charge me more to fix it. I took my drink and walked out. I will not be going back to this location and I will tell my family members that go there every morning  of the horrible service I received today."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPQ0x6NWlLdl8tVGRREAE",
            "text": "I ordered a cake in advance, but when I got to the store, they said they forgot to make it and asked me to give them some more time. I was speechless. The clerk had a bad attitude. They just threw two strawberries on the cake that was rushed out, and the original decorations on the cake were not put on. Fortunately, I opened it and checked it on the spot in the store, because I took a photo of the cake I ordered before and kept it. I told them that the cake I ordered was not like this. I showed them the photo, and they went in and threw some more decorations on it. I think the cake that was not rushed out carefully is inedible. I changed to another style in the store. This store is very bad. The service is very bad. Be careful when ordering cakes from them. It will delay your time and itinerary. I have never encountered this problem when ordering cakes from Paris Baguette before. This store was also recommended to me by others. I didn't expect it to be so bad."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJZXNyTmFQa3NyejVBRRAB",
            "text": "Great coffee and pastries!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKZml0Xy1KczctZHdRRRAB",
            "text": "It's a wonderful place  if you need to grab something to bite and go. Also the you can dine in which is has plenty of space. A place to come and do work if you are bored to be at home."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdnRqTWtBRRAB",
            "text": "This place was my go but there's always an issue with the workers whether it's incompetence or bad customer service. Ordered cakes with them on two separate occasions and both times there were issues.\n\nCake order one: I didn't keep my receipt. I have the name of the cake order and card that was paid with (my own card) and time for pick up all on hand but they gave me trouble because I didn't keep the receipt. I didn't realize we were still in the 1900s. If the worker told me to keep my receipt I gladly would've kept it? If you don't say to keep it why would I, most places can find the order in different ways.\n\nCake order two: Asked for a specific cake and asked if I can have it for a specific date (like a week later). Worker says yes no problem and I pay for it and do keep my receipt this time. Date and time comes by for cake pick up and they don't have the cake at the store. They say they'll have to make it and to come back 30 minutes later. We come back an hour later and they're like 'we just made it, sorry about that.' Like okay thanks for the three word apology but competence would've been preferred.\n\nOutside of the cake orders they're still making drink order mistakes and the workers are generally unfriendly even when we extend courtesies during checkout, they do not respond in kind. Will be taking my business elsewhere where workers are actually decent to interact with and orders are not consistently wrong."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZM3IzbkRREAE",
            "text": "Food is good but service is always bad. I've ordered cakes for pickup and they are not ready and have been skipped over on line and staff will just ignore me."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMnVXdlRnEAE",
            "text": "Fresh bakery and pastries (savory and sweets) a tons of variety too ! They also offered birthday cakes. The ambience is nice modern and clean. Service is just okay (not bad for NYC)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNGVtN3dBRRAB",
            "text": "A milk buns place, with many other sweets.  Good coffee.  A place that makes it really hard to select an item."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMEstb1VBEAE",
            "text": "Very similar to Paris Baguette, drinks, salads, sandwiches and cakes to go by the slice or whole, ready made and made to order.. Tasty Croque Monsieur,  and other sweet and savory pastries. Slightly hidden away from the busy Blvd, but very easy to get there."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveHBuUUpREAE",
            "text": "Small compared to the ones in flushing so there is less selection but overall a good addition to the neighborhood. Very clean space."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNzhlYmFnEAE",
            "text": "Very nice inside, I'm so glad they opened one of these up here. I will be here every weekend morning. I came first time today and got some kind of large tart and it was amazing. Cashiers were nice, very relaxing to sit inside, they open early, I will certainly come back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJemUtZHlRRRAB",
            "text": "Very clean store. Pastries were just okay. Tiramisu Latte was delicious"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MEoyS3VBRRAB",
            "text": "Their delicious pastries are baked on site. Staff was friendly and place was clean. I’d return again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3d01YZWxRRRAB",
            "text": "Tried a curry croquette and an almond croissant, both delicious"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dU8zd3N3RRAB",
            "text": "Tous les Jours has opened a new location in Kew Gardens! The atmosphere is elegant, and the quality of their pastries and bread is as excellent as ever. The variety is impressive, with highlights like their signature cream cakes and matcha rolls that are simply delightful. The service is top-notch, making it convenient whether you’re dining in or grabbing something to go. Perfect for professionals, students, or anyone looking to bring home some delicious treats. Highly recommended!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmanNQN0V3EAE",
            "text": "Last week, I visited a cafe shop recommended by a friend, and it definitely didn’t disappoint. They have a wide variety of desserts with distinct flavors and textures. The strawberry  croissant, in particular, was perfectly balanced between sweet and tangy—I couldn’t stop after the first bite. The interior is also great for photos, with sunlight streaming through the large windows, creating a truly soothing vibe."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmeU1PdmtBRRAB",
            "text": "A new cake shop has opened near my home, and the whole place is clean and tidy. I really enjoy coming here for afternoon tea—a small dessert and a cup of coffee make for a very pleasant afternoon. I also really like the staff here; they have great attitudes and handle issues promptly. Having such a delicious dessert shop near my home is truly delightful!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfNWJHTm53RRAB",
            "text": "The kimchi coquettes amazing a bit spicy,exactly how I like it. A bit oily for me but once in a while I can cheat too:) Curry one also yummy! Sweets looks great next time we gonna try that part from this store."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQXzVUaFBREAE",
            "text": "The bakery was fantastic! The pastries were fresh, flavorful, and beautifully made. I especially loved the croissants—they were buttery and perfectly flaky. The staff was friendly and the atmosphere cozy. I’ll definitely be back for more!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2enN5Y0RnEAE",
            "text": "pastry’s look amazing! very delicious and such a good place for breakfast"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2aThXX3ZRRRAB",
            "text": "Bread is freshly baked and taste amazing definitely recommend if your in the area"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnODdMcm93RRAB",
            "text": "Got a chocolate cloud cake recommend by the cashier ! And it was a hit at my husbands birthday ! Have to say one of my favorite cakes. It was very light and airy but still moist and not to sweet ❤️❤️❤️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRLThleVpnEAE",
            "text": "Popped into this tous les jours to get a nice treat. Didn't disappoint. The location is nice and bright. There is a wide variety of pastries, breads and treats out on display (behind sliding glass) for you to choose from. Good luck choosing lol. They all looked good. Even if you don't have a sweet tooth, they have savory options. If you have a sweet tooth....watch out!\nI got a fruit pastry. It's a cream filled danish with fruits on top. When I went to check out I saw they had a lavender latte. I don't really do coffee but I do like all things lavender. It was really good IMO. Will get both again. Staff was nice and they have tables and chairs for people to sit and enjoy their treats and or drinks."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcTVtUzVnRRAB",
            "text": "Called ahead to inquire about their cake options for a birthday event. They told me I had to order ahead if there were any specific cakes that I wanted. Placed an order for a mango cloud cake and told them I would pick up at 5pm that evening.\n\nWhen I got there, they said they did not make the cake. They said they tried calling me back (I have 0 missed calls from them) and since I didn't pick up, they didn't make it. Isn't that bizarre? I ended up picking another cake they had on display but this just makes me wonder if they did this only because they wanted to sell out what was already made.\n\nThere was another worker there that was pretty rude. I asked about the flavoring for one of the cakes displayed. He was uninterested in trying to help... and asked me \"well what does it say?\" Who does that?\n\nNot a great experience.  It's a new bakery so I'm shocked this is how the staff operates."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2eE83OVh3EAE",
            "text": "Lovely addition to the neighborhood! Service and baked goods are so lovely. Giving 4 stars though because the coffee needs work! I hope they can improve their coffees! Either way I’ll be there regular for the treats!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dFkyVWNnEAE",
            "text": "Please bring curry and kimchi croquettes to this location! As well as corn and cheese donut!!!!\n\nedit: croquettes are here!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMXFHNGx3RRAB",
            "text": "I got to Kew Gardens well in advance of a Lunar New Year event, so I decided to pass the time at this wonderful bakery. Didn't think I'd have two large lunch pastries + coffee for just barely over ten dollars! The kimchee croquette & the croque monsieur were a winning combination."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnaTVXcUtnEAE",
            "text": "so happy they opened a store in the neighborhood. love most of their baked goodies! highly recommend the mushroom onion pastry, taro cream bread, and coffee bun."
        }
    ],
    "reviews_count": 54
}