{
    "name": "Spolini's",
    "place_id": "ChIJK-MMKqxgwokRAfkM2YZvcIg",
    "grid": "QN8",
    "address": "116-25 Metropolitan Ave, Richmond Hill, NY 11418, USA",
    "rating": 4.5,
    "user_ratings_total": 272,
    "phone_number": "(718) 805-5852",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQmMzcERTVWRWWWxoM01HMUZVM1k1UkZkRmVHYxAB",
            "text": "The food here is always wonderful! Truly authentic Italian food. The staff is very friendly and welcoming! I love popping in for a drink or a nice dinner!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CQk9XSldhbkF4ZUc1RE1tMDVaaTFrYzBGUVJsRRAB",
            "text": "First time trying takeout from Spolini’s. The Margherita pizza was cooked perfectly with fresh cheese and flavorful sauce."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KaU0zUmpabWh0ZEdGdWVWZFNjRmxSYUd0cGVtYxAB",
            "text": "This place reminds me of Sundays dinners with family at my grandmother's house and it's the reason I go back. The food is just like home they great everyone in our party check us on during our meals and celebrate with us if we're there for a birthday or job promotion it truly feels like family"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBM1pEWnRNM0paVDBoV1NXaEdYemsxU2pkdlpFRRAB",
            "text": "Great food. Great portions. Terrific service. This place is a hidden gem. Get the meatballs!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUVJHTjNWemh0UzNRMFdVTlJjVWx2WXpGemVHYxAB",
            "text": "Food taste great and service was good but unfortunately the portion of the calamari appetizer was extremely small."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTmNISkZZa2hRU1V0QlIwSkxXVEZQTFdWWmVFRRAB",
            "text": "Sergio, the owner is extremely unprofessional. My fiance and I are having our church ceremony for our wedding on August 23rd, 2025. We originally agreed to a 4pm - 7pm event at Spolini's after the ceremony. After initially agreeing on 4pm, my finance and I requested we move the booking back slightly from 4pm to 4:30pm because our wedding ceremony was pushed back. Sergio agreed to this new time slot, so we figured no problem.\n\nI think Sergio must have been in a bad mood when I tried to drop off the deposit a few days later because when I arrived, he was giving me so much attitude and told me that he could no longer honor the booking because \"you're the type of people to overstay after 7pm.\" whatever that means. Even after showing him the email exchange where he agreed to the new 4:30pm time slot, he continued to be rude and very dismissive.\n\nPlease do not book this restaurant for any type of event. Really unprofessional and rude."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJanUyNUdudnZXM3FRRRAB",
            "text": "Phenomenal. The meatball...legendary."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMWFYdFVnEAE",
            "text": "We were really unsatisfied with our order. We ordered three entrees for pick up, which took over an hour. When we received the food, it was cold. We paid extra for chicken in one of the pasta dishes and did not receive it. All three of the entrees were cold and bland. We would not recommend this restaurant."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsaElpdFRREAE",
            "text": "The food is delicious!!\n\nThe people that work there are phenomenal..please listen to any suggestion they make regarding food or beverages!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuMGV6NHJBRRAB",
            "text": "The food is AMAZING. Incredible service. If you like Italian food you will LOVE this restaurant. Can’t wait to come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydWYzWlJnEAE",
            "text": "Very much disappointing ordered two seafood pastas and it was some of the worst pasta ive had in my life. Pasta tasted like it was made with chalk absolutely no flavor. Fettuccine Alfredo w shrimp had bland chewy shrimp. Linguine alla vongole had burnt and sour clams was honestly inedible. Spent a good amount trying things on the menu and just threw it out and ordered something else 👎 save your money theres many more places with better italian food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6NXZPZ1dnEAE",
            "text": "Wonderful customer service and pizza"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6dkl1YkhREAE",
            "text": "The staff here are so friendly and welcoming. I love the atmosphere. They have indoor and patio seating available. We ordered pizza and pasta with vodka sauce, both were really good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6OU1pbnp3RRAB",
            "text": "This was our first time dining at this restaurant, and I'm so glad that we did! Normally, we always walk by the restaurant and never took a chance to eat there. However, we decided to try it today, and may I say this is one of the best dining experiences that I have had on the strip. We sat outside for the outside dining, and it was nice. i do wish the seats had more cushion they are a bit hard. For our courses we had the fried calamari which tastes very fresh and it was breaded so perfect. Every bite was delicate and light, so we didn't feel stuffed when our entrees came. For the main course, we had the chicken parm, and the portions of pasta and chicken were absolutely perfect. I always prefer more chicken than pasta, so I don't feel so bloated. Dessert was a PERFECT Canoli and crembrule! The crust of the Canoli was perfectly crisp with every bite and was not doughy at all! And the filling?! My goodness was absolutely delicious. Finally the service, we had an amazing server his name was Larry, and he made our first experience absolutely unforgettable, we look forward to the next visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUODc3aWNREAE",
            "text": "Spolini’s is a few doors down from my apartment, and I frequently come here to eat. I have always had a stellar experience with their food and cocktails. My favorite dish is a new offering every time I visit. The menu of the day includes fresh caught fish, home made pasta and the occasional lamb shank or lobster ravioli. I would recommend getting a side of alfredo sauce for dipping their fresh baked breadsticks! My poison of choice is a concoction made by the house called a “pornstar martini” : which comes with a fruity martini and a side of Prosecco to cleanse your palette in between sips of heavenly libation (the cocktail earns its name after two to three of them when you get home!). Don’t mention that the tiramisu is fresh and made on the spot with delectable soaked ladyfingers in an awesome espresso. Whether family style, or for an intimate setting for a date - Spolini’s is a classy and hidden gem in Kew Gardens, New York."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUa1lxS2lBRRAB",
            "text": "Too much light. It's like a warehouse. The food is fabulous and the service, and parking is a gamble."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZaXNXUWxnRRAB",
            "text": "Good Italian food. Nothing especially fancy or unusual, but well executed. I had the veal Spolini, which was excellent. More recently the pasta carbonara, which is hard to find done well, but was excellent. Nice laid back feel, friendly staff, and quite reasonable prices."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREN19xUTBRRRAB",
            "text": "This was the first time I had been back in 20 years or so. On Easter day! Everything was very good and fresh. The service was spot on. My son loved the gnocchi with pesto!  Everything was delicious. The pastas were perfectly al dente and quite tasty! We didn't have dessert, we were so full! This place definitely has stood the test of time!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdjlTZ0xnEAE",
            "text": "Very good food wine and liquor in an immaculate setting. I recommend 100%"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5NTYyd0NBEAE",
            "text": "Came here for a Christmas party last year. The food and service was great! I would definitely return with my family to try some of their other menu items.\n\nThe only problem I had wouldn't apply to anyone else coming here, but for the Christmas party, the inclusion of a written menu with a description of each dish would have been helpful to both the waiter and everyone dining. Instead, the server had to individually ask every single person at each table if they wanted 1 of 3 options as their dish and he did so pretty quickly. Many people didn't understand what the options were upon his first recall and needed him to repeat it. I think the poor waiter said \"Chicken Francese\" 100 times in 5 minutes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkM0tPT1Z3EAE",
            "text": "Old-school Italian restaurant with the white table cloths and a small bar. Probably the BEST calamari I've ever had!! And the pasta was delicious as well!! I recommend this gem"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURON2FHYXVBRRAB",
            "text": "We've found our new family spot for special dinners"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxOXRpRXJnRRAB",
            "text": "Great food.. good people. Makes you feel at home."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxLXZ5bHhnRRAB",
            "text": "Foood was prettty goood. Its my second time...no complaints, good pricing. The only wierd thing,we were served big bowl of pamersan cheese which was ploppled away mid dining session to give to idk a different worker..he was dinning in to accompany his meal...they didnt ask if had enough cheese, it was just plopped away 😅😅. We got there a 3pm, we were only ppl dinnning there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxc3Vua0JnEAE",
            "text": "Very good Italian food.  Good service.  Everything is made fresh so there is a wait."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxZ3Q2MFlBEAE",
            "text": "Just enjoyed a beautiful Christmas dinner with friends.  So accommodating   Great staff. Service and menu choices\nEvery dish was delicious   You are made to\nFeel welcomed and whatever your needs or desires are - are met willingly   They made Christmas a very special\nExperience for us"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxOUsza0ZBEAE",
            "text": "Gr8 service... perfect drinks\nFood was perfectly cooked!\nFound this place on a whim.\nWill be back neumerous times!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWbDR2eG5nRRAB",
            "text": "Get the gnocchi. Personally I get it in the Alfredo sauce always delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGeDRYQWtBRRAB",
            "text": "Nice restaurant. I ordered the Gnocchi Pesto. The gnocchi itself was soft and fluffy and the pesto was light. Staff and service was nice. I'd visit again if in the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGcXBYYTlnRRAB",
            "text": "100% recommended."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlNHZlMVlREAE",
            "text": "I have been here before twice in 8 years since living in the neighborhood. My 1st two experiences in terms of food, was MEH. BUT , I am happy I decided to eat here again and will go back. I had the sausage and brocoli raab meatball appetizer and it was absolutely tasty. I loved every bite of it and at first didn't take a picture because I didnt expect it to be THAT GOOD. Perfectly seasoned, juicy, tender and home style meatballs. I'll be back to try more and here is a pic of the one meatball left on the appetizer plate after I destroyed the 1st one. Enjoy!\n\nUpdated : 10/13/23\n\nThe best pork chop on the strip."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdWRlTi1nRRAB",
            "text": "Love the food here. Reminds me of my Italian grandmother’s cooking growing up. Especially the spaghetti. The marinara sauce tastes home cooked. On my recent visit, I made a mistake in an order and they didn’t charge me. They are a 5 star service. Definitely  worth coming to this restaurant and having a wonderful dining experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNweUlyU0lnEAE",
            "text": "Authentic Italian food! Great wine selection! Delicious Calamari! Homemade Pasta! Excellent wait staff!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURha3VYczZ3RRAB",
            "text": "This establishment is conveniently located  to me.  Great food and service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNKODl0URAB",
            "text": "You could sit inside and outside and enjoy a great meal and you don't need too worry about dessert cause they have that to and anything you get is delicious so thats why i give this place 5 stars 😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4MzRlMHBBRRAB",
            "text": "I had true zabiogne made tableside. I haven't had this in many years.  These are real chefs who know what they are doing. Excellent restaurant"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4bDVLZ2ZnEAE",
            "text": "Overrated and overpriced. This restaurant seems to be living on old glories, but it needs to be updated. Atmosphere is uninteresting, service is just fine, and the food is average."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4cElTWS1BRRAB",
            "text": "This place is my favorite Italian restaurant. Glad to have it in the neighborhood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSZ2FUbEVnEAE",
            "text": "Great Italian 🍕 restaurant with delicious soulful food. Great service and ambiance."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSLUlyRXZBRRAB",
            "text": "The pasta dishes and pizza were excellent. Service was amazing"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPNS15bktBEAE",
            "text": "Great food and great service.  Tiramisu was clearly homemade, delicious to the last drop.\nEach main course was tasty and well balanced. Too often Italian places have the same standard 5 or 6 dishes, this place has a good menu of options. Will definitely come back and try more dishes."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDeU5tSEVBEAE",
            "text": "Decided to try this place after an Italian friend said to try it. Of course I took 2 friends with me. Dang it was good. You take a bite, close your eyes and the only thought that comes to mind is Italy os great, and food is the best.\n\nBy American rush service standard, service is \"slow.\" But we wanted Italian food and Italian experience. We had exactly that. It was perfect.\n\nYes, it was the best Italian food I have tried in the area.\nMust try it for yourselves."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxcHVieEtREAE",
            "text": "The food was so fresh & tasty. The service was amazing. The baked clams perfect, fettuccine Alfredo was to die for, rigatoni Alla vodka was mouth watering. I enjoyed the food, atmosphere, the service & the music. The entire place was perfect."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyMWMyd3BRRRAB",
            "text": "I have only been to this restaurant twice and both times I had a situation where the food was very blend I was not satisfied this time because they asked me if I wanted linguine and then they bring me spaghetti and I specifically told him…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRcDZUS1BnEAE",
            "text": "When we first arrive for dinner the service wasn't good at all. Felt as if I was being rushed to order. But as the dinner progressed the service started to get better. If it wasn't for the food being so dam good the rating wouldn't be high based on service but the food put it at the top. One hell of a chef they have back there."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxc2FXQmhnRRAB",
            "text": "Great service, delicious food and friendly wait staff!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDdHFLMmd3RRAB",
            "text": "If you have little ones 4 and under do not go here. My friend and I had a horrible experience. We met after a while of not seeing each other and decided to stop here to eat because the place was empty just another customer alone. We ordered a pizza for the kids which they all ate a slice from. My friend ordered some stuffed chicken which was okay. I ordered the eggplant parmigiana which I barely ate from because it tasted weird. I’m not Italian and I make a better one. The eggplant tasted frozen. They accompanied each of our plate with pasta which it tasted OK I’ve had better pasta as well. Kids were full and did not wanted it to be seated because people and dogs were passing by. They we’re playing from the sidewalk to our table and laughing, they were having a good time until one of the owners which was outside seating went inside and then came back out and told us if we could control the kids. They were not touching or braking anything, they were just enjoying their time together. I don’t like to argue, all I said was can we get the check please, the waiter asked if we wanted to pack the leftovers I said NO thank you, the food wasn’t that good to take home anyways. Our kids are 4, 3, 2 and 1. We paid for the food and left. I’ve never experienced this in any other restaurant."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnd1BHMHlnRRAB",
            "text": "Love this place! The pizza is always tasty and the staff is very polite. What more can you ask for?!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDc2JxQ0lBEAE",
            "text": "I visited the restaurant sometime over a year and a half ago. The calamari and white pizza was superb and tasty. The restaurant is quite and calm during the day. Expensive? Not entirely. Well worth the trip and pay on a day off from work.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxaWJyM093EAE",
            "text": "Went to this restaurant party for 7.The owner was amazing very friendly&hilarious..The atmosphere &cleanliness  was impeccable. The menu,desserts&fine wine was beyond our imagination  for it was not too far in our neighborhood. He made one of his dessert in presence of us.Truly unbelievable  Italian  cuisine.Best in Queens!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwbktEZk9REAE",
            "text": "Absolutely delicious and wonderful staff and atmosphere!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDcHFPNFZ3EAE",
            "text": "Horrible service! If I could rate them 0 stars I would.  The food was simply okay. My family and I decided to eat at this place because there was no one there. We had 4 toddlers with us and wanted the space. Specially since we're going through a worldwide pandemic. We practically got kicked out because our kids were \"being too loud.\" Our children did not break anything,  did not touch any of the surrounding tables that were ready for other patrons, were not making a mess..... we were treated as if we weren't paying for our food and service.  Had our children been crying or throwing a tantrum would we have been asked to keep it down? I'm disgusted by this place and their entire staff."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtaUo2TFFBEAE",
            "text": "I was there twice, a couple of weeks ago with my friend, celebrating her birthday, sitting outside and recently on my own. We ordered our mains and zabaione dessert + we got an extra chocolate cake on the house. Everything amazing. But…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPNTV5T1lnEAE",
            "text": "Impeccable service. I liked that they have a parpadelle dish (somehow other Italian restaurants don't always serve this). Also the watermelon arugula salad which was delicious. Good food, nice vibes, extremely attentive waiters. Would definitely come again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJd2JfaVl3EAE",
            "text": "An excellent Italian, neighborhood eatery.\nHad a number of items over the course of my visits and everything tasted fresh especially the veal and chicken. You can order individual or.family style. Staff is professional and prices are fair. If you want classic Italian food, check it out."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNncXZxbFF3EAE",
            "text": "Fast and efficient.... by far one of the best Italian restaurants in all of queens.  You must try the risotto and short ribs!!! But I have tried almost every dish and they're all amazing 👏. The staff is friendly and helpful.  Great place for to take kids or have a intimate dinner date.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2N3VyQ2N3EAE",
            "text": "About 20 years ago I went to this restaurant. The food was amazing then as it is now!!  I told the owner and he said it’s the same chef!!!  Must go amazing hospitality and the food my god is so good.  You will not be disappointed and the place is really nice!  Great first date place as well!"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRMDh6b1NBEAE",
            "text": "Great Italian  food,I love this place.\nWonderful staff,always friendly ,and I frequently accept what they recommend on the menu..\nWonderful and hard working owner,who works all weekends and works all holidays.\nI was never disappointed in my experiences,and everyone I recommend this place to,loved It.\nWhen ever I’m in the mood for good Italian food this is definitely my go-to spot🍷🍴☕️.."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDcjhPdTh3RRAB",
            "text": "It is my first time having a meal at this place and it was such a wonderful experience! The food was amazing and the service was definitely what made the experience even better. Larry is such a great person. Thank you very much for an awesome time! Will definitely be going back soon!"
        }
    ],
    "reviews_count": 59
}