{
    "name": "Nabhya Indian Restaurant",
    "place_id": "ChIJVWaXy_lhwokRtCxh8EQetP4",
    "grid": "QN8",
    "address": "120-35 83rd Ave, Kew Gardens, NY 11415, USA",
    "rating": 4.9,
    "user_ratings_total": 167,
    "phone_number": "(718) 374-3068",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwRlYxTXlOamxUU1ZWdU0zRXdTbGRSY21Rd2MyYxAB",
            "text": "Amazing food, generous portions, great service, butter chicken was phenomenal. Deserves a lot more recognition."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSR1puTkZUbWxSWW5abmVpMVRPV1ZNYUhwWWFVRRAB",
            "text": "Great authentic tasting food, amazing atmosphere and friendly staff offering recommendations. Look forward to coming back for the spiciest recommendations they have!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZeGJqRTNPR05QVXpoRlRtdFFjMFJrU1dJeE1uYxAB",
            "text": "I just had the lamb seekh kebab and it was spiced PERFECTLY. The butter chicken was flavorful and the naan is too good. I’m definitely coming back."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oSGFWTnhha1ZWVWtKd01YQTJjM1V0YUdsNlUwRRAB",
            "text": "It was great"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTVFsZG9iamhKUmpreFVtUmhZemRpUzNsYVRWRRAB",
            "text": "Wow! Amazing place. And the guy who served was so sweet."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSVYyUjFaaTEzZW1GRVNqUnhNa05XWVhCRGFIYxAB",
            "text": "This place is a great find! The food is really terrific. They are so accommodating and it’s a great dining room too. They have take out, but it’s a lovely atmosphere to stay and have dinner. (Photo is from 4pm, not prime time!)"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21neFVITlhWbGxTWHkxNk4yMXRhVGsyUkZCd1QwRRAB",
            "text": "Fantastic Indian restaurant in the neighborhood. We had our wedding dinner there. The owners are extremely kind and nice. The food is delicious and made certain dishes in accordance to allergies. Their service is top notch, and pricing is reasonable too! Definitely recommend!!\n\nWhether you want a cute date night or a moderately big party they can arrange it for you!! Excellent service!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWlprSk1iRWxIVkhadk9UTkNkMHN4TlhrNE5WRRAB",
            "text": "Ordered for pick up through Uber Eats and omg everything was delicious. Curry shrimp, mixed grill, garlic naan & the chicken samosas did not disappoint. Excited to eat in the restaurant next time. Thank you for an awesome meal!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGYU1rcG9PVVE1YVRKS1VGQkRWRTE1Ym5CSlpYYxAB",
            "text": "We ordered from Nabhya Indian Restaurant for our company lunch, and everything was amazing! The man who helped us was very nice and made sure everything went smoothly. The delivery was right on time, and the food was fresh and flavorful. We got the Chicken Manchurian, Chicken Noodles, and Veggie Fried Rice — all delicious! Everyone really enjoyed it. Highly recommend for great food and excellent service!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SmRqSlFibTVDUms5eWVpMW5PVGMyTldsbWVXYxAB",
            "text": "Not only my favorite Indian restaurant, but also my favorite restaurant PERIOD.  The owners and staff treat you like family.  The food is absolutely incredible.  Chicken lollipops are my favorite.  Highly recommend.  When my girlfriend flies in from Florida, this is the first place she wants to go."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTmRVRnBlVmt4V0VkR09FRk5VV2x2Tm5GdlZHYxAB",
            "text": "Came here for  date night and it was so good! The food was delicious and the server was very attentive."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1bmFHaEJVR2Q1WkZKTlgxSkpjRE5CVFU1bVZsRRAB",
            "text": "We ordered lamb korma. Delicious and tender. The palak paneer was just as scrumptious. Pistachio kulfi was the perfect way to end the meal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204eVRYUTFTa1Z5UTJodVJrRkdiVlZtVFdvM1VtYxAB",
            "text": "Peaceful friendly restaurant serving delicious Indian food in generous portions. The Mangalorean fish curry was unique. I had palak paneer (spinach and paneer cheese) for the greens. The bread basket is a versatile choice to taste their different kinds of naan, roti and kulchaa stuffed with onion."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kaE5FSjNTVVptTWxoRFMxcFVUMHAzZVc5dU5XYxAB",
            "text": "Absolutely incredible and authentic Indian food! We ordered the Lamb Rogan Josh, Goat Rogan Josh, Chicken Tikka Masala, and Lamb Korma, along with garlic and rosemary naan—and every dish was flavorful, perfectly cooked, and the meat was super tender. The portions were generous, with plenty to take home. The chicken samosas appetizer came highly recommended, and were delicious.\n\nFor dessert, we enjoyed a mango lassi and my favorite, rasmalai, which was heavenly. The restaurant is spotless and beautifully decorated, with very kind and welcoming staff and owner. I’ve tried many Indian restaurants, and this one stands out as the best. Definitely my new go-to spot!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tScFZXZ3hha3RpU0RKaFdYZzROSGxPYVhWbVQxRRAB",
            "text": "Very tasty food! First time trying Indian food and it’s was amazing"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxcU0xRXlibG95U3padVJHUXdjRXhHVlZWV1UwRRAB",
            "text": "Excellent Indian food and service at Nabhya. Chicken Korma was nice, creamy, and full of flavor. Samosas and rasmalai were great. Nabhya is much more authentic than your average Indian restaurant in the city, and this restaurant is up there with some of the best in the city."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21weWVGWTNUSFZ3U2pWNmJreFJWbUpIUWxONlVtYxAB",
            "text": "Wow! I am truly impressed. Everything about this restaurant was outstanding. The food, the wine selection, the hospitality and atmosphere. It felt like I was in India eating like a prince on my special day of celebration. Thank you for putting so much love and positivity into every aspect of the dining experience. This is one of my favorite restaurants in my home: New  York City."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGaU5tOTBObTlIUms1WlYyVmlkMjFxWW1wdVFWRRAB",
            "text": "Nabhya the Restaurant!\nFamily owned, TREATS you like OWN family, Pleasant SERVICE with big SMILE, LUSCIOUS finger licking FOOD, MUST TRY guaranteed you will visit OFTEN"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOSWNFVlhWMUpwTURSUVIxRklSbFpMWkhSMU1XYxAB",
            "text": "Found this hidden gem online. The menu has so many options so there is something for everyone. The food is outstandingly delicious and fresh, the customer service is fantastic, and the atmosphere is soothing and calm. Parking is really easy on Sundays during lunch. Chicken kali mirch with full spice, rice and garlic naan is a must. My only regret was not getting some goat rogan josh to go. I will definitely be coming back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWFdURkJTMEZOU1RSU2NtcHJkVVpVYjBwa1ZVRRAB",
            "text": "Nabhya quickly became my family’s favorite restaurant in the neighborhood. I can’t say enough good things about this restaurant from the food, to the staff and owners. The extensive menu definitely has something for everyone.\n\nWe’ve been several times and both the food and service are always excellent. We’ve tried several curries - the paneer is never overcooked and the chicken is always perfect and tender. And the spice level is always how we ask. We typically get a chili naan, that goes perfectly with the curries. Their indochinese is great, with the chili chicken being my favorite in the area. We often get lassi or chai as well, and we end our dinner with their delicious kheer.\n\nThe atmosphere is great. Good music always playing, but at a volume where you can still have and hear conversation at the table. The place itself is always neat and clean. And they’re always accommodating with our 8-month old. They’ve even offered to bring a few dishes out just for her so that she could enjoy their food and we didn’t have to sacrifice spice level!\n\nI’m so grateful to have a place like this in the neighborhood, and when I’m walking out the door, I’m already looking forward to the next time we’ll get to go."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTU1rWmZiemRvWVZOMmNFUk9jR295Y1RRd1dXYxAB",
            "text": "This was our first visit to Nabhya restaurant. We were immediately greeted and seated at a table for two by the window. There was music playing in the background at a volume that allowed for conversation and enjoyment of the atmosphere. The decor was simple, yet effective. Our waitress was very kind and prompt in taking our order.\n\nWe had the vegetarian samosas. The crust was light, flaky and the filling was flavorful and fresh. We also had the garlic chicken kabobs, garlic naan bread and the Indo-Chinese Chicken Fried Rice. The heat/spice on everything was perfection, and served to enhance the flavors of the food. The dishes were perfectly seasoned and the portions were very generous for the price. The fried rice entree was enough for two to share. It was my birthday today and I have to say I was blown away by this gem of a restaurant.\n\n10/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vNVpqUllWMUpDYjBvdFZVSllValJCYzJoblNXYxAB",
            "text": "The food is so good guys. I had the lamb vindaloo... amazing. My fiance had the chicken tikka masala. Also amazing!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSUU9XaDZZV1JHTWpkWWFrZG5jbE5tYmpaS05tYxAB",
            "text": "Visiting family and wanted to have some Indian and this place was great. Delicious food and we were looking for fried bread we know as Bhatura but we were offered puri which is fried and not on the menu and so delicious. Service was excellent also. Look at pictures of food!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxRGJGOUZVREJLYVdwU2VHOTZiRXhZV0hsTmFtYxAB",
            "text": "Came across Nabhya while visiting family, and it was such a great find! The food was incredible, the service top-notch, and the atmosphere welcoming. From appetizers to the main course and dessert, everything was outstanding. Definitely a spot to add to your list when you’re in the area. Thank you, Nabhya, for a wonderful dining experience!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwQ2RUSkVTRXh5TjA5T09VRldjSEZ3YVRWVFlrRRAB",
            "text": "Must visit. Food is too good. It’s beyond expectations. Very fast service and good environment. Taste is 10/10. Best Indian restaurant in the area."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5R1lYUkdTRTh5YlU5cGJrTnpPVmxhTVRKZmFrRRAB",
            "text": "What a gem in Kew Gardens.  Some of the best Indian food I've ever had. The samosas, butter chicken, biriyani, na'an, etc. were perfect and so fresh. The server was wonderful, and the owners are delightful.  Do not stroll over, run over and get ready to have your taste buds lit up. Thank you for taking a chance on Kew Gardens, we are so happy you're here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkSmFXWktXbTlNWTNsUlUyZHhNV0ZRUVZBMWFWRRAB",
            "text": "Perfect for a family outing on a Sunday with great drinks/food and exceptional service.  The place is clean and beautiful layered with warm lighting and the food was incredibly delicious. The host/hostess was really friendly,  helpful and suggested various dishes to accommodate our families for lunch and an outstanding overall experience! I highly recommend this lovely spot located in Kew Gardens!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SR04yOW9XbWxSY0dadE4wNVhjRE5oVURVd2RYYxAB",
            "text": "Visited this restaurant for the first time with my parents as we live close to Forest Hills. Service was great, food was stellar, and the owner & chef were very friendly and struck up a conversation with my parents for quite some time. Will definitely be paying another visit the next time that I’m in Queens."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xReFdrbFBaa05GUTA1eWJtcEVVazEwVkd4UlZVRRAB",
            "text": "Very disappointed and dissatisfied service.  So the Owner was on service and I asked her table was wobbly and she was so rude and told me that I was complaining about their service.  And we ordered food and asked her we need some sauce on side and she said kitchen is very busy they cannot do that. I was thinking what kind of Owner she is, very racist behavior.  I DON'T RECOMMEND ANYONE TO GO THAT RESTAURANT\n\nOne more thing food was absolutely testing and the employees too. BUT I want to say if any guest says that table is wobbly that time as a owner should not argue with guest, but the owner was saying that no one complain about table hablaaaa, and whe I asked the  lollipop sauce on side instead of saying our kitchen is busy we can't do that owner should use some professional word like our chef can not do that like, that kind of word.If your kitchen not busy you can not make money. MR AND MRS OWNER  I have no complain against you food or employees,  just I am politely asking you should handle customer professional way. I OWN places too."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSmVqbFRSMVpyTkdGVVRqSk5jblZMWVZGb1dGRRAB",
            "text": "The food and atmosphere here is so wonderful! The owners are so kind and loving and always doing their best to make sure their customers have a great experience. Food is awesome! I love the Mango Chicken. I cant wait to eat here again! And for anyone reading the reviews this is the best Indian restaurant in Kew Gardens. HIGHLY RECOMMEND THIS INCREDIBLE RESTAURANT!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xscE9UVmxTSG8yTVdSRmRUbHlTelJWYlVVNFFVRRAB",
            "text": "Lata mam and all other staff is great. We ordered chicken kadai and butter chicken both were delicious and chicken is very soft and quantity was great. Will surely visit again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oRmVrWkdaSG93WlVac1lucDFhWFJWTTFrMFJVRRAB",
            "text": "First time here - Got a bunch of appetizers and drinks, everything was very good! The owners are friendly too\nI’ll be back or getting take out!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xV2RtSlFjazlJWkhweE1ETlNSMmxRVmxwa05YYxAB",
            "text": "Food was absolutely amazing. Staff was kind and food came quick. We ordered the butter chicken and naan and it was the perfect portion for the two of us. Ordered lamb biriyani and tandoori chicken to go. Really flavorful and the chicken is not dry. Highly recommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4eldWWkZkbGRGWkhRMGNsVkRUalZyYnpGR1puYxAB",
            "text": "Food is soo delicious. It’s fresh and tasty. Staff is good. Place is clean as well. Must visit. Try veg manchurian and malai kofta. Very delicious"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSQ1NYaHlSaTE2U0RoMVZ6aGZaRWxJUlZwcFYyYxAB",
            "text": "Exceptional Indian food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210bVFVUlhaRGR6ZEVjMVlYQTJXVGxHVjFvMFpVRRAB",
            "text": "Good soup"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xdFlVVjBPRUpNYkRWck9VNUJiMDVEUTJsNGJHYxAB",
            "text": "I wasn’t sure if I should write a review since it has so many great reviews already, I didn’t want anyone to think the reviews were too good to be true.\nWe have been enjoying the food shortly after they first opened and have been consistently coming on a weekly basis, we cannot get enough! It is delicious, some of THE BEST Indian food that we have had. They are very consistent with their quality and flavor, everyone that works there is always pleasant and friendly. We are so grateful for having them locally so we can enjoy frequently! It’s a must try!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kalgyOVRVVWhzYW1WdmEyeDZNamt5UlRsSlUwRRAB",
            "text": "Extremely friendly and outgoing waitstaff. They went out of their way to ensure our grandson was accommodated, and offered to make food for him. Each dish was indeed different with unique taste. Portions were generous, and, the food came in a timely manner. We would certainly return there, and highly recommend this restaurant to friends and family members. Excellence, again and again🌟🌟🌟🌟🌟"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkNk9YVTNOWFpYV2xCbVkySnJNbkY2VkhGU1dVRRAB",
            "text": "I got two entrees: the chicken briyani and palak paneer, side of cheese Naan. Everything was delicious! Large portions. The best I've had."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGUmRWWTJWVFpwTVhGMlYzWktkek50YTNwWU9FRRAB",
            "text": "Brand new place that opened maybe 6~ months ago. Kind of stumbled upon this place by accident and was pleasantly surprised.\n\nHad the garlic naan, cheese naan, chicken korma, butter chicken, and mango lassi.\n\nThis place has some of the best garlic naan. Freshly made, crispy, light, airy, buttery garlic. I could use a bit more garlic (who couldn't?) but the thin crispiness is insane. My friend enjoyed the cheese naan more. I think the cheese is in the dough and it crisps up differently while imparting a delicious flavor/aroma from the cheese.\n\nThe curries come with rice, so you don't need to order rice too. I've been hunting for a creamy and nutty chicken korma forever (my ideal is from a place that closed down), and this is by far the best korma I've had yet. My only critique would be I wish they used dark meat instead of white. White meat ends up drying out. If they use both, I could not detect any dark meat. I mainly just want to eat garlic naan all day while dipping into the curry sauce, so not the biggest deal to me, but dark meat is the best in curries. Butter chicken was also delicious and creamy.\n\nMango lassi was good. Smooth, cold, creamy, mango-y.\n\nService was good. Food came out quickly. Price... was a little on the higher side, but nothing too insane. If the tandoor kababs were a little cheaper I would have tried them despite the large amount of food we already ordered. Maybe next time. I'll definitely be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPMlZsN1hQcS1fUGNBEAE",
            "text": "Truly an amazing spot for Indian!\n\nThe lamb khati rolls were an excellent start. Flavorful meat and fresh ingredients.\n\nThe curries were immaculate. Each bite had excellent taste, spice, texture, and aromas. The meat in the sauce was tender and perfectly cooked.\n\nService was great and the restaurant was clean.\n\nWould recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdDRtOXJBRRAB",
            "text": "Absolutely loved our experience at Nabhya. Nabhya is a fine Indian restaurant recently opened in the heart of Kew Gardens. The ambience is very elegant. The staff was very attentive and the owner Krutika was a great host and ensured that we had a great experience. Whether you’re looking for flavorful Indian food or celebrating birthday/ anniversaries Nabhya is a must visit. We enjoyed their butter chicken, Fish Fry, Daal and Chicken Lollipops. We forgot to take pics of Fish fry and chicken lollipops. Overall we had a great time and We can’t wait to go back again ."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBN0lEOXNBRRAB",
            "text": "I grew up in queens and have tried my fair share of different indian restaurants. Nabhya Indian Restaurant is by far one of the most delicious and affordable restaurants i’ve been to.\nWe all enjoyed the food and ambiance due to the cozy atmosphere and respectful staff. Overall, it’s a 10/10, definitely a Hidden queens gem."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLU0Y4by15aGJtNTlnRRAB",
            "text": "Great taste in a reasonable price for lunch special, love the taste of Chicken Tikka Masala and have to order 1 more portion to take home and enjoy with it later. But unfortunately they forgot to put the rice with it after they seems to forget to place my take away order 😩 anyways overall was good and will be back for sure."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmc29IQ2Z3EAE",
            "text": "What was formerly Eternity is now Nabhya Indian Restaurant; a truly authentic Indian experience that dazzled our palates. Fresh, made to order ingredients, with many options for both traditional and exotic cuisines alike. Prices are just right, and the service is warm and top notch. Looking forward to our next visit!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNS015ZXlhOGEtYUZREAE",
            "text": "Love Nabhya, really friendly staff and great service. I loved the chicken lollipop and they have a great mango lassi. The shrimp curry was also delicious."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MmZtUTBBRRAB",
            "text": "Exceptional food and service! Everyt item we bought was amazing! The server we had was extremely helpful in selecting menu items and had high quality customer service! They were very attentive to every detail (we dropped our fork and they noticed and got us another one). Highly recommended!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN1lxdVFnEAE",
            "text": "Ordered here multiple times and food is excellent. The price matches the quality and is worth every penny. Dishes come with rice but in my opinion rice serving is about 1/2 of what I need to complete entire dish."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLdjA2cFg5b1B5ekNnEAE",
            "text": "Family run business that makes excellent and authentic Indian food.\n\nFound Nabhya through a Google search and the reviews speak for themselves. Warm and inviting atmosphere with an attentive staff. Delicious Indian food that's an easy go-to option for dining in or taking out.\n\nFood can be on the spicier side. If that's not for you, opt for their milder options. But be sure to get an order of Garlic Naan and Buttered Chicken with rice when you can!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbEl5c01REAE",
            "text": "I had a fantastic time at Nabhya! The waiters and staff were incredibly warm, welcoming, and accommodating. The ambient atmosphere, complimented by soft music, made it a very enjoyable experience. Prices were also perfect!! 😄\n\nThe food was delicious! The Butter Chicken was rich and creamy, the flavorful Veg Noodles with an outstanding Szechuan sauce, and the Chicken Lollipops were nice and crunchy. The Mango Lassi was super refreshing and one of the best I’ve had! 🤩\n\nI'm looking forward to returning and highly recommend Nabhya for an unforgettable Indian meal! 😊😊"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZbUxiZjZnRRAB",
            "text": "One of the best restaurants in Kew Gardens!\nI highly recommend this place. The food is consistently delicious, fresh, and clearly made to order. I’m still learning about their cuisine, and the staff is always happy to explain the flavors and tailor dishes to my taste. Every visit feels warm and welcoming.\n\nThe space is clean, beautifully decorated, and perfect for dining in. I honestly can’t wait for my mom to visit so I can bring her here.  I know she’ll love it too. Great food, great people, and a great atmosphere!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZd0p5QTRBRRAB",
            "text": "Good food but very disappointed with the portion size in relation to the cost. I ordered a mango lassi amongst other things via uber eats and for $6, the size of the lassi is incredibly small and the cup wasn’t even filled up all the way!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQdWNXbVh3EAE",
            "text": "A very hospitable and talented chef with a unique menu! We asked for the Palak Paneer which they provided for us although it was not on the menu, along with Masoor Daal Tadkha and garlic naan. Phenomenal food, as someone who is Bangladeshi, this is by far the best Indian HALAL food we've come across in NYC. 100/10"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmaXYtcTZBRRAB",
            "text": "Nabhya, a new restaurant, has already started attracting good foot traffic.\n\nOur experience at Nabhya was great, with warm service and flavorful dishes. I particularly enjoyed the Mangalorean Fish Curry, which was creamy with the perfect balance of spice and tanginess from the mango. The Hyderabadi Chicken Biryani was fragrant and full of flavor, featuring juicy chicken and an excellent meat-to-rice ratio. The Chicken Vindaloo was perfectly spiced and had a wonderfully comforting, homey taste."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aT1VuTlhRWFJqVkV0bVltVnliREowTkRWUk1uYxAB",
            "text": "The Nahbya restaurant Indian cuisine is an absolute gem. Every dish we ordered was incredibly fresh and bursting with flavor! Even the sauces and pudding were amazing! This is what you call …GOOD FOOD! Beyond the incredible food, the staff deserves a special mention for their genuinely pleasant and attentive service. They are all so pleasant and welcoming ❤️Go to Nahyba’s Restaurant…you will not regret it!"
        }
    ],
    "reviews_count": 55
}