{
    "name": "C Kew Gardens | Restaurant Lounge Bar",
    "place_id": "ChIJbQIMXRNhwokR7nZXKR2_IQw",
    "grid": "QN8",
    "address": "120-29 83rd Ave, Kew Gardens, NY 11415, USA",
    "rating": 4.5,
    "user_ratings_total": 228,
    "phone_number": "(347) 494-4792",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wNGFsWllZMlZOYUVaM1VrZEdYMnRIZWtoSVMzYxAB",
            "text": "What a lovely establishment with fantastic food and wonderful waitstaff.  I came her for a surprise party so our party was pretty large and there was no mistake.  They were very attentive to our needs and made us feel welcomed.  Please support this small business"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNE1XV0h3EAE",
            "text": "Took my Mom here for Mother's Day. Gave it a long time to consider how harsh to review. We were sat over an hour late for our reservation. No food touched the table within 2 hours of the reservation. We were told we could only order from the brunch menu, then after waiting hours, they told us we couldn't have most of our orders because it was no longer brunch. The food that was brought out was wrong, cold, tasted poorly or all of the above. The only parts taken off the bill were the parts that were just the wrong items. The lack of consideration was puzzling. I rarely have a publicly bad thing to say about a restaurant experience, but I left completely furious and disappointed that the day was ruined. If I could give zero stars, I would."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwelJWWkVSMEY2VEdkbFZFTm9RbGxwY1RkVVEyYxAB",
            "text": "Very nice place for brunch, easy chill vibe!  Brunch menu is simple but with good food choices."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkV01VNXdURU54ZGxkalUwSjJkWFZtYVRKTE5tYxAB",
            "text": "cannot talk more highly of this place, quickly has become my favorite restaurant in the area. It’s expensive for the neighborhood but you can always be sure the food will be fresh and taste delicious. Still dreaming about their pasta alla vodka. 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WYVdXVlJMVkUwZDFWMFVYQndXWFl6U2pSek5sRRAB",
            "text": "One word - Cesar!\n\nOk, a few more words... C Kew Gardens was our pick after a long google search for a fun, scene-worthy and delicious option. It did not disappoint. The interior is vibrant yet tasteful, bold yet polished - welcoming us from the moment we walked in the door.\n\nA group of six of us celebrating a birthday dined on a Tuesday night and not only found parking but had excellent choice of seating inside.\n\nOur host for the evening? Cesar! From greeting us to helping dream up the perfect cocktails (and mocktails), Cesar felt like a friend we already knew. He made a great recommendations, took great care of our table and helped us celebrate life through music, food, drink and laughs.\n\nHow was the food? Very good! We started with the beautifully plated bruschetta and an order of burrata - delicious. The table ordered a variety of entrees and everyone enjoyed what they ordered.\n\nWe finished with some decadent tiramisu, gelato, and a group photo, with Cesar, of course!\n\nLooking forward to going back. Thank you for such a fun night!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WUFRIa3hlRlJCYldKS1R6VmhYemhrUlRGUGRWRRAB",
            "text": "Overall the experience was ok, pasta had no flavor and was overdone , lemon drop was really bad but my fiancé ordered chicken parm and he gave it a 7/10. We also ordered two fountain sodas which was flat so we got these cute tiny bottles instead❤️ bill was $80 and we tip $10 - the server was nice 😊"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSb01pMUdVbUZYYkZodk0xUlJTVVZMY21oU0xYYxAB",
            "text": "This is our go to spot in the neighborhood.  The menu stays fresh and the food is always very good.  The pasta dishes rival European fare and the decor is elegant and sophisticated.  The service is top notch, warm and attentive.  Ceasar, Klever and Megan are great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OMlkyZHJkVGRWUlhweVRUUkJZMmhLVTJ0b1lXYxAB",
            "text": "Truly authentic Italian food - delish flavors and top-quality ingredients that are hard to find around here. The service was excellent, and the staff were warm and friendly throughout. The decor is sophisticated and adds to the overall dining experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201QlJqUjJPV1pwZFdobFRteEVlbFZ2VldGWVNVRRAB",
            "text": "First off. The food was GREAT. My friends and my daughter are VERY picky eaters and ordered things they weren’t sure about. But they were really happy with what they ate. The food took a little long but when it’s that delicious, I understand. The drinks were good and the dessert was good too. Only thing is the “lava cake” didn’t do and lava’ing. It was like just cake. The kids were disappointed but not a big deal. I am not the biggest fan of Italian food(sorry). But I will be recommending this to all my friends and family who are out and about in Queens."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBeFpFTjJWSEpKTkdScVJWVkdRV2xyTUVWaWRFRRAB",
            "text": "Came here Saturday June 22 with my 2 kids. Food was ok. Service was ok. It’s July 1 and I check my bank account. They added $10 to my check after. It’s the second time this happened here. I’ll pay my bill and add a tip and they put another $10 on top. This is fraudulent. Won’t be here again since they like to add more tip after I leave the restaurant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJNm4yNnZHMGVQS25BRRAB",
            "text": "Great food , service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvc19HanNRRRAB",
            "text": "WOW! What a hidden gem! This spot had everything I didn’t know I needed! I even went back a second night while I was in town for the weekend! The food was amazing! Ebony in the kitchen is quite the Chef! She even gave me tips to make the perfect Italian grilled cheese! Cesar at the bar made me so comfortable I felt like I was chatting with an old friend! The vibe is dope! I will be back whenever I am in town! THANK YOU!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOTlMNUR3EAE",
            "text": "Really cozy and good food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvZ3N2UU5REAE",
            "text": "This restaurant used to have better service, however the service recently is sub par. The tables, silverware and glasses are dirty in here and they do not apologize for the cleanliness.\n\nThe pros of this place is that they have decent food, however nothing outstanding. Tbh it might just be better to make a pasta dish at home where you know the utensils used are actually clean."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMDQzSFdBEAE",
            "text": "The place has good vibe and music, the food is mid and dry. We were there for birthday, they charged cake cutting fee, which when I made reservations wasn’t mentioned. It’s okay, not a big deal but you are charging cake cutting fee and 20% gratuity, then I would atleast expect you to cut it for us and then bring the slices, which wasn’t the case."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3ai0yc3BBRRAB",
            "text": "Beautiful restaurant. Great service. Delicious food 👌🏽 👌🏽 👌🏽 the atmosphere is very sexy and intimate. We felt like we had our own private space. The service was on top of everything! They made my cousin’s birthday special by remembering to put a candle in her dessert (requested in my reservation) and they even gave us cookies on top of that to end our night.\n\nWill be back for sure!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNTQ3aVlREAE",
            "text": "This place is ALWAYS wonderful. Great food, great service and so beautiful inside. What a gem in Kew Gardens! Cesar is a fabulous server."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcXRhb2F3EAE",
            "text": "Went for a bday number around 12 of us not one complaint food was so good the atmosphere perfect drinks good! Servers on point n kudos to the cook/chef EBONY she did her thing on that food! Will definitely be goin back"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNROXNDWWR3EAE",
            "text": "Hidden gem ,!!!!!!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnX05yTUZ3EAE",
            "text": "If I could give no star to this place. We came from NJ to have Valentine’s Day dinner. We made the reservation for 8:45pm and we showed up on time. The server took our order for appetizers and main course. After 30 mins the appetizers were served. The time then was 9:30 pm. We started waiting for main course, around 10:10 the server and manager started to come to our table and telling us the food will be served in 1 min. At around 10:40 they still were telling us the same thing. The waiter has no manner. Never came to us what’s going on. Around 10:50 pm we left the restaurant without main course, as they still could not serve our table. The manager  never came to us to apologize or formally introduce and explain what happened in the kitchen. On the other hand, he was giving us a lecture about how it takes 25 mins to cook. Meanwhile, we ordered at 9:00 pm and left the restaurant at 10:50 pm without it. They served everyone came after us. They didn’t bother explaining what went wrong. Stay away from this place. NEVER AGAIN. HORRIBLE SERVICE. RUINED OUR VALENTINE’S DAY DINNER. 000 ratings."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbTVXU3BBRRAB",
            "text": "The drinks are greats!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBN3FpaGZREAE",
            "text": "I absolutely love C Kew Restaurant! Every time I visit, I’m blown away by the quality and freshness of the ingredients. Their burrata is incredibly creamy, the pasta is always cooked to perfection, and the truffle fries are simply irresistible. The flavors are rich and authentic, making every bite a delight.\n\nBeyond the amazing food, the ambiance is warm and inviting, and the service is consistently friendly and attentive. Whether you’re looking for a cozy dinner or a place to enjoy a fantastic Italian meal, this spot never disappoints. Highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMEpEZ2hnRRAB",
            "text": "This place was great!! Good and amazing staff. Cesar the bartender is amazing!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfcGZYbzlRRRAB",
            "text": "I would highly recommend coming here. The food is delicious and the atmosphere is very welcoming. The staff is very friendly, attentive, and went above & beyond to create a memorable dining experience."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfcGVYbmpRRRAB",
            "text": "Nice quiet atmosphere. The drinks are pretty good. They have one of the best fried calamari. I enjoyed my time here. I would go again. The prices is reasonable."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfb1lhNUt3EAE",
            "text": "This restaurant is a neighborhood gem. Michelin Guide quality food, with a classy, yet relaxed atmosphere. Cesar is always friendly, inviting, and accommodating while delivering exciting cocktails and chill vibes. This is the best place in the neighborhood for brunch, dinner, or even just a cocktail. Its our official date spot. My fiancé and I love this place."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfNXZ2ZXN3RRAB",
            "text": "C Kew Gardens is a special place. The staff, to include tenders, waiters/waitress, and chef are all very polite and attentive to customer’s needs.The owner is often visible and always warm with his guests. He balances graciousness and space. The cuisine is tasteful in portion and palate. All meals, day or night, offer delight. In addition, the locale has a classically chic design that immediately appeals to its patrons. Make the trip, you too will be instantly enamored. See you there. Cheers."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOUkzSkJnEAE",
            "text": "The ambiance of this restaurant is amazing. The cozy atmosphere, soft lighting, and elegant decor created the perfect setting for date night. From drinks to appetizers, we were very much satisfied. Would definitely recommend! :)"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdE1lNTVRRRAB",
            "text": "I've been here nearly five times now, and every visit has been consistently outstanding. The food never disappoints – always fresh, flavorful, and well prepared. I Highly recommend it to anyone looking for a place that consistently delivers delicious food. Definitely my go-to spot!\""
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfdEt2UEpnEAE",
            "text": "Absolutely delicious food and drinks !!\nAll staff are super nice ! Highly recommend!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfdE0zSk1nEAE",
            "text": "Impeccable food, drinks, atmosphere and service in an unassuming little spot. The menu is no bigger than it needs to be, but the space is perfect size to drop into weeknight, plan a dinner out on the weekend, or to reserve for private gatherings. I’ve had experience with each, and I’ve brought and made friends here. Glad it’s here!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcG92RzRBRRAB",
            "text": "This restaurant is sitting in a hole still not a lot of people know about this restaurant but I have to tell you you must go and try their food it's so amazing it's so tasty the seafood the pasta the drinks the service is A1 I recommend anyone to go to who loves seafood and pasta Italian restaurant check it out"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdzk2NE5BEAE",
            "text": "I just loved how cute this place is and the service and food was so good! I got the rigatoni alla vodka and sprinkle some chili flakes on it and the sauce was so thick and creamy. I had to stop myself from licking the plate clean. The espresso martini surpassed my expectations as well. The other local restaurants and bars do not offer espresso martinis which I found surprising so I was pleasantly surprised I was able to get one. The bartender made great conversation, if I ever come back to Kew Gardens I will definitely will be back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmeXJyUUp3EAE",
            "text": "I just left this restaurant for my birthday dinner. The restaurant and atmosphere is lovely but that’s about it. The server, Megan T, completely ruined the experience for me. While i was eating my food, i observed a long strand of hair “baked” into the pasta and immediately told her. Instead of addressing this, she quickly took my plate from me without even asking if i was done - i still had multiple piece of shrimp in it that i wanted to finish. In response to the hair, she stated “there’s no one with long hair in the back, and it’s not my hair” clearly insinuating the hair was placed there by me. Based on the photographs, it is clear the hair was cooked into the pasta. No apology or anything from her which should be the bare minimum. She walked away and returned several minutes later after i had to flag her down and she repeated that none of the cooks had long hair. Once again, no apology or any type of care that i had eaten a strand of hair. I would never return to this establishment until they hire people that know how to address customers’ concerns with empathy and care."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkbWJPR1FBEAE",
            "text": "We came for pasta and wine! The carbonara was delicious, as was the fusilli alla norma, however the fusilli was slightly undercooked/still white at the core. The spaghetti was perfectly al dente though, and we would definitely give them another try because both sauces were lick the bowl good! They were super busy so we didn’t want to send it back/wait longer for a replacement. It was also quite loud, making it difficult to hold any conversations. The wine pours were GENEROUS in lovely XL stemmed glasses."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQcnB1QVhnEAE",
            "text": "Great Italian food and warm atmosphere.  Staff are welcoming and friendly."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzOEo2TFpBEAE",
            "text": "Amazing vibes me and my wife always stop by for food and drinks"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzckxpWXdBRRAB",
            "text": "Nice little spot for cocktails and dinner"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcXFpOE13EAE",
            "text": "Fabulous!!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYN1BmSXJBRRAB",
            "text": "Amazing place. Great service.  Delicious food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMFBIUVFnEAE",
            "text": "Well well worth it! This hidden gem is located in the heart of kew garden near many local transportation! With ample parking and extremely welcoming staff, the restaurant was well worth the trip! The decor and atmosphere were amazing! Food was extremely delicious and fairly priced! They had a fun bar and a nice selection of cocktails and wines. The knowledge of the staff when it comes to drinks and different wines was top notch and very delicious! Overall, had an amazing dinner and experience.\n\nWill absolutely return!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4OGNHUm93RRAB",
            "text": "I was impressed by this neighborhood Italian restaurant, of its ingredients, dinning experiences, and services. Presentation and taste are key to enjoy Italian cuisine. C Kewgardens never let me disappoint. Highly recommend tuna tart tart, fresh in air. Other seafood from scallops to octopus, you name it, all like piece of art. I recommend everyone spend weekend night drinking and enjoying all the delicious food here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROLXJUVTJBRRAB",
            "text": "Came in for a late brunch and was so pleasantly surprised! Caesar was so amazing and friendly. We were late for our reservation so he was able to extend the bottomless.  So happy that we gave this place a try. The starter bread was fresh and super tasty and soft.   The Rigatoni alla vodka was cooked perfect and tasted great, wish they added more sauce because it was super good.  The Charlie burger was juicy and delicious.  This place is a gem! The decor and ambiance is 10/10!!! Such a classy place in the middle of Kew gardens! If you are in the area it’s definitely worth a try, you won’t be disappointed. The owner, sent over some rose for us after our meal and it was a sweet surprise! Thank you Charlie!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNweTRDdHNBRRAB",
            "text": "Wanted to really like the place. The atmosphere and decor was amazing. We are a family of five and we decided to have a  middle of the week family dinner after being in the neighborhood. The place is place is very well situated and finding parking was not bad at all. We were seated right away. There was also free wifi so that made things easy for our kids. The menu had the important staple food for any Italian restaurant. Our server provided the complimentary bread with olive oil right away. We got our appetizers and the quality was very good. But that's when things started to go south. The lasagna was very hard and dryer that expected. The ravioli with lobster sauce was also over cooked though the bisq was very taste. The only item that was good was the steak. We asked for decaf coffee at the end and they were not able to provide it. The place was empty the entire time we were there but the service was not great. We really came back a little disappointed with the food. But we are in the neighborhood a lot so we might try again because everyone has a off day."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6aDhyY1pBEAE",
            "text": "Cozy and vibrant Italian restaurant with tasty food and drinks. Would recommend for special occasions, and date night!\n\nFOOD: Hands down I have to recommend the ‘Gnocchi Del Giorno’! Creamy, savory and the perfect serving size for one! Wanted to order another one just to-go! My friend ordered the ‘Lasagna Verde Di Bologna’ - this was raved about on IG so we had to try it. They give you a pretty big portion  and it’s also very savory and tastes homemade.\n\nDRINKS: My friend and I both ordered the Mona-Lisa and the Siamo alla Frutta. Both fruity, strong and lightly sweet. Highly recommend the Siamo - strong sweet and refreshing.\n\nAMBIANCE: This spot gives off a topical jazz lounge vibe with olive green velvet couches , and lots of greenery. When I say cozy, it is small to medium Sized in terms of space and very intimate. I’ve heard they sometimes have live music and also a dj!\n\nOverall, this spot is definitely worth checking out and not super pricy either!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5aE5XbGFREAE",
            "text": "Super friendly staff and great food. This is a neighborhood gem, and I highly recommend this spot if you are looking for a fine dining experience in Queens. Cocktails are also better than most Manhattan spots (I recommend the Mona Lisa). We are regulars for brunch (especially the French toast) , but I recommend the dinner menu for a date night (it rotates based on the season)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLdl9iNG5BRRAB",
            "text": "Absolutely exceptional service and attention to detail. Not only that, the food was OUTSTANDING!! Delicious modern Italian fine dining. We visited for Brunch on a Sunday and had to come back the following Friday for dinner. This spot does…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyekxTY2VREAE",
            "text": "I visit NYC quite often and always have a complaint of not finding a quiet place to sit with a cup of coffee that has a charling embaince. Now I have found that place. C Kew Gardens has beautiful outside sitting. As well the inside decoration is very classic and charming. It was a very hot afternoon so I had pistachio and chocolate gelato. The taste was very good. And the person who served and took care of my order, I must thank her. I forgot to ask her name, she has tanned skin tone, tall, wide eyes with glasses and curly hair. So I hope the management will understand who she is and thank her from me. She was very kind and sweet. So on top of finding a pleasant place to sit and read and have delicious gelato, her kind yet competent attitude made the experience very wholesome. Thank you."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLMzlyNGR3EAE",
            "text": "My girlfriend and I have been here twice now. The first time for brunch, then dinner tonight. Everything was so fresh and so well made. Every dish was damn near perfectly cooked. The service was very friendly, and helpful when possible. And the atmosphere is gorgeous inside and out. Seriously worth every dollar I spent on it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkLVAzOER3EAE",
            "text": "Absolutely LOVE this little piece of gem. Such a cozy and homey atmosphere. Came in for dinner with my girlfriends and we had such a great time, the food was amazing and the service is top tier. One of my favorite place to have dinner!!! The owner Charlie always makes you feel welcome!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHbi1mLTl3RRAB",
            "text": "Began my quest to find and rate the best Sunday brunch locations in Queens, and I am very much delighted to recommend this cozy lounge and restaurant to everyone with the same pursuit. What a pleasant atmosphere, the green interior décor and chandeliers have a certain poetic eccentricity to it. The management also employs local musicians, a talented duo was playing when my friend and I visited. I ordered the Croque Madame - just filling - with a sumptuous pouring of Asiago cheese and Béchamel sauce. I was told by my very amiable waiter Cesar that I may have been one of the few who was able to finish it, given its huge serving. (That is - most would brown bag it.)  I partnered this dish with the lovely Siamo Alla Fruita cocktail - just the right sweetness. How could I not have visited this place earlier when I’m just a stone’s throw away from a nearby neighborhood ? I definitely would come back to try their desserts; their Tre Cioccolati with Tahitian Sauce sounds very inviting.  C Kew Gardens should be in everyone’s brunch list from now on. My compliments to the management and staff!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLeTRiTkhREAE",
            "text": "Definitely my new favorite spot. The staff are amazing and super attentive. The food is a MUST try, absolutely delicious and very well presented. Top service overall. Highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoLTVTaldBEAE",
            "text": "Came here for a Friday night dinner with family about 7:30pm.  The ambience is 5 stars. The music was good but a little loud for chilled out atmosphere so early in the evening. The ragu pappardelli was a little too bland. The endive salad did not have the dressing on it, it was on the side and was a little too creamy to hold the lightness of the endive, giving it the store bought taste.\nOverall I would go back for the drinks and ambience."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXbExtQTh3RRAB",
            "text": "Had brunch with a friend on Sunday 3/13, food, service, ambiance and music amazing! My only issue is that only one option was offered for a glass of Chardonnay at $17/glass. My husband won’t go because of this, he likes to have 2 glasses.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSLU15aS1RRRAB",
            "text": "If you're looking for a restaurant that delivers consistently delicious meals with excellent service, then look no further than C Restaurant. This establishment has become a go-to spot for foodies in search of delectable cuisine, and it's easy to see why.\n\nFirst and foremost, the food is simply amazing. Every dish is expertly prepared with fresh, high-quality ingredients, and the flavors are out-of-this-world. Whether you're in the mood for a classic steak, seafood, or vegetarian fare, the chefs at C will deliver a meal that will have your taste buds dancing with joy. The menu is extensive, and there's something for everyone, so don't be afraid to try something new!\n\nIn addition to the food, the service at C Restaurant is second-to-none. The staff is friendly, knowledgeable, and always willing to go the extra mile to make your dining experience unforgettable. Whether you're celebrating a special occasion or just enjoying a night out with friends, you'll feel right at home at this restaurant.\n\nThe ambiance of the restaurant is also worth noting. The décor is tasteful and modern, and the seating is comfortable and spacious. Whether you're looking for a cozy booth for two or a large table for a group, there's plenty of seating to accommodate parties of all sizes.\n\nOverall, if you're looking for a restaurant with great food, exceptional service, and a welcoming atmosphere, then C Restaurant  is the perfect choice. I highly recommend this establishment and give it a solid 5 stars!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5dDVlc3hBRRAB",
            "text": "We had an amazing dinner here. Service, food, cocktails, music and ambiance was all excellent. I feel lucky to have such a wonderful, special place in our neighborhood. Definitely will return."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxeV9mYmtBRRAB",
            "text": "Elegant, cozy, sophisticated but also relaxed Italian restaurant in a hidden corner of Kew Gardens. Fantastic knowledgeable service and top tier regional cuisine. This is not your checkered tablecloth and wicker chianti bottle spot. If you want real deal Italian and a lovely spot for a date - look no more."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5OE91RDVBRRAB",
            "text": "The food and service was exceptional. Staff was friendly, kind and maintained a very pleasant atmosphere. The menu is on the pricier side, but it does not disappoint in flavor profiles which tells me that the extra $$$ goes toward premium…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhM0xUR0dnEAE",
            "text": "Whether it is cocktails and appetizers, pastas or cheese platters and wines, I find this place brings a degree of wholesomeness to eating, drinking and socializing.  We were lucky to catch a bit of the live band on Thursday evening and it was a great start to the eve of a long weekend.  In totality, “C” seems to be climbing the ladder of a “must do” in Kew Gardens.\nAmbiance - 5 stars\nService - 5 stars\nFood - 4 stars\nCocktails - 5 stars\nWine List 4 stars"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNObmZUS2JBEAE",
            "text": "Enjoyable quiet place, and it's great for a date night. The drinks are very well made and the service is excellent. I would recommend this place to anybody who enjoys mixed drinks. Make sure you are going to the location next to the LIRR kew gardens stop."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2OVlhUUNBEAE",
            "text": "Beautiful Italian restaurant with a great outdoor space. Came for a Wednesday dinner and they had live music, such a cute touch! Service, food and drinks were all wonderful. Nice staff! Will definitely be back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNleG9QR2JBEAE",
            "text": "Been here for brunch and dinner. Their selections are all great, can't go wrong with anything on the menu, you just want to try it all! Staff is friendly as well."
        }
    ],
    "reviews_count": 62
}