{
    "name": "Tu Casa",
    "place_id": "ChIJUcR7IKVgwokR5XrxUICIjNI",
    "grid": "QN8",
    "address": "119-05 Metropolitan Ave, Kew Gardens, NY 11415, USA",
    "rating": 4,
    "user_ratings_total": 1344,
    "phone_number": "(718) 441-6363",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wd1JXTnhiMUZ5YjBkaGIzSXdNVFp6UTNKRFRsRRAB",
            "text": "I had a party for 12 and everything was perfect! Hospitality on point and the food spectacular! The server was so good that I added an additional 20% tip on top of the one already added Tomy bill.  Everything was perfect!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsSFQxbzFRbU5CVEhsdlJsSnhTV1phZEZGNFJGRRAB",
            "text": "I really enjoyed the food and although I was a little sad about no wifi my friends loved that.\n\nThe service was great and owner manager was even sweeter as she offered to share her personal WiFi with me next time.\n\nI would definitely go back and you should give it a go too …"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WaE5qVnBOeTB0Y1V4YVNsSjFjbkJWWVdSU2NsRRAB",
            "text": "Regular customer! This is one of my go to restaurants for Peruvian food! It is very very good food! Drinks are equally as great. The staff here is very friend and attentive. During the weekends, they do have live music which is very nice but does make it hard to have a conversation during dinner! Highly recommend!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sWFdXRmxkMGxMT1hOYVdHUXlaaTFCV2s5S1NIYxAB",
            "text": "Great food and service"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJelEyUTRNRkE1VEhoWFpYZG5UbW8xTjJ3eGExRRAB",
            "text": "Muy buena atencion Manuel nos atendio muy bien, agradable el lugar, limpio y una comida muy rica , lo recomiendo ."
        },
        {
            "date": "수정일: 1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sweWJrMWZSWEkxUVhGNmNXUm1XRkpPVjJZNE9IYxAB",
            "text": "Comí un ceviche mixto Y ME DIERON MARISCOS EN ESTADO (DESCOMPUESTO ) echados a perder vomite en ese momento en el baño y fuy a la mesera a decirle lo que pasó me retiraron el plato y me dieron un vaso de leche , no cobraron solo el platillo y todo lo demás SI nadie se preocupó por darme una disculpa\n\nESTOY INTOXICADO COM DIARREA DOLOR DE ESTOMAGO Y HUESOS ME HICE DEL BAÑÓ EN MI ROPA DE LA FUERTE DESIDRATACION QUE TENGO Y LA TEMPERATURA , estuve todo el día en el hospital hoy y no puedo trabajar en una semana\n\nNo recibí ninguna compensación absolutamente nada no me dejaron tomarle foto al ticket pero tengo el cobro de la tarjeta del día que estuve ahí\n\nTENGAN CUIDADO GANAS DE DEMANDAR NO ME FALTAN"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4MWN6bFBTVVZXT1RaYVZIaEtkMU5zT1RSMWRVRRAB",
            "text": "The food is always good here! The drinks, well at least the caipirinha are good. That's my favorite."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJelQybFNjVEo2YmpVMmRERjVXVk5DTVZjMGRrRRAB",
            "text": "Service was great and food was delicious! highly recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRGMxcGFkM0Z4ZURVM2IydFNiMlZhUVZWQ1luYxAB",
            "text": "Most people that work in this place are extremely rude. Specially Sandra who is answering the phone today if that's even her name. Terrible service. Delivery guy too. The manager (Giselle-supposedly) should be there more often to see how employees behave, treat customers and treat each other because we have witnessed the same in person. Disgusting!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTU5scFpkMHRaVW14SWNWVkNiV2gzUlZabldXYxAB",
            "text": "We had the absolute pleasure of dining at this incredible Peruvian restaurant, and can confidently say it's one of the best culinary experiences I’ve had in a long time. The food was super delicious — every dish was bursting with bold, authentic flavors and prepared with clear attention to detail. From the first bite to the last, everything was perfectly seasoned, beautifully balanced, and incredibly tasty.\n\nThe presentation was just as impressive as the flavor. You can tell the kitchen takes pride in their craft. Whether you're already a fan of Peruvian cuisine or looking to try something new, this place is a must. Amazing food, warm hospitality, and a true celebration of Peru’s rich culinary heritage. I’ll definitely be coming back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkcWVVVkNlSFJWY1dkNGNEVTRabE50VkhWck5uYxAB",
            "text": "Good food excellent attentive service but the red sangria I like more than the white sangria. Has a very nice patio for “al fresco “ dinning “ . Feel free to follow me for more reviews in instagram @la_hormiguitaviajera"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taNWNraFhNRzVpYWpoc01GVk9jbFo1UzNvNVpIYxAB",
            "text": "Very inattentive staff, been there twice and it's impossible to get seated, or even get the waiter's attention, who are just hanging around on their phones."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKRlluQk5TbFpLVjJ4cGVtSlVORXN5WW1KMk0xRRAB",
            "text": "Great music, really good food, wonderful service. Indoor or outdoor seating. Convenient to the Q54 bus- stops right across from the restaurant. Just lovely!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kS2VEaHRjREppVVVaUldraHNTbUpCVkV0SWMwRRAB",
            "text": "I placed a takeout order on 8/6/2025 and went to pick it up. I paid and was handed one tall bag. Since I had parked illegally, I didn’t check the contents. When I got home to Long Island, I realized the order was incorrect. I was missing two large soups, I received fried ripe plantains I didn’t order, and I had asked for large yellow rice.\n\nI called the restaurant to report the issue, explaining that I lived far away. The young woman at the front desk told me I would need to come back that same day to get the missing items. I asked if I could pick them up the next day (8/7/2025), but she said no. When I asked to speak with a manager, she told me no one was available to come to the phone.\n\nI found this very disappointing. The service needs serious improvement, and the staff should be trained to handle customer concerns more professionally. Management appears to lack the responsiveness and leadership required to properly serve customers, especially when mistakes are made."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0M1dIVmthbkJQVXpWamREUnZNbEpoVEhGMUxWRRAB",
            "text": "i really enjoyed the tallarines verdes with pollo, delicious,\nsangria was super good. thank you"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWRFJURXdTVFo2Um5oRU9Vc3hiVUpzVGtsSldHYxAB",
            "text": "Came a Thursday before 4th of July at 12ish pm. Delicious food, we got pollo empanizado, lomo saltado, and pollo saltado. Good enough portion and the server was friendly and checked in several times to make sure everything was good. The atmosphere is nice, cool enough to not sweat and the music is at a decent volume. Great place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KbVptZG9NbmhsTTJoQlUzRXlOWE4zTXpKYWFIYxAB",
            "text": "Tu Casa offers excellent service, delicious food and drinks, all at a reasonable price. Enjoy live music every Friday, making it a perfect spot to relax and have fun with family and friends."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VMXzRqX3JTbzhIa2x3RRAB",
            "text": "We went for a dinner to a friend’s recommendation and it was absolutely fantastic! The food was fabulous, nice portion and our waitress was outstandingly great! Today we decided on a lunch since I was still remembering the lovely dinner. Well, could not been more disappointed: they do not have lunch menu on PRICES but they certainly do on the PORTIONS! I always eat small portions but when I do finish everything on my plate, that means it was a very small meal. Also as the waiter asked what kind of rice? I opted for white-but got yellow. Which was not a big deal at all. But the portion was a real big disappointment!\nNo more lunch for us here for sure!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJNlo3TEN5d2FYZmJ3EAE",
            "text": "Food is great, workers are nice. With whatever questions I had, it was answered quickly and with great attitude!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPYVNxdDNLcmNUNFZnEAE",
            "text": "Delicious."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VNN3VxYjd4elp1blp3EAE",
            "text": "Peruvians are known for having some of the best chicken. This was sadly not the case for “Tu Casa”\nthe chicken was extremely dry and the green sauce didn’t make it any better. I will not be returning."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNN2k5b2o5azR6OXFRRRAB",
            "text": "Amazing food and staff!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMU9DMkxREAE",
            "text": "Visited yesterday, I believe my server was Janet & she has impeccable customer service, she’s so kind and well mannered. The food is always amazing."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJeDlTSnZBRRAB",
            "text": "The best tasting Peruvian cuisine on this side of town. Came here with a few friends we were greeted and seated immediately Sir Manuel G took care of us .The food took some time to come out but when it did it was slamming. The dishes were very well put together. I had the Bistec steak with rice and beans the steak was thinly sliced and cooked to perfection. My only complaint is the service I had to ask a few times for my drinks and I ordered a dessert it never came however I understand they might be a little busy and wait times may vary."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6X2FxY09BEAE",
            "text": "I live down the street I’ve come in couple times, one thing is consistent it’s the lack of service by the waiters.  I’ve been there with maybe 3 other people and not once was I asked if I wanted a refill on drinks, checked on, had to flag down to order, all while they were fully staffed all at the counter in their phones.  Last time I did go back because the food is good mentally prepared for no service but as I stood at the entrance sign to wait to be seated, 10 minutes passed and no one even acknowledged me standing there.  The place was empty and they were all running around changing tables, not once did someone said hi we will be with you in a minute (I would have gladly waited).. I just left and ate at the Indian place across the street which has amazing food and great service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bzVMVmR3EAE",
            "text": "Very good"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRamRtMkxREAE",
            "text": "We ordered the lomo saltado, our go-to Peruvian dish and it was delicious. It would have been a 5 star meal but the steak was overcooked and dry, otherwise the flavors were great. We loved the green sauce they brought out for us but wish they weren’t so runny!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdUpPZ3BRRRAB",
            "text": "I order the green spaghetti with a steak no great\nThis is my first time coming to this restaurant\nThe pasta is hard flavors just bland  the steak was hard and chewy\nWas mosquito all over\nHonestly I don’t recommend\nService was poor we wait a while to get just water\nThe guancaina sauce was not good didn’t taste anything like it was not blend good\nI give it one star for the Inca cola and the water"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndWQyemNREAE",
            "text": "Delicious food!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBajctNkRBEAE",
            "text": "The Lomosaltado is out of this world!!!!! Paired with the sangria!! Yummy. The staff are very friendly.  We hosted a family dinner of about 14 people and everyone loved the food."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmc2NhUmxBRRAB",
            "text": "El lugar que no desearas\nir nunca mas aqui todo tarda"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bF9XRVlBEAE",
            "text": "The Jalea had three shrimp a few pieces of fish, and the rest was calamari..  more yuca than anything else.  Sangria was blah!!! Won't be going back"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2enBUQnFBRRAB",
            "text": "Lady on the phone was rude and the delivery took over an hour. I will never order here again."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2anVxX2lBRRAB",
            "text": "The food and location are great, but the young lady in front could take some time off because she needs to chill. Buyer beware."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2anNyc1dnEAE",
            "text": "The most essential part of any business is customer service, and this place definitely misses the mark. The food is great and it used to be one of my go-to’s, but I don’t think I’ll be a returning customer anymore."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2OXZLTWVBEAE",
            "text": "This restaurant was recommended by a friend of mine and decided to order take out.  He placed the order for the both of us.  His food was better than mine and here is the proof that I ordered the Ensalada Con Aguacate (Salad with Avocado). The avocado was turned over so you could not see the bad part on the salad.  I turned it over to my horror and it was not edible. Restaurant wants the public to dine out and this what you get served with bad food.  No recommendation from me because food is more expensive and we are paying to eat crappy food.  The restaurant that does this to the public needs to be out of business.  To make matters worse the young lady came to our table and abruptly dropped the bags on the table with an attitude. Management needs to retrain their staff on how to deal with the public in a respectful manner.  Next stop is the department of health to do an health inspection of the business."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQZ2ZHWGpBRRAB",
            "text": "One of the best spots on the avenue to get food friendly people good food great atmosphere"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3eHNfRERREAE",
            "text": "Been going here for over a decade, and this place has always had the best, top of the line customer service. The food here is amazing, and has never failed to meet my family’s and my standards. Beverages, food, and specifically desserts are amazing. I wish they could bring back the chocolate brownie, with a scoop of vanilla ice cream and a cherry on top. That was truly a Tu Casa icon back then. Highly recommend this place. They have live music at times which is truly beautiful."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQza3RtRWhnRRAB",
            "text": "This place used to be great.  I'm not sure what happened. New ownership?  Went there with a party of ten people.  None of us are more than a few bites.  It was terrible.  Legitimately."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzelBick93EAE",
            "text": "As a Peruvian, I consider myself very demanding when it comes to eating at a restaurant. Why? Because Peruvians know their food by heart ❤️  we know how every single dish must be concocted.\nWhen it comes to flavor, we don't forgive anyone, and we're straightforward with our reviews!\nToday, I stopped by Tu Casa, and I ate a few dishes like Lomo de Pollo and Pollo a la Brasa.\n\nLomo de pollo 5 🌟  All the flavors were there! It was delicious and succulent! This dish goes well with the semi spicy green sauce.\n\nThank you!\n\nPollo a la Brasa was served 🔥 but it could be prepared better! 3 out of 5 🌟\n\nI have never seen a restaurant's restroom 🚻 so sharp and clean!  Wow... I'm impressed!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3aTZMOExBEAE",
            "text": "Food was delicious and we had a large party so they were more than happy to take our entire order handwritten out to make service faster as we had a short amount of time there. My water was never empty as once I took the last sip it was being refilled. The waiter never strayed too far ensuring to check on us periodically without being too overbearing. I highly recommend !"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVeGZHWVJREAE",
            "text": "Great spot to grab lunch or dinner. Service was quick and waitress was kind. Food was delicious. We ordered the sangria, it wasn't watered down, which was good. I would pass on the desserts next time, not very flavorful."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJajlhb0N3EAE",
            "text": "So upon arriving we were seated next to the door and obviously felt cold every time the door opened. There were other seats available so not sure why they weren't a little more considerate to seat us more inside. The waiter disappeared for…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5cGJ2SlBnEAE",
            "text": "Your typical Peruvian restaurant with run of the mill service. We didn’t have a reservation but didn’t have to wait to be sat down. We ordered ceviche to share and two entrees. The ceviche was fine. The spaghetti was a bit salty for my taste. The meat in the lomo saltado was very chewy and tough. We had to wait a while and search for our waitress. Seems like they were short staffed. This place is okay. They need to improve the quality of dishes served and customer service to match the prices on their menu."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVdzVtZ2ZREAE",
            "text": "This was my first time ordering from here and it was a great experience. Very nice Peruvian cuisine and food. The food I ordered cane out fresh and fast today. Ordered the Salchipapas and the Chicken stew, came at a low price! Inside the restaurant is decorative, clean and very nice. I will be returning to this location again soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWbC1qcGpRRRAB",
            "text": "Place is clean and food is decent but the prices are a bit steep for the quality. We order the papas a la Huanchaina, man, it was just bad. Ive had this dish made by other restaurants and family but when I ate it here, my taste buds were confused. I couldnt eat it but my friend added green sauce to it and she said it was okay but also confusing. I ordered the pernil with rice and beans, what a treat! I added their garlic sauce to it and it just brought out even more favor. I wish I knew the receipt to the garlic sauce oofff. My friend got the vegi chaufa, she liked it but there was a massive amount of cooked carrots. Like sliced, and placed on the side....odd. Environment is a bit dark and you can hear everyones convos but we came at a weird time so maybe it was just that."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKNnJyTzR3RRAB",
            "text": "I’ve been eating here for 18 years and have never been disappointed. I moved to Massachusetts in 2018 and anytime I am back in the area I come here to eat. The pernil is the best I have ever had, super soft and flavorful. Maduros are sweet and soft; I buy 2 quarts of the salsa verde to take home when I visit.\n\nThe atmosphere is loud and festive with a DJ on the weekends and a crowd of people eating and talking.\n\nCannot recommend Tu Casa enough. You will not be disappointed!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyblkzbFZBEAE",
            "text": "Haven't been here since the pandemic and I have missed this place. Every time I go to Kew Gardens  we like to eat here and I always get the same things. In the past I have tried the chupe (seafood soup), Maduros and the Colombian chorizo with tostones. My go-to meal is the pernil. I use the spicy green sauce on the table as my salad dressing and tostones dipper.. We sat in in the covered outdoor area which was brighter than indoors."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2dXJLb1ZBEAE",
            "text": "Came here with my friend who wanted to bring me to this establishment on 9/2/21. First off the service was extremely poor, by the fact we were not happy by the un-attentive staff & server. Sadly the food was really good! We started off our drinks & two starters, chorizo colombiano con tostones, & caribbean fried chicken tostones, then we ordered our entrees both of us ordered arroz chaufa, I had the house special & my friend had the con carne which was delicious. Sadly the service was terrible and we both felt unwelcomed since we both have disabilities, me being deaf & my friend being hard of hearing & visually impaired. Also I am a Culinarian & Foodie, I ate at the finest restaurants throughout the country and this establishment fell short. This establishment would have to convince me to return here and make it right."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXcnB6X1FREAE",
            "text": "2 reviews:\nThis time I ordered in person to go. Everyone enjoyed the tostones, rice n beans, pernil, steak, beef empanadas and roasted chicken. Food was hot and fresh when I got home too.\n\nThe photo is from when we went in person a month ago. Everything was delicious and we love the sangria."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQydmVIU3dnRRAB",
            "text": "Food is always great. Cooked perfect and fair quantity for the price. The staff seems to be stretched thin so it’s rare you see your server for the duration of your visit."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNnJydk1nEAE",
            "text": "I ordered the Pollo Al Ajillo. The food came out pretty quick. The chicken was very flavorful and perfectly cooked and paired well with the yellow rice. The atmosphere is very fun and friendly and the server was very attentive. Also the portions are generous. The salsa verde is amazing. We always get 2 quarts to go every time we come because it is that good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXX19ycHR3RRAB",
            "text": "Not bad but not WOW. Staff on the front end lacks attention.  Once seated and you get a waiter, then the service picks up, else it would have been 2 stars."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwd3JfRUhREAE",
            "text": "This is our second visit to this restaurant.  On the first visit we had the Chaufa rice with a whole chicken. The rice and chicken was good. On our second visit we started with empanadas appetizers one chicken and one beef. We both…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1OE5xeHdnRRAB",
            "text": "We've been there 2 more times since I last review of Tu Casa.\nThe 2nd time we went there with a huge disappointment.  At that moment we decided we'd never go back.\nThen we remembered how good the 1st time was and we decided we'd give it another chance.\nWe also asked the waitress the 1st time how they cookedThe fried Calamari. She asked us how we liked it.  I told I don't like  Calamari fried too long or with lots of breading.\nI asked her about the calamari  Rice Seafood Trafa. She asked me how I liked it I told her not cooked too long. I hate when it gets robbery.\nShe made a note of it and everything was wonderful. So my wife and I Decided to give Tu Casa another chance and it was delicious again.\nIt seems like I'll wait for snoop hole was a big part Of why everything turned out so nice the 1st time and the last time.\nI would recommend trying to get Nicole as for weeks if she's availableAnd don't be afraid to tell her how you like your food cooked.\nWe'll let you know how it is the next time we go back  😉"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2eGZydEd3EAE",
            "text": "Honestly the worst food I've had and I'm sad to say that because I've wanted to eat from here for ever! I got the Caribbean shrimp in a garlic sauce and it tasted like Alfredo sauce with lumps of garlic. There was no Caribbean flavor. For the price it was not worth it and I wouldn't recommend to a friend."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhenVqSkJ3EAE",
            "text": "Ordered from here today. All i got was a grilled chicken with rice and beans. My chicken on arriving home was so over cooked it was hard and crispy. Also for $15 I pretty much just got a container of rice and one tiny piece of chicken. Wont be stopping by here again. Waste of money."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwdmR5V2JnEAE",
            "text": "Placed a pick up order. First off they lie with options on their online menu. I order pinto beans and got watery black beans. Also ordered a half chicken with rice super dry, only flavor in skin very bland. The fry rice had not much chicken…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtdU5LQWRnEAE",
            "text": "If I could give this place NO stars, I would. This used to be the go to spot for my husband and I for the better part of 2 years. Our kids enjoyed the food here as well, so we would order about 2-3 times a month . However, in the past 6 months this place has taken a turn for the worst. We placed an order directly with them about 3 weeks ago and the food took over 2.5 hours to arrive! I was highly disappointed but decided to give them another try, but they doubled down by serving me raw chicken! When I asked to have my order fixed, they gave me a hard time about it, ie requesting for the raw chicken back (FOR WHAT?). Lost a loyal customer after this time around - will never order from here again. What a disgrace."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJaGJHZkNREAE",
            "text": "It was a great evening with friends. The food was so delicious i even over ate. Deserts were all tasty. Here on vacation and im going back before i leave for home. Excellent dining option. 👏🏽😍🍽🍾🥂…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxcXFtQmV3EAE",
            "text": "Muy buena atención, rica comida bien preparada. Recomendado .\nGreat atention, Nice food, recomended.\nExcelent attention, excelent quality food and great environment to enjoy any especial momento with family, friends , or date . 🙂😋😋😋"
        }
    ],
    "reviews_count": 61
}