{
    "name": "Dani's House of Pizza",
    "place_id": "ChIJCeaFFaVgwokRWbrmlcnEGzY",
    "grid": "QN8",
    "address": "81-28 Lefferts Blvd, Kew Gardens, NY 11415, USA",
    "rating": 4.4,
    "user_ratings_total": 2646,
    "phone_number": "(718) 846-2849",
    "reviews": [
        {
            "date": "수정일: 2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4bDdhdzdnRRAB",
            "text": "Love this pizza"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214S1FWRkJSR1ZGVjNwbGNYUjZZV2hIZVhKMlkyYxAB",
            "text": "Best pizza in Queens. If you know, you know. The sauce is immaculate and the quality hasn’t changed one bit in the last 15 years!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RMmIxRmlRM1pQVTJkUU4wSlVObWhXUm10ZlRYYxAB",
            "text": "Home of the original and best pesto slice in New York"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNVRVZExVbXRMZDA1MlR6QktPSFZuVUVsVVNuYxAB",
            "text": "Places like Dani’s are hard to find nowadays. We recently visited after moving out of the area several years ago and our memory matched reality perfectly. The perfectly crisp crust, the sweet sauce, the gooey cheese. We arrived at opening time and got seats at the counter, where the pizzaiollo kept the slices coming (my boys ate 4 each). We ate both regular slices and pesto slices and the adults polished them off with bottled craft beer from Dani’s massive selection. A must-visit in Kew Gardens!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsM2VsZDBRMWxMTTI1UmMxVlJXWHAzV21kcmJYYxAB",
            "text": "Dani's house of shrinkflation"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSbFUxZEJlbXQ0WXpGMFNuRkZkRXRXVjFwUGQzYxAB",
            "text": "this places knows Pizza! Great job"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsaGNYZEdTMDEyUTJKaFlXZGpSRWRsZEhKdGFVRRAB",
            "text": "Worst pizza ever, took 2+ hours for delivery. Pizza was hard as a rock and cold. Even after heating up it was still crap, will never order again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3NU1UTjFhMlkxYjNKdE1qZERSSEI1YmxwcU9GRRAB",
            "text": "The pizza is a 8 out of 10 , excellent structure it holds up well , the cheese is done right everytime , the line goes out the door cause its not much room inside , the servers aren't ignoring you they just going through the line how they see it, so if you waiting on line make sure u dont get cut ,the sauce is sweet but the pizza itself is done very right ,highly recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CblYySlVUM2R3UTBreWMyMXBPV1J5Tm5WRU0zYxAB",
            "text": "Good food but not so friendly staff. There's not a lot of place to sit."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaa2NEVndlREV4WXpOUFlsOXVPVkkxV0V3NFlWRRAB",
            "text": "Yummy"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSc2EweE1ORFJGTUhseVZWUnlaMEp3T0U1bVVVRRAB",
            "text": "One of those hyped up, praised places that just doesn’t live up to it.\nPesto slice lacks flavor, had to put some of the sweet sauce on it just to finish the slice.\nRegular slice is a decent NY style pizza. The sauce is definitely one of the sweetest and it goes great for dipping the crust in.\n\nOverall, it’s not bad but definitely does not live up to the hype."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nM1JVbGxOVTQxWWswMFNqbG5aMDg1VTBWeVVXYxAB",
            "text": "1000%  the best pizza there is in NYC. The owner and workers have the best communication. The pizza? Mouth watering. That sweet sauce just makes you want to take a 5 gallon bucket of it home. This pizza would make anybody from anywhere come to kew gardens just for Dani’s House of Pizza. This pizza spot is what kept kew gardens alive. I can see why it’s been open since 1959. I was eating, and they wrapped up the rush at the store half a block down in no time. All of these 1 star reviews is a bunch of BS as I’ve been coming here since I was a kid. Would recommend to come here if you love pizza!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjcHBTSm1nRRAB",
            "text": "2 Words:\nPesto Pizza\nNo better pizza in NY. And the sweet sauce is to kill for."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvNE5uVXpUakpyTVd4S1duUTVUa0k1TlZGRU4zYxAB",
            "text": "Classic Queens pizza joint.  Regular has a sweet sauce, and they're well known for their pesto slice.  All for some sauce on the side to put on top and you're golden."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tob09XWXhWRjgxZFZkVVpEY3hVMjlGVVhKVVMyYxAB",
            "text": "Best pizza in the area! The pesto slice w their red sauce is amazing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wMVVVMVZaR2ROYlZWSk1WcHFWamQ2VWxGcFZIYxAB",
            "text": "Dani’s House Of Pizza located in Kew Gardens, such a iconic pizza spot with great tasting pizza ! Best known for their signature pesto slices, would recommend adding pizza sauce on it for exquisite taste. Best to call ahead to place any catering orders or a pie itself."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBeWEwZG9PVXh3VDE5blVGQldaMUJRU21KaU5WRRAB",
            "text": "Delicious pizza!!!!!!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OV2VERnpjREJGYlhsUFMwaEJlbWhEUmtSdVRFRRAB",
            "text": "Best pizza in Queens. Top 5 in all of NYC."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQydnU3TU1nEAE",
            "text": "Great pizza"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOd2VHZFFVVFJSTTA5ZlRsVjRUVzFYYUZSV1RVRRAB",
            "text": "Queens best!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsSFIwWndNa0ZTTTJGaE9UVjNjR2h6Ymkxd2VrRRAB",
            "text": "Fire spot the sauce is incredible. Also Gotta try the  pesto  pizza\nFor pie I had to wait 75 min"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWFVtYzBNMDlwTFVwMFJFcDZjblYwVnpkcU1HYxAB",
            "text": "Dani’s Pizza is an absolute gem! The pizza is consistently delicious — perfectly baked crust, flavorful sauce, and generous toppings that never disappoint. Their menu has a great variety, but the classic cheese pizza and the pesto pizza with extra sauce are standouts that keep me coming back.\n\nWhat really makes Dani’s special is the service. The staff is always warm, friendly, and quick, making every visit feel welcoming. Whether you’re grabbing a slice on the go or ordering for the whole family, the quality and hospitality are top-notch.\n\nHighly recommend Dani’s Pizza if you’re looking for authentic, satisfying pizza and great service every single time!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oRmJrRm1hbVZmWVV0Tk5WWlVjekZpYWpjMlkyYxAB",
            "text": "Greatest pesto slice in queens and the best slice in the neighborhood. Dani’s is a Kew Gardens staple and everyone who goes there is sure to come back again for years and years just like my family"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pScVMwVldZbkZsYlhaQloxRXlkblJYVkUwd2NHYxAB",
            "text": "Grabbing a slice? Get ready to eat it on the run! The spot's tiny, and there's always a line snaking out the door. Those pizza chefs are working hard. Customer service can be hit or miss with such a small crew. But the pesto and classic slices? Seriously good. Totally deserves another visit!❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5Vk5rVXhiRzUzT0c1RGJsbDRXVXhYVDNkdlJXYxAB",
            "text": "Delicious food, open late"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pobmNEZHBTMGhqTTBOT1IwMTNaa1l6ZUU5TWMzYxAB",
            "text": "I’m allergic to pepperoni and they fix all different types of meats with the pizza even if you get a regular slice\n\nIf your allergic to ham, pig, pepperoni or other meat DONT EAT HERE"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZM2F6bEZUMjkwVVVJNFdUVjBibEZJUXpKMWVrRRAB",
            "text": "Danny’s the Best!!! all around and when I say totally the best is because it is❤️ Went to Celebrate our young Ladies Birthday 🎂🎉❤️ and honestly Danny and all the Guys that work at Dannys this Past 07/2025 Honestly are Family and There is no place in the World We could of wanted to be together as family than Dannys Pizzeria ❤️ Thank You for your Amazing Hospitality and for making my Young lady feel Like Home 🏡 you all treat everyone that walks through those doors to your Restaurant so Absolutely Amazing ❤️ In Behalf my Entire family I truly Appreciate you all🎂🎉❤️ If You want to Celebrate Your Love ones Birthdays 🎉 Dannys Pizza is the place ❤️ We Love you Once again We Are Beyond Greatful for making Her Day extra Especial God Bless you Guys."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOb1ZWaFVaVXRUTTA1aU5FZFRXRmR5Tm0xUFpsRRAB",
            "text": "I don’t know what kind of deal this pizza place made with the universe, but that sauce? Life-changing. I took one bite and briefly forgot all my problems. Student loans? Gone. Existential dread? Who? The pizza was so good I considered proposing to it. And the owner? He’s hands-down the nicest person I’ve ever met. Like, weirdly nice. The kind of nice that makes you question your own personality. This pizza sauce must be made with magic (or some ancient Albanian secret),  Honestly, I came in for a slice and left emotionally healed. 11/10, someone give them a Michelin star and a hug."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWMlZXUkRObWx0YVRWelJ6TnBibE5QT0VNd1JIYxAB",
            "text": "This is my non-negotiable stop every time I’m back in Kew Gardens, especially after a long train ride. The line? Worth it. The sweet tomato sauce? Iconic. The vibe? Late-night local magic.\n\nTheir classic cheese slice is always hot, perfectly cheesy, and nestled on a golden, crispy-but-soft crust that folds just right. This place is legendary for its sweet sauce, and once you try it, there’s no going back. If you really need the salt, get a pesto with bacon, omg!\n\nI was helped quickly and kindly even with a full counter. The staff keeps things moving, and the energy is always just right—busy but never too stressful.\n\n✨ What I loved:\n•\tThat unforgettable sweet sauce 🍅\n•\tCheesy, golden slices that actually fill you up\n•\tA perfect stop post-LIRR or late night out\n\nLocal gem. Total comfort. Slice heaven."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdU1WaEhiWFZvU3pGU2NVZFJiWFZvY2pRM05rRRAB",
            "text": "Best pizza in queens that pesto pizza is liquid gold."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVWN6TlhMVXBMYTFoMk1VeDVURWRaU2xGRFVYYxAB",
            "text": "Worst Sicilian pizza I ever had. Completely under cooked, doughy. Rushed. Hardly enough sauce and cheese. Just a square blob of undercooked dough. Over hyper pizza place Altogether."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDZ1pLRkhREAE",
            "text": "Worth the wait for a delicious $19 large pie! Plain slices are the way to go!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRU5tZzNYMHBZWldoTFEzTXpNbmhWVVdWM05rRRAB",
            "text": "chefs kiss"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taMU5sSnhabGM0T0VKdFdWQnFSMUpoUTBOd1ZHYxAB",
            "text": "Sauce is wayyyyy too sweet IMO, prefer a traditional nyc slice with salt and zest. Very overhyped, not poor quality pizza but won’t be everyone’s taste."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCNGV2T3BnRRAB",
            "text": "맛있는데 한 조각 스을쩍 더 넣구 돈 더 받네염^0^ 매번 그러는건 아닌것 같구여\n페스토 피자는 먹어볼 만 합니당 되게 기룸지구 클이스피해여"
        },
        {
            "date": "수정일: 9달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxdy1tN1F3EAE",
            "text": "얘기듣고 갔는데 진짜 피자 맛있다"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRGFtaDZVVWRZYXpJd2RsTnZNbFZOZFhoaE0wRRAB",
            "text": "Since 1959. Best pizza in Queens? The sauce is on the sweeter side, but for someone like me who drinks black sugarless coffee, I find it surprisingly tasty. Lots of ppl ask for more sauce on the side  Absolute nostalgic. The cash register is looking 50 years old, and the usual music you will hear is Sinatra. The most recent visit was Moon River in the background. Expect a 10 min. line every night. NYC gem."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNDVmZlZREAE",
            "text": "Dani’s House of Pizza in Kew Gardens just became my go-to spot in Queens. I tried their pesto pizza first, and it was incredible. The perfect mix of garlicky pesto, melty cheese, and a crispy crust. Then I had their classic cheese pizza, simple but packed with flavor. But the real surprise was the pesto pizza with red sauce on top. I didn’t even know that combination existed, but it was next level. The tangy red sauce mixed with the creamy pesto was something special.\n\nNow whenever I’m in Queens and craving pizza, I know exactly where to go."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNDdfR1pnEAE",
            "text": "One of my favorite slices of all time. Their famed sweet sauce makes the regular pizza fly off the counter. Their also famed pesto slice is borderline life-changing...so good. Both are crisped perfectly and not doughy. For a real treat, order a pesto slice with a topping of the red sweet sauce. Do not be intimidated by long lines (they move quickly) and locals who know the process, ie don't block the slices-to-go line when waiting for a called-in order."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3LUlybzl3RRAB",
            "text": "Every thing comes out fresh because there’s a line of people always doesn’t matter the time, pro tip: park in the back by metro north walk up. Either get a regular slice or a pesto slice with extra sauce. Can’t go wrong here, sauce is on the sweeter side but it grows on you, either grab a seat on a stool but if it’s packed/ metro north is cool to chill in your car & eat"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbUtuS013EAE",
            "text": "If you have yet to try the best pesto slice with marinara ever, you better run not walk! Absolute deliciousness in every morsel. I guarantee that you’ll love it and tell everyone about it and keep coming back for more and more and then more!\n\nThey don’t stay open late since Covid. Lines can be long so be aware. If you’re picking up pies, call ahead and expect an hour wait. Pesto with marinara is the way to go for us but they have plenty of options plus an extensive food and drink menu as well.\n\nBon appetit!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmOFpIcHV3RRAB",
            "text": "Hands down, the best pizza I've eaten to date! Found this place on a tik tok search of great pizzerias in the area. This was mentioned a few times, so I decided to take the advice and come. There was a long line out the door (good sign). Waited almost 20 minutes in 40-degree weather, just to order. When I finally ordered, I was told it'll be 30 minutes. Ordered a pesto slice while I waited. BEST PIZZA I HAD IN MY LIFE! Pizza came in the 30-minute time frame as said. Took the pepperoni with extra cheese and garlic bread back to the hotel for the family. They loved it. We loved it so much, returned the next day, and ordered another pie. If you're in the area, I HIGHLY RECOMMEND COMING HERE!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwclppbFF3EAE",
            "text": "If you are coming for a slice, be ready to eat it on the go. Small area, always line out the door. They are over working the poor pizza makers. Customer service can be shaky due to small staff. The pesto and regular slices are delicious. Definitely worth another trip!!"
        },
        {
            "date": "7달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMUp5UmJnEAE",
            "text": "Beste Pizza meines Lebens!\nKann die Pesto Pizza nur empfehlen. Der beste Teig, den ich jemals bei einer Pizza gegessen habe!\nDünn, unten unglaublich knusprig und oben dann so weich, kann man fast nicht beschreiben!\nAber lieber die dünne Pizza probieren, die ist besser als die dicke!\nMitarbeiter unglaublich cool drauf, immer wieder gerne hier!\nSehr authentische Pizza und Laden!\nWurde uns durch Locals empfohlen und hat sich definitiv gelohnt!\n(Tipp: vorher über die Website bestellen, dann spart man sich die Wartezeit vor Ort)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyb1pUcXZBRRAB",
            "text": "This is my go-to pizza spot! I took my friend from LA there, and she absolutely adored it. It's a true New York staple, frequented by locals rather than tourists. Don't forget to try the pesto slice with red sauce - it's a must!"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRMU9tZnVRRRAB",
            "text": "Certainly not the best NY pizza I’ve ever had, certainly not the best pizza in Queens however, I really appreciate a neighborhood spot with great service, polite staff that allows me the option of pairing a nice craft beer and chop away on…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtaWFUMC1RRRAB",
            "text": "The only pizza spot that I’ll stand in line and wait more than 30 mins in the cold.\nWe ordered:\n-pesto plain\n-pesto with sauce\n-pesto with pepperoni\n-plain with sweet sauce\n\nMy favorite is the pesto with extra sauce. Make sure to pre order if you want a pie and it definitely gets busy at night."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNscFlDN3VnRRAB",
            "text": "Regular pizza appeared to be medium sized. A little pricier but not terrible.Sauce was sweet. Coming out of the oven it was nice. If you’re a New Yorker who likes their pizza sauce sweet- this is the place. I liked the sauce but the pizza was lacking cheese and a crispy crust -though it was made nice and thin. Also had the eggplant parm that was very dry- had decent amount of eggplant but was like eating dry cardboard because of lack of sauce and cheese. Props to the workers there - working in a tight space but still managed to keep an eye out on the line to make sure    people were being take care of. There was a customer there who made a big fuss after skipping and loudly exclaiming that he was going to tell their boss—though they were doing the right thing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWcHZ5ZHlRRRAB",
            "text": "While in New York I ate here twice the pizza was so good. First night was just cheese and then I added tomatoes and spinach for the second try. I love the sweet red sauce pizza but the pesto looked interesting too. Price is good but it was warm in there, not much room and a little confusing. It definitely is worth it."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBdGVxVGF3EAE",
            "text": "Landed in JFK late at night on a Sunday. Was the closest pizza place still open. Would absolutely recommend! They’ve been in business since 1959 and for good reason! Amazing pizza (I had the standard of pepperoni, my girlfriend had olives…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvaUpHdi1BRRAB",
            "text": "Great pizza but the service was really lacking. When I ordered to go, he kept asking if I wanted it to go. It would have been fine, had he not gotten the order wrong. It was an unfortunate oversight.\n\nSadly, they did not have any Sicilian slices available which was what I really wanted, but the regular and the pesto pizza slices were tasty in their own right.\n\nI would go back to try the Sicilian. Hopefully, it'll be available the next time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqeXU2QmdnRRAB",
            "text": "Wonderful hospitality and atmosphere. Attention to details from all the crew members is impressive.\nNot only this, we also had a toddler with us and one of the employees made sure to mention to the baker to not make the pizza “too hot” for our son. Little things like this make the experience so wonderful! Not to mention the delicious pizza! A must have."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VKaVNrY0h5ay1fQUl3EAE",
            "text": "This place has alot of hype from tik tok. We've lived in the neighborhood for over 6 years and we figured we would finally grab a pie for takeout the other night. It was OK. The place was absolutely packed with a line out the door. I was picking up for a pre ordered delivery and it took me 15 minutes to get my pie. The staff seemed overwhelmed and disorganized.\n\nWhen I got home all excited to try the pie I was honestly pretty disappointed. It was nothing special. I really WANTED to like it but even my wife was like\" this pizza is mid at best babe- kind of a waste of time\"\nIt was on the better side of OK. The sauce was a little too sweet imo. I personally like Austin Street Pizza and Gloria's alot better.  La Rondine also has much better pizza & crust and they are our go to for delivery. I can get La Rondine delivered in less time than it took me to find parking, wait on line and come back home and Dani's is much closer in proximity. Long story short- beware these places with the Tik Tok Hype."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdWVlVXB3RRAB",
            "text": "There are a few pizza places in the neighborhood and each place has their own vibe and how they do pizza. But if you want a CLASSIC New York slice shop to visit, Dani's is it. While ordering delivery is always wonderful (and Dani's is one of the few pizza places who deliver in my community), I recommend visiting Dani's in person. You most likely will see a line, but be patient and order their famous pesto slice (or four) with sweet marinara on top, and ask to stay to eat at the counter. Once you sit, you get to watch the Dani's guys work and watching them is like sitting front row at a Broadway show. But this show, comes with incredible  pizza and a good beer list. It's great. Keep doing your thing, Dani's!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkN01HeVhnEAE",
            "text": "My wife and I grabbed a couple of slices after a movie up the street. We had the Sicilian and pesto slices. Both were fresh and tasty but the pesto was especially good. There’s a a line out the door on a Friday night which was why we were initially attracted to trying it, but it is very crammed as the premises are small. We also had to wait a while but it was worth it as the pizza was delicious. Thumbs up 👍🏽!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROOEk2dzJnRRAB",
            "text": "I ordered this food through ubereats . Trust me I know it looks good .\nLiterally received my money back for the entire order. Terrible calamari , over cooked very hard. The pasta sauce was okay but very dry. Penne al vodka pasta and calamari is what is ordered . I guess next time I’ll go for the pizza ."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oME1WbE5WMnRRTkZkemVuSTBTRVZ1TkhSR1VuYxAB",
            "text": "Not your typical new york sauce its definitely more on the sweet side but for some weird reason it does flow nice with the cheese and dough that they are using. Service was a little slow but the place was tiny inside so it’s understandable."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNTEh0YmJwalpLU0ZnEAE",
            "text": "This place is tiny but has been around for a long time and the pizza is great! Suace a lik on the sweeter side but I love it. Easily one of the best pizzerias in Queens... It's a must try"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNob1ptMm93RRAB",
            "text": "The pesto slice was good. Wish there was more cheese tho. Will try it with sausage and sauce next time.\nFriendly staff.\nWe waited 10 minutes for the pesto slice.\n\nUpdate - make sure to order ahead especially on the weekends because if you're just stopping by for a quick slice it'll take forever ( at least 30 minute for 2 slice). The ordering system is chaotic and they only have two ovens.\nBless the workers because they work so hard and seem like a stressful enviroment."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMUxfN3RBRRAB",
            "text": "This place Knocks it outta the park. Nothing beats a good slice here. I will say the sauce is on the sweeter side however that’s just what I like. Crust is really nice - a lil flop and good flavor. The restaurant is super tiny though so be prepared to kinda awkwardly stand there in a herd of people. Cash only for orders less than $10."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsaHFiTXZRRRAB",
            "text": "I got my best chicken parmigiana here. Pizza is fantastic! Pizza men here are superb!! Very friendly people and service. I highly recommend."
        }
    ],
    "reviews_count": 61
}