{
    "name": "La Casa Del Mariachi",
    "place_id": "ChIJPXzHFAxhwokR5GndYsGXVUw",
    "grid": "QN8",
    "address": "116-03 Metropolitan Ave, Queens, NY 11418, USA",
    "rating": 4.4,
    "user_ratings_total": 178,
    "phone_number": "(347) 732-3556",
    "reviews": [
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4NVVHbzFVRnA2ZDA1bGRUSnROMmx0WVU5YVExRRAB",
            "text": "This is the third time here and as always service is wonderful. They see you, and are quick to seat you and take care of you. So far all I have had has been delicious!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oNE9EVlROSFpSYnpkVFNYWk9Telp4V21zd2JYYxAB",
            "text": "The friendliest staff and eatery in our neighborhood. Outdoor patio, enclosed space feels outdoor-ish."
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toVFVtNUVOVU0zVVROTFVsRnRhMGxtT1c1dFpXYxAB",
            "text": "LA MEJOR COMIDA MEXICANA QUE PUEDAS COMER,GENIAL LA ATENCIÓN EL LUGAR ESPECTACULAR GRACIAS POR TODO"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWZlVuSTFWbkp5VGpCSmVrSmxka2hIYkdsb1RuYxAB",
            "text": "Servicio ⭐️⭐️⭐️⭐️⭐️\nCOMIDA ⭐️⭐️⭐️⭐️⭐️\nAmbiente ⭐️⭐️⭐️⭐️⭐️ thank you super recomendado"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jM1pVMDNTRFppVlVwcVIyaEhSREUxZVdkdlJXYxAB",
            "text": "Que rico lugar todo muy delicioso ,comida excelente ,excelente servicio ,agradable ambiente .me encanto todo riquisimo mi familia y yo tubimos una gran experiencia...."
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkek9VZFdNRnBwUmxwdmFFOXROVGs1V1VGd01FRRAB",
            "text": "LA MEJOR COMIDA MEXICANA QUE PUEDAS PROBAR,EL LUGAR GENIAL,LA ATENCIÓN 20 DE 10 SÚPER RECOMENDADO"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFeFFrcHVkbU5DVVdwQlpHcFFUM1JEUkd4QlYxRRAB",
            "text": "Not too long ago I came here and ordered the molcajete, and it honestly blew me away. It came out sizzling hot, packed with steak, chicken, shrimp, and cactus in this smoky, flavorful sauce. Every bite was delicious, rich, tender, and perfectly seasoned.\n\nYou can tell the food’s made with care and love. The staff was friendly, the vibe was relaxed. I’m still thinking about that molcajete. definitely something I’ll be coming back for."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTU5tUnhjVlF4UkRKU2FYaG5XVUpUVVhaUFozYxAB",
            "text": "Perfectly acceptable Mexican food. The service is outstanding and it's a nicely decorated place.  The fajitas lacked flavor and didn't come with salsa, sour cream or guac on the side.  Just shrimp, onions and peppers with little seasoning.  The drinks were watered down and the guacamole was very runny and vinegary.  Tacos were decent and the chips were good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrMUxXcDFMVVpPWms0MWMwaHpOMGhKUlZNMU9FRRAB",
            "text": "Very yummy food and the mojito was delicious! Attentive, friendly service. Will return!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWGIzaEZObXh5V0hZNGNYWkdiMEZyZURCUmFGRRAB",
            "text": "Bring seasoning, the food was beyond bland. The drinks were horrible, seating was uncomfortable but the staff were super nice and attentive."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GT04zSm1RMFYxZW5wQ2RuTTJWRVpUYWtaS2MwRRAB",
            "text": "This restaurant is very nice. Delicious food, good music, and exceptional service by Alex! Most definitely recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CM1JuaDBjRTFLVVZSdk0wUkVjRWxyVG1ZM1MwRRAB",
            "text": "I have been to this restaurant with friends at least 8 or more times. (Mostly recently was a few days ago.) Without fail, the service is simply outstanding. The wait staff are so courteous, accommodating, and polite to a fault.\n\nThe food is good and reasonably priced. The setting is very inviting, whether inside or outside. The owners obviously have great pride of place. The restaurant has beautiful flowers in window boxes all along the perimeter. This makes for a very pleasant setting. The flowers are obviously lovingly maintained."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGd1gwbG9hbkpxWW1sR2EwcDZXR1l6TTJ0T2QzYxAB",
            "text": "Service was amazing\nFood was great\nLive music was very entertaining"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUVluZHRaWHBSUm5JeVlsOWplWFZDVlVSUGVXYxAB",
            "text": "Beautiful hidden gem in the Richmond Hill/Kew Gardens area. Very festive and vibrant decor coupled with sweet, attentive service. Enjoyed their happy hour specials with consisted of a fruity red sangria and a savory, punchy michelada. I also had the queso fundido with warm corn tortillas on their appetizer menu, perfect compliment to boozy drinks."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VORHdoTy13d3NuSW5BRRAB",
            "text": "I have been to this restaurant at least 3 times. The last time I ordered from here, I ordered the chorizo nachos. Honestly, I was not impressed. The chorizo tasted more like ground beef. I did not taste any of the Mexican spices found in authentic chorizo. Not the Goya chorizo, I’m talking about the ACTUAL chorizo. The nachos could have used a little more cheese too. The pico and crema added more flavor and texture to the nachos.\nI gave them 4 stars because their drinks are the saving grace. Those little suckers are STRONG!!! Just the way I like it. The basil cucumber was very good just got a little watery to quickly for me. And I do not nurse ANY drinks. The drink menu is definitely a plus! They have some really interesting choices but I’ll let you check that part out for yourself.\nThe service is EXCELLENT. Staff is very attentive to your needs, knowledgeable about the food and drink menu and open to working with your suggestions and with making suggestions that fit your pallet. Dining outside is perfect in a warm day. A strong cocktail on a sunny day at this place? You can’t go wrong.\nAlmost forgot to mention. The place is very clean, especially the restroom. You could smell the cleaning products the minute you walked in. No overpowering bleach smells. Just the fresh scent of Fabuloso.\nBuen Provecho!\nUPDATE: I just found out that Mariachi’s occasionally perform here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25scldEbHhObDl6ZUVkM1VGSTRhRXByYlVKUVQzYxAB",
            "text": "This was our first time trying this neighbohood restaurant and all I can say is why did I wait so long?  The food was delicious, the atmosphere was colorful and cozy. The Jalapeños Poppers and Quesadillas were great starters, and the Bistec A La Mexicana and Tropical Salmon were full with great flavors. Our servers were great and made us feel right at home in our \"new place\" spending time with us giving us the full background of the place and checking back with us often to make sure everything was ok. They were so attentive that when I couldn't finish my coffee from being so full, they came to our table to ask if it was alright. This may have been our first visit, but it definitely wasn't our last."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOdkN5SlNadmEyVWlnRRAB",
            "text": "The food is overpriced and very bland. Not worth it. The sizzling fajita is very poorly made barely any salt and seasoning. If I’m paying $70-$80 I expect the food to taste good at least."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKemswcmVrdGQtVWZ3EAE",
            "text": "Great place, ambiance and staff. Truly happy to have a place like this around. Food was fantastic."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNbXpuTlBENl9XM3hBRRAB",
            "text": "Great tacos, friendly atmosphere, very clean."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZalByN3RRRRAB",
            "text": "The food was really good and I liked the music! The the soup and Elote I ordered were great too."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMElPM1dBEAE",
            "text": "Definitely a must try."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOXJXTmZBEAE",
            "text": "We love it here! Today we got the guacamole, esquites, chicken fajitas and pastor tacos and the passion fruit margaritas. The food is always so delicious, the drinks are strong and they have happy hour all day Monday-Wednesday!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMG9YaUhBEAE",
            "text": "I love this place. I’ve been coming here for 2 years. Lately though it is attracting people who permit their toddlers to run around the restaurant, screaming, crying, squawking and banging toys and silverware on the table.  Instead of leaving when they finish eating they stay and let other patrons endure the annoyance."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMWFqNjN3RRAB",
            "text": "Just passed by this place and wanted to order a drink and charge my phone. Ended up getting tamarind margarita and chicken chilaquiles everything fresh and delicious!! My waiter Luis was very friendly and helpful. Great atmosphere!"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBc1liY0xREAE",
            "text": "10 de 10 comida súper buena i sobre todo atienden súper bien son amables te atienden como en familia"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfa1lUZUNBEAE",
            "text": "Staff are very kind and nice"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNGZhb1BnEAE",
            "text": "A very nice place to just have a drink and relax. The food is very good . I love the avocado salad with chicken.  The margaritas and mojitos are excellent!!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkNk5IX1BBEAE",
            "text": "Discover the essence of Mexico right in the heart of Kew Gardens at La Casa del Mariachi. From the moment you enter, you're greeted with a warm welcome and the enticing aroma of Mexican spices. The menu boasts an array of authentic dishes, with the great Tacos stealing the spotlight. Each taco is a culinary masterpiece, filled with tender meats, fresh veggies, and zesty salsa, all wrapped in homemade tortillas. The Steak Mariachi with Rice and Beans offers a satisfying meal with succulent steak, fluffy rice, and savory beans. The vibrant ambiance, adorned with colorful decor and lively music, adds to the authentic dining experience. The attentive staff ensures a memorable visit, always ready to cater to your needs. La Casa del Mariachi is the ultimate destination for a taste of Mexico in Kew Gardens, perfect for enjoying with friends and family."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcnZibkl3EAE",
            "text": "This is the real thing!\n\nDelicious authentic food and drink. The atmosphere reflects love, appreciation for the rich, vibrant Mexican culture. Service: attentive, knowledgeable, friendly, professional.\n\nBest Mexican!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzblotZEZBEAE",
            "text": "The food was very good the service was excellent everything came out at a fast pace and all the food was very good as well me and my family got the ellottes fried calamaris and birra tacos and it was all great no complaints at all with anything."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMDRmcGtBRRAB",
            "text": "Un restaurante con ese nombre y lo cierran a las 10:30 pm los viernes es una falta de respeto"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcE43YmJ3EAE",
            "text": "Onlyb4 stars for food as I only had appetizers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuc0t2a0hREAE",
            "text": "Food was great…fish tacos tasted so good. service amazing, good drinks too! Will be back = )"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5N3NtcHVBRRAB",
            "text": "Delicious food and excellent service Juan and Susie gave us excellent and Professional service.\nKeep it up.......\nwill come here again.\nThank you."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIek95UEl3EAE",
            "text": "El servicio muy bien las bebidas están ricas pero la comida le hace falta un poco de sazon"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIb0wzdS1nRRAB",
            "text": "Food and service are great. Nice hangout. Pipian con Pollo was excellent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MTZuazR3RRAB",
            "text": "I came here for lunch and what a cute and inviting place this is. Will definitely be back for dinner or drinks. The bistec Mexicano, the chips and salsa, and my sangria were delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bFpQdmt3RRAB",
            "text": "I walk by the restaurant often and always want to stop by for a meal.  Today I stopped for lunch, it's hot out so the Margaritas were perfect, nice little buzz Tacos had great flavor. The rice is rice.\nThe atmosphere is very welcoming and the service from Jorge was great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bU5UUm5BRRAB",
            "text": "Delicious"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNieXBfRkVBEAE",
            "text": "Had the best basil cuke margaritas with jalepenos infused vodka  and the chicken nachos just as good as anything I've ever had in CA and I lived there 40 years. Cute colorful outdoor patio or inside seating. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMbTliYWd3RRAB",
            "text": "I came here with my friend for the first time. I was worried about the menu because I am vegetarian and I barely saw any vegetarian options. I asked the waitress and she gave me vegetarian options so I had a veggie burrito came with a side salad and I also shared nachos with my friend. Food was very tasty! The service was amazing. The workers are so sweet here. I just suggest putting the vegetarian options in the menu and this way people know they have many vegetarian options. The food is really good and I let the waitress know about my allergy she was really sweet. I definitely would come here because not only the food but amazing service. I also enjoyed thr frozen mango Margherita. Give this place a try!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1Z182ckFREAE",
            "text": "I was anxious to try this restaurant and it came up short. First off the atmosphere amazing and delightful. The staff is amazing but the food was not worth the price in my opinion. I ordered the Chicken De Mole and the chicken inside the shells were burnt and the mole was on the bitter side. The tacos only comes with one shell and is small.  The rice and refried beans lacked flavor but was visually appealing. They have a kids menu but it is not advertised on the menu. The waiter asked me if we wanted a refill of nachos, we said sure when he arrived with the nachos he mentioned by the way….we charge for seconds. The pina colada was amazing and so was the nachos."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdE0zUll3EAE",
            "text": "I saw that a new Mexican restaurant opened up by me and decided to give it a try. However, my experience at the establishment left much to be desired; the flavors were bland and lacked authenticity.\n\nI decided to order the pollo con camarones which apparently came in a lime sauce…well it did not. The sauce tasted like they thawed the shrimp on top of the chicken. My partner opted for the pollo Jalisco, which similarly fell short in terms of flavor.\nThe overprice menu items were not justified by the subpar quality of the food.\n\nThe drink menu was just eye-catching and nothing more. Despite this, we sampled a few drinks and both my partner and I were disappointed to find that none were crafted to perfection.\n\nI had hoped to enjoy this eatery, but it requires significant improvements in numerous areas. I will say that the service was the only positive, the waiters were attentive.\nThe only authentic element present was a picture of the Virgin Mary."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4d1BUaXV3RRAB",
            "text": "1st time at the new restaurant, awesome vibe and food is amazing 👍 great for dates, celebrations 🍾. Can't go wrong with the outside or inside ambience options, the waiter Jesus was so patient and friendly with food recommendations. Highly recommend 👌!!!🥳"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1ZzkzeWV3EAE",
            "text": "UPDATED REVIEW, 5/18/23: Gave this place a second chance on Cinco de Mayo. I had the pastor tacos, it was great! I'll go back and try the mole next time.\n\nI was VERY EXCITED for what seemed like an authentic mexican spot across the street from my apartment. I had the mole chicken and my friend had the salmon entree. I was un-impressed. The chicken was dry and lacked flavor. The salmon was good but not mexican. The best thing was the churros. I would go back for churros. If I could give some advice , ask the chef to please add the mexican flavors and do not be scared! This neighborhood needs some zazz! Many restaurants in that very same spot has not survived or succeeded. So please survive and add some salt to your food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4c3NlZC1RRRAB",
            "text": "Quality restairant with fresh ingredients and authentic Mexican flavors.  Had the Salmon fajitas and fish tacos,  all were fresh and tasted good.  Service was good but slow due to only 2 waitstaff for the entire restairant.  Nice ambience for outdoor dining in nice weather."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1N2FxR2dnRRAB",
            "text": "Excellent service. The Enchiladas were truly wonderful. There are some kinks they need to work out, but that's to be expected for their first week. My wife and I will be back - keep up the good work La Casa Del Mariachi👍"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoZ01DVVdBEAE",
            "text": "Stopped here on a Wednesday night at 9pm. there were 2 other tables so it was a nice quite intimate dinner. Wasn’t too quite for others to hear your conversations though which is a plus.\nGot the calamari, the quesadilla and nachos.\nAll were amazing great portion sizes!\nThe nachos were huge and loaded! The zucchini quesadillas were cheesy and fresh. The calamari was good, crispy and great portion!\n\nRecommend getting the drinks have great selections! I the mango purée drink (something with Mexico in it) and their version of a skinny Margarita. (Forgot the name)\nBoth were great!\n\nThis place gets a 4 for food\n5/5 for service,ambiance and drinks! Def check it out"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcjktWjFnRRAB",
            "text": "With famous Mexican singers signing on video screens the atmosphere was light and romantic. The shrimp cocktail was amazing and unique and oh so tasty. Virgin Pina Colladas that tasted better without alcohol. And my chicken quesadilla ruined me from eating our dinner but we brought it home to enjoy later. Main dish was steak, shrimp, chicken, cheese, jalapeño, cactus and sauce."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKOW9iamlRRRAB",
            "text": "Very cute lunch date with myself and best friend. The staff is nice and attentive. The food is good and the drinks were good as well. Got there for happy hr and prices are reasonable. Will come back again soon!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4NmJyaHhnRRAB",
            "text": "I dined here last night, Friday, with 2 friends. I have good points & not so good points to make.\n\nPositive first: the mole sauce is on point once I added salt to it and asked them to heat it up. It was almost cold. It is spiced nicely with strong cacao flavor, really lovely once modified.\n\nOne friend had the salmon which she also enjoyed the flavor of. And the other the shrimp - you get about 6 with a tiny scoop of rice.\n\nNegative: the service (as has been reviewed previously by many) leaves a lot to be desired. We waited almost 15 mins for 3 skinny Margaritas. There were only 3 tables of customers at this time and not a soul at the bar.\n\nThe guacamole & chips: chips very tasty, quac pretty plain & $15 for a small scoop. I am a chef and would say 1.5 avos were used for this scoop - tops.\n\nI ordered the mole enchiladas with steak. It came with chicken and the mole sauce was cold. I sent it back requesting the steak and for it to be hot when served. Oh and for them to add salt. As I had tasted the mole, which required a kick.\n\nThe rice & beans are a tiny portion, TINY. Not what one typically receives at a Mexican restaurant. And for $26 for enchiladas I really do expect some rice & beans. I had to ask for salt as they were completely bland.\n\nThe mashed potatoes with the salmon were barely room temperature. 3 pieces of broccoli & 3 asparagus spears - room temp.\n\nThey include a 20% gratuity even for 3 people even though the menu says for parties over 5.\n\nThey charge 4% if you use a credit card as well.\n\nThey brought our check and we had to call them over to come take our cards after 15 minutes of waiting.  There were only 2 other tables at this time.\n\nI wish them all the best but as they say on shark tank “I’m Out!” I will not return.\n\nSuggestion to the owner: hire a consultant or a manager with restaurant experience to fine tune the experience.\n\nDon’t expect Mexican flavors. It’s very bland. Not hot. And super delayed service. I have a thought it is a family who decided to open a restaurant with ZERO experience and they have no idea what they are doing and simply charging ridiculous prices because of the location. You don’t pay this much for Mexican in Manhattan even. I’m not opposed to spending where it’s deserved. I feel ripped off.\n\nNot impressed unfortunately.\n\nAll in all a 2 out of 5 and three more I reminisce about the experience I want to give a 1. But the quality of food was nice.\n\nBest part was being with my friends."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldDdUQUhBEAE",
            "text": "I really had high hopes for this restaurant. Such a perfect location, cute atmosphere, and great food presentation. Sadly, these are the only positives about this place. When we first walked in it took 15min for anyone to notice we were there (the restaurant was only at half capacity). It was very cold outside and they only have one small heater, and no hot drinks available. Luckily Dunkin’ is right across the street and they saved me. Overall the food is simply mediocre. We had complementary chips and salsa, that was best thing about dinner! The queso fundido was very chewy, and difficult to eat, however it had great flavor. It took 45 min to get our appetizer. Then another 45 min to get our 2 tacos. Tacos were a 6/10 since they didn’t have much flavor and didn’t come out hot.\nThe music was really nice when it was playing, it kept pausing the whole time, and also playing advertising since someone failed to purchase a subscription. It was Friday night. As far as I saw there were only 2 people working in the entire restaurant a busboy and a waitress, they both did everything including cooking the food, I’m almost certain. My husband and I both agreed that we wouldn’t return. All the best to the owners and their new endeavor."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1eW9iNUlREAE",
            "text": "This place has potential. I was very excited to come in and try the food as I have been anticipating the opening for months now. I was really excited when I saw it was going to be a Mexican spot. Off the bat, the environment is nice and simple, felt like I was at an older aunts house. The menu, not diverse at all. I was disappointed as I’m vegetarian and there was nothing for me but nachos, quesadilla, and guac. Guac as an appetizer was $13. The food is overpriced in my opinion. This is the worse time to open up a place due to inflation. Not sure if they haven’t gotten their liquor license yet, hopefully they do, I’m excited to try an authentic margarita. I settled for an horchata, it was ok. Food in this area isn’t that good so I’m really hoping that the owners level up their menu or else they be another version of “Homemade Taqueria” which only has an awesome horchata and average flavorless food. I can tell it’s a family business and we love that! It was the first day, so I do understand that it does take some time. I will be back once the menu changes a bit and if they add liquor. For now, 3/5."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dnUyRXR3RRAB",
            "text": "The staff are kind and the food is perfect, the Al pastor taco was my favorite and the Mole was my wife's favorite. The vibe is  quintessential neighborhood taco spot, and they are hitting all the right buttons!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCcXB1NmpRRRAB",
            "text": "Went to dine in. The food and drinks were super delicious, even our picky 9 year old are his plate. The service was good and quick. Really enjoyed the place, will come back. 😍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaUkyRHh3RRAB",
            "text": "So disappointing, I ordered this Salmon dinner  and it had no taste, most of all not fresh , and luke  warm ,  A young woman not the waiter came over to my table claimed she didn’t work there but was helping the waiter since he didn’t speak English. He clearly spoke enough English when he took my order . She is telling me the food came straight out of the oven . I told her it was not hot . Instead of being helpful she’s arguing with me to convince me that the food was warm enough. ! I asked for the manager and she claimed that they were out of town . I left the whole dinner right there after 5 minutes. I paid since I ate a small portion , I wasn’t going to leave without paying but I asked for retribution of some sort , she offered me a dessert, I said no thank you ! How about my money back ! I would love to talk to the manager of the restaurant !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4a01iblNBEAE",
            "text": "Nice quiet place. Great music and authentic fresh Mexican food for all to enjoy. The drinks are strong and delicious. I had the mango margarita"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqOTY3V2FnEAE",
            "text": "From mouthwatering Mexican tacos to the best jalapeño poppers in town, every bite is a flavor explosion. Pair it with their diverse drink menu, and you're in for a treat. Don't miss this culinary gem!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREa2VQODhBRRAB",
            "text": "The service was outstanding, and the food was absolutely delicious. I’ll definitely be returning"
        }
    ],
    "reviews_count": 59
}