{
    "name": "Tropical Revival",
    "place_id": "ChIJAcLcrdhhwokR5PD-EJ67hqM",
    "grid": "QN8",
    "address": "134-08 Jamaica Ave, Jamaica, NY 11418, USA",
    "rating": 5,
    "user_ratings_total": 59,
    "phone_number": "(347) 502-1802",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NMVZGVlJaV0ZpT0RSWmNVMTJlbFZIUkVkcFNuYxAB",
            "text": "The best West Indian restaurant for authentic at home flavors and taste. The atmosphere is wonderful. Jason remembers all of our names and our likes and dislikes. Albert puts his magic touch to everything. Give it a try...you won't regret it!!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kblRWQlpTMGxzZEZGMmFsUmpNVmR1WVRWbGEzYxAB",
            "text": "Tropical Revival is one of those places you can tell was built with heart. you can taste the passion and pride in every meal.  The food is packed with authentic West Indian flavor, and the vibe is always welcoming. I know the owner personally, and he puts real pride and care into everything here — and it shows. Definitely worth checking out if you’re in Jamaica, Queens."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jM1RXVXlUM2N6VTE4MWNEaHVZMnM1UWtwNlYxRRAB",
            "text": "Great food always!!!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jeFFqZFpWa2wwV21wbmNVVkJhREptTm5JMFltYxAB",
            "text": "Food is delicious and always a great pleasure to walk in the restaurant, the atmosphere and food is phenomenal. Chef Albert is a great cook!!!!!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOME5YUlBVREZrWDBkRlpYcE5kblJzV2tWd09IYxAB",
            "text": "Albert the owner and chef is seriously a phenomenal person and cooks with love. My favorites were the daal (mixed in with spinach and so hearty), chickpeas, curry goat, and the pepper sauce. I definitely felt revived after this eating experience. The food is so fresh, not overly salty, and cooked with love. I would be here every day if I lived closer. Oh the roti and bake were also so fresh and delicious. Flaky, chewy goodness"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwTU5tSlVhRVEzZG1abE5EUTBjM1ZwYld0RWMyYxAB",
            "text": "The owner, Albert, and Jerson were incredible hosts. The food was fresh and soulful. They also offered healthy options. Our favorite dishes were the goat curry, the daal, and the chickpeas. They have a fantastic pepper sauce. Best Caribbean food in the area!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsa01rbDRSRE4yVTBkcE1ETnhRVGQ2VkRNek1YYxAB",
            "text": "Great customer service and food was amazing"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbGVXOUdXVkJvTFVodlIwSm5jMVpDVFV0a1NuYxAB",
            "text": "Landed in NY with a craving for Jamaican food. Found this small restaurant, and wow. Flavor on another level. Wish I had time to try more."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGeFZXMXBOM05vUmxkalRHdFRWRXczWW00NGVXYxAB",
            "text": "So fresh dishes and such clean atmosphere. Gotta try to goat curry . A1"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kQk5sSnNkMlYwYXpSelEyZGhRbFZUWm1FMVFrRRAB",
            "text": "Awesome service and even better food! Highly recommended"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIc2FleEJ3EAE",
            "text": "Food was amazing, 1st class hidden gem must try, customer service was ever better.... Amazing place I am a regular........."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5Qk5FUnVhSFJ4TW1GclJ6YzNUREk1UzJGRGRsRRAB",
            "text": "Best tasting, flavorful Caribbean food. He cooks with lots of love."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdllUVnZVbGcxZVhsV2FsVjRObll6VmpsSlYyYxAB",
            "text": "Best food in the area! Great place to get a quick meal choosing from a rotating menu.\nService is always excellent and price is very reasonable"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKZmVUTm9kMjlGYTFGRFkxODNUMFZwVUZwQ1YzYxAB",
            "text": "I cannot say enough great things about this place. The food is absolutely delicious. Albert and his team treat their customers like family. I highly recommend coming hear at least once, you will not regret it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaHZ6SUt3EAE",
            "text": "I absolutely love this place . The food is delicious, the staff is  friendly and the place always clean. Best homestyle food around."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMVkyMi13RRAB",
            "text": "Make sure you stop by and get something(s) to eat, you won’t be disappointed!\nLiterally mek yuh lick yuh finga and yuh gon go back fuh mo!\nBreakfast, lunch and dinner.\nThe staff makes you want to stay and “lime” they are a wonderful bunch.\nAlbert is amazing!!!! ❤️\nMay God bless this business in unlimited ways🙏🏼🙌🏼"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3b3VPT3pRRRAB",
            "text": "This place is a gem! I hope they have a very long and successful life at this location. This places oozes love from those that work here, to the very flavorful food and even their prices and portions. Everyday there's something different being cooked up, so you never know what's on the menu, but it's always something delicious made with love. If you haven't been here and you're thinking about trying it, stop thinking and go!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcGNPYldREAE",
            "text": "Atmosphere was great, friendly staff, and the food was sooo delicious"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMzlEMk93EAE",
            "text": "Tried the lamb curry with rice and beans. Was decent not great. The beans in the rice could've been cooked a little more. If it was cooked better definitely would've made the meal better."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNWIzNUJREAE",
            "text": "A welcoming, warm, small food spot You can taste the love that goes into the food, which is delicious. The portions are pretty good. The owner is so polite and professional. The atmosphere is cozy, making it the perfect place to enjoy a…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbzRlNnpnRRAB",
            "text": "Wish I had more stars to give to the owner his mannerisms and personality is exceptional beautiful soul hope he stays  open untill I retire my job at the hospital 😍."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfaExyZmNBEAE",
            "text": "Hands down the best tasting West Indian food 😋 🙌 👌 Customer service is 1000/10 !! The chef is so warm and friendly and they always give you more than enough! 5 stars 🌟"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmbGFTOWp3RRAB",
            "text": "Wow! Absolutely phenomenal!!! If you haven't been here, you are missing out on one of the best food experiences you'll ever have! I cant wait to return! Best approach here is to get some of everything!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMGR6UDh3RRAB",
            "text": "Probably the best Guyanese food place I’ve visited in New York"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2Z2Z2S0FnEAE",
            "text": "Best West Indian/Caribbean food you'll ever eat...You'll be going back for more and more guaranteed!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNHFyajZRRRAB",
            "text": "This is my second time buying from this restaurant. First and foremost it is beautifully designed and decorated the second you walk in. All the staff are super polite and kind, they make you feel welcomed. Most importantly the food is amazing and tasty, well worth it. So far I’ve tried the pepper shrimp and curry goat. Delicious! Totally recommend this place."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcm91ZFZ3EAE",
            "text": "Albert and his staff went above and beyond to deliver on a last minute catering order for our son’s 2nd birthday party we held at a local playground. Everyone was raving about the food (Baked Chicken, Fried Rice and Chicken Soup + the Pepper Sauce). We also enjoyed the leftovers with the generous portions.\n\nWe will be ordering for Thanksgiving from here 💯 this year. Thank you, TR Team!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzaE9PQmd3RRAB",
            "text": "Rushing, trying to get my sons party ready and bam, food was delivered ! Thank you for making the process troublefree ! No more curry stains in my car trunk  😅"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYby1EZWhBRRAB",
            "text": "This is my second visit, and I have to say, I’m excited this restaurant opened in the area. Service is amazing and welcoming.\nThe food is perfect, still hot when I got home, and the flavor is excellent. Rice and peas, chicken, soup, and bakes. You cannot go wrong with anything on the menu. I’ll definitely be getting food here consistently. Looking for caribb food? Run don’t walk."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURueDh2X1B3EAE",
            "text": "great customer service and passion for their food. great restaurant ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dDVhamhRRRAB",
            "text": "Amazing! Tried for the first time today. The jerk chicken and rice were absolute perfection and for the price, you cannot go wrong. Can’t wait to come back and try more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3eWFlbmlnRRAB",
            "text": "Stopped by today for lunch, grabbed to Plates. Al the owner great person, excellent service and very helpful suggesting the options for food.. Loved it!!!! And had my coworkers try it and it was a hit… THANK YOUUUU Tropical Revival, for a delicious meal!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3MUtLUHJnRRAB",
            "text": "Tongue Lashing 😋 Just get your taste buds ready. Ambiance, customer service and food size you will never complain."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyMzlPYnB3RRAB",
            "text": "The food is Great. The owner is a great chef so the food is bursting with flavor. Definitely recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyNmV1Y2ZBEAE",
            "text": "The food at Tropical Revival is definitely delicious, there's no doubt about that.  But the best thing is Chef Albert's customer service, it is incomparable, he is very kind and friendly.  I feel at home."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMOXNPYnZnRRAB",
            "text": "excellent service, very clean.  Food very tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaS1EQy13RRAB",
            "text": "Delicious corn bread and ribs. Love this place to death ,friendly atmosphere. Come every week just to get a taste of the food here. The best curry chicken ever."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMOGJuNjhRRRAB",
            "text": "Some of the most flavorful food I have ever had!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUbmV5dVdREAE",
            "text": "OMG the black and white pudding on Friday  ...I've gotten food from here once a week since they opened and its spot on but the pudding .. YES!!... grew up eating this and making it with my grandmother and its soo worth it..seasoned to perfection and the texture is perfect with the right kind of kick...make sure u get the sour too ..you will suffer happily with the spice my brain said stop but my mouth ignored .. ..finished both portions in one sitting ☺"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUbWZma0h3EAE",
            "text": "Haven’t had smoke herring fish in a while and decided to buy from Tropical Revival Inc and the food taste really great feels like the food back home. 100 out of 100. Make sure you try it with the dhal and Rice. Also the price is not expensive very affordable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcC15MDZnRRAB",
            "text": "Tropical Revival serves up authentic Caribbean cuisine with flair. Each dish bursts with vibrant flavors, transporting me to a tropical paradise. A must-visit for lovers of exotic culinary experiences.… definitely a must try and the portions are more than great. This will be my favorite new spot"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcDR1RXB3RRAB",
            "text": "This place is my new best friend the food is on point and the owner is very friendly\nAnd trust me when I say that the food is good I literally got a little of everything and boy oh boy I wasn't disappointed it's so good but don't listen too me u have too go for yourself I love it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMzVPS3ZBRRAB",
            "text": "A true gem in the culinary landscape, offering a diverse and inclusive menu that caters to every dietary preference. Whether you're a devoted carnivore, a steadfast vegetarian, or a seafood aficionado, this establishment has something exceptional in store for you.\n\nFrom the moment you step through the doors, you're greeted with warmth and hospitality that sets the tone for an unforgettable experience. The service is impeccable, with attentive staff who are knowledgeable about the menu and eager to assist in making your meal perfect.\n\nFor meat lovers, the menu boasts an array of mouthwatering options, from perfectly grilled steaks to succulent burgers bursting with flavor. Each dish is expertly prepared with the finest ingredients, ensuring a satisfying and indulgent dining experience.\n\nSeafood lovers will find themselves in paradise, with a selection of fresh and expertly prepared seafood dishes that highlight the restaurant's commitment to quality and excellence. From delicate seafood pastas to perfectly grilled fish, each dish is a celebration of the ocean's bounty.\n\nWhat truly sets tropical revival  apart is its dedication to catering to all dietary preferences without compromising on taste or quality. Whether you're a meat eater, vegetarian, or seafood lover, you'll find yourself spoiled for choice at this culinary haven.\n\nIn conclusion, tropical revival is a must-visit for anyone seeking a memorable dining experience. With its diverse menu, impeccable service, and commitment to excellence, it's no wonder this restaurant has become a favorite among food lovers of all persuasions."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqaHYyWDlRRRAB",
            "text": "This restaurant has been the best thing to happen in this area since they opened. As a nurse at Jamaica Hospital, the food options are very limited and unpleasant but Thanks to Tropical that is no longer an issue. The owner Albert is so kind and welcoming. He states everything on the menu for the day with so much variety and the food is delicious. The cornbread is a must ! They have a forever customer here. Don’t hesitate, don’t walk.. RUN and get you a plate."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEMTYzZ2JnEAE",
            "text": "The food is so flavorful!!! The meats are so tender. The cornbread is perfection and the hot sauce!!! Bottle worthy. Great add to Jamaica avenue."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMjlPOTRRRRAB",
            "text": "Amazing Caribbean food!!,Corn bread, duck curry, And the Best pepper sauce, Great Service and Friendly Atmosphere. Will recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdnUyWmlRRRAB",
            "text": "Stop by there to try their food. Got goat curry with peas and rice and it was delicious 😋. Owner was very pleasant and service was great will recommend."
        }
    ],
    "reviews_count": 47
}