{
    "name": "Gee gee’s Kitchen",
    "place_id": "ChIJRVbROWFhwokRpbpeDhvDQSM",
    "grid": "QN8",
    "address": "150-39 72nd Dr, Flushing, NY 11367, USA",
    "rating": 4.8,
    "user_ratings_total": 25,
    "phone_number": "(347) 778-5941",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GSlluTjVaM0JsV1RjeU9YSjRPRlpvYlRKUVYwRRAB",
            "text": "The Jollof Rice from Gee Gee’s Kitchen was absolutely amazing! Bursting with flavor, perfectly spiced, and cooked to perfection, you can truly taste the love and care that went into it. The portion was generous, and it honestly felt like a…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPeWFvdDdvOU1hbzV3RRAB",
            "text": "I am giving a 1 because I have tried about 4 times or more to order from here. The food looks good and it is close for pick up..unfortunately,  never had any of the food. The website door dash either says can't order or unavailable.  I went on Uber.. I had a question and called the buisness..no answer. I tried again when my whole family wanted to try.. like.. why is it so hard to place an order..yall open or not??? I can say the food looks good online.. I guess that's the only experience I can get. I even texted the number provided ..NOTHING. I try to support black businesses.. but dang they make it hard.. everything we all wanted to order and try the food..we had to get from another place. I can only give a one star as no one at my household has seen or had any of this food.. this review is solely off of communication and ease for ordering and the fact I have been wanting to try this and tried numerous times to order..with no success.. at this point....ill just continue ordering from other places."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndU43S3NBRRAB",
            "text": "I was stopping by a friend's nearby, and I had no idea what to have for lunch. After some long minutes of scrolling of food to eat near me, I ran into Geegee's Kitchen-- and I'm so glad I did. I ordered the Jerk Chicken Empanadas and they were absolutely delightful. Juicy and tender steaming hot shredded chicken, soft sautéed vegetables, and well-seasoned to taste. I need to mention how its rare that buying empanadas in New York always have an air pocket halfway through them.. (it be giving Doritos bags), but I promise you, Geegee's wasn't airy at all. When you bite into it, there's no space for air because it's very full and packed with meat (the definition of getting your money's worth.) I was so pleased of how it came out, and I have a new spot to get food next time I visit my friend (I'm taking him with me everytime we get hungry!)"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBanVTbXBRRRAB",
            "text": "The food here is A1! Definitely try the Sweet Potato Cornbread it was soo good! The staff here really went out of their way to make sure I recieved my order, that made the experience even better but the food alone was amazing!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdVB1OS13RRAB",
            "text": "I ordered from Gee Gee’s Kitchen and decided to try the sweet potato cornbread—and I’m so glad I did! It was perfectly moist, with just the right touch of sweetness and a rich, buttery flavor. The blend of sweet potatoes and cornmeal created a soft, fluffy texture with a slightly crisp edge that made each bite even better. Whether eaten on its own or with a little honey, it was absolutely delicious. I’ll definitely be ordering it again!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNDZ5ZURREAE",
            "text": "I placed an order via Grubhud.  For some unknown reason Grubhud canceled the order.  The resturant sent the order to me free of charge via Urber and to top is off, THE FOOD WAS AMAZING! Cooked to protection!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYajlhd1ZREAE",
            "text": "We ordered the vegetable rasta pasta, the sweet potato cornbread, and the mashed potatoes. Everything was very clearly made to order, so fresh, and so delicious! One of the best meals I've had in recent memory. The portions are huge, and VERY satisfying."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYNHJDSW9RRRAB",
            "text": "Ordered yesterday at 10:57 pm woke up today and couldn’t stop thinking about the pasta so i had  to order the chicken rasta pasta and the mac and cheese  omfg its so bomb for a virtual kitchen this spot needs more recognition its so good and the portions are huge !! Def recommend coming here to grab a bite to eat 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYd1BfR3BRRRAB",
            "text": "Highly recommended food is AMAZING!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYeHZURG93RRAB",
            "text": "Greatest virtual kitchen ever I never ate from a virtual kitchen and this was my first time i LOVE IT. THEY MAKE THE FOOD WITH SO MUCH LOVE… idk who the chef is but W THE CHEFFFF"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNua2QzZjdRRRAB",
            "text": "Delicious and mouth watering cuisine! You would not regret it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURILVpTWXFRRRAB",
            "text": "I ordered gee gee family meal and it was amazing the stuffed salmon was delicious!!!! Will be ordering again. The customer service was also amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINXFmR3FBRRAB",
            "text": "Gee gee’s Kitchen is hands down one of the best spots around! The food is fresh, flavorful, and packed with goodness.\n\nThe food arrived perfectly cooked and just delicious!! I will definitely be ordering again in the near future.\n\nIf you're looking for a takeout experience that feels homemade and tastes amazing, Gee gee’s Kitchen is the place to go!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURycU5iUmxnRRAB",
            "text": "The person I spoke to was so kind! I got the shrimp Rasta pasta and it was so amazing. Very creamy and rich!! I think the portion size was really good!  Would definitely recommend this spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMMnZxaGdBRRAB",
            "text": "Absolutely Wonderful food with such an amazingly flavor and uniqueness, I’ve never had such great Caribbean food before, I totally recommend the Jerk Chicken and the Jerk chicken empanadas"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOanJMVjV3RRAB",
            "text": "Every part of this meal was amazingly delicious the shrimp Rasta pasta had so much flavor the crab filled rolls that I believe had lobster chunks or shrimp chunks were amazing im not even a corn bread lover and I ended up eating even the crumbs. This meal lasted me 2 days it’s packed with so much rich flavor that even eating a portion is satisfying enough and I’m one who loves to eat till everything things done! Thank you Geegees Kitchen for an amazing experience from beginning to the end I was even impressed with the delivery!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOaG9yd1pBEAE",
            "text": "I got the  seafood eggroll combo the spring rolls are so goodd & the fruit punch was okay will order again ! This my spot lol"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNObXBxU013EAE",
            "text": "Amazing food and great customer service. I'll definitely order again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOcU1HUGNREAE",
            "text": "I've ordered from Gee Gee's Kitchen multiple times. And as a reoccurring customer, I am very pleased with how fresh and delicious their variety of dishes are. Everything from their sweet potato cornbread, fried whiting fish, to their beer battered chicken, you can tell tasty platters are their focal point."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxMExtdjNBRRAB",
            "text": "I keep ordering the jollof rice & Mac & cheese 🔥🔥🔥🔥"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWdDUtcjFnRRAB",
            "text": "Yummy and tasty food. Lots of options and didn’t take too long. I would definitely be ordering again! I got the Jerk burger and rice it’s worth it for sure!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWbW9TN2VBEAE",
            "text": "Loveedddddd the jerk tacos!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWdkw3Njh3RRAB",
            "text": "Gee Gee’s kitchen has some of the best food. It is so underrated. I dont know what i love more, from the jerk chicken tacos, to the authentic African food, to the crispy wings. Everything is so affordable and mouth watering. My order was delivered fresh and fast. If you’re looking for a place to grab a quick bite definitely order here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWdktTb2FBEAE",
            "text": "Amazing food"
        }
    ],
    "reviews_count": 24
}