{
    "name": "Jade",
    "place_id": "ChIJif3vr6RgwokR_EfGjDCaxxk",
    "grid": "QN8",
    "address": "81-59 Lefferts Blvd, Kew Gardens, NY 11415, USA",
    "rating": 4.4,
    "user_ratings_total": 161,
    "phone_number": "(718) 805-1923",
    "reviews": [
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCRVVYSkNjVUl6WlhCUWIxTlBja1kzVld4bVZGRRAB",
            "text": "Best experience and service best Chinese restaurant in the area"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sWloxTllTbkJJUzFoMmFYaG1RMlpTV21GSlpVRRAB",
            "text": "I tried the boneless spare ribs that everybody was raving about, and oh boy, that was delicious. Don't even think twice about it. It's a delicious dish. I heard going things about the General Tso's too, which is my normal go-to dish at Chinese restaurants, so now I am going to order and try that as well. By the way heads up: No indoor dining options, and CASH only! Amazing prices. Also free delivery."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xeWExWlZZMll6ZERaMlkxUnVNREYyZDNkcloxRRAB",
            "text": "The lady in the front is really nice!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvelpYM0VREAE",
            "text": "Excellent food Excellent service"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNDdYTEpBEAE",
            "text": "Easily some of the tastiest, most reasonably priced food in Kew Gardens!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNma2Z5dWlBRRAB",
            "text": "LET ME TELL YALL RUN DON’T WALK OR IF YOU NEED A SIGN TO ORDER THIS IS IT. I GOT SESAME CHICKEN. THE FOOD WAS SOO GOOD 10/10 HIGHLY RECOMMEND I NEVER ATE SO FAST IN MY LIFE IT TASTE SO FRESH NICE & HOT. I DID A DELIVERY AND THE FOOD CAME IN A TIMELY MANNER. BUT DEFINITELY LOVE IT YA DIDNT DISAPPOINT 🥰"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2M05hSWx3RRAB",
            "text": "chicken lo mein is forever amazing"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dU1HaldnEAE",
            "text": "Not a fan."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQbjVyMFdREAE",
            "text": "I've ordered from this place several times, and the food is usually good. I tend to stick to the same dish, but this time I decided to try something different. I ordered the chicken fried rice and asked for it to be spicy. Unfortunately, the experience was disappointing. The flavor was bitter, and some of the onions had a strange, rubbery texture. That texture was so off-putting, it made me question my decision to order from them. Sadly, I don't think I'll be ordering from them again."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNReWMzeUdnEAE",
            "text": "Happily JADE has reopened!\nClosed 7/15/2024 - 9/4/2024, REOPEN 9/6/2024\n\n########################\n### 2024-Aug-08 review\n########################\nVery simple, Jade is closed for vacation.\nClosed from\nJuly 15th to September 4th\n#########################\n#########################\n\n#########################\n### 2021 review\n#########################\nA \"Standard\" Chinese Restaurant! Which is not to say that it's bad, cuz it isn't, in fact it's rather good. All Chinese take out places have pretty much the identical menu. All also have your food ready in 15 minutes. Same with Jade. There are 2 tables so it can seat 4 to 6 people but suggestion is to cross the street at the corner and bring your food into the Last Call bar. Wheelchair accessible, Cable WiFi in the area.\nAnd very friendly..."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPc2VuaU53EAE",
            "text": "It’s been a long time since I’ve had American Chinese this good. Great prices, warm service, yummy food, and it was made quick. Thanks! I ordered the Four Seasons & Orange chicken. Lots of meat!\n\nUpdating my review, would only order these dishes. Oil can taste old sometimes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyOC11YlN3EAE",
            "text": "One of the best Chinese restaurants in the city, the lady at the counter is so sweet! I can’t eat nuts. she made sure nothing had nuts in it and made all the food to our liking. If you need cash 7/11 across the road has an ATM definitely coming back soon"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcS1xX0ZREAE",
            "text": "Beef with broccoli, chicken wings, and chicken with garlic sauce are my go to meals, and Jade makes them perfectly. Their fried rice was average though. However super friendly family, for years they know what I order and always ask me if i want beef with broccoli or the wings, lol."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUOXU2TDJBRRAB",
            "text": "This is my partner and I’s favorite place to get chinese. The lady at the counter is so kind and always says “Hello my friends!”. She amazed me by speaking spanish with a customer today as well. The food is delicious and consistent. Good prices too. I love the seame tofu and my partner always gets the fried chicken and pork fried rice. I definitely recommend this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqZ1luRnlRRRAB",
            "text": "they have delicious vegetarian and vegan dishes"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMC1PUjlRRRAB",
            "text": "Ordered for the 1st time after reading others comments, good thing I ordered…\nI requested the boneless spare ribs to be well well done and it was on point and AMAZING!\nVery tasty food… my go to"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5aUpMdUFnEAE",
            "text": "Love there chicken and broccoli with light garlic sauce and brown sauce ! Amazing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkcU8zTlp3EAE",
            "text": "Excellent chinese food. And great customer service. Always fresh and tasty. I'm always amazed with this place compared to many other places!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkMEtiM2d3RRAB",
            "text": "The lady at the front was so sweet. The food came out super quick and it was nice and hot. They only have brown or fried rice. I really didn't like the wonton soup it came with, would not recommend (It was free so not a big deal to me). I need to go back & try more, but its cash only so its usually not the top of my list."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROMnVPa2RnEAE",
            "text": "Best beef and broccoli in queens hands down. Owner is very sweet and gives generous portions."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROMEpETC1BRRAB",
            "text": "Love this place ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOOTZlWUxREAE",
            "text": "Sometime after the pandemic, Golden Fountain chinese restaurant on Metropolitan Ave. changed ownership and the quality of food got to be as good as Jade, a cash-only no-frills Chinese eatery on a busy stretch of Lefferts Blvd. in Kew Gardens central. I gave Jade a couple more attempts but while the food is still fresh, the mix of rice to meat and vegetables and their dumplings have gotten smaller and smaller to being substantive. Moo Goo Gai Pan is supposed to have veggies other than onion, mushrooms and carrots, for starters, and now it's just really soggy and oily. Ordering a quart of Wonton/Egg Drop mixed soup used to afford you a decent ratio of 7 dumplings to soup base. Now Jade just gives 4 small dumplings, so it's really like they're not showing the gusto or care for spritzing up their food. I still their food is a tad tastier than Golden Fountain but I'm done with Jade. The degree to laziness in the kitchen does not warrant my time when it's also a Kew Gardens mainstay!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOZ3ZQamxnRRAB",
            "text": "Best Chinese in Kew Gardens - would go more often if they accepted card payments, I never have cash on me. Best chicken and broccoli in garlic I’ve ever had."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWbU9xeGhRRRAB",
            "text": "The service is excellent, nicer then much of the shops around this area. Food is really good and worth every penny."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbW9uYUp3EAE",
            "text": "great food and service !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1MVpDWUNBEAE",
            "text": "One of the best taste and service for Chinese food in queens. They are kind and ho above and beyond for their service. I will keep cash in hand for them because they are worth it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbEtmUHFnRRAB",
            "text": "Jades is my go to for lunch special for a decade. Cash Only!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4M1p5RTNRRRAB",
            "text": "The food was ok. Did not have much of a taste. The place did not look clean enough."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNWVpSUlREAE",
            "text": "There wonton soup is the best. I've gotten a few items here and I have no complaints the woman and man who work here are very nice people."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSMlppMGtRRRAB",
            "text": "Alright, this place is fantastic. Food was flavorful, it was hot and workers were competent. Prices were normal. Good location just across the street from the Kew Gardens LIRR. The only issue is they are cash only which is sad but if you have cash this is a no brainer. I'll be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobll1T0VBEAE",
            "text": "Best Chinese food in Kew. Staff is very friendly!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCdi02M0hREAE",
            "text": "The boneless spare ribs will make you a repeat customer"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlaGFDZGxnRRAB",
            "text": "I was craving Asian food. So I just got the lunch special as a delivery and it came fresh , fair  quantity , good price and super fast delivery. The owners are super friendly ! Awesome service. I will definitely order from here again !"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlb3JuczNnRRAB",
            "text": "I really like it here. The woman at the front is very very very sweet and pleasant. Sweet over the phone, even sweeter in person. The food is very good, prices very reasonable"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1em8yRGNREAE",
            "text": "Best place in the neighborhood. No other spot competes. Notoriously ordering from this place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPM3VIcGVBEAE",
            "text": "Lies, they close at 10 pm"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXODZxNmRBEAE",
            "text": "Best Chinese restaurant of all queens"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtdS11OU1BEAE",
            "text": "Fast n fresh. Best Chinese in kew gardens"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtMHV1Zzd3RRAB",
            "text": "Of the few Chinese places near it is definitely the better one. It is decent. Don't expect anything super authentic, just decent."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtcTdhRUZnEAE",
            "text": "Tried this place and ordered a half a chicken with fried rice for take out. I told the staff that I will return to pick up. I was specifically told in response that it will be a little wait time because it will be fresh chicken. I was so…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpcnJma3BBRRAB",
            "text": "Great local chinese food. Only accept cash but it is worth it. Never had a mistake yet in over 5 years that I've ordered from them. Always friendly, professional, quick, and efficient when ordering over the phone for pick up or delivery.…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtdU8td1pREAE",
            "text": "This is the Chinese food American standard. The food is great and the employees are amazing"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJLTRfOC1BRRAB",
            "text": "We are so happy of having found this gem. I actually find myself craving their boneless ribs combo once or twice a week (C7, boneless, with pork fried rice and egg roll). The portions are big (C7 feeds 2-3 people) and inexpensive. The owner family is friendly; and the service is fast. Cash only."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHMzVpWXF3RRAB",
            "text": "This place was highly recommended by my friend after I told him about terrible experience with other Chinese outlets near by. Today I found time to try it and I was not disappointed. Lady at the counter was extremely pleasant. I am on keto…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2a2RPRzRRRRAB",
            "text": "Very polite and precise. Food is fresh & tasteful 😋…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRNVBHSWh3RRAB",
            "text": "I gave them a call for delivery! A kind young lady picked up speaking perfectly good English and asked the questions \"Where is the address please?\" etc. The way she asked questions for my order was really well done professionally! The place…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzaE5MS0dnEAE",
            "text": "The only reason why I give this place two stars instead of one is because the workers are friendly. I got sesame chicken with fried rice and the rice had no taste at all. The sesame chicken was mostly breading. I also got a wonton soup…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnMEtTZmp3RRAB",
            "text": "The best Chinese food I’ve had. We especially like the sesame chicken and General tsao chicken; perfect flavor, wonderful crunch and not too much sauce like so many places do. The people there are very nice also and the prices are very affordable. Be prepared it’s cash only, but well worth that effort to have cash on hand."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVdHE2ZWZ3EAE",
            "text": "Best Chinese restaurant at Kew Gardens I love the food and their delivery on time."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnX18tTWJBEAE",
            "text": "My go to place for some reliably good tasting Guyanese Chinese food. Perks of a full inexpensive bar to quench your thirst while you wait, or if you are a New Yorker in a rush feel free to call and order. Two thumbs up!!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjZ0txbFBBEAE",
            "text": "Just really good Chinese food. The place is impeccably spotless, too.\n\nCall ahead, if you go in they will politely ask you to leave after ordering and come back in 10min, to maintain social distancing."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3cTZYcVJREAE",
            "text": "I've been going here for years. It's a family restaurant & their so nice. It's always a pleasure to go there or have them deliver. Which is always fast. The food is good too."
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3eFlyM2hRRRAB",
            "text": "No joke some of the best Chinese food in queens A1 official service and food quality. Delivery is fast and polite. Wish they have 6 stars definitely puts these guys over the top."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5aUxheWRREAE",
            "text": "Just an amazing family owned and operated chinese take out place. I have yet to try something on the menu that I do not like. Cheese wontons are always perfectly crispy and the sauce is just perfect."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBME51Z2F3EAE",
            "text": "This place is hands down the best in the area. They are nice, fast and will make your order EXACTLY how you want it. I have ZERO complaints on this place. From day one they have been doing nothing but impressing me with thier food and…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVeEtEUXdBRRAB",
            "text": "After a few weeks of trying out the closest Chinese restaurant in my area I felt like the food wasn’t been make with passion or the right way, so I decided to try the best rated Chinese restaurant near by and Jade came on the list and I was amazed of how good it tasted, this is truly The best restaurant out there."
        }
    ],
    "reviews_count": 56
}