{
    "name": "Harlem Biscuit Company",
    "place_id": "ChIJyS8IMbb3wokRRFq5vnqLeaM",
    "grid": "MN10",
    "address": "2308 Adam Clayton Powell Jr Blvd, New York, NY 10030, USA",
    "rating": 4.3,
    "user_ratings_total": 455,
    "phone_number": "(833) 998-8716",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWMk4wcG1Sa1o0ZVdjeFRFUkpjbGQ0WVhSZlQyYxAB",
            "text": "They’re super slow.  I’ll never order from them again."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FMmFIUmlRVmd5UkdwM1pXazJXRVJ1TTFocWMwRRAB",
            "text": "I ordered the Langston and my dad had the chicken omelet. The biscuits were fresh, moist and delicious. The chicken on the other hand was old and rubbery. I had to break the sandwich apart to try not to waste all of my money. This would have been 100 times better if the chicken was made fresh."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMmRteEpSelYxU21wNlVYRmpWbmgyTTJwWFZsRRAB",
            "text": "Place came highly recommended and they did not dissapoint!! Had the Bodega and the Hot Honey Sausage sandwich, both on Chive biscuits which the  fella working there suggested.  You can't miss with this quick bite💪🏽"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScVpFUlBWVFZQVXpaSVRGVkhRamQyV1dOdFpsRRAB",
            "text": "The food is delicious, the customer service is excellent and it’s a good vibe in the restaurant. You won’t regret stopping by!\n\n* edited review. I literally had to wait 40 minutes for a simple order and got more so dismissed v.s apologized to. I kept asking for the guy to give me an accurate time estimate and it took him 20 minutes before he told me I needed to “wait an extra 7 minutes”"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aT2VUUlRVMWxtWVVOYVdVMVpkRmx3YW5KUFoyYxAB",
            "text": "Every dish exceeded expectations in both taste and presentation. The ambiance made the evening special. Highly recommend to anyone looking for a great meal."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNmNFdzRMVTFhTWtwRVlXdEpXV05TZEVsYWJFRRAB",
            "text": "I had a really nice breakfast here this morning! The biscuit was perfect & the staff was really friendly ☺️ My only note as a southerner is that brining the chicken would really take it over the top"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0Q1pXUklMWFoyVGxnek5rZG9OVFZCYVZOeWFHYxAB",
            "text": "This has been our Saturday or Sunday morning spot for a few weeks now. Think of it as fast casual dining with homemade biscuits. I believe I've tried every biscuit sandwich on the menu. My favorite sandwich is The Malcolm, fried chicken on a buttery, fluffy,crunchy biscuit drenched in hot sauce. My girl keeps it simple with a biscuit breakfast. The only reason the service gets a reduced score is one day we couldn't make it to the restaurant ,and ordered UberEats. The app said the store was closed,but on Google they were open. Called the store and the person who picked up said the restaurant was full so he closed the app. It will work again in 20 minutes. Which was odd? I don't run a restaurant so I don't know anything about that. Food is terrific , staff is really nice, and they got merch too."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWaVJrSlJTVEpMVWpGYVoySkdUVkZtYUUxc1VrRRAB",
            "text": "First time visitor! The food here was incredible! The grits were absolutely impeccable—perfectly seasoned and creamy. I paired them with the Langston, and wow… what a banging combo. Everything was flavorful, savory, and truly satisfying. I’ll definitely be back for more!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5c09WQnFUMkl0WkdONFdXUXliWFJOUlRoSWJYYxAB",
            "text": "Amazing biscuits taste and good other breakfast items."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSTlVVeE1UbTlJTmpndGFsTlZUV3hCTVV4QmFVRRAB",
            "text": "The food was good. I appreciated the fact that the sandwiches were named after Black greats but it would be helpful if the menu was arranged by meat types.\nAs a non-meat eater, I was happy to have a vegan patty option.\nThanks to Pernell for getting me hot tea which was not on the menu."
        },
        {
            "date": "1달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSd2VtNVZibHB4VUVOTFNETTJjVkJ2YVc1bmFGRRAB",
            "text": "Muito bom!!!! pegamos três itens em dois, o de salmão, o bowl e um omelete, mas não são pequenos, pedimos uma caixa pra levar o restante.\nMuito bem temperado e picante na medida certa."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWZk1WWXlXWGxpYzJabGEyeDNXazFQZDNWWk1HYxAB",
            "text": "I got the Fredrick and the chicken omelette. The Fredrick man I’ll tell you!!! That thing is top notch. Whatever they put on it. Keep putting it on there. I would have snapped a pic but I was too hungry."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCc05XbHJTbFJvUlhwNllXcGFYMVF6UXpaMmFuYxAB",
            "text": "Bad customer service, the man doesn't pay attention to detail, rude manager/owner. I spent way to much money for a biscuit and whatever else. It isn't worth the money at all. Especially when you get food you can't eat because you are allergic to an ingredient. They need to do better with their customer service and paying attention to the details on the ticket. I will never patronize this business ever again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wek1ESnNVMjQzZVc1QlgxTktkREJNVEd4RFJXYxAB",
            "text": "Completely rude staff. Id nominate this place for an episode on kitchen nightmares they don't seem to know how to run a service business"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwNE9Fd3lWbTFFV0hkdWVWSnVaa3hGVGtaU1NGRRAB",
            "text": "The design touches add warmth to the dining experience. The food quality here is superior. Their service makes this place stand out. You can't find a better situated place. This spot has mastered its craft."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204emREQTVZWFJJYVRBM1pqUlpZVVpZYUhaemNWRRAB",
            "text": "The food is great, although my mom said the pimento cheese on the Madame CJ Walker had too much cheese making the biscuit fall apart. I had the salmon, egg, and cheese in an everything biscuit which was amazing. Our orders took 20 minutes because they ran out of eggs. Anything can happen, but we arrived at 10:20 when they opened at 8 am on Sunday. I guess business is good! It is worth the wait and the staff is nice. The restaurant itself is nothing fancy, but fine for eating in."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNVNrcFFUblUzTms5NldHbGpjR1prY1c5bU1FRRAB",
            "text": "Riquísimo y genial servicio, lo recomiendo mucho. Pasamos la mañana en Harlem y este sitio hizo que el desayuno fuese súper especial!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWdlgwVlhOMlpVYWkxTE1UWm5XWEIzYkVoTlNGRRAB",
            "text": "Man I got the bodega on an everything biscuit and the Fredrick on a sweet buttermilk biscuit. My expectations was high and I was not let down lol. I haven’t even tried the Fredrick yet but I know it fire 🔥 from trying the everything joint lml."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5QlRUVXdhbGxCZEdaS2VEUXhSRm94U21WTGVYYxAB",
            "text": "bad service, long wait, cold food.\nWhen you walk there is No greeting at the door, or any instructions on where or who to order with. You have to order using the kiosk, and one of them is broken. Gave us our food (that was to go) without any napkins, or utensils. Did not give us the spreads we ordered, the food was cold and took a while, we only got 4 biscuits so not sure why it took so long, the restaurant was pretty empty."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sd01ubDFRVzFDU3pSTll6TnlXbEpHWDB0aFIwRRAB",
            "text": "Nice small cozy spot with a focus on homemade biscuits, however, work needs to be done to demonstrate that. I was craving a homemade  biscuit and remembered this place. I drove up to the new location on 135 and 136 and seventh Ave..\n\nIt was relatively easy for me to order a pair of biscuits on a Sunday afternoon.. my problem is when I received the biscuits they were not hot, just warm.\n\nThe edges were hard and crumbly, but not in a good way. The biscuit recipe itself seems to be pretty good. I can tell from the inside softness, However, these biscuits would be much better if they were being made to order so that we can experience that homemade just out of the oven biscuit.\n\nI think the owners along w/their head chef should decide whether this business is gonna be about biscuits or all the different things that can be done with a biscuit. There's definitely a disconnect there. The menu has so many options whether it's eggs, bacon, chicken, or whatever you would like to have on a biscuit. But the biscuit itself is lacking, falling short of all the palatable, textural and visual experiences tied to eating a good biscuit. I have to give it a 5.\n\nRed lobster's main focus is on seafood, yet somehow they have the most incredible biscuit, Not sometimes, but every single time I purchase a half dozen. I wonder how they do it?\n\nThe biscuit I ate at Harlem Biscuit Company tasted like it had been heated up after being in the fridge for a couple of days. It was very dry and brittle on most of the outside and corners. No bueno! $7 for a pair. They really should've been fresh, like just removed out of the oven fresh. Maybe they had them under a Warming light but either way I'm not too happy with the biscuit i ate.\n\nIf I'm going to consume that many calories, it needs to be worth it, leaving me with joyful regrets, if any at all.\n\nI will go back and try again, but I just wanted the chef to know that the biscuits really should be fresh and hot out of the oven. Thank you."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2podVJGTkxVRU51U0hscE9XeGhPRVIzYVRsbk0xRRAB",
            "text": "No sense of urgency, waited 40 minutes for one biscuit. The guy trying to “run” the place didn’t seem to care that we kept standing there for over 30 minutes and went next door to the hair salon talking to them when he should’ve went and checked for our order. Kept making excuses but we ordered one biscuit."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZMmVrbG1ORkZXZW5aT2MyNHpVa0ZmUWtwa2MyYxAB",
            "text": "Loved the butter biscuits and chicken gravy. I will definitely be back. Nice atmosphere and the staff that was there was friendly."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FemJGaGlNSFoyV1ZCM01EWkVNRXBKVkhONk9WRRAB",
            "text": "Small selección of meal well designed with great taste and perfect texture recommended"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRVZqSjNWbFJ3Um1WME4wWkdiekk0VFRWb0xXYxAB",
            "text": "The food is slamming. I m relieved there's finally a good black owned restaurant in Harlem. I enjoyed everything I ate. That's very rare for me. Thank you to the chefs and owners"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CR0xYQnphbnBrYm01dk5GZEtaakZNZFc1YWExRRAB",
            "text": "The food is phenomenal and the staff is beyond caring! The manager personally came 35 blocks to deliver a $30 order that an external delivery driver had screwed up. Great people and great food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twYUxXczRPWEpQTUdwSmFqWjZkbE4wV1VaSExYYxAB",
            "text": "The food is delicious, but the people working there are even better. Never have we had such warm, gracious service at a place. This place was a gem. Sad we are only visitors because I would be a regular if I could."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oWWRGUnpXVkJHYURCTVkwazJSM1pyV21SdWRtYxAB",
            "text": "You need to make it your business to stop in here and try some of this amazing food. The presentation is always on point, all those beautiful pictures are legit. The staff is so welcoming and friendly. They don’t care if it’s your first or tenth time there they strive to make you feel welcome. I wanted to show picture of my food but I went at it as soon as I got in the car lol. You will not be disappointed! If you’re in the area you already know, in my opinion this place is worth taking a drive and losing that sweet parking spot in front of your building for (it’s that good). There is a dining area in the back, perfect spot for a group breakfast or brunch and they have a bar.\n\nFood: 5 | Service: 5 | Atmosphere: 5\n\nSeating type:there is table seating here as well as seat at the bar\n\nVegetarian options:they have some good choices\n\nDietary restrictions:the staff is very accommodating\n\nParking space: there is no dedicated parking here\n\nParking options: street parking only\n\nWheelchair accessibility:this restaurant is wheelchair accessible"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xQ2NIcGlRbEJIWkZoZmVsTjFkVlptWkRGcE5tYxAB",
            "text": "Slammin biscuit menu. I had the pimento chicken biscuit ahh han yup. It hit."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKM1NETXlkREJmWTJsNmFreGtia0ZKZDNKcWJWRRAB",
            "text": "The biscuit sandwiches I've had better...The grits are the star"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVlprWlZNblJ6TTJzNFdFYzNVbUZ2UW5rNGRWRRAB",
            "text": "Called to see if they’re open because today is a holiday, the man that answered the phone said he is just closing. It’s 1:36PM, maybe update your hours if you’re going to close earlier than the time listed online."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aT1gwTkRSREZaV0ZBd2VubDNlbFZQUTBSaVpHYxAB",
            "text": "My family and I attempted to go here this morning along with a few other people that walked away. My family members are from out of town that’s why we initially decided to wait.\n1. Website says open at 8 am  at about 8:45 am a lady came out to say they are having delivery issues so they could not open.\nI just feel like a sign should have been placed outside the second they realized the door weren’t opening at 8am.\nI wanted to try Harlem Biscuit Co. because of the rave reviews online.\nThis was a turn off."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tReFRGaFBjV2xJU2tsSldqSktVakZoU2tkaU4wRRAB",
            "text": "Went for Father's Day and was quickly seated without a reservation. Some items were missing from the menu but they were up front about them. What we wanted was on the menu. Food was good and the portions were large. We both left full."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210YWVubDBkbEl6ZDBaeWFtNVRWRFpNYW05R09VRRAB",
            "text": "Good food but horrible service is putting it lightly. The new location is beyond subpar with customer service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTVUweGxOVUl0YjFNelNGcENZMVo1VmtWcGJYYxAB",
            "text": "Cheddar chive biscuit was flaky and delicious"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMT0tpYUdjN2EyYXdRRRAB",
            "text": "If you want good southern home food in NYC this place is great. Great hospitality and they make you feel at home. Will definitely be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOci1yTjN2OE1HMFVnEAE",
            "text": "A really nice neighborhood joint to get brunch. It has a really lovely ambience too."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQN2NnSTctOU1IdnJRRRAB",
            "text": "Best biscuits and chicken!! The chicken was so juicyyyyy. Definitely coming back!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VLU2NuNGVvcVBHZlpREAE",
            "text": "So, this was a friend's and my 1st time here. What I got was okay, and the same for my friend, we ended up swapping and liked what the other got LOL. It's worth a second try despite the female bartender's shortness. You all know how some females can be. Malik made our day & I'm sure he'll make yours too. For the most part, the customer service is good which is rare in NYC. A little pricey but better than fast food places."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOZUJwSVhyNXNDSFZBEAE",
            "text": "The food was great and the staff was great! I highly recommend this spot."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJREtuYVREbnEzcWN3EAE",
            "text": "A Must Visit Gem in Harlem!\n\nI had the most amazing experience at Harlem Biscuit Co! From the moment I walked in, I was blown away by the fabulous decor cozy, stylish, and full of charm. The General Manager was not only super friendly…and easy on the eyes 👀☺️, but he also provided exceptional customer service and hospitality, making the visit even more enjoyable.\n\nNow, let’s talk about the star of the show… THE BISCUITS! They were out of this world flaky, buttery, and absolutely divine. The strawberry jam was the perfect sweet touch, and I couldn’t get enough.\n\nI’m already counting down the days until my next visit. If you’re in Harlem, do not miss this spot it’s a true delight!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKMkEyTzY4b0xtWFdREAE",
            "text": "Love the grits and eggs with the biscuits"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJYm9oYWJvaWNXOFB3EAE",
            "text": "Fantastic biscuits and friendly service!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLYXZ3YTZUX3ZLeWFBEAE",
            "text": "Really good biscuits! Attentive servers."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJdVdvTmJDMDRiWHdBRRAB",
            "text": "Delicious food! Excellent biscuits! Great service, they easily accommodated me."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPYmNqYXoweDYybHlRRRAB",
            "text": "Delicious. I never knew a biscuit could taste so good. 😋"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQR3I4dnpSM1AtcnRRRRAB",
            "text": "Nothing special just extremely high prices. The biscuits are nothing special! The chicken is gross dark meat. The sides were ok but for the overall price not worth it!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMbXo3Zm1ybkpydjV3RRAB",
            "text": "A weekend trip to NYC started with a treat from Harlem Biscuit Company. Visiting from South Carolina, we were in search of a good breakfast and left with a new favorite eatery on our travel list! From the moment we walked in, the service was exceptional. The entire staff was attentive, warm, and genuinely welcoming.\n\nThe food? Absolutely incredible! Every bite was fresh, flavorful, and clearly made with care. The biscuits were perfectly baked—fluffy on the inside, with a golden crust and just the right touch of honey drizzle. I really enjoyed the grits too! Everything came out quickly and exactly as ordered.\n\nIt’s rare to find a place that nails both quality and hospitality, but Harlem Biscuit Company does it effortlessly. We’ll definitely be back the next time we’re in NYC!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdXZUaEt3EAE",
            "text": "The food and ambiance at this spot were absolutely fantastic, but what truly stood out was the incredible staff. Barista Jasmyn (apologies if I’ve misspelled your name!) and the owner went out of their way to check in throughout my visit and even as I was leaving.\n\nThere’s nothing quite like enjoying a delicious breakfast outdoors on a beautiful spring day!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNnYtMmlRRRAB",
            "text": "Was ok nothing crazy"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveXN6R2FBEAE",
            "text": "Great atmosphere and food, the owner greeted everybody and made everybody feel welcomed. Would highly recommend everybody in the area to go and enjoy their service!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaVp5WUF3EAE",
            "text": "Harlem Biscuit Company is definitely a hit. The biscuits are warn, fluffy and delicious. I ordered the biscuit bowl. Everything is cooked perfectly. The eggs are scrambled properly. Not too hard, not too runny. Potatoes cooked to perfection, good chunks of potatoes that don't crumble when you insert the fork. Bacon nice and crisp. Not too chewy or too crunchy or burnt. The strawberry lemonade is delicious. Some of the best Ive ever had. They have this cool lil cup sealer instead of a plastic lids. Pretty smart. The owner was down to earth, funny and seems like a great dad. I enjoyed my visit and will return."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmLWJfMk5nEAE",
            "text": "Generally, all around I had a great first time experience. The ordering kiosk was easy enough to use but I didn't see any paper menus around to browse beforehand. It might save time scrolling through the kiosk. The housemade strawberry lemonade was fantastic and the food came fairly quickly. It looked incredible. Loved it! Looking forward to going again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3NnBHMV93RRAB",
            "text": "Food made up for lackluster “service.”(My experience is mine. Go check it out for yourself) I want to give 3.5stars but I can’t. Hard to rate the service because you don’t get served at all really. You place your order in a kiosk and the food is brought out unless you have it to dine in. My wife and I ordered to go and waited 35mins(not exaggerating) while people who ordered take out and dine in after us. Got their orders. Seems they forgot. As far as the food?? FIRE! I’ve had biscuits before but these were great! My wife was upset her cheese wasn’t melted or mixed in the grits. But it being so good made that easy to forget. I wanted to be annoyed but couldn’t for long. I may be back with friends if I’m In the area."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmLTlPRlp3EAE",
            "text": "I don’t even know how to describe what received this morning. I’ve ordered from them so many times with no real complaints (except that the potatoes are consistently cold). This morning I ended up throwing my whole order in the trash. I ordered the DAP w/chicken sausage. There was so much pimento cheese on my sandwich the wrapper was covered in it and my biscuit was covered in it making it soggy and falling apart. The entire thing crumbled in my hand and I ended up with just sausage. The chicken sausage was ridiculously salty I couldn’t even eat it. Ended up throwing the whole thing away. $20 wasted on slop and I’m still hungry. I’m still confused as to why they put so much pimento on the sandwich. It’s unnecessary."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dXM2a0JnEAE",
            "text": "Absolutely love this place. Such an awesome spot! Consistent, quick and delicious. The new restaurant is so much better and bigger than the last spot! Love the outdoor seating. The food is so delicious. Make sure to go on the weekends to get the omelette bowl and the truffle biscuit. SO GOOD. We will be back!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQckpfaXJnRRAB",
            "text": "Nice place the service was horrible. The front of house manager kept moving people around to different tables for no reason. Seemed to controlling. The fried chicken tasted like it was cooked in dirty oil. The biscuits were good though but way to crumbly  it was hard to pick up."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1enFIazVnRRAB",
            "text": "I wish I could’ve spent more time here and brought friends with me. I ordered the Martin, and it was soooo good. The biscuit was perfectly flaky on top and soft in the center, and the chicken seasoned so well. The restaurant and outdoor patio are spacious, and the folks there were very friendly. The decor is inspiring with beautiful art adorning the walls. I’ll be returning on my next visit to the city and recommend you check it out!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4X19TeXZRRRAB",
            "text": "The @harlembiscuitcompany was a pleasant surprise. It is located inside the @TacosandTequila restaurant. You order at the Kiosks and they prepare your food in the rear kitchen. We were all more than pleasantly surprised at the results. In fact we went back the following day. The biscuits were fresh and fluffy, we had both the Frederick and the Bodega both were delicious!! Our parents both had fried chicken omelets that they described as delicious...The side of potatoes and grits were equally delicious...this isna classic example of don't judge a book by its cover....if your in this area, this a must visit!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBc3FtWVNREAE",
            "text": "First experience here and it was great. Delicious biscuit sandwiches and flavorful spreads as well. I will definitely be back to try out the rest of the menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuN1o3NE5BEAE",
            "text": "I couldn’t decide which biscuit to get so I ended up getting two (lol), and was pleasantly surprised by how much I enjoyed them both! The biscuits are a great balance between both fluffy and rich, and the sauce they use on the Frederick biscuit is sweet and complements the sausage well — the sausage itself was little bit dry, but the biscuit totally made up for it. I ordered takeout and my order was very quickly prepared as well. I don’t normally leave reviews, but I loved my order so much that I felt it was almost necessary to! Definitely one of my new favorite spots!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcmJ1QTVRRRAB",
            "text": "We ordered the Langston (biscuit sandwich with fried chicken, onions and pickles) and the trio of biscuits to go\n\nWe waited 20 minutes for the order. While the staff was nice, there was no acknowledgement of the wait, no offer of a drink, etc.  One person commented that there were a lot of tickets.\n\nThe Langston was pretty good, but unfortunately only came with one small slices pickle and the onions were bitter. Nonetheless it was still good and would have been better with more two or three more pickles and some hot sauce, which wasn't optional\n\nThe trip of biscuits were great - tasty, soft and moist.  While there are a ton of toppings to choose from, you are only allowed to pick one for all three biscuits, even though you'd prefer a different topping for each one.  They give you three containers of the same topping. This makes no sense to me. (I'd prefer herbed butter with the everything biscuit and the chili honey with the buttermilk. )\n\nI will give it another try, otherwise move on."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPN05pSlhREAE",
            "text": "I've read much about this place and wanted to try it for myself especially since I was planning a shindig and was thinking about having them cater.  And so I did.  The sandwich is below.  It's a fried chicken sandwich but forgot what the official name of it is.  Either way, it was very good.  I liked the overall look of the restaurant; it looked homey and comfortable although indoor seating wasn't available.  That didn't bother me because the seating outside was sufficient and it was a lovely day to boot!  The biscuit itself was thick and hearty.  One biscuit is all you need!  I was stuffed and struggled to finish it because my stomach was pleasantly full. The texture was flavourful, not dry or brittle, in other words, to me it was just right.  Thank you Mr. Johnson and Harlem Biscuit Company-HBC for a job very well done."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSM2NDMDFnRRAB",
            "text": "I would give this spot more stars if I could!!  Food was on point, fresh hot and super delicious.  Best biscuits this side of the Mississippi. Even though there was a small issue with my order it was immediately rectified. Best customer service I've seen in a while. A definite MUST TRY!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKdnVtX1J3EAE",
            "text": "The biscuits are no joke! We hade the bacon, egg, and cheedar biscuits, and the sausage, egg, and cheddar biscuits both were amazing. We received a warm and friendly greeting when we arrived. Then placed our order via the kiosk which was easy to use. The food arrived hot, fresh and looked delicious. I look forward to going back asap."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNXVtbTZnRRAB",
            "text": "Wow, I came in literally 20 minutes before they closed and was met with not only the best service but a delicious Langston biscuit sandwich. I am blown away by the kindness and diligence of the folks here. Yes yes yes. Please eat here!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHZ01faTBnRRAB",
            "text": "The biscuit sandwiches are the Best Ever. Bodega with herb butter on the side is my fave. John Lewis is so good but so damn hot. I can’t eat the whole thing by self no more, but I definitely still get one and share it😂😃\n\nThe biscuits are super fresh and they sell out quite quickly. I prefer to eat them at the location where self seating is first come first serve. Do your self a favor and get yourself addicted to this place asap."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROMnZXRE9REAE",
            "text": "Let me start off by letting everyone know just because I didn't enjoy my experience at the Harlem Biscuit Company doesn't mean you shouldn't try. The restaurant is very small (sitting on top of each other small). All food (take out/dine in) is ordered on kiosks up front. Party of four paid a little over $100 with tip which shouldn't be included since we had to get our own utensils 🍽 and had to pick up our sodas and juice from the bar after we ordered and sat.  We had a table right outside of the kitchen so I don't understand how you open the door and hand us the food and it wasn't even hot. Had the bodega which is a bacon 🥓 egg 🥚 and cheese 🧀 biscuit and the cheese wasn't melted. Biscuits were not hot and buttery (you can get a better biscuit from the popeyes next door). Then to top it off when we were getting up to leave the so call waitress who got a tip for nothing told us we had to take the baskets 🧺 our food came in and trash upfront to the garbage can🗑. Expected more from this place. Will not be going back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMUpfbjBnRRAB",
            "text": "This is 3rd time eating from here. The first 2 times I ordered on uber eats and the food was great. Today I decided to go with my husband and try dinning in it was his first time and I was bragging about how good the food is. Upon entry it’s a little confusing as there isn’t really a host/hostess but a nice young man did come over and tell us what we needed to do and where we could be seated. We had to order at the kiosk first which was extremely crowded (it’s a small area) the line that forms for the kiosk gets long fast because the space is tight. They only serve pot bacon so my husband just got a drink I got food and we switched to take out. We waited for our food maybe 20 mins the food came out I was excited only to get home 8 mins away and EVERYTHING IS COLD! No utensils. The picture I added is of the Bodega on an everything biscuit. The cheese is just there cold. The egg on top COLD. The breakfast bowl was also cold. Which is a major turn off for me. I should’ve just ordered from Ubereats agin. I would go back but I would definitely check my food before leaving. I probably never would dine in because it’s too much going on in there and it’s just too small for the crowd they bring. The employees were kind they just need to serve fresh food not premade sandwiches that are sitting there getting cold until it’s ordered."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodDl2czl3RRAB",
            "text": "THE PLACE MOVE ACROSS THE STREET.\nWent for brunch and the new places seems to be a Mexican grill and bar.\nThe menu is simple and ordering is fast, they have a touch screen order.\nMany online orders are placed and it took a while for my order to show up even when I'm dinning in.\nThe Biscuits where as expected, warm, buttery and delicious."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMjRqc3ZBRRAB",
            "text": "I love this spot, I’ve been in person and also order takeout/delivery all the time and the quality is the same. Moist flavorful biscuits, wonderful flavors, chive and truffle are my absolute favs. I usually get the ACP. The chicken comes moist and juicy. Additionally fredrick that jerk honey has me in a headlock. Great breakfast food !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsX29teWlRRRAB",
            "text": "Took a trip uptown and based on reviews we had to visit. Thank goodness we did, we went on a Saturday morning around 10 am\nPlace was hopping with DJ and the smell of good food. Biscuits and white gravy, oh my a piece of heaven in your belly. Friendly staff, great atmosphere. We will be back.. Special shout out to Pernell"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyeUltTXJRRRAB",
            "text": "Had great biscuit dishes with an awesome vibe on the inside. Food came out relatively quickly, was cost efficient and delicious! I had the biscuit and gravy bowl and my friend had the Langston. Loved it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbnVmRG53RRAB",
            "text": "\"Discovering this cozy spot in a quiet neighborhood was a pleasant surprise. The staff member was really friendly, and we enjoyed a nice chat. The biscuits were delicious, although they were so big, it was a bit tricky to figure out how to eat them! Definitely worth a visit for a relaxed morning treat!\""
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbzd6ZFJBEAE",
            "text": "I forget how I heard about Harlem Biscuit Company, but I remember reading about it somewhere, and literally going to Harlem the next day to try it! I mean, I was excited by the entire concept, and of course, the fact that it’s black-owned. I love me a good biscuit, ok?\n\nSo, when I arrived, I noticed that there was a small inside area to go into to place your order. There’s no inside dining at the moment, but there is seating outside. The young lady who took my order was very informative and polite. She helped me with my biscuit decisions and got me quite excited to try them. They offer a number of biscuit concoctions that you can choose from. You choose the concoction, and then you choose which biscuit you want with it. There’s also the option to build your own, where you choose your biscuit, and what you want on it. There are a number of toppings/fillings to choose from! I went with two items from their menu and chose my biscuits. My first biscuit was the Langston, which is made with a CRISPY chicken thigh, onions, pickles, and chili garlic honey. They recommend the sweet buttermilk biscuit, so that’s what I went with. Honey…….this biscuit first of all, is one of the best I’ve had to date! It was incredibly fresh, flakey, and buttery. I tasted the homemade-ness of it all! The chicken was perfectly fried and seasoned and paired so well with the chili garlic honey. Just, the perfect concoction! Ugh! The disrespect. I just couldn’t. Now, the next concoction I tried, was The Frederick…..girl. Let me explain. The Fredrick is more of a breakfast concoction, made with egg, cheese, HAND CRAFTED pork sausage, and jerk honey smh. They suggest the chive cheddar biscuit, and so that’s what I got. This chive cheddar biscuit just took my breath away. It really did outshine it’s condiments. Just, packed with so much flavor and of course….butter. Now, in the running, was the jerk honey and the hand crafted pork sausage because they’re both done beautifully. The jerk honey was also packed with flavor and, naturally, sweetness, but not too much sweetness. Anytime I see a housemade pork sausage on a menu, I get excited. This sausage did not disappoint. I didn’t want to finish it. Both biscuits were more than memorable, but if I had to pick a favorite, it’d be the Frederick. The love, the experience, the effort is THERE! It’s at Harlem Biscuit Company, and I CANNOT wait to get back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUalBUWWxBRRAB",
            "text": "Get the ACP!! It’s so good. The only issue I had was a small part of my meat had the tendon part or whatever is impossible to chew. I cut it off and finished my food. But other than that it was perfect! The strawberry lemonade was nice too. Tart and sweet. I would’ve tried other things in the menu but I think I’ll stick with the ACP lol"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMbFBiSGtBRRAB",
            "text": "The vibes are great, staff is very kind & friendly but I don’t LOVE the chicken. This may of course be my personal preference, but after multiple tries it lacks seasoning as if it wasn’t marinated. The portions are extremely generous. HUGE. I do love the ALI—which is egg white, goat cheese, arugula, & herb honey. They allow you to customize your biscuits on the screens."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdnJQQW9BRRAB",
            "text": "I didn’t even get a chance to order I come at 9:20 and the door was locked but it seemed as if people were there. I checked to see when they open, just to make sure I wasn’t crazy but they opened at 8,  I was very disappointed because I was taking my mother for there cheddar and scallion biscuits."
        }
    ],
    "reviews_count": 77
}