{
    "name": "Cucina Italian tavern",
    "place_id": "ChIJ_YBu0r73wokRs_WLcB9Ka7k",
    "grid": "MN10",
    "address": "331 Lenox Ave, New York, NY 10027, USA",
    "rating": 4.8,
    "user_ratings_total": 223,
    "phone_number": "(212) 837-2128",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMFNUSTBZMlJzWnpOSVgxSldjRWRCUVdOc2MyYxAB",
            "text": "Dev was an amazing server from the moment he walked my friend and I to our table, to when we picked up our bags to leave. I haven’t received good service like that in so long. Very attentive and kind! The Island Punch and chili wings were delish! I loved the vibe of the restaurant. My only advice to the restaurant: Keep Dev!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCT1RqWjVWRTF3UlVwd09HRlNRblUzTW5CRlZsRRAB",
            "text": "The food and staff are amazing best restaurant in Harlem. They have a full bar and offer happy hour..."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGWFptUjVNMDl4T0VwTlMyOTJSbXhhWkdOQlFrRRAB",
            "text": "10/10!!! Giovanni was amazing. The service and good could not be beat."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OVU1XOWtWVFpsY0dWaVJtaHVXSFJzUjA1M1NIYxAB",
            "text": "Great food, good vibes, good music and the service is honestly what stood out the most. Everyone was really attentive and kind and I loved my experience here! definitely will be back. also, Kitchen is open late. I was able to get dinner at 10:45 PM on a Sunday night."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toeWMwTkJXa0ppVjFnelRGUkhPRGxYWkc1U1NYYxAB",
            "text": "I came here for happy hour with my friend and the drinks are bomb! And very strong lol.\nWe ordered fried  mozzarella because we was feeling a little tipsy from the drinks. I didn’t like the mozzarella it came out cold and we had to send it back. The food just seemed blah. Overall i would come here just for some drinks!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0elZWQnRUWEowWW5aYVJHWTNZMlV6Vm1SR1RrRRAB",
            "text": "Small and full of energy yet run efficiently by the excellent Kwame who had his eyes on everything and had time for everyone. We have fried mozzarella, Pizza and the Vodka pasta. All very good and decent portions."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTE5uTmxkbVo2UVRoaloxRTVXVVprV2xkcUxXYxAB",
            "text": "The service was very good, and the waitresses were very kind. The beer was cold (as a Brazilian, that’s how I like it).\nI ordered the square pizza, and my wife ordered the meatballs as a starter. We were both very satisfied.\nI will recommend this place to friends visiting Harlem."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taemNWUm9iMkZaVm1kNmVWQmFSSEl6UzJOSVZsRRAB",
            "text": "The food was amazing I bought the sausage pizza and since it did not have any red sauce it did not give me indigestion I am feeling wonderful. The appetizer that I received was okay it was the mozzarella sticks it tasted fresh however it also tasted as if it was heated up in the microwave. Other than that the service was impeccable and the pizza was amazing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdVMxOHlkM0JWTldONFIwZHJla0UxTkhORGQwRRAB",
            "text": "We came, excited to try the new place. My wife went to the restroom so I told the waitress we’ll order when my wife comes back. The waitress never came back after 10 minutes , so we left. It wasn’t busy today, just a few people outside. Too bad, I really wanted to try their food, or drinks; we didn’t get past drinking their water."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMlp6RTFZVGRoT1dSWGVWWnBWMVUxVUU5S00xRRAB",
            "text": "Caesar salad was terrible. The chicken was bland and the dressing was like watered down. Whipped ricotta was amazing. Service was extremely slow. The DJ was blasting the music too loud, you could barely hold a conversation."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0TWJGWmlaRTlwTUhKMVpGaHFURFpSVkRWT1ZrRRAB",
            "text": "While the food is really good, the service, ambiance, and lack of transparency in pricing holds this back.\n\nWe ordered a bunch of food: eggplant parm, cheese pizza, prosciutto and fig pizza, wings, and chicken parm.\n\nAll the food was super tasty. The pizza is excellent and mostly just cheese and bread. The eggplant parm is crispy and the ricotta on top adds a great texture.\n\nThe issues were first that atmosphere is ok. Being outside, the restaurant had nothing preventing people on the street interrupting you or reaching for your food. And staff don’t assist in any way when this happens.\n\nThe next issue is that service is lacking. We never got a refill on water and were completely done with our water after 10 minutes.\n\nLast, the restaurant is not transparent and fraudulently gives you menus with wrong pricing. For example, the cheese pizza we got clearly stated $17 on the menu they provided us (as seen in the photo) but was instead charged as $19 on our bill at the end. The food is good, but these prices are expensive for what you get. And the fraudulent pricing changes make it a poor experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRk9IRmhkVkZXZHpNNVYyVnZSbUpXVUhWTE1sRRAB",
            "text": "Absolutely delicious!! Highly recommend if you’re in the area!!"
        },
        {
            "date": "1달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5YU5tTnJUa1JRVG1kdmJqaHlUMnQ2UVVReUxWRRAB",
            "text": "Très bon restaurant italien. Le service est très bien et le personnel aimable. C’est très propre."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210NlZXb3daREZLYW1aMllUTmxPRTB4VldOd1VFRRAB",
            "text": "Great atmosphere , Levent to be exact was radiant I’ll go here any day! I loved everything about the environment"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNelNqTmhaRWszUm1VNFpVNU1SMTlDT0RCUk0yYxAB",
            "text": "SMOOTH ATMOSPHERE GREAT SERVICE AND THE HOST IS WORKING THE ROOM  AND MAKING SURE EVERYONE GETS WHAT THE WANT NEED AND THEN SOME. NEEDLESS TO SAY ILL BE BACK!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVllWbHFibG96VWtOMlNWcExibXhHV25oNExVRRAB",
            "text": "Wherein and AJ were so inviting and fun. They made me enjoy myself fully and the bottomless was so fun. Will be back when I come back to the city for NYFW"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxaE0wcHhOR3RKTFRWV2FUVnRUR0ZNZVVacE5tYxAB",
            "text": "Levent was absolutely wonderful. He makes the best strawberry lemon drops."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONlZISndaRUpKZFRkbFZHSldZVFZ6WDNwdlFXYxAB",
            "text": "Great spot! Food was so delicious. Shout out to Raoul at the bar. Definitely will be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5bFlqVllZamd5VURFdGVHaGxXakY2V1VOaFkyYxAB",
            "text": "Everything was delicious.  Server was so nice."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swMFlra3dNbmRFVkRGS1RUa3lSbkJWTWtaNGJuYxAB",
            "text": "Great experience ambience was amazing the food was over-the-top delicious!! And my favorite drink from now on is the side Piece I strongly recommend recommended lol"
        },
        {
            "date": "1달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWT1ZVb3hSRVZJTjJoWWNHRllSemRXWkhOeVkzYxAB",
            "text": "Deutsch:\nWir waren im italienischen Restaurant zu Gast und es war rundum ein tolles Erlebnis. Das Essen war hervorragend – frisch, authentisch und voller Geschmack, einfach richtig lecker. Der Service war aufmerksam, schnell und dabei stets herzlich und freundlich, was den Abend noch angenehmer gemacht hat. Besonders hervorzuheben ist auch das schöne Ambiente: gemütlich, geschmackvoll eingerichtet und perfekt, um sich wohlzufühlen. Ein rundum positives Erlebnis, das wir jederzeit weiterempfehlen können – wir kommen definitiv wieder!\n\nEnglish:\nWe visited this Italian restaurant and it was a wonderful experience from start to finish. The food was excellent – fresh, authentic, and full of flavor, simply delicious. The service was attentive, quick, and always warm and friendly, which made the evening even more enjoyable. The beautiful atmosphere is also worth mentioning: cozy, tastefully decorated, and perfect for feeling comfortable. An all-around positive experience that we can highly recommend – we will definitely be coming back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWME0zcE1TSFF5U0hOT05FZHpjRVJUVEVOSFRHYxAB",
            "text": "I was called the N-word in there the other night by one of the Hispanic bartenders. Devin is his name. He uses this harmful racial slur in this place of business and it seems that the owners allow it.  I thought it was a bar restaurant, not a street corner hangout. I do not allow anyone to call  me the N-word especially when they don’t know me that well. It is offensive and I’m not Afraid to tell them that  I’m black American. I speak up. I think it should be against the law in certain establishments just like it is against the law for me to use certain language at my employment. I wouldn’t call him the S- word and I’m sure he would become offended if I did. I don’t use the N-word. It is disrespectful to my ancestors. I’ve never been to a place where the workers use the word, especially on their customers.  I told the bartender how I felt after he interrupted my conversation with two friends that I had not seen in many years.  I had to walk out and will not return. THE N-Word is not a term of friendship and he didn’t use it that way. I wouldn’t have cared either way. This is a place of business not a slave plantation where Hispanics are the new colonizers."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5U2FtOWhVWFl4VjJkbVRFUTRVV2hNU21zMVFWRRAB",
            "text": "Might I add the food, drinks, and service at Cucina's are normally top tier. However, on September 1, 2025, Monday my friend and I came into Cucina's for dinner & drinks and our service we received from Nefesh C. was horrible. Her attitude was very questionable. She didn't seem to be interested in wanting to serve our table, she also never came back to check on our table at all to see if we needed napkins, condiments, etc. My friend and I had to call on the manager as well as another server to assist our table which was her job regardless of how busy it may be. In addition, noticeably Nefesh C. who seemed to have predominantly black customers to service at several different tables she didn't go back to check on those customers (including our table) tables at all, but one table Nefesh C. had where all the customers were white, she checked on that table a few times who were sitting outside. That is very concerning especially since most of Cucina's customers on a regular basis are black. Last, when it was time to pay the check Nefesh C. took our money, but never brought back our change. We had to ask the manager to bring us our change. Assuming, Nefesh C. was under the impression she would receive a tip for her underperformed service. When the manager asked Nefesh C. how much was our change her facial expression displayed disgust and somewhat of an attitude for us expecting our change back. That was very displeasing. Cucina's is a great place with great vibes, but this service received was unpleasant and horrible."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjM1JGRkJWMGt3ZVZaRmRtSlJVWGRWY3pRdFQwRRAB",
            "text": "Levan and his team are awesome.   They accommodated me and my 7 friends at 10:40p.    Still top tier.   Shout out to the kitchen"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGelVqVXhWR0pvTjNCTWNtSlJPRWxuYVhGWVZHYxAB",
            "text": "If you are looking for a real Italian experience in New York you have to come here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ac1RFbEllSEpqTkRGemFYa3paRWRGWnpKNlpsRRAB",
            "text": "A great vibe and awesome drinks!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4QkxVTldXbXRmTjJwSk9GOVdOVGd6VVZoQlIxRRAB",
            "text": "Sherwin is amazing!! He Made dinner great experience"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCR1dXeHBNVFE1Y1dob01Xa3hVMDF0YlU5ck9YYxAB",
            "text": "My whole love this place. The pizzas hits every time"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVGFtZE1MVWx0WlMxS1lXSkNVVU13Y1VkeU5WRRAB",
            "text": "Great service! Would come back 🌟"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GRU5FZGtVM2xpTkMxd2JGUjJhMkp5ZFVWM05WRRAB",
            "text": "Very nice place in Harlem, nice atmosphere, good food, excellent and friendly\n\nservice"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sWFREVXhkWHB6TjFNMmVsRldPVUZ5TVdKSWMwRRAB",
            "text": "Con tenis y todo, espectacular"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRFlrcHljR0ZEWjNOeVVVMVVUVlZvVXpCeFFXYxAB",
            "text": "I have great things about this place and decided to try to fit the first time ! The food was very fresh I have the chicken and pancakes with eggs and of course mimosas. The pancakes taste like auntie made them from the south. The hospitality was great. It’s definitely kid friendly insane my 9year old daughter with me and she definitely enjoyed her food . Try them out! They have an amazing happy hour . Located in the heart of Harlem so you know the vibes are top tier !"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0aVIyazFTekEzUkZnMVoyVlhkV1ptWVdocVFWRRAB",
            "text": "Excelente servicio, deliciosas cervezas, buen ambiente"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201M2JscGFkMXBOUVhwRGNYUjJlV1kxVVZWb1gwRRAB",
            "text": "Highly recommended!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kS1dDMHpaRXR1V1hCRlJ5MVphR1ZEVmxsWU9GRRAB",
            "text": "The polenta and grits were extremely flavorful even though the polenta was not as tight as we would have liked. The flavors in this dish won the night. The shrimp were immaculately executed and crunchy and delicious.\nThe chicken parm was banging !!! The chicken was moist,  perfectly flavored and the dollop of ricotta in the pasta was chefs kiss.\nDrinks were good too.This is a Harlem gem, do try the food……"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twNWNVVXhaRzVUWTBoWVFtWkhUMUZsY1dWTGRuYxAB",
            "text": "Amazing! Everything an I mean everything is 7/5. The waitress we had was an amazing,Fedy. This place is a must visit"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poZlp6aEljM1pDVkVsRlJGUnNObDlmV0c4d2JFRRAB",
            "text": "Amazing! Everything we had was good! The food was excellent; Fedy was such a good waitress, recommended great drinks and even made a custom one that was awesome. Love it all! 10/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVVRHb3RRMVpqTjJKYU9ERkNjWGhhVkdsYWFFRRAB",
            "text": "We did enjoyed so much, great mood, service and food! Great place in Harlem. Federica did a great job!!. We loved it, definetly we will return"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vellteElRMFpvZWpCeWVDMUdWa28yWjBkaE4wRRAB",
            "text": "This place has charm and has great service.  A pleasant surprise!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOd2EwZG5SSFowTkhsR2RUWmpVSFE0Wld0MFRIYxAB",
            "text": "We had a great experience, the food was great and the service was great. We have a little one and they made us feel welcome. We are huge R&B and Afrobeat fans and the music was awesome, but not too loud for conversation. In particular we had an unexpected surprise, our host was more than attentive his name was Sherwin. He gave us additional ins and out of the menu and chatted us up a bit. I highly recommend this restaurant to those in town looking for delicious Italian food in the Harlem area."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRNFpEa3pSRFZSUjFGSFFXWm5WM0JDU0d4clIzYxAB",
            "text": "I recently dined here with a friend to celebrate my birthday, and the entire experience was nothing short of amazing. From the moment we walked in, the ambiance set the tone for a memorable evening.\n\nSherwin was absolutely exquisite—attentive, warm, and genuinely made the night feel special. His service elevated everything and made us feel truly taken care of.\n\nThe food? 10/10. Every dish was perfectly prepared, flavorful, and beautifully presented. You can tell there’s real passion and attention to detail in the kitchen.\n\nBetween the incredible service, outstanding food, and the overall atmosphere, this restaurant exceeded all expectations. I couldn’t have asked for a better birthday dinner. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwQlUxbzJiR1F0VFZWbVducE1kakJVWWs5bVRIYxAB",
            "text": "Amazing! Very friendly staff and cozy ambiance. The Frito Misto (fried shrimp and calamari) was the perfect… well-seasoned and perfectly textured with a light yet crispy batter. The Frisée salad was to die for, fresh sectioned mandarin oranges and crisp fennel with a light dusting of fresh grated Parmigiano. Sherwin the bartender is an absolute gem super attentive and great conversationalist. Best lunch I’ve had in a while."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200eFEyTk5halV0YlZWQk1FUkNRV2g1VFZsSU9GRRAB",
            "text": "Love coming to have a drink at the bar on a Sunday after a busy work day. XO"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRFpsUjZOSGQ1Yms5VlpsVlJVM0ZYZG1GUlQwRRAB",
            "text": "A plus service . Warm and welcoming!! Sherwin is a gem💎"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvNE1WZHBSWEUzTVUxQ1VscE5RVzE0Tlc1TVlrRRAB",
            "text": "Levent is super sweet"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxMlVHbFJObmR4Y0hrM2FTMTBkemRTTkU5aWFHYxAB",
            "text": "The best bread pudin in the city! I wish I took the pic before! Attentive customer service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBdGMwZEdkMjkzVHpSdFNuTjFORFpLVTA1NVVYYxAB",
            "text": "Oh man, what a find! Super clean and nice place- great drinks. The highlight!? Our bartender, Nefesh. She was absolutely amazing. First welcomed us with a huge smile, gave us recommendations to visit around the city and was overall such a hospitable and fun bartender. Would highly recommend this place for its ambience. We’ll be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOd2JVWlliVkE0V1ZWT1NXczFTRmR5WVhOblpYYxAB",
            "text": "If you’re looking for good food, impeccable service, and an unforgettable dining experience, this is the place. The staff goes above and beyond to make our experience memorable. The manager always stops by our table to make sure everything is perfect. You have to try the pizza and meatballs. One of the best spots in Harlem!!!."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paUWVYaE5jVk42TlVkeE5HVjBjRlpXYkhsdmMzYxAB",
            "text": "The absolute best pizza crust!!! I am usually a thin crust gal, but this place completely changed my mind. They have great food quality and an amazing happy hour. I will definitely be coming back often :)"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oTmJ6Y3lVV1JLY0RoelpsWjRWSFEwWW5OUE9XYxAB",
            "text": "The Bartender Liz made a GREAT impression... Her personality is glowing..."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdU8zaWJREAE",
            "text": "After a day of shopping I Harlem we got hungry, doing this place and to my surprised and satisfaction it was amazing!!!\nFor starters we got a Frito Misto, very crispy and delicious and I have never had egg plant chips until now, those were something else in a very flavorful and delicious way, then we got buttermilk Fried Chicken sandwich yummy yummy!, spaghetti with meatballs and Chicken parm w. Rigatoni vodka. For the drinks we opted for spicy Diablo, virgin Daquary and one the other one with rum. I will come back for their sourdough pizza!."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxelVsZExMVzlsZEdOSVdETTFWV1ZtZFdGamQyYxAB",
            "text": "A Hidden Gem in East Harlem – Cucina is a 10-Star Experience\n\nI cannot say enough amazing things about Cucina on 127th Street in East Harlem — this place absolutely wowed me from start to finish. If you’re craving fresh, flavorful Italian food with heartwarming hospitality, look no further.\n\nI stopped in during happy hour and ordered the Caesar salad with chicken cutlet added, and it was perfection. The chicken was golden and crispy, the dressing was rich and tangy, and the butter lettuce was so fresh and crisp it practically crunched with every bite. I paired it with a frosé that was the ideal balance of sweet and sour — totally refreshing and perfect for a sunny afternoon.\n\nWhat truly elevates Cucina to a 10-star experience, though, is the staff. Sherwin, the host, delivers the kind of warm, welcoming hospitality that should win awards. His phrase “lunch Italian side” as he guided me to the outdoor patio was charming and thoughtful. And Erin, my server on the patio, was friendly, attentive, and on point the entire time.\n\nBig kudos to the Chef — the quality and care in every dish are undeniable. Cucina has that magic combination of great food, great drinks, and genuine people who make you feel like you’re part of the family.\n\nHighly recommend for a relaxed lunch, a romantic date, or a neighborhood happy hour hang. I’ll be back — again and again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21veFRtaDBWV2xTYnpKMGFXUnNiMGxhTW5ORGVHYxAB",
            "text": "Love this place everything was so delicious and the workers were so sweet! The vibe was so good. Our waiter Jeremy was the sweetest! Def recommend and  I will be coming back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCc1ZtODJSRTlPZW5sT1VDMWxSbWxGYmtsRVdVRRAB",
            "text": "Service Was Horrible Only One Server Who Wasn’t Attentive And The Restaurant Wasn’t Crowded… Kitchen Closes Extremely Early For The Restaurant To Stay Open Late Food Was Decent I Expected Better The Vodka Sauce Wasn’t Good It Was Average At Best… Brocolini Was Seasoned Well But Could’ve Been Cooked Slightly Longer.. I Had A Rum Punch Which Was Delicious"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210UVREWnBabkpHV2s5SE9YQlBaVXR1WVhGamVWRRAB",
            "text": "Stopped by for a dinner with a friend here and it was absolutely amazing… atmosphere was great.. drinks perfect.. the food was incredible.. we had the eggplant parm, meatballs, chicken sandwich, chicken parm w the vodka pasta.. the wings.. and a pepperoni pizza… every dish was honestly amazing. 10/10 would recommend and I will be coming back!! Btw Mike is an absolute gentleman!! Thanks for making us feel welcome!"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzczdfRVVnEAE",
            "text": "Place just opened up and it’s a Beautiful decor and very good vibe. Great music. Max was our server. and was very attentive. Food was great. Order three different personal pies all were excellent. The wings were cooked well and were crispy. Cocktails were different but welcomed. Very tasty and packed a good punch. Chef Mike greeted us and the host also checked in on us regularly. Will definitely recommend this place for a Friday night date night. Will be coming back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzelpuNlNnEAE",
            "text": "I recently visited Cucina Italian Tavern with an old co-worker, and we were pleasantly surprised to find this gem had just opened the day before! Located next to our usual spot, we decided to give it a try—and we’re so glad we did.\n\nCucina has a warm, Italian vibe with a cozy bar area and serves a selection of small plates in the style of Italian tapas. My co-worker ordered the calamari, while I opted for the parmigiano and herb fries. Both dishes were fresh and flavorful—perfectly suited to the atmosphere.\n\nFor drinks, I tried the Side Piece (playfully named!), and my co-worker went with the Diablo.We both loved our drinks  so much we had a second round! The drinks were well-crafted, and it was clear that Cucina takes pride in both its food and cocktails.\n\nThe staff was incredibly attentive, checking in regularly to ensure we enjoyed everything and even asking for feedback since they were newly opened. It was refreshing to feel genuinely welcomed and valued as guests.\n\nOverall, Cucina Italian Tavern is a great addition to the area. If you’re nearby, I highly recommend stopping in for a few plates and a drink or two. It’s new, inviting, and has a welcoming vibe that makes you want to come back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2ajhyZklBEAE",
            "text": "The newest hidden GEM in Harlem!\nI take my reviews seriously, so I had to come twice to make sure and wow was I amazed both times. If you’re looking for delicious and I mean like, eyes open staring at your eating partner and nodding while saying MMMHMMMM good- this is the place to go. I tried both their brunch and dinner menus and neither dissapoint. And the staff are some of the kindest and most attentive people ever. I forgot I was in New York for a second. Good service is something I will never take for granted. Anyways back to the food - the cheesey garlic bread will leave you dreaming of it, the chicken parm is cheesey and that marinara has the perfect amount of garlic, and paired with some rigatoni vodka, I left stuffed and happy. And did I mention they have a BOTTOMLESS brunch option! I normally throw mimosas back, but their food and the quality of their Bellini had me taking my time and just savoring every moment. Some of the fluffiest pancakes and juicy yet perfectly crispy chicken, and the oxtail with polenta had my partner scraping the plate. Aka long story short - TRY THIS PLACE. Trust me with food this good, and prices this affordable - this spot is about to blow up. Chefs kiss, just wow 👏👏👏❤️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wS01WQlRSMHBPWTBoWWNqVkRiWE5TY2pSTkxWRRAB",
            "text": "Got the vodka pizza. Don’t think there way any vodka sauce. Service was great regardless.  Pizza was good but not great. Not good enough to come back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKN0MxYUNObjZPQVpREAE",
            "text": "They were out of certain foods but the food was fresh and gd but the drink was very strong 💪 and tasty"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZeE1WQlVNMFZKY0ZOTFJsUmxWWEY1UjJ4S1ZrRRAB",
            "text": "The food is amazing I love the shrimp Cesar salad and the wings are absolutely delicious!!!! The service here is so warm and welcoming.The staff is great . you won’t be disappointed"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMkpUMHZBRRAB",
            "text": "Nefesh is an amazing host and bartender. Great customer service and good vibes. Kwame is the best. He always makes you feel welcome and greets you when you enter into the space."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmMWNtSDlRRRAB",
            "text": "The best authentic Italian restaurant with service with a smile many drink specials\nAppetizers and Entrees to make your mouth water ..The. atmosphere and decor is awesome they  have music playing and several large screen tvs and you can have a good conversation.Whether it is Girls Nite Celebration of a Special occasions or just Lunch"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfck9ybml3RRAB",
            "text": "This spot is new to the neighborhood and been open a couple of months now. We came for brunch to check it out and see the menu. The inside is nice, fun ambiance though a little loud, and the staff are fairly friendly. The food wasn’t bad, though fairly plain, and the oxtail seemed like a simple ground beef bolognese. I was surprised there were issues with service - we ordered the polenta with oxtail, the menu clearly stating that it came with bread to eat with it. We didn’t get the bread, and when we asked the server left and came back only to tell us that the dish did not come with crusty bread. I’m not one to argue, but it seems like staff and the kitchen need to understand their menu, and into at least the third month of being open I was a bit shocked so many people didn’t know the menu or could t be bothered to check. For me the two things to look for in a restaurant are quality of food and service - here, the food seems good, but the service needs work. We’ll come back to give it another shot and try the dinner menu, and I may revise my rating then! We had really hoped to try some pizza as it’s advertised on the window, but only one pizza available for brunch so that’s on our list for next time."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKamw3ZnlEdGU3c1VnEAE",
            "text": "First of all walking in and experiencing this vibe was memorable to say the least. Staff was kind and humble. Treated us as family. Food was phenomenal. Had the original square pizza and the garlic parm wings. Both was perfect size serving for 2. Owner was gracious to sit and talk with us also. This was my first eatery visiting new york and what an impression. Highly recommend this location."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMcUp5ckhOc28yWHF3RRAB",
            "text": "The food at Cucina is DELICIOUS. Me and my husband come here frequently and love the appetizers, especially the chicken wings, and the drinks. Their mains are good too, I recommend any of the pizzas and the side piece cocktail for sure. Their happy hour is always a vibe, especially on Thursdays and Fridays. The atmosphere is welcoming and the staff is attentive. If they're busy you may need to wait a bit for your waiter but they're always quick to serve and you won't be left waiting most times."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5T1oydHdNR0ZsWlhNMFVrMUxlVkl6WVRJMGJYYxAB",
            "text": "Come here if you are looking for a strong cocktail, loud music, and nothing more.\n\nThe food missed the mark with very low quality ingredients. The pizza bottom was burnt, the honey on top tasted like simple syrup, the pepperoni extremely thin, and the mozzarella flavorless (skip the mozzarella sticks - they look amazing but taste like nothing).\n\nThe service here is a zero. The manager seated us with no greeting or care, our server sat next to us to count his tips and then promptly got up and left.  When we checked where our food was after waiting over 40 minutes it became clear it was never submitted."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbEpuZThnRRAB",
            "text": "Loved the plates!  Loved the service but the music was so loud it was hard to talk at the table! But the food was really good!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMX0V6WmU3azVpblpBEAE",
            "text": "Star studded staff, some of the best cocktails and food in the city.  Highly recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FdFJVNUVlbEJWWTNkS2JuWldaM3BWVGtjMlZVRRAB",
            "text": "Staff is wonderful. Had a delicious pizza with pepperoni. Please support. Love seeing folks be a part of the community. Great food and great service!  Come out and enjoy! Shared a  meal, drinks and a desert."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOaTlxNUxsOXQ2SnZBRRAB",
            "text": "Went to eat here on mother's day with my daughter. And the food was delicious and the services excellent. We will be dropping by again. The food we ate was a special for 2 spaghetti,  chicken cutlet, Cesar salad, and 2 drinks. And the most delicious garlic bread I've ever tasted. The food portion was great we ate and still had leftovers for both of us to take home."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoc1VqUkZaa2hTUW14MWJucFBTRzFCYVRobWRWRRAB",
            "text": "Great food and atmosphere.  Staff knowledgeable about the menu and make good recommendations instead of expensive recs — I appreciated that.\n\nMusic was stellar on this pre-4th of July celebratory night.  Enthused to come back!   Strongly recommend."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MmUzN0tREAE",
            "text": "Service was really good, food was amazing and I had one of the best salads that was included in their lunch special. The price of the lunch special compared to what you received was a good deal. Highly recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJM1FUUmhUV0UyYTNSMVVYRjBXV2swUlc5SVNFRRAB",
            "text": "I sometimes go here for lunch as per convenience and good lunch prices. However, today I saw a female waitress for the first time. When I walked in, she looked at me and asked in a surpsingly impolite manner \"Can I help you?\" I said \"Yes, can I sit to have a meal? Can I sit there?\" She said yes and never came to my seat. She kept on going to the table next to me but not me at all. After some time a male waiter realized I was there for a while and approached me and had to ask me if I was being helped, and I told him nobody, and asked for the menu. I added that I only had 30 minutes left from my lunch break as I had to go. I told him my order and asked for the same lunch menu I usually get. The food was brought by the female waiter,\n~ I usually get offered cheese on top of my pasta, but sadly she did not ask me anything and left. After some bites I had to get going and asked for cheese to go along with a to-go box. The waiter brought the cheese and box and then  asked me to leave the bill at the counter. This seemed odd, since I've never been asked to do this before. There were also just only 3 to 4 other customers in the restaurant, so unsure why she asked me to bring the bill to the counter but I did it anyways. Sadly, today I felt very unwelcome in a place where i usually feel like home. Although the service  was trash, I will continue to come here as I like the food and will continue updating my review. By the way, the lunch costs usually $13 plus tax/tip, this time I was charged $19.60, unsure why I was charged a different price that I'm usually charged but I really hope not to have to go though this again.\n\nIts disappointing that costumer service is something that this waitress has never learned about."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzaXRtSHdBRRAB",
            "text": "Wow! What a great new place to have in the neighborhood. Perfect to grab a drink and get some quite amazing (and authentic tasting) Italian food. Not pretentious like other Italian spots- blows away the former place that was here. Best yet, can bar-hop to Cantina next door 🍹🍻!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJanBUMHV3RRAB",
            "text": "A Warm Welcome to the Neighborhood!\n\nFrom the moment you walk through the doors, you can feel the warmth—not just from the kitchen, but from the people who run it. This restaurant isn’t just a place to eat; it’s a place where community and flavor come together like old friends at the dinner table.\n\nThe food? Simply outstanding!!! Every dish is crafted with care, rich with flavors that feel both comforting and exciting. Whether it’s a classic favorite or something new, you can taste the love in every bite. But what truly sets this place apart is the people behind it—their kindness, their dedication, and their genuine desire to make everyone feel at home.\n\nIt’s rare to find a restaurant that feels like it belongs from the very start, but this one fits seamlessly into the neighborhood, becoming part of the family. We’re lucky to have them, and if you haven’t visited yet, you’re missing out on something special. Welcome to the community—we’re so glad you’re here!"
        }
    ],
    "reviews_count": 76
}