{
    "name": "Chele's",
    "place_id": "ChIJZ49Idx_3wokRqAk5Qo0tlAs",
    "grid": "MN10",
    "address": "2280 Frederick Douglass Blvd, New York, NY 10027, USA",
    "rating": 4.4,
    "user_ratings_total": 73,
    "phone_number": "(212) 691-4512",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MVRXZEJkRU5QYVcxNFduSjFNbWwxZG5adVpuYxAB",
            "text": "Chele's is a delightful spot to enjoy fresh, thoughtfully prepared food. The menu offers a mix of comforting and inventive dishes - all served with care. Warm, welcoming and full of flavour. Thank you - a lovely spot."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkM05WcFZVRkpKUlVWM2VYWldabkY1VWxwd1pXYxAB",
            "text": "This newish addition to FDB is also one of the bestest. Favorites; nanas chicken soup, crab cakes, apple tarts. Fresh imaginative concoctions, superb juices."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psM1NURnRWMDlMTVVOM05HWkNSRGh3VERBNU5tYxAB",
            "text": "I had high hopes for this place. The restaurant is cool. The menu has a good variety of options. I went on a Friday night and there were only a handful of people there and there was only one person working. He was friendly but difficult to understand. We ordered the oxtail pizza and the oxtail was very flavorful and tender. We didn’t have the oxtail dish but based on the pizza, I expect it to be very good. However the flatbread was crispy on one side but soggy on the other side and not much more to it other than the oxtail. My husband had the steak and substituted the fries for mac n cheese. Both of which he found very bland. I had the special saltfish fritters which had a good crispy outside but the inside was mushy instead of flaky. I suspect it wasn’t properly thawed. I had the goat cheese, beet and apple salad. That was delicious! They also have these natural juices they let us try and those juices were yummy. My husband had an adult beverage with the coconut drink.\n\nI wasn’t sure if the emptiness in the restaurant was due to it being new or on its way out and based on the food I had there, I suspect it’s on its way out.\n\nI hope they can fix the menu issues. Until then I will not be going back as there are other very good options nearby on Frederick Douglas Blvd."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoNWRIUlZaMmh5YjNKRk5GZFRVbHBtY0hWcVlrRRAB",
            "text": "My favorite spot in Harlem … such a great vibe and the food is so good . Merci a la Team"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBM0pyTzhBRRAB",
            "text": "I went here for dinner recently and had a really nice time. The people working that night were kind and attentive. I enjoyed the food and thought it was tasty. We got the salmon and ribeye mains and the mini biscuits cause we really wanted to try them. I’m glad we did.  I want to try the brunch here sometime soon too."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SQmRERXlXRll4TTNKblVXZE9VRnAyYXpsTU0yYxAB",
            "text": "Amazing food and lovely service. The Iced Herbal Tea was a good surprise!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVWIxSlhkSFJsZGpNNWJqaERWbFJHYTJOelFWRRAB",
            "text": "Fresh juice was delicious. Service was top tier. Excited to try their food in the future!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOSWFqWlZUMXBNUlVwbGRGQjZjREJEWVdFelVHYxAB",
            "text": "I am very critical of most restaurants because I cook and love home cooked meals. I also find the food, service, and cost of restaurant food disappointing. As a result, I was pleasantly surprised at how wonderful CHELE'S is. 5 stars for the clean and stylishly beautful space, to the vibrant menu, and wonderful staff. The cook is amazing. He has skills with various styles of food, prepared the meals in a timely manner, and displayed the meals in an artistic way. The host John added a sense of professionalism and caring, which is often lacking in many restaurants. All this at a fair price. I will be back. We need to support our local businesses that strive for excellence."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOZlUxZG9SMnhoZFdFMVFVSkhSRTVGVkRKS2RrRRAB",
            "text": "I struggle writing this review because I feel like this place has potential, but it’s missed the mark one too many times. I first came on their grand opening, and since then I’ve ordered food and iced coffee several times. Unfortunately, the food never quite justifies the price point.\n\nThe iced coffee was good the first couple of times, but it hasn’t been consistent — and at that price, I could go to Starbucks and know exactly what quality I’m getting.\n\nI do think the location and ambiance are great, which is why I believe this spot has potential. But right now, I find the concept a little unclear, and if the food isn’t going to deliver at a higher level, the prices should be adjusted.\n\nI really hope to see this place improve, because I’d love to enjoy it more often."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xONlJscGFhR1ZHTjFaemFrWTFkRzVXZG1jeWNGRRAB",
            "text": "Food was delicious and service was great! Highly recommend the jerk wings with Thai chili sauce - the picture doesn’t do it justice lol"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WT1NXNDNhRGhVT0ZsV2VuSjBPVzlLYkRSMVdrRRAB",
            "text": "The food here is so good it’s kind of crazy"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrd2FTMU9NVk4xTjNwTlRWSlVWVmR2TXpGRGNHYxAB",
            "text": "Stayed at a nearby hotel and was recommended this lovely restaurant. Chele’s is a warm and vibrant space, no doubt a reflection of the owner Michele’s personality. I chatted with her and learned she used to have a place open in west village and has now brought a little slice of magic to Harlem.\n\nOverall I enjoyed the food and atmosphere. The zucchini chips were fresh and the jerk chicken was spicy but flavorful.  Service was decent and prices didn’t seem too bad. The mocktails were creative. There was plenty of seating (indoors and out), fast WiFi, and outlets. Definitely worth checking out if you’re in the area."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxb2VrZEdOMGhZTldkWWNXZEhhMUF3ZFhReGVVRRAB",
            "text": "Great food and terrific service. This spot is fairly new but I suspect it will be around for a while"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkR1oxWjRORWhWZUhaRFFta3lUMVpEWjJ3MGJIYxAB",
            "text": "Food was good\nWindows could have been cleaned"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCT1gwSlFRV2xYYTIxbWVGWjNiMVphVm1kcmEyYxAB",
            "text": "Went for my sister's birthday, I got the Herb Turkey burger and it was delicious. 10/10 would go again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOcTF1dE9xbXU2MnhBRRAB",
            "text": "Food tasted good. Pancakes weren't hot, so the ice cold butter didn't melt. I worked around that. Order took a long time to arrive...considering we were the only folks ordering (only 2 other tables with people who already had there food). Our server was new and very uninformed. I'd likely return."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKTGs3YnVDazZiSUN3EAE",
            "text": "Great ambiance. They got rid of their early bird $15 breakfast sandwich and coffee special, which means I probably won’t be back again soon as the menu is on the pricier side."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOWGlnNzNqODludlp3EAE",
            "text": "Great local spot, beautifully decorated and fun vibe. We enjoyed both the breakfast burrito and biscuit sandwich, and love they open at 9 for breakfast! Service was also super friendly. Can't wait to come back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQenpocm5WdzVfRDJ3RRAB",
            "text": "Food is very disappointing. I got the oxtail which was fatty and gravy was oily only ate the rice. Also had the steak medium came out looking and tasting like cardboard.\n\nI don’t normally written reviews… I’d skip the food here and have the chef reevaluate his dishes.\n\nGood vibes and good wait staff however. Fix your dishes if you’re claiming to be Caribbean inspired."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJN2dtZnlLOS16by1RRRAB",
            "text": "We’ve been to Chele’s several times. Consistent Friendly and prompt Service, nice atmosphere, every dish we’ve had was delicious.  One of our favorite restaurants."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOamFycjJMbE5uQmxBRRAB",
            "text": "Chele’s never disappoints. The food is high-quality, the preparations are on point and the staff is genuine and friendly."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNdi15b3JJeTVYTHFBRRAB",
            "text": "Dapper staff, nice music and ambiance. Food could use a little more seasoning but they do have hot sauce upon request."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd3VmNWJ3EAE",
            "text": "Great new place! Food and Service was great. Decor is nice and comfortable. Lots of options on the menu"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJc29HbGVBEAE",
            "text": "Amazing food love the curry goat and chicken soup, great edition to the neighbor hood."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3M3RMWHh3RRAB",
            "text": "Beautiful new local restaurant with great managment and very friendly staff. Delicious Bronzino over black rice wow must try. Let’s support our local Harlem businesses and enjoy this place."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cE5uVDB3RRAB",
            "text": "❤️ LOVE and the Sunday brunch is a grown and sexy vibe!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3aElia1ZREAE",
            "text": "Chele’s Restaurant just opened in Harlem, and it’s already my favorite in the neighborhood.\n\nThe vibe is super chill at night, and the menu is a mix of American, Caribbean, and home-cooked comfort food. Everything we had tasted like it was made with love.\n\nChele, the owner, even stopped by a few times to check in, which made the experience feel even more welcoming.\n\nI was pleasantly surprised, and now I need to try the rest of the menu. Hoping Chele’s sticks around for the long run because our first visit was a hit. Highly recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3a0tLcGd3RRAB",
            "text": "Sexy spot the oxtail pizza and jerk wings are amazing 👏…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdWJiVjZnRRAB",
            "text": "This was a night to remember phenomenal experience the drinks were special the food was amazing"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnLUozb2hBRRAB",
            "text": "I really enjoyed our time at Chele’s, its cozy vibes invited us to enjoy a great meal. I definitely recommend this place."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnOE9iQmpBRRAB",
            "text": "Amazing new restaurant in the neighborhood. Every bite was more delicious and flavorful than the next. We got the goat cheese salad with apples and beets, green curry mussels, and old bay seafood fry up. The green curry was so delicious we asked for extra bread to soak up the sauce. We also got the apple tart. The place is cute, cool vibes, great design and playing fun hip hop on a Friday night at a reasonable volume. The menu is filled with dishes I can't wait to try. We plan on returning soon."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbVpHNEtBEAE",
            "text": "The food was amazing, and the staff and decorations (fresh flowers at every table!)were just as great. Thank you, Miguel! Can you believe he steamed my milk for my coffee?! This easily became one of my favorite places!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneHFXa3hRRRAB",
            "text": "Impuntual! We stayed at opening time waiting for 15 minutes. And we cant breakfast because there is an employeer inside but de lights are turned off. I dint recommended this place."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbkpYWGJ3EAE",
            "text": "what a HORRIBLE Valentine's dinner.\nI ordered Thay Veggie Green curry w/ coconut rice. Waiter did NOT say they do not have the ingredients for that dish; SO, without consulting me they served 'Caribbean Coconut curry shrimp with black rice' as replacement. I do not like black rice. I kindly stated that the dish was not what I had ordered. They came back after 2 mins with same dish without shrimp with black rice on top. I delicately said AGAIN: this is not what I've ordered. Finally the manager came with a salad trying to settle things down. I told her I was unhappy for the bad service. Meantime, the waiter came back for the 3rd time offering me the meal I have rejected TWICE. After a few minutes manager came back to table asking how was the salad. I told her that I was unhappy and even more because she did not understand WHY I was unhappy... she got offended and she said I was rude telling her 'she does not understand English. Anyhow, they charged me for everything except the salad (just a simple salad I haven't even finished). The waiter did NOT even apologize to me. I found it very unprofessional. Bad dinner and I do not recommend it"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnN01MM3hnRRAB",
            "text": "Such amazing breakfast and dinner! And the desserts are splendid.   Another very welcome restaurant to the neighborhood and the service was relaxed and super friendly."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcHBqbk5BEAE",
            "text": "New cute spot in Harlem.  Had a nice experience here and they just of their liquor license as they have only been open for a few month  so I was able to have a martini.   Me and my guest both enjoyed our food. The Caesar Salad was especially tasty.  They were \"downtown\" prices but that is most places in Harlem now. I don't mind paying as long as the experience is the same.  I hope this spot remains because it has the potential to be something new and different in the area.  Plus it's spacious and I think I spotted a private dining area in the back.  The ambiance and decor are good too.   Check it out and support Black Women Owned Businesses."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfbFkyTElREAE",
            "text": "Great breakfast spot. The food is good and the prices are quite reasonable. Service was a little slow but passable."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfeS1mSldREAE",
            "text": "Walked in because it was empty and looked cute. First time. Pleasantly surprised. Zucchini chips on point !"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdmRUM2xnRRAB",
            "text": "Nice place and staff. Management is pleasant. The establishment was clean. Happy hour portions are small. For example, jerk wings 2 winglets for $10.00. That’s not 1 wing. The fries were $10.00 for a small portion that was falling out of the bottom of the container they came in. Drinks were nice, but no hard liquors due to licensing. Specials were pricey, but portions were okay and the chicken fried steak and gumbo was said to be good."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOFl1dGZREAE",
            "text": "The restaurant is located in Harlem, but I feel like they need more visibility, because it's a place that has a lot of potential! It was my first time visiting, after we were walking nearby, with the cold weather in the city. Juan (The colombian guy), was our server and he was very kind, funny and very stylish! Juan, made me one of the best oat milk lattes I've ever had. My boyfriend ordered a seafood plate, I ordered a sesame chicken salad,  and we ordered two delicious desserts! We'll be back for brunch!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmanE3QnhBRRAB",
            "text": "Charging downtown prices uptown. Prices are absurd"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbXAzbkNnEAE",
            "text": "I loved this place! First, for its excellent decoration, second, the dishes were good (I think you need you can make something/plates different that can catch people's eyes), but the most important and incredible thing was the person who served us (Juan) I think he is the\nManager! He was the person who served us and helped us a lot. I went with my sister and my two friends, since it is our first time in New York! While he was recommending us what to eat, he recommended things to do in New York! He was very friendly, kind and very funny! Thank you Juan 😍for making our breakfast something spectacular.\n\nP.S.: There was a man with a cowboy hat who really did not let us eat comfortably, he kept asking us things and we were already quite uncomfortable, otherwise everything was very good."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmajZIdFdBEAE",
            "text": "Chele's knows what they're doing in the kitchen, but when it comes to the staff, there's a lack of decorum.\n\nWe came for Chele's New Years jazz night.  While the food was well made, it seems as though the staff is more interested in spending time with each other than catering to the customer.  For almost the entirety of our time there, the waiters had their backs turned to us and the rest of the restaurant, talking amongst themselves.  A bedazzled cowboy, who I assumed was the manager, wandered around the space taking selfies.  Our waitress barely visited our table and seemed to have blatant disrespect for her workplace.\n\nI see that a lot of the reviews of this place describes a cozy and friendly atmosphere.  I cannot say that our party relates the same sentiments.\n\n(Side note: the bathroom situation needs some help.  A curtain in front of the door that leads into it would be a great addition, so diners aren't watching people come out of the bathroom door, which remains open - not something anyone wants to think about while eating.)"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2djdPZXFnRRAB",
            "text": "Great dessert and lunch. Service is great. Will definitely come again when I get the chance. :)"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dVpiZV9nRRAB",
            "text": "Wonderful environment. Friendly staff, The owner makes me and my guests feel welcome"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cXZhd0pnEAE",
            "text": "Great new addition to the neighborhood. Staff is friendly and attentive. Ambiance and decor are on point. And the food and drinks were delicious.\n\nOrdered a bloody Maria and the bagel with salmon lox, tomato and onion which came with fries, which were both delicious. Will definitely be back again. May be my new favorite local spot."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2NzlTLUFnEAE",
            "text": "Atmosphere was worth it, immaculate vibes. While the food was not perfect, it was worth the dining experience. With plentiful seating and power outlets, this is a perfect lunch, meeting, or remote work spot. The jerk wings had great flavor and the latte was delicious. The burger had great flavor with quality and fresh toppings. With a drink, shared appetizer, and entree for 2, the total was roughly $50 per person. Great bathroom and conveniently located."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2b09QeFVBEAE",
            "text": "If not for food you'll definitely come back for the service.\nRyan gives impeccable customer service making you feel right at home."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dWFlUklnEAE",
            "text": "Chele’s Café & Bistro opened at 2280 Frederick Douglas Boulevard, at the top of Frederick Douglas Boulevard’s Restaurant Row, between 122nd Street and 123rd Street. Michele Gotan, the Executive Chef and experienced restaurant owner, serves Caribbean-Asian Fusion. The restaurant is open for Breakfast, Lunch, and Dinner. The décor is simple, has excellent taste, and provides a relaxing dining experience. I have eaten at Chele’s several times since Chele’s opened.  The service  is excellent and friendly. I ate alone with my children, grandchildren, and nephew; they all commented that this restaurant is good. In my opinion, each on different occasions. Chele’s has the best hamburger on Frederick Douglas Boulevard. Chele’s presently serves beer and wine but has been approved for her liquor license. Michele says the liquor license is forthwith. Chele’s is going to have a delivery service. And if you are going to the Apollo Theatre for a show. Chele’s is the closest restaurant with a full bar and dining."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2aVlyQTJnRRAB",
            "text": "Stopped by Chele’s after a show at the Apollo, and even though it was close to closing, the staff welcomed us warmly. It was great to meet owner Michele, whose passion and excitement for her vision was inspiring.\n\nThe food was excellent—flavorful, fresh, and reasonably priced. The space is lovely, with a warm and inviting ambiance that feels perfect for a casual night out.\n\nI’ll definitely be back and wouldn’t be surprised if this becomes a go-to spot for me."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNWJHbXZnRRAB",
            "text": "Had a nice dinner here on Friday 11/15--they said they'd been open only about a week and the menu still might change a little bit, but I'm sharing menu photos from 11/15 as there's nothing posted online yet. Service was very friendly and warm, and the decor and vibe were lovely. Not many vegetarian options, but veggie coconut curry was yummy and so was the pineapple mocktail I tried (they had about 4 mocktails that aren't on the menus in my photos). We also enjoyed the roast chicken and the brownie sundae. Would definitely come back again and would like to try brunch soon!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQLXEzd25BRRAB",
            "text": "Great new addition to Harlem! Michele is an amazing entrepreneur and a businesswoman, and she was the proud owner of Extra Virgin in West Village for a long time. She is now the proud owner of Chele’s in Harlem. The menu is exciting with great brunch options and there are a couple of vegan options as well. Everything on the menu is gluten free or can be made gluten free. It’s chic, it’s delicious, it’s black female owned. A local gem. I’m so excited!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQeHRuZFR3EAE",
            "text": "A great addition. The food is amazing. The service and atmosphere too. If you want gf options, this is the place. My wife loved it!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQaXVTb1dBEAE",
            "text": "We were excited to try this new restaurant in Harlem, and it did not disappoint! The food, ambiance, and service were all exceptional. What really stood out was their ability to accommodate gluten-free dining — an absolute game-changer for us as my daughter is celiac. We’ve never encountered a place so accommodating before. We’ll definitely be coming back!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQOUs2SG9BRRAB",
            "text": "We ordered three pies for Thanksgiving.   They were all great, from scratch, with all the right homemade touches.\n\nApple pie: I’m not fond of too much crust, so this pie didn’t have the top layer of crust, which I loved. The apples were chunky cubes with a loving balance of sweet and tart and not too saucy.\n\nKey lime:  For those inclined to key lime, this one is for you.  The first bite is tangy, but then the sweetness kicks in.\n\nPecan pie:  It was sweet, chewy and not gooey.  We put it in the oven for 5 minutes to make the top crunchy."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MHN2R05BEAE",
            "text": "We ate here twice. Once for dinner and once for breakfast. For dinner I had the pork chop with beans and rice. The pork chop was very tender and flavorful. The beans and rice were good as well. My wife had the chicken sandwich. She loved how crispy the chicken was and she raved about the hand cut fries. For dessert we had the key lime pie and the flourless fudge sundae. Both were very tasty.\n\nWe went back for breakfast. Had the biscuit, sausage, and egg sandwich. It came will home style potato and a small mixed green salad. Never had a salad for breakfast but it worked surprisingly well.  Asked for jelly and they brought us the best blueberry jelly."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2eXE2dFFREAE",
            "text": "Cozy restaurant restaurant. Beautiful inside with a very engaging bartended. Elevated Caribbean food was delicious."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bHBuWmt3RRAB",
            "text": "We came for lunch one afternoon and then dinner another night soon after. Everything we ordered was so delicious, already thinking about when we can go back! The restaurant has a warm vibe and  staff go out of their way to make you feel welcome. Would give Chele’s 10 stars if it was an option!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MHA2VWdnRRAB",
            "text": "came for brunch, great atmosphere and service. the food was fine. bacon was great, but pancakes were unfortunately dry (with great taste)."
        }
    ],
    "reviews_count": 59
}