{
    "name": "PB Brasserie steak house",
    "place_id": "ChIJ92TjdQD3wokR3CrZOtC9g3c",
    "grid": "MN10",
    "address": "Pb brasserie steak house, 60 W 125th St, New York, NY 10027, USA",
    "rating": 4.7,
    "user_ratings_total": 519,
    "phone_number": "(646) 567-4693",
    "reviews": [
        {
            "date": "6시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdVptZFZZMUpOUTJobWQwUjRjQzB0Y21KdWFWRRAB",
            "text": "I love this african owned restaurant, amazing.Truly amazing.I will visit again and again and again.Hope you will too"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcVIxTktOWE14VUhkaE9XNUJZWFJXTUdKME5VRRAB",
            "text": "We visited this restaurant to celebrate our anniversary and were quite disappointed with the experience. After traveling all the way from New Jersey, we expected a more thoughtful gesture for such a special occasion. Instead, we were charged $12.00 for a cheesecake we didn’t even order — something that could easily have been offered as a complimentary amenity, especially for an anniversary. It felt rather tacky and cheap for a place that claims to be high-end. Sadly, the experience left us underwhelmed, and I wouldn’t recommend this restaurant for anyone looking to celebrate a special occasion."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCRVkydGtUMnBITVU1d1ZYVk9jSHBXZEdkUFZGRRAB",
            "text": "Ron the Photographer is very excellent love his pictures very professional."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMGRuVnlha2xrVVY5WUxWQnZWMTlIUVVOQmFGRRAB",
            "text": "They just need to work out some service kinks they be good. That food was so great omg it was good"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GS1dFSk5SVTExYVVsemR5MUhUbTVpYkhCeVJGRRAB",
            "text": "The service was amazing from start to finish! The food was absolutely delicious — packed with so much flavor in every bite! The atmosphere made it perfect for a fun and intimate date night. I’ll definitely be coming back again soon! Highly recommend! 🍽️💯✨"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aSmFYaDVla1Y2ZUZaeE56SnFhVXhQV0ZWYVNuYxAB",
            "text": "Wow this place out did they self for my birthday from the moment I walked in they knew my name and my part booked the reservation they sing me happy birthday with desert which the cheesecake was delicious! Also the lobster and shrimp spaghetti was to die for the chicken with mash was good and the drinks was 10/10 shawntae was our waiter and she was amazing! The place is beautiful and clean! Will be back"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSlJVMVFMVXh1YkdsNGFHZEZWbHBmTkROb2VIYxAB",
            "text": "This place is fantastic! The interior décor is beautiful and comfortable, with plenty of inviting seating. They even have a private section that’s perfect for events. The staff is friendly and attentive, and the food is absolutely delicious—flavorful, well-presented, and generously portioned. Prices are reasonable for the quality and quantity you get. Highly recommend! 🌟🌟🌟🌟🌟"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvNVNIQTJiVEF3TURWUFNtWjFSWFpYWTB4MmNFRRAB",
            "text": "Genuinely one of the best meals I’ve had in a very long time at a restaurant. A friend and I split the 28oz $120 ribeye steak. The steak itself was extremely well prepared. The sauces that it came with were good and to my delight were not overly sweet or ham fisted taste wise. The service was decent. I weigh my own meat on a regular basis and I have a pretty hard time believing that was 28 ounces. Regardless, it was an excellent meal."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWlZsOTVhbXR5VGtGdFNXZFlka1J0VUVKSWRVRRAB",
            "text": "First thing I want to say is that a lot of reviews talk about the evening atmosphere here but if your like me and enjoy visiting great restaurants in the 11am to 1pm time frame then don't wait any longer because the food is off the hook. I mean wow what a breathe of fresh culinary air when the chef pays attention to every little detail in creating a menu of wonderful rich, flavorful dishes. We stopped in around 1130am and left here feeling as satisfied as I have in a long long time. Even simple dishes like Mac and cheese, French onion soup hell even the French fries with the steak were quality and tasty. Even The cocktails we had were perfect, you know how in some places they make them too sweet or just drown them in hard liquor, not here people. Clearly the chef had a vision and with the devil in the details hes making it his mission to deliver at every level. The service was excellent and having worked in restaurants myself I could see the attention to staffing and having folks trained to perform and provide service. To wrap up, I'd say if you just wanted to stop in and try an appetizer or some small dish for lunch or early on the weekend do so. No fake french brown sauce and BS here, this is the real deal, really impressed. Check spot hero or park whiz apps if your driving, if your not from the area you can really get turned around by all the traffic rules at intersections, heads up"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twWUxXUnJNVVZyUVY5WVYxa3laVlZ4VlZsMmRtYxAB",
            "text": "Beautiful gem in the heart of Harlem. I ordered the warm shrimp salad as a starter and the branzino for my main course. My cousin ordered a steak. Everything we ordered was cooked to perfection and deliciously flavorful.\n\nThe food is a fusion of modern dishes with Senegalese influence. Our sever was excellent and very attentive which is what I look for in any restaurant. We also met the owner who was very nice and told us about his inspiration for curating the menu. Overall it was an elevated experience with savory food in a beautiful and well appointed atmosphere. Thank you Cisse!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkS09UWldNbFJGWnkxV1NtWlRORlZJVnpFemJsRRAB",
            "text": "Very cozy place with great music! I love the escargot and lobster with shrimp pasta, very buttery and creamy.  The lobster mac n cheese was good and very tasty, the jollof rice was spicy and cooked to perfectly, the salmon bearnaise was great, and my chicken  ceasar salad with anchovies and parmasean with delicious!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214UWNqaDBjVW8yZUVGSmNWRnVOM0ZFUW1OTldHYxAB",
            "text": "Our food was amazing and they made his birthday SO special with a candle and dessert. Great wine list and an amazing menu with both steak and seafood. We had the lobstet shrimp pasta and ribeye, both were incredible, comparable to some of the Michelin star restaurants we have dined at. If you're in Harlem or anywhere in the city, give this place a try!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZdGEzVmZMUzFsTFZWUWFrazRRVXRFWVVGaFQzYxAB",
            "text": "Good experience. Would definitely go back."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZeGNVeE5UVzVuZFhjNE1HVkVRbFF5VHpkemFFRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️ Absolutely Delicious A Must Visit!\nComing back to New York for a visit, this place has truly been the highlight of my culinary experience. The food here is absolutely delicious! The lamb chops were cooked and seasoned perfectly, and the strip steak grilled over charcoal had that rich, authentic smoky flavor. Both were incredibly tender, and you can tell they cook with real passion.\nThe calamari was fresh and flavorful, the cocktails were thoughtful and well-balanced, and the fries were perfectly crisp on the outside and fluffy inside. Everything tasted intentional like the chefs genuinely care about what they serve their guests.\nPlease eat here you will enjoy it. I can’t wait to come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGaFRYWmhiVUZxYkY5YVZERjRRV0V0UldoTFZYYxAB",
            "text": "Amazing Service from start to finish!!!\nChanette was a pleasure to have as our server!\nWill definitely be back :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25velkwaGlYelkwZFZkeVVFTjZiMmRzYVMxdlFXYxAB",
            "text": "Chenet was the best , her energy was outstanding, the atmosphere was amazing and the food was outstanding, the salmon was seasoned perfectly, the NY strip was fantastic definitely a new place for me and my companion, I came all the way from Connecticut to see this place and I am truly impressed, I’ll be back next weekend , thank you for great food and wonderful people."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TmVXVm5kRUZZU1doemJWODFRM2x0UW1sbWMwRRAB",
            "text": "Chenet was awesome her attention to detail and pleasant attitude combined with professionalism made this experience one I want to repeat with my extended family"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214MVNWOWtja2gwWVd0VmFrNWpXV1pNYm5OT2JXYxAB",
            "text": "Had such a great time at this restaurant!  The service from Chenet was impeccable — attentive and friendly. The atmosphere is absolutely top-notch, warm and welcoming. The food is delicious, and the steak & eggs with fries is simply fabulous. On top of that, the value for money is excellent. I truly recommend this place with my eyes closed, and I’ll definitely be coming back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OV00wb3hXblZuTkd0WFNuZEZiVTk0WmkwMllXYxAB",
            "text": "Cheney was delightful!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNFVVTXRaamN0YTJ4SmQwTTNNblp0UTFSck5tYxAB",
            "text": "Very nice restaurant, the restaurant is like medium size, perfect seating, very beautiful restaurant, staff are very nice and welcoming, my waiter Chanette was amazing she was very polite and very attentive, The food was amazing the steak was cooked perfectly they listen to how you want your steak. The drinks was nice and strong I love it. Get the strawberry lemon drop is not on the menu but my waiter recommended and she was spot on I was nice with 2 drinks. The mash potatoes was very good with flavor. I came for my anniversary next time I'm coming with my kids. I totally recommend this restaurant. what I love also is black owned cheers to them keep doing amazing job."
        },
        {
            "date": "1달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkUFdsWm9ZM2Q1ZW5jeU4yVjZUak10VTNWdlpVRRAB",
            "text": "Chenet"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUk5XaG9OMGxOUXpaNmNHVnFTVmxDYWpjMlRFRRAB",
            "text": "Ibrahim was the best!  I was in town for my 50th bday celebration and ran across the restaurant in passing. The food, ambiance, music, service and Ibrahim are TOP SHELF STELLAR!!  The chicken and waffles and drinks came through!!  The food and service was phenomenal, my friends and I went back Sunday for brunch on my actual bday and it didn’t disappoint. Consistency was 100% on point on Sunday and an added value to our experience was Chenet our waitress. When I visit New York again I will definitely travel back to this wonderful gemof a spot!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210S01HbDZTMUo0YTJFM1NEQlVSMUoxYzBodmJFRRAB",
            "text": "Ibriham and Chenet were outstanding. Service, food, and restaurant ambiance was amazing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMU1uaG1UekF6TFdwclpFeHBlalp2TUY4MFozYxAB",
            "text": "Cheney made my birthday dinner an amazing experience with her lovely personality and suggestions! Everything was delicious! I love that it's in my neighborhood! I love the decor! I want the brown chairs! Let me know where you got them!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJeWF6VkxaMlZwTTNsYVJVc3ljaTB6VGpONU0wRRAB",
            "text": "Chenett is amazing. She made our first experience an unforgettable experience. Thank you."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0QlNWcGtVRVZEVVVnMWFXRnpkMll3UTAxT2VsRRAB",
            "text": "Charnet was amazing. She gave great suggestion for the menu choices. She was so pleasant, attentive and checked on us very often. I really enjoyed my experience. The DJ was good and food was amazing. So fresh and seasoned well. No regrets or complaints."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRVMydG5PR0YxWmpGbWRWUnFNVWRPUjJwNmNGRRAB",
            "text": "Chenet was great. Her hospitality was amazing. Very pleasant waitress. Food was a 10/10 as well."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJM1lsOTBUVWR0YW05bmRuWkhUMjl4WlZBNGNsRRAB",
            "text": "Ibrahim &  Chenet were my waiters. They were absolutely amazing. They made my first experience here worth it. They were very attentive and made sure we didn’t want for anything. The food top tier. Will definitely be back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KalJGSmtiWEU1T0ZKS2QyeFBjVnB2VDBoalVsRRAB",
            "text": "Ibrahim & chenet wonderful service !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OMExXaHVTa3hLYlV0SGVqVkRaMWhaWjJSZlQxRRAB",
            "text": "Chenet was too good to us and we are grateful. Food, ambiance, and service is so good I forgot I was on 25th!!!! Can’t wait to come back, they make you feel like family here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBemJXOTJRa1JIU0V0SFRXaGFTazQwZFVOelRXYxAB",
            "text": "This was my first time at this restaurant and it was amazing! Our sever was Shanay and she was great as well. I will definitely be coming back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5T1N6bFNhbEJNUzA1NFh6RldYMmMxWTBrNGQzYxAB",
            "text": "Chenet all 5 ‘s for service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kaFFtdDRkVEJzYXpKVmVURndRVmRpTUZOTGFYYxAB",
            "text": "Chenet was fantastic"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGNWNYSmFkVXBEYUhRMWFGcHdSRWhoU0VOU1lYYxAB",
            "text": "Chenet was amazingggg"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taSWRWTkNOV3BwVVV0bVZXczVSM1ZXUWpkQlJsRRAB",
            "text": "The service was good. Attentive and not invasive. Food was delicious and the peach bellini hit the spot!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oMVUzWmZOVTV5UTFsM1RqZEpWbVZDTFdNMU9IYxAB",
            "text": "I was very impressed with how Ronnie and the rest of the staff took care of us on our 1st anniversary. They delivered top-notch service from start to finish, always with a smile. We’ll definitely be back for date night, knowing we can count on the same exceptional experience. The food was perfect—from the appetizers all the way to the extra-creamy cheesecake."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3NGJFMVZlV3hzU25oRVlWWjNPVGxHTVdWSk1uYxAB",
            "text": "Chenet was an amazing host!!! Very attentive and provided great customer service and hospitality. The food was delicious and I enjoyed my experience at this establishment."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sVU5ITnJaR2Q0TW1ad2IyNTFPRzFHWDNaVGExRRAB",
            "text": "I had a great experience with our host Chenet, who was absolutely amazing & the food is incredibly delicious. The beverages exceeded our expectations. I highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prNU9WZG1WVTVYUmtONlpWcDZabEZxUjI5Zk0xRRAB",
            "text": "Chenet was fantastic, good great. Everything outstanding"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKRmJFbFFVM056Tm01TVZsOTFRMVZ6WVRCb1RsRRAB",
            "text": "Our server Chenet was amazing! So friendly and attentive. We celebrated my friend’s birthday and she loved every moment of the experience!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOUE15MVdiQzAzWld0VE5uVXdPWFJwZUV0dGFIYxAB",
            "text": "Amazing food, welcoming atmosphere and delicious food! Chenet was absolutely amazing as our server! She was very knowledgeable and helpful. Will definitely be back!"
        },
        {
            "date": "1달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKSVkycDVXa053TW5sUlpraGxZMVZIZVRSTFJrRRAB",
            "text": "Chenet"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGaVR6WXlSakpJVGtWM1ltUlpUbEJ6YUhsQ1UwRRAB",
            "text": "Chenet was such a treat! Took such good care of us to celebrate my mom’s birthday. This is our new Harlem staple 🥰"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxbFNuTk1aMkoyZEVoT2IyOU1ZamxpWkdGSVRsRRAB",
            "text": "Chenet was amazing! Great food recommendations and outstanding service! Felt like a queen on my birthday! Amazing atmosphere and vibe! Coming back with my whole family"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaQ1JtTlBXREZ0V0dSNE5FeHllQzFuYXpabFlrRRAB",
            "text": "Chenet was amazing. Very lovely person. The steak was delicious"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUWJYTkxOR04zVDB4RWQxQllOSFJYYzBOdVRsRRAB",
            "text": "Great vibe"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOQmJXaEtZVGxWU1VWaVpXVm9WR2RCZDBwcVYzYxAB",
            "text": "Chenet- Service and food was AMAZING! Bottomless mimosas for brunch amongst many other GREAT entrees!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214ZmRIcFFaa3RKVlUxM09FZE9WWGxzYlRWT1IzYxAB",
            "text": "Food was amazing. Staff was very friendly and attentive. I went for my birthday and it was such a vibe. They also had a DJ who played a good mix of afrobeats and R&B. I definitely would recommend this place foe any occasion or just to get drinks."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKd2NUVlRZbXRXVGtsVFJIQm9iVWhWV2w5YU9GRRAB",
            "text": "Chenet greetings and hospitality was genuinely warm and inviting.\nTop with the great delicious food and presentation of the food I would recommend this place to anyone especially business owners who are looking to impress . The atmosphere and vibes and decor is top."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkbmFUQllWekJSV25FdFpUaHpRa3hmUkU1WU1WRRAB",
            "text": "You have to GO! Steak so tender. Literally melt and slide down my throat 😋. Lobster shrimp pasta 👌🏾 Truffle fries perfect!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZNGFHcEJWak5uV2twTlNqSjNhVk5CUjBGd1FWRRAB",
            "text": "When I tell you we ate, drank, & were merry! The food, service, & atmosphere were spectacular! Harlem, you have a gem! And PB Brasserie Steakhouse has a gem in Chanet. She was soooo attentive, patient, and sweet, with our crowd ordering so much too. Thank you! We had a wonderful dinner and drinks."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5c1duaHBVMDA1UkVVMU5YTnplbXh6ZVc1c1MxRRAB",
            "text": "The only reason I’m giving an overall 4 is because the server underlined the tip amounts. It was as if she was assuming I wouldn’t know how much to tip. It was unnecessary. This is the third restaurant opened by Cisse. It was my first time there and all the food I ordered was good. I was completely full. Cisse, the owner came in while I was dining there and immediately walked to my table to welcome me. He’s a gem. A smart man."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taWFpTMXVjbW81T0Zaa2RHcDVNVFJ0VmtKRWIxRRAB",
            "text": "This was my first time here. Chenet was my server and she was great. Very nice and attentive. We did the pre-fixe brunch and a dessert. Great service and a lovely atmosphere. Will definitely come back on a Friday or Saturday night when the DJ is here."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5dmNYWjFiVXczVm5odUxYSXlUbVF0YlRoQk9VRRAB",
            "text": "From the gentlemanly (and handsome) host who was a delight, to our fabulous server Chanette (so knowledgeable and customer-oriented), to our helpful food runner, this place is all around top notch. My faves are the mocktails (loved the one with Bissap and ginger), and the French onion soup. I am definitely making a trip back just for that soup."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ONFJqVlZlR3hOVlVWNFJ6UmlWM1V0UTFWdlptYxAB",
            "text": "Chenet was awesome. Her recommendations of what food and drink I should get did not fail me.I enjoyed my meal. I love her service, her honesty, her passion, her politeness. She’s a great waitress."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkV1JVdEVXVFF5WW5RelNWUnZjMmxvYkRSUVduYxAB",
            "text": "A Diamond in Harlem!!! The food is delicious. We had Lobster/shrimp spaghetti, Rib eye and Branzino. I'll definitely go again!!! Not your normal small NYC restaurant so there's space for large groups!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sT1JuZzBXRTlqZGtGUGJWSktVbXR5WVdvNFdsRRAB",
            "text": "Absolutely loved everything from the ambiance to the food! The lamb chops 10/10!! My favorite drink was the Casa Migos Strawberry Lemon Drop…so good and a popular drink. Love that the owner is a harlem native, who still lives in Harlem and also has other establishments in Harlem. Thank you for doing it for our community."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taU1pUWm9Za05WTTA5T01VNW5NRWRCU1RWMk5YYxAB",
            "text": "Ibrahim and chenet  the service amazing and very constant; but never intrusive!! The music; atmosphere; the decor; the food; the drinks!! Worth every penny! I MAY tip the biggest tip i've ever given! Thank you PB Brasserie for being in Harlem!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPemJoLUNBdHVLajJnRRAB",
            "text": "We had a disappointing experience. The hostess repeatedly asked for our orders as if she wasn’t keeping track, and her attitude was rude and snappy throughout. The service felt rushed, and it really affected the overall visit. My food arrived cold, the spinach tasted burnt, it also came with an unexpected add-on (a lone French fry that looked as if it dropped from someone else’s order and they just left it there for a little razzle dazzle), the drink I ordered came warm. Unfortunately, it all added up to a poor dining experience. We will not be dining here again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNva0xXazRBRRAB",
            "text": "When i tell you run don’t walk to 125th runnnn ! This place is so sexy and just a aesthetic vibe loved everything about it being in 125th so much going on then boom your in the most classic atmosphere  with great music playing in background, then the food listen no complaint even the mocktails had me thinking I was lit how pretty they were ! I had lobster and shrimp pasta 10/10 my hubby had the chicken and mashed potatoes 10/10 the truffle fries were good the dessert was 1000000/10 like the fudge brownie get ! We will be back !and shout out to Rose she was so nice and took all my pictures great service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NWQwZEVNekpmU1dOMVNqUTFNV05YTVVsdFZuYxAB",
            "text": "I can’t say enough good things about this spot. The menu had something for everyone, and everything we ordered tasted amazing. Service was fast, friendly, and professional. It’s rare to find a place that nails both food and hospitality, but they’ve got it mastered here at PB."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0dGFVd3pVVXBqYlVZMVFXSmxRM1pyWlVwYVZVRRAB",
            "text": "Lovely atmosphere. Ibrahim was very kind and helpful. AC worked very hard, so it was very cold inside. What we tried were all excellent. Great ideas. Fantastic redwine sauce, tasty buttergarlic on top of the filet mignon. Truffeled fries. All was superb, highly recommended."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNXE3Rm5BRRAB",
            "text": "Disappointed is the only word I can use to describe my experience.\nAfter spending $100+ per person you would expect better quality. Ordered medium rare steak and the waitress immediately began to tell me my steak will be bloody and people don’t know what they want. Asked do I want medium well. She laughed I didn’t see the joke. I again stated I wanted medium rare and I enjoy my meat on the rare side. What I received was a overcooked steak that was borderline “well”. I tried to eat it but it was too chewy. I could not enjoy it. I asked the waitress if she made a mistake placing the order she looked at my food and told me it was medium rare. Perfect example of gaslighting. She then left and I didn’t see her again until it was time to pay. As she was rushing us out of the restaurant. An older gentleman whom I didn’t catch his name did walk around to all the tables asking about our experience, but I was in the middle of telling the waitress about my steak and he left. In hindsight. I would’ve just told him maybe he would’ve corrected my order.\n\nOn a different note, the DJ played amazing music. The ambience was lovely. The hostess was friendly."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJck83VW9RRRAB",
            "text": "I had such a wonderful experience at PB Brasserie Steakhouse! From the moment I walked in, the ambiance was warm, elegant, and inviting — the perfect place to treat my mom for the first time. She instantly fell in love with the vibe.\n\nOur waitress, Chanet, was phenomenal. She sat us down with a smile and made sure we were well taken care of throughout the evening. Her service was attentive and friendly, and she even helped us with food selections. I ordered the salmon, which was perfectly cooked and full of flavor, while she recommended the chef’s special surf and turf — and wow, it did not disappoint!\n\nOverall, the food was absolutely delicious, the service was top-tier, and the experience made a lasting impression. I’ll definitely be back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnenF1ZWpRRRAB",
            "text": "I am having lunch at the moment, for the price they charge for food the service is lacking. I was seated and ask what kind of water I prefer but after bringing my bottled water I was not approached to ask for my order. I waved my hand several times to get their attention so I could place my order. I order calamari and ribeye. The calamari was hard to chew even my jaw was began hurting. Believe me no exaggeration. It also lacked seasoning at least some salt. The place is empty and I had to constantly pour my own water. Just as I was typing a waiter came to pour me more water. The last straw is that my steak was overcooked.  I ordered a mid rare and received a mid well. For all the good reviews this place has received I was looking forward to a great dining experience. Unfortunately I was deceived. I will certainly not returning or recommending this place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPVEZ0YlBEczdQdm9BRRAB",
            "text": "Chenet was amazing!!! The best service I’ve had in a very long time. She was accommodating and made an amazing drink and food suggestion. The salmon is the best entree on the menu!!! I will be back and be sure to sit in Chenet’s area."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGNE5qQnZaM2RPY0hJNFlXaExVRFpxWTJOT1VFRRAB",
            "text": "I came last night to do a food review with a friend everything was exceptional. I have to say the steak is some of the best I’ve had. I would recommend everyone to come try this steak house."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jNFIzSlRjVFo1YzB4alVXWjNVbUUzTTNaSlpuYxAB",
            "text": "This restaurant captures the heart and soul of Harlem. From the first bite to the last, every dish felt like comfort food elevated to another level. The atmosphere was inviting, and the staff treated us like family. Thank you chef Cisse and Staff!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbTdDSnl3RRAB",
            "text": "Chenet greeted us with a warm welcome and was very very sweet & knowledgeable about the menu. Everything she recommended was delicious. Her service was so amazing I will make sure I visit this steak house every time I’m in New York. Such a wonderful dining experience!! 5 stars across the board"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKSGs0SXltdS03OW1RRRAB",
            "text": "Outstanding service, food and the restaurant is beautifully decorated. The steak comes with this unique sauce garlic, soy sauce from what I could taste. Overall great place. I wish this place was closer to west side. Side note they have a private space that could be closed off."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQN3pvT0xlM0tHS2dnRRAB",
            "text": "Chenet was so lovely!!! Gave great recs on the food and drinks. I had the lobster benedict (first time trying benedict) and did not regret it. The playlist was great and they even had a live violinist! 10/10. Will definitely be back again"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaVBTOVh3EAE",
            "text": "Had been wanting to check out this new(ish) spot in Harlem for a little bit and man oh man, it did not disappoint.\n\nFrom the warm and friendly staff who greeted us as our table was being setup (we were a bit behind), to the incredible food - ordered the tuna tartare and the hanger steak and fries which were both INCREDIBLE.  The steak melts in your mouth, and the space is decadently designed and featured an energetic live DJ playing the best music to celebrate life, including numerous birthdays the Saturday night we were there. This place was POPPIN 👏🏽\n\nWill definitely be back to this neighborhood gem. Thanks team!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bnFDQVZREAE",
            "text": "Chenet… she was extremely amazing, and would be the reason I come back. She offered the strawberry lemon drop with Don Julio which was a great choice. Plus, the food was amazing ."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2N2NuQkJREAE",
            "text": "The ambiance was beautiful! The servicers  were kind of awkward , in ensuring our tables were cleared between meals but they were helpful when we called them over. I ordered brunch food however the French toast tasted like it was cooked in the same butter or oil as pork, of which I don't eat, hence the reason for low scoring. I'll try them again for dinner as likely their strength."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURQNjRZQhAB",
            "text": "I had the pleasure of having my birthday dinner here on 11/30/24.  What a lovely restaurant huge but very clean, nice classy decor.  There was a DJ playing some nice afrobeats music!  It wasn't crowded but we booked a reservation prior.  We were seated right away.  Everything on the menu sounded so delicious- we chose the shrimp cocktail as an appetizer and my main entrée was Chilean SeaBass with spinach and my husband ordered lobster and shrimp spaghetti- my drink was an AfroMule-very yummy.  So I will get to the appetizer first: this was our only disappointment because there were only 4 shrimp looked like they were maybe large and jumbo sizes- maybe they could at least add 2 or 4 extra shrimp for the price or lower the price for 4 or use colossal (think it was $22 or $24).  so the Chilean SeaBass all I can say is Baybay it was absolutely delicious I wanted to lick my plate because the sauce Everything was perfect perfect! Side of mash was tasty as well.  My husbands dish had a great taste but the only issue was the pasta was not cooked al dente-it was very under cooked and the lobster was over cooked and rubbery but because the taste was so darn good he ate it anyway.  We did mention to the waiter who informed the chef and manager and they were super helpful and took care of it no problem- we appreciated that.  The chef was so nice and friendly he greeted us in the beginning and on our way out.  He even gave me a birthday shot of tequila!  The staff surprised me with a happy birthday song and chocolate mousse desert which was delicious.  There was also a young gentleman there taking photos but he doesn't work for the restaurant- he was respectful and we supported him and took photos and purchased one. Overall we enjoyed everything from the food to the service, music and ambience- i will definitely go again hopefully I can hear a band next time!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NWZ1RTJBRRAB",
            "text": "I went to PB Brasserie Steakhouse and sat at the bar for dinner, hoping for a relaxed evening with good food. Unfortunately, my experience was underwhelming.\n\nI ordered a frisée salad and truffle French fries (well done). The salad was disappointing—a brasserie staple that should shine but didn’t. The frisée was wilted and unseasoned, and while I always eat my greens, the lardons were inedible: just cubes of translucent fat, neither rendered nor crispy. I left them untouched. There was also no poached egg on top, which is a signature element of this classic dish. It was a sad salad, and I didn’t enjoy it—which is rare for me.\n\nThe truffle fries weren’t much better. Ordered well done, they came out golden, with a light dusting of shaved cheese and a whisper of truffle flavor (or was it in my head?) They weren’t terrible, but they didn’t deliver the truffle richness or crispiness I’d hoped for.\n\nService at the bar was a mixed bag. The bartender was overwhelmed, visibly stressed, and initially avoided eye contact. That said, he eventually recovered and acknowledged my second drink request, which I appreciated. Isabella, a cool and friendly staff member, took my order and seemed to be doing her best to keep things running smoothly.\n\nI really wanted to like PB Brasserie—it’s a big, inviting space in my neighborhood, and I came in with high hopes. My bill was over $70. I was disappointed this time."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJajRlTlVnEAE",
            "text": "Chenet is  very delightful and knows her craft. Keep her. We will ask for her every time we’re at PB Brasserie. She’s very intuitive and personable. TOP notch .we met  Chef Cisse who despite his success , is highly humble and shook our hands ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYOGVfOUt3EAE",
            "text": "This place is simply amazing,  the drinks were all delicious and well balanced.  The food was tasty and well portioned.\n\nThe atmosphere was simply stunning. I give this place 5 🌟 because they deserve it.\n\nWe had Joann as our server, she was very knowledgeable and made some great recommendations that were spot on."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oU09IWTBObWwxUlRCUVlqbG1VVUozTkVSa1dGRRAB",
            "text": "Cisse you did it again! We were greeted by Scheck (fave from Ponty). The place is BEAUTIFUL!!!! Went for my birthday dinner on Sunday and there were 4 other birthday celebrations, yet it wasn't crowded. Chenet was our server and was amazing and attentive. Her recommendations were spot on and delicious. Everything was delicious. May go back this evening for Happy Hour. This is the new spot. Sorry it took so long for me to get in here. Date night, girls night, solo date night.... Go, Just Go!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twckxVWnROVlIxYURneFIyMWFkbEZ2WkcxZk5FRRAB",
            "text": "Ambience and service deserves 4-5 ⭐. However, I think the food is ok. I've heard their food was salty but decide it give it a try myself. Unfortunately I had the same experience. My Seabass was soooo salty I couldn't eat all of it.  My friends ordered her filet mignon Medium rare and received it Medium well- Well. Will I return? Ummm idk."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJakktUGpBRRAB",
            "text": "Stop in for happy hour. Great prices! Had lamp chops with an onion/garlic confit and fingerling potatoes  and also had 1/2 dozen oysters. Very fresh and cold! Che the bartender created a beautiful pb fruit punch cocktail with a punch of tequila. They also had a very friendly photographer named Gregory who took a photo for my first time memory. Will be back !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQajI1ZmVTczVXTnVnRRAB",
            "text": "Chenet & Danny made my birthday dinner AMAZING !!!CAME IN LATE THINKING I wasn’t going to get served BUT BABYYYYYY that wasn’t the case!!!! As soon as I walked in the hospitality was AMAZING and warm welcoming. When I got seated  chenet said tonight we have a strawberry Don Julio  lemon drop , I just knew IT WAS GOING TO BE AMAZING! I ordered the salmon with potatoes and Brussel sprouts with this amazing SAUCE by far the best salmon I ever had. Did I mention it felt like I had the whole restaurant to myself ????? 10/10 would recommend and I’m definitely coming back! Thank you for your services. And DANNY!!!! Keep making those drinks PLEASE."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnX3ZqaGdnRRAB",
            "text": "PB Steakhouse is a must-visit! The French-African fusion is unreal—the steak was cooked perfectly, and the flavors were on point. The atmosphere is cozy, and the service was top-notch. Definitely coming back! Oh LAWD"
        }
    ],
    "reviews_count": 83
}