{
    "name": "The Handpulled Noodle | Central Harlem",
    "place_id": "ChIJ7UPihKr3wokRg3ddiecrdXQ",
    "grid": "MN10",
    "address": "370 Malcolm X Blvd, New York, NY 10027, USA",
    "rating": 4.5,
    "user_ratings_total": 824,
    "phone_number": "(646) 850-0208",
    "reviews": [
        {
            "date": "14시간 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoTVIxOUpNelpuWkRsdk1FNURNWFJEY1VWVGNYYxAB",
            "text": "My coworker and I were pretty excited to check it out, but it was a big disappointment. The cashiers are extremely friendly & do a great job with hospitality. However the food was a big disappointment. It was so much cilantro, green onions in my wonton soup it was overpowering the whole thing. I would say the shrimp wonton were seasoned & that was the only thing. The wings had no flavor at all, it was just dipped in sweet chili sauce.\nMy coworker got the scallion pancake & it taste like straight dough, it wasn’t fried all the way through. And her broth was overpowered by mushrooms.\nI would just saw we tried it & it’s just not for us."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZNFgwTkRWa2wzVTJRMlpHNXJTa1ZUUW1kTWMwRRAB",
            "text": "I ordered the traditional stir fry sweet potato noodle. When the lady came with the food I realized they gave me a very small portion.i have been a customer since covid so i know what i am supposed to receive.i told her that this is not what I paid for, she ignored me and started cleaning the space.when I asked if there is no manager around ,she called another lady there and started speaking Spanish about me assuming that i didnt speak the language. but I understood everything that they were saying.i was standing there for more than 5 mn until I finally asked for my money back.very unprofessional, very rude,I will never go there ever again."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMVdGWm1YMGRJU1ZOSU1tVkplWEY1VG1FdFlXYxAB",
            "text": "NOT vegan friendly. Order is frequently wrong, wouldn’t recommend."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMlNHNTBMV1IwY1RkRFVuQlNNakV3TjB4bGMyYxAB",
            "text": "Best noodles and wontons ever! Ivette was so helpful and kind while helping me order. There are too many good options!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poZlJWTm5aSFppYVRkR1ZVMVJRbEZ2TjJkeFQzYxAB",
            "text": "Listen; It does not take much to be a clean establishment; but it does take a lot of have a damn bug in a dumpling.\n\nI was so damn shocked I almost threw up but remembered I paid over twenty bucks for this damn food.\n\nShame shame shame.\n\nHand pulled insects should be ya’ll new name."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRM1FVMTFjRFJuUmtwRlh6VnZiamRFTFdSUk0xRRAB",
            "text": "So so good. Noodles were incredible and the broccoli was incredible. Yvette was so lovely!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FMlEzcEdMV2RaV1hWR2RVcEhURVoxU0dkdmNYYxAB",
            "text": "My go to spot for noodles on a rainy day!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KUk9EZHBSR1JJUlVsaWVETTRjMUpuYm5CU05XYxAB",
            "text": "I have had these noodles a couple of times. I love the taste and thr combinations that is offered.  Personally put more of the chili spice in my noodles ! Can't find handpulled noodles to often in Harlem."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMVgwSm9hM2xVVldsTFJIZGZTMGxZTnprNVNGRRAB",
            "text": "Beautiful establishment"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213NE5IQjJWR2hEVGs0d1UxSnJYM1phUnpSbVIwRRAB",
            "text": "Great place. Good food."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTVFsUmxRa2hCZWtkcWVrNW5abTlQWWxwT1JsRRAB",
            "text": "Favorite place in the area. Top tier quality and consistency. Friendly staff."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWUVdtWXdVRTVVTnpWamJVcDNjVzAwYXpaQlduYxAB",
            "text": "Great meal … fantastic food affordable"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWck9FdDRTV2sxU21sbU1tMXBRbmhFWW1kMk9GRRAB",
            "text": "Hands down one of the best spots in Harlem. The Handpulled Noodle never misses — the noodles are fresh, chewy, and made right in front of you. Every bowl feels like a warm hug with serious flavor and spice that hits just right.\n\nThe lamb cumin noodles? Unreal. Portions are generous, prices are fair, and the staff keeps things moving with great energy. Whether you dine in or take it to go, it’s always hot, flavorful, and made with care.\n\nThis place is a true Harlem gem — comfort food, culture, and craft all in one bowl. 10/10 recommend."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOcFdrOXhkMVoxTXpoclJYbHRWMjR5WDNkcGJIYxAB",
            "text": "I have both dined in and gotten take out and this place always delivers! Great food, amazing flavors and options for noodle lovers. This is the perfect spot for a warm meal on a chili night and very filling! Will always come here when I have a noodle craving"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZeVdHMUxkamg0VTNoNVRGZE5aRmxaV0ZSS1FtYxAB",
            "text": "Love the hand pulled noodle! Great service and yummmmy noods"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWGNERmxkbkV6UTJaaGNXRktXRFZvY1hGek0wRRAB",
            "text": "First time here and excited to try the hand pulled noodles! Had the rice noodle with scallion & ginger, it was very tasty and a generous portion, large enough to share with my daughter. Look forward to trying something else next time!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWUWFIVkhORGQxUkhGZlVqSlBWMkZqVWtGVFRGRRAB",
            "text": "Came in with my mom on a chilly day. The seating is minimal but perfect for a quick bowl of noodles. The flavors are so soothing and addictive. The best part is when you get to the bottom and all the ingredients have been soaking into the broth. The noodles never get mushy though. I will absolutely be coming back. Especially since there’s gluten free options and I don’t have to worry about dairy. We got the ginger and scallion rice noodles with beef. Want to try the curry next!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OMmNHRTRURGRNUlhsRFIxaGZlVlZmVDNFdGIzYxAB",
            "text": "Greeted with a smile and polite service throughout. The food was great, a nice portion and flavorful."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ocldqSlRRVlIwT1d0R1dFWXdjRFppU0ZCaVMwRRAB",
            "text": "Food looks good, nice clean place, good staff"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwRFVsOUpZVGhsYVdWc09YTnNlVjk1V0VJMVVXYxAB",
            "text": "Brought my staff here 10 of us for dinner. Online Says they close at 11 but they actually close 10pm. Got here 10:16 and the cashier is telling me they’re closed."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnNGJYUXRWemc0ZGxwcldUTnBlVFEzT1VVeVQxRRAB",
            "text": "Their teas are absolutely delicious and the seitan is good."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nMVVHeFZkMlZqZEZOYVprdGljSEF6VUVwa2RtYxAB",
            "text": "Yummy noodles"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZMk9FNUhZbEUzUVZvNVJFTmFXVkpmZW5CNlZXYxAB",
            "text": "One of my favorite restaurants in the neighborhood! Food and is service is all great"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xU2FVOVlhRGM1VkRCYWJUQjZOalJKVjAxR05rRRAB",
            "text": "My daughter and I love this place order here the most."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxcmRVcFlXV3BhUmsxbVIzQllPRFppZUhwTk1rRRAB",
            "text": "Food is great!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWU5uaGFUMnhPTmxrek1HNWhRWG94VmtGcWVVRRAB",
            "text": "This was my first and last time ordering from this location. I didn't take pictures and wish I did because I was cheated out of my money and food. When i returned to work and looked I received a half box of noodles and when I inquired I was told it was the chef. So there is no standard of how the food is proportioned or packaged.\n\nThe young lady was very nice. I am going back for my other half. What I did received was good but to much celery. I spent $18 plus gave a tip. I am returning for my other half.😤"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pka2FqSTROMGgzYWxvd1FsVnRlWFpwYVZnM05uYxAB",
            "text": "My favourite noodles by far, always fresh and delicious. I get excited when I get to be uptown and get them"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWUFVFZHlkV0pmWVRkemFGRkxka3hGYzJaVExYYxAB",
            "text": "Great food every time my favorites are the scallion ginger and curry stir fry"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pob00wUnJhRmxqYW1wU1lXeG5lRTkzYXpKWWVuYxAB",
            "text": "I gave this spot 2 tries but their food isn't as fresh as I would have hoped and it had a weird taste to it. The noodles were overcooked and not a lot of flavor except for whatever I added to it meaning hot sauce. Customer service isn't friendly and theyre a little slow. I'd find another spot for noodles and they're a bit overpriced."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnM1JYQnlhREpGUlc4eGJEWk9kWHBITUc4MlVsRRAB",
            "text": "Worst beef soup noodles ever. The lagman noodles were undercooked, thick and chewy. The broth was SO spicy it was inedible. My lips were burning and eyes watering and I got the low spice level so I can’t even imagine what the extra spicy is like. Go elsewhere!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5UVNISldla1JPVTJWMVNGbENjakZaWmpRd1ZtYxAB",
            "text": "They consistently get my order wrong and they have now started reducing the size of their meal and just recently I received my food much less than normal, which is frustrating when it cost $17 please stop shorting your customers. The photo I have attached has not been eaten from at all. It’s less than half of their new packaging and buyer beware"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSTWJqUXpOR3RrV1VOaFVWbFFhVFpzU1hwRVZYYxAB",
            "text": "Beware of the steamed pork and chive dumplings, mine arrived raw in the middle. I called the store and they asked for photos which I provided. They proceeded to try to tell me it looked like this because of the soy sauce. What?! 🤯\nYou be the judge- I'm including the picture in my review.\nThey stopped responding to me and didn't refund me. A very dumb way to lose a customer."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCck1XNUVSVUpIY0hkVVRXdExkMDB3Y2pWVWRuYxAB",
            "text": "The rice was very dry and hard. Tasted different like plastic taste. Like FAKE RICE they are selling here. The worse rice I ever eatin."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205elZFeDVWMXBUWnpoVFlVOUJObWhDZVdwelYwRRAB",
            "text": "The food was amazing"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGU1ZraEVSVmw1WTIxT1RqVmZlVlV6VHprd2FWRRAB",
            "text": "Ordered trad stir fry pork noodles, lagman (hand pulled) style extra spicy. Taste of sauce was quite good and very spicy as promised, but they really skimped on the pork and vegetables, and the noodles were too chewy and thick, not springy or fresh. This isn’t an issue due to the noodles sitting while being delivered. They were just hunks of flour and because they were so thick, the inner park of the noodle was hard and just flour. I’d go elsewhere."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MVdXcGtXRkk1YkhGRldHaE9VWEk0YURkNFpHYxAB",
            "text": "The staff are so incredibly kind here, every time! Our favourite spot for takeout and the food is delicious!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKMmQzUlVkelZIT1hsT04xUjVkM0JDU1RaUlJWRRAB",
            "text": "Very great service . Food is extremely fresh and hospitality is always amazing ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoU05VeFZTbEZ3UlVrNWMyeGtiMmRRZWxsT05FRRAB",
            "text": "I ordered pulled noodle with beef terrible the noodles hard I also ordered fry chicken wings terrible wing' was undercook"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205R09FdE5iRXBsUlhSS2IxQmZlbWg2YjJ3NWNFRRAB",
            "text": "Livid ordering from this location\nOrder put in at 9:30pm on a Friday night through Uber Eats. ETA was 10:20pm-10:40pm.\nAt 10pm update from restaurant that the order was ready and being sent my way through their in house delivery drivers.\nKitchen closes at 10:30pm, was calling the restaurant since 10:20pm, crickets. No answers. Restaurant closes at 11, by then I decided to take the L. Why did yall say the order was on my way?? By the time I got my refund everything else around me was closed. Will never be ordering from here again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsdVpVMHhTblU0ZEV4MFMxVnNjUzFKVFhkM1QyYxAB",
            "text": "The food is consistently delicious! HIGHLY recommend if you’re looking for a quick bite in the neighborhood!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sdFdFWkZXRjgxU0RsUk5Fc3dTalJXU2tSeGFVRRAB",
            "text": "Great noodles and great broth!!!\nNice and spicy too 😆"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poYWJVSjVWREpvZEd0MWR6Vm1jekJFZUhsMVNYYxAB",
            "text": "Always good quality noodles with a good amount of vegan options. Fresh noodles with flavourful spicy sauce or veg broth that satisfied picky eaters like my bf. However, scallion pancake was too dried and had barely any scallion inside but instead on the side which was quiet weird."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205dGFXc3dSMjVDV1d0TVMyZ3pWbkp1VTJOSVVYYxAB",
            "text": "Great noodles and the broths were so flavorful. Our kids loved the shrimp wonton and the beef bao because the flavors were mild but still delicious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0emNtVkZRVXBTYURCa04yRnJXVVYwT1hoa1gzYxAB",
            "text": "I checked out the menu outside and got shrimp wontons in beef broth and a cucumber salad side. Wontons + broth - fine. Not spectacular, but fine. The cucumber salad on the menu outside and the menu inside said $6. When the lady was ringing me up, it said $7. She consulted with the cook in the back and said the menus didn’t update and “is that fine?” And I said it’s fine because I don’t know why, lol. It’s actually not fine, but whatever. But then I get home to eat it and my cucumbers are mixed in with something I don’t even know that are not cucumbers. So I looked at my receipt to see if there was a mistake and it said “cucumber and woodear salad”. The menu didn’t say woodear??? What if I was allergic????? The cucumbers were just dressed in minced garlic basically. It was just a lot of little things. ):"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4dldEaExVV0pSWWw5MWVtbzRUMmh2Wldoa01FRRAB",
            "text": "Always solid!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WbGNuZzNhWEJwWkdseFEyMVhVR0p6VEVWdk9IYxAB",
            "text": "This is my favorite noodle shop in the city! Dine in or takeout, it’s all delicious. Everything has such amazing flavor. Scallion pancakes are great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOblQwSTVlREZIUnpJeWJ6WnRYMkZVT1Roek5WRRAB",
            "text": "Amazing vegan broth and dumplings!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paV01qQmpaRVpsZUV0eVdETkxWUzFIUjBkTU1HYxAB",
            "text": "I have to compliment them for using very high quality broth for the cumin soup. I ordered delivery, ate the noodles, and decided to save the broth for some rice. The next day you could see how much gelatin was in there. The wing pieces are counted by whole wings. Very authentic."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbFVqZEtaRXMyZGpWRGRFMTFNRzl5YlhWclVuYxAB",
            "text": "I absolutely love this restaurants amazing food and great customer service ! Definitely give it a try"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNGNFbFBUbFl5UWsxTVUxQTFVMWxDUnkxRU5VRRAB",
            "text": "First time ordering and got the beef soup and I guess they forgot the soup part because there was zero liquid"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVFpWaHhNR1pJUlZkV2NEWmxUSEpsY21KNGRVRRAB",
            "text": "I’ve been walking past this restaurant for years. They opened right before COVID, and honestly, I’m not a big fan of noodles—but a friend told me they had the best chicken wings. So, I decided to give it a try.\n\nFrom the moment I walked in, the young lady who introduced me to the menu and took my order was amazing. She made some great suggestions and provided excellent service.\n\nFor my first visit, I ordered the lemon pepper curry chicken wings and a noodle dish with ginger and scallions (or something similar—I’m not completely sure). The chicken wings were incredible—crispy, fresh, flavorful. I was genuinely excited because it's rare to find good wings these days.\n\nUnfortunately, I didn’t enjoy the noodles as much. They were doughy and extremely salty. I spent around $34–$35 on that meal.\n\nThe wings were so good that I went back the next day and asked my son if he wanted some too. He placed his own order, and I got more wings: Thai chili and lemon pepper curry again. This time, though, the Thai chili wings were not the same as before—they weren’t spicy and just didn’t taste the same. The lemon pepper curry wings were overcooked, and some were red or pink inside. I was very disappointed.\n\nStill chasing that great first experience, I returned the next day, going around the same time as my original visit. Unfortunately, this time they messed up my order—not once, not twice, but three times. I had to walk back and forth to the restaurant three times just to get my order corrected. When I finally sat down to eat, I was completely let down. The chicken wings were not edible. They were overcooked and some were still pink or red inside. I ended up throwing most of them away.\n\nWhat really frustrated me was when they gave me only three wings and insisted I had ordered that, even though the menu clearly states you can only order 4, 6, or 12 wings. I wasn’t lying, and I felt completely dismissed.\n\nAfter three visits and over $90 spent in total, I’ve decided I will not be returning. My first experience was amazing, but the inconsistency and lack of quality in the following visits were unacceptable.\n\nTo be fair, the service from the young lady at the front was great—I'd give four stars for her alone. But the kitchen was not up to par. It seemed like there was a language barrier, and while I understand some Spanish, the tone and language being used didn’t come off as polite.\n\nYou can look at the video in my reviews yourself to see exactly what I received.\n\nThis was my honest experience. You can try it for yourself, but I personally won’t be visiting this location again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25scWJqRm5NSEJMUmpFeVNVVnpRa1ZST0hwbU0wRRAB",
            "text": "I really wanted to try this restaurant for a while, but I can’t say it met my expectations (unfortunately). Noodles are so stale and hard. Save your money and go to Chinatown instead. I asked for mild/no spice yet they added so much chili oil in my noodles that it was not even edible. You can tell the noodles aren’t fresh at all. Disappointed but the beef was tasty"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLUGdnNmlIMzZxVDJ3RRAB",
            "text": "SHOP WITH CAUTION!!!\n\nSo today I ordered The Trad. stir fry chicken ribbon hand pulled noodles with spring rolls and the dry rub wings  through uber rates. While the food was quite spicy and the chicken wings very disappointing, I was enjoying the noodles and spring rolls until I found a hair in my noodles. To clarify, I have coiled natural dark brown hair, and the hair I found in my noodles was a straight, jet black strand. Having spent close to $30 on this meal, just to have to throw it all out is really upsetting. I’ll never shop here again.\n\nI don’t know what’s going on with Harlem restaurants, but this is the second time this has happened to me within a week, from two different restaurants (Shake Shack)😩. I reported it on Uber eats, so I’m just waiting for  a response now😓"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiei1hZHlnRRAB",
            "text": "As a Chinese American, I never thought I would taste such authentic Chinese food in New York… but they did not disappoint! I was jaw dropped at how well cooked everything was. The meat was perfect texture that melted on the tongue, the dumplings were juicy, and the bao was soft and savory. This is true Chinese soul food. Plus, the service was so friendly and caring! The atmosphere is small but comfy and cute. Definitely coming back soon."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcU5idU5BEAE",
            "text": "Food was honestly so nasty. I was truly shocked because so many of the reviews raved about the food, but got back to my office and seen this. I ordered the chicken ginger noodles with thick udon style noodles. Chicken was thick cut rotisserie style and DRY. Not sure what type of noodles they used. They tasted like pretzel dough which was interesting. Lots of cilantro and scallions. Nice friendly staff. Clean shop, but food just wasn’t it😕"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdmFERmxNemhJYkdGRGRWODNaalJvTms5Tk5sRRAB",
            "text": "Omg. This was soooooo delicious 😋.  The order took a while for it to me made, but was well worth it.  And everything else I've ever ordered here, I have enjoyed immensely.   Thank you for the experiences."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2NDhXUmtRRRAB",
            "text": "The food was absolutely amazing. We ordered 5 different plates and loved everything. The plates were all fresh & herbaceous with the perfect amount of spice. Daniel was very friendly and explained the dishes to us!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyaU56dmlBRRAB",
            "text": "The best hand pulled noodles in the city full stop. Legitimately better than 90% fair you would find in Asia. If you are a fan of spice and noodles this is a must visit and worth the trip to Harlem. Everything is worth trying. Even the…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdVB1dXNnRRAB",
            "text": "So i seen my coworkers eating from here so i decided to try them . Walking in you'll surprised its a small space . Not really  any room for dining in.\nI ordered the chicken shiitake dumplings. The dumplings  were ok 7out 10 (the sauce was nasty not gonna lie) had to use my own sauce . I also had the Dapan Niu noodles (they were a bit spicy ) over all i probably wont go back but i posted the menu and some photos. For you guys to see"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQOVBXWXNnRRAB",
            "text": "More authentic than asian countries themselves. Best ribbon noodles in town, and actually spicy too. Do not let the food thumbnails throw you off the portions are huge!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcDk2U3l3RRAB",
            "text": "Ate the following items - all with medium spice:\nTraditional Stir Fry with #1 noodles\nTraditional Stir Fry with rice\nCumin Stir Fry with rice\nCurry Stir Fry with #2 noodles\nCumin Soup with #2 noodles\nBeijing Bolo with #1 noodles\nDapan Zhu with ribbon noodles\n\nI enjoyed everything except the Beijing Bolo. Personally I found it to be lacking in flavor, it was very mildly sweet.\n\nI also personally did not enjoy the cumin soup mainly because I have to cook the soup in my own pot. The broth and noodles are packaged separately and I am too lazy to cook so I just poured them into a bowl and started eating and the noodles were stiff. The price for my laziness 😭\n\nMy favorite is the Dapan Zhu. It's almost like a soup seeing how much thick sauce comes with it. The ribbon noodles are so big and perfect for capturing the spicy and flavorful sauce. It came with big bell peppers that were marinated in the sauce and cooked to softness, so delicious to eat. The pork was like a big slice of pork belly, cooked so tender with meat and fat falling apart.\nI wonder how it would be with rice? 🤔"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbk9hTzVRRRAB",
            "text": "This place is really uncomfortable as far as the seating goes and  I found the staff's behavior to be crass. I did like the dumplings but it's definitely not worth going back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPYTFpYWJ5b3BqMHpnRRAB",
            "text": "My go-to takeout place for noodles after work. They are relatively quick and have consistent quality food - though the medium spice varies tremendously. Delicious noodles, wings, tea, and other street food they offer, can’t go wrong.\n\nVery friendly and understanding staff, highly recommended eating in as well, though I personally only get takeout weekly."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlaXZ1M21nRRAB",
            "text": "Actually, it was very disappointing. Not what I thought it would be after reading the reviews, and I was totally looking forward to it. I got 2 dishes ($40)  and neither one satisfied us . The dapan zhu had flavor but lacked in meat as it was all fatty pieces. The cumin soup is just a pass. Should’ve just went for stir fry dishes maybe would’ve been better."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPNnV5SmtRRRAB",
            "text": "We shared scallion ginger pork with ribbon hand-pulled noodles (medium spice level), spicy cumin lab with #2 extra thick noodles (medium spice level), shrimp wontons in herbal broth (low spice level), and lyche pekoe black tea. All delicious. Thick noodles satisfyingly chewy, ribbon noodles satisfyingly flavorful. The tea semi-sweet and refreshing. The wontons delicious.\n\"Medium\" spicy level is higher than what many places call \"spicy.\"\nMy only criticism would be that the noodle dishes are served in tall plastic containers, which made them a little difficult to eat out. Still, no hesitation recommending this place and rating them 5 stars."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENC1hMHhBRRAB",
            "text": "I got delivery and it was so quick, and I can’t believe how good it is. The dumpling wrappers are so fresh and the perfect thickness, are cooked perfectly. Lots of juicy flavorful pork inside. The broth is incredible, and so complex and flavorful, spicy tangy and rich. Delicious fresh scallions and cilantro. The scallion pancakes are perfectly crisp. Can’t wait to try more of the menu."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDaGF6ZUZ3EAE",
            "text": "So excited to have The Noodle in our neighborhood just a couple of blocks from us! We’ve ordered from The Handpulled Noodle before and loved realizing that this is their sister spot. Ordered for pick up and everything was great. Took one…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMUk2akd3EAE",
            "text": "Upon entry, the climate was cool and pleasant on this hot muggy day. I browsed over the menu and realized that they have an assortment of handmade noodles. I chose the Shrimp Wontons and the Bro Sliders. I noticed that they have an \"A\" rating in the window. That is always a plus. There are no tables to sit at. However, you can pull up a barstool to the countertop and dine there. The food came and it was wonderful. I will submit a video along with this review. Those \"Bro Sliders\" with the stewed pork and dusted with cilantro were amazingly flavorful. And the Shrimp Wontons with the veggie broth, scallions, mild pepper, and bok choy was perfectly put together ❤️\n\nI recommend this place for a quick bite to eat and in-home delivery choice."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5MS1yZUdREAE",
            "text": "This place is great! I picked up some Traditional ribbon noodles with lamb and a cup of black mango tea. I’ll definitely be coming back here! If you order on their website, you get 10% off your first order!\n\nI ordered the traditional ribbon noodles because I was eating them right away, otherwise you should get the thinner ones.\n\nThey were thick and chewy, and the sauce clung to them well. Mild spicy was comfortable for me, but I definitely had to take a break twice for a sip of tea.\n\nLamb was cut into bite sized nuggets that I scooped up with saucy vegetables (bell pepper, garlic, celery, cilantro, and more).\n\nThe tea was refreshing and not too sweet. I liked it, but the noodles were definitely the star of the show."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBd29UOFpREAE",
            "text": "Unassuming restaurant in Harlem serving up solid flavors! Highly recommend getting the bao sliders FRIED. Love the twist on your typical baos. Spice isn’t weak so if you’re not confident in your tolerance, keep it low."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2eE1UMHpRRRAB",
            "text": "The Noodle is where to order from if you want warm fresh, vegetable an herb filled comfort food that  will leave you satisfied without breaking the bank.\n\n+ Delicious, fresh noodles!\nThey consistently have delicious food-- the dumplings, stir fry, soup, and scallion pancakes are great. They have mild to spicy-- definitely\nspicy is the best. Wouldn't recommend their salads.\n\n+yummy scallion pancakes and dumplings\nCan't go wrong with any you choose Love the tasty sauces served with each one as well.\n(we always order extra beef and cilantro to warm in the airfryer leftover)\n\n+ Lychee pekoe tea is DELICIOUS AND REFRESHING\n(mango is also tasty too) not too sweet, just perfect\n\nA small place with limited seating, but they'll wrap soup and noodles separate for to go, and there is seating across the way on the median or the park. Takes credit cards, earn rewards (rocket bucks) if you order from their website directly\n\nFood always arrives hot and fresh, and drinks are always cold and refreshing!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2eG9MYTR3RRAB",
            "text": "Best spot in Harlem, I’ve been coming to these guys since they opened! One guy that stands out to me is Rodrigo, his skills in the kitchen are top notch serving up great quality food every time I come through. He keeps me coming back and is always a pleasure to talk to. I recommend you come in and enjoy the food but also if you get the chance speak to the head chef Rodrigo !"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHc3F2VWFREAE",
            "text": "Although I contacted them directly via email to tell them about the state of the food which cost $44, nobody bothered to answer a week later! I will never buy it again! Noodles had no sauce, stuck together! Dumplings were charred, not…"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbzUyWnZ3RRAB",
            "text": "great place to eat! food was well seasoned and aromatic as well. limited seating, so might have to find a quick spot to enjoy the food. I had the vegetable wontons in chicken broth with medium spice. the spice level was perfect and the cilantro added an extra level of flavor."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMlUyUnFaME5CTkVadlJISkxSV2hDV1haT1IxRRAB",
            "text": "Always ordering from this place -- my favorite and the dumplings always hit the spot. Everything is super delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKakxuTHpRRRAB",
            "text": "Portions are American sized so bring a friend and order only one noodle dish. See the picture below for an idea of the portion size. The cost of noodles, 2 bao sliders, and peach tea (22oz) was about $33 including 20% tip. It's pretty costly but the food was delicious. We ordered the bao sliders with lamb filling, cilantro, and some hot chili oil. The sliders were very flavorful and the noodles were definitely delicious. This place is one of the rare noodle places in Central Harlem so if you're in the area and craving noodles, they've got you covered. The place is pretty busy with deliveries so you know it's good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvNFpEUTFhV05UUzJWRVVsRkNlVk50TFVseFoxRRAB",
            "text": "Had the daipan niu - big fat hand pulled ribbon noodles, chunks of beef, and bell pepper in a spicy gravy - and the wood ear mushroom and cucumber salad. So tasty! Small but cozy interior, and everything comes out in takeout containers."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKLWVUeXVRRRAB",
            "text": "The soup and traditional noodles were amazing! The scallion pancakes were meh trader joes has better. The fried dumplings were also meh"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCNjQ2UGN3EAE",
            "text": "The Noodle has great hand pulled noodles. The dishes are authentic. The noodles were just a tiny bit too doughy for my liking, but Id definitely go back. The iced lychee team was my favorite."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJdUNvZFdYMWFLNml3RRAB",
            "text": "Pedimos comida para llevar. Nos la trajeron Muy rápido. Muy rica y abundante y además opciones sin gluten. Bien de precio."
        }
    ],
    "reviews_count": 80
}