{
    "name": "Harlem Bar-B-Q",
    "place_id": "ChIJvR6EA232wokR6E4MpK7dcyo",
    "grid": "MN10",
    "address": "2367 Frederick Douglass Blvd, New York, NY 10027, USA",
    "rating": 4,
    "user_ratings_total": 1084,
    "phone_number": "(212) 222-1922",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSaU0weHdhSFExVmpsUlJqZERjaTFWYzJOb1EwRRAB",
            "text": "Came for lunch. Poor service, waiter was on the phone the all time. Clearly overpriced for what it was. Added 15% tips directly on the check."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aS2IwbEliRzVTU2xOSmJEZFlZek5YUm1wclMxRRAB",
            "text": "Looking for a good BBq place to eat and found this spot in Harlem. The service was good and our waitress was very friendly. The food was good and the drinks also. I will return to this place soon."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213d1ZGWlNkRGhSZVVzeGFHWmpTVUY1ZEdWak4yYxAB",
            "text": "Food was good except the macaroni n cheese but the price was decent and the waiter was good as well"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURScFlPRFdnEAE",
            "text": "Their Baked Mac & Cheese, Catfish Bites & Mango Jerk Wings ARE EVERYTHING. Then They Have This Drink Called Monster Y'all 🥴"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210aVNWOXBNRE5FYlZWcmNXbEtWakpxZVVwTVdFRRAB",
            "text": "Nice place"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMQ0RzNF9ReDlEYVZREAE",
            "text": "Suppose I could give this restaurant a negative star I would. The wings I ordered were “grilled mango jerk” I got not well-floured fried wings no taste in a nasty thick mango jerk sauce that had no taste. The Mac & cheese was boiled, pasta and cheese were topped with cheap cheese, and as you can see they did not allow the cheese to melt properly This was the worst mac I have ever had. Also, 3 mini-sized cornbreads were given, but it was dry and lacked flavor. I spent 40 plus dollars, and it wasn't enjoyable at all Everything was disgusting. A waste of money!!!! THE FOOD DIDNT LOOK ANYTHING LIKE THE PICTURES ON THE WEBSITE. 🤮🤮🤮🤮🤮🤮"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kQ1FXYzRVVzQ0Wm5WU2QyeEtRMlZyWlY5aFRrRRAB",
            "text": "Half of order came up wrong waited over 30 min automatic tip in bill 7.00 i didn't know tipped another 5.00 didn't deserve 2.00. if it wasn't for the good taste of food I would have changed back. I won't be going back food is really good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSTmQyazVPSGR4ZEU5M2RsWTNiV0ZNUkZwUE1VRRAB",
            "text": "GOT RATS!!  Had to leave🤮"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kT05EWjBYM1ppVVhwWVpubDJhMVl5UnkxNGNsRRAB",
            "text": "First time here. Came in for a nice lunch/dinner with family that's in town. Found it by googling restaurants near me and after reading up on it I had to try it out.\nThe place is a nice medium sized restaurant with a chill vibe.\nThe staff was friendly and informative in describing items on the menu.\nI started off with a Pina Colada and and order of the Jerk Mango Wings. I'm not very spice tolerant but I was eating the bone clean along with my fingers lol. My sister did the Buffalo Mac & Cheese (didn't try).\nFor our entrées were, the Seaside Combo, The Honey Grilled Salmon, The Chicken & Rib Combo and I had the Brisket & Pulled Pork Combo with Mac & cheese and collard greens.\nThe pulled pork was tender and season really well, even though I only has 2 small pieces of the brisket I can say it was damn good. It was falling off my fork good. Next time I'll get the BBQ sauce on the side because it was a Lil to sweet for me (but that's just me)\nAll in all this was a great spot to try out. I'll be back especially since they do happy hour 7days a week. HECK YEAH!!!!!.\nMy next visit I'm going for the Cajun Royal (if u don't know check it out)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VNU1rbDVUWEpUWXkwNU5tcDVVUzA1YWtGdFUzYxAB",
            "text": "Came here with some friends to have a ladies Sunday.  Our waiter barley spoke  English and acted like we was bothering  when asked questions. His service  was horrible. The food was okay. They charged a lot of money for the brisket. You only get the small pieces of brisket. The Pina colada was actually  very good.  The rum punch tasted like there wasn't any alcohol in it. They charged  a lot for tip for someone who  wasn't  friendly.\nNot happy  at all."
        },
        {
            "date": "5달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOSFlzOHYydHVDMndBRRAB",
            "text": "Service un peu long mais très bon et pas trop cher"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKV29rYUNRNHBMdXhnRRAB",
            "text": "I'll be back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZLWNhSkxBEAE",
            "text": "The wings were good, I asked for buffalo and I got plain but they were good. The meat on the ribs is tough, not very sauce, but the flavor is decent. The Mac and cheese was a 1/10, it was like melted cheese and noodles, no sauce. Coleslaw was very sweet, the potato salad was amazing! Dinosaur bbq is better"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNThPdEhnEAE",
            "text": "Needs new furniture"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveHZLVzJnRRAB",
            "text": "My chicken thighs were RAW. Like y’all open at 12 and I put my order in shortly after. You guys had the time to cook my food throughly. Hopefully I’ll have a better experience next time."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMWRHYlVBEAE",
            "text": "My first time here and the only thing worth coming for is the drinks, The Monster Drink is spot on. Other than that most likely wouldn’t come back for the food. Music was good too"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNWRQVFRBEAE",
            "text": "I’ve had the Harlem burger here in the past and it was good. Comes with a side of fries. This time I had the mango jerk chicken, it was ok. Place is clean and staff is nice. Stop in and give it a try"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJc3JxRGxBRRAB",
            "text": "Good food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJck5XSk5REAE",
            "text": "I went there at 3pm and ordered the chicken and ribs...when i got home the food was old food with just bbq sauce on it. This had me so angry.....the corn was bournt on grill....i will never ever  go there...im home now  trying to redo it....\nI deserve a full refund..this is unacceptable....DO NOT GO HERE"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcWREYjhBRRAB",
            "text": "Great! All above!!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OU1Tc293RRAB",
            "text": "I ordered and paid for a shrimp and ribs combo plate, mango jerked chicken wings and banana pudding. NOT HAPPY! I got shrimp and chicken and NO banana pudding. When I called the store, I got the run around and ended up hanging up. I AM NEVER EATING FROM THIS ESTABLISHMENT AGAIN!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eE5ERzlnRRAB",
            "text": "I used to be a regular customer at this restaurant. I went last night to catch up with a friend. I ordered our drinks and appetizers in advance - with the intent to get an entree later. Our server didn’t interact with us for an hour. We had to flag him down to ask to order wings so at that point I asked for them to go. He brought us the bill before my food came. I noticed the 15% additional charge labeled as “tip”. (Having been before, this hadn’t happened in the many times I’ve been.) I asked for this charge to be removed. The server said ok, and took my card. He did not remove the charge. I initially wanted it removed because I don’t think the service we had warranted the 15% charge. After my card has already been charged he says he can’t remove it - so I ask to speak to a manager. We wait for 10 minutes and a manager never comes. My friend asks a different staff member and suddenly the manager comes. I start to explain to him my initial issue: the service we experienced didn’t justify the automatic surcharge. He cuts me off and asks my friend “would a shot remedy this.” (Which bothered me because I was being cut off and ignored in real time.) I point out that other restaurants have signs and disclaimers in the menu for automatic surcharges. The manager ignores me again to ask my friend what she would like. At that point I mention that it’s my card that’s been charged and that I’d like to be heard. And he keeps asking her what would she like to make this better. The fact that he wouldn’t ask me the same question spoke volumes. She and I loved going to this restaurant because we previously enjoyed the food, environment AND the service. Being ignored while trying to order AND while trying to give feedback, I was also cutoff multiple times. This left a negative taste for both of us. Neither of us plan to come back or recommend this to our friends. It’s upsetting me and my homegirl - cause now we have to find a new spot."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MXNqYW53RRAB",
            "text": "We had a family birthday party there. The food was amazing. The service was stellar and the family had an amazing time!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3a0pDam9nRRAB",
            "text": "This place was decent and passable BBQ and if I was in the area I would go back. However, it is not on the level overall quality wise with my favorite BBQ spots in the city, Hometown and Pig Beach.\n\nHowever, the pulled pork was good, the mango jerk wings were very tasty and the cornbread was some of the best I ever had.\n\nLike I said if I'm in the area and in the mood for BBQ I will be back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNXZfeENREAE",
            "text": "The wings had no seasoning, the Mac and cheese was not cheesy or seasoned however the greens were good. Please fix this"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReHNxTlV3EAE",
            "text": "Food was great price was right"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBLXFXV01nEAE",
            "text": "Lovely spot for a good time in harlem."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfal9HNHhBRRAB",
            "text": "Been coming here for years one of the best places to chill , drink, eat Great vibe"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmd2NyejRnRRAB",
            "text": "The food overall was good, but there were a few areas for improvement. I ordered the BBQ ribs, which were flavorful, but the seasoning wasn’t evenly distributed, leaving some parts less enjoyable than others. On the bright side, the sides were absolutely amazing—well-prepared and full of flavor. My husband ordered the Nashville Chicken Sandwich, which he enjoyed, but the slice of Kraft cheese felt like an odd choice for what could have been a more elevated dish.\n\nThe drinks also left something to be desired. I ordered a mule, but the ginger beer was flat, lacking that essential carbonation that makes the drink refreshing.\n\nOn the plus side, the music was fantastic, and the environment was incredibly welcoming. It created a great atmosphere that made the dining experience enjoyable, even with the minor hiccups.\n\nService-wise, the server was polite but could have been a little more attentive. While we didn’t feel ignored, there were moments when we needed something and couldn’t easily get their attention.\n\nDespite these small issues, the food and ambiance show promise. With a few tweaks, this could become a favorite spot. I’d definitely consider giving it another try!"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmb3ViMDlRRRAB",
            "text": "De lo mejor en Harlem  muy buen precio y exelente comida"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmeFlqZWFnEAE",
            "text": "OK to start off this review I’m a be honest here. The food was not great, but it had some decent selections on the menu. I recommend you getting the “ultimate combo” The shrimp is really good specifically the fried shrimp. Sweet potato salad is not that good. It was bland. You really didn’t taste the taste. If you know what I mean fries are actually pretty decent. I had no complaints about the fries. The cornbread on the other hand did not exceed expectations. The cornbread didn’t really taste like cornbread if you know what I Mean. The sprite really tasted like water and the cup sizes for the water are not that big. They only have two dessert options and I’ll tell you right now. I did not order those two options. It was gonna taste bad. The tables do not fit males for a group of five. The table sizes are really small. The service is decent. He comes like every 20 minutes to make sure you’re doing all right. He refills your water for you stuff like that do not sit in the back!! There is no lighting back here and I couldn’t even read the menu. I had to pull out the phone and use my flashlight for the menu. That’s all don’t really recommend this place if you’re not from here have a nice day."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmblBLYkh3EAE",
            "text": "Careful eating here… unless you like food poisoning!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2M19HQk9REAE",
            "text": "After spending $300 on a friend's birthday the staff tried to kick us out of the restaurant after a few hours."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQbllPQlVREAE",
            "text": "Great food. Great service."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQdzdQbHRnRRAB",
            "text": "I enjoy the mango jerk wings and the fried chicken wings w the bone in. The corn bread is delicious when hot. Good eats on Friday evening."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQNWNlc0lnEAE",
            "text": "It was my first time there,  my coworker and I had a great time, and the food was delicious 😋."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzanV5YWlRRRAB",
            "text": "The food was just decent and so was the service really unremarkable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzaFBITEhREAE",
            "text": "I love the frozen drink mac and cheese Ribs was good but the service wasn't you had to look for the person so you can get a glass of water 🙃 the decor was GOOD THEY UPGRADED 😁"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbHB5dXpBRRAB",
            "text": "This was my first time eating takeout from Harlem barbecue I had the rib shrimp combination the ribs were so tender add moist with a very decent size portion and I was pleasantly surprised with the shrimp the mango wings where well proportioned and tasty the coleslaw was okay the mac and cheese was perfect and super cheesy like a good mac and cheese should be now the only problem I had is with the cornbread not as soft as it could be and a little too dry please work on your cornbread people now as far as the drinks I don't know I assume that they are good from the ladies at the bar engaging in drinking so early in the afternoon since I had takeout I can't make a decision on customer service and atmosphere even though from my observation of the environment it looks a little small but as far as the food I definitely recommend you do a sit down and try it out good stuff and thank you to the beautiful young lady behind the bar that took my order and brought me my food😍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMjU3V1dBEAE",
            "text": "Mac and cheese 🧀 😊❤️💙🌹💛♥️♥️💖👍🏿🙏…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNDRTd21RRRAB",
            "text": "Cool vibe! Wings was awesome!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdzd1T2ZREAE",
            "text": "Every couple of months I come to harlem bbq for wings and henny colada. It’s always a vibe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdHM2X3h3RRAB",
            "text": "Food was warm and well seasoned and drinks was pretty strong I only had 1 !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIanZpaExnEAE",
            "text": "Came here after work with my coworkers and was pleasantly surprised! I'm very picky in terms of the quality of food and this food came out hot and FRESH! I had the seafood combo with fries and collard greens and a Henny colada. The food was amazing my drink was tasty and strong ( I'm a bartender so I know a good drink when get one) . Very friendly and attentive staff, perfectly seasoned food. For sure coming back, y'all got it!!! 🙌🏽🙌🏽🙌🏽🙌🏽"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIb3EtU2hRRRAB",
            "text": "Yo when I tell You….\nMy Food & Drinks were too good to be true. Everything was so good, I don’t even remember My Order. My drink was Filled flawlessly!\n🔟🔟🔟🔟🔟🔟🔟🤌🏾🔟🔟🔟🔟🔟🔟🔟"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3cUltdXhBRRAB",
            "text": "Seriously good good food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3OHZYSWZ3EAE",
            "text": "The food was excellent the sever was attentive. The owner or manager also came by to greet us. The atmosphere was great.i will definitely be going back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiOV9pVlFREAE",
            "text": "Amazing food and atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNid09EVk5BEAE",
            "text": "Food was not great and I doubt I’ll ever be back.  The shrimp, collard greens and macaroni and cheese was great. The rum punch was great. Now about them ribs. Ribs are very tender but that sauce taste like Kraft BBQ that has something added to it to make it sweeter but was trash.  The honey fried chicken was trash. The  homemade coleslaw was trash and taste like the bucket kind with a little more sugar. The potato salad was ok but would not recommend.  The mixed vegetables was great I rather eat that over the chicken. So many people hyped this spot up and I gave it a try but not for me.  I didn’t finish anything on my plate to be honest and been ready to go anyone who knows me know I like to eat I’m a foodie but this is not a go to spot unless nothing else you really want to eat ain’t open but even then I’ll get six wings and fires from Kennedy chicken spot.  Price was not bad but they need a lot of work to call it a soul food spot. Thank you but no and no I don’t want a refund just do better."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROeWU2aXN3RRAB",
            "text": "The renovated bar boasts a fresh atmosphere with its updated location. The new menu adds a delightful touch, offering a diverse range of options to cater to different tastes. Overall, a positive transformation for those seeking a revamped experience. Young and old crowd.. few new staff as well !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6bGJpdVZnEAE",
            "text": "Ribs and honey fried chicken were delicious. Corn bread was good, but 1/3 the serving it used to be. The brisket was very fatty. The mac and cheese was not as good as it used to be! They changed the recipe and should change it back! I was charged full price, instead of the happy hour discount price for the Henny colada! And it was very weak. The ribs was the only reason why I'd ever return!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNjZXbDRRRRAB",
            "text": "Authentic comfort food place in the Harlem community.\nI ordered the fried catfish and shrimp with fries and mixed vegetables. It comes with cornbread also. The batter was very well done and tasty for both fish and shrimp. The shrimp were pretty large and there was about 6 of them on the plate. The fish fillet was really big too. This could definitely be a meal for 2 people.\n\nI didn't like the fact that they added the tip without letting me know before. I understand restaurants do that when there is a large party, but I was by myself."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURncnBTdXVnRRAB",
            "text": "The food was decent mac and cheese was over cooked and salty. Drinks were on point if you get the chicken ask for hot honey on the side delit's delicious, the waffle tasted artificial. My fiance had the catfish and shrimp she enjoyed it my friend had the ribs combo. All in all good service from the staff but food to me was too salty."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzNXVuanRRRRAB",
            "text": "I went on a Tuesday evening after a movie . The place was packed ! I didn’t expect that for a weekday night but I soon found out why lol Happy hour is until 7 pm . Our waitress Fatima was very attentive but not over bearing which was good . I got the frozen Long Island with an extra shot  the drink was delish .\n\nFor dinner I ended up getting the fry chicken with Mac and collard greens . My friend got the catfish and shrimp with Mac and plantains . All the food was fresh and very tasty . I would definitely come back to try something else . The place could be a quick date night ( it’s a little lively so there wasn’t much chance for a deep convo ) or an after work spot ,Pop in if you’re in the area and looking for a tasty bite :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dmNLQWhBRRAB",
            "text": "Looks are deceiving. The food has absolutely no seasoning and was insanely bland. Do not waste your time coming to this place. I really wanted bbq soul food and was so excited to try this place. I was let down with the food. However, the drinks were decent. I recommend going to Harlem Tavern, Amy Ruth’s, or Sylvia’s."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNacFluY01REAE",
            "text": "Great vibes and great food. The cornbread the start you off with was amazing. The drinks were hefty and priced well for how much they give you. The food was banging as usual - go for the burger and wings, both are great.\n\nVibe definitely gives off the kind of spot you’d go to back in the day in high school. Great music, lots of chill folks"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1M1BtNGNREAE",
            "text": "I always come to Harlem BBQ and order the samething so I'm happy , salt and pepper shrimp , Mac cheese with collard Greens. With a nice mix, strawberry mango Margarita. Fatema is the best waitress. I always get her when I come here. It's a nice vibe with cleanness."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPbjdXUm5RRRAB",
            "text": "Food and bar service was excellent! Definitely try the oven roasted mango jerk wings. Better option than two sauce varieties. Jump on the corn bread train too, it is amazing!  Highly recommend frozen daiquiri"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSdHMyTjZBRRAB",
            "text": "I ordered three catfish sandwiches and there was a long piece of hair in one of my sandwiches. I am disgusted. I loved Harlem BBQ’s. This made me sad. I’m pregnant and I could not eat the rest of my food. I won’t be ordering or going there anymore."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRMXN1YnhBRRAB",
            "text": "Great food! Mac and cheese is superb! Wallet friendly. My family visits this establishment a few times a month. Our favourite waiter Huntly is fantastic! Very attentive,friendly and remembers our fave drinks. Give this man a raise and hire more like him!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURra1p6bDFBRRAB",
            "text": "My co workers and I love coming here at the most 2x a month just to get chicken wings a large size drink for $8.99. It's unbeatable elsewhere.  We always get the Long Island Iced tea drink because it tastes stronger. That's just my opinion.  The ambiance after work or happy hour is not bad either. The servers are always nice. In my experience, i can't remember receiving bad service so i do recommend this place."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLNm9tMlVREAE",
            "text": "Had a blast with my co-workers Bowman and Syke w it Stephenson.  The drinks was on point and our server was nice and friendly.  She kept coming and asking was everything ok and did we need our drinks refilled.  We had a great time ans will return."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxa3N6MmxRRRAB",
            "text": "Service was fast food and drinks was Amazing. Definitely returning to try a different dish. We were treated nicely and we were seated right away."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZMWVHNDBnRRAB",
            "text": "I come here numerous times and the customer service is always good and friendly. Today I had the delicious mac and cheese, collard greens and the Honey Fried Chicken with a blue moon. (happy hour beer was only $4!) I can never finish the large portions but it's definitely worth it!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtMTRXd0J3EAE",
            "text": "The food was great the drinks were 8/10 service overall 9/10"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBLS1uSk9REAE",
            "text": "Nice spot but it was too loud when I went. The food was awesome. Those mango jerk wings are the best. The Hennessy pina colada hit the spot and the corn bread was moist and tasty."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNGNxZ3JRRRAB",
            "text": "Don't get me wrong normally is crowded in there and the drinks are on point however yesterday it wasn't really know nobody in there and I live right up the street took forever to make are food and for me to get my wings and my source    watery and then get a piece of cornbread that's not even hot and actually is a square LOL🤣NOOOOOO GD"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXcnJIU093EAE",
            "text": "The drinks were amazing! I got the pulled pork bbq sandwich with fries, a side of Mac n cheese, and a piña colada. I enjoyed every bite. My friend got the catfish and it looked amazing as well. Cornbread was complimentary."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeDRDQlp3EAE",
            "text": "Was very please with the my take out pick up .. whiich was about 20 min wait time after placing order.. I had the catfish sandwich My fish was fry perfect the mac and cheese was soooo creamy and moist.Didnt get a chance to view the rest room facility or nite caps from the Bar however customers service was polite and forthcoming The bar was present and a eatery area on the opposite side of bar entrance Next time we definitely  try dining In . Yall let me know your taste buds as well . 😍"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2b2VMWDlRRRAB",
            "text": "We had a very good waiter.  He is attentive, humorous.  The good and drinks were delicious.  I will be back.."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2bU5XRmZnEAE",
            "text": "Everything from the frozen mango margarita to the Mac n cheese and collard greens 🥰🤤🤤 great service and portion size!! Definitely will be back from Hartford, CT!! Thank youuuuu!! 😍🙌🏾…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBeHFHUFlBEAE",
            "text": "Food was okay but the drinks were good and strong I had chicken and waffles in which the chicken was actually good . I will return back for their drinks"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRcTR6QnJ3RRAB",
            "text": "This has been the best place I've encountered,  ghir food was amazing, the service even better.  Highly recommend it. Has an intimate vibe."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMHJuZ2hBRRAB",
            "text": "I’m not sure if there is a nice way to say this. The food was awful. We had three different meals there and none of us could eat it. When a customer doesn’t eat their food and doesn’t ask for a takeout box, it means something.\n\nThe brisket was pure fat, potato salad was unrecognizable and collards were bitter with no flavor. This was my son’s restaurant choice. The servers are NOT friendly. Do better.\n\nWe left there and went to Red Rooster."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhNnQtLTFBRRAB",
            "text": "My food was delicious ! However, I wasn't feeling the ambiance of the restaurant ( ex. loud music, unprofessional employees, and etc.)."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXbllLNjVnRRAB",
            "text": "So f'n delicious after a long day. Good vibes. Great service. Split this plate with husband. Both left stuffed."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNMWNpMm1BRRAB",
            "text": "Food is good....was busy the day I went but it was still cool"
        }
    ],
    "reviews_count": 77
}