{
    "name": "Fumo Harlem",
    "place_id": "ChIJLe70p2X2wokReDA-X8LGqZE",
    "grid": "MN10",
    "address": "1600 Amsterdam Ave, New York, NY 10031, USA",
    "rating": 4.5,
    "user_ratings_total": 1851,
    "phone_number": "(646) 692-6675",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oTU1HdFFjVTlrWjFZdGNWazBXRlJUVEd0b1JtYxAB",
            "text": "I’m extremely disappointed with the service I received today. I’ve visited this location several times before, but this was by far the worst experience. After being seated and given a menu, I placed my order right away. Despite that, it took nearly an hour for my meal to arrive and about 25–30 minutes just to receive my appetizer.\n\nI became so frustrated that I ended up asking for my food to go. What made it even more upsetting was seeing a couple who arrived about 15 minutes after me receive their food before I did. This experience has completely changed my perception of this location, and I no longer feel inclined to support it."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nd1REaGllVXd3TWpSUk5YRlBOVTFsT0RSeWVHYxAB",
            "text": "The whole package here makes me want to become a familiar face. The experience was wonderful! The employees exceeded what we anticipated. This place keeps prices in check despite where it's situated. This spot delivers five-star experiences consistently."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWUVVXY3paSEJrVW14ZmJtdHVibWd3UTBoUFkzYxAB",
            "text": "Unfortunately the new hostess is a bit rude, which is really unfortunate given the amount of times we dine at this location. I came with my baby and we arrived a bit earlier than our reservation time, it’s a little chilly out she didn’t…"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wM2VuQk5WbW90T0dvMlduZFJhVEpKT1dsbWJFRRAB",
            "text": "Starting off on a positive note Fumo offers a skirt steak that is excellent paired with thick cut truffle fries. Simple, well made, and consistently of the same standard it's an excellent choice. The not so positive is that the staff hovers in a manner that is intrusive and annoying. Plates are pulled from the table as soon as they look empty without query, yet somehow the servers are always just out of earshot when needed the most. There's room for improvement especially when ownership apparently doesn't observe the same standard of dress enforced for the employees. Overall a good experience that with slight tweaks would be excellent"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sc1FtNHhWMDR6VXpWUVpFUTBhMEpIWlZsdVdXYxAB",
            "text": "Fumo: A Must-Visit Italian Gem in Harlem\n​Fumo on Amsterdam Ave and 137th Street is, without a doubt, a must-visit culinary destination in Harlem. My recent dinner here with my wife was nothing short of exceptional, offering a perfect blend of great atmosphere, attentive service, and truly amazing food.\n​From the moment we walked in, the atmosphere was vibrant yet cozy, setting the ideal stage for a memorable night out. The energy is fantastic without being overwhelming, making it a perfect spot for either a special occasion or a casual weeknight treat. The service was equally good—our server was helpful, prompt, and genuinely friendly, ensuring we felt welcomed and well-cared for throughout the meal.\n​The true highlight, however, was the food. I ordered the classic Spaghetti Carbonara and it was sublime. The sauce was rich and creamy, coated the perfectly al dente pasta, and was exactly the comforting, authentic dish I was craving. The Garlic Bread served alongside was crisp, buttery, and the ideal accompaniment.\n​My wife opted for the Penne alla Vodka and was equally impressed. The sauce achieved that perfect balance—tangy from the tomato and decadent from the cream—a clear testament to high-quality ingredients and skillful preparation.\n​Fumo offers a complete and unforgettable dining package. If you’re in the area and looking for high-quality Italian cuisine that backs up its reputation, stop searching. This place is an absolute gem.\n​Highly, highly recommended!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CR01qaFlSekpMZEZGNlNXeHpZVkJsVVRWVGRIYxAB",
            "text": "Everything depends of your taste, for me this pizza been one of the best in nyc so far."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poalFrUkRRMmhwWkhZd1MxOW1TMGxuUjNsdWJGRRAB",
            "text": "Was a great meal, with family and friends. The food was great."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRa0xXUXR3RRAB",
            "text": "Everything was delicious...service super...a bit on the loud side...but very fun!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkUVJFVkplbFJDVjB3NGVqQm5SbWRzVlRFM1gwRRAB",
            "text": "I called the restaurant to let them know my order was made incorrectly because they have the wrong description on DoorDash, and the attendant said it is not their fault and I need to take this up with DoorDash. Did not offer a resolution, just kept passing the blame along. DoorDash refunded me immediately. Fumo did not offer any help or support. Last time ever giving them any of my business. Terrible way to operate and treat your customers."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CYVgwOUNSVUZTTkMxTU1FZG1jWGt5ZW5Cd1ZYYxAB",
            "text": "My experience was great"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkM1lWYzNMV2MzVWxreFFuaDVSRTVFTkZSeVQzYxAB",
            "text": "I enjoy Fumo each & every time I dine there!!! It’s like the gift that keeps on giving. It’s one of our favorite go to spots for fantastic food & sexy vibes. Their wine bar down the street is also cool. My favs are the spicy calamari, kale salad & penne pasta. I must try the burrata next time I have heard wonderful delish things about it. Yum. 😋"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWVEzWkJSV2hQYWtGM1dYUkxSVVJ4UVhwbk9YYxAB",
            "text": "This is one of my favorite spots right now. I like the fungi, which is pasta and mushroom. I ate it regular with no meat. I I had a chicken one day another day I wouldn’t have had it I had with shrimp. I had a gluten-free. It was one of my favorite meals on the menu other than their pizza is really good. Sometimes they can’t get a little crowded price is a reasonable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CeFkxVnJWbGswWWtvMExWbzVVWEJXYjNaWFlXYxAB",
            "text": "Great service, food was excellent"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21STVNYUmFYMDQ0V0ZRdGVHaFJVSE4xZWtFMmNGRRAB",
            "text": "Great food and great ambiance."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psb1UwWkNXRFJoV0ZkblZFOTNXblJHYTJNdGVWRRAB",
            "text": "10/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205MVdFVkNUMjlmTW14UlFXRk1NM05GWlVSMWJWRRAB",
            "text": "Fumo has a delicious GF and Vegan pizza!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rNFdsQkdlVmhXYVhKTExXOXNkVTFxUmtWaGJIYxAB",
            "text": "I want a bag again. recommend ;)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWldHcHZibWxXZW5GM1VsZG1lV1ZyWjJ4QmRrRRAB",
            "text": "Super tentative and great food man really should try and eat at this place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poalJIb3RTbHAzYzBsRWIxSjJjVFEwWTIwMFVtYxAB",
            "text": "Made reservations for dinner and was late due to the parking, but they were very accommodating. Unfortunately, if I knew the food tasted that way, I would have just driven off. I tried the meatballs, garlic, bread, chicken, Parmesan and a few other items from the menu, but it was not worth it at all."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twM1JUUXhlbEZETFZwT05VeGtaMGh6VTBNeVowRRAB",
            "text": "My absolute go to when I want to dine alone, with friends for lunch on a random Tuesday or when family comes into town. You can’t be $12 pasta, side kale salad, truffle fries and a cocktail. The vibes are always vibing."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyc2Rhb1hBEAE",
            "text": "Overall: Lovely place, service, and food!\nThe location is very convenient because you can get to it by bus, train, and if you are a local student like me, you can walk! The aesthetics of the place are so beautiful, in all seasons (especially Winter and Spring).\nThe waiters are all really nice and friendly. The pasta dishes are amazing!!! And I love how much they give for a plate of fried calamari, so much!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oNVQyVlJWMW94YTJRNWVIWTJZM2xwYzJWb00xRRAB",
            "text": "10/10 food was so good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMFVXVk1NMnhHY2tsblp6VldaR1owUjFjMU0yYxAB",
            "text": "Excellent"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OaWVXMWFOSFJSVERSMVVtcDFUemRTT1hkMFpYYxAB",
            "text": "Everything is always perfect here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wR2JXZHROalpDYlhneWFIbDRlVWs0WkhsdWMxRRAB",
            "text": "I’ve never in my life been amazed by food from start to finish but this restaurant broke the standard absolutely overwhelmed by how good the quality of food is i will definitely be returning"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTk4ydDRZMDFSWVZkaU0wVkNXVVU0WkVjME1YYxAB",
            "text": "My favorite Fumo location! The food & service have yet to disappoint me 🍝"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GV1VFVlVkRzl2U1RWcmNGOXVhVll4Y1hoaVlrRRAB",
            "text": "They take so long to make the food. It literally takes 2 hours and my pizza gets cold all the time. Pizza is good but their service is bad.. 😨"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSc2JYUkNjVmxRWTNFMFZrVXpXRkJ1ZVhaWFUwRRAB",
            "text": "Came here around 7pm on a Saturday.  It was moderately crowded but not too crazy.  I ordered the mozzarella sticks and baked ziti.  Everything was great and the service was superior.  I'll be back for sure"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sRFZEWjJURGd4VjA1Uk5rZGpjVEpvVTNOa1lWRRAB",
            "text": "My golly! Best Vegan pizza I have EVER had! I added buffalo chicken to my vegan pizza. The chefs deserve an Award! 😆 Thank you!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJdFNXc3laaTAyU0U5dWIydEhhVmg0TFRKRVkyYxAB",
            "text": "I love Fumo’s but today I had a bad experience when picking up. One thing that needs to be put into consideration is a customers time. I have no issues waiting for the food, especially if it’s not ready yet. My issue is how I found out my food was ready. Seeing it outside sitting on the stand. I gave my name and number when ordering for pickup. Why not give me a call when the food was ready instead of letting it sit there in the cold."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjNVgxaFlZMDVuZVhKZmVIRm1TV3BzU20xRlkyYxAB",
            "text": "Had a great time"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTVVta3dWRTVKYkc5TlUxSlNORTFsYkVsak9WRRAB",
            "text": "One of my favorites for years!!!! The cocktails are great! Try the baked ziti"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFMlgyOWxVSGN0Vm1SV01tTkxjSGxpVVZsMFRVRRAB",
            "text": "Great as always!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wZlNITk5lRmhKYTJGdGJFMUZRWEZWZFRWNk1GRRAB",
            "text": "Good spot, really good burrata but the pizza was a tad bit salty. The dough was kinda meh too but overall chill spot."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kcWMzaE9aMjlzTUc1VWQwUk1SSEpGYWt0aU9GRRAB",
            "text": "3 Star for Atmosphere . I went to dinner, and overall the service and food was great. However, the people there clearly do NOT know how to behave, because the music was decently Low but everybody was screaming while talking for NO reason, everyone was NEXT to EACH OTHER, and it is so ridiculous the individuals that visit this place i couldnt even have a conversation\nWith my husband  because every one next to us and behind us was TALKING so loud like Wow! Never experienced this before in a restaurant. So ridiculous never going back. My first and my last visit !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwQ01VOXphRFp5V0MxT05WcEVObkpZVTA1UmNIYxAB",
            "text": "Honestly, the best French toast I’ve ever had. Will come back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SFRrSk9XREpmWkhreFVFa3RiWGxIZUMxVGRGRRAB",
            "text": "MY ABSOLUTE FAVORITE. Garlic and Oil; Spaghetti, Field Greens (LOVE), and bread w oil/balsamic. The tiramisu is also outstanding if you like dessert. Vibes/Music always 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0VWNHWm1NMnd5VFV4Tk5GZGlXRGRtVTJWQ01uYxAB",
            "text": "Pasta is OK not bad"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMGFURTRaRzVoZGtkQlJtMUJabmxuZG1sUWMzYxAB",
            "text": "The best $12 pasta deal before 4. The baked clams are so good and so is the eggplant parm. The best I've had actually. My fave is the Alfredo rigatoni"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMU1IaHFUa3cwYlhWaVl6UTFja3BwVUhGcVJtYxAB",
            "text": "Expensive , not great"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvd1lYTTRjM0ZyZFc1Nk5YcHJWbVZ0VUhoQlRXYxAB",
            "text": "I actually miss this place in Harlem. Whenever I get a chance I go visit Uncle Tony's next door, to get my Vegan Pizza! They have the absolute best Vegan pizza in the city! Fumo food is great. I miss living over there. Harlem west side, Amsterdam Ave."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sb1EzWk9RemRHYTFKV1ZUSnZlV2RNWlc1elIwRRAB",
            "text": "This place is never a disappointment!! Love everything about it food and beyond,  the vibe  is excellent!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUmFHWnVVa295UVVObk9HcE1TR0pKUldaME1tYxAB",
            "text": "Attended a bridal shower brunch - loved it! Intimate atmosphere yet big feels! A corner spot, welcoming, and beautiful and simple decor. Friendly staff, servers, delicious tasty but simple menu, and superb mimosas Overall, a feel-good social corner place. Would definitely go back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5aGRscHlRMnhVWTFKRWJYRmpOWFl4YkhkUGJsRRAB",
            "text": "Love this place! Food, drinks, service, everything A+!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCTmJuZFdNbkpuV2xrMlVFeENRVUZuVm14eVZHYxAB",
            "text": "I love Fumo.\nThe food is always great.\nToday, however, the left side of\nRestaurant was so hot I left there with chest pains. It feels like heat exhaustion. The hostess also\nSeemed agitated. Today’s experience was so bad. Yes, it’s summer, but it should never be so warm\nAt a dining establishment. Maybe the AC is zoned, because the other side wasn’t as warm. It was really a problem, you all should fix that\nASAP. Someone with heart problems like myself\nCould get very ill.\nI’ll stick to the other locations."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0eVR6TlJWbEJzVERJMVNGQjVhM2h1YUc5elJYYxAB",
            "text": "I have been 3 times.  The 1st and 3rd no bread was on table. Same Dessert presentation was different 2nd and 3rd time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMlRXWlZVbnB4ZVdoVllXbGlia05KYlhoZmVWRRAB",
            "text": "Fumo is the best go to Italian in the area! Love the Gladys! Extensive gluten free options. The restaurant can be a little loud and close together so not always to easiest to hear."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kalZqQmlWRzUzU0RSUVZUbHVVVWcwVERreVpXYxAB",
            "text": "Great neighborhood spot! The best martinis and pasta is very good as well. Can’t wait to try more items"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGTlRHMUVhelZQU0VkNmRsaHVNMFZLVGxReVkzYxAB",
            "text": "Steven was such a great server. The food and drinks were delicious. The coffee too! Will definitely be back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFeVFuVlFObm8wU0dWb1dVZzRkbk4zTkhVNFdFRRAB",
            "text": "Beautiful restaurant, nice people, and really good food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLLUY2T0x4NDVtNTBRRRAB",
            "text": "I really enjoy Fumo—the food is consistently great and the atmosphere is always lively and welcoming. It’s a place I genuinely look forward to dining at.\n\nThat said, I’ve noticed something that detracts from the experience. The owners are often present, which is usually a positive sign, but they come across as surprisingly impersonal. On a recent visit, one stood near the kitchen the entire time without once engaging with guests or checking on how things were going. Another lingered near the hostess stand, and when we left, neither acknowledged us or thanked us for coming. It’s a small gesture, but a warm goodbye or thank you goes a long way in making patrons feel appreciated—especially when it comes from ownership.\n\nAlso, I have to mention the bread situation. It’s a bit baffling that warm bread isn’t offered, especially considering how many guests have apparently expressed the same frustration. It’s a simple touch that most diners expect and appreciate.\n\nFumo has so much going for it, and with a little more attention to hospitality and guest feedback, it could elevate the experience even further."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBd2JXbTR3RRAB",
            "text": "We started off at the bar and ordered the calamari. The bartender was extremely friendly and very knowledgeable. Try the Gladys, it's delicious! We moved to a table and ordered dinner. All the meals look delicious. I had a margarita pizza, and it did not disappoint. Definitely.A place I would go again next time I'm in the area."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMajk2dlNnblAyb1pnEAE",
            "text": "We drive all the way from Brooklyn just to come here. I’ve been to the Kips Bay location and that one is nowhere near as a good as Harlem’s. The food is phenomenal. There’s not one dish I don’t like. But Especially the baked clams and the Gamberi Pasta (PRO TIP: Dip the bread they give you in the clam sauce, you won’t regret it!)The food comes out fast and hot. The cocktails are also really good! I recommend Amelia & Gladys. It can be hard to get a reservation and you might just have to put your name on a waitlist when you get there..it’s worth the wait:)"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBcnNMQTFnRRAB",
            "text": "I know it sounds unusual to rave about a salad, but the Kale Caesar here is truly exceptional.  The flavour is so well-balanced, and it's incredibly satisfying.  The truffle fries lived up to the hype – a generous amount of truffle flavour, unlike some places that skimp.  Our server, Rezvan, was a gem.  Despite the restaurant being packed, she was always attentive and made sure we had everything we needed.  I'll definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiaFAySldBEAE",
            "text": "I’ve been coming here since 2017 and it’s been consistently amazing. Perfect menu of pasta, pizza, and salads. They also make a killer gluten free rigatoni! Lots of dairy free options too.\n\nGet the Fumo Spritz!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMLV91SXV3RRAB",
            "text": "Fumo was hands down on of the most wonderful dining experiences we have had in New York. Everything from the delicious food and wonderful service. The extremely friendly staff made the whole experience truly enjoyable. Francesco the owner was very involved great hospitality and just wonderful person. The baked clams were to die for. We would highly recommend this place and will come back again when we are in town."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOaU9VMWxhV2xPY1ZoRFZrazVXbEJmZUZsbU5GRRAB",
            "text": "Ordered in spaghetti carbonara and kale Caesar salad, excellent. 4 cans of beer delivered, too!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1eXJIM0xBEAE",
            "text": "This bright and modern eatery didn’t show its strong roots to Italy. The taste and flavors were mediocre at best not to mention the hard piece of chicken cutlet in the Chicken Milanese. The salad appeared to be on its last survival.\n\nThe service was decent at best and what really turned me off was the awful display from the hostess after we sat down and had our first drink that there is a 90 minute dine in time limit. The menu or upon entry, it did not indicate such not to mention 98 minutes later the establishment was half empty.\n\nThe menu items are pretty pricey. We ordered one dish and one appetizer and 3 drinks each to pay over $100+ with tax and tip.\n\nThe decor is beautiful but their bathroom does need some hourly maintenance.\n\nThis establishment had good drinks but the food was bland and boring. FUMO Harlem is great to grab drinks before heading off to your next stop."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJYVczWUM0LWN1dlZREAE",
            "text": "Fumo is a great spot for reliable and consistently good italian food, friendly staff and patrons, vibrant atmosphere and good price points. They even have a daily Pasta/Salad special for $12 which allows the students on campus to get \"real\" quality food at a reasonable price - that's a great portion also."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPNzltSk5REAE",
            "text": "Fumo never disappoints. A perfect place to come for lunch, brunch, dinner and as a group. Before going vegan, I loved all their pizza and pasta dishes and now trying their vegan offerings, make me feel like I am not missing out on anything. Vegan options at Fumo are found throughout their menu, from pizza, pasta, burger, and salad. Needless to say, I was a very happy girl! 🍕🍝🥗"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2NWNxNkF3EAE",
            "text": "This restaurant was a vibe. I got the espresso martini and penne a la vodka. The drinks were amazing and the food was really good. Parking is kind of hard to find around here but 10/10 would recommend and would definitely come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEb2RXSkdnEAE",
            "text": "My first time dining here and it was a 10/10 experience, my friends and I were elated!! Food was served hot and fresh, large portions and friendly service — it was amazing! We sat in the outdoor sitting area, it was so great watching people come and go as we enjoyed our meals and chatted. I got the Chicken Parm, it was soo huge and filling. I highly recommend coming here — I look forward to visiting again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4cXNENDJBRRAB",
            "text": "Beautiful place with good service. The waitress forgot our truffle fries though… luckily the pizza was filling enough that we were okay without them but still.\n\nHad the funghi pizza (added prosciutto on top) really good, just expected it to have a tomato base which it didn’t. Excited to go try their pasta next time!\n\nLoved the mocktail they gave me, so refreshing!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNk1yc3JRRRAB",
            "text": "Located on the corner of 139th st and Amsterdam. Here are the key take aways from my perspective.\n\nPros- Their one and only mocktail was delicious. Very lively scene with loud music and a diverse crowd of people. The decor is earthy and rustic, perfect for pictures. The salmon and pasta were simple but tasty. They have a lot gluten free options.\n\nCons- Our waiter seemed unknowledgeable about the menu and didn’t care to find out. The cauliflower and garlic bread had an awful aftertaste. Overall everything was overpriced."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIazZHMUN3EAE",
            "text": "Our meal, drinks, and dessert were absolutely delicious!! We enjoyed expresso martinis, wine, fried mozzarella, pasta, seafood, spinach with fresh garlic, and the olive oil cake which is a must have."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkeE92NG93RRAB",
            "text": "The food was amazing. I had rigatoni with broccoli and shrimp. My friend had chicken parmesan. The portions are really substantial. We started with the meatball and fried mozzarella appetizers and were full by the time the entrées arrived.\nThe waiter was informative and the staff was on top of their game. Very attentive. Most important, we ordered drinks, I had a gin and ginger with lime and I must tell you that the bartender was not stingy.. We had a good time and I'm definitely going back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwX01EcmxBRRAB",
            "text": "the eggplant parmasian is to die for. i also got fried chicken and waffles. it was good, but the cheicken was dry. so i ended up putting the eggplant parmasian on top of the crispy chicken, and it was so good. very frendly staff. but do hope they would get their fly issue under control."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCMi15eUpREAE",
            "text": "I think seeing a restaurant pretty full on a Wednesday is a GREAT sign! They do not disappoint, not in service,attention,food. I can not wait to go back. I had clams for appetizer with bread and chicken parm for entree.\nMiguel was my server and he was great , patient,  great recommendations, attentive enough, they are lucky to have a server like himself."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYaW95dnN3RRAB",
            "text": "Came her over a year ago, but the food seems like it got better. The baked clams very good, definitely give them a try."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaOU1fX1B3EAE",
            "text": "Everytime I eat here I leave very happy! The pastas here are insanely good! I am personally a huge fan of the Penne Funghi, aka the mushrooms. It is very very tasty! Last time I came my friend and I sat at the bar because it was packed, and we ordered the Burrata 10/10! We also had the truffle fries and the caesar salad. All were amazing. The restaurant has a great atmosphere if you want a fun time, they play great music and it is usually full of people. We were able to walk in and sit at the bar, but I definitely recommend making a reservation because it can get very full."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyNmIzQVNnEAE",
            "text": "Even though we were unable to make a reservation online (fully booked), the two of us had no trouble being seated immediately during happy hour despite the gorgeous weather and larger parties waiting to be seated. We were told we had an hour and a half before the table was needed - plenty of time! Service is quick.\n\nWaitress came by with water immediately and left the carafe (1L) and menus.  Came back in a quick, yet appropriate amount of time to take our order.\n\nWe ordered a drink, starter, salad, and pizza.\nChianti, Meatballs, Spinach Salad + Chicken, and Parma Pizza.\n\nBread was provided along with oil and vinegar for dipping. It was dense and doughy, delicious.\n\nChianti was juicy and perfectly medium-bodied.  Good pour.\n\nThere were four meatballs served in gravy/sauce/ragu. These were not dry balls.  Very moist, yielding, and flavorful.\n\nThe spinach salad was a decent size and you could see and taste the freshness of the ingredients. Personally, I thought it was slightly overdressed, but the balsamic dressing wasn't overbearingly tart or sweet - it was just right.\nThe chicken was tender, juicy, seasoned and cooked to perfection. The honey pecans added so much texture and surprise sweetness. One of the better salads I've ever had at a restaurant.\n\nThe parma pizza - a white pizza/flatbread - was out of this world. Creamy, salty-sweet.  Again, quality of ingredients is very evident. Arugula was fresh, proscuitto was perfectly salty, and the dough was just SO DANG DOUGHY- yet crispy! We held on to the oil/vinegar to dip the crusts into and added some of the honey pecans from the salad - very complementary flavors.\n\nThis place was highly recommended to us and we, in turn, highly recommend it."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxeGVxYzZ3RRAB",
            "text": "It's always good food and good service. We have been coming here for 4 years now. My favorite dish is branzino. I am glad that the price doesn't go up like in other restaurants after COVID. But they probably don't have to since they are always busy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOZ09tMHd3RRAB",
            "text": "This place was great.\n\nI went after a performance at Harlem Stage m and had no issues with seating.   The food was delicious and came out quickly. The staff was attentive and I would definitely go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMeE1tSzF3RRAB",
            "text": "Fumo Restaurant exceeded all my expectations with its delectable Italian cuisine and amazing vibes. Every dish was a delight, bursting with authentic flavors that transported me straight to Italy lol. The ambiance was lit and welcoming, perfect for a dinner with your SO or a night out with friends.\n\nA special shoutout to our waiter, Steven (with the Afro), who was top-tier in every way. His attentive service and friendly demeanor made our dining experience truly exceptional and he had the best recommendations. Fumo is definitely a Harlem gem, and I can't wait to return!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNd01iYmFREAE",
            "text": "This was my first time at this restaurant and I really enjoyed the atmosphere. It was very chill and have a grown and sexy vibe. I also enjoyed the food, though I feel it was a bit overpriced. My favorite dish surprisingly was the kale…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkVk4wZFZPRGhCT0RaaVdXcExRM0IxTW0xbloxRRAB",
            "text": "I had a wonderful time from start to finish. The dishes impress and the environment supports them. Their employees make the experience special! This place was remarkably good. This place showed real quality, I'll be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbGZQUk1BEAE",
            "text": "Went here for my birthday dinner. It’s was my first time and there were three of us. It’s a local spot in my neighborhood and I just discovered it through friends. The food was delicious and the service was great. We had a wonderful 3 course meal with drinks. The atmosphere is livelier than you would think. The music is loud and the conversation is just as loud. Nice bar. Seems to be a younger-ish crowd, very friendly staff all around. 100% would recommend!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhXzdYVVFnEAE",
            "text": "I had an amazing time at Fumo. The food was great , service was great and drinks were very good . My server was Delfi and she was awesome and gave me recommendations .I started with the fried cheese and had a Buffalo chicken pizza . My…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyLWNHUUhBEAE",
            "text": "Finally tried out this cute neighborhood place. First off, I’m in LOVE with the interior. It feels so airy and fresh with the white brick, brass accent lighting and all the plants that look happily cared for. Whoever designed the space has a great eye for detail. Onto the food. I heard they were known for their pizza so I tried their most simple, the Margarita, but unfortunately the bottom crust was so thin that it got soggy soon after it was brought out. Also the mozzarella they used was pretty tough and chewy so you couldn’t bite into it without pulling the whole glob off at once. The best part was the outer crust which was light and crunchy. Maybe it was an off day? The bartenders were friendly and attentive the whole time. And the atmosphere was so lovely that I definitely want to come back soon and give the food another chance!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHODQyU2dnRRAB",
            "text": "Such an amazing pizza place!\nThe staff was simply amazing!! We sat at the bar and chatted with few staff members, everyone was super friendly!\nWe had the meat balls to start, and the Parma pizza and eggs Benedict as mains, I loved the food!\nI will definitely be back!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6bktfQ2FREAE",
            "text": "Beautiful space here uptown. The server was so kind and made jokes with us the whole time. Food was delicious. Semi-pricy but on par with what you would expect for this type of restaurant in Manhattan"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwNzdfZ253RRAB",
            "text": "Fumo is a restaurant, not a nightclub.  The music is too loud and intrusive.  The lighting is too dark.  Solo birthday girl had to sit at the bar for her dinner while there were empty seats at two tops and the birthday girl was only there for 30 minutes. The birthday girl was disappointed. The penne with vodka sauce is good."
        }
    ],
    "reviews_count": 82
}