{
    "name": "Hamilton Hall Bar & Restaurant",
    "place_id": "ChIJKYBCGCf3wokRZ-6m6zT5BxI",
    "grid": "MN10",
    "address": "3493 Broadway, New York, NY 10031, USA",
    "rating": 4.5,
    "user_ratings_total": 208,
    "phone_number": "(646) 454-9797",
    "reviews": [
        {
            "date": "19시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201Q1YycGFSelZuY0dGbFowOWlTMVpGTTA0dGJGRRAB",
            "text": "You really feel like you are stepping into a true irish pub Wyeth excepting staff.The smash burger, Buffalo cauliflower were tasty and delicious.  The fries are amazing the best.  The nachos need some help and the spicy chicken nuggets need to be real chicken they were not so good. The beer was cold and delicious."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZNU5HdGpaekpyWDNsalFtNUtkR3A0Ykhod1dFRRAB",
            "text": "Just moved from Flagstaff Arizona and this is a relatively new place in my old West Harlem neighborhood.  Times have changed since the 70s. LoL.  Cool place.  My new spot. 👍"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkaFZFMUpaRmw1YVMxa1pXSkljVVp3YzBOSVRIYxAB",
            "text": "We had an exceptional dinner, followed by great music at Happy Note NYC, a great venue that offers singers a chance to perform in their back room. We met Wes D’Alelio , who organizes the musical guests. We were surprised by the delicious items on their menu! Their homemade flatbreads were delicious as were their burgers, fries and chicken quesadillas. We also loved their chicken Caesar Salad. The prices for all their entrees are incredibly reasonable. The drinks they served were delicious and while many bars and restaurants charge ridiculously high prices, you can enjoy a delicious dinner with drinks, enjoy great music and still feel like you not only didn’t get ripped off, but that you were able to have a fantastic  dining experience  in a wonderful bar, restaurant and musical venue. Nicole was our waitress and she was wonderful too!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGelh6bDVkVE5DT1VGQ2JtOWpNMjEwUmt0UlFuYxAB",
            "text": "Noah the bartender was exceptional. Not only in service and etiquette but wisdom as well. He talked to me after my decade break up and his words help...although I am a local that is only my 2nd time at this bar ever and it left a very good impression on me!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oZlREWlNhSGRXYkRaVVZIaHdWVjlWWDFKWVMxRRAB",
            "text": "used to love coming to this place till the karaoke bartender wed  sept 10 over charged me for beer. Maybe he thought I wasn't going to tip but I work in a bar swell or just wanted to steal the cash 10$ for michelob ultra? usually 5 for happy hour or$ 7.80"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwMUxXeHBjM3BZYURkWUxYRjZXRmx2ZWtkSlIxRRAB",
            "text": "Great spot to chill out , grab a bite to eat , have a couple of cold ones while watching a game!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xORVJXMW1TMlJMUmsxTE1GbDZUVkp6VW0xcWJGRRAB",
            "text": "This place is amazing and in the heart of Harlem/ Washington heights! This place has a space for any vibe. Had the opportunity to throw a bachelorette brunch and Mikey and his whole team were so accommodating, so pleasant to work with and just wanted for us to have an amazing time and that we did! Definitely try the chicken and waffles and steak and eggs, and the margaritas!! 😍 Can’t wait to go back, thank you to the whole team, you truly made it so special !!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GMGIwUnNXak0zUzFWR05Xd3llSFF0YmpOelVGRRAB",
            "text": "This place is a nice brunch spot. I’ve been here twice and the food has been good, service excellent, and the ambiance is nice. They have events too, but I don’t live in the area to check it out often."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOTFRXdHRRbFY1UTFaaVdIWTVkVTgzWTNaNFdWRRAB",
            "text": "I always have a great time here. Ezra is the best bartender in Harlem!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvczVhS0ZnEAE",
            "text": "Ezra is an excellent bartender. Great communicator and very attentive. We went for Sunday brunch. Not packed and quiet environment. Good-spot  to watch the games. Lots of tvs. The confit wings were meaty and tasty. The brunch burger was big with an egg and crispy bacon. The avocado toast was also very good with the egg and pickled red onions. They have unlimited mimosas and Bellinis for 90 minutes for brunch."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvc2ZUem53RRAB",
            "text": "Good people, good food, good vibes."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJd3MtT3h3RRAB",
            "text": "TOTAL SCAM – BEWARE if you’re just going to EAT!\n\nMy wife and I were in NYC for a show and wanted a quick bite after. Friends told us about this place on 143rd & Broadway that supposedly served food late and had a comedy show. We walked in around 9:30 PM, and the hostess immediately handed us two tickets to the comedy show. We told her we were just there to eat and needed to leave shortly to catch a flight at JFK by 11:30 PM. She nodded, no mention of any required fee.\n\nWe sat in a quieter room where musicians were setting up, hoping for a quick, relaxed meal. The server came and said we should sit in the bar area to watch the comedy show. Again, we told her we weren’t staying long and were only there to grab food. She said, “Well drinks are on the house for the comedy show.” Strange, but we went along and ordered two glasses of wine. We emphasized again—please bring our food ASAP.\n\nWe ordered two burgers. Food came reasonably quick. All seemed fine—until the bill arrived.\n\nThey charged us a $40 fee for the comedy show we didn’t attend. I went up to the hostess to ask why, and she flatly said the charge was for the show. We never agreed to it. She refused to remove it and claimed the $40 covered the two glasses of well wine we had. Come on—two glasses of the cheapest wine in NYC are not worth $40. We were lied to and ripped off as the menu clearly shows a glass of wine is $8.\n\nThis place is running a shady bait-and-switch scam. If you’re walking in to eat on a night they’re hosting comedy—do NOT accept the show tickets. Better yet, go somewhere else.\n\nWe’ve reported this to the Department of Consumer and Worker Protection. Businesses like this one shouldn’t get away with tricking customers. Avoid at all costs."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2aHZmTTd3RRAB",
            "text": "Great spot with NFL Ticket. You can watch all the games."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuM2ZhblZREAE",
            "text": "Love the whole atmosphere of the place and the fact that our office party was secluded was so cool !! The minus was that we didn't have our own bartender in the back but it was pleasant regardless !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNub2NmUVF3EAE",
            "text": "Our server was Shannon, and she was amazing. Really kind, helpful and was really flexible with our party. We had five of us. The food came out fast. The music was a little loud (not terribly) for the brunch-time in my opinion."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIOTRHdlZnEAE",
            "text": "The bar is a cozy spot with a nice diverse crowd ( a mom and a baby, a guy searching for a friend, a beauty at the bar, good guys out for fun, and a random party in the back). This is the place for anyone who wants a great drink, cool people, and awesome service.\n\nWhen we showed up, they had added a new item. We tried it and it came out incorrectly. The manager came through and made it right and took care of us with kindness.\n\nI believe it is an Irish spot, and the attention was 100 percent comfort and care—it was hospitality first.\n\nIt is a place to escape from a tumultuous day in the concrete jungle! I will be back again and again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dUtYRnpnRRAB",
            "text": "Friends & I saw it was open and went in for a quick late dinner. It was amazing the wings, tacos , artichoke dip! The different flavors of frozen margaritas were perfect. Mickey was the best , so helpful and engaging. Definitely will be returning."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cDlfbzdnRRAB",
            "text": "Best neighborhood bar and restaurant. Terrific happy hour food and drink. Love their back patio when the weather is nice. The staff and owner are very friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURid1l1cnVBRRAB",
            "text": "Amazing drinks and service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNidUx5MVp3EAE",
            "text": "Absolutely amazing spot to go to After work or Brunch Spot. Amazing staff and the manager is awesome and will answer all questions. Which I wish more bars did."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxbU5MRjJBRRAB",
            "text": "Happy to find a traditional Irish breakfast."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMeEkzaGxRRRAB",
            "text": "The food wasn’t as good as I expected, however the energy and vibes were so great. There was a nice trivia game and everyone was interacting.\nThe drinks were 8/10 but the ESPRESSO MARTINI was 10/10.  I high recommend that."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUdFBDMHVnRRAB",
            "text": "Dope spot for karaoke"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqOUl5YWZREAE",
            "text": "Chill sports bar with a robust food menu"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaU82ejNnRRAB",
            "text": "The best place I've found in NY. Nice selection of draft beers, great service and wonderful atmosphere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkallpcXB3RRAB",
            "text": "Happy with service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0cjd1dDJnRRAB",
            "text": "Really bad service. We visited the restaurant last week for bfast and the server didn’t even say hi or good morning. I greeted her. We ordered coffees and she brought the coffee but spilled in the saucers and without even saying a word she left. I went to the counter to ask for extra napkins to clean the saucers. The coffees were good though but the food was just okay. Then after finishing our coffees and bfast we ordered cold drinks and all the plates and cutlery stayed on the table until we left. She didn’t even bother to take the empty plates and there was only one more table except us. It was highly disappointing and the overall attitude wasn’t good at all. We felt like she didn’t want to serve us. We paid the bill, gave her the tip and left. I don’t recommend going there if you don’t want to feel bad or disrespected."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROMTgyZ0ZBEAE",
            "text": "Mal servicio dejan mucho tiempo en espera a las personas que bad muy bajo"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROcllMTUZ3EAE",
            "text": "I got their meatball soup when I arrived at this Irish pub in the heights on a Sunday night. Musicians started a set of live jazz as I ate. The food was solid and the drinks were good too. I think this place is has a very cozy feel and it right next to the 145th St station."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxNXY2MndBRRAB",
            "text": "We’ve had dinner here several times. Staff is always friendly. Menu is a mix of standard bar fare and some more interesting choices, such as crispy skin salmon over spinach and risotto. There are various vegan and vegetarian options. Full bar and beer selection, including several NA beers. Lighting and ambiance are pleasant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWcjluMkN3EAE",
            "text": "So this place is surprisingly spacious, it has a private rooms section in the back, which will be a great rental space. Decorated really nicely. But the food is a big NO. We got wings and they had the breading on it which it wasn’t my fave. We had a chicken pot pie, which tasted like a chicken soup with a flaky croissant on the side. The 3 bean nacho was great. I wanted to admit to it, which I did, and they had steak, which were burnt.  The apple pie was… not good it was pretty presentation. I would just come here for drinks and to watch a game that’s about it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbXVhdGR3EAE",
            "text": "Friendly service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGMGVhQzJBRRAB",
            "text": "Whenever I am here for bingo, Payphone is always on my bingo card. Anyways…the service here is awesome and the food is tasty"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGc1BpV2xBRRAB",
            "text": "I ordered risotto and they gave me rice."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCc291b2F3EAE",
            "text": "Awesome bar!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadnRHLUN3EAE",
            "text": "Considering restaurants alike in neighborhood, the ambiance was mediocre, unsure if it were me & a friend, constantly reminding waitress for items ordered and extras.!\n\nWith tip (Sunday Brunch) $44/person. I’ve been to comparable places but with a lot better service & food overall.  Would not recommend brunch here"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaX092VGNBEAE",
            "text": "Great place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaajhtczRnRRAB",
            "text": "The service and drinks are always good."
        },
        {
            "date": "수정일: 2년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwalpLZGx3RRAB",
            "text": "Il locale è stato una sorpresa. Ambiente curato e buon servizio. Il cibo di alto livello (il pollo con purè e cavolini di Bruxelles era delizioso), buone le birre con ampia scelta. Prezzo adeguato."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwal9fVHVRRRAB",
            "text": "Hamilton Hall is a great spot, located right off of Broadway in Harlem. I came in recently for the first time to have a drink and it was a great experience. Mickey is the best bartender and the atmosphere is really warm + inviting! :-) I didn’t eat, but the food looked really good. I will definitely return here, this is a great bar & restaurant!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaTRTWUtBEAE",
            "text": "I didn't like the Hamilton burger was to drying"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwOWVld3NRRRAB",
            "text": "Amazing"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwLXJ1YU53EAE",
            "text": "Great atmosphere.  The Owner  is absolutely amazing followed by great staff! Nice place to unwind after work. Perfect place for food, drinks and relaxing.  Has a “Cheers” vibe… I have to say each time I came out, I left feeling fantastic! Had an event here as  and it was great!\n*Had Brunch and dinner*"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcTl1dlpnEAE",
            "text": "Stopped by for a quick bite. The host, server and bartender were attentive & the food was great. Definitely recommend coming here if you’re in the area."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NGNTTlNREAE",
            "text": "Trivia night...was fun but we lost by far...😆 🤣 😂"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbkllVDNRRRAB",
            "text": "I honestly don't remember how much the food was.  I was having such a good time! I do, however, remember that it was delicious. My bill was costly because I kept buying drink rounds at the bar.... I highly recommend this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKbFBlckt3EAE",
            "text": "I really like the place. The staff and food are great.\nGreat selection of beers."
        },
        {
            "date": "2년 전",
            "language": "de",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMzV5TzRRRRAB",
            "text": "Wir haben hier nur etwas getrunken, nichts gegessen. Die Speisekarte gibt aber einiges her und wir würden hier gerne mal was essen. Das Ambiente ist super, wie in einer richtigen amerikanischen Bar."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdDViRThBRRAB",
            "text": "I’m a local and both love and frequent so many of the bars in the neighborhood. However, the bartender Tasha was very rude. I just came back from checking out their happy hour and she didn’t say ONE word to me, yet spoke with every other…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKODZfaDN3RRAB",
            "text": "I just stopped in for a non alcoholic beer to kill a bit of time. handsome place. I liked the bartender. Good fin in the neighborhood."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2cnI3U3RnRRAB",
            "text": "Awesome food with a laid back chill atmosphere.\n\nThis restaurant / pub has a very relaxing vibe with a great selection of cocktails. They also have an extensive menu to satisfy that late night cravings.\n\nI ordered their signature Hamilton burger, and its one of the best burgers I’ve had in NY. Order it and taste its righteousness. I also got the salmon with risotto that was cooked to perfection.\n\nSeriously, this place got everything you need when you pass by Broadway."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHd01LQWdnRRAB",
            "text": "Food is delicious. I highly recommend this place. I Been going here for months and the food never lets me down. Great music,  friendly servers and drinks. A place I recommend to anyone that enjoys a fantastic atmosphere.\n\nPan seared chicken, Brussels sprouts, and mash potatoes with bits of bacon with a Krombacher pils is my fav."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhcGVYcEZBEAE",
            "text": "Great negronis! 1 of my favorites. I had the new curry fries and its delicious. Live jazz, dj sets and music on week ends.  Can't wait for their garden to open up when the weather gets warner soon."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbmJMOHJBRRAB",
            "text": "I found this place on the Seated app and decided to check it out. Upon arriving the owner(?), Mickey, asked us if we wanted to be seated by the bar where the game was playing or somewhere quiet. We elected somewhere quiet since we were not into sports.\n\nWe ordered the Oysters, Shepherds Pie, and Sears Salmon. Mickey recommended the Coops Island and Great Gunn because we advised we like big oyster. Mickey gave us an additional 2 oysters because he said the remaining GG and CI oysters weren't as big (BIG PLUS!~). I would definitely recommend the Alpine Oysters (it's on the happy hour Mon-Fri 4-8). The Coops Island and Great Gunns followed in taste respectively.\n\nI don't usually order Shepherds Pie but something about the old fashion all American decor made me want to try it. It was very delicious, best one I've had (though I haven't had many). Only caveat was the portion wasn't super filling but the taste more than makes up for it. The Seared Salmon on the order hand looked hearty and tasted very yummy.\n\nOverall, great experience and I'm glad I tried them out :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNk9EY1BBEAE",
            "text": "Solid draft list - lot of IPAs. Excellent wings and burger. Excellent neighborhood spot for just about anything. In my case, a spot at the bar with some good food!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLbXJUdzVRRRAB",
            "text": "This place does nice presentation and preparation with ingredient choices That make the dish DELICIOUSNESS, ample and priced appropriately.  Very Nice."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbWFuMG5nRRAB",
            "text": "Fantastic addition to the neighborhood. Gavin and Chynna are always a killer team to get you anything you could need. And Tasha makes a fantastic drink. Also I love having a local place with live music, especially after a year of listening through headphones. Glad to make this a regular spot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCX3VQNHVnRRAB",
            "text": "The atmosphere I loved and the chicken sandwich was so good. The manager came and greeted me and my family he made us feel really comfortable, and I can't wait to go back"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxbU9qb2RnEAE",
            "text": "Great food and drinks. Just had one of the best old fashioned here. But the highlight was having one of the best Shepard's piei n NYC. Boy have I missed it"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlLWJYRjRnRRAB",
            "text": "Really nice place, good food and cocktails are on point. S"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4Ml9ubjl3RRAB",
            "text": "I was today with a friend and the waitress with only 2 days of experience give me an amazing service, I really recommend the place. The food was delicious. It's a comeback place!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtcTVyVUd3EAE",
            "text": "Great salad, martinis, and service! Loved the cozy atmosphere"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNk92UXNnRRAB",
            "text": "Excellent spot for birthday celebrations! I invited about twenty guests for a birthday brunch here and we all loved the service and drinks. The waiter and  owner were very accommodating and went above and beyond to ensure I had a memorable birthday. I would come back here again and highly recommend sitting in the back room!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5NHF5aEdREAE",
            "text": "Truffle mushroom pizza\nFried chicken sandwich\nWine and food were awesome! Great food and service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobjZfQXR3RRAB",
            "text": "Brought a group of 14 here for a birthday party and had a great time! I booked ahead so they had a nice big space reserved for us in the back, and our server Rachael took great care of us and even did separate checks which made our lives much easier. Great food and good happy hour deals, will definitely be back soon!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTNjlpZXpnRRAB",
            "text": "A great addition to the neighborhood. Can't wait for live music to begin once indoor dining comes back! My fiance had the burger and it was OUTSTANDING. My only wish is for a couple more light/healthy options on the  menu. But the food here is definitely way better than your average pub food!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2N2RpaF9BRRAB",
            "text": "Visited randomly with my boyfriend and absolutely loved it. The owner and bartender were extremely funny and welcoming. The drinks are also delicious, and I really \"felt them\" after only two! I definitely recommend this place and can't wait to check out their happy hour. Definitely a hidden gem in Harlem."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhNU1iOXB3RRAB",
            "text": "For brunch, we ordered steak and eggs and a hamburger.  We asked for med-rare.   We got well done.  One more person got caesar w chicken. Everything seemed average at best.  I am guessing this restaurant gets better ratings because people are drinking. Our drinks were not enough to sway us. Server was super nice. Food was mediocre."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTODZhTmN3EAE",
            "text": "Given the timing of year and state of the world finding a outdoor heated dining spot was a challenge.  We ended up here and man, BEST DECISION EVER!  Food was amazing with huge portions, staff was incredible and the outdoor seating was…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4Z09qZWNBEAE",
            "text": "I highly recommend Hamilton Hall. The food is amazing. I got the avocado french toast, and it was spectacular. It was hearty and filling and just enough to be satisfying without going overboard. The service is great, and they had plenty of options for whatever you are looking for. If you are in the area, it is definitely worth the visit!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHel9TMVN3EAE",
            "text": "It is a good spot for a nice, relaxed drink and meal with your friends. Music is not too loud, perfect to chat. Several options for beer and wines. Good food menu with a twist to dishes example the chicken pot pie is deconstructed. I would…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPd2NuS01REAE",
            "text": "First time coming here today after being turned down at The Grange for not having a reservation ---- this is my new favorite place! I ordered the Avocado toast (same order as The Grange) and not only is the portion bigger, it's so much better! We also ordered the chips and guac-- so much delicious guac with pico de gallo on top! The sangria was to die for!!!!! I usually steer clear of sangrias because at most places it's old fruits floating around in cheap wine --- not here!! It was delicious.  They have a downstairs outside patio that is so nice and cozy. We met the owner and he was super cool. Our server Erin was wonderful: friendly, attentive...Again, NEW FAVORITE PLACE. Please come here and see for yourself!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dWZPT3F3RRAB",
            "text": "Ordred the brunch burger (includes bacon, cheddar, egg, LTO). It arrived w/o the cheese and bacon but w/ the onion I asked to leave it. Waitress was apologetic, but came back with a burger oozing grease. Quality of the beef was simply disgusting. Took 15 minutes to get a bloody mary, which seemed strange as the place wasn't crowded."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhMHQzWElnEAE",
            "text": "Great new-ish neighborhood spot. Delicious food, great drinks, and the staff is awesome. Gavin is such a sweetheart who will make you feel like you've known him your whole life. I super recommend this place!"
        }
    ],
    "reviews_count": 74
}