{
    "name": "Harlem Breakfast Club",
    "place_id": "ChIJp04hg833wokR1NsZLEIU_D0",
    "grid": "MN10",
    "address": "2167 Adam Clayton Powell Jr Blvd, New York, NY 10027, USA",
    "rating": 4.3,
    "user_ratings_total": 192,
    "phone_number": "(646) 930-2006",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWlFWVkZVVlYzVGtGb05rSkZNM0JzVmtOa1VVRRAB",
            "text": "Y yar say open on Tuesday when yar not open now in yar not answering t he ph I ne oct28 2025 I came in yar not open at 912am"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRdFJHaGFlR3cxUkcxa2VYaEpjbmxsYTJWUFMzYxAB",
            "text": "10/10 Nice food , full of flavor"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCSVlqWjBNbkpLZFVWNldqbHBhSEUxV1RkU1NIYxAB",
            "text": "Good Morning i stopped my yesterday Saturday 10.25 @9:15am to get breakfast with hubby( his recommendation). Babes ordered Catfish/ grits (:automatically comes fried and i ordered shrimp/ grits. The cashier specifically asked me how would i like my shrimp? I said FRIED... Why did i get grilled shrimp?\nHubby wanted to go inside and fuss about the order but we had an engagement to attend.\nBoth orders came to $41.00 ( including biscuits).\nCatfish( 1 fish sliced in 2)\nShrimp 5 . Please give me your review as per my"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVlIzYzBibWhrY1ZJNVNGQjZPRlo1T1hsRk5XYxAB",
            "text": "Now this is how you serve grits\nHarlem community favorite spot\nyall better get in here!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pacE5XaDZRMlJzTWxocGRWSnlXV2N4Y1ZFMGMzYxAB",
            "text": "Those shrimp and grits…. It was worth coming here.  The BLT is made with beef bacon and that made all the difference. Legit the best BLT I had, hands down"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeVNsbHRMVTFMTm5kcFprSnZNVE5KTW1WTVlXYxAB",
            "text": "A. Ice little hidden gem in the heart of Harlem. Friendly staff, great prices and options. They even have Vegan breakfast. I will definitely be back to explore more of their menu."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SUU5XeFdhRVpIZFVaelYyMXFTMkl3WTJsWWIwRRAB",
            "text": "Delicious breakfast sandwiches! Got the Bec and a drip, perfect start to the day."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWmRWTmxRVVoxVWpOVExUQlpTRFpSTkcxTmFYYxAB",
            "text": "I am writing to share my recent experience at your café. On my first visit, I ordered the chicken wing and waffle meal for $20. Unfortunately, the waffle was doughy inside, even after a replacement. I also had to wait about 30 minutes in total, and my chicken got cold during this wait. Despite asking for some compensation, such as hot chicken, I was not offered any. I also noticed that another customer was offered complimentary biscuits when their order was delayed, which made me feel that my situation wasn’t handled as well.\n\nThe only reason I gave extra stars is because the chicken was good when it was got."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0aFVURklNSGhaWVhaS1IySk5hbEk0WVRGNWVYYxAB",
            "text": "Comfort  food  on \"10\""
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5QmVWbEdkalF6ZDI1SVh5MHlVMWhyVld4eldYYxAB",
            "text": "Take out breakfast spot. Food is worth taking a detour before work."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CV1ZEVkdOVGRRTm10Q1FtaHhRVWRYTFhKd1RFRRAB",
            "text": "I ordered corn beef hash and got the scrapings from the bottom of the pan or griddle is was fried on. My omelette came soaking/swimming in grits."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvNGMxRnFUWE5EWlV4NWVEUlJaMEZOUmtGTVVrRRAB",
            "text": "Good versions of this kind of breakfast with good quality ingredients. If you want waffles, pancakes, grits, breakfast, sausages, and a bunch of other things you will be hard pressed to find better.\n\nThe only arguable downside is that there isn’t any seating aside from one table. So most cases you’re going to take your food and go. But it’s a small price to pay for good quality breakfast at an increasingly harder to find low price. Staff is extremely sweet and friendly too.\n\nOn the restaurants website, they say that “ We're a direct reflection if WHAT Harlem is.” If that means a really enjoyable breakfast and friendly service, then I agree.\n\nHighly Recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poaVUwZHlabUV5U0d4Q1gxSjJaekpxVlZGa1ozYxAB",
            "text": "Local place for good breakfast sandwiches. They're $6 which is about the right price for a BEC from a bodega. The sandwiches are slightly better due to the quality of meat - the egg, cheese, and bread are standard fare. I highly highly recommend asking for salt and pepper; the first time I got without and was severely disappointed. I also recommend adding $2 to get a brioche bun because the airiness and sweetness of the brioche go well with the meats. For the meats, the beef bacon is way better than the turkey bacon. The beef sausage is slightly better than the turkey sausage so either works depending on your health concerns.\n\nOverall, a good place to get a breakfast sandwich better than the bodegas at the price of the bodegas."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xM1pIbGhNbkZxWlVnMFJtZEZWVTk0WVcxUWFYYxAB",
            "text": "The breakfast was good and the customer service was great!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWFFXdGhVRzE1ZGpWUFpGSlRPVGRqZFhkaVdHYxAB",
            "text": "Really fast and friendly service. Prices are on point!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xZlZqUnlWSEI1ZFRKS1ZsbFZkM2hpZG1OalExRRAB",
            "text": "Great place to have breakfast if you’re nearby (or even if you need to take a little subway ride, tbh!)! Went here on a whim because we needed breakfast and boy was it great! A little bit of wait time, but the vibes and the customer service are so worth it. Got two sausage egg and cheese sandwiches that stayed hot until I got to my destination. There’s one table outside, but don’t count on sitting there since the line goes out the door! Vegan options, no pork environment."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gd00wa3lXbmxzY0RGNFJXNUZhWE0wUjFsRlUyYxAB",
            "text": "The rarely answer their phone to put in orders the food is good but not much"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSFF6Uk5jVnBHUjFkd1kxOXZkMlUzUkhSVFpGRRAB",
            "text": "This is a takeout only place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcFRVaE1PRTkyYVMxck5HcFlaMHRLVERKbWNXYxAB",
            "text": "fireee food def stop by and everyone so nice"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ab01rMXVkMHN3VGtwWk56VlFPV1JMZUY5Q1IzYxAB",
            "text": "A hidden gem in Harlem. This establishment is definitely on the come up. Food is exceptional, and the service is warm and friendly.\nThere's no indoor seating as the idea is strictly takeaway."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWmNHNXVZblE1WjJ4TmIxVmlOMkl0VVVNeU1GRRAB",
            "text": "My new go to breakfast spot."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWb2NtWnBaMU5OUTBkcllURkdTemhTZGpjMk5HYxAB",
            "text": "I brought salmon & grits & it’s like they just threw the salmon cakes inside the grits no type of separation now when I get home to eat my salmon cakes with buried in grits & soggy"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKeFkyWnNVV0Z3U1VGMmMzbzFVamh6TW14VWJVRRAB",
            "text": "One of my favorite go-to spots hands down! The biscuits alone are worth the trip soft, buttery, and absolutely addictive. I usually get the grits with cheese, salmon, and eggs, and it’s to die for every single time. The staff is always kind and welcoming, and while it’s usually packed (a sign of how good it is), the vibe never feels rushed or chaotic.\n\nMy only wish? That they offered online ordering—it’d make the experience even better. But honestly, I don’t mind the walk. I’m literally headed there now. That’s how good it is."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUk9HSldSakZhTjNOUFdIVjRSakJoVVZWdWRIYxAB",
            "text": "Mum thought it was a sit-down restaurant but it wasn't the food was good. But not my usual best when it comes to breakfast.  Can't say I'd recommend or not everyone has different taste buds!! I didn't find it worth the money we spent"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRM09ERkJPVU5FYkZsQ1MyZEJURzB4ZW1ONFRuYxAB",
            "text": "Chicago native  here got off the plane took a bus and got lost of course the wife was hungry and saw this place There were people outside where there is a  line the place has to be good my wife had a BLT I had an egg sandwich  it smells good got into 3rd Uber and of course no eating in the car 🙅‍♀️finally got to the hotel still warm and it was banging 10 out 10 wish there was more chairs out side it started to rain while waiting for our food but that's the only complaint see you next time ✌️forgot to take pictures of the food couldn't wait 😂"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WZldtUmpiWEpLWjFSVkxVdFBjMlZEVVdkcGRHYxAB",
            "text": "Delicious food and served with a friendly attitude.  Customer service was great.  Highly recommended!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKR0xYZDJkbXhVTlZacFJ5MUlUVWxRYjNZNGRrRRAB",
            "text": "For the price I was disappointed. I ordered bacon, eggs, and a waffles (2). $35.00. We are from NC so I do know things taste different but im not sure how you can ruin bacon and eggs. My son was not a fan of the bacon. In opinion it was burnt. I'm not sure what seasoning is used for the eggs. I can't pinpoint it but simple salt and pepper works any day on eggs. They would have been good if it wasn't for the taste."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4MFpFZFZja2xOYW1vd00zWkdiMmgyV2psVVRHYxAB",
            "text": "Yes, breakfast heaven exists!  10/10 Harlem Breakfast Club.\n\nThey have the most amazing menu that give way to tender meat inside. The pancakes are so light and airy, they practically dissolve on your tongue. And the coffee? Bottomless refills delivered with genuine smiles. I leave every visit in a happy food coma!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTWRUVXRjMjkwVTIxS01WaEpRV05IVkdaTU1tYxAB",
            "text": "I have been making my way around to menu. EVERYTHING SLAPS!!!!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGc1pUbEpkbkYxY0RGcWNVOUpTbHB6ZHpWYU5tYxAB",
            "text": "21$ for salmon &grits & eggs ! They put everything together! Horrible! My salmon cakes was wet from the watery grits! They should no to separate the salmon! Not worth. 21$"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQTEd3N3JLME52Xzd3RRAB",
            "text": "Second time coming here in a month! This time I brought my friend for some corned beef hash and grits, he absolutely loved it. I got the new york BEC on texas toast and it was so good. We tried a biscuit and it was phenomenal. Will keep coming back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJel9rcGZDcmJpTUl3EAE",
            "text": "The ambiance is warm and inviting, with a perfect blend of cozy lighting and tasteful decor. The menu offers a delightful variety of dishes, each bursting with flavor and beautifully presented. Service is attentive yet unobtrusive, making the dining experience truly enjoyable. A great spot for both casual meals and special occasions."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VKckIxTjZqOGNhQUdREAE",
            "text": "This is really a kitchen with a counter where you can order food. So, The Harlem Breakfast Stand might be a more appropriate name bc there is literally no seating. This place is a good fit for locals who have a car or home where they can eat their food. The food tastes like home cooking. The staff is incredibly nice, professional, and helpful."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKREFpcmJlakliTEhBEAE",
            "text": "Delicious and satisfying breakfast food in a classic, nostalgic setting!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJZVk5ZmVrcllfcE53EAE",
            "text": "Omg, absolutely delicious!! The best breakfast we had in NYC. Top service and ingredients!\nWe love it!!  Next to the breakfast spot, there’s a guy with a watermelon punch stand — you definitely have to try it!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPeklqcjZzNnR2OTdBRRAB",
            "text": "Love it so much !!!!!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMZVo1YWVrd091R0pnEAE",
            "text": "I love this place"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLZWx1Y2VEcDVqdmt3RRAB",
            "text": "The tall, beautiful woman who took my order was so pleasant.  And my food was slamming!!!! Taste like my mama's mama made it😋🥰flavored with love.  I had the catfish and grits. Gouda in my grits and scrambled eggs with American cheese.  OMG it was soo good.  With the Sautéed onions & peppers. I can't wait to go back and try something else."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZX3UzVG1RRRAB",
            "text": "Desayuno auténtico americano en pleno Harlem. Pedí el Daily Meal por 10 dólares y estuvo riquísimo: buena cantidad, buen sabor y muy buena relación calidad-precio. Un sitio sencillo pero con mucha esencia. Recomendado si buscas una experiencia local y sabrosa."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZM3R5OG9RRRAB",
            "text": "Harlem breakfast clubs is one of those hidden gems you find out about while googling “pancakes” near by.\n\nI was just leaving my studio and wanted to get some good pancakes and they did not disappoint. I got the platter with beef bacon and over easy eggs.\n\nI wanted to try the wings and the catfish but they were out so they gave me shrimp\nInstead.\n\nThat just means I have to keep going back to try things though so I’m not mad at that.\n\nAlso I saw nothing but black folks in that establishment which I’m happy about and love supporting so here’s to keep going.\n\nFood was a 10/10\nCustomer service 10/10\nVibes 10/10"
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaUw2NUxBEAE",
            "text": "Merci pour votre accueil et votre sourire\nNous nous sommes régalés - sandwich breakfast Harlem » » » »\net on a même conseillé à des touristes français après la messe du dimanche de venir chez vous.\n\nOn en rigole encore - mais\nOn a pas encore compris vos voisins qui buvaient du champagne devant votre restaurant à 9h30 du matin mais très sympas aussi 😗\n\nBonne continuation et longue vie à vous\n\nLes frenchy"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvamRyQ2VREAE",
            "text": "Enjoyed breakfast here every day of our trip! Delicious with wonderful, kind, attentive  service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdkpQVjVnRRAB",
            "text": "Solid place for breakfast.  Everything is cooked to order and portions are sized well."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdFBUdjFRRRAB",
            "text": "Great breakfast 😋"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdGJfRThnRRAB",
            "text": "Unfortunately, I will never eat from this place again! I ordered two waffles with chicken for the first time, and I spent a good amount for each order. The chicken was hard and dried out!! I called and spoke to a gentleman who stated,…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJX2NhWWx3RRAB",
            "text": "I like honesty, person that took my order. Told me 15 minutes and that’s a plus for me! My food was cooked, hot and fresh! Food was hot even after a 10 minute drive home. Catfish was on point and tasty! Just remember seating is limited."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJanJqaTZ3RRAB",
            "text": "I came by here after seeing decent reviews and ordered the French toast as soon as I arrived and noticed the slight harsh tone in the cashier’s voice I decided to add eggs and bacon, and he asked me what kind of bacon so I said regular bacon response in the similar harsh tone saying “we don’t serve pork bacon, bro” ok, how about telling me the options? I’m mistakenly let it slide. I just want some food and unfortunately, the food is not that great either the bread taste still it was hardly any eggs. The bacon was the only decent part of the area and I could hardly enjoy that."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJazVPVW5RRRAB",
            "text": "Yesterday was my first time actually being able to get a bite to eat from this spot. I live in Harlem but not to close. I decided to walk back from the YMCA after missing the bus and I’m glad I did.\n\nThis was the best bacon egg and cheese sandwich I ever had. I also loved that I didn’t have to have comprise on cross contamination from pork. They don’t serve it at all, so no worries there.\n\nThe young lady at the front was so friendly and nice which is rare in customer service nowadays.\n\nI plan to go back and try something different very soon.\n\nThey don’t have any dine in options, but I actually think that works for them. I won’t give  less stars because of that.\n\nAnyway , I wonder what I should try next?"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMGRUUWdBRRAB",
            "text": "First time eating here and maybe I did not order the right things. First off, the wait was too long for a basic breakfast for two people. The order was scrambled eggs, 1 turkey sausage, 5 pieces of turkey bacon and home fries. The home fries were overcooked and hard.  I guess if I went earlier in the morning, the food would have been better. The people are very nice though."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cF9pOHdRRRAB",
            "text": "Good place for breakfast food is fresh and healthy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcUtuWC1nRRAB",
            "text": "One morning, I really had a taste for some fish and grits and for some reason was suffering from extreme brain fog. I couldn't think of any place to go off the top of my head.\n\nI just so happened to drive by and look up at the right moment and spotted the Harlem Breakfast Club. Now, to be honest I drive by a few times a week and never saw it before. When you are always driving sometimes you catch things but more often than not you miss things.\n\nI was glad they caught my eye. I made a U-turn, double parked and ran in. On that day, I got catfish, cheese grits with a cold press watermelon juice. The following week, I was back and ordered salmon cakes and cheese grits. Both times the food was great, I didn't snap picks of my first order but it had me return so that should tell you it was enjoyed.\n\nWith a small square footage, there is no dine in option. All orders are made to-go. Staff and service are friendly and quick. If there happens to be a delay, you might be lucky enough to snag a seat while you wait.\n\nNot an everyday option, but definitely will be in rotation when I am missing my mom's breakfast and can't jump on flight to see her fast enough.\n\nJust A Note:\n\nClosed on Mondays.\nOpens @ 7am Tues-Sun"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcy1mOGZBEAE",
            "text": "This morning my husband and i ordered shrimps and grits and it was atrocious. The shrimp was overly seasoned with peppers. The grits was not good at all. My eggs taste like they were cooked in the same pan as an omelette. Ridiculous. I’m very disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNudnRnVxAB",
            "text": "I loved Harlem, but the thing I probably loved the most were my breakfasts at Harlem Breakfast Club. A simple place, probably not very touristy, but that's maybe why I chose it, but where I had the opportunity to change my breakfast every day, because everything was a delicious discovery. Every night I hoped that the next morning it wouldn't rain, to go there, take my little table outside and enjoy the beginning of my day."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dmN1YUlBEAE",
            "text": "The food is amazingggg here especially their breakfast sandwiches! Food is decently priced, the workers are friendly, it’s a good spot. My only qualm is that it’s a small storefront so you may end up waiting outside which sucks in the winter"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNld29fRTFRRRAB",
            "text": "OK so a Harlem based breakfast all day joint that's only serving takeaway? Food prepared in your face and you're on your way? With the density of folks in Harlem and the dearth of breakfast spots (there's lots of brunch places but not a whole lot of breakfast spots - you're limited to IHOP (and now just one in all of Harlem), Jimbos, and a scattering of other joints competing with bodegas) - this sounds like a slam dunk, home run winner.\n\nAh, but not so fast.\n\nNot sure when Harlem Breakfast Club opened, but it appears there is room to grow in order to claim the top spot for breakfast in Harlem.\n\nThe Good - prices are borderline reasonable ($12 (before tax/tip) for basic pancakes, eggs, and choice of meat). The food is prepared when you order (it's not sitting around). Real butter (not margarine) is served with your food.\n\nIn my opinion, there is definite room for improvement and growth. My order came with one piece of sausage (cut in two so it looked like two sausages) and one egg (I asked for it scrambled with cheese). Use links so you can give two - instead of cutting up one patty. For my eggs, I think they only used half a slice of cheese (American) because I noticed the lack of cheese in my eggs. Up your cheese game. Restaurant grade syrup (AKA flavored Corn Syrup) was shared as standard - there was no option for pure maple syrup (which I would have paid extra for).\n\nAnother item to improve is the takeaway utensils. If you're ONLY takeout, then invest in finding quality utensils not just the basic run of the mill fork/knife situation. There's another place in Harlem I get delicious meals from (not breakfast) - and they have amazing takeaway utensils (especially forks). I'll include a photo with this review.\n\nThe menu could use more details - how do we know which types of meat and/or sides you have to order with the entrees? If I have to ask the hostess taking orders about the menu, that takes time away from me being able to make my selections - if there's a line, that will just make the wait longer. Post all the potential entrees and side options on your menu so folks can make their decision before they get to the counter.\n\nMost importantly (in terms of areas to improve), the pancakes were dense and doughy. They were heavy when I got them which is a sign - but I've had heavy pancakes that are absolutely delicious (not often, but it can be done). Pancakes can be heavy and cakey delicious - but most often heavy pancakes are dense and doughy. They require lots of syrup to be good in your mouth. That was my experience with Harlem Breakfast Club. My pancake order came with three but I was quickly filled up with just one - that's how dense and how much syrup it required.\n\nFrom the time I placed my order and paid until the time the food was handed to me ready to go was almost 15 minutes - I think that's a long time to cook some pancakes, eggs, and sausage (which I can do in my home faster). Please find ways to be more efficient so that orders can be processed, cooked, and given to the customer faster.\n\nAll in all, my experience was OK. I'll probably come back again to try the Harlem Scramble - which does sound good. The $5 BEC could be a hit with the prices of inflation (especially if that includes turkey bacon). Tweak the pancake batter recipe, offer some real syrup options, upgrade the plastic utensils, and streamline the process to speed up cooking and providing completed orders to customers - oh and add more cheese to the egg orders - and Harlem Breakfast Club might be on to something."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlMGRTQjl3RRAB",
            "text": "UPDATE 10/14/2022: I called in Catfish & grits. The music made it hard to hear the young lady but she made sure to repeat the order back to me. She said that it would be ready in 10 mins and it was.\nThe food remained hot until I reached home about 12 minutes after pick up. The grits had a nice flavor of their own and the fish was tasty. I don't use a lot of salt, so the fish could use a bit less, for me. This was definitely better than my first experience.\nCost: $15 + tax = $16 CASH; STARS: food 4, service 4, atmosphere 3\n\nOriginal 10/11/2022: SMALL take out only. Bacon, egg, and cheese. Beef bacon (costs more?) and turkey bacon available. My sandwich was put together with care.\n$5 BEC cost $7, including the small \"free\" cup of the last of the pot coffee.\nSTARS: food 3, service 3, atmosphere 3"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1LS1HODBnRRAB",
            "text": "They just opened and don’t have a set schedule bad for Business. I had to come back later on around 9am on a Sunday. Soo the food , pancakes are way to big almost bigger then the bowl smh, I got banana nut pancakes wasn’t bad at all  .. eggs was over cooked , the chef cooked the eggs 1st 😳 noo good eggs go last because they cook so quickly..I got 2 lil syrups for these 3huge pancakes.. ima go back n try the grits n salmon cakes after that I may be done .. okay I came back to try the salmon cakes and grits .. 3 little DRY salmon cakes for 15$. The young girl who worked there said well hey u get 3 and it’s real salmon. I would of probably been satisfied if the salmon cakes wasn’t so dry ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROLU4zdXpnRRAB",
            "text": "Nice for some breakfast/brunch on the go. The food is really good with plenty of options. The customer service is very welcoming. This place feels like home with its comforting hospitality. The food only took about 7-8 minutes for a walk in order. I’m impressed. & I’ll definitely be visiting again thank you for a warm welcome to “Harlem” Harlem Breakfast Club."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROdW9qNkRBEAE",
            "text": "I had to write a review because my breakfast was sooooo good! This was my first time here the service was excellent and the food was delicious. Definitely a great place to pick up a quick and YUMMY bite to eat. Will definitely be back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMjRlRTlBRRAB",
            "text": "I had the salmon cakes w/grits for the first time today. My dad had the BLT with two fried eggs... We loved the food! The staff was also very nice. It's small so you can't eat in. Hopefully there will be a second location with the option to eat in. But I was very happy. The prices were good too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKNmNpSnZRRRAB",
            "text": "Friendly service, fast and delicious food. We had the pancakes with beef bacon, and fried wings with hot sauce. Perfectly made. Enjoyed our food from our laps while sitting in the 2 chairs out front, drinking juice, watching the passersby. Very pleasant morning stop."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRck1fUmd3RRAB",
            "text": "This is my third time coming to restaurant and sad to say I'm highly disappointed and unsatisfied. First two times I ordered salmon cakes with grits and when I receive my order, the grits was like drinking soup. Third time I order salmon, cakes, egg, and cheese, and home fries. when I get the order is in a small bowl in a bowl is not full. This is like a kids meal. Is bad enough. They charge $12 for the salmon patties. To add eggs in the home fries now the order is $25. I never had a problem with paying for what I want or would a person charge but to get less than a fulfilling meal is a very big insult. For all this I could've went to the container store or the Spanish restaurant. Where they will give A healthy proportion of food for your money. I'm off of supporting the peoples, but I will not be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtMnVHcFZREAE",
            "text": "I went for the first time and got me Sautéed Shrimps with cheesy grits. I’ve been meaning to try this for a while and it was good. The was well seasoned and the grits was creamy. I had no issues. Only concern was that it was kind’ve pricy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOaW8yR2ZnEAE",
            "text": "It’s the perfect place for breakfast. Even when you order something that’s not on the menu, they got you covered. Shout out to the chef and the young lady who computed my order.\nI ordered Home fries, western omelet with bacon and toast. Washed it down with some OJ. Thanks it was worth every penny❤️"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURldjhQNzJRRRAB",
            "text": "this place is lovely! tasty omelettes & huge fluffy pancakes. they’re quick, convenient, & affordable if you’re in the neighborhood. I don’t think they serve pork, but the turkey bacon slapssss. Definitely will be going back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtdW9xT3l3RRAB",
            "text": "Great food for the price. The SEC is a little small,  but it's only $5. I've always had exceptional service here and the food is ready pretty quickly.  Not the place to eat if you want a sit down meal, I usually order ahead and walk my dog down to go pick it up. I like this spot, it reminds me of  \"New York City \" and we're lucky to have it in our neighborhood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4XzhtcXZRRRAB",
            "text": "Breakfast GEM! Wonderful service. The Harlem Scramble with chicken sausage made my taste buds dance. I can't wait to get it again. Thank you for making my week!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzelpPZTJRRRAB",
            "text": "I am ALL about supporting small black businesses but I will NEVER return here! The food has NO flavor and is WAY too expensive! You'd be BETTER off going to Jimbos, Honestly! These tiny flavorless salmon cakes, rubber like patty sausage, watery grits and they don't even ask you HOW you like your eggs, they just fry it like it's on a sandwich and over cook them to top it off! I asked for egg whites and couldn't tell what they were! I ate 2-3 bites and couldn't do it! What a waste! I called the restaurant and spoke to a young lady named \"Chevy\" who NEVER put the Manager on the phone, as I asked when I FIRST called! I explained EVERYTHING wrong with my Husbands and my order. She asked me how she could make it right, I told her when I bring the food back we can figure it out. I called back in less than two minutes to catch the young lady's name and speaking to her a second time around was like speaking to a new person. She proceeded to tell me NOW, that she spoke to the chef and he insisted he added YELLOW cheese to the grits, when all we seen was a bunch watery WHITE grits! She then said they cannot take the food back or give us our money back because THEY make the food how THEY make it for $50. We could have waited for SYLVIA'S to open and ate REAL salmon cakes at a REAL restaurant for that price! It's NOT about the money because my Husband & I LOVE to try new places to eat, when I'm not in the mood to cook. And I cook COOK! That's Our Thing!. I am SUPER disappointed! The food is flavorless, thrown together, missing ingredients, the service is horrible, there is NO Higher Management available when needed and if so, they will HIDE & NOT take accountability or proper action for dissatisfied customers and they are charging SEATED prices for a HOLE IN THE WALL! Dont waste a moment of your Life, especially if you're a TRUE FOOD CONNOISSEUR! TRUST ME! I'd give ZERO stars if Google allowed it."
        }
    ],
    "reviews_count": 68
}