{
    "name": "Archer & Goat",
    "place_id": "ChIJgTJM-BH2wokRQ_fz8X-eFpY",
    "grid": "MN10",
    "address": "187 Malcolm X Blvd, New York, NY 10026, USA",
    "rating": 4.5,
    "user_ratings_total": 393,
    "phone_number": "(917) 261-6602",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWVlkwUmxOV0V0VDBWeE1FNUNOa0pwYjFOUWRuYxAB",
            "text": "This was my second visit to the restaurant and honestly will be my last. Both times I sat at the bar for a drink and was treated rudely as if it was a burden to be there.  The countertop was dirty (food droppings) from the prior guest and when asked if he could wipe/clean the counter the bartender just brushed off the food as if it was another burden. The counter remained dirty and he didn't care.  Honestly if you don't want to be there or work there - then don't!  I will not give this place my business and they should learn some simple manners, welcome guests and treat with respect.\nObviously, they don't care !"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213NVUyeHBOVlJuT1doclQydFFaRFo0ZGpCUGNWRRAB",
            "text": "Literally the worst in terms of service. Admittedly not a regular. Went a couple of months ago and the bartender greeted us with a complaint. Gave it another chance tonight. Walked in to order 2 glasses of wine. We were greeted with “we’re done” no….we requested 2 glasses of wine and said we will be quick. Asked the same bartender to wipe the bar which was full of crumbs and food from previous customers. He took a menu and swiped it. Didn’t clear it. Honestly disgusting service. My mother waited tables for 50 years and my husbands father was a bartender was fo 60 years. Second time we’ve come in an been treated like shit by this guy. He’s in the WRONG business. Never going back. HORRIBLE"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMlNYZHBOMjFyYjNKV1ZFNWZlblpUTW10WU9GRRAB",
            "text": "Cuisine is different and AMAZING! Drinks are delicious and creative. Service is EXCELLENT! Friendly staff and owners are always so gracious and inviting. Servers are amazing. Highly recommend."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTFZVUk9NRzVJTm5wRFdYYzFjbXRrUVUxdGIzYxAB",
            "text": "Sometimes a restaurant excels at one thing over another whether that be food, service, ambiance. The Archer & Goat does all these things well! It's an exceptional establishment, one that you would expect from a restaurant. My wife and I visited on a Sunday late afternoon and we sat in the garden section. They have outdoor seating in front as well as the garden. Make reservations regardless. We were greeted as if we were VIP and that service kept up throughout our dinner. Prices are reasonable. The food was delicious! Great place to hang with friends or for date night. Plenty of parking in the area. Highly recommended"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVWNsWjRMVlo2TjJkb2FWSTFhbE5ZZURCQloyYxAB",
            "text": "Nice spot in Harlem. Food and drink were on point. I will return."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLV1Q4OGZBcVo3RlV3EAE",
            "text": "One of my favorite places in Harlem. Food is always extremely high quality and delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taNWFrSk1ZVzFRUzFkMU5YRnFVVVY2UzNGSmFuYxAB",
            "text": "Had my birthday party in the garden there and everything was fantastic! Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CWU5VaElNekpYT1dKNVJYRTJlV3RzY1RSbFYxRRAB",
            "text": "Great food. Would really recommend their carne asade steak"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNM2FYSlVhV3BaVEdGa1R6ZENiMDAyTmtOcVdYYxAB",
            "text": "Visiting some local friends and they insisted we let them bring us here. The moment we arrived I knew we were in for something special. The space is warm and modern. I loved the back patio for outdoor feel with greenery and nice lighting. Staff were excellent and welcoming, all stopping by to make sure our experience was immaculate through the evening. We started with fries and the sofrito ketchup, and I sincerely regret not buying some for back home. DON'T SLEEP ON THE SOFRITO KETCHUP. I enjoyed the Teal off the cocktail menu which perfectly merged the smokey/strong of the mezcal with lighter citrus notes. My dinner was the rogan josh which expertly pairs the softer and milder noodles and braised lamb with sharp sauces and spices for a well-rounded meal. Tried my partner's carne asada which put several other well-regarded restaurants I'll not name to shame. Our host shared a bit of their shrimp curry and it didn't impress any less. Our hosts insisted on the date cake, which is not always a flavor I personally prefer, but will be my go-to dessert when we visit again. DECADENCE! Thank you, A&G staff."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGd2RWWkdOR1ppYUZWcFR6SkNOMUJLV0VGV2VuYxAB",
            "text": "H-O-L-Y C-O-W if you have  have not tried this place you ABSOLUTELY need to put it on your radar. I had the carne Asada, Brussel sprouts & Tres Leche Panna Cotta. I'm not one to take a picture of my food mut after I quickly devoured it I regretted it. So here's my dessert. I will be back next week for the last summer streets."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205blJIb3ljVlZaUnkxQ1ZXNU5YekJZTkVaMmRVRRAB",
            "text": "The food was good, the owner was kind of rude but I let that slide because maybe he was having a bad day, it was kind of hot that day.\n\nBut the food was good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SM1NXdDNibVp3ZW5WRmVsUXdRMGhZTXpCeVIzYxAB",
            "text": "In a location that was extremely empty the host put way too much focus on us having reservations.  The staff just seem so caught up with themselves over checking in with guests"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2padGVraG5TMGRNVkcxM2FscHJURzFhWWtOcVFuYxAB",
            "text": "Visited on the 4th of July for dinner.  The back garden is beautiful. The service was excellent, friendly and attentive plus the music was good. Dinner was perfect.  The drinks were very refreshing, Crispy Brussels Sprouts, the Lamb, and the Key Lime Tart was all quite delicious.  Hope to go back soon!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wNlFUWk5VWGMwWVdaWVJuVk9la1ZIUm5nNWJrRRAB",
            "text": "A NYC gem. Every dish delivers on flavor. Amazing service and atmosphere. Highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xQ2VrbzNTRkJFU3pKcWFGcEdWMjlFZW1aeVpGRRAB",
            "text": "Great spot to chill for a bit cute little backyard you can enjoy Drinks"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRVJHbExka2xyWDBwNE5sZENWVmRrUzE5cWQwRRAB",
            "text": "3 of us had the price fix menu. We made a reservation. Everything was delicious. Cocktails excellent.  Apps, main dish and Date cake with bourbon Carmel and lime tart so good. Highly recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjMGRHWktUMnBsTFZsNFNtVXRSMUV4UkZoWlQwRRAB",
            "text": "Beautiful restaurant with immaculate vibes and service! Totally scrumptious and unique food to boot."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNLW10ZVR1ejl5OXN3RRAB",
            "text": "Food was delicious!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJMmJqdkxtX19qXzN3RRAB",
            "text": "One of the more upscale options in this neighborhood. Food is diverse."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaGItb3p3RRAB",
            "text": "Totally innovative and the flavors despite being entirely novel works together. The lamb rib was just fantastic!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNnNlbVl3EAE",
            "text": "Friendly wait staff, delicious creative food and cocktails, great vegetarian options, reasonable prices, lovely back yard, diverse crowd, good music."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaGRqc3BBRRAB",
            "text": "I had my sister's bridal shower here and I couldn't have chosen a better place to have it! The food was fabulous, the back garden was beautiful, and the service couldn't be better. Our server, Tomas, waited on us hand and foot, checking in every few minutes to be sure everything was perfect. The pricing got us a private area in the garden and a delicious menu. Will absolutely be back for more on a more low-key occasion 💙 Thank you Archer & Goat!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbGU3ZFJ3EAE",
            "text": "I had a great experience with 2 of my friends dining at Archer & Goat in Harlem. Service was questionable 😂but the food was flavourful. We loved the brussel sprouts, the mint salad, the arepas and the lime pie."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMXNuOFVnEAE",
            "text": "Easily one of the best restaurants in NYC, and at the very top of Harlem. I’ve been here a dozen times over the past year or so, and should have reviewed it sooner. The food is excellent, a blend of Venezuelan and Indian influence. There’s a dish for everyone, with some American dishes as well. I particularly love the brunch service where they make lamb hash, and the fried chicken with pickled strawberries is among the best fried chicken sandwiches in the city. $25 bottomless brunch is a safe bet, and finally the service is just so good - going here feels like you’re among family. The host that seats you also serves tables, and they’re among the friendliest, kindest I’ve met in the city. My wife and I look for any excuse to come here - if you haven’t been, GO!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbjRPNXB3RRAB",
            "text": "My mother and I enjoyed our first visit so much, that we came back for a second time, only one week later. This time we brought my son and truly enjoyed ourselves. How wonderful the service, flavors and ambiance. Will be back soon!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeU4tX2tBRRAB",
            "text": "Food was okay; not great but the menu prices suggest great. Not worth it."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3a0tqR3lBRRAB",
            "text": "Great place to eat"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRM05McmlnRRAB",
            "text": "The Best!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbS1lSElnEAE",
            "text": "A NEIGHBORHOOD GEM !!\nDelightful food, refined cuisine and small curated wine list ! Absolutely recommend!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnaTdYTnJBRRAB",
            "text": "I had a great brunch here over the holiday weekend and was glad I visited this gem. The food was excellent (so much so that I forgot to take pictures), the vibe was fun, and the staff made the experience. Highly recommend!!!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubTliT3ZBRRAB",
            "text": "Celebrating a friends birthday we were a group of maybe 20/25 people . We were seated in the quaint back patio area and it was so charming. The drinks were superb , a must try is the archer it was simply perfect. Roasted chick peas and crispy Brussels sprouts were a party in your mouth with the flavor profiles. The slider was delightful , a perfect bite size portion , crispy pickle . I could go on forever . I will definitely be back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBc1ktMnVRRRAB",
            "text": "Great music, service and food!! Can't wait to go back. Highly recommend the Brussel sprouts!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBOXFpd09REAE",
            "text": "It was unsanitary. I don't think it was right to store desert uncovered in a fridge. The knife was dirty. Also, the waiter kept being flirty and it was not welcomed."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfaC1PdWdRRRAB",
            "text": "Went here with my girls for Brunch. This place was pretty underwhelming and the water got my eggs wrong and brought me the same plate twice. He also seemed totally baked. Poached eggs and scrambled eggs look very different. Meanwhile, the other waiter slipped me a freaking note saying he thought I was hot and he and his partner were in a poly relationship with his phone number. This place has a lot going on but i don't think decent food and drink is really it. Also pretty weird there is no signage outside so it was hard to find. Its very small inside so beware."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOGFheDZ3RRAB",
            "text": "Didn't get seated until more than 30 minutes after reservation time.  On top of that, the service was pretty slow and difficult to flag anyone down.  Food was pretty good though (besides the unflavored tostones), but definitely at a higher price level."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcXNiWG1BRRAB",
            "text": "Can’t say enough good things about everything!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQbnVtNEFnEAE",
            "text": "We had Sunday brunch for our daughter‘s birthday here. It was excellent. The chicken sandwich was phenomenal, I don’t think I’ve ever had better. And the lamb hash was also special."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNTlpQWJ3EAE",
            "text": "I was looking for a restaurant in Harlem to celebrate my friends birthday. Well, Well i stumbled upon the Great “ Archer and Goat” on 187 Malcom X- Lenox Avenue. The food, the service and ambiance is magnificent ! I had the Lamb rib dish, my friend had the Duck dish, along with the tumeric and orange tequila cocktail and my friend had the Naz. Just plain wonderful, shout out to, the fabulous Tomas, the owners family member, whose hospitality was excellent. And Natasha who was our main waiter, knowledgeable, professional, kind and sweet, from beginning to the end. Please go to Archer and the goat,  you will feel more than joyful and happy you tried this restaurant."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzczhHN2hnRRAB",
            "text": "Amazing little spot for a date night! I recently moved to the area and was looking for a nicer spot for a date night. Their dinner prix fixe menu was the perfect amount of food and allowed me to try so many of their dishes. Everything was so flavorful! On top of this the drinks were super creative and delicious. Will definitely be coming back in the future."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYM3FmNEx3EAE",
            "text": "We been here for 2nd time ! And the reason is simple good food , good drinks and really good people ! If you looking for a place to make you forget your stressful week then this is the place. We had a reservation in a really busy Sunday for them. So we chose to seat at the bar and it was a really good choice. Daniel was our bartender and he was very good ! Thank you guys we will be back soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYNXE2VE5BEAE",
            "text": "Love the music a bit loud but goes well with the ambiance. Art work is pretty cool as well.\n\nEnded up getting the arepas with hanger steak, chicken sandwich, and burger. The burger was special with the sofrito and onions. Awesome place and good service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMjY2dVd3EAE",
            "text": "One of the best places in Harlem ! Love the food and the drinks. Friendly people make you feel comfortable and enjoy your meal. We tried 4 plates and each one was better than the next. I really enjoy the duck and the portobellos. But to be honest I cannot said what from the 4 plates was the winner . Thank you and we will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuMGNURy13RRAB",
            "text": "Food is amazing, especially the skillet lamb hash which had the perfect balance of spice, flavor, and texture. Would highly recommend for brunch!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURub01lSlJBEAE",
            "text": "Good food and drinks! The service is okay; depends on the waiter! They’re usually super busy. I’d go back though!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNudllldjdBRRAB",
            "text": "Tómas turned a sad night into a happy one. Great customer service 🤍🙂‍↕️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNueE96cXBnRRAB",
            "text": "My favorite restaurant in Harlem. The flavors are complex and still balanced. Nothing is too spicy or too sweet or too sour. All of the innovation is in combinations that in hindsight you should've been doing all along. Rice loves turmeric. Pasta loves saffron. Brussels sprouts love chimichurri. Lamb loves a balance rather than a punch of spices.\n\nI will probably go to this place far too often, but that's my curse in life. My recommendation is to at least get the brussels sprouts, the corn and coconut soup, the shrimp curry, and/or the lamb ribs. Actually, I recommend everything, but I know if you're reading this you're rapidly going through your phone needing someone to make a decision for you.\n\nI got you boo: brussels sprouts for the table (arepas too if 4). You get the shrimp curry. Finish with the key lime tart."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbGY3QXVRRRAB",
            "text": "Don’t have enough good things to say about Archer & The Goat! The vibes are always on point (cute bar, indoor and outdoor seating including a backyard patio), friendly and helpful service (they were able to accommodate dietary restrictions due to allergies with ease and kindness), and AMAZING food and drinks. Honestly I have never had a cocktail here because the NA options/mocktails are too good for me to resist :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIMDhDM3BnRRAB",
            "text": "I looooved this place. I went for brunch yesterday the lamb skillet was so flavorful, the cocktails excellent (usually a lot of restaurants skimp on the booze) I was happy and tipsy. And the staff is just so lovely. I’m sometimes annoying and picky and they didn’t make me feel like a burden at all. So much love!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNId1B2LXJRRRAB",
            "text": "Went during restaurant week, food and service were spot on"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3NThXaGpRRRAB",
            "text": "The breakfast arepa was incredible!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6OEktQk5nEAE",
            "text": "We were the second party to be seated right after they opened for the day. The owner wasn’t very welcoming and the server initially seemed to follow lead. The server became more pleasant later on. They must have been stressed by the inclement weather (rain) and an event that they were hosting.\n\nAny way, I’m glad that we weren’t deterred from dining there. The food was extremely delicious and the drinks were delightful (a bit heavy on the ice though). The decor and atmosphere were nice, too. Did I mention that the food was yummy? Like so good!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaM3JPbDZnRRAB",
            "text": "Can I give this place six stars for service? Zachary (my server) and Tomas were amazing. I have had a hard go of things after being run over by an SUV. This restaurant is my bright light as it is close enough to my house that I can be wheeled there. They were so nice and kind and made sure I was very comfortable. They remember me each time I come to dine and ensure everything is perfect.\n\nAside from that, this is one place where I don't have to ask for extra seasoning or spices. The flavors are full-on delicious. I'm so glad I found this restaurant that has a fusion of delicious flavors. Everything I've tasted is absolutely fab."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbnVfMWhRRRAB",
            "text": "Last Sunday, we decided to give this nearby brunch spot a shot. It's conveniently close to our apartment, and we've been curious about it for a while. I wish I could give a more positive review, especially considering it's a local joint, but truth be told, the food left much to be desired and felt quite pricey. Even the smallest glass of orange juice set us back $6. I opted for the hot chicken sandwich and fries at $25, but it didn't really stand out, and the combination of spicy and strawberry flavors didn't quite hit the mark for us. My boyfriend went for the breakfast arepas priced at $29, and while flavorful, it didn't feel like a worthy splurge, but given all the other options on the menu, this was the best we could do. The spiced French toast, coming in at $22, had a nice texture but leaned heavily on the sweet side and we were just not impressed. I must say, the service was pleasant, which was a plus, but the food itself could definitely use some improvement. Regrettably, I wouldn't recommend this spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNybWViWVlBEAE",
            "text": "Our friend is ultra VIP here, so we enjoyed a delicious array of tasty brunch dishes. Creativity-wise, A&G is better than 95% of the boring, overpriced egg brunch spots south of 125th St--but don't tell the plebs that.\n\n- Chicken Vindaloo Arepas: Spiced, seasoned and flavorful. Don't skip these.\n\n- Langostino & Saffron Pappardelle: Off the dinner menu but available for brunch too. If you like your noodz long, thick and slurpy, get this.\n\n- A&G Hot Chicken Sandwich & French Fries: The sauce was a bit too sour-sweet for me, but some people love that flavor profile. Those people will likely love this. Also, pickled strawberries. See what I mean about creativity?\n\n- Breakfast Arepas: Classic yet new--hanger steak, cilantro hollandaise and poached organic eggs but with so much more flavor than Euro-leaning restaurants. I'd eat this every day if I could.\n\n- Skillet Lamb Hash: More pulled lamb than ground lamb, but mixed with those potatoes, peppers and onions, and you'll be baaaaah-ing with pleasure.\n\nLibation-wise, you'll find some unique mocktail AND cocktail creations to suit every palate. The Fig mocktail, for instance, was warm and sweet without being overpowering, while the Guava Mocktail brought the tangy ginger on, and the Hibiscus Ginger mocktail nicely balanced tang with floral notes.\n\nSouth Asian-LatAm fusion FTW!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybUpXZmh3RRAB",
            "text": "This place was such a hidden gem!\n\nGood:\n- Unique dishes, the seafood pappardelle was really good and tasty\n- Ambiance was nice, super clean and intimate\n- The artichoke was good, nice texture!\n\nBad:\n- Service took a while, food came out slowly\n- A little expensive\n\nOverall this place was a good find!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlNUxXT2RREAE",
            "text": "From start to finish this place was great. At first we couldn’t find the restaurant but once we did it was awesome. It’s a quaint, adorable, cozy spot with a little back patio. We hoped to sit in the back but the weather was not great so we…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXaUpiR1hnEAE",
            "text": "This is one place that is worth making the trip for. You will not be disappointed! The spicy chicken sandwich with balsamic strawberries was incredible. French toast with rose whipped cream was incredible. It wasn't my order, so I had to ask for a little side of the crea, delicious. Bottomless mimosas for the table for an hour (or so) was a lot of fun and was worth it if everyone was going to have 2 drinks anyway. Easy to get to by train. The staff were super friendly and made some helpful suggestions as we were ordering. Very cozy spot. Loved it!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1cE1MQ3p3RRAB",
            "text": "This was a great spot. Small good menu, good and filling options. Pictured is the hot chicken and the Lamb and potato skillet. Price on average was 20-30 per plate. The service was friendly and the local felt trendy but also cosy. Would come here again to try their other menu (we did brunch)."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKMWRXZ1lBEAE",
            "text": "We went to this restaurant today for brunch and I felt compelled to write a review because of how good our meal was. Our food was absolutely perfect, each bite was an explosion of flavors. Seasoning was perfection. The texture of the arepas was great! I was shocked because the meal was incredible, much better than any of the brunches we got in the area for a similar price point. Decoration was also beautiful and our waitress very kind and attentive. This place is a gem, highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSN19DMERBEAE",
            "text": "Outdoor, indoor, and garden seating. The inside is tight, but comfortable and there is plenty of outdoor seating.\n\nService was quick and there was always someone to ask for assistance. Food and drinks came out in a timely manner.\n\nFood: French toast was good, but I suggest you get the toppings on the side if you don’t like sweet food because it is a lot. Breakfast Arepas was also good. Fries are delicious. I wouldn’t recommend the A&G Hot Chicken Sandwich. Just wasn’t good.\n\nDon’t get the A&G hot chicken sandwich."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dXJxeUtREAE",
            "text": "Great service by Tomas. I really enjoyed how the menu mixes middle eastern and Hispanic cuisine. Cocktails on point, they can make them into mocktails too. Standouts include: Carne Asada, roasted cauliflower, arugula salad with Chicken (a must) so tender and delicious. Come and support this family business!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNleXZMUzRBRRAB",
            "text": "Great place for brunch with friends.  Got a reservation for outside as we had a doggie in tow, awesome that they provided a water bowl for the doggie to chill off.  And super understanding when our puppy had a bit too much energy and spilled over waters.\n\nOrdered the A&G Hot Chicken Sandwich & French fries, Skillet Lamb Hash and Spiced French Toast.  Split between three people.\n\nNot disappointed and all were tasty.  More than enough for us three and also had the bottomless mimosas.  I'd be back w/o doggie to have a more enjoyable experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtOFBXNWt3RRAB",
            "text": "Excellent food and flavors. For brunch, got the chicken sandwich, which was spicy (and salty) - creative and delicious. Fries were PERFECT. Added an egg on top, cooked perfect. The lamb hash was also delicious, eggs perfect again and filling. Chai tea filled with spices. Service was very friendly and the offering of a clean blanket to stay warm outside is a memorable, thoughtful touch. Highly recommended. Will be back to try more. Make a reservation."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXNjh2VEtnEAE",
            "text": "Visited on 04/03/2022 and really enjoyed the place. The decor is cool, and so is the layout considering how tight it is.. Food was delicious, and drinks were on point.\n\nI will definitely return to try some other dishes as they looked delicious as well!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSMmVISmZnEAE",
            "text": "Great brunch spot! The options were fantastic and all sounded so good we had to get almost everything! Definitely can recommend 👍"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXNl9pUzNnRRAB",
            "text": "My first time attending this place. We went for brunch. Thedrink selection was great. I had a GOAT and an archer cocktail and both were good. The brunch menu was great too. Had the hanger steak with arepas and eggs. Also the French toast…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNadXJXX3JRRRAB",
            "text": "Came to this place on a whim after lunch. Honestly, wasn’t looking to go in the first place, but was really drawn in by the decor, and the unique name. I mean an archer and a goat sounds pretty cool. And while you shouldn’t judge a book by its cover, this one was pretty good, and I wasn’t disappointed. Cocktails were reasonably priced with front and back patio, seating, and ample space inside. Everything was clean and tidy. Staff were friendly and made great conversation."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6dnR2X0FREAE",
            "text": "The food, atmosphere and service is amazing. I love everything about this restaurant. The Curry Shrimp and Date Cake is a must."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHZ1luYnd3RRAB",
            "text": "I don’t come to this part of town often but after coming here, I’ll make sure I come back. The food was some of the best fusion you can get here in NYC, hands down. The drinks were spot on and the place had a great vibe. I had a great time with my party and can’t wait to come back in the near future to try out other options."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyM1AyYXNBRRAB",
            "text": "Amazing food. Savory and interestingly spiced. Delicious desserts key lime pie and warm date cake. Too slow to get photos of dessert!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHaU03b19BRRAB",
            "text": "Had a great time. The food is delicious and great portions.\nHad the cauliflower, fries and A&G sandwich which is a favorite already. The sauce is so delicious. And the mimosa gets the job done."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4eGNTcjZBRRAB",
            "text": "Archer and Goat has a cute decor and ambiance and solid brunch options. I had the chai which was well spiced and the skillet lamb hash and my friend got the arepas and the bottomless mimosa. I had a little bit of buyer’s regret with getting the lamb hash because the arepas looked amazing and my friend loved them. I heard from the waitress that skillet lamb hash was spicy, but honestly it wasn’t at all. In fact, I think it was under-seasoned and definitely needed more salt. It was a bit disappointing for me. The poached eggs were well executed though. The restaurant was a bit loud and the waitress took a long time to bring us our check after we were finished, despite the restaurant clearing out and not being too busy when we were ready to pay the bill. I hope my experience was just a one off and I think I would have enjoyed the arepas more if I had ordered them but I was not a huge fan of my dish."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtMW8zMWhRRRAB",
            "text": "For brunch we got the A&G burger, the spiced French toast, and unlimited mimosas. Didn’t love the French toast but omg the FLAVOR of the burger was INSANE. Wow I was blown away. Food with flavor like that is hard to find but this just hit the spot perfectly."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2djZUN3VRRRAB",
            "text": "Went for brunch and ordered the chicken vindaloo areas, lamb skillet, spiced french toast, breakfast arepas and fried chicken sandwich, along with some blood Mary's, and everything tasted amazing. Very friendly staff and good portions."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdmVxU0xnEAE",
            "text": "Delicious food and an unlimited hour of bottomless mimosas during brunch hours. The service was amazing. Great customer service with the host/hostess treating me and my friend with respect and kindness. I would definitely stop by at Archer and Goat again. Highly recommend ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1OXRxRmNREAE",
            "text": "Very accommodating servers and service, with great food. The back patio garden is a nice refuge setting. The dessert flan and mains are delicious - recommend the duck and empanadas. The banana daiquiri was refreshing and light. Would return again!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNleHQzaktBEAE",
            "text": "Our group got the:\n- Veggie Breakfast Arepas $24\n- Skillet Lamb Hash $23\n- Spiced French Toast $22\n- Rogan Josh $25\n- Side of fries with red pepper sofrito ketchup $10\n\nThe poached eggs that came with the arepas and lamb hash were a bit overcooked.\n\nThe fries were perfect. Not too oily, crispy. The sofrito ketchup was really good too. A bit spicy.\n\nThe overall consensus of the group was that there was too much spice flavors in their dishes but I enjoyed the meal."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxdVpUSTFnRRAB",
            "text": "Great staff and very friendly!!\nI have  been here twice and the french fries are amazing!!! The drinks are just ok!!   And overly priced with the bartender making sure they only give you the exact measure of alcohol!! To me that is not good customer service because the drink is weak!! Subsequently, I can fine better drinks for a better price here in Harlem, especially since I live in the neighborhood and know where to go!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1eDUtN2pnRRAB",
            "text": "Went for Sunday brunch in August 2022 after a recommendation from NY Eater’s 15 Brunches Worth Planning the Weekend Around.\nIt was an amazing fusion of favors I haven’t found anywhere else! It suited both my local vegetarians and Aussie omnivorian friends. We had (L-R) grilled cauliflower arepas benedict with shishito peppers, roasted portobello mushroom arepas with chimichurri and pickled onion and chili, French toast w pistachio and date crumble and rose whipped cream, and a braised lamb hash (top). All must haves!\nEverything was delicious. We topped it off with a meyer lemon tart and tres leches panna cotta.\nBut really the staff made the difference. Our server Julio, in his signature Van Gogh starry night Godzilla T, suggested everything we ordered and gave us a detailed explanation of arepas. He had superior service and was very accommodating.\nThe front patio is perfectly shaded as is the garden. Don’t let the reservationist tell you it’s in full sun. There are tables by the bar, but when it’s not COVID, I’ll be taking the table by the kitchen to watch the action. The owner Alex was expo’ing and was very appreciative of feedback.\nWe took the first seating at 11am and it filled quickly after 12:30pm."
        }
    ],
    "reviews_count": 79
}