{
    "name": "Patrick's Place",
    "place_id": "ChIJe_9PyWf3wokRECxEZpyZzuQ",
    "grid": "MN10",
    "address": "2835 Frederick Douglass Blvd, New York, NY 10039, USA",
    "rating": 4.8,
    "user_ratings_total": 178,
    "phone_number": "(212) 491-7800",
    "reviews": [
        {
            "date": "1달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201eFJXUlFjRXBaVW5GUmNrdzJiRmxyTkVGWk5FRRAB",
            "text": "Musica strepitosa e cucina ottima.\nConsigliatissimo !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoUmRUTklXREp5Vkd3M01ETjBaa1JCV1c1NFEwRRAB",
            "text": "We had a marvelous time, a grown up atmosphere.  The food was to live for, seasoned well and Ms. Youngblood and her jazz band ROCKED OUT."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkNGNGRm9jWGhaYlVVMlZWbHBVWFZ4UTFGbU9WRRAB",
            "text": "Cozy intimate live music...Thursday Jazz...I love it!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcTREMkZnEAE",
            "text": "Great food, great music and great drinks 🍹"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aGNEOWxnRRAB",
            "text": "Connected with My sister and brother in-law at Patricks for Sunday Brunch.  The staff was welcoming and very friendly.  The restaurant is not very big but because of this it delivers a very intimate dining expereince.  We had the Patricks Breakfast (Ackee & Codfish, Garlic Mashed Banana, and Jamaican Hard Dough Bread),  Shrimp and Grits, the Oxtails and the Salmon Cake appetizer.  All of the food was amazing. The Shrimp and Grits were some of the best that I have ever had.\nThen the band came on and we experienced a fantastic Jazz performance.  Each musician was extremely talented and the vocalist was amazing.  We ended up spending about 2 hours there enjoying the food and the music.  If we did not have an appointment we would have stayed longer. This is a gem in Harlem and it's worth the trip.   I would give this place 6 stars if I could. You have to check this place out.  You will not be disappointed."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNU5PUWxnRRAB",
            "text": "We literally left tomi jazz to come here and it was sooo much better. Real jazz played by real musicians. Really friendly people and intimate atmosphere. Jamaican food was elite. Everyone here was not only a master of their craft but also super friendly and nice :) we will be coming here 100% of the time from now on!!! Also, the jerk chicken is really good! Cover is only $10 per person + $20 minimum spend per person. We also tipped the band because they were beyond amazing. We stayed for 3 hours!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNEktQmNREAE",
            "text": "Great music. Good cocktail"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYaW96V2h3RRAB",
            "text": "Enjoyed ourselves at the Sunday Jazz Brunch with Boncellia Lewis!\nGreat old school jazz!\n\nOur beverages were Sorrel & OJ.\nFood was an excellent shrimp & grits and chicken wrap"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURieXRyQ2hRRRAB",
            "text": "We went to celebrate our son’s 21st birthday. The food was delicious and the service was great. Patrick is such a sweet guy. He gave a drink on the house to the birthday boy. We just had an amazing dinner enjoying the music.Just loved it!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyNXE3SmdBRRAB",
            "text": "Amazing food, ambiance and music!!!! Can’t for seconds! Adult vibes only. ❤️‍🔥"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMc09QM0tBEAE",
            "text": "Effortlessly chic, cool crowd.  You'll feel like one of the pretty people. Tragically hip... 😏"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdC1yRHFnRRAB",
            "text": "Small venue with delicious food and occasionally live music."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqaGZMYl9nRRAB",
            "text": "My party of 10,ordered food and drinks and were not served after order was placed for approximately two hours. Service was TERRIBLE"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqbjhLb2VnEAE",
            "text": "Small quaint vibe...Patrick forgot my group was coming...but the team and other diners shifted to accommodate a party of 7. We were grateful, since we had just flown into town.\n\nThe music was on point!  Friday night Jazz!\n\nThe majority of us ordered the oxtail...they were tender and tasty, but the dishes were not hot...Luke warm is a stretch. I just didn't want to be the one to complain...if you know, you know!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqN3NYYWNBEAE",
            "text": "Supee cute intimate place. Great live music and good drinks. Theres an extra charge about $15 pp for the live music"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1cUx1UTFRRRAB",
            "text": "Good food and great music."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeDRTMFRREAE",
            "text": "I've been a customer of Patrick's Place for years and have always loved their delicious Jamaican Food and live jazz. Very friendly, family, home-grown hospitality and service. For real Harlem Professional Jazz Musicians and vocalists and that authentic Jamaican Flavor, Patrick's Place is the place to be. Thank you Patrick for bringing us this great place and keeping it growing!"
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREbV8tZVpnEAE",
            "text": "Je mets cinq étoiles alors que cet endroit en mérite mille : accueil, repas, desserts, artistes : tout est génial ! Merci Patrick et toute l'équipe !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURELXBPZW1nRRAB",
            "text": "Myself n coworker travelled from Brooklyn and Bronx for brunch to this lovely establishment filled with good energy. ALL Staff was very friendly n efficient. Prices r very reasonable. Cocktails were superb!. Food was Delicious, Mz. Von sang Beautifully!! n entertaining. The Band followed by playing GREAT sounds. Ms.Von surprised us with inviting the cook to join her in a song AMAZING !! us with her wonderful voice as well, WOW !! What a Dual. Great job - Tanya. MOST definitely we will b coming back to Patrick Place it's well worth the trip to Harlem."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKdEtmSE5BEAE",
            "text": "\"Soul Guard\"- Jazz Band was there. Had a great time, food was very delicious."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCaTYyVERREAE",
            "text": "I’m an insider/outsider living in Astoria but checking out jazz clubs in Harlem every week for a quarter century. Patrick’s Place is keeping the tradition going of local jazz in an intimate, well-managed setting where everyone feels like they are immediately upon entering made part of the family. The family includes owners, Patrick and Arlene, and their friendly, service-oriented staff; and the wonderful veteran musicians who have been making music in Harlem for generations and bringing up new talent at the weekly Friday jam session. Make a reservation and be prepared to eat well and drink well and spend some money. You’ll never spend enough to pay for what you get in return.  If you crave jerk chicken look no further!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5dU9mbkN3EAE",
            "text": "Just what I needed. Great live Jazz music. Awesome vibe. Slammin' Rum Punch!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5ejZfX1pREAE",
            "text": "Loved the vibe, music, food and wait staff.  I would recommend to friends and family for a nice Sunday brunch spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5cVBlX1RnEAE",
            "text": "Patrick’s Place is a nice little date night spot. It’s super small so it can feel cramped BUT the entertainment and service completely make up for the limited space. It definitely more of an intimate setting. I didn’t have the pleasure of trying the food but the drinks were great. The rum punch was authentic and you could taste the Wray and nephew, need I say more? The Jazz players and singer were really good. I would definitely come back and try the food next time. Parking is a little difficult as it’s Harlem and on the main road so just keep that in mind. There is also a $20 pp minimum"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0cFo2TkF3EAE",
            "text": "Visited whilst on vacation. Jerk chicken was superb, best I've ever tasted. Very friendly service and was made to feel really welcome. Music fantastic and would highly recommend this small intimate club."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0NUxQOEt3EAE",
            "text": "Great!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0d01PajRnRRAB",
            "text": "The best experience in New York if your are looking for sth local & live music! Thanks to Bronzella Lewis and the band we had the most local experience in our trip to New York. We also had such a nice afternoon thanks to the staff & friends in the bar. Food & drinks at reasonable price compared to city center. We will go back for sure 😌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOejZLNW53RRAB",
            "text": "Beautiful performance from the Phil Young Experience. A very intimate space to share with the performers and we were able to speak with them after their first set. We WILL be coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOeHBuUDlBRRAB",
            "text": "The food was delicious the drinks was good. The Jazz band was great. First time here and it won't be my last."
        },
        {
            "date": "1년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxN2NqMEtBEAE",
            "text": "Um ligar muito agradável, a música então não preciso falar nada, simplesmente incrível, amei a experiência\nÓtimo atendimento"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxc2E3OWRBEAE",
            "text": "The atmosphere was inviting. The food was good and the entertainment was great. I would recommend and will be back to visit Patrick's Place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxMWNDaHVBRRAB",
            "text": "Great little Jazz club/restaurant.\nThe place felt real and genuine and the soul singer that was performing (Letrice Arlene) had a captivating voice. I just wish I could have stayed longer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxcnFxczV3RRAB",
            "text": "What a wonderful night!!! Amazing jazz band and very cozy atmosphere 😍 food was good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWbWQyczV3RRAB",
            "text": "Patrick’s Place is a great spot to eat some yummy food and hear great live music. The atmosphere is friendly and has a family vibe. The fish, plantains, rice, and appetizer sampler were delicious and the ginger beer was the perfect balance together sweet and spicy. Music by Beverly Crosby and a solid backing band made the night one to remember!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsckwyaFZREAE",
            "text": "We went there for Sunday brunch. Very nice experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1eG9ldmZnEAE",
            "text": "Food needs alot of work, service needs some work, atmosphere, vibes and live music were lovely."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1c1pEUjlRRRAB",
            "text": "Small neighborhood Harlem bar with good vibe. There are not many. And, good live music some nights. Try it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1a0xyNjZ3RRAB",
            "text": "Went to celebrate my friends birthday had a great time will go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNUlUZHh3RRAB",
            "text": "Had a great time at Patrick's. Food was very good, drinks as well, and excellent music and service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaX29DbWtBRRAB",
            "text": "During  our recent visit to New York, Manhattan, we visited  Patrick Place. The food, atmosphere and live music was fantastic.\nA must visit, if you are in New York, Manhattan and enjoy listening to live  jazz music, you will certainly love this spot.\nDon't forget to try the jerk chicken, it was great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcl9yX0FREAE",
            "text": "The music and food were a great combination."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMS1QNC1nRRAB",
            "text": "Great live jazz"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbmRiUVFnEAE",
            "text": "This place should he jam packed all the time! The chicken and waffles is decadent, and Boncella Lewis and the band is incredible.  Best entertainment!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKemRYTHpBRRAB",
            "text": "Had a wonderful time at this hidden gem (which probably won’t be hidden for long). Warm & friendly owners and atmosphere, with great music, food & drinks.  A true Harlem feeling but welcoming to all colors & stripes. 👍🏼💕👍🏼"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKa29PWWRREAE",
            "text": "I took my dad here for his birthday and he loved it, so did the whole family. The food and Music was amazing. Super authentic and comfortable. I recommend this place if your looking for really great Jazz and really great food !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdlBTdXZ3RRAB",
            "text": "Beautiful Thursday night in Harlem spent at Patrick’s. Incredible music, food, and service. Thank you!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4amFmTXRRRRAB",
            "text": "All around a great place for positive, elegant and welcoming vibe. Great prices and the drinks are great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4c2Z1eFFnEAE",
            "text": "I'm British, my boyfriend's Spanish.\n\nWe have no damn clue on how tipping works in the US, especially if you pay on card and the payment has already gone through...\n\nSo everything was amazing up until that point. I get that tips are a huge deal for people who live here (politically i don'teven understand why...but that's another story I guess), but the attitude my boyfriend received completely ruined the mood for us. Especially when he asked how it was done since we genuinely didn't know and to be hobest, we still don't...\n\nTalking to Patrick kinda saved the night. LOVELY man!\n\nThe music was on point. The food was fire, except the fact we only received 3 slices of plantain each...that was a bit painful. But overall it was a lovely experience for us...up until that point"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4LXR5Y3VBRRAB",
            "text": "great the Sunday brunch with the jazz session. you made my last Sunday in NY thanks so much Guys 👏"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dUpYMEhnEAE",
            "text": "The food was quite good. The music rivaled music from the Brooklyn Soul Train. What a fun night of song,  food,  and fun.\nI had the Oxtails, and I was happy that they were not drowning in gravy. It was…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1Nzh2eVpBEAE",
            "text": "Full house five stars for this one.\nFrom the warmth of Harlem comes this place with live jazz and Jamaican food and drinks.\nWent on Thursday night, the band was lead by the brilliant Phil Young who entertained us with his band for few hours.\nLoved the vibe of the place which reflects the deep culture of Harlem.\nExcellent service, no coverage charges, but you can make reservation online."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoejdyWktREAE",
            "text": "I went here for a birthday brunch this past weekend and the band was SO FUN. They even serenaded me for my birthday and Patrick, the owner, gave me a piece of carrot cake with a candle in it. The food was really tasty as well- I had the shrimp and grits. Someone else with me got chicken and waffles (photo attached)."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyMWNYaE5REAE",
            "text": "A true gem in Harlem. I came here for my birthday on a Thursday and it was the perfect night! Not many ppl were there and I was shocked! All of Harlem should fill this place up! The food was delicious, staff was friendly and the owner was…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNob2RLVWhBRRAB",
            "text": "My wife and I, had an amazing experience at Patrick's Place Harlem!!!! The live 🎺 Jazz singers and 🥁 band were very entertaining, the 🍸🍹🍻🍾drinks were 🔥🔥 great, and the food was delicious!! But most importantly the service was amazing.⭐⭐⭐⭐⭐\n\nThe Owner even took the time to take a picture with me.\n\nWe're definitely going back!\n\nHigh recommended!!!!\n#patricksplaceharlem"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1N18tUGxRRRAB",
            "text": "Down-home, intimate experience. The jazz feels (and literally is) like old friends getting together for a jam session. Definitely not flashy, but everyone was welcoming and friendly. Mr Pat shook my hand himself, Nicole was an excellent server and the Rasta pasta was delicious!(*Eventbrite registration required*)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoclpqTXlRRRAB",
            "text": "The best Jazz and food.  One of the  best spots.  They made me feel very welcomed\nFood and music were excellent."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNleElDRzJBRRAB",
            "text": "We went for my my Birthday with my family and I had the best time. The food was great, real AUTHENTIC jamaican cuisine. The service was amazing, the waitress was so sweet. The owner's go around to every table to check in their guest and…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHdnZyR25nRRAB",
            "text": "This is such a lovely cosy jazz club. The musicians are very talented and played such amazing music. The food is excellent and very reasonable. I had a fish dinner, which was cooked just right. The cocktails are strong and delicious!\n\nThe owner is very friendly. We wanted to go for a drink after the show so asked for his recommendation. He took us to a bar nearby, which was very nice.\n\nI’d definitely come back here when I’m in NYC next time."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHem8tZnNRRRAB",
            "text": "Great ambience, amazing jazz, and very tasty Jamaican food! Stopped by the Friday Jam session, and was extremely welcomed by jazz lovers of all ages! And the Jamaican food is suberb. Well worth the ride to Sugar Hill."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNNmZqc2NnEAE",
            "text": "Very special jazz experience, great vocalists  and band! The food was good too!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdDR1aGFBEAE",
            "text": "My girlfriend and I went to Patrick's Place last week to listen to some Harlem jazz. Not only was the music incredible, but the food, drinks, and overall atmosphere of the club were all excellent. It was a small, intimate setting, and…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNldV82YVJ3EAE",
            "text": "Absolutely  love this place, if you want to really have relaxed time this is the place to be, I sat at the bar with the lovely bartender Nicole, she is very good at her job by the way. She recommended me a Jamaican Rum punch which I had…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtei1qcURBEAE",
            "text": "We went for dinner last night and had fun. The jazz band and singers were phenomenal. The customer service and atmosphere was exceptional. I loved it. The food was fine (and could have used more seasonings). The owner Patrick and staff were…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURod1otQmRnEAE",
            "text": "First time my Bestie & I visited Patrick’s Place, the Vibe & food was Amazing. Will definitely be going back for some smooth jazz, delicious food and great vibe!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXam9PZzhBRRAB",
            "text": "Just left this place with my lover and we absolutely loved and enjoyed every single thing about it! The food was authentic Jamaican; the music was superb; and the customer service was unmatched! It felt like a family reunion just being…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXanF2cFVnEAE",
            "text": "Literally a hidden gem. My partner brought me here and the energy in this place is so genuine and wholesome, I felt entirely welcomed into their business and the service was amazing. The owner and his wife made the effort to create…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPMTVtWlF3EAE",
            "text": "This is a amazing venue , true spirit of the small jazz clubs of Harlem. The quartet sounded so good. The food was so good ( I recommend the salmon ) perfect date night spot and Patrick the owner greeted everyone. Can’t wait to go back next week. What a awesome night. Thank you PP"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNmNmNmtnRRAB",
            "text": "Patrick and Boncilla Lewis host the best jazz brunch you'll find every Sunday, the talent and heart is amazing."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1a2Q2RlhREAE",
            "text": "My father and I went to a Yankee game, it finished late and I found Patrick's Place while desperately looking for something at 10:45 PM.  A short(ish) walk from Yankee stadium (bout .7 miles).\n\nAbsolutely one of the best dinning and jazz experiences I have had.\n\nA smaller venue with an excellent owner and staff are genuinely kind and vibrant.\n\nDerek was running the bar, and he was an absolute joy to talk with. The drinks were well priced and exceptionally made with care and freshest of ingredients for the Jamaican styles. The painkiller is amazing.\n\nThen we had Jerked chicken (my father's) and Oxtail Stew. The prices are about 15-25$, come with excellent sides. The Oxtail was incredibly tender, and the rice and peas cooked in coconut milk was simply marvelous.\n\nIf you are visiting New York, stop by.\n\nIf you go to a Yankee game, this place is so close by you would be missing out.\n\nA highlight of our trip to NYC, can't wait to return."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtMHJLZ3VRRRAB",
            "text": "I had such a great night at this spot. Patrick was kind enough to seat me at the last available two person table even though I came alone. I really appreciated that. The drinks were delicious and the service was awesome. The environment was super welcoming and the music was incredible. I’m excited to return."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNHRxdXZnRRAB",
            "text": "First time here tonight, but it will Not be my last! Mr. Patrick & his wife make you feel like family! The food was delicious, service great, and the jazz band had us clapping all evening.\nGreat vibes here!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHekxlLS1nRRAB",
            "text": "Great Place, Food, Drinks and Entertainment for a special night out with your significant other or even on your own. The place is intimate and the vibe is easy. I love that there is beautiful mix people and music. I really enjoyed my evening at Patrick's Place."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNaEtpQW9BRRAB",
            "text": "No frills storefront place that holds an oasis of smooth jazz and blues, along with flavorful Jamaican cuisine.  That rum punch is delicious and strong, so go easy until you have some food in your system.   Service was so good, our young…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZd29XckJ3EAE",
            "text": "I took my wife and niece, had a fantastic Sunday brunch, And listened to an excellent jazz band.\nI was pleasantly surprised at the excellent west Indian fare.  Even my niece had a great time enjoyed the food and the personal attention.\n\nMy wife and I used to go to Patrick’s Patty shop across town since we were in high school. This is a whole new level. I am so glad that he grew up along with us."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdWFleHRBRRAB",
            "text": "We had such a wonderful evening\nat this spot for our 2 year anniversary.\nPatrick & his team are so kind, and the food is very tasty.\nPhil Young was really cool and so jazzy 😉.\nWe highly recommend Patrick's place."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNOGZ1NDZRRRAB",
            "text": "Nice little place to eat and listen to some good jazz music. The food was very good, the jerk salmon was too spicy for us (but I really think it's just the recipe, we're Italians so we're not used to this spicyness! ) but the chef made…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSak1XaWF3EAE",
            "text": "Omigod this place is amazing!\nAmazing food, drinks, ambiance and friendly staff\nMy daughter and I had a great time here :)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlOGR2TWlRRRAB",
            "text": "Good and drinks were great! Live music was killing as well…. World famous jazz musicians and students alike play here. Definitely get the Rasta pasta or the ox tails!"
        }
    ],
    "reviews_count": 78
}