{
    "name": "The Victoria Theater Restaurant",
    "place_id": "ChIJlzN4B7v3wokRdTYFVfMvz8M",
    "grid": "MN10",
    "address": "233 W 125th St, New York, NY 10027, USA",
    "rating": 4.2,
    "user_ratings_total": 445,
    "phone_number": "(332) 266-8727",
    "reviews": [
        {
            "date": "13시간 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ocWRrZ3phVmd3WlY5cWRWbFFNbWREVDNaRlVYYxAB",
            "text": "Marriott really needs to invest some more in the number of servers and managers for this restaurant because it’s very good. However, they are very understaffed. The food was totally on point. The only food I didn’t enjoy was the biscuits but they still were tasty. Just not particularly homemade Many thanks to their patience with me as I didn’t understand the hours they were open and closed and they were still very kind."
        },
        {
            "date": "16시간 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Zd1NsRXRiV0pVVWkxVGFuWTRXazkxVTE5dFNIYxAB",
            "text": "It is a delightful reprieve right in the middle of 125th street.  Food was amazing! Service was good. Wonderul atmosphere."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWS2IwUk1UVzUyVWtkalNVRTNNRXhWVG5aYWFsRRAB",
            "text": "To preface, we stayed at the Renaissance for about a week and frequented the Victoria restaurant nightly as we were given $25 credits to use daily for the inconvenience of having our room switched to a double queen in place of a king suite.\n\nThe hostess was delightful! Super friendly and always had a smile to greet guests. The bartenders were wonderful. Gio was especially great!\n\nThe only time we dined in, it took 25 minutes for our server to take our order/get us water. This was despite making direct eye contact with us passing by multiple times. After taking our order, she didn’t let us know some of the menu items we ordered were out of stock until our food actually got to our table 30 minutes later. I decided to just order another beverage since our other entree was already at our table. I got the same beverage I had first ordered and it was an ENTIRELY different drink. Had my husband ask our original bartender if he wouldn’t mind remaking it and he was very kind about it. The inconsistency was just slightly annoying after waiting so long. We decided not to spend more money there as our bill was close to $90 after gratuity was added and our wrong drink wasn’t comped and the serve mixed up/didn’t use our entire $25 credit.\n\nWe did try to just get desserts and drinks every night after that and thankfully had no issues with the $5 champagne special (on Wednesdays). Every single time we went down to get dessert they were out of something. We had credits to use the last night so we figured we would try to order food to go to avoid the dine in issue we had on Monday just for them to be out of 1/3 of the menu again. It was really frustrating, especially after going around NYC all day and just wanting to come back and enjoy good food at our hotel.\n\nAs other reviews stated, the $25 vouchers really didn’t do much considering even if you went down to just grab a dessert and had a remaining credit of $10, you had to pay $2.50 in sales tax.\n\nThe 18% gratuity added onto everything, even water bottles, was downright annoying.\n\nThe live band on Monday and Thursday night was wonderful!! Love Deborah!!\n\nOverall, I think it’s just poor communication internally. Most of the staff was awesome. I definitely won’t be going back, but am glad we tried it."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoZlJsSm9kMGt3UzJkb05VaDBaRW8xVW5aQk5IYxAB",
            "text": "I have to go back.  This lounge didn't disappoint."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GUGRHMXNlVEoxTms1bE4zTkxNRXQwTkY5cVJXYxAB",
            "text": "Absolutely loved this place. It was Black, the service was great, the oxtails were delicious and well as the corn fritters and drinks. Oh and the music was on point. Jaheim was an excellent host!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1Q2JESndYMmRLVlVkcVZIWnpjMmhZZDBGQ1JYYxAB",
            "text": "Like everything in New York. I thought the prices were accelerated but the atmosphere was great. The people were nice, the food was good and the drinks were stiff so I had a wonderful time"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WVlpGQm9URU15YmtOT1IzbE9OWFZtVm1WVVJXYxAB",
            "text": "Celebrated with a good friend here for birthday. There were 6 of us.  Food was delicious, waiter/service was great, had a live dj who kept the hits coming, music wasn't too loud & great mix of classics & r&b, decor is beautiful & well suited to the area. It was a vibe.👍🏾👍🏾💯"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210ZlVETjFTM1ZYZVdnNE1qaFVOelpuU2pscFIyYxAB",
            "text": "It took almost 2 hours for our food to come out of the kitchen & by that time it was cold. We were so hungry after a long wait that we just ate it. The best I can say is that the steak was flavorful other than that I was not happy. Definitely not going back there again."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUmVscHRUR0V0ZVd0bE9USnBVMGh6VjE5MlRFRRAB",
            "text": "Had an outstanding brunch on October 5th for my mom's 70th birthday at The Victoria Restaurant. The food was exceptional, and the service was stellar. Annie, the Maître d', was amazing—she was super helpful and clearly managed everything, from reservations to coordinating the head service, making the celebration truly special."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WeFprWTNjVXBhUVhJMlJESllRM2RvWldWV1RrRRAB",
            "text": "The food so expensive for Tiny portions of Mac n cheese doesn’t taste good I can make\nBetter and the only one I enjoyed was the burger that’s it but doesn’t come with French fries tiny biscuits my family disappointed for my son birthday"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWmNuSldXbWt6TmkxNVRIaFNRbGx2U210bmMxRRAB",
            "text": "The food was delicious. The service was great. The staff was friendly. Shoutout to Sadaf. I enjoyed my meal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRGFXcFVPVk5FUVVkNVdWUjFkVE5FZHpOVVNYYxAB",
            "text": "Great drinks, wonderful food, I'm looking forward to going back when I'm back in town."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdE5mN3JBRRAB",
            "text": "Update to previous review below 9/25:\nWe made a reservation for dinner based on previous experience. However things have changed, imo:  the food was still tasty, our server Jaden was outstanding but, service was slow from the kitchen, we were served teeny tiny biscuits and corn muffins, and then after our server changed shift were double charged for the meal. Mistakes happen, but this occurred on two different cards. Restaurant managers were extremely unhelpful with no explanation as to how/why the double billing happened, giving us an email address to write to person in charge who never responded. Issue was resolved by my bank.  The music was good but a bit too loud after a while, the space is still elegant looking.\n\nThis place is a vibe grown and sexy people, inventive, fresh, delicious food,  beautiful decor, music at perfect volume to have conversation. The knowledgeable, well trained wait staff (talking about you, Stanley) made this an exceptional Saturday night out. Can't wait to go back. 💙💙💙"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWSFZHWk1SMWxRZHpOR2JIcHNkbWhMYTBOVGNWRRAB",
            "text": "Not a lot of vegan options"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ScVZIbEdVbXRPV1dWNVpUaHJjVlpNTlZwRlIwRRAB",
            "text": "Great atmosphere with beautiful music."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKUVZqVjVVbTVXY0RBelp5MWhXREZQVDA1WFMzYxAB",
            "text": "Absolutely love the atmosphere..Beautiful spot! I ordered catfish tacos 🌮 and the collard greens dip..SUPERB! Our waiter Ivan was awesome & very attentive! Definitely going back🧡"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcGRHdzRPVnBuUmt0eVRIaHhNVlZmTUZKdE1VRRAB",
            "text": "This is a Harlem gem! My girlfriend and I went for a date night! We had an amazing time! The food was great, the drinks are well made , noise level just right! The ambience is perfect along with a nice mature crowd. Friday night is a great time with the live band. The rooftop displays a great view of the city’s skyline and the DJ was on point! Will return! ;)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5dk5XVTBNRGh0YlZOWFJqQkRkM0F6U21VeVRFRRAB",
            "text": "Nice place. Great atmosphere. The food was okay. No complaints."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CSWQzQTJTVVZxVEVNeGRGVXdaRFY1VTFGUFNFRRAB",
            "text": "Great vibe great energy there right in the heart of Harlem."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poS05HUkJNVk5sYzI1T1l5MWZiMnRtTkdVd1RHYxAB",
            "text": "The food was good, although a little small and we were cold because the AC was full on. But we had fun and it's a really cool place in central Harlem."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGRldsRnRibmhyUlVvM1VVTm5jM0pMZWt4RFgxRRAB",
            "text": "Hotel and restaurant gives an amazing experience with live music, great food, great service and an amazing atmosphere! Highly recommend!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqeXJlMjFBRRAB",
            "text": "I’m back for another review, invited guests from out of town and had breakfast,now being from the south ,how are not making pancakes properly!!! Cold and dry ,it’s very disappointing/however the manager apologized and accommodated me,if they hire a professional chef this place could be a gem ,and open the area with the windows view ,for the price they charge for breakfast at lease make it memorable!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkaE9IbGhRalY0TUVKelVqVnZjblI0VW5GeVdGRRAB",
            "text": "This place is awesome! Beautifully decorated they even have a glossy teal piano! The service was amazing. The food was scrumptious. I really loved the Hennessy soaked bread pudding and the garlic Parmesan wings. I had the catfish and hush puppies were so so good!! The drinks were amazing with a great selection of Signature cocktails and great music . Definitely was a vibe and I will be back ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NllXTkRVRTFrZDBGalNsWlhXVmRFWm1GdWVtYxAB",
            "text": "I attended a Birthday Brunch at the Victoria Theatre and whenI arrived the doorman downstairs greeted me and then directed me to the 5th floor to meet my party.  Once there the hostess greeted me and directed me to my party.  The food and drinks came out in a pseudo timely manner.  The (Strawberry/Mango) mimosas were delicious.  Once we closed the tab we were thanked and continued the Itinerary for the evening.  I will most certainly be returning on my own for a solo Brunch date.  It was a great experience. (I'm in the pink polo in the back on the right) ..👋🏾😁"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWWIxOUtaVjk2VFdsSU9HY3dXWFpQYlZWWlRsRRAB",
            "text": "The ribs and wings were excellent, as was the Malbec wine."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMU1IZDZVMUpET1hCamNHRkZRVlpqU1VWdlVVRRAB",
            "text": "This newly renovated space is just fabulous and the food was on point."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGS2EyTm1TRE5sYVRkblYyRnliV3Q0UVZCcWMzYxAB",
            "text": "Expensive if you're on a budget."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsNFRHZ3pZazUyTFd4UVpqRkxSVzFCVTNwV00xRRAB",
            "text": "it is very good restaurant and i really love to eat in this place ❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taT1pHVkVZVUpzUlRVelJsUnpMWE52UzB4M1YwRRAB",
            "text": "What an incredible brunch experience! The decor was absolutely beautiful and made the space feel so welcoming. Every dish we ordered was delicious and clearly made with care. Our server, Ivan, was also very friendly and attentive, which added to the excellent service. But the best part, for me, was the music. It created a fantastic atmosphere without being so loud that you couldn't have a conversation. It's the perfect place to enjoy great food and company without having to shout. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGaWRUUk5aVmQzZUZwWlpURmpSR1Y1UTNGdldtYxAB",
            "text": "Amazing and upbeat vibes"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kcVdYZHVSRE55Y0dWTVdrZHBhazFTVVhRdFRsRRAB",
            "text": "Kind of pricey"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMlQwNUhlVzlEYm5nMk9VWkRaSGxrWnpOS1QwRRAB",
            "text": "Great hidden gem in the middle of the city"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSblZUbFBSM0p0U0RONE15MXJWQzA0VGxjeVExRRAB",
            "text": "Harlem needed this...sexy spot with a great vibe. Grown and sexy. The food is good....can y'all add 2 or 3 more wings, I mean 6 wings for $19 lol lol but seriously add 2 or 3 more 😅 someone was thinking it too"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsaE4xUm5NR2czYkd4TU5UaEpWakZZZVZab1ZVRRAB",
            "text": "++on the atmosphere"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaMldHOUNVVlozWVc5TFJDMHljUzEyVTNJdE5sRRAB",
            "text": "It was my second time eating here.. both times I left disappointed... maybe I'm messing up because I haven't done brunch there only lunch and dinner.. The only reason I spent my money here was because I had a $25 credit from booking a room the night before. I knew I would have to pay extra because what can you really get with $25 today but what frustrated me is that they charged tax and tip based on the original price as opposed to the price after the discount. Instead of charging 18% on a $7 bill, they charged 18% on a $32 bill.. I spent more in gratuity than the leftover cost of the meal. Maybe it wouldn't have been an issue if the food was somewhat filling... $16 for two mini catfish tacos. The cheapest fish on the market.. that's highway robbery... Adding insult to injury, the taco dish/stand fits three tacos but you only serve two...come on!?!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZd2RqQktjRmxtYmtWMWIybHJTRUo1UTBNNFNWRRAB",
            "text": "My experience was brief. Also amazing.  Definitely recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVVVVcFhjVkEyYUc5d1gwRnpRMTh4VVMxUFQyYxAB",
            "text": "Classy and friendly people attend here.  Tasty drinks and great appetizers. My second favorite spot on 125th Street, Harlem NYC"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5QlFsZHlZV1oyVmxGeGRrcHNWVE5LT0c5dFpXYxAB",
            "text": "The food was great, the drinks were great. A very cute spot. I would absolutely come back and bring friends."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pac2FtVjNjSEZuVVdkRlMwWmFjSGhaVGxCM1VtYxAB",
            "text": "I just left my cousin's 30th & 60th birthday celebration. They hosted a wonderful brunch. The food was so delicious. I can't wait to go back. The DJ that was playing on the 5th floor restaurant level was playing all of the hits. The overall decor was something out of a Renaissance movie. The pictures in the elevator was also a perfect touch to the decor."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gb09XcEZZbDlIZGtWalgySm5RVXh3U1ZWbk5VRRAB",
            "text": "The drinks and food are great. I had the Cuban serenade and chicken biscuit sliders. Love the atmosphere; a mature and melanin crowd. The decor is aesthetically pleasing. Would go back for jazz night and rooftop."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKaloyeHRaa0ZIZGsweVdYZHVhbVJGTnkxR2JVRRAB",
            "text": "Enjoyed the old Lowes theater!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kd1NXSXRkbU5aVVdsamRHTTNjR05HZVZGWmJFRRAB",
            "text": "The reservations time do not exist. Waited an hour after my reservation time. The food is average. If you’re really hungry this is not the place to go. It looks good on your plate, however there are small portions. I don’t think most restaurants in Harlem today can compete with 80’s and 90’s Harlem food!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwcWFVUmZUVk5KVTBkWU1GUjBUbFo2U0VRNVVXYxAB",
            "text": "A week ago, I came for brunch and appreciated its sophisticated setting. The server was friendly and accommodating. The shrimp and grits were good, but the quantity of shrimp I got did not match the price, as I received only four pieces. Also, the cup of gumbo was good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taaE5UaDFXVXhITm5KdGFtdE5aMHB3YlhocFJIYxAB",
            "text": "The place is absolutely beautiful.  The food didn't meet my expectations.  I feel like it's somewhat over priced."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oclR6Tk9iRGR5V2s1NmFFa3lZbEo0WVU5UVZuYxAB",
            "text": "Not a great deal of gluten free options, however the waitress and manager worked things out and I had a fantastic meal."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RM2RHeExObTAzZWxwVVJETTRNRmRDTW5KMmJuYxAB",
            "text": "The service was superb, and both the food and ambiance were exceptional. The manager was very attentive, a great conversationalist, and incredibly hospitable. We had a fantastic evening and will certainly return."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWGNVeDJhMTlUY1dOMWRYRndNR05uYmxFMVVsRRAB",
            "text": "Great service amazing atmosphere delicious food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJNWJucFZRbFJFYTBoRlEyWmpOVWRtUWxZeU9XYxAB",
            "text": "Beautiful atmosphere and vibe! Reasonably priced."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoNmNuTjVNVlJSTjNOVWVVVTRSa2RIWm1NNWMyYxAB",
            "text": "The ambiance and decor was excellent. Food, drink and service left alot to be desired. I do recommend based on location."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poblVFVXhUbmRmWkRZM1VXZEJMVFY1TUdKVGMxRRAB",
            "text": "So much history in this building and area i loved the food it was exactly what I was looking for. Please stop here it was delightful delicious and indulgent."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNMnV4UC1aazYtZDBRRRAB",
            "text": "A couple of months ago, I stopped by the Renaissance Hotel in Harlem after a previous visit had left me intrigued—I had seen several diners thoroughly enjoying what looked like an incredible catfish dinner. Naturally, I returned with high hopes to try it for myself, only to find out that the dish had been discontinued. Disappointed but still craving catfish, I mentioned this to the host, who recommended the catfish tacos instead.\n\nAt first, I wasn’t overly excited about the idea—it didn’t quite sound like the hearty meal I had in mind—but I decided to give it a try. And wow, am I glad I did. The catfish tacos completely blew me away. They were bursting with flavor—perfectly seasoned, crispy, and balanced with just the right mix of textures and ingredients. Every bite was satisfying and felt like a fresh twist on a classic Southern staple.\n\nThis dish is more than just a creative alternative—it’s a standout offering that truly reflects the vibrant culinary culture of Harlem, right in the heart of the neighborhood near the Apollo Theater. Highly recommended!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VKYkowZG5qcnVfcTlnRRAB",
            "text": "On my first night at The Renaissance, I decided to go to the Restaurant; I didn’t feel like going out to find dinner, and this spot was extremely convenient. Being right at the hotel made things easier, and the $25 off voucher helped, but even with the discount, the meal didn’t feel worth the price.\n\nI ordered the Rasta Pasta 🍝, but unfortunately, it was undercooked. The waiter was friendly and accommodating, offering to take it back to cook it longer, but when it returned, it was still barely chewable. That was really disappointing. However, my son **enjoyed his Calloway Wings 🍗, which were flavorful and crispy.\n\nDespite the food experience, the dining area was stunning—elegant, well-designed, and truly a highlight of the restaurant. The live singer added a wonderful touch, creating a vibrant and enjoyable atmosphere.\n\nIf you're looking for a beautiful setting with live entertainment, this spot delivers."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQX2RqTHFzeDREVlJBEAE",
            "text": "This is on the same street of the Apollo theater. Highly recommend. The food is delicious. I was pleasantly surprised. Collard Greens dip was so good and cheesy. I got full off of that and the salmon salad was delicious. No need to ask for extra dressing. They put the perfect amount of dressing. The salmon was cooked to perfection. It was so moist and delicious. If u are in Harlem and want some really good food stop by this restaurant. I recommend u make reservations before u go. This seems like a popular spot."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOTE80NG5WNjlUeVlREAE",
            "text": "Enjoyed a fabulous weekday lunch. It's in the lobby of the hotel but it doesn't feel like it. Open but cozy at the same time. The decor is amazing and keeps your eyes moving throughout the room. The menu items are original. The portions are on the more conservative side, so definitely do the combo. The collard green dip is the show stopper, make sure you get it!!! The service wasn't the quickest so schedule accordingly."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdnM2c3RnRRAB",
            "text": "The place was beautiful. I was a little thrown off because it’s literally in the hotel lobby where people check in and out. The server wasn’t attentive at all. We had to ask for the table to be cleaned in between courses. We had to ask for new silverware, etc. when the busboy bought it to our servers attention, he clearly had an attitude. When they sit you they tell you , u only can be seated for an hour and a half. It took over an hour just to get our main courses.  Had to end up getting the manager. The server claimed our table was 5 tickets behind but tables that sat after us , had their meals. The manager did acknowledge this.  He went to check on our food. The food came out but in pieces. It was only 4 of us and we all got our food at different times, took about 15 minutes for everyone to have their food and that didn’t include sides , that came out about 10 minutes or so after the meals.  The server did offer and it was taken , a round of drinks on him for the wait time.  The small plates and appetizers were really good, the collared green dip, biscuits , excellent !!! The larger plates , not so much , my cousin had fried fish and sent it back. It was over fried and oily and tasted like it also.  The DJ was good and the drinks were amazing. I would want to try again because they are black owned and want to give them a chance. But they have some tweaking to do regarding service and the food but the atmosphere was really good. Also the next morning , I received an email stating how they are saddened that I didn’t make my reservation. When I clearly was there."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZb2YteGV3EAE",
            "text": "It’s ALRIGHT. The food seems really creative and interesting on the menu, but in person a lot of the food is under seasoned. The ‘bottomless’ mimosas are mostly orange juice, and the waitress brought us the check at 90 minutes on the dot; 80 percent gratuity is included.\n\nBottomless (5/10)\nI got the salmon croquets and my friend got the steak and eggs. (6/10)\n\nGreat ambiance but subpar service and food"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfODY3YS1BRRAB",
            "text": "Mike, the events manager, was absolutely fantastic! We hosted a surprise private birthday dinner in the upstairs private dining area, and everything exceeded our expectations. The staff, food, and atmosphere were stellar.\n\nWhile enjoying the evening, a friend commented on my live social media posts, and I couldn’t help but recommend this restaurant right then and there. I’d definitely return—especially for that delicious Gumbo! The meat was incredibly tender and so flavorful.\n\nPlease note: We brought our own little bags for the guests, place cards and florals. They did not provide this just in case you plan to have a dinner there. I advise these details are brought on your own account to optimize the experience and make it unique 🩵"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURab3VXNjV3RRAB",
            "text": "My recent visit to Victoria in New York left me absolutely delighted. From the moment I walked in, I was impressed by the charming ambiance and the top-notch service.\n\nNow, let's dive into the culinary adventure. The shrimp and grits were a masterpiece, bursting with flavor. They were cooked to perfection, and the creamy grits provided the perfect canvas for this delectable dish.\n\nBut that's not all; the pasta and fish dishes were equally outstanding. Each bite was a burst of flavor, and the freshness of the ingredients truly shone through. It was a symphony of taste on my palate.\n\nAnd let's not forget the calamari, which was more than enough to share between two people. Crispy on the outside and tender on the inside, it was a delightful appetizer that set the tone for the meal.\n\nAll in all, Victoria offers a culinary experience that's hard to beat. The shrimp and grits, pasta, fish, and calamari all exceeded my expectations. This restaurant is a gem in the heart of New York City, and I can't wait to return for another unforgettable dining experience!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNzZMSUR3EAE",
            "text": "I visited this restaurant on two separate occasions, about two weeks apart. My first impression was that the place is captivating—the decor and scenery create great vibes. The food was amazing on my first visit. However, on my second visit, the menu had changed, and the food was disappointing. The one thing that remained consistent was the poor service. I will no longer patronize this establishment until they get their act together."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiczZLc1RBEAE",
            "text": "The food was excellent portion size excellent, flavor excellent, freshness excellent, seasoning excellent, and appearance excellent. I had a Caesar salad with thick sliced crispy bacon.  Our second waitress was 5 stars fantastic, attentive, and engaging. The atmosphere was fun and people were having a great time and dancing. The DJ was excellent, he knew the crowd and the type of music to play, just a tad too loud.  Overall we loved it and would go back. My friend said she loved the drink - it was not weak, perfect alcohol balance."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfX1BtV0tREAE",
            "text": "It is very nicely decorated and huge it has ample space to throw an event and good for groups. I sat at the bar, and they were supposed to have happy hour all day for MLK but fell short.  The bartenders were not aware of it despite the posting on IG. And we were told it was a mistake, Smh. Yonn, the bartender, was attentive and polite.\n\nI ordered the rum punch, which was good. For food, I had the oysters; very fresh.  The Buffalo empanadas were also good. Last was the gumbo, which was ok. My friend had the chicken slider and she liked it.  Sweet potato fries were good.\n\nI would go back for happy hour a for the ambiance. My friend tells me there's a live band as well."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMGV5ZzlRRRAB",
            "text": "October 2024 - Went home to Harlem for the weekend and came here for dinner & drinks with the fam. It was EVERYTHING that everyone raved about. The sophisticated decor definitely lives up to its name. The ambience gave luxurious vibes. The hostess who checked us in (Aisha) was super helpful & accommodating. Instead of a traditional table she gave us the option of a very nice lounge space and let us know we could order our food to that area and not have to move from there to a table. The music set the tone in the atmosphere and it was very much an R&B vibe that wasn’t giving too much “club” while you ate but was very good vibes.\n\nWe ordered the Sweet Chili Calamari, Oysters (both raw & charbroiled) for appetizers, Calloway Wings, Bessie’s Mac & Cheese w/ Fried Chicken and the Fried Catfish’N Hush Puppies. I love it when you get mac & cheese that is not oily/greasy, it was very, very good! Fried chicken seasoned to perfection 🤌🏾\n\nI had the signature Harlem Hurricane drink, I like sweet drinks, it was good but the flavor combo of the Passion Perfect was better. Good people, good food, good drinks all made for a fabulous night out in Harlem. A time was had, I will be back!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRM003Y213RRAB",
            "text": "I am really disappointed to have to write this review but my experience wasn't a pleasant one. The wait time in between placing an order and actually getting food were long and ridiculous. At one point I asked for an extra spoon , salt and pepper and had to remind the waiter what I had requested and how I was waiting.\n\nI went for lunch and realized that I wasn't offered a bottomless option (it isn't advertised on the menu, I happen to look at another table and saw they had bottomless drinks), I mentioned it to the waiter and later one to the hostess and they both apologized and offered my table the option. One thing that did annoy me before the option was offered was that the waiter mentioned the whole table had to participate which was fine except we had one pregnant person with us and the waiter had to get clarification on whether we could go with the option.\n\nThe food: the boneless wings from the appetizer menu were great and perfectly cooked. The gumbo needed some salt. I ordered chicken and waffles. The chicken was okay nothing to rave about. The waffles weren't as fluffy as they should have been. Someone in my party ordered the salmon croquettes with grits...total disappointment. The salmon croquettes look like hockey pucks and not as if they were made by hands and were hard. The grits texture was more of risotto. Not the right texture for grits and tasted bland."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMb2ZxcWJREAE",
            "text": "I was excited about going to this place because one of my friends had told me it was really nice. He suggested I check it out, so today, June 19, my friend and I decided to visit. We were looking for a place to eat.\n\nAt first, we didn’t know there was a restaurant until we asked the security guard. He directed us around the corner and up to the fifth floor. The atmosphere of entering the building, which was also a movie theater, was amazing. It looked like they had taken their time to make the place look very rustic.\n\nOn the way up to the fifth floor, I enjoyed the architecture and design. When we got upstairs, I was a bit confused because I couldn't tell the difference between the restaurant and the bar, nor who the hostess was. Initially, I walked over to the bar, where I saw chairs separated into groups. A gentleman in a suit was walking behind the bar, so I approached him. He was extremely unfriendly and unprofessional, acting like I was bothering him.\n\nAt first, I thought I was talking to the wrong person, but he turned out to be staff. I introduced myself and explained my seating dilemma. There were multiple chairs, and I wondered if anyone could move one so my friend and I could sit together at the bar. Despite his initial rudeness, he slightly changed his tone when I spoke to him professionally, but he still wasn't helpful.\n\nWe eventually went back to the bar, and the bartenders asked if we wanted a drink. We told them we would like to sit down, and they asked a couple sitting there to move so we could have seats. About 5 to 10 minutes after we sat down, the manager came over and said we didn't need him which  I felt was unprofessional. For me, that was not proper customer experience , especially from a manager. I didn't feel welcome from him the he asked me how did I hear about the place as if I wasn’t supposed to be there. The audacity to to question me as if I’m not supposed to be here no worries I will not come back to this location on the other side not to be angel. I still chose to ask the manager for drink and food recommendations, and he suggested the Harlem Hurricane, which I ordered. It was strong. When I asked him about other dishes,, he acted too busy to engage, even though the place wasn’t busy. When he walked away My friend asked if I had checked the reviews, and I admitted I hadn't. When I finally looked, I saw the place had a 4.0-star rating. I usually prefer places with at least 4.0 stars. As I delved into the reviews, I noticed many one- and two-star ratings.\n\nThe common complaint was about the automatic gratuity charge, the service being unwelcoming regardless of party size. I also had a problem They charged us an automatic gratuity just for two drinks at the bar. After reading all the other complaints about the food and service, we decided not to eat there. I would like to wish the Victoria theater a good luck on service and quality. If you go to my reviews, you’ll see that I have travel multiple places and 90% of my views are based off of honesty. I probably will not be going back to this location anymore. I feel more welcome  Down town than in my own neighborhood. We grew up and live  here  where so many people look like me and I’m not received the the service of a 5 Star Pl. because my money sure does spend five star. It just won’t be spending in our place. Customer service is everything and I want to feel appreciated when I spend my money. I work very very hard for it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUcTYtLV9RRRAB",
            "text": "My Unsolicited review of Victoria Theater Restaurant\n1.Stanley our server was amazing 👏🏾 5 stars\n2. Cheers to the bartender. Every drink we had was top tier. Misty drink was my fav. 5 stars\n3. Atmosphere and decor-Gorgeous. 5 stars Super Clean.\n4. Food-3.5 stars- Gumbo was good a solid meal but didn't stand out, Cajun chicken and pasta- the pasta and peppers were fresh and flavourful the chicken was bland, the shrimp and grits had more grits soup than shrimp 🍤. There was 6 baby shrimp and sausage with gravy on top with some inedible herbs atop. For 28 dollars the Shrimp should at least be large. I should of sent it back immediately but the music was nice. I'm a dessert girl and the bread pudding did not disappoint 😋.\n5. There was no Performance at 5,6 or 7 like advertised online 🤔....No one played that big beautiful piano.\nOverall I might try again, they might just need a stronger chef behind the wheel.  The location is next to Apollo, street parking in front. The area needs some work.\nTotal meal and drinks for 2: $232 Gratuity was 18% but we added some more for Stanley the server. He was very good."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJX3JtdHd3RRAB",
            "text": "I just went Inside yesterday the ambiance is spectacular. It is a grand gem in The Harlem area. And you know Elevators with life size images of Josephine Baker and Louie Armstrong got my attention. I didn’t eat there but the atmosphere lovely, the bar events and live music every day including happy hour tempting. I would make reservations even on a Tuesday evening it looked busy. A grand tribute to this Landmark of Harlem."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5NmREVFB3EAE",
            "text": "Overall- 3/5\n\nAtmosphere- 5/5\nI had a reservation for Sunday at 7pm. Decor and atmosphere are great. Very good music and lively crowd. Very beautifully decorated restaurant with clean bathrooms.\n\nService- 2/5\nThe service leaves much to be desired. I initially wanted oysters and wings for appetizers, but they were out of both . I struggled to find something else as the waitress kept asking me for the menu. I told her I'm still trying to figure out what I want , but she kept insistenting to bring a QR code, which she never brought. She never recommended replacements, so I gave up and didn't order an appetizer. I ordered steak and eggs medium well. It came out medium rare . The waitress never came to check on the food, so I had to ask a different waiter for help. They put the same steak that I sent back, back on the grill. Very unhygenic! I'm sure that's a violation. Then, literally, as we were still eating, she came and put the check on the table. We weren't done eating and planned to order more. Even after that, we ordered dessert, peach cobler. I wanted to love this place, but the service was terrible.\n\nFood - 4/5\nNow, the food was seasoned very well and was tasty after corrected. We had steak, eggs with grits, Kale Caesar salad, Linguini, peach cobler, and cocktails. The grits and linguini were very good. The cocktails are creative but weak. For dessert, we had the peach cobler. Very sweet but good.\n\nTip\n20% was automatically added to the bill."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkN19LNHF3RRAB",
            "text": "Went for dinner. The drinks and the apps (calamari and wings) were phenomenal.  Atmosphere was really nice. Very upscale Harlem. We had an issue with the entrees. I ordered a simple Salmon Caesar salad. The salmon was sooooo salty. Even the lettuce that touched the salmon was salty.  I let the server know and she offered to replace it. The replacement piece took a while and when it came it was completely unseasoned.  I guess the chef didn't like having to do it over. When the server asked if it was better I just raised my brows and said I'll take it home. I figured I didn't want to waste it and I can doctor it up at home.\nMy husband had the mac n cheese with shrimp but thought the cheese sauce was too thick.\nI would return for drinks and apps in the lounge area especially if I was seeing a show at the apollo next door."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBaVlQN0F3EAE",
            "text": "Food was delicious, great portions, had a lovely time.  Nice decor, magnificent ambiance.  Staff are kind and motivated to make our experience a great one.  My cousins and I dined in, the brunch was packed out.  Brunch is 90 mins from the time we seated.  Appetizer was good, non alcoholic beverage xoxo was delicious I drank two and took two home.  I had the steak and eggs meal, my cousins had chicken and waffles and the other had the burger and fries meal.\n\nCons: my cousins drink was incorrect, my other cousins burger didn’t have the egg that was supposed to be inside.  My steak was cooked through a little more than medium.  The roasted potatoes were dry, no mash available.  I ordered a full burger meal for my guy and when I arrived home to give him his meal, I was mortified!  No fries, no pickle!  Just the burger for $27 bucks?!? I plan to call the store in the morning, it’s unacceptable.  My drinks to go home were not even, one cup had more than the other.  No saran wrap to take home no take out box to secure drinks.\n\nThese issues can be rectified if the staff didn’t have to race against time to take and fulfill orders.  Our check came and was incorrect, then we got someone else’s check, I had to go find the waitress to give me the correct check.  Despite all of this I would still go back because human error doesn’t dictate the great food, great music and excellent staff.  The place has great potential overall."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbUtpVUt3EAE",
            "text": "It was my friend Tanya and I our first time going to the restaurant and it was really nice. My espresso martini was so bomb.  The host and our waitress Kiara was amazing. We even had a chance to meet the manager Mike. All in all we enjoyed Sunday brunch and we will definitely be back again. The hotel itself is beautiful."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205MVlWaElkbTV2VjFocE16RjFlbWxUWm1wZmRWRRAB",
            "text": "This is an amazing place for brunch! Gorgeous decor, looks like it’s straight out of an old Hollywood film. Their drink menu is incredible, huge variety of unique combinations plus bottomless mimosas, and the food is absolutely to die for. Think modern, high end soul food. I think this is the best brunch in all of NYC. We ordered a bunch of stuff to share at the table and everything was delicious- Rasta Pasta, Fried Green Tomatoes, Oysters, Corn Fritters, Catfish & Grits, Burger, and Southern Fried Chicken. Be warned, the portions are HUGE. The one criticism I have is that service was very slow. Oh, and don’t sit by the windows, because as much as I love a view, I do not love baking in the sun! I will be going back here and recommending it to others!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcE5MN01nEAE",
            "text": "Had reservations tonight for my daughter’s 25th Birthday dinner. I will not ever return. Only was able to have appetizer and 1 drink because after waiting over and hour we were then informed that our main dish the Red snapper was sold out. Arriving at 7:30pm only to be told at 9:11pm that our entree was not available. So we ended up going home to order food,  a waste of time."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JMlZrTTBTMEZyVlhKUGVFRjZMVXN6VkRaNE5sRRAB",
            "text": "Finally true five star dining arrives in Harlem. Conveniently located on West 125th street."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQbnZITWd3RRAB",
            "text": "The Victoria Restaurant: A Hidden Gem in Harlem\n\nNestled within the Renaissance NY Harlem hotel, The Victoria Restaurant offers a delightful blend of old-world charm and modern culinary delights. The restaurant's rich history, coupled with its proximity to the legendary Apollo Theater, creates a unique and captivating atmosphere.\n\nThe staff, with their warm smiles and attentive service, made us feel right at home. The decor, a tasteful blend of classic and contemporary, added to the overall ambiance.\n\nThe star of the show, however, was the salmon. Perfectly cooked and beautifully presented, it was a culinary masterpiece. The flavors were exquisite, and the presentation was a feast for the eyes.\n\nThe restaurant's live music performances were another highlight. The jazz band that graced the stage was simply phenomenal. The vocalist's soulful voice, paired with the pianist's masterful playing, created a truly unforgettable experience.\n\nIf you find yourself in Harlem, be sure to check out The Victoria Restaurant. It's a hidden gem that offers a taste of history, great food, and fantastic music."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURubDRMcVdREAE",
            "text": "catfish wednesday was OUTSTANDING. calamari was terrible. so chewy. SO. chewy. not a great flavor on the fry. sweet potato creme brulee was.     a letdown. super preassembled. what’s good about a creme brulee? it’s sweet it’s creamy it’s one delicious texture broken up by the torched sugar and maybe a piece of fruit or two. instead u get a dead cold serving of mashed sweet potato with chunks. and a sugary top but ?? so what. it was legit just mashed sweet potato…… for $14…… take off the burnt sugar on top and it’s a side dish that should cost half ……."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5dnF5Y3dBRRAB",
            "text": "Came on a Saturday afternoon and had an amazing time here! The service was impeccable and my food was great. My friends and I ordered calamari and mac and cheese for the table. The mac and cheese was ok, but the real highlight for us was the calamari. I also ordered the linguini which I highly recommend. Overall, the ambiance as well as the service was amazing. The manager mentioned that they hope to open up the rooftop as we get closer to the summer, so make sure you come out! My friends and I had a fantastic time, with great food, service, and atmosphere!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoTlRqWmZSVmRLYm5aRGFUSnRUMWd4YmkxTlFsRRAB",
            "text": "wonderful place. cocktails were fantastic and the food was perfect for our group. I loved the atmosphere and ambience of the restaurant and bar."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdl9xR3pnRRAB",
            "text": "Can’t fault the service and the food was excellent. Serving iced table water was a good touch too.\n\nWe used our $25 vouchers here each day we stayed at the hotel and enjoyed everything.\n\nI gave a poor review for the hotel generally only because we felt misled about the views (see my hotel review)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJajZmMVRnEAE",
            "text": "The restaurant serves really good drinks my favorite was the Lychee cocktail and the sweet heritage. The appetizers were good especially the chard oysters, the garlic parm wings and the salmon hush puppies. For the entree we got cat fish and hush puppies, the friend chicken and the snapper all was very tasty. The only thing i do t recommend is the mac and cheese, that needs serious work. Perhaps salt sharp cheese and a prayer. The ambiance and service was great and friendly.  I would say coat check would have been nice and 2 hr for 13 ppl was not enough time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURILWJQYzNRRRAB",
            "text": "The restaurant is located on the 5th floor, the staff (Camren) were amazing and so attentive to our  dinning experience! Our bartender Corey was also amazing the drinks were delicious and complemented our meals very well! Sweet and spicy!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKaVNrYzFNbk40TkhWVllXcFNkVGxLWm5wT2RGRRAB",
            "text": "The atmosphere was great however the hosted seem very stressed out came off a little rude. The menu had a lot of items with pork. We picked the was with out it in it. Now being from Harlem were Southern food is a staple the Mac N Chesse was very disappointing. The chicken and waffles were good. My aunt had the salmon which she enjoyed. The Rasta pasta was very tasty. The drinks are very good. The only other thing that was very annoying was that they clearly were Rushing us through our meal. Over all it was an alright experience I may not visit again but my aunt really likes this place and she will be coming back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2Nk5EbktREAE",
            "text": "We stayed at the Renaissance in Harlem next to the Apollo. Normally the hotel restaurants are just \"mid\". This spot was FIRE!. My daughters LOVE IT. Only judging the chicken and waffles. We've had lots of chicken and waffles (don't judge us...) and this was in our \"Top 5\"."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKc1IxZExRVUZTU0c4NVdIbHlUSEJFUTJscVQzYxAB",
            "text": "This was the worst dinning experience, I've experienced. It took 25 minutes before anyone approached our table. Another 20 minutes to order. They didn't know what plate went to what table, and constantly ask guess' what they ordered. They served us one plate and had to wait another 15 minutes before the other orders slowly came. My arrogant server brought me shrimp and grits. I've never eaten shrimp in my life. They refunded us $35 because of the bad service. DON'T GO THERE! They need Jon Taffer to do a restaurant rescue."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvZ2ZXOHJBRRAB",
            "text": "First time visiting this restaurant in Harlem and it did not disappoint! This is a great place for a first date or celebration. The ambiance is absolutely gorgeous, the staff/manager were welcoming and attentive, and the jazz singer and band were incredible. The cherry on top was the delicious food, no photos because we devoured everything we ordered as soon as it arrived to the table.  I had the blackened salmon w/ a side of mac and cheese which was cooked perfectly. They also have non-alcoholic cocktail options which is a plus for me. I would absolutely recommend this place and will be sure to return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqamF5VEJREAE",
            "text": "The ambiance of this resturant is beautiful and iconic!!!!! The servers and general staff were nice. When ordering my meal, I asked the server about what type of veggies were served with the salmon, he replied: carrots.  I was disappointed when my salmon arrived with burnt asparagus 😔 I decided to take the asparagus off of my plate, and eat the mashed potatoes and salmon. The mashed potatoes taste good, as well as the brown sugar glaze. Unfortunately my salmon was pretty raw in the middle. At this point I just decided to drink my wine and enjoy the beautiful scenery of the resturant.\n\nWhen collecting the tab, I was surprised that my server didn’t inquire about my full plate of food, or even if I wanted to take it home before throwing it away?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzc1AtUFFBEAE",
            "text": "The Victoria is one of my favorite places to visit when Im in Harlem! From the dark granite aura to the gold accents throughout, the atmosphere buzzes with sophistication and soul. Giving homage to many jazz greats such as Louis Armstong and (my personal favorite) Ella Fitzgerald, the artwork throughout makes you feel as if the artists are about to grace the stage. There are high and low tables, sections and private areas for parties and celebrations. There is often a dj spinning on weekends as well. Always a vibe! Make sure you check out their hand-crafted cocktail menu, too :)"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQbnJYV2VnEAE",
            "text": "Chic, comfy, modern restaurant with vybesy modern tribute to black royalty vybes. Don't forget to look up, a lot of details ( that gold map made me smile).\n\nYaya G hostess/ server was friendly and knowledgeable and elevated our experience.  Mimosas were delicious and refreshing. They definitely use top tier products. The gumbo was hearty and flavorful. My Mac and cheese was just like you want it to be. My friend had the fried chicken sandwich it was big and tasty, the crunch on the chicken was everything.\nI recommend adding this establishment to your list. I went for lunch and it was worth the train ride uptown."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MEtqdjVRRRAB",
            "text": "This was my first time at Victoria, and I was truly impressed. We didn’t have a reservation for brunch, so we grabbed a drink at the bar while they found us a table. Cory made us fantastic espresso martinis while we waited, which was a nice touch. Once seated, the host was incredibly attentive, making sure we were enjoying our meal, and our server offered some excellent recommendations. The food was absolutely delicious, and the ambiance really captured the essence of Harlem. Be warned, the Mad Fowl Sandwich is no joke! It’s definitely the spiciest chicken sandwich in Harlem, but totally worth it. Can’t wait to go back and try more from the menu!"
        }
    ],
    "reviews_count": 88
}