{
    "name": "Settepani Restaurant",
    "place_id": "ChIJsWCOAA72wokRfHCK0ztm1Vs",
    "grid": "MN10",
    "address": "196 Malcolm X Blvd, New York, NY 10026, USA",
    "rating": 4.3,
    "user_ratings_total": 787,
    "phone_number": "(917) 492-4806",
    "reviews": [
        {
            "date": "14시간 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTlNYQjFSVTFFYkZaTE1GRkZjeTEwYlRocGJrRRAB",
            "text": "Everything this was really good and I'm a harsh critic when it comes to food"
        },
        {
            "date": "15시간 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5UVMwbGpRbGwxTWxCcmFHMWZOakZvYzJ4UmRrRRAB",
            "text": "Great service and atmosphere.  Food is not consistent. Breakfast is the safest bet.   Sangria is good."
        },
        {
            "date": "3일 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnME5sbEVUVVZpVUVScE4xbHpOVmRpYVU5b1YzYxAB",
            "text": "El manager es grosero y el chef de la cocina igual no se que se creen , cero empatia por la gente."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWRFdFa3hTM3AyTFY5RVVYRkZVMkZTTjFwRFVGRRAB",
            "text": "I really love the atmosphere here. The food and drinks are good, and the employees are so friendly. We got to speak with the owners and they're the loveliest people. Definitely check it out!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGMGJrYzRXV2hvU2s1elJ6WmtiV1Z4YVdwa2RtYxAB",
            "text": "Went there for dinner (not baked goods). It was an average neighborhood Italian. They no longer have certain things still listed on the menu, like Italian lasagna (the kind with white sauce and nutmeg), replacing it with standard American style fare."
        },
        {
            "date": "3주 전",
            "language": "nl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210bE9YRlFPRkZNZG1RMFpWTlBTRkJmYWpJdFIyYxAB",
            "text": "Fijne lunch en koffie winkel heerlijke \"dolche\" en super kwaliteit koffie zonder poespas (add on) gewoon koffie puur !  Gelegen op een rustig stukje  met relaxed terras fijne bediening en normale prijzen...."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcVMyeDFPR1Y0ZDFOcU0xRnhkazV1TTJwNFIzYxAB",
            "text": "One of my favorite hidden gems in Harlem. I love their pastas and they have a great selection of wines and desserts to choose from. Perfect for a date night."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdVNqSkJZMHhJV0dSMFJFbG5TbGxwZWxKTlprRRAB",
            "text": "Settepani catered a dinner party at our home. Giovanni helped with the menu development, and on the day of the event, when he delivered the food he walked me through the reheating process. The food was a hit, in particular the pistachio crusted lamb chops. The bakers adjusted the celebratory cake to eliminate gelatin. And an added bonus, we all felt Giovanni's calm and friendly demeanor. We look forward to working with Settepani in the future. Thanks"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkMmNXc3RkRm96Y2xOWlUyb3dWR3BtY21GMk1WRRAB",
            "text": "Great experience. Food quality is excellent. Highly recommended."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wVlJYQndSR3BoVmtsRWFsZFFWRTFDYzJjMWRGRRAB",
            "text": "The coffee pastries and other sweet treats are so yummy!! Perfect to start a Sunday morning!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wdE9EWjVVMlJzWHpKWmEzUlVUV3d0TW5wcGJWRRAB",
            "text": "Love this place! The staff are always friendly and attentive; and it's a relaxed vibe.. One of my go to spots in the neighborhood for breakfast. I recommend the baked eggs - the Uova in Paradiso. Highly recommended!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201dmJXcFhWbE5YWkVWV1VFeE9kMGsxU21SMVRtYxAB",
            "text": "It was ok. Good sandwich with ok coffee at a reasonable price."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaT1EwTnpZbFpmWkdOZmIyZDZUelI2U2kxRU9VRRAB",
            "text": "Wonderful and great service and air conditioning"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWRmVVUjNOVlJxYmxkeFRVeElaMjVqTTA1U2RGRRAB",
            "text": "This was my 4th time returning to this restaurant, yesterday I went again and food service was horrible"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taclZHWnFSbE0yTFc0MFlWQk5ka2h6YTNVMWFVRRAB",
            "text": "JC was amazing!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WVVRURlBSbEIzZDNORE0zbGhNMmhUZDFwV05XYxAB",
            "text": "Fantastic happy hours deals. Vinny  was a perfect host."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dFkzRm5VMlpuWW5aamRtNW9jMnRrTTNkSlJtYxAB",
            "text": "Went for Sunday Brunch at 12:30pm. Food & service was perfect."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkQ1p5MVFVbkJ0TTFBemFHTkRNVzFuUnpSQlRHYxAB",
            "text": "Phenomenal Sunday Brunch Experience! Got the Polipo E Patate and Devoured! One of the best things I’ve eaten all year!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWbmVEa3hlQzB5Y2xsTFdHTjJhRzVSYzBZeU1WRRAB",
            "text": "The interior is beautiful , and the service is probably the best I’ve ever received in this city. Everyone is warm, friendly and inviting. I dined alone but I didn’t feel uncomfortable at any time.  If you’re looking for great food and even greater service this is the only place to go."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wamJETjNNWGhxVm5sVk9EQjJiMWhXUWtGVlNGRRAB",
            "text": "Brilliant food, pitch perfect atmosphere and exceptional service. Thanks to all the staff and especially Jean Claude for a memorable evening. Will return soon and often."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1SFpUWm5TRXBEUTFjNVlXUkVSREZEVjI1dGJrRRAB",
            "text": "Great atmosphere; our server Jean Claude was very attentive and friendly, and the food was excellent!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aQ1h5MTVTQzFETlRSWVgySnpNbUZXUTJzMlJXYxAB",
            "text": "JC was AMAZINGGGG!!! the pre fix menu was the perfect amount of food and was sooo good. JC’s service was great and makes you want to come back!!! Truly a Harlem staple ☺️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdVRGcE1iVlIyUjFaM1ZHYzBWamhwUXpkSlEyYxAB",
            "text": "such a great atmosphere! JC was the best server and entertainer! definitely will be returning! the lamb chops were great as well"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ocGVEUjFibnBwZGxSUGFYQkRkWFJpWms0NVpHYxAB",
            "text": "I am sooo happy that this Harlem gem has stood the test of time.  I think it just gets better and better. I have never had a bad meal here.I had the best almond croissant in the world and a delicious ice coffee last Saturday.  I had a great time enjoying my pastry while sipping coffee and watching folks stroll by...you should go."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNGRXVmFjWEJGU214U1VuTTJUbkZVY0hKTlkzYxAB",
            "text": "Jean Claude is the best!!! Best food in Harlem"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FdFdEWmxUbWhyYTFOc1ZFTmFXV3RhV0dkMFlsRRAB",
            "text": "I've visited Settepani several times and it's consistently been a solid Italian restaurant with a wonderful atmosphere—sitting outside on a summer evening with a glass of wine (always ask for the pairing they suggest) and people-watching is absolutely delightful! The service has always been exceptional. However, after experiencing their Father's Day menu, their food has truly captured my attention. I can confidently say it was the best Italian cuisine I've had in Harlem. Giovanni recommended the branzino, and I couldn't have been happier with his suggestion—it was absolutely outstanding. I am excited to try more of their revamped menu."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JM2RGSktMWGc1WjNaU1VYb3pTSEp4U3pkcVJHYxAB",
            "text": "food  good\nservices  fine"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cb1QwNVZObFJ1YVVoSGVtaEVYMlJhUlVjM1VrRRAB",
            "text": "Ice place, nice people, employees were nice, and good food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMakw0S3UzbXVTZ3dRRRAB",
            "text": "I thought the experience was splendid from beginning to end. However, I was really disappointed with the Rissotto.\nHowever, the drinks, the service and atmosphere still made this an amazing experience and I plan to return for another dish. My raved about the Ravioli, so maybe I'll get some pasta next time!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQckR4Wlhrak1pVjBRRRAB",
            "text": "A Taste That Took Me Back to Italy 🇮🇹\n\nYesterday, I had the absolute pleasure of attending a private event where I tasted a pastry that was truly out of this world. One bite, and I was instantly transported back to Mama’s Pappa’s place in Italy — the warmth, the authenticity, the love baked into every layer.\n\nThis wasn’t just dessert; it was a memory. Hands down, one of the best pastries I’ve ever had in the USA. Period. Whoever made it — bravo. You’ve got the magic.⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJbi1qYUh4NTUzemhRRRAB",
            "text": "The croissants are the doughiest and the scones are the driest we’ve had."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZZ2JIdENREAE",
            "text": "Worst pizza of my life . So bad I wouldn’t even buy desserts . Major turn off. An embarrassment to being “Italian. Literally skeeved out."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaTV2MVZnEAE",
            "text": "Servers were nice enough but seemed to be spread thin.  Doesn’t seem like anyone is managing this place.  Ordered a $10 mocktail and basically was served flat soda water with mint and cucumber and a few blueberries.  No fizz, no flavor.  Will not be coming back.  Get it together, y’all."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvODZTMDVRRRAB",
            "text": "3 days ago my friend and I visited the restaurant. The pizza and kale salad were good. The calamari was okay, a little too oily and salty. The waiter suggested that they would redo it,  my friend  and I decided not to. Everything seemed okay until I got home and looked at the bill. I noticed that I was overcharged for some of the items. Instead of $16 for the Kale salad I was charge $20. Instead of $17 for the calamari I was charged $20. I was undercharged for the pizza, instead of $22 , I was charged $20. Although the difference was minimal, I wasn’t too happy. Could the price difference be because we complained about the calamari? That’s rather petty.\nI know the city counsel has really done a number on restaurants, many not surviving.  However, you can’t go around changing prices. Once you show the price on the menu, that’s the price you charge.  It really takes away from the dining experience when you try to cheat the client. My friend and I won’t be going back there."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaGRlN1pBEAE",
            "text": "Still not my favorite place. Not sure why they are still open"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvanZuR1R3EAE",
            "text": "Lovely wait staff and consistent food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMTdPX2F3EAE",
            "text": "Pretty soulless place. Not very busy so not much atmosphere. Food ok but nothing special. Bread was very nice. When the bill came 3% was added because we paid by credit card which is the only time we saw that in our week in NY."
        },
        {
            "date": "6달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcHZEcE93EAE",
            "text": "Dire che è  un buon ristorante è  riduttivo della realtà.  Qui davvero, per noi, è  stato tutto perfetto."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dC1tRVdnEAE",
            "text": "Delicious, flavorful, friendly. Very nice experience."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3N3Nxd1JnEAE",
            "text": "I’ve eaten here many times, hosted my engagement party here, and recently hosted a pasta class with girlfriends. I love it here, it’s the kind of restaurant that feels like home. It’s warm hugs from the family every time you go. Quality ingredients and effortless vibes."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRX3B1YjRnRRAB",
            "text": "This is a pleasant little restaurant with a friendly, efficient staff.  My food was tasty, not a rave, but certainly not a disappointment. I’d go back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdHEtVFlBEAE",
            "text": "We went for late breakfast and was satisfied with Settepani\nThe staff was extremely attentive to us\nThe food was great\nWill come later"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbU9qSjBRRRAB",
            "text": "A great spot for lunch or breakfast! The staff is very friendly, and the dishes are excellent!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcUt2WE1nEAE",
            "text": "Gnocchi were excellent, everything else was really good, service was great"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfeU1TYVNBEAE",
            "text": "best service i have experienced in nyc. we sat in their cafe section (which was full service), where they allow computers, but there is also another full service dine-in section in the back that is laptop free. got pastries and coffee and matcha, all delicious. lots of seating and outlets. what really stood out however, was the service. our servers were kind and truly went above and beyond. they helped us move tables, explained all the pastries to us, brought us the wifi password, and even pulled out a space heater since we were close to the door. i will come back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmaHBPRkx3EAE",
            "text": "We have been a few times now, both for dinner and just to pick up desserts and it’s one of our favorite places in the neighborhood. 6th ave has a lot going on but this is the place to start. Dont sleep on the Pantone but better is the bread pudding made from it after.\n\nCan’t wait to go back. Jean Claude will make you smile."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcGJ6STl3RRAB",
            "text": "The woman behind the counter was very sweet and attentive. Every pasty I’ve tried from this bakery has been 10/10 amazing.\n\nI bought the olive oil as a gift for my dad and he loves it. The flavor is complex and perfect for dipping bread in."
        },
        {
            "date": "10달 전",
            "language": "fr",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2aDhhMXNRRRAB",
            "text": "A fuir. La personne derrière le comptoir n'a pas voulu nous servir."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2OVp2Y1dREAE",
            "text": "World famous cuisine from the best staff in the five boroughs. It’s like coming home to your family away from home."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNWQzV25BRRAB",
            "text": "I went here with my boyfriend and have been a customer in general prior to going with him. They really failed at customer service for a regular. They promised a two top low table and then made us wait long and gave a different more uncomfortable table. They forgot our drinks and had to comp my boyfriend’s cappuccino as they never brought his out at all and only mine after reminding them. Extremely unpleasant and dismissive waiter and busser and I will not be returning. Also my french toast was burnt. Unacceptable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMeWZhZE1REAE",
            "text": "Love the setting and the food! It was a cool oasis given the heat wave in New York.\n\nService was quick and attentive. Calamari was great - very crispy, could have been made better with more flavors and tomato sauce.\n\nI enjoyed the kale, avocado, cranberries, and shrimp salad I had though I wish there was a bit less dressing. There was a lot and I couldn’t finish."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIbXF5Y09REAE",
            "text": "The food was so delicious, especially the peach mixed salad! I’m not sure if the salad is seasonal but if they still have it on the menu def give it a try!! The NA spritz were also good, but the lemon one (she bites) is very bitter so be mindful of that when ordering. I think the service could have been better and more attentive. We were seated on a small corner table outside and did feel forgotten often even though all the other tables around us got consistent service. But besides that I’d recommend trying this restaurant for a yummy meal with njce ambiance in the heart of Harlem."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEeEt6YWVREAE",
            "text": "I recently dined at Settepani and was blown away by the quality of the food. The steak was cooked to perfection, the ravioli was marvelous, and the calamari was fantastic. The drinks were delicious and the service was top tier. Our host, Jean Claude, was amazing and provided excellent recommendations. The pastries were also tasty. Overall, a fantastic dining experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNC1xZTlBRRAB",
            "text": "Arrived at the restaurant and was seated by a very kind gentleman with a nice sense of humor. Ordered drinks, they were pretty good, additionally ordered a meal and it was good as well. There’s an outdoor seating area that is pretty spacious. I ordered the branzino and potatoes which i thought were delicious. My friend ordered the salmon with olives mashed potatoes & asparagus. Her mashed potatoes were visibly gummy. The fish and veggies were great though. I’d come again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUN2V1ZXhnRRAB",
            "text": "A quaint restaurant & loved by the local residents!!  We were celebrating a college graduate & brunch was on the menu! The host & team were very accommodating & attentive  ! The food was out of this world!! I ordered the Margherita Pizza... mouthwatering  & tantalizing to the taste buds 😃! Others had the steak & fries (crisp & prepared just right, an elevated fry) , and  the salmon dish! We laughed & had a Grand celebration! Thank you! The ower stopped & greeted us was an absolute treat!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURacjVqS0pnEAE",
            "text": "I had a great experience here! The service was kind and friendly! We had calamari, and it was cooked perfectly. It was nice and tender, not rubbery or hard to chew. We also had the Margherita pizza and the spaghetti bolognese. Both dishes came out piping hot and they were delicious!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1cF9hQ1JBEAE",
            "text": "Update:\n\nService was horrendous. It took them 20 minutes just to come to our table to take our drink quarters, then it was another 15 minutes before we got those drinks, and the server didn’t even bring them all out. Finally after 30 minutes, all the drinks were there, however the food took well over another hour after ordering before we got it. We also sat outside the restaurant on the other side of their barrier. So essentially we were just on the street in a random table by a bush that was point and pricking us constantly.\n\nTheir bakery items are pretty bad. Don’t get any of those because you will be disappointed.\n\nOld:\n\nThis restaurant/bakery is decent if you are looking for some baked goods.\n\nWe came at night, so the bakery selection wasn’t fresh. We grabbed a few items (croissoints and pastries). I am surprised that pastries here are about $5 each - for the size I think they could be more reasonably priced at $3-4, especially the later it gets to store closing.\n\nThe croissant pastry that contained a lemon cream cheese was my favorite. This was still very soft and the filling was not too sweet yet just sweet enough. The flaky dough paired nicely with this.\n\nThe apple turnover is decent. The apple filling is nice and thick, however the pastry itself leaves a weird coating on the roof of your mouth.\n\nThe “cinnamon roll” croissant was not good. This tasted burnt and was so dry and stale. Definitely shouldn’t be serving that!\n\nOverall ok experience. Would I be back? Probably not."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaGFXeERBEAE",
            "text": "MY ORDER : biscottti (chocolate)\nAnd almond cookies.\n\nI came inside for an ice latte (coffee beverage) and a snack… they didn’t have any plastic togo cups so I had to use the hot coffee large cup(which is fine). Overall the seating is limited because majority of the seating area is for dinner guest only so they have bar stools and benches for “quick bites in and out guest”. Overall I’m having a peaceful time at this restaurant before I call it a day. The staff are professional and nice . Great customer service !\nI would probably bring my family here for brunch and what not.\n\nPlease support the locals!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dmQzQVBnEAE",
            "text": "Food here is always good. Customer service from the weight. Staff has always been awesome, and the atmosphere is very nice. I sometimes go here after a long day and I want a little bit of a dessert and a really nice coffee but I’ve also gone here multiple times, their brick oven pizzas, and also their calamari. We also got a chance to taste their new donut that they put on the menu, which was awesome. I’ll add a picture."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1dTdyNlFnEAE",
            "text": "I love ice cappuccino ( almost 6 dollars).\n*Update January 2024*\nAfter coming here for years. A regular of the place, I was surprised to be rushed out when it was nearly emptied. What bothers me is to be talked in my face. Two servers were talking about me like I wasn't there. They could have asked me if I wanted something else, not bringing me the bill and talking about me like I wasn't there or if I was blind.  Very unprofessional attitude."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKb0lYb1pBEAE",
            "text": "We came for brunch on a Saturday afternoon and the atmosphere was very weird. Employees seemingly not communicating and yelling at each other. It was also HOT in this restaurant, nearly hotter than it was outside. The thermostat said it was 81 degrees inside. We were all sweating. We ordered pizza to share and it was bland. The other entrees we got were okay. The weirdest thing was my friend ordered the shakshuka, which ended up just being eggs scrambled with veggies? Not shakshuka at all. Service was slow and they weren't attentive, never checked on us or asked us if we needed anything."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGMnRHRUZ3EAE",
            "text": "What i love the most about Settepani, is their passion for customer service! The owners are incredible and the staff is amazing. Today i tried panelle, fried calamari, bellini and pizza margherita (so thin and crunchy).\n\nAbsolutely loved my experince there and i recommend this place to anyone for lunch, brunch, dinner or anything in between🙌🏽"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXcUx6U3B3RRAB",
            "text": "First off, Giovanni and Valentino were great host & wait staff. They made us feel so welcomed and special for our birthday dinner. Everything and I mean EVERYTHING was amazing 👏🏽.  I had the black linguine with seafood, please note it's spicy 😋 ❤. My friend's ordered the salmon 😋 and the lamb chops, hello it was falling off the bone. The drinks, fantastic, I'm a drinker so it's worth the coin; the bread pudding... it was soooo delish.\nLast but not least the ambiance was beautiful & they had great tunes playing in the background.\nTHANK YOU GIOVANNI AND VALENTINO,  WE SHALL SEE EACH OTHER AGAIN...REAL SOON"
        },
        {
            "date": "2년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoOXZDc2l3RRAB",
            "text": "Très jolie petit café dans Harlem.\nNous nous sommes arrêtés pour prendre un petit goûter.\n\nLa décoration est vraiment trop cozy.\nQuand on rentre, on voit un grand nombre de pâtisseries qui donnent très envie.\n\nOn a pris 2 pâtisseries et 2 café.\n\nC'était un peu copieux car c'était une bonne pâtisserie américaine à la crème au beurre.\nCelle au caramel était beaucoup plus crémeuse que celle au chocolat, du coup bien meilleure.\nLes cafés étaient excellent.\nJe le précise car c'est compliqué de trouver un bon café aux États-Unis.\n\nJ'ai adoré ce lieu.\nJe le recommande.\n\nA tester pour déjeuner ou dîner lors de mon prochain voyage à NYC."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtMXRMTnJ3RRAB",
            "text": "My friend and I stumbled upon this place while we were exploring New York City and are we glad we did! Settepani gives your small little corner of heaven in a big city like NYC. The food was all soo enjoyable from their pastries to their salad to their pasta! The staff was so kind to us and gave us great recommendations on the menu. We will 100% be visiting Settepani in the future."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhd2RXX1R3EAE",
            "text": "We had a ball at Settepani for my friend’s surprise bridal shower yesterday in the midst of Henri. Needless to say, Giovanni, Luca (?), and Sophie showed us a good time and everyone had a wonderful experience. From the special drink, Nicole’s Gimlet, to the special appetizer in her honor, we were very much in awe of everything. Not to disappoint their menu was awesome and the food, as always is awesome. We want to thank you all so much for receiving us and our party and working with us with all the details. You will see me again hopefully sooner than later. Again I thank you so much with all my heart in helping us celebrate our friend and her future endeavors in life. 🥰♥️😘🙏🏽✨"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyZ3Etb1JBEAE",
            "text": "I really liked that the place was not crowded and the music was great. The food was really yummy too and I thought it was a good portion size if you’re not trying to be extra stuffed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREdTlpZk9REAE",
            "text": "This place is magical. You feel like you’re transported to another place. The vibes, service, coffee and sweets- amazing! I would love to return to try their dinner menu."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5NjQzYUp3EAE",
            "text": "I had meatballs my children had hamburgers earpasta. The place was clean. Great dinning music.  The cakes looked great. Pre Valentine's Day."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbWF5MjF3RRAB",
            "text": "It is a nice place and the waiters were really nice. Their pizza was not good. My wife liked the creamy pasta but I also didn't like their pasta. Also Pizza Prosciutto was 20$ on the menu but when the receipt came it was 25$.\n\nFood was 3/5\nService 5/5"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1M0xXc1dBEAE",
            "text": "I stopped here for breakfast before I went to get married, but this place has ruined my day. I have a dairy allergy and told the waiter twice to make sure he understood that I did not want mascarpone on my sandwich. He said fine. The sandwich comes out and I’ve gotten through half of it when I realize something white and runny is coming out of it. I open it and there’s a healthy portion of mascarpone cheese on the sandwich. I immediately returned it and was obviously very upset. I have been bloated and gassy for hours!! What’s worse is that when he brought us the check, the sandwich was still on the bill. He and his coworkers were so confused why we wanted it off. You literally fed me something I told you I was allergic to. I cannot believe this is the experience I am having in your “high-end” establishment. I am beyond disappointed. Where was my apology? Where were my comps?? This was a terrible start to a wonderful day."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2dXZETFV3EAE",
            "text": "It was my first time and it was a pleasant outdoor sitting. Waiter was attentive and pleasant. Just had a quick bite with friends while walking through the neighborhood. Will visit again"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdEp2NTJnRRAB",
            "text": "Food was great. Service was great. There was one minor hiccup. We ordered blood Mary’s and received completely different drinks."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5bjRiTzRRRRAB",
            "text": "I could spend all day at Settepani. Actually I have actually spent all day there before. Super inviting atmosphere with a nice staff and even nicer owner/managers. The food is good and beautiful and they have  an A1 night vibe with unique drinks. You may see me there some time!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlZ0tyU1ZREAE",
            "text": "I wish I had taken more photos of what I bought! The atmosphere here is great, as is the staff. Customer service was top notch. The desserts/baked goods are rich and well priced.\n\nMy friend and I very much enjoyed the red velvet, cannolis, gelato and espresso."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoeFlhRVpBEAE",
            "text": "The food was amazingly delicious!\nAlbro is so kind just a breath of fresh air soon as you walk in . And I’m not having such a good day so I thank you for taking the ease off enough for me to smile ! Sb : lol sorry if I spelt your name wrong . But I will definitely be back ! 10/10 that croissant was so soft just enough crispy and the right amount  of veggies and egg and butter 🤤"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiczU3ZW53RRAB",
            "text": "Alvaro & Titi - The happiest Monday mornings❤️ From the avocado toast to the steak and eggs (let’s not forget the Chardonnay) there’s never a better way to start an amazing week ‼️❤️"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOMmF1SmhnRRAB",
            "text": "I went to the location in the Time market in Brooklyn and I ordered hot chocolate it should be illegal to sell something that taste that bad. I can only imagine that this is what sewer water taste like. I took one sip and I wanted to spit it out across the table it was that bad."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXN2IyU1VnEAE",
            "text": "This was my first time visiting this restaurant.  We were celebrating a family members Birthday. The food and the drinks were great. The service was outstanding starting with our waiter and the owners who greeted us and were very kind. Great place we definitely will be returning."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1N1lHcnp3RRAB",
            "text": "Best grilled octopus with chickpeas.  The ravioli with artichoke is not available in the summer but it is amazing. Excellent food and service. You feel like you are visiting Italy."
        }
    ],
    "reviews_count": 80
}