{
    "name": "Lucille's Coffee and Cocktails",
    "place_id": "ChIJbblrGCX3wokRM4FasdVVFio",
    "grid": "MN10",
    "address": "26 Macombs Pl, New York, NY 10039, USA",
    "rating": 4.7,
    "user_ratings_total": 390,
    "phone_number": "(646) 370-4260",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWbmJHbHJhaTFhWlVzdFMxTlVUV2xJTWtwNU5FRRAB",
            "text": "I like it its decent"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZeWRWUm5VVlJ6VVZKMlNFcFJaVzF3UTNWNlRsRRAB",
            "text": "5 stars isn't enough to describe how amazing Lucille's is. From the host Isaiah to the amazing food/drinks, Lucille's will be the highlight of your NY trip. The jazz band was next level, excellent composition to accompany a great experience. And the atmosphere is so welcoming and warm, exactly what you should expect from a jazz cafe. This establishment is worth every single penny you spend, and I promise you it is. I will be returning because this just became a must-see-again for NY."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201WVUzVXRTMFZ5V2xaS2IzUXRiVEEzWTJoc1dsRRAB",
            "text": "This place is a blast! I went on a Thursday and caught the end of one and then a full jazz set. The full set was incredible. They even had one of the best tap dancers I have ever seen, and two or three singers. My drinks were amazing. The food is fine. Maybe there are great things on the menu, I cannot say. I had pizza and I tried the salmon of a woman I was seated with so we could both get it. Both were fine, not bad but not particularly amazing. The music and the decor were fabulous though, and the staff was so nice and friendly. I had soooo much fun and would definitely go back. A very intimate and lively jazz experience, and also very youthful and energetic. Not the kind of place where everyone is silent and you can hear a pin drop. Those places are fine, too, but jazz is about freedom and expression, so it is nice for the vibe of the venue to match that as well."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNk1FRkxWSGxQUkdwRlUzSlFPSG8zUjJsaU4xRRAB",
            "text": "Truly a great atmosphere to come into with family, friends, lovers, and everything in between. Their food menu was diverse and delicious and they know how to maximize the space. The Saturday nights with jazz music are such a treat!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMldWaGlXVk50TnpKSmVqYzNkV281TkY5VWFtYxAB",
            "text": "Very cozy and lovely place. Live jazz and great food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRdGRIQmlTVUpKUmxwalZUWTBUVVEzVVUxbFkwRRAB",
            "text": "To say the food was great is a understatement thank you for being open early today 😀 shout out to Arrianna for the excellent service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twWlkydHFWbUp1VjFOelJqbFhTVWMwYlhseGEzYxAB",
            "text": "This spot has the right elements working together seamlessly. The freshness contributes significantly to the taste. The staff's lovely demeanor complemented their attentiveness. This place maximizes limited square footage. The crowded venue still delivered a pleasant dining experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOaVVqQTFSVXhDVVRVMFgwd3phWGQyWHpNelNXYxAB",
            "text": "Believe what they write. I came here 3 times so far, always something else from the menu and always surprised by the great freshness and flavor. They are great at sourcing good ingredients."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMmRGVnFTR1ppZVV3dGFXRmtiMDlvUjNOdVZsRRAB",
            "text": "Neighborhood gem deep in Central Harlem.\n\nAmazing ambiance, service, and menu. Great vibes and music always playing here. It’s both a cafe and restaurant so you can go for just the coffee/ tea menu or do a full meal/ pizza.\n\nGreat spot for working too, but note that there is no laptops/ iPads allowed on the weekends! I missed the once and the staff was really nice about letting me cancel my order so I can find another place nearby to work. A+ service for that.\n\nOne of my go to spots in this neighborhood."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsS1gzbG9VRnBvWlVKeE4zaElPVXhYYTNZMFdXYxAB",
            "text": "This place is the absolute vibe to get office/organization work done. The chorizo breakfast burrito Chef’s kiss 😚. Shout out to the midday staff 🫶🏽."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aa1VraFJiamh0V0hSU1ozUnNiWFJGV0U5RldtYxAB",
            "text": "Love this place. Always good food and drinks."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWVEwRXRkR0o2TlZCdGFFMWZha1pIV1c0MlFVRRAB",
            "text": "The purpose of this review is not to hate or harm this restaurant in any way, shape, or form. That being said, I hope you take this review as an informative review.\n\nAtmosphere: The place is pretty clean, spacious, and well lit. I saw people sitting on their own and others with friends. So, you can this place is not strictly quiet nor too noisy. Oh, I think they are also pet friendly because a girl with her huge dog went in.\n\nService: The girl who helped me with my order was polite, friendly, and efficient.\n\nFood: I ordered the Smashed Avocado and the Acai Bowl. The flavors were okay, but the downside of it were the portions. I mean, I'd let it pass for the Smashed Avocado, but he Acai Bowl was ridiculously small.\n\nPrice: Honestly, I feel like the flavors don't quite compensate their prices. Of course, this is my experience with my order. Perhaps other items from their menu meet the same level as their prices."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taeU0yeFJjMlJ1WjA5VGMxWkNSWGxOVjJkTVQxRRAB",
            "text": "Lucille’s is a true gem! From the drinks, food, service, and live jazz performances, Lucille’s is on point. The ambience of the restaurant along with the music is top tier. 10/10 experience!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjeWJYZzVOMGhvV1VkbVIyTkNaazVzYUVaM1NuYxAB",
            "text": "I love this place. I go at every opportunity; friends in town, date night, brunch. I almost hate to post a positive review because I like that it continues to have an off-the-beaten-track kind of atmosphere."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOM2FtVmxUelJLUzNGTFpIZ3RSMUZaVUdkMVVVRRAB",
            "text": "This is one of the very few establishments that genuinely made me run to leave a review because, as a first time customer, I’ve seen this restaurant on Instagram and such, but you see these places and “plan” to go, but I couldn’t be more stoked that my night led me to Lucille’s tonight because from hearing the music and seeing such a lively crowd vibing outside before even dining from a block away?? I was sold!! The gentleman at the front door, Isiah, greeted us so kindly being that there was a wait but allowed us to go grab drinks at the bar, and sat us the MOMENT a table opened and was cleaned off. He directed me to Elizabeth who was so kind and attentive all night, and with so many people in the cafe, my experience felt beyond personalized and I was well taken care of. I had a Rose Sangria and it was 10/10, along with the chicken nugz, the power greens salad and and meatball and burata pizza pie. Will definitely be coming back with all of my friends and family for such a comforting, and lovely, crowd! (P.S. the live jazz was absolutely amazing…the solos, the singing, and even the perfect amount of time in between to wind down) my new favorite spot!! 🎺🗽🎷🤩"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkUlgyOTVUekl3VFZKR1VUaHJkekZ2YzJkQ1JWRRAB",
            "text": "Lo amé. Excellent coffee and the breakfast sandwich was delicious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwNFNIcEZSa1oyUWxBeVowdFVZVFJPVEdwRFFWRRAB",
            "text": "I committed to returning after my first visit. The team makes service feel personal and sincere. This place maintains modern d?cor and hygiene. The cuisine demonstrates professional skill and fine sourcing. You receive full value for what you pay."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVlNDMXpaVlYxVW1SU1dtSk5ZVTVhVTE4NFRuYxAB",
            "text": "Their hot honey latte was so good! Love the staff! Friendly and made my stay comfy"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CR01sZFdWWFo2ZDFOemRFRXhibFpxVUZoQ09YYxAB",
            "text": "Top-notch pizza, great jazz and warming staff"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWlRGQTRlRkp3TTBoTE5sVjNVa1JtYXpSblZWRRAB",
            "text": "I heard good things about the restaurant and decided to bring my grandparents from out of town. Had a reservation only to arrive and find out that it would be a 30 minute wait and there weren’t any tables available. Hostess shared that they…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOTVlWTlZOemwyVm04MlZHMUxVVGRZU2psR2RXYxAB",
            "text": "Best vibes"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWaWQwTnJNbkpLYldVMldYSmFkVU5JZGxVMGNrRRAB",
            "text": "I am crazy about this joint!! The patrons are pretty,  the decor is lovely,  food delicious and the service is great. They make  good  cocktails too. And did I mention that they have live music??  There is nothing bad about this fabulous neighborhood gem. You should definitely go."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOTU4yYzFja1IwV1VwamIwbFdjbkpXV2pCbE5tYxAB",
            "text": "I absolutely love this place. The pizza, the coffee, and the brussel sprouts appetizer was so good. I can't wait to go back again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prNFFqZzBMV0o1WjNGYWVVNWFZMVZYWTFodVkyYxAB",
            "text": "Great food and vibes!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxaDh5THR3RRAB",
            "text": "Beautiful spot for brunch, dinner, or morning joe.\n\nLove the Mike's Hot Honey Oat latte."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMS2Z4UGZFMmNia0h3EAE",
            "text": "Lucille’s is a wonderful place to grab great coffee with attentive and warm service, and a great vibe. The music is always great, as are the people. Lovely neighborhood spot to get great quality food and lock in when you need to get something done. Love the food, staff, and its cozy setting."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOdmdfOFREbHRuZE13EAE",
            "text": "Love jazz night! Pizza and lemon drops are amazinggggg! Definitely my new spot."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNNkF5S1Q0bTRQSFh3EAE",
            "text": "Food was good. Staff was friendly. Not a fan of the seat yourselfthdn pull up by the bar and order system. It was quiet. Could possibly be due to a rainy Saturday. Prices could be better."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLWDJ6cU9ndUtydXR3RRAB",
            "text": "The grilled cheese and the breakfast burrito were delicious!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VMcXpxNzN5MS1hRS1RRRAB",
            "text": "I came to Lucille’s on a Thursday for jazz night, excited to enjoy live music. Unfortunately, the experience didn’t live up to expectations. When I asked to sit closer to the band, the waitress replied in a dismissive tone that those seats were “for two people,” even though it was a quiet weekday and the area wasn’t crowded. I was instead placed at the very end of the bar, next to the trash, which made the atmosphere feel pretty unpleasant.\n\nThe other waitress I interacted with also seemed annoyed when I asked a simple question. The food was mediocre, and the wine I ordered tasted oxidized. On top of that, sitting so close to the service area meant I could overhear the bartender and staff gossiping about customers, which was really distracting and took away from the music I came to enjoy.\n\nThe jazz performance itself was great—that part truly delivered. Maybe I’ll try coming back on a different night, but I hope for better service next time."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VPX19zZVNOck8yaEZ3EAE",
            "text": "Not worth the hype (if any), food is trash. Service is basically limited."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKSDY4TWlZMGNueE13EAE",
            "text": "We were in town for my child's graduation and stopped here for brunch before heading for the airport. Very inviting atmosphere.  Arianna was our server and she was awesome!!  She heard me mention a food allergy in a conversation with someone else and made sure to inform the kitchen.  The food and coffee were both very delicious!  Definitely go see Arianna if you are in the area!!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbzh6LXpBRRAB",
            "text": "Cool atmosphere and decor, food and drinks are average"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLcmhsX0tPLUluQW1nRRAB",
            "text": "The lasagna was giving more of a baked ziti, but still tasty, the humus was a bit loose some thickness would be nice and more bread. The henny fashion was not giving at all.  Over all tho bravo. great live performances and we got to see a gentleman tap dance during the set."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VNSF91YUgyc1lIaUZREAE",
            "text": "Food was bland"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKLU00ZkhtdWZYZE9BEAE",
            "text": "really cute and quaint cafe!"
        },
        {
            "date": "6달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZb3JqZzFBRRAB",
            "text": "Lecker Kaffee und schönes Ambiente."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcEszemp3RRAB",
            "text": "Great for casual hangout or intimate dinner with live music. Went on a Saturday night so a bit noisy if you’re planning to do a lot of talking but the music was great."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcllUZ3FRRRAB",
            "text": "Did not enjoy my dinner but great atmosphere and jazz music!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOW9uZHZnRRAB",
            "text": "We had wings and fries. Nothing crazy. Was okay. We enjoyed the space and ambience. Got a bit crowded around 5-6.\n\nWould prob come earlier and try the pizza or for the live band."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvZ3Rya0pREAE",
            "text": "I love a quaint place when I eat alone, Lucille, Salmon Burger, and Hibicus Spritz are my comfort food. Oh my goodness, you need to try their fried Brussels Sprout (not shown). I had it the 1st time I ate there and an order to go. THAT GOOD!!!!!! They have Friday entertainment."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbDQyR0J3EAE",
            "text": "This is a 5. Try their breakfast sandwich with sausage. And the latte is equally great. Go."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJZ3RmY2RREAE",
            "text": "Their breakfast sandwich and honey latte are my staple breakfast order. I’d come here everyday if my pockets allowed"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJajlqTjhBRRAB",
            "text": "My coffee spot!  when in the area\nThe space have great atmosphere, well decorated\nVery friendly staff, great coffee\nNicely presented."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMGJQOEJREAE",
            "text": "Great food, best coffee I have ever had, and the drinks are good they use real fruit no cheap syrup"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJc3VPMmpnRRAB",
            "text": "Great start to my day! Enjoyed the breakfast sandwich on a sunny Saturday around noon. No wait, kind and friendly staff. Would recommend"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NlBYSUpREAE",
            "text": "Go on a Friday!! The live jazz was amazing! It just keeps getting better and better! This would be about the 5th time I’ve been to Lucille’s. The first few times were a different menu. This new menu is really good! We had really great pizza and wings, and DELICIOUS mocktails! I’m looking forward to going back and trying out the rest of the menu!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MTlfVDFnRRAB",
            "text": "One of my go to cafés for easygoing weekends. Although I wish they had more food options, everything I’ve had there has been really good, and hearty. Love their matcha! I love that some evenings they have jazz, you don’t I wish find that around New York as much anymore."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJak1XZUJnEAE",
            "text": "Such a beautiful atmosphere in this place. Such a chill vibe to this place. Let me tell you something this place is a MUST, a GO TO. Everything is fresh and the food is affordable. If you're looking for a nice, chill, and cozy time to just spend this is the place."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdU1pQ1dBEAE",
            "text": "I came here for brunch. Very intricate venue with lots of Windows for natural sunlight. The menu is simple and versatile. Full bar and coffee stations. The staff is very friendly! However you have to place your order by the end of the counter. It is not a full service restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4ZzhHazZRRRAB",
            "text": "Ambiance 10/10\nGood 9/10\nService 9/10\n\nI went after work at 8ish. There was a live jazz band playing, it was very nice. They also had cool lights that set the whole vibe. I was t too hungry so just ordered some cheese with bread and two cocktails. Definitely see myself going as either a chill night or recap with friends by the bar. Either way, I was definitely recommend this place especially for the neighborhood this is a gem.\n\nOverall 10/10."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzN3REUVB3EAE",
            "text": "The restaurants decor was tranquil, with an  infuse of plants comforting your eating experience.\n\nNatural lighting allows the establishment to be room temperature lit.\nThe Harlem feel was established the meal did not disappoint.\n\nOutdoor seating is available\n\nWe stopped by for breakfast and got two breakfast burritos 🌯 with eggs, potatoes, cheddar cheese, avocado, with turkey bacon 🥓. The burrito was healthy no additional seasoning or peppers. The hot sauce is needed. Pricing was $25 for two burrito breakfast which provided nourishment.\n\nThe music and customer service was excellent the wait for items requested was a concern, but the decor made up for those concerns.\n\nThe water was filtered the glasses clean."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRM01hSTRBRRAB",
            "text": "Such a beautiful space, with great food and drinks, and LIVE JAZZ on weekend evenings (Thursday-Saturday)! One of my favorite establishments in Harlem and NYC in general. Be sure to try out their chocolate budino cake!!! It’s absolutely delicious!!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxdXV6Ym1nRRAB",
            "text": "An absolutely amazing place for coffee, cocktails + food!\nJUST TO CLARIFY— THEY ARE OPEN ON\nThursday, Friday and Saturday for dinner! 4pm-10/11pm\n(Seems like a tech error on googles part)\n\nThe vibe is awesome, staff is very friendly + accommodating and there’s a whole tree inside!\n\nCome support your local business, you won’t regret it."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbVpTTkhBEAE",
            "text": "love love LOVE this place. service and vibes are a 10/10 AND there are plenty of vegan options. not to mention the best espresso martini i've ever had & mimosas with fresh squeezed orange juice"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKN0lxMFlREAE",
            "text": "Lucille’s is a great choice for a tasty breakfast or lunch in Harlem. I’ve ordered from there a few times, and it was always made with fresh ingredients and lots of flavor. I usually get the Kale Salad with Salmon, Garlic & Parm Fries, and a Breakfast Burrito for brunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0MFBLZTJRRRAB",
            "text": "The vibe here is very chill. Seems more like a coffee shop to me but still very chill and welcoming. The vodka pizza was good, lol it was a lot bigger than I expected but still good. The bartender also had a heavy hand 😉 so the drinks are very nice too. The area is pretty quiet too definitely a spot to go to chill on a weekday after work."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsenFUOVlBEAE",
            "text": "This is my 3rd time here; this time I got here at 1pm. My friend came to meet me. No one came to the table so we went up to order- $51 for two fried chicken sandwiches and an expresso martini.\n\nWe chatted for a few hours then she ordered a honey latte and I got a drip coffee for $12. They may’ve accidentally have her a Mike hot honey latte-  idk cuz I didn’t taste it. My coffee was soooo biter. Gross.\n\nShe left and another friend met me for happy hour- BOGO drinks from 5-6. The night staff is sooooo wonderful. Immediately they introduced themselves and told me it’s a new staff, menu and deals. The lights went down. It felt like a totally different place.\n\nExperience got a lot better- we ordered 4 drinks, a pizza and fries."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkdThfeDNBRRAB",
            "text": "Stumbled upon this gem last Friday and ended up having the most fantastic afternoon getting stuff done. The vibes here are just 👌 Tried Lucille’s Breakfast and it totally hit the spot! Huge thanks for the awesome hospitality. Already counting down the days 'til I can come back for more and catch one of those live music nights! 🎶"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZa3NxSHRRRRAB",
            "text": "Been anxiously awaiting this place having food to try! Worth the wait. Got the shrimp and grits, jerk chicken tacos and the Mac and cheese. All were delicious! I’m unsure if they plan to expand the menu or want to keep it small and light…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMycVp1bGtnRRAB",
            "text": "Came here with my partner to get some brunch. Unfortunately I missed their (famous) bagel, but got a fried chicken sandwich and a breakfast burrito. They were soooo good (especially the burrito with the sauce they give it with). We also had…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiZ2FpcmlnRRAB",
            "text": "This is one of my favorite coffee spots, absolute fave for atmosphere and delicious food/bring out-of-towners to a treat in Harlem. Lovely staff, live music nights and an adorable book share shelf."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNieUxYUy1BRRAB",
            "text": "Amazing food, fair prices, beautiful interiors, great place to chill out. Highly recommend :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aG8zcFNBEAE",
            "text": "The ambiance is great, chill bar/coffee spot. Customer service is great, waiter comp’d a drink for us because I made a mistake ordering within the specials. It was a great experience. Drinks are really good would come back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURReWJqa3pnRRAB",
            "text": "As a medical professional in NYC, looking for late-night spots to get some work done in a nice environment is surprisingly sparse. To be greeted with a no-laptops policy is quite odd when there's a child hollering, watching YouTube in the corner instead. I wish I could say that I was able to dine here, but I will never be back as they don't cater to hard-working people. As far as the dress code goes, perhaps they should cater to a crowd that is well dressed, articulate and willing to spend some money at the establishment. Thoroughly disappointed as the ambience was nice with the dim lights and barista making drinks at the bar, and I walked 30 minutes to get there. If you're a student or professional in a similar predicament, I strongly recommend the Starbucks down the street instead."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmX2FqSE1nEAE",
            "text": "This place was fantastic! I went for the Harlem Bomb Shelter open mic night and had an amazing time. The drinks were great! I had the wings that night and they were so meaty. I loved the atmosphere, it is a bit small, but not tiny. I hope to go for brunch next."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1cWRHejRRRRAB",
            "text": "Never again! Came here and was highly disappointed! The chicken was dripping in oil to the point where you held the chicken up and it was still dripping into the puddle of oil already on the plate and into the waffle. The girl behind the…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5Nl9XbC1RRRAB",
            "text": "I’ve been wanting to try this place for awhile because it looks so cute but never got the chance. Finally decided today was the day to order some delivery and it was soo good! We had the guava waffle, açaí bowl and breakfast sandwich.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3djRuQnJBRRAB",
            "text": "Been here a few times now and the food, service, and atmosphere is the perfect combination. I would recommend this to anybody!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1M3VYbzFRRRAB",
            "text": "This place was awesome. Thought it was a little pricey but honestly the portions and flavor don't disappoint. Honestly the best fried chicken I've had in a VERY long time crisp outside with a juicy AND fully cooked interior. The blueberry…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5NGVEajV3RRAB",
            "text": "Love this neighborhood cafe that hits all the boxes!\nIt's a coffee/cafe vibe from 8am to 4pm and then transitions to a night/cocktail vibe.\nIt's a bright, airy, and light space.\nLaptops are allowed by as of February 2024, laptops are no longer allowed Saturday and Sunday from 11 am to 5pm."
        }
    ],
    "reviews_count": 71
}