{
    "name": "The Row Harlem",
    "place_id": "ChIJUxX5Dy33wokRQAbASxmcU8s",
    "grid": "MN10",
    "address": "2374 Adam Clayton Powell Jr Blvd, New York, NY 10030, USA",
    "rating": 4.1,
    "user_ratings_total": 236,
    "phone_number": "(646) 767-9582",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTlQxaFNSbFUzV1dGQmJGaFJNbmhYTFhwNWJrRRAB",
            "text": "When we got there, it was a big fight out in the middle of the street in front of the club so that didn’t sit right with me and my heartbeat really fast but once I got inside, the atmosphere was peaceful there were people out there dancing and it was people were celebrating their birthdays. I had a good time with my best friend for her birthday. If it was good, it’s gourmet and she wasn’t used to it, but it was."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsMWNtTktZWE5XUW5oc1dFRmZiM3B4UW13M05IYxAB",
            "text": "nice chill spot"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKaE1sZGZiVzFoZEdSTGJYTmtNM1JDV2xkT1RrRRAB",
            "text": "This restaurant was over-hyped. They have a \"no hats\" rule, but apparently only for men. Also, they serve canned sodas. Got the salmon plate with \"collard greens\" and mashed potatoes. Plus oxtail empanadas and fries. It was overall bad. It should note STEAMED collard greens. Because that's all it was. Lightly cooked leaves. The empanada was just a little slightly seasoned meat in crust. And a lot of air. I was not a fan. But the BBQ jerk sauce wasn't bad. The fries were really good. Did I mention that they also serve canned sodas? Servers were polite, but loudly discussed their sports bets while they enjoyed football games on TV. There were no follow up visits to refill water or check on food quality or correctness.  It certainly didn't warrant an automatic 20% gratuity. Overall, the price doesn't match the food quality or atmosphere provided."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25obmJFUlVVMVJmZVRZelpuTkhZWEk0VVZsNVUzYxAB",
            "text": "I made reservations for my best friend birthday. I get there and they sit me where everyone was dancing and people were bumping my chair. I asked to be moved and they placed me by the bathroom and that was ok. When my friend arrived I had to ask for the waiter to come and take our order. Once he comes to the table he tells my friend and I the kitchen was closed. I asked him why he never came over to take our order. His words were I thought you were with the couple next to you. So we order a drink and they did not charge us for it. this was a very disappointing night for my friend and I for her Birthday at the row house"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CWFVVbDZTV1JuYURkVWFYbzNVWGd5YUMwd2MyYxAB",
            "text": "The Row Harlem would be perfect if it were located in Atlanta: poor service, overpriced and mediocre food, and a misplaced belief that it’s more upscale than what it is.\n\nLet’s start with the food\n\n1) The actual oxtail in empanadas was painfully dry, served with a side of…wait for it…barbecue sauce. While the meat did have a little flavor, the kitchen appears to have spent 30 minutes wringing out the moisture before stuffing it into the empanada shell.\n\n2) The salmon dinner was also a swing and a miss. The baked salmon comes with two sides, so I selected the truffle mashed potatoes and the collard greens. When I received my plate, there was a piece of salmon on it with mashed potatoes that looked like it came out of a box, along with spinach. Strike one. Sent it back and they returned 8 minutes later with the most embarrassing looking “collard greens” ever. It’s like they took the greens, chopped them up, added about 1 grain of season, and steamed them for 5 minutes.\n\nThe salmon was actually cooked medium well (they never asked for my preference), but completely lacked flavor, even with the skin intact.\n\nThe mashed potatoes had the same consistency of those found in a microwave dinner. No distinct flavor whatsoever, but probably the most favorable thing on the plate.\n\nOh and by the way, if you want a soda, be prepared for them to bring you a can. Classy!\n\nService was minimal. There was more effort to let people know about their dress code than the actual service. But I guess it didn’t matter because this wannabe “upscale” restaurant automatically charges a 20% gratuity, no matter how mediocre your experience may be.\n\nThe atmosphere inside was mostly dark. It’s a relatively small restaurant with about 10 tables or so, with the intent on presenting an adult, upscale vibe. Yet there was a big TV mounted on the wall with NFL football on to distract me from the bad food and service.\n\nThe total for salmon, empanadas, and a can of Sprite cost $60; with the automatic gratuity and the extra fee to use a card instead of cash, the total came out to $80.77.\n\nPeople like me will pay good money for quality food and good service, but this place offers neither. It belongs with the rest of scam restaurants that plague the good scene in Atlanta.\n\nThis place did nothing to dispel the myth that food in NYC (despite the tremendous diversity) is relatively average. Honestly, they should stop trying to be a full service restaurant and just be a bar with a few appetizers. If you’re a tourist, same your coins and go to a place like Melba’s where you’ll actually get courteous service and chefs who actually know to prepare quality food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMWRqWk1iREV0Y25wZmQzbFFVbWxHT1RWeGQxRRAB",
            "text": "Zae held it down.  Dope pic. 💯💯…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MVRUVnBla05FT1RoMlRqVjVWRlp0TFc0MlVWRRAB",
            "text": "Zae is the best photographer!!!! Enjoyed the experience here!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WbFkzbFJkR1ZDT0RkNU5rNHpielZhUW10eGNsRRAB",
            "text": "Great place, great food, great people, great vibes!!! Whenever in the area it's a spot I love to go to! 10 out of 10!!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGRlVtRm9PVWh4WTIxcVVVMU9XVkpzU0d0TFJIYxAB",
            "text": "This happened to be the worst restaurant I ever went to. The staff were rude, had us waiting outside for about an hour because they were running behind, the place is extremely small and almost everything on the menu was “out” they where some dishes weren’t available to order. My lamb chops came out undercooked; my kids food came out undercooked. I will never recommend this place to anyone."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNZnEyYlNYd1lhV3V3RRAB",
            "text": "We did not get a chance to eat.  Made a reservation for 3:00 today.  Get to the restaurant and they said they need an additional 30 minutes.  Go back in the restaurant at 3:30, they are still not ready. They said the had a big party the night before and the kitchen wasn’t ready and wasn’t sure how much food they had.  If that’s the case, I would have appreciated if they cancelled the reservation.  I would not recommend this restaurant….poor customer service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKaWtzOF84NFoyUzFnRRAB",
            "text": "Saturday afternoon shortly after opening with just a few patrons in the space was the perfect low-key enviornment for a nice lunch.  Very good start!\n\nOrdered the frozen GOTTI which is citrusy, refreshing, not too sweet, and has a '1-2-punch' that kinda' sneaks up on you.  Very good sneaky drink!\n\nOrdered the brussel sprouts (which were gone as soon as they hit the table), lobster mac & cheese, and the kale caesar salad w/ salmon.  Very good!  Very delicious!\n\nOur server, Sky, gave us the perfect balance of attention and distance.  He made sure that the food came out hot ... and that the drinks were served cold.  Very impressive!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VQdnZzT1NKZ01Ld1ZREAE",
            "text": "This restaurant was a letdown. The food (outside of the wings) was not good. The Mac and cheese was dry. It also lacked cheese. They only had the carrot cake waffles available. The texture was too soft and it just tasted like eggs. They weren’t able to make some of the drinks they had on the menu. The frozen sangria had no real taste to it. It’s strong but not mixed well.The oxtail empanadas were also dry and the bbq sauce it came with tasted like it came out of a bottle. The waiter who attended to us was very nice but for what they charge (plus automatic gratuity) there needs to be a lot of improvement."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNYU5zOXllX3ZyZk1REAE",
            "text": "Incredibly rude.  Apparently there’s a no hat policy, but no one felt inclined to tell us how til after we ordered.  I’m truly shocked at how poorly we were treated AFTER we ordered drinks, entrees and appetizers.  Issa a no for me."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMHVUbmR3EAE",
            "text": "Nice intimate place. Low key. Service was great and food was tasty.\nHowever if you don't have cash they charge additional $5 fee for creditcard\nAnd a mandatory 20% gratuity"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZOE1xQ1V3EAE",
            "text": "Would have gone back again if we had more time. The fries were the star of that plate. Everyone in the restaurant was looking around as to say, \"where's our food\" But we received our main dishes 40-45 minutes after finishing our appetizers and the waiter never came around to ask if we needed more drinks or anything.  Both were served at a good time and both tasted good.  But the main courses were too long of a wait."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJemFQZjNRRRAB",
            "text": "Quiet little place it was cute food was good very small."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdUpDS3VnRRAB",
            "text": "The sprouts are to die for  and the service is Devine.  My 3rd visit there was on their fabulous Mondays.  I think I purchased half the menu, wanting to try everything. Though I 4got my barmaid's name, I must say her Lemon cocktail took the edge off why I tried to sing to melodious sounds. I enjoyed my self. See you next Monday!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3X0tXUkRREAE",
            "text": "Was not impressed with this place, and I’m disappointed to be writing this review. However, I believe in learning opportunities, so I hope they take this feedback and make some improvements.\n\nService needs work. I was one of the first patrons (they open at 3), yet I had to wait to be acknowledged and seated. The space is small, so be prepared to sit close to other parties and feel rushed once the crowd picks up. On top of that, my waiter was rude and dismissive, which only made the experience worse.\n\nLimited menu options. Several items on the menu were unavailable the day I visited, forcing me to order something I wasn’t excited about—chicken & waffles. Unfortunately, it was a letdown. The waffles were dry and tasted like cardboard, and while the chicken was okay, it wasn’t cleaned properly (feathers still on it).\n\nAnd to top it all off, they have the nerve to enforce a dress code. Given the overall experience, I expected much better."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bC1pZ1BnEAE",
            "text": "Wonderful catering experience!\nI spoke with Chef Walter the day before I was hosting a dinner party for 16.  His advice on the menu was spot on.\nHe and his team delivered and set up the food on time and quickly.  The food was outstanding from start to finish.  Everything was well seasoned.  My guests loved everything!\nAmazing food and excellent customer service.  Highly recommend!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBbkpuclFREAE",
            "text": "Your service is crappy & food is over price and i was over charged for drinks during happy hour.. me and my friends was not happy"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfajRPaTV3RRAB",
            "text": "If you looking for a low-key and quaint spot this is a place to go in Harlem. It's a bar/restaurant with great music. Nice vibes!!!\nI went for drinks with friends we sat at the bar and listened to music. The drinks are strong.\nThe bartender is friendly and attentive to her customer's wants. She was engaged with her patrons in conversation. That's awesome!!\nThe prices are reasonable for a NYC bar.\nThe place is not big but enough for you to enjoy the atmosphere.\nThe location is quite busy. So, finding parking is not easy. There is street parking if you grab a space."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfM3FUaTRRRRAB",
            "text": "My coworker told me about this place, so i stopped by for happy hour. Decor is beautiful, Service was on point. Lightening was soooo dim i had to use the flashlight on my phone to read the menu. I was given free samples of the different sangria flavors… they were strong n GOOD. My friend n i ordered the Asian wings, brussel sprouts n deviled eggs for starters… ok soooooo the eggs had a strong vinegar taste ( horrible), the Asian wings tasted old but the sauce added on the wings was really good. I ate one and was done… my friend loved them n ordered more. The brussel sprouts were too hard for me n had apple pieces in them ( i didnt like them). For the entree i ordered… The Salmon, Spinach n mashed potato with a side of shrimp fried rice…. EVERYTHING on that salmon plate was soooooo salty i viuld not eat it. The fried rice was ok just alittle dry n fried kind of hard. I doubt i come back here but the drinks were reallly good.. and i lovedddd how the guy waiters were on point with making sure we were ok n if we needed anything."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOE9hb013EAE",
            "text": "Very small and intimate restaurant, food was hot and fresh. Service impeccable we got complimentary shots and our server was so sweet. Follow me on TikTok @foodiegirlnyc to see full review."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuM2ZEUmlnRRAB",
            "text": "Last Tuesday my friends and I went and we really enjoyed ourselves."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMXVtWEhREAE",
            "text": "This review is not for the actual restaurant “The Row” However these are the owners of the business next door. We spent $100 for three drinks... which is fine BUT, if you are going to give your self a 14% gratuity need to ask everyone \"you okay?!\" \"Can I bring you anything else?!\" Consistently. We had to ask 4 times for cups water because our bartender was in the corner on her phone on FaceTime with her leg up. There is no register, they use their phone to calculate prices. Other People were getting extremely frustrated and someone had to step in and help her because she said she was so claimed busy however, nobody is really at the bar.\nThis was NOT one of my favorites and I live in Harlem and I always support local businesses. And I actually really loved the restaurant “THE ROW” However I would not recommend. Money hungry and lazy."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbmNIbGpnRRAB",
            "text": "More like this\nUpon Entering, there was a gentlemen I would say he was maitred. After all he wore the hat of security/host. Needless to say the gentleman was very nice and professional, I felt welcomed to enter the establishment. With that being said First impression was a HIT!! The ambiance was romantically amazing, with perfectly dimmed lighting.\nI was actually there for a book launch party, While waiting to order drinks at the bar I was handed a menu for appetizers.l, even though I wasn't very hungry. One could not resist trying at least two appetizers. I ordered the salmon bites and deviled egg with crispy turkey bacon.\nOne may wonder why deviled egg, well to be honest not everyone can make a delicious deviled egg. After one bite, unbeknownst to me was perfectly whipped yoke with just the perfect amount of seasoning stuffed into the egg white and the crunch of the crispy turkey bacon was a matchless topper. I was already fully convinced that I would probably enjoy the salmon bites as well, and yes the salmon bites. They were visually enticing, the taste did not disappoint.\nThey were very juicy with a light buttery sweet sauce, a perfect prelude to a delicious meal. The Row Harlem did not disappoint, Oh I almost\nfailed to mention, the as close to perfection, Long Island Iced Tea. I highly recommend the Row and plan for on returning."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzMWVEVXl3RRAB",
            "text": "OMG love this spot love the food the place is just a  vibe, the main thing I love about this place is Sky the server he is so so dope a great vibe and his customer service is amazing. Honestly because of him I say 10 stars."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzOGJlZFlnEAE",
            "text": "They have great food, the service is just a little slow. The only thing that upset me was when me and my father walked in, they said no hats. We respected it and took them off,  as the night went on,  more regulars came in and they were all wearing hats. The staff didn't say anything,  either enforce the dress code without discrimination or don't have it"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYeWNuT093EAE",
            "text": "The best sauteed kale ever. The best lobster fried rice and phenomenal lamb chops."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudk9PUlhBEAE",
            "text": "Very small, yet intimate, venue. Not really suited for large party walk-ins...but they will try to accommodate. Parties of 2 to 4 at best. It fills quickly. There is additional outdoor seating which was closed when we dined. If you're looking for some place to quickly dine n dash this AINT it. Bring some good company and good energy, they definitely serving a steamy fusion of comfort food for the soul. We were a group of 5 (walk-in) from Htown and waited at the bar about an hour for a table. I utilized this time to enjoy a frozen Sangria and catch up conversation w/my group. The sangria is EVERYTHING... and yes, you only need ONE if you ladylike, two if ya' flirty, lol. Once seated our food came out within 20-25 minutes...but NOTHING was re-heated, microwaved, etc.... all cooked to order!\n\nThe jerk mac n cheese is a masterpiece and it's large enough for 2 to share. Nuff said.\n\nThe oxtail samosas with white bean were extremely tender and seasoned well (2 per order). You can tell it was pulled and stuffed by hand and cooked to order. Mine had more fatty meat but the fat was tender and flavorful too. My only suggestion is to have a sauce option other than BBQ.\n\nI also appreciated the sautéed collard greens which were sooo flavorful and HEALTHY since the life wasn't cooked out of them. My only suggestion is to either get rid of the large stems or tenderize them a lil' more.\n\nLast, our table had 2 orders of the lamb chops which they cleaned to the bone! Overall, I enjoyed the vibe and being able to taste the passion added into the food. A piece of my heart was left in this gem of a place. I'll be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIODkyaVpBEAE",
            "text": "When I tell you I’m so satisfied with my meal. It was well seasoned and tasted so good. My frozen drink which was the mango margarita and sangria mix was delicious also. Forgot to take a photo of my drink. The service was not bad either."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIZ3NlbHZRRRAB",
            "text": "My friend put me on to this spot years ago. Very local if you live IN HARLEM. The lamb chops are BOMB from here.. the crumb top Mac 10000/10 . Only issue I have with this place is the entree menu y’all should have it optional to change your sides . OTHER THEN THAT … THE FROZEN SANGRIO BE HAVING ME BLASTED love it here ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNzluQXF3RRAB",
            "text": "I visited this location in May 2024.  I was excited to visit this restaurant to support a Back Owned Business.  Their menu items looked so delicious.  When we arrived, there was no wait to be seated.  There is both indoor and outdoor dining.  I wouldn’t recommend this location for large outings as it’s rather small.  We were able to place our happy hour orders upon being seated.  It took forever for the appetizers to arrive. When I say forever, I mean over an hour.  Now before you get on me and say business are still short staff, I’m aware of that.  The place was empty maybe 6 people including us.  We ordered the oxtail empanada comes with one empanada.  There were no napkins or utensils on the table we had to ask for it.  I wanted to save for my appetite so I didn’t eat the empanada. I ordered the chicken and waffles. My girlfriend ordered the steak with mashed potatoes and spinach.  Again, it took a while to receive our order.  My chicken taste as though it was cooked in old grease.  That wasn’t the worse of it the chicken taste rubbery.  My girlfriend wasn’t pleased with her meal either.  When the staff checked on us, we told him we weren’t pleased with our meals he took it back to the kitchen.  When my girlfriend got up to us the restroom, she overheard the kitchen staff complaining about us using explicit language about us.  I thought this was very unprofessional.  We were polite when we told our waiter about our dissatisfaction with our food and for the kitchen staff to say what they said.  I almost feel like we should have known better ordering those dishes as the people at the bar were order finger foods.  There’s only one restroom in the restaurant it would be a line to use it.  I will NOT be returning to this restaurant nor would I recommend anyone to try it.  A definite waste of money.  There are steps to go down into the restaurant.   The restaurant is accessible via public transportation."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURialk3SDh3RRAB",
            "text": "Nana and Scott did an amazing job at taking care of us!!! The service, the atmosphere, the food. Everything about it was excellent. My group was visiting from vegas and this place made our trip worth it. Highly recommend all yhe mac & cheeses. 10/10 would come again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiLVBEaXBnRRAB",
            "text": "I'll never know what the food tastes like because I couldn't go inside because we had crocs on. I wouldn't object if the establishment wasn't overwhelmed by the smell of weed from the people right outside and had staff dressed more upscale than  at a BBQ. I came off of a friends recommendation, but I'd rather have my money go to a place that upholds the standards that they seek."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyXzhMNWh3RRAB",
            "text": "I would have over to rate this restaurant higher but they refuse to answer the phone while constantly canceling the order."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyN09ycVJBEAE",
            "text": "I came here to join my aunt for her birthday lunch. I was delighted by the Brussel sprouts!! And our party was treated so well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyaVBtelF3EAE",
            "text": "Terrible Ordered shrimp empanadas for the price to be $20 and they only gave two. Not only that I was automatically charged a 20 percent gratuity for a takeout order which I'm highly confused about. The icing on the cake was when I looked at my order and for the dipping sauce they gave me mayo on the side. I don't know why or who bright idea it was to give mayo as a dipping sauce for shrimp empanadas. I would never come here again or support this business."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMX2ZyM2tRRRAB",
            "text": "I’m so sad to write this negative review of The Row after many visits here over several years living in Harlem, but my most recent experience was extremely disappointing.\n\nI visited with a friend on a Saturday around 8pm. Although the restaurant was initially very crowded, we were seated at the bar, but as soon as we sat down, problems began.. The bartender (Naiajah?) was rude, dismissive, condescending, and sloppy. Our orders were both submitted incorrectly and had to be remade by the kitchen. My friend was chastised by the bartender for addressing that she’d received the wrong order. The bartender was so busy gossiping with her friends at the bar to acknowledge and serve us. It was beyond disrespectful and disappointing. Several of our items never made it out of the kitchen because “there were many orders ahead of us” despite a 1.5 hour wait… My friend’s lamb chops were so tough, we joked she could feel them to her dog. On our way out, I overheard the bartender and her friends saying “Good, they’re gone” referring to us… I have NEVER experienced such hostile service in all of NYC.\n\nTruthfully, I don’t think I’ll return to The Row - the prices ($75/pp for 1 drink + 1 entree!!) are TOO high with so many other Black owned spots in the area, it’s a big no for me. They lost a customer for good tonight."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMdHBuSTdRRRAB",
            "text": "Great place for a cool but classy drink, meetup with friends, or a larger group. Excellent care and service all around. The \"Gotti\" frozen drink is delicious, as are many others. Great happy hour vibe too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUdWFieUJREAE",
            "text": "THE FOOD IS SOOO GOOD"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUa3JlV2tnRRAB",
            "text": "Excellent Mother’s Day brunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbWNMN2dBRRAB",
            "text": "This is my new spot!!! I Love it, the staff are wonderful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqOTdYMllBEAE",
            "text": "Lovely place, excellent food, and impeccable service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMUlXdXlRRRAB",
            "text": "They greet you at the door. Very attentative. The men actually help, open doors etc. The food was prepared fresh."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5cE9mR1Z3EAE",
            "text": "Perfect."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5dUlDRjFRRRAB",
            "text": "Food, service and Ambiance were great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkLVBmZ2FnEAE",
            "text": "Good food, good service, good value!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0MmFIN0dnEAE",
            "text": "Nice small, cozy, intimate place to eat a ND listen to music while you eat. The only downside is that they try to get a double tip. Grauality is included in the bill, and then they want a tip."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNONjdxWmVREAE",
            "text": "The row is an excellent place to dine while in Harlem. The food and drinks is always on point, and the server's are very polite and they are always on point aswell."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dE5ITG9RRRAB",
            "text": "This divine establishment was recommended and it did not disappoint the palette. Friendly and attentive wait staff. My waitress recommended the lamb lollipops and the salmon croquettes. The lamb seasoning rocked. Each tasty bites was a…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2cWZ5RGpnRRAB",
            "text": "Spent brunch here with some friends. The food is really good. Like really good. There isn't a drinks menu but the waiter makes good recommendations. The staff gives NYC realness with their cool demeanors and are quite attentive. Our waiter even gave us a recommendation to Mickey Likes It! Ice cream shop for dessert. Definitely will be back for another brunch."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMydTlqUDJBRRAB",
            "text": "Found this little spot by accident and it turned out to awesome. The food was amazing; well seasoned and portioned generously. To add to my surprise the bartender was well versed in drink making. She made one of the best Moscow Mule I have had in NYC. The only draw back was the serving staff needed a bit more training. They were friendly and nice, but unprofessional and not too attentive. Added to that the place could do with a bit more cleaning. The menus were sticky and I had to clean my table before sitting down.\nOther that that the food was out of this world."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvX3RMVkV3EAE",
            "text": "WoW! Went here today for brunch. The ambiance, service and food all deserve 5 Stars. Glad to see establishments like this in Harlem. I enjoyed a Bellini and fresh fruit red sangria while Michael Jackson blared from the speakers. I ordered…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvdjdld1FBEAE",
            "text": "The service was excellent- Angelica was the best waitress. This place is definately a Gem. I hound this place by chance. The food was amazing and the drinks were very well prepared. You have to stop by, tell them Pat- Karizma sent you. Lamb chops and shrimp were the absolute best."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaLVpTcGtRRRAB",
            "text": "Do NOT go to here. The food is over priced, over cooked, and under seasoned. I ordered take away. They could not be bothered to follow instructions (dressing on the side) not provide me with ONE napkin… not even a square.\n\nThey overcooked their lamb and tried to hide the burnt portion under the other portion. They advertised truffle mashed potatoes. Please don’t be fooled. Did didn’t even add a bit of salt not to mention truffle anything.\n\nThe kale caesar salad tastes like sweet vinegar. The prices are ridiculous for this level of service.\n\nEverything was UNgreat. Spend your hard earned money elsewhere."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvdDRDbDl3RRAB",
            "text": "Organic everything from the Wine to the chicken,  thats what i was told.  The Asian chicken wings,  sweet, spicy and crunchy.  I'm in love with those chicken wings.  They can keep the jerk mac&cheese,  i didn't like that.  The bartender…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJcC1hZGFnEAE",
            "text": "The wait staff here was on point with making sure I was taken care of. So many signature drinks to choose from and the 2 I had were amazing. Owner was present and greeted our table and was really friendly. This is the new spot for a good vibe in Harlem"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzaUozX0VREAE",
            "text": "Low key sexy lounge/bar. Sunday brunch til 7pm. Bartender Lola is amazing. I had the chicken and waffles which was okay. The chicken isn't your typical fried chicken. It doesn't taste like it has flouring on it. My date had the shrimp and…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtM0thU3NBRRAB",
            "text": "The waiter was very attentive. Food was good and fresh and came out fast. We had the oxtail empanadas and Asian style wings. Great atmosphere and hearty happy hour menu.  The drinks were also good! We will be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPOGJTYkpREAE",
            "text": "This was my first and ABSOLUTELY NOT the last time at the Row- the food was delicious and the staff was SO friendly! Great drinks, a wide range of food options, and nice price point. My father will rave about this place for the rest of his life."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCc1AzeHN3RRAB",
            "text": "I was looking for places to eat for New Years Eve and I found this place which was minutes away from a club I was attending.. I ordered Steak with mashed potatoes and sautéed spinach. The food was really amazing, tasty and well seasoned. The Staff and customer service was great from walking in till the time I left. Definitely will recommend this place to others."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzcUtPWFJnEAE",
            "text": "I love this place the live music was great and everybody was having fun and they had football on the TV and the food was amazing my sister had the jerk mac and cheese I had salmon cakes with grits trust me it was good 🤤 then my dad had the white fish with grits 🤩 amazing…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwa1lyQWtBRRAB",
            "text": "Loved the food, drinks, but ESPECIALLY the vibes. All the staff were just amazing and provided great service. Try the red velvet cornbread. That is all."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTbXZtNEJ3EAE",
            "text": "Brand new Harlem heated enclosure with artist rendition same high-quality fresh handmade food fine dining in Harlem without the stress of leaving the neighborhood mixologist on hand be sure to bring a designated driver drinks are not for…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwb2ZUdlBBEAE",
            "text": "I had a time at this place! The vibe is super cool and sexy. The DJ spins all the hottest tracks, both current and throwbacks. The food? Delicious! The drinks? Strong! And the service? Top-notch. They’ve really nailed it with this spot! Plus, the prices won’t break the bank. Don’t forget to keep an eye out for event days – you wouldn’t want to skip their epic happy hour. And guess what? They’ve got outdoor seating too if you’re into that outdoor vibe. 😉🍹🎶"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaXRuekV3EAE",
            "text": "I really wish I took pics. 😔 It’s a cool scene, dark with good music (a bit loud though). You have to walk down stairs to enter but had no idea it was so small inside. We were a party of six but had to wait cuz there was already a party of five seated and there weren’t another set of tables for us to sit also. The atmosphere is cool. We had sliders, salmon bites, lobster rice, mac & cheese. EVERYTHING was delicious. There’s also a bar but didn’t try the drinks."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyek95ZHB3RRAB",
            "text": "I was walking through Harlem yesterday and ambled upon this wonderful restaurant. It has a very inviting outdoor space so I stopped for a cocktail (well 2 actually). The quality of the service and products were both excellent.  The owner,…"
        }
    ],
    "reviews_count": 68
}