{
    "name": "Clay",
    "place_id": "ChIJaSRAphT2wokRXj22CM-oIZI",
    "grid": "MN10",
    "address": "553 Manhattan Ave, New York, NY 10027, USA",
    "rating": 4.5,
    "user_ratings_total": 525,
    "phone_number": "(212) 729-1850",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vNFRrOXFSV1J0ZEdkeE9XUk5iV05ZT0VSVmNYYxAB",
            "text": "The food and cocktails are very good!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tObFduSndSRTlCTm5oTGF6QlhRbGRmVFZOV01uYxAB",
            "text": "Really great food.  Miguel was our server and he was great.  They have a great wine list and fun mixed drinks"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201S1ozVnRXWGxtUTNnMlZHWnJlWGwyZFdac05sRRAB",
            "text": "Review for Clay Restaurant – Harlem, NYC\n\nClay is hands down one of Harlem’s gems — and honestly, one of the best spots in all of NYC. The burger here? Seriously one of the most delicious in the city — perfectly cooked every single time. The house-made bun and those tangy pickled onions are the icing on the proverbial cake. And don’t sleep on the hand-cut fries — crisp, golden, and made with real care.\n\nWhat really sets Clay apart is their attention to detail — everything from the plating to the flavors feels thoughtful and intentional. Add to that a level of consistency that’s rare these days, and you’ve got a restaurant that delivers every time.\n\nIf you haven’t been yet, make it a priority. Clay isn’t just good — it’s memorable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kU00waDBabUpFVlRkNVdrNUpUbVZXV0hKeE1sRRAB",
            "text": "Clay offers some of the most flavorful and deeply satisfying food in the city. Don’t miss it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GdWFtSldabTVKWnpKR04xSklTRUp4YzNwZlNHYxAB",
            "text": "By far the best restaurant in Harlem (maybe all of uptown). The service is great, the food is delicious, bar program is dialed in (fantastic cocktails + interesting wine list). I’ve gone here for birthdays, date nights, and days when I need a big cheer up and I am so glad this place exists. Try the pasta—it’s all house made and is phenomenal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FM1RUVTVXVUpGYkZWdlkyTjJlRXRpYlRCbFFtYxAB",
            "text": "Food is a bit over salted but not bad when paired with wine"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SFQzVlpOakJ1U0VKblZWUktNVEpoZUZKNWFWRRAB",
            "text": "You won't question the bill when the food tastes this good. Employees here also provided exceptional service. The kitchen team excels at Clay. This restaurant offers appropriate rates for its location. This spot has everything you could want."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWWQzZFBaVlZxZG1oblltTllXRGxuZUVsSlMyYxAB",
            "text": "Clay is a gem of a restaurant in this area, warm and professional service and a diverse menu with excellent entrees, appetizers and sides. Excellent beer menu."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzNktYYkR3EAE",
            "text": "My favorite place for dinner in Harlem- the food, wine selection, and desserts are excellent and well curated. The service is always top notch."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SGQwNXplVjgzYUZkeE5GaExUME5MVXpaV1lYYxAB",
            "text": "Been wanting to try this place for a long time and it did not disappoint. The service from when we walked in the door was top tier. David our server was a gem with his amazing recommendations, and Andrea the owner is the nicest human I’ve ever met. Every dish we had was amazing. There was not one thing we ordered that we did not like. Will be coming back as a regular."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVFYwUlJkRXhLWTNORk1HdEdMVFJpZDNWbVFsRRAB",
            "text": "Excellent food and unique wine choices"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSRU9WZHpaSGhyT0VwNFVsa3pORVJUVTBsVldrRRAB",
            "text": "absolutely nuts. one of the only restos where I can confidently order pretty much the whole menu\n\nstaff are incredibly human\n\nthe physical location itself is tucked away and very design-forward, new modern aesthetic, it’s a vibe\n\n10/10 would go again"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vM1lqTkNZV2RLY1hOSExUUkJMVVZ5TjNZMWJuYxAB",
            "text": "A sign of a good restaurant is if you still think about it days later. In this case, I'm still thinking about the pork belly. Definitely one of the best pork dishes I've ever had. I also had the Gnocchi and my wife the mushroom burger. All was good. Nice, relaxed atmosphere. If drinks were priced reasonably, I'd probably give this 5 stars, but this just may be my quirk, but I am not a fan of $20 cocktails. Obviously, you don't have to drink, and the cost of the meal will be substantially less, but going out to a nice restaurant usually is complemented by a pre-dinner drink."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FNVlUZFhUSEF5ZDIxTGNsWjJPVlUzWkUwM2NGRRAB",
            "text": "Wonderful Harlem spot with great drinks, innovative food, and really attentive and professional service. It's a pity that they no longer have any outdoor seating, but that is the only bad thing that I can about Clay!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNT25sLTJxOU1LU2FnEAE",
            "text": "What a gem!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZeHAtc2NnEAE",
            "text": "This was our first time in. We have been wanting to try the happy hour here for a long time. We were greeted by a lovely host, and we let her know we were in for snacks and drinks. She led us to a corner table.\n\nWhen it came time to order snacks, our server David asked us to put in our full order right away so they could course it (which we were not there for, but started considering). We told him that we were just going to do snacks for now, and he snapped up our menus and went straight over to the host, likely to alert that she’s not supposed to seat us in his section for happy hour.\n\nWe picked up on a cold/dismissive vibe from David for the rest of the evening, even after deciding to stay for a full dinner. This was our first date night out in a while, and it felt like we were not really welcome in David’s section, and that we were not spending enough money to be worth table touches.\n\nEven though the food was great and the remainder of the staff was friendly and attentive, big smiles as we came and went, it felt like we were being pushed out and unwelcome by our server at a relatively empty restaurant. Unlikely to return soon."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNU1EVThBRRAB",
            "text": "Having patronized most of the restaurants on the UWS I was looking for something new to experience; enter Clay. I settled on Clay after a quick google search and reading posted reviews. Because this dinner was to celebrate my anniversary I wanted someplace casual and a bit formal. Again, Clay fit the occasion with an elegant dining space, albeit on the smaller side, and gourmet inspired menu.\n\nAER..after eating report, the restaurant met our expectations and I would recommend to anyone willing to travel off the beaten path.\n\nWe enjoyed drinks, old fashion for me and specialty cocktail for the misses. Appetizers were pork belly and chicken liver pate. The pork belly was a little over done but tasty…it is pork belly. The chicken liver pate was surprisingly good. I’m a huge fan of duck foie gras and had low expectations for the chicken liver pate but again, I was pleasantly surprised and the dish was delicious.\n\nDinner entrees were the Calamarata pasta and half roasted chicken. Both plates were delicious with the Calamarata scoring slightly higher on rarity and taste.\n\nBook ahead as the space is small and fills up quickly."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdF9QQThBRRAB",
            "text": "My favourite restaurant in West Harlem!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvZzVyc0FnEAE",
            "text": "We really had great experience!\nFood is amazing\nThe vibe\nService\nDefinitely recommend"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJb3I2VlZBEAE",
            "text": "This is our favorite neighborhood restaurant. Everything on the menu is delicious, but the perfect order is the higher plane cocktail, the beets, the burger (favorite burger in the city) and the panna cotta. The people working here are so welcoming. Great bar atmosphere. I can't recommend enough!!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRLUlyc25nRRAB",
            "text": "Best bar. Wonderful atmosphere!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRLV9IUWNBEAE",
            "text": "One of the few places I enjoyed everything from appetizer to dessert. Flavorful, well seasoned  (!!) and thoughtful dishes. What I got: seasonal greens salad (and I typically don’t like salads) black bass main, and the chocolate dessert. All FANTASTIC."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnNHJLZGN3EAE",
            "text": "The restaurant itself is gorgeous.  The hostess was very nice. We were seated promptly.  Our waiter was not friendly and was borderline rude. Never told us his name. Didn't smile. It felt like he was annoyed from the moment we sat down.  We wanted to order our appetizers and then our meals and he told us no. Saying they don't allow that on Saturdays and we had to order everything at once and they would pace the dishes for us...we were there on a Friday. Every interaction with him was unpleasant. It killed the vibe of the whole meal."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnN0lYMjJBRRAB",
            "text": "Here's the thing. This place was too anticipated and also far out of our way for it to have given what it was giving at dinner. The menu is limited and only a few items were good that they're known for. Everything else was mediocre. Service was not bad at all. The server was attentive enough. The drinks were nothing remarkable really. I understand why when I suggested it my friend who lives in Harlem wasn't too hot on it. Probably saw how eager I was to go and didn't want to shoot it down. Now she tells me why she had reservations about Clay no pun intended. Anyway if I lived in the neighborhood I'd probably give it another chance but I'm not schlepping up and across town for it."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnaHN2Um5nRRAB",
            "text": "Visited twice. Loved it the 1st time, underwhelmed the 2nd. Avoid the basement, avoid the steak (so dry!)."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfZ3BiQmFBEAE",
            "text": "Love Clay. Great food and wonderful service  the burger is so delicious. There is a great wine list for pairing everything"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBNE56M253RRAB",
            "text": "Lovely restaurant serving up perfect technique with flavors that ensure balance of power. I recommend the cheeses for sure, apparently it's a \"toma celena\" that I liked a lot. I also liked the radicchio salad I think, whichever one has good dressing.\n\nFor sure get the pastas, all of them have the noodle as the perfect second lead to the great sauces. If you want me to pick one, I would say the bucatini because I'm a sucker for a wiry noodle that keeps form.\n\nFrom the mains, I remember the duck leg the most for its tenderness. The fish was executed perfectly as well, I just happen to remember the duck leg more.\n\nExcellent spot, accommodating to kids as well. I know I'm leaving the best for last, but their wine list is bonkers good. Highly curated rather than being a book, with excellent understanding of what goes with the person, not just the dish."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfM2VhOTlBRRAB",
            "text": "I would not recommend this place to a friend, and will not plan to return. My wife and I ate there last night with another couple. We ordered nuts and olives for the table, a bottle of wine, I had a cocktail, and we each had an appetizer and a main, and we shared two deserts. The bill was $150 per person all inclusive.\n\nMy main course was the $24 hamburger, and as I started to ask for red onion I was abruptly interrupted by the supercilious waiter: “all our burgers come with red onion on the side”. He was clearly impatient. The tone was angry.\n\nMy wife had to ask three times to identify the bottle of wine he recommended on the menu, and finally after he called him back to the table he took the menu out of her hand and impatiently said the name was different than what he had described, but he assured us it was good and the price was $105. He eventually returned to open the bottle and pour a taste for my wife. As he poured, she took the glass in hand but was in the middle of a sentence that she wanted to finish before sipping the wine. He immediately started verbally agitating for her to stop talking and taste it, rushing her to finish her sentence. This was truly. bizarre. She had to look up at him and tell him she would just be one second. He then poured the other three glasses but not hers, set the bottle down, and left. She had to reach across the table and pour her own.\n\nWhen the meal came I saw that my burger was accompanied by a tiny cup with mushy wet picked red onions. I flagged down the waiter and asked if I could have a raw red onion instead. He dismissively said “we don’t have any red onions” and walked away.\n\nI do want to add that the hostess of the restaurant was superb. She was engaged and perceptive, seemingly everywhere all the time, trying to making things better.\n\nDespite her efforts and a good vibe in the restaurant, with good but definitely not great food, I felt this was an expensive and insulting experience."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmaE5lQ2d3RRAB",
            "text": "Clay has gone from local Hotspot to destination. Great service, amazing cocktails. Top drawer local food & seasonal menus."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2ejZUV3J3RRAB",
            "text": "The staff were SO incredibly kind about accommodating the dietary limitations of one of our party when we ordered takeout for a special meal at home. Big points for that.\n\nThe food was all super delicious, too. We definitely look forward to future meals from Clay!!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMNW82M2NBEAE",
            "text": "Wonderful atmosphere and service, delicious cocktails & everything we ate was excellent! Especially loved the roasted beets and the short rib ragu, but the confit duck leg is definitely worth getting as well"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2NTh2emNREAE",
            "text": "An absolute delight & delicacy in Harlem! #deeshdishes"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cGFyOXBRRRAB",
            "text": "Steak here is great. Definitely NOT a place for vegetarians. They also don't seem very forthcoming about substitutions to dishes. Atmosphere is okay, not bad just nondescript."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQNl9DdXdnRRAB",
            "text": "After reading so many great reviews I thought this a great option for a special birthday meal.\nWell - from the moment of arrival (an indifferent host and seemingly annoyed by people coming to dine…) to the end (a rude waiter who decided to make pleasant conversation with a smile only once bringing the bill) it was a disappointment.\n\nThe lamb shank was great, but I also had the gnocchi, which was watery and salt-less. The entire dish was mainly ground pepper.\n\nOne particular issue was the ordering of drinks. My partner and I both ordered martinis and we asked what gins were available. The waiter sighed and said “we only do small batch - nothing commercial” and stopped there. Okay… but that didn’t answer the question - so we asked what they were and he listed them and stopped again. If you’re going to make a fuss about being a cool bar with small batch gin, good for you. But when someone then asks - maybe explain a bit more what style they are.\nIt was all so judgmental and irritating, which isn’t the way to start an evening.\n\nThe decoration is somewhat absent. It feels thoughtless and not complete - at least at the upstairs level.\n\n*** I wrote this review a week after going. I’m sometimes quite irate after bad dining experiences and prefer to give some time of reflection before an official review. The night of, I’d have surely given them 2 ⭐️.***"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQZ1pMLUt3EAE",
            "text": "The place looks nice enough and the hostess greeting was excellent but that was the highpoint.  Dinner was downstairs in a basement that felt like a basement.  The steak was almost tasteless and burger was definitely on the shy side tho the rosemary French fries were good (I’d have cooked them a minute longer since some were still on the uncooked side). The service was inattentive (hey — don’t forget the basement!) and slow.  If the place was cheaper, I’d go back but at those prices, I expect better food and service."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQb3UteHhBRRAB",
            "text": "Finally ate here after living in the neighborhood for two years. We ate dinner and ordered the following: Pork belly, duck fat potatoes, bucatini, paccheri and the chocolate budino to finish off. Everything was great and the staff was attentive and friendly.\nI was surprised that a place categorized as \"new american\" on google maps was so good with their pasta. I appreciated that the  homemade pasta was cooked on the harder side of al dente, gave extra texture to the dishes.\n\nHighly recommend and I'll be back again soon."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQZ1BPNnV3RRAB",
            "text": "I was so excited about this place but was a bit disappointed. Clay is a beautiful restaurant where we went to celebrate our anniversary. They poured us champagne when we sat down. But as the server was taking our order, the health inspector walked in so they had to pause service. Service was shut for about 30+ minutes so we had no food and no drinks. Finally when service resumed, our food came out and the duck and fries were overly salted, the pork belly wasn't crispy, and we lost our appetite. The short rib bucatini was delicious! I would give them another chance because their kitchen staff was probably thrown off with the health inspector.. but was pretty disappointed overall."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzc0tUcTRnRRAB",
            "text": "i had been anticipating eating here for quite a while and randomly decided to try the food tonight. Service had been amazing, they are engaged and attentive enough to let you finish a course before bringing the next out.\n\nthe food was excellent up until the point where I tried the crab calabrata. I had the burrata and pork belly prior to that.\n\nAn additional waiter came out to ask me why I didn’t like my pasta after i sent it back. He also brought the food back out with him, as though I was going to eat it after the another staff member took it inside.\n\nI explained to him it’s not what I expected and he explained they cook their pasta under al dente and it is because it’s homemade. It wasn’t just the pasta i didn’t like the sauce either, honestly I just didn’t enjoy it and wanted to get something different instead. I opted to get another drink and an entree to go. He asked me if something was wrong with the other food/drink and if i wanted to send other things I had already clearly eaten and drank back as well.\n\nThis same new waiter, recommended a drink brought it out and repeatedly asked me if i was going to send that back too or if i enjoyed it. I previously explained i just didn’t like the pasta everything else was perfect.\n\nVery strange to treat customers like this, to be accosted over not liking hard smoky pasta 😭. Everything else was great including food, drinks and service prior to this man. He wasn’t serving my table at all prior to sending back the food.\n\nHonestly everything would have been perfect minus this man..unnecessarily sassy, i didn’t even take two bites of that plate, i sent it right back.\n\nThe duck leg and collard greens are truly amazing. The farro as well, honestly wish I hadn’t experienced this man, he made me really uncomfortable.\n\nI ended up getting the roasted half chicken to go & enjoyed it."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXaE9iVDlnRRAB",
            "text": "Amazing wine, beer, and cocktail list.  Beautiful cozy environment. I had the duck confit with collards and smoked Farro. Outstanding blend of fine dining style subtle textures with rich homey flavor that evoked the best barbecue that Harlem has to offer.  Will return.\n\nUpdate;  had another great meal there with friends. Still great and the bartenders are top notch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuanRtSzJnRRAB",
            "text": "I keep going back for the bucatini!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIc3I3RUlREAE",
            "text": "Clay is always delicious. The bucatini is perfect. My husband loves the duck and the chicken. I recommend the chicken liver and pork belly appetizers. Just such a lovely restaurant!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbElTbF9nRRAB",
            "text": "It took me weeks to finally get a reservation but it was soo worthy 🙌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3XzlHa253RRAB",
            "text": "Should have a Michelin star"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieDd5REJnEAE",
            "text": "Outrageously good. Delicious, great vibe, well presented, and great waiters. This is elevated food that's totally worth the price. We'll be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibXJYX2dBRRAB",
            "text": "A fine dining experience in Harlem on a rainy night. Seated in the window with a view of the street and next to the bar. The gnocchi was a delightful surprise and I had dreams of the calamareta- soooo yummy. Pork belly never a disappointment and the FISH!!! (We shared dishes!) Perfectly juicy and crispy on the outside. It all melts in your mouth!  And I'm STILL thinking about it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyaXRLajlnRRAB",
            "text": "I recently dined at Clay and had the market fish, which was delicious and very well balanced. The pickled turnips were such a great addition to the dish. However, the portion size was extremely small. I intended to order a side, but the waiter quickly took the menu after I ordered the main. When I asked if the portion was enough, the waiter confirmed it was. I wish I had followed my gut instinct and ordered extra. Overall, the main dish was delicious, and I’ll likely be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyc3MyZW9BRRAB",
            "text": "Great food in a great location just a bit overpriced compared to other fine dining establishments in NYC."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNE5DZHV3RRAB",
            "text": "Came here for an anniversary dinner and was absolutely blown away - the food and service were top rate. Highly recommend the duck and the pork belly, and the panna cotta is among the best I’ve ever had."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNya3F2cnV3RRAB",
            "text": "Amazing food, excellent customer service and vibrant atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNybko2NVB3EAE",
            "text": "Excellent food, nice people."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dXU3REZBEAE",
            "text": "Finally stopped by Clay. We popped in around five and it wasn't too busy and we were able to get a seat outside with our dog! The service was great, and everyone was very attentive and kind. The Mocktail was not good at all but everything else was lovely. The food took quite a while but all of the food was good! Super fresh and the potatoes were excellent. The orange sauce was amazing we got an additional side of it! The patio is tucked away enough that you're not getting in the way being on the sidewalk. It's pretty pricey but overall it was good! Glad we stopped by!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkNWNtLUhnEAE",
            "text": "Had dinner with 2 friends to celebrate their birthdays and this place did not disappoint. We arrived and enjoy the happy hour sparking wine and the hot a bottle of a delicious red wine they recommended. The food was exquisite, the pork belly was like nothing I ever had before. Every dish was so good I really enjoyed the food. I  was not impressed y the services at all. Our first waiter was male and he was friendly, but for some reason then a female waiter came to take our orders. She was not friendly was rushing and overall had a weird attitude/energy. Not what I want to experience while out enjoy dinner. The only good thing she did was the wine recommendation which by the way other was over $100 bottle. But it was worthy it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNTlYdDd3RRAB",
            "text": "It's really nice spot low key and great for a date. I had the burger and it was good nothing out of the world my sister had the crab and it has a good taste but a fishy after taste but they do tell you before you order my friend had the braised rib pasta but I didn't like that at all we had the mushroom fritter and that was pretty tasty but the sauce was great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURwLV9ndBAB",
            "text": "We had a birthday dinner here and enjoyed it quite a bit. The place is small and cozy, giving you a romantic, intimate feel. The service was great and not to mention the rich wine list. The food could have been more intriguing, but we yet had a wonderful experience. This is a local spot everyone would like to have in their neighbourhood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSNzd2Z0p3EAE",
            "text": "I had the beat salad for an Appetizer and it was amazing I got The burger for remain and it was really good. My friend had a cheese and meat platter and she loved it. Definitely a great local spot to come to in the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsM1lITGxRRRAB",
            "text": "Everything we had was delicious. I got the short rib bucatini and it was fantastic. Was flavorful and hardy, great for a cold day. Elaine got gnocchi that was textured and nuanced and delicious. Panama cotta was so yummy, not a single bit of it was left on my plate. Very much would recommend."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2a3BibFp3EAE",
            "text": "Clay is a fabulous restaurant nestled a few blocks off of Harlem’s famed restaurant row. The food at Clay is prepared with thought, care, and love. The flavor and texture combinations are impressive and every portion of your meal will offer something that’s leaves you satisfied and ready for the next course. I recommend the steak tartare - it’s prepared with a distinct sesame flavor that adds a boldness to the classic dish. All of the pastas are delicious and prepared with delicate expertise. I ordered the gnocchi and was very pleased. To end your meal, please do not leave without ordering the donuts. They are sensational and you’ll savor every bite. You will leave Clay feeling satisfied and having thoroughly enjoyed your dining experience. It’s one of the best that Harlem has to offer."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtZ0l5WVR3EAE",
            "text": "We just ate here and it was delicious!\nLove the duck leg and steak we had medium done. The caramelized onions pure sauce that came with the steak 🥩 was a delightful little surprising treat. I love caramelized onions.\n\nThe duck leg was tender ( I literally cut it with the butter knife :)! Delicious!). Duck is though and that's some mastering right there.  It came with smoked Farrow and some soft and not chewy greens.\n\nWe tried few of the special spirits including a 1977  delicious wine. I was 2 years old when it was bottles. It's probably carrying my childhood spirit inside :)).\n\n5 ⭐⭐⭐⭐⭐"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLaDVtdEhREAE",
            "text": "Such a lovely night. The food, drinks, overall experience was fantastic!! The staff was beyond lovely and courteous! Provide great suggestions, good pacing of food and made our dinner so wonderful! Great outdoor and indoor seating options."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnXzVhV2hBRRAB",
            "text": "My wife and I decided to explore this recent neighborhood addition for her birthday and were extremely happy with the experience.  Service was warm and attentive and the wine and beer selection were both quite good.  The food menu doesn't…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNseGZqUktBEAE",
            "text": "This is a hidden gem in Harlem. Food was DELICIOUS. We ordered steak tartare, liver, bucatini and the duck. The duck was melting in my mouth. The staff was very friendly and helpful. I will come back for sure!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpd1pEbUJBEAE",
            "text": "I absolutely love this restaurant. They do everything right. The staff are very professional, and have been extremely responsible during this pandemic (tables are well spaced, masks enforced, etc). More importantly, the food is exquisite.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTdGZLdHZRRRAB",
            "text": "Yesterday we had the pleasure of eating at Clay's. It was a friend's birthday, and she invited us to go to this restaurant with her. I had two non-alcoholic drinks: Inner Flight (lemon, honey, chamomile, etc) and Fine and Mellow (with beet juice and soda). Fantastic drinks!! For our appetizers, we ordered the pork belly and the chicken liver pate with toast. Sensacional flavors and presentation. The portions were good enough to share. For my entree, I chose crab with calamarata pasta, which was phenomenal - crab really tasted like crab. My husband ordered the famous confit duck leg, and let me tell you, I never ate a duck so delicious and so crispy like this one. To wrap it up, we ordered as a dessert the yogurt pannacotta. The staff was very attentive and always checking on us. I loved that they did an outside area that was open and cozy at the same time, and I felt safe because it was only 8 tables spread out. My special shout out for one of the managers, Andrea Needell, that gave us a first class service, very nice and fun. I can't wait to go back to Clay's!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoenNXMjFRRRAB",
            "text": "Clay feels good to be in and the food is solid. The pork belly is a great appetizer to start with, it's a really good size, super tender and comes on top of a nice mustard and dark glaze. For the main we got two of their pasta dishes, the calamarata and the garganelli. They were both really good, but I preferrwd the relative spiciness of the calamarata more.\n\nHonestly, you can't leave without getting the donuts. Just look at em, they were great.\n\nThe only shortcoming id note is that the two pasta dishes felt relatively small for the price (the place overall is on the more expensive side). Will def be back again to try more of the menu nonetheless."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4cHB1Z19BRRAB",
            "text": "The pastas are the highlight whenever I go. Highly recommend! The starters and entrees are also nice! Sweet place for a date night."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJZ052T1lnEAE",
            "text": "Went here for my Birthday Brunch and was pleasantly surprised by this Harlem jewel.\n\nSimply amazing brioche French toast! I'm usually not a French toast girl so I opted for the delicate beet dish instead. My nephew, who'd been to Clay before insisted I try his French toast and man o'man did I regret not ordering my own.\n\nCoffee was fresh brewed. Wine selections pretty solid and service was pleasant. The space is intimate and well designed. Hostess stand, full bar & dimly lit setting suites this place well.\n\nI'd definitely recommend for brunch, evening drinks or date night.\n\n~Christy"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1NUppS3FnRRAB",
            "text": "I’ve been twice to Clay and both times the food and service were solid. I particularly enjoyed the pork belly, gnocchi, and duck. The cocktails were not as good as the food. Clay is a very good place to have dinner but it is not amazing,…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNTU2dGdBRRAB",
            "text": "Ambience is chill. Didn’t get to try the drinks, but foods were excellent. Some delay in between appetizer and main course and I didn’t particularly think we received a great service, nonetheless, Id recommend."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxZ0xMbTFnRRAB",
            "text": "Ambiance is fine. The appetizer with beets and pistachios was delicious. I ordered the bass and it was too salty so I returned it and had the Calamata with crab instead, which was delicious. Drinks aren't consistent but decent.\nWait staffs are friendly.\nWill go back for the pasta."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkNGMzLWdRRRAB",
            "text": "We had our valentines dinner here, there were so many options on the menu and we were spoilt for choice. We went with the roasted chicken, steak and burger mains which were all amazing. We also had the doughnuts and panna cotta for desert. Food was fresh, and seasoned appropriately. Service was great and the servers were very accommodating when we requested for a change in tables. The ambience was just right for a couples dinner and for drinks at the bar."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNTlHZDJ3RRAB",
            "text": "I must say, the food and ambiance were great. The service, however, left something to be desired. I came for a birthday celebration. Our waiter, while polite, was inattentive and uninterested. When someone in my party asked for another drink they said \"one minute,\" and never came back. We had a party of ten and asked about splitting the check prior to arriving because we understand how difficult it can be. When we got our check it became an issue. It felt as though because we had a large party we were no longer a priority because the tip was guaranteed. While I truly enjoyed the bocatini and wine, the service left something to be desired. A second visit from me will have to come through coercion."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXclBYMVdREAE",
            "text": "Amazing service, food and drinks. Love the downstairs area- super cozy. Really impressed with this place. We’ll be back many times!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXMzQzdkxnEAE",
            "text": "Hospitality is defined as \"the friendly and generous reception and entertainment of guests, visitors, or strangers\".  Restaurants are in the hospitality business.\n\nClay is not.\n\nClay managed to turn my birthday dinner into a Curb Your Enthusiasm episode.   Our server continually ignored our requests, screwed up our wine order on a level that reached comedy (this wine is a blend of three grapes, Chinon, Loire and Cabernet Franc) and scowled at us the entire meal.  Next the manager informed us that the wine we eventually ordered had run out.  But it was not the wine we ordered.  At the end of the meal our daughter, who was cold, asked if they could turn down the AC.  They turned the heat up blasting to 77 degrees.  I was scared to order a desert, who knows what might have happened.\n\nIts a shame because the food is actually quite decent.\n\nAs noted in several other reviews going to Clay is a bit like playing Russian roulette (my that has a more emphatic meaning now). You don't know whether the server has a loaded chamber or not.  I mean what soulless people would charge a cancellation charge to people who have been diagnosed with Covid as they have done in the past.\n\nThis goes down as the rudest service I have experienced in a restaurant in my life.  What a way to spend my 68th birthday.  So sorry my son and daughter had to buy this as my present.  And by the way, we all have worked or work in the hospitality business (wine, event planning and hotels). Really a shame.\n\nDine at your own risk."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXNHVYNFJREAE",
            "text": "Great service, complimentary champagne because it was our first wedding anniversary, excellent cocktails, and all of our dishes (chicken liver pâté [pictured], seasonal greens salad, striped bass, gnocchi) were amazing. The gnocchi in particular was arguably the best we’ve ever had on this Earth.\n\nWe live in the area, so this is our new special occasion spot now. Highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSaGZ1NjRRRRAB",
            "text": "OMG! Clay knocked it out of the park last night for dinner! I stumbled across the restaurant on Google Maps and looked over the menu and immediately made reservations. I was not disappointed. The cocktails were inventive, steak tartare had bits of crunch that added an extra dimension of flavor (the buckwheat, maybe), the calamarata pasta was perfectly spicy and the crunchy garlic pieces - just WOW - and then that popcorn panna cotta (drool) and donuts. Perfection! I’ll be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUMHZpZXBRRRAB",
            "text": "Loved the food! Loved the atmosphere and serves was great."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrb1l1d2l3RRAB",
            "text": "Great food. Service was really nice, minus the liquid sprayed on my phone and the removal of the tea bag so no extra steepings after the first one."
        }
    ],
    "reviews_count": 77
}