{
    "name": "Native Harlem",
    "place_id": "ChIJUelrZgL3wokREoU8Uinnoqk",
    "grid": "MN10",
    "address": "2319 Frederick Douglass Blvd, New York, NY 10027, USA",
    "rating": 4.2,
    "user_ratings_total": 373,
    "phone_number": "(212) 516-9475",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kaFpUSnJiR2N4U1hOWlZuRnFiRVV6U2tWVGFrRRAB",
            "text": "The food was DELICIOUS, and the service was above and beyond; they even helped my 87 year old father with mobility issues in and out of the restaurant. 🥰"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVmQwaDNhVGRVV1U5SVNHZEtlVEF6V2toR2IwRRAB",
            "text": "It was my first time there with  my friend I was impressed how beautiful the restaurant is. And the food was delicious I got  jollof spaghetti with shrimp was delicious 😋 the coconut and  strawberry magaritas were perfect. The jollof had 2 peppers on the menu 🌶 but it was not spicy at all.  The red velvet was good not too sweet.  We got the chance to see dancing performance🕺🏿💃🏾🕺🏿💃🏾  there it was excellent 👏🏾👏🏾 I will definitely go back again. Thank you"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oRVZGcDFWMEYyWjA1dVQzazJhRzV6V21KUFRXYxAB",
            "text": "Very fun place."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ORFprODJRbXRyV0dnNVlYUm5NakZWYjJjNVpsRRAB",
            "text": "I went to Native in Harlem on a Wednesday night for their open mic, and the vibe was definitely grown and sexy! I loved everything about the atmosphere the music was fire, the vocals were on point, and the crowd had great energy.\n\nI made reservations for 7:30, but when I arrived, I was told someone else had been seated at my table since their party was larger. My best friend and I ended up sitting toward the back near the stage not a bad spot, but you’re mostly viewing the performers’ backs.\n\nNow for the service… our waitress, Destiny, unfortunately made the experience less enjoyable. She completely overlooked us at first even walking past our table to serve others who sat down after we did. I had to go to the greeter to find out who our waitress even was. He confirmed it was Destiny and said he’d handle it.\n\nAfter that, she did check in, but things didn’t improve much. She told us about happy hour after we had already ordered our food, and she rarely came by to check on us. We even ordered two drinks at once just in case she didn’t return before happy hour ended.\n\nOn the bright side, the food and vibe were great! The jollof rice was perfectly seasoned with just the right amount of spice, but the chicken that came with it was really tough. My best friend had the Egusi soup with chicken, which was pretty good and flavorful though she said a few of her pieces of chicken were tough. The hookah was a nice touch smooth and flavorful, around $50 and added to the chill atmosphere.\n\nWould I come back? Absolutely. The energy, music, and food (minus the chicken) were on point. I’d just hope for a different waitress next time and I’m looking forward to trying another item on the menu."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSYVoxSjZaMTlNUlZaS1JGUllSR3ROTWxCU2VrRRAB",
            "text": "First time dining at Native Harlem. I was with my girlfriends celebrating our sisterhood and we were blessed with Jen's 5-Star service. From the recommendations to her overall energy, my dining experience was a lasting one and I'll absolutely be back. I had the Beef Suya, Crispy Calamari, Braised Oxtail w/ Jollof Rice, Harlem Lychee, and Branson Colada. 10/10 for me!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdmFUbGZWVzVJTlcxa2RTMVVZbmRRY1RSWldrRRAB",
            "text": "After visiting Native 125 several times and recommending it to others, for the first time I felt discriminated against by their security staff.\n\nUsually, I go dressed in designer clothes but casually — never too formal. I’ve invited people from different states to experience the place, and last night was no exception. After a long drive straight from Montreal to Harlem, my friend and I decided to stop by for dinner. We were tired and probably looked worn out, but we were not badly dressed.\n\nHowever, based on how we looked — maybe because we seemed tired after 11 hours driving or not freshly groomed because we go straight to Native— the security staff treated us as if we didn’t belong. It felt as though they assumed we were poor or out of place. According to their own dress code, we were not in violation; yet once we got inside, we saw at least eight people clearly breaking that same dress code without being stopped.\n\nMy friend was asked to change his pants, which he did, but when we came back, they told me my pants looked “off” or “not appropriate,” like joggers based on past experiences as if I had to wear designer clothes probably just to prove I could afford to be there. I’m not that kind of person — I’m a successful trucking & logistics business owner, I don’t need to show off any appearance if I don’t want. I simply wanted to enjoy a nice evening and introduce my friend to what I thought was a great spot to bring our families next time.\n\nI was there for their grand opening and even returned the following day. I’ve supported this business since day one. This was the first time I experienced such treatment, and maybe they didn’t recognize me — but recognition isn’t the issue; respect is.\n\nUnfortunately, I won’t be returning. It’s a beautiful restaurant, but the security team’s attitude felt elitist and unwelcoming. Even though it’s an African-owned establishment, I can’t understand why they’d allow such classist behavior. I’m Dominican, and I believe in treating everyone with respect.\n\nI won’t be recommending Native 125 anymore, and I want to warn others that they may encounter this kind of unfair treatment as well.\nI attached a picture of my last night outfit."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVWEyODFOMkpXTkc1c1VWWmZiSFZYY2tGRVdHYxAB",
            "text": "If you are use to authentic west African food this is not the place. I grew up eating both Nigerian & Ghanaian food & this is not it. The Pounded yam was so thick & heavy. The Ogbono Soup tasted weird.  If u want ambiance & drinks it's a beautiful place but not for authentic good African food. So many other smaller places in Harlem, BK & BX that is delicious & cheaper."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CdldWcE5NM1ptVVdsb2NscHhSRGxVVURkWVMzYxAB",
            "text": "Nice vibe decent food but why can’t hip hop be played as well, mix the music up here and there , we love the culture but the restaurant is  in the middle of Harlem where most ppl are from"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSb04zcEJVM1JJUVhObFRGbEVaVnBVZWprd1IyYxAB",
            "text": "I met my daughter at Native Harlem for brunch, and the experience was a mix of good food and some confusion. I arrived early but couldn’t figure out how to get inside from the street. The main door looked closed and under construction. After asking around, someone told me the entrance was actually through the movie theater — take the escalator up to the second floor. Not exactly intuitive.\n\nOnce inside, no one greeted me, so I made my way to the bar, which was quite a walk from the entrance. The bartender was friendly and made me feel welcome while I waited. When my daughter arrived, she ordered the chicken and waffles, and I had the steak and eggs. Both were tasty and well-cooked.\n\nOne surprise was the extra charge for condiments. I asked for hot sauce and was told it would be two dollars. It became our joke of the day , when my daughter asked for a straw, I said, “Careful, that might cost five.”\n\nOverall, Native Harlem has good food and a nice vibe once you’re settled in, but the entrance confusion and small upcharges make it a place I’d visit only if I’m already nearby."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WekxXTmpYMDB5TlRkSFRWWlRjMmh3VTFSMk0yYxAB",
            "text": "The food was decent. The service was terrible. They kept forgetting to bring parts of the order (food, drinks, even silverware) even after having us confirm the order on the portable tracking system. It was bad to the point I spoke to the manager who then told me “it’s busy, there’s a lot going on”….excuse me? Why is that your response and why is that an issue? From what I’ve heard it’s always busy. What does that have to do with me respectfully…The server’s attitude was also not great, very snappy. Their card machine was also not working. They said they did not have Apple Pay but after several attempts at the machine…they accepted Apple Pay. Server was not accommodating and rude about it."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2todlRHcEJXbDloT1VoUFYxTktPVVppY3pKaFMzYxAB",
            "text": "Staff is polite and patient.  Food is really good!  I will be back!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaSlpsZzFlVWRsTWxKa2JtOXJTRkJaUzNCc09IYxAB",
            "text": "I've been hearing about and seeing this restaurant on IG. So I booked a reservation, the best decision ever.\nThis restaurant is everything and then some. The decor is upscale but not stuffy so you can still enjoy. You can tell alit of thought wss hiven to the concept of the space and decor. The staff at the front desk is very welcoming. The atmosphere of Native is a whole vibe. The music had us both singing a dancing in our seats, kudos to the DJ. The onstage  performance with the beautiful ladies, was liks nothing I'd seen before and they did the damn thing we loved it.Now this food yes and yes was absolutely delicious. The waitress was amazing, and offered recommendations. We settled on the  salmon tacos, basmati fried rice with snapper, penne pasta with shrimp and drinks. To end this beautiful experience we shared a delicious and moist large slice of red velvet cake.Overall this place is a definite vibe that everyone should enjoy and  we enjoyed every minute from arrival to departure.. there's a perfect spot in the front to take photos. If you're looking for an amazing restaurant for date nite or just to enjoy good food and drinks  with friends, make a reservation and stop by, you won't be disappointed or leave hungry."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1YVZERkJjWHBCTVVoSU5uTllTbUk0ZW5GNVdHYxAB",
            "text": "Customer service was terrible. A few of us ordered the jollof spaghetti and it was literally noodles downed in palm oil so we kindly sent it back and asked for menus to choose another entree. Instead of bringing us menus and checking on our table, the sever and manager disregarded us for 40 minutes. So we paid our tab and then left. Would not recommend. This could have been a pleasant experience if there was an ounce of decent customer service."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RNU1IcG5kR3hEUVRneGFURnhWR1pqV0ZGdk1tYxAB",
            "text": "It was my mother's birthday had a great time. Food is great enough to take home"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214UlUyNTRhekpvTlZJNFZsTnlXVUkwZVRkNVFuYxAB",
            "text": "If you were thinking of grabbing a quick drink here wouldn’t be recommend it. The place itself is beautiful, but the bar service was disappointing especially if you’re sitting at the bar. If you’re lucky enough to get a seat, be prepared to be ignored for at least 20 minutes. When I finally did get a drink, it was mediocre at best. The bartender, a Spanish woman with dark hair, was dismissive and even told me to move from the bar after ignoring me most of the time. To make matters worse, despite the lack of service, they still automatically charge a 20% gratuity even on drinks. As someone who’s worked in the service industry, I don’t mind tipping well for good service, but this experience just didn’t warrant it. If you’re looking for a chill spot to grab drinks and vibe with friends, I’d suggest going elsewhere. On a positive note, the table service looked much better from what I could see."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVek9Ea3dTVnBtUkU5UVgzbG9VMVpWVVRWS01rRRAB",
            "text": "Top tier! I definitely recommend."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SYWQwUnlZbVEyU1c1SVpWRkxjRGRRZW1nNFZIYxAB",
            "text": "First timer here and just want to say I had an amazing experience. Jaz was my bartender and he went out his way to make sure everyone had a great experience and his rum punch was perfect. I ordered the suya wings and jerk wings. Both prepared to perfection. The prices are very affordable.  Can’t wait to come back. If you are in the New York area please don’t hesitate to give this restaurant a chance."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kVVZISnFXbWxJTFZOQmNWZHpXVEZtVEZscmFuYxAB",
            "text": "Came to Native for the Day Party/Brunch. It's definitely a vibe and the ambiance is pretty dope.\n\nThe food was good (and I think probably better if the they were less busy). I think they were understaffed today, so I won't be too hard on the staff. I think the servers did their best, but service was definitely slow. Management I'm looking at you. Lol.\n\nGo in with a good attitude, it's a fun place to be. They keep you entertained, and have a nice bar area, plenty of seating, a stage, a dj booth and plenty of TVs for sports fans. Definitely will come back here when it's less busy, and also when it is busy. Who doesn't like a good day party? I was home by 7!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZd2FsZFlNRzVLWW14MGVUSlRjWE5tTFU5S2NsRRAB",
            "text": "Was very disappointed with the food, oxtail was extremely salty while the other meals had no salt. Breakfast pancake was cold, dry, and the egg was missing. After asking about the egg, the waiter wasn’t aware eggs were on the menu. But finished half of the pancake before the eggs arrived.  The waiter and hostess were nice, but the delay in taking orders and keeping up with requests was poor. There were no utensils and we kept asking for water. At one point we had to cancel an order because we have been waiting over 1hr.  Atmosphere was beautiful and staff were nice but will definitely not return."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aeWRFdFNUMnhpVFRoeE1ITlhWVmhSUVUxWk5XYxAB",
            "text": "I have been here twice and loving it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3NFMwSjZaRXRPVVc1a1lVVXhhRFZrUmtaSVExRRAB",
            "text": "This is a cultural vibe of West African foods and flavors in Harlem. The staff is extremely friendly and helpful. The ambiance is great and inviting. The decor is impeccable. The highlight though is the food and drinks. Unbelievable flavors!!!\nDIVINE DIVINE DIVINE."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wM1JrMUNXRGh3TUhsUFZucFJjeTFCTVZnd1ExRRAB",
            "text": "Amazing restaurant, food was on point, atmosphere was perfection, felt like home, amazing live music and open mic night. Great for a solo night, date, or group outing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SelNXTkZiM0Z2WWxjNVFrMURTRzFKVDBKRU5HYxAB",
            "text": "Went for my post bday dinner.. it's grown and sexy.. 10/10 food and drinks to me. The performances everything.."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sclQyWkxSbE01VjJkdmVISnBRbHBLYVdSd01XYxAB",
            "text": "Service is awful. They act is if guests should be grateful to be there. We had a reservation and weren’t seated until over 30 minutes past it"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SaVpHVklTVmxtUW5GRWFGTkZWbE13UTFZMFZXYxAB",
            "text": "I attended this restaurant because of a birthday bunch. We were a party of about 20 or so. I never received my food! We had three separate tables and it took an hour if not more for everyone to receive their plate some people finished their food and were preparing to leave when some people hadn’t even received their food yet. The waiter came to confirm my order at least three times. Supposedly the chef had a lot going on and hadn’t gotten to my order yet. Leaving from that restaurant all I had was mimosa’s . I was able to eat off of my husbands plate. Thank God.  I didn’t even receive my red velvet cake that came with the price I paid for my meal. The service sucks. I will never go back there again, or at least not with a big party because they can’t handle that."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMFlUTjJWbE5PY25sNE5EUk1OMkYxUVZCbFYxRRAB",
            "text": "Didn’t eat food, just drank. Our server kelvin was good. Would go again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUFN6SkVTRUZoY1dWcmVrSTFja2hsUWxvNFprRRAB",
            "text": "Best customer service by Jenn!!! The ladies in the front were welcoming and polite! Food 10/10!! Music was set at a good tone to where we can hear it and our conversation. Room temperature was great! Definitely going back !!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paZmJUZzNhWGxPZW1zNE1ESjNNRTVWZUY4d1UzYxAB",
            "text": "What an absolutely magical place in the heart of Harlem! My wife and I had the immense pleasure of discovering Native Harlem, and it was an unforgettable experience. ✨\n\nThe atmosphere is full of groove and soul, with live singing performed by passionate amateurs that instantly transport you into the true spirit of New York. 🎶\n\nThe food was a dream — delicious, generous, and served with care that made us feel right at home. 🍴❤️\n\nWe spent a truly magical evening, filled with warmth, music, and flavors. One thing is certain: as soon as we come back to New York, we’ll come back to Native Harlem without hesitation!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WQ2RuRkxXbXA2WjB4TlNtZHVMVWx0VDJwVlkyYxAB",
            "text": "Kelvin was a great server. Great recos on food and drinks. I’ll definitely be back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCV1QzUXllR0p4ZUVST1dEUjVlVGhwZFRrM1RGRRAB",
            "text": "Had a great experience here at Native, Server was on point and assisted by other employees to make sure we had a good time. This is my second time coming here so you know, food was fire and drinks was on point. I definitely recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ObVVrMVplRlpXTlY5WFlWSjFNMHQyYmkxZlFXYxAB",
            "text": "Went for brunch and everything was on point, will definitely go again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWQ1FYQm1TbTFpUjBaalMyNHlTbFJHVGtGRmRtYxAB",
            "text": "Had my 40th dinner party here and it went great!! It started off rocky when the elevator didn’t work and my mom couldn’t get upstairs. Then came this wonderful man who made it happen. Later we learned he was the Service Ambassador and responsible for quality customer service. He really made it a great experience and he can sing!! lol. I rated service a 4 because the waitresses have to work on their attitudes. It was very obvious they were upset and bothered by the decisions Mr. Ambassador was making. However, he really turned the negatives into positives.  My family and I will definitely be back because of his great customer service. Great decision in hiring him!!!\n\nNow, the food and atmosphere were popping!!! The food is authentic Nigerian food    , it was fresh and tasty. I had fried fish with Jollof rice and Equasi soup. Their menu have Nigerian, American and Caribbean dishes which gives a variety of options. The music was great! Around 8 830p they had a performance with African dancers which was nice!!\n\nHarlem definitely needs more places like this."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkTFZqSnFUbDl1WmxVeFJGSjVOMGRMYjB4aU1VRRAB",
            "text": "I got the abula with turkey and it was sooooo good!!! By the smell of the stew of the stew alone i felt like i was back in Nigeria. The gbegiri was so mad, it was so flavorful i will definitely be back for more"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pod1JuQkViMnBKYWxOaWFEQkxNRFJPZERKT01WRRAB",
            "text": "My crew of four rolled into Native Harlem on a mission: try Nigerian food for the very first time. Our only training? TikTok clips of people blissfully dunking fufu into egusi and declaring it the best thing ever. Armed with that extremely academic research, we were ready.\n\nThe Food Adventure:\n\nEgusi with Chicken: The stew itself was COMPLEX: rich, nutty, spicy, and creamy in that earthy way that makes you feel like you’ve done something good for your soul. The chicken, however, was… let’s just say it had seen some things. Tough, chewy, clearly what our grandma would call “soup chicken” (good for broth, not chewing). My jaw got a workout.\n\nJollof Rice : Smoky, spicy, slightly sweet. Bit too much for us simpletons.\n\nEscovitch Red Snapper: Topped with pickled carrots and onions, plus plantain chips on the side. Had a strong vinegar punch that gave me flashbacks of sweet-and-sour pork but minus the sticky sweetness. More “bright and tangy wake-up call” than “mall food court.”\n\nThe Vibes:\n\nThe front-of-house staff were wonderful; warm, welcoming, and kept checking if we liked spicy food like they were low-key worried about us. When we confessed it was our first time trying West African food, our server looked both intrigued and slightly concerned, like, “Y’all sure you’re ready for this?” and we were not... I'm not saying the food was bad but it was not just in our typical flavor profile and what we were expecting.\n\nNative Harlem also has a dress code (no streetwear/athletic wear), which we absolutely did not know about. Luckily, it was early and we just came for food, so they let us in. But by 5:30 PM, the place was already serving looks. Everyone was dressed like they were about to walk a runway, and here we were—four clueless food explorers, staring around the room like, “Wow… everyone is gorgeous.”\n\nFinal Thoughts:\n\nFood: 3/5 (good, but our newbie taste buds weren’t ready for the full spice-and-flavor complexity)\n\nVibes: 4/5 (party energy, Harlem glam, and beautiful people everywhere)\n\nService: 10/10 (patient with our rookie questions)\n\nWould I come back? I don't think the food was for us but maybe it is for you. Our culinary adventure may have broken off more than we could handle."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWWVWaGpRVFZxTVdWc1J6aGZaRmhuWVRGWlNGRRAB",
            "text": "Excellent ambiance, service and food. I experienced so much joy in this space. The DJ was rocking it out. My friends and I are looking forward to returning soon."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oNFV6Wm5VRWxGV0RCbk9XSlhRa1p4WTJsaFpWRRAB",
            "text": "Food is a problem ❤️❤️❤️❤️🔥🔥🔥  because it has it's own language..... Please visit on a Wednesdays, open mic 🔥🔥🔥❤️❤️❤️❤️.  #dopeness"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214emJYWjVYMU5RYTNaQlYybzVaRFkwTVMwMlVXYxAB",
            "text": "Food drinks and service was all great ,live band was exceptional"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWFpFNW5TR05xVWtsQk5HOHlUV015Vm1aTFUzYxAB",
            "text": "The place is great but I didn't like the fact that the music was so loud,  you can't have a conversation while eating with your friends, end up having headaches. Was not pleasant for me, had to wait 20 mns before someone attend to us. Thank God to the manager who came for our rescue 🙏"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFd1FucEVNa1ZqUkhjMFZuaERjVXBxV2psdmNGRRAB",
            "text": "The lamb chops were fire! 🔥🔥 Plate cleaned. Appreciate Kelvin for his efficient service, jokes, and Don Julio shots! Coming back next Sunday, Brunch/Dinner. Plus FIRE DJ Gregory Wilson 🔥🔥🔥"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSFdrTnlNVk5UTTBORE5HZElNRVZTTWtSeFEzYxAB",
            "text": "S/o Kelvin fr fr, gave me immaculate recommendations as well as helped me a lot when my bag broke. Will be back soon!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWFlXc3pOa3huZEVoNFVXSTRaalZxVVdneGJuYxAB",
            "text": "Kelvin was Amazing"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FelEwNVNVblJRZW5CMWVFSktaMWh5TWtreWFXYxAB",
            "text": "Food was great and definitely worth the visit! Our server Kelvin made it even more entertaining with his energy and quality service! The mambo wings were immaculate! If you love spice, this is the place to go! I also recommend the pasta, it’s so good! 😋"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxbk1WbE5VamhLYjNNMWFHVnVZazVPVEVkeVVsRRAB",
            "text": "Currently dining and I am not satisfied. I had nice expectations for this restaurant and the service aspect of it let me down the most. The server didn’t introduce herself, it was obvious she didn’t know her tables and she didn’t course the meals properly causing everything to come out at once. She forgot my drink and I had to wait an additional 15 minutes after returning my first drink (it wasn’t good). I had even asked for a hookah person and it never came & the server was so eager to drop the check off without inquiring if we wanted desert. The food is good but the service turned me off from returning. Fortunately I was able to speak to the service ambassador and he was very apologetic and understanding and remedied the situation. I look forward to coming back and having a improved experience"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25scWVUQlFOM1ZhTW5VNVJHTk1TMFJaVVdaV1JrRRAB",
            "text": "Love this spot , the customer service was great along with great music and entertainment that was all night long . The drinks were amazing , must come back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zdFEyUnBNek5DYlVKWVUyUlllVnBmWXpZNFJuYxAB",
            "text": "The food here is amazing — the suya wings were fire (I’m literally Ubering some right now as I write this). Atmosphere is good, music is good, and everyone we interacted with was nice. I brought my family here around 5–7 PM, and it felt like the perfect time — chill but still lively. I definitely want to come back at night to see what the vibe is like then.\n\nOnly small note: I kind of wish there was a direct door to Native (not the one through the movie theater, if that makes sense. But I understand that’s not something they can control). But honestly, everything else was great. I’ll be back for sure."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tad1RrdEpNbTFYVjNBM1NsVmxTMDlMUkhsSFFVRRAB",
            "text": "Loved it hear. Nice place to hang out. The food was good too. My only problem was the loud music. It made conversation with your table companions very difficult. I don't like to shout to be heard by the person sitting two seats from me on the same table."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201WVZqVTBkWFpPUkVkMmJrTlFYemd0TVU5T1JYYxAB",
            "text": "Their appetizers are creative and flavorful."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aMVVXdzBiREJUYVVRNVNUQnNhWHBOVW1RNGRVRRAB",
            "text": "Attended a party there. It’s the place to be."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CM1psbHVRakI0YVhsTVNUVXpSa05rYVVGdlZtYxAB",
            "text": "Sept 7 Visit – Food Review\nI returned to try the food after previously stopping by for drinks. The spot’s gone viral thanks to NYC’s obsession with vibe dining—cute shots, influencer buzz, and sponsored reviews—but the food didn’t hold up.\n\nWe ordered Jollof, suya, egusi soup, Native Pasta, steak, and two bottles of wine. The egusi had some flavor but was overly thick, and the goat was so tough it was nearly inedible. I barely touched it, and the waitress—kind and observant—removed it from the bill without me asking. The beef suya and peppered turkey were solid.\n\nThe Jollof, though, was a disaster. It had a burnt aftertaste that lingered for hours, like they scraped the top off a scorched pot. Honestly, KFC in Lagos does it better.\n\nSkip the wine—tiny 375ml bottles that can’t pour three glasses. Service was slow: no silverware or plates for 10 minutes after food arrived, 20 minutes to get water, and another 20 for the check. Our waitress seemed stretched across the entire restaurant.\n\nLastly, it was Saturday so they had this awkward trio get on stage for a dance routine that brought nothing to life. I suggest other ways to keep the ppl engage and content going."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rek5reG9kbTlSVFhOR1RXbzNOME5ZYkVvNU5IYxAB",
            "text": "Native Harlem located above AMC Magic Johnson is an absolute gem! The vibe is warm, inviting, and full of energy. Their authentic African food that is both comforting and bold is absolutely outstanding. From appetizers to soup to entrees to desserts, Native does not disappoint. Their pounded yam is off the hook! Smooth, fluffy, and pairs perfectly with rich and flavorful soups. Curry goat and braised cocktails is as authentic as it gets. Every cocktail is crafted with care, packed with flavor, and a punch. Perfect balance between refreshing and strong. Staffs here are friendly, attentive, and professional. Whether you’re here for the food, the drinks, or just the vibe, Native Harlem delivers on every level. Stop by and enjoy a meal or have a drink with live entertainment and feel the vibe!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OMlJHcFVXVWxTWlZSNWNIUmpOazVvT1VJNE1YYxAB",
            "text": "The place knows how to entertain and create an ambiance. We had a party of 7 and we made reservations and there is a grace period of 15 minutes for reservations. There is a dress code which is enforced so put a little effort into your presentation. There is live entertainment, music, and nice seating arrangements. The food is a little spicy but not overwhelming. I was underwhelmed with the Jollof Rice and the fried snapper but other menu items taste amazing. It’s a great experience for West African inspired Cuisine."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CNlpIZDZXWEpCY0dGellVcEVZMVpqY0U1aE9WRRAB",
            "text": "when they first opened up this place at the specific location I wanted to go and then I kept seeing bad TikTok's so I wasn't in a rush to go. I went for the first time last week I believe and I went by myself. I wanna walk in. It was during the weekday so it wasn't that busy but anyway the hostess was really nice. I did wait about 20 minutes until someone came to my table, but that's probably because I thought I was waiting on someone so I wasn't upset about that. The DJ was amazing. The food was amazing. The drinks were amazing so amazing that I had to bring my sister, my cousin and my mom back a few days later and they loved it. there's a ton of opportunity for photos. They have live entertainment on weekends and security."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCblpsVXhWM2d4V201blJtbzVha00wYzA4MVUwRRAB",
            "text": "Last night, my cousin invited me to join him for dinner at Native Harlem. He’s been several times and swears by it. We’ve both eaten at Native in Brooklyn and at Lagos in Times Square so I already knew the food and vibe would be good.\n\nBut Native Harlem...It takes it to another level.\n\nThe space is open and inviting. Cute seating. Bold, beautiful art installations that set the tone the moment you walk in.\n\nOur night started at the bar where Ryan, the bartender, greeted me with a smile and served up a strong Native Punch (aka rum punch). It hit just right.\n\nOnce seated, I noticed the menu had even more variety than the other locations. We started with the jerk chicken wings and Suya beef. Fair warning: the suya is not for the faint of hear it’s spicy and bold, but the cool cabbage slaw on the side balances it out perfectly.\n\nFor dinner, my cousin ordered the Egusi soup his favorite. I tried the Jollof spaghetti with chicken. I usually go for Jollof rice, but this twist did not disappoint. The flavors were on point. Everything was fresh, seasoned, and satisfying.\n\nOur waitress was sweet and attentive (wish I remembered her name!). We wanted to end the night with the rum cake, but sadly, it was sold out. Next time!\n\nNow… the vibe.\n\nThe DJ kept the energy high with a mix of Afrobeats, Soca, Reggae and more. And the performances? Unexpected and electric. A woman on skates, a violinist weaving through the crowd, even a stilt walker. The entire place pulsed with culture and joy.\n\nAnd here’s where Native Harlem truly showed its heart.\n\nI accidentally left my wallet behind. The hostess and management went above and beyond used the reservation system to find my number, called me, and held it until I rushed back. Honest. Kind. Class acts.\n\nTo the entire Native Harlem staff thank you. You made my night.\n\nI’ll definitely be back. And next time, I’m bringing the whole crew."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLRGw4ZkNTc2FfckdREAE",
            "text": "I had dinner at Native, and let me just say—what an unforgettable experience! From the moment I walked in, the atmosphere was vibrant and warm, with beautiful decor that immediately transported me. The ambiance was rich and inviting, making it feel like I had stepped into a little piece of Africa right in the city.\n\nThe staff was incredibly kind and welcoming, which only added to the overall experience. We started with the pounded yam and egusi soup with beef—and wow, it was mouthwatering! Rich, hearty, and full of bold, authentic flavor. Eating with our hands, the traditional way, made it all the more special, and I appreciated the thoughtful touch of a bowl brought out to wash our hands beforehand.\n\nNext, we had the escovitch fish, and let me tell you, it was absolutely delightful—crispy on the outside, tender inside, and seasoned to perfection. We also tried the goat, and it was just as impressive—tender, flavorful, and cooked just right.\n\nIf you're looking for a memorable West African culinary experience, Native is a must-visit. From the food to the service to the ambiance, it was a blast from start to finish. Highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oT1RFWlBjVEZ5WW05ZldGTXhWbGhYZG0xdk1VRRAB",
            "text": "Beautiful atmosphere and great food. The staff was really great and attentive. I love their happy hour during the week 12pm-7pm. Highly recommend the suya wings! I also ordered jollof with beef and had an issue with the temperature which they happily fixed right away. If you like a nice spice this is the place!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VLamQ3TWZtLTZUaXNBRRAB",
            "text": "Unfortunately, I wish I didn't have to write such a review because I love African food. I want to thank the manager Mark for a great experience because our waitor Zeus was HORRIBLE. This was my fiance and I second time here. Our first experience was great since it was the 2nd week of opening. However this time, there was an issue with hair being in the food which Mark addressed ASAP. When my fiance asked for a printed receipt and noticed we were over charged for items on the happy hour menu, Zeus asked us math questions like what's 12 plus 12 which is very inappropriate if the bill is clearly wrong. I would go again at the request of a different waiter."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScVdYUnlOVmhDUjBzMGJGTTNZalpCUW5nNWEyYxAB",
            "text": "I’m very hard to impress because my expectations are high but my experience was wonderful. I went to native to celebrate my daughter’s graduation and hand an amazing time. My waitress Toe over exceeding my expectations with Her welcoming energy, her presentation and the way she carried herself along with her work ethic was phenomenal. The food was great not a long wait at all. Pointer tip come early for the Mac because it was sold of kind of early but the rest of the food was so good it made up for it, so Thank you Toe for the outstanding customer service you provided I will be back !!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swNVNraE5jRUZKV0VsNFNHRjBVekk0V0d3d09WRRAB",
            "text": "If you are a fan of Nigerian food, you have to check out NATIVE HARLEM.  Our server Whitney was TOP NOTCH.  The food was top notch.  Native's vibe and energy is unmatched.  Every person from Native's support staff exuded enthusiasm.   Do check out Native you will enjoy an experience you will not soon forget."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveFlTX1NnEAE",
            "text": "Music: almost strictly aftobeats\n\nRecommended dishes:\nJollof rice\nEgushi Stew\nFish Tacos\n\nMyself and 4 other people went yesterday, which was a Thursday night.\n\nWe got there around 7 and sat at the bar and had a few drinks while we waited for our table. The drinks the bartender made were good.\n\nIt took a bit for our appetizers to arrive, but soon after or entrees arrived and every single thing was delicious\nVery diverse crowd of black people of all ages there. I’m not sure if you need to be 21, but they scan your idea before entering so bring some form of valid ID.\n\nThe place is defiantly a vibe. We left around 10pm and the place was nearly full."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOaTJ6T1hYNE5MQ2JnEAE",
            "text": "I made a reservation to try this restaurant this past Sunday at 1:45 p.m. I am so happy I did. As a restaurant connoisseur, I must say Native exceeded my expectations. I was greeted by 2 beautiful melanated hostesses with a \"Welcome home\" which made me feel like I landed on the motherland. I ordered shrimp and grits which I appreciated for the grilled flavored seared into the shrimp and the thick richness of the grits. I ordered 2 cocktails and stayed longer than usual because the ambiance of the place has that effect on you --- from the soft, dim lighting and intentional African art pieces to the cultured sounds vibrating through the speakers --- a whole memorable experience was created. Native must remain a permanent staple in Harlem, to never lose its organic touch of West African cuisine."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5amJtWjBNazB4Tm5Jd1JVOTBPRkJqWVdnNFVGRRAB",
            "text": "I rarely give all 5 stars 🌟 but when I do, it's absolutely worth it. Native Harlem gets it, from decor, svc to food, it was all top tier! No kinks needed to be worked out kinks, as many new restaurants do, this place gets it.  Destiny, our server was absolutely the best. She was knowledgeable of the menu and was extremely charismatic! Lastly, Tiana took lovely photos of us. Definitely recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4dGVYVnZha1JRWW5wSlpYRjBlVFpuVFhFeE0yYxAB",
            "text": "Enjoyed my food. Calamari was a little dry, but the order at the table next to me looked more appealing. Fish tacos were pretty good.  For dinner, I ordered the salmon, well season. Drink was Harlem Lychee. If you like the coconut flavor drinks with a little kick, it is the way to go. The atmosphere is beautiful and relaxing, but I was not too happy with the service.   It was okay."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONmEycFVhMDlwYUdWRFlXZG1aR1pUU0dOclowRRAB",
            "text": "I waited until my second visit before posting a review. The atmosphere is amazing, very mature and calm but filled with entertainment. They have dancers and drummers. The decor from the entrance to the dining area is beautiful. The place is spacious. The need to allow reservation of up to 12 people without imposing a prixie menu with payment. Dj has been on point both times i went there. Drinks were fun. For food, I have a mixed review. To be honest both times we went things were sold out. There should be more authentic Nigerian options, I don't like the fusion. The menu could be improved. My favorite is the Native spaghetti. The suya is on point. Food could be better (I'm a chef but I try not to put my chef hat on at restaurants). The hosts are amazing, particularly Kadine and Joy. Very patient and sweet. I'll visit again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taalNsVTVTVTlWU25CWlJWbE9iVUl4VFRGQ1lXYxAB",
            "text": "Went to Native Harlem on Monday with a friend I hadn’t seen since 2010, and it was the perfect spot to catch up. The food was delicious—I had the escovitch with basmati fried rice, a glass or 2 of white wine lol, and we split a moist, tasty red velvet cake for dessert. My friend and her friend both had the lemon pepper chicken with salad and loved it. The atmosphere was warm and inviting, and the staff were friendly and attentive. A really nice experience—I’d definitely go back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4d1JWZFFaMVpsYVVkU1J6SlNPWGhhWlRob1ZrRRAB",
            "text": "If you’re looking for the perfect addition to Harlem’s vibrant cultural and culinary scene, look no further than Native Harlem. From the moment I walked through the door, I knew this place was something special.\n\nLet’s start with the ambiance—because WOW. Before I could even process what the hostess was saying (yes, she was doing her job just fine), I was completely swept away by the decor. Native Harlem is an interior design dream—every detail felt intentional and elevated, setting the tone for what would be an unforgettable night.\n\nOnce I snapped out of my decor daze, I realized how incredible the staff was. Warm, attentive, and genuinely passionate about the experience they’re helping create. They weren’t just doing their jobs—they were hosting a vibe.\n\nNow for the food—listen, it was delicious. I dove into the appetizers so fast I forgot to take pictures (that should tell you everything). Every bite, from the starters to the entrees, hit the mark. The flavors were bold, comforting, and left me wanting more—but also satisfied.\n\nAs if the food and atmosphere weren’t enough, hookah was available, adding another layer to the loungey, laid-back energy. Then… boom—the entertainment started, and my jaw dropped again. There’s a stage in the middle of the space, surrounded by seating, and on this night, the show kicked off with a talented acrobat whose energy lit up the room. And just when you think you’ve seen it all, in glides a stunning woman on stilts, dancing gracefully through the crowd like something out of a dream. Top. Tier. Vibes.\n\nIt’s been days since my visit and I’m still in awe. Native Harlem is more than just a restaurant—it’s a full experience. Whether you’re a local or visiting the area, this is one place you have to try.\n\nJUST GO. GO NOW.\nYou will not be disappointed."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWd1ZrdEdTV1ZXVEZsSVdWTktWR1ZNUzJOcGIxRRAB",
            "text": "Native Harlem – Beautiful Chaos with a Side of Salt\n\nI was hyped to try Native Harlem — a fusion of African and Caribbean flavors? Yes, please! These are two of my favorite cuisines, and as a proud supporter of Black-owned businesses, I really wanted to love this place.\n\nLet’s start with the good:\nThe place is absolutely stunning. Like seriously — whoever designed it deserves an award, a raise, and a standing ovation. Bold African art, warm vibes, amazing lighting — the decor alone is worth the visit. A+ on ambiance!\n\nNow… the food.\nWhew. Someone had a salt shaker in a headlock back there. We ordered the curry goat — salty as hell. Sent it back. Tried the curry chicken — also salty as hell. Sent that back too. And I like salty food! But this was next-level. Like, “Am I being pranked?” levels of salt. We ended up sticking to the Jollof rice and plantains, which were fine. Calamari appetizer? Meh.\nMargarita? Fire. Gold star for the drinks.\n\nNow… the entertainment.\nDJ spinning Afrobeats? Cool. Dancer working the floor? Cool.\nThen there’s the guy with the mic’d up drum of doom. At first, I was into it. Gave the place energy. But he kept beating that drum like it owed him money — for TWO HOURS STRAIGHT. No breaks. No mercy. Just bam-bam-BAMMMM over already loud music. I swear, my eardrums filed for divorce.\n\nPro tip: Do NOT come here for a first date on a Saturday — you won’t hear a damn word your date says. You’ll be yelling over music that’s full-on club level. I'm in my 50s and still hit the occasional party, but this was too much. Between the DJ, the drumline from hell, and the salt, I left with a headache and high blood pressure.\n\nThe place is GORGEOUS. The drinks are solid. The vibe is fun (if you’re into super loud dinner parties). But the food needs a serious salt intervention, and the music? Turn it down, fam. You’ve got something special here — don’t let the volume drown it out.\n\nTo the chef: Go lighter on the salt — our people’s blood pressure can’t take it.\nTo the designer: 10/10. Beautiful work.\nTo the owner: You’ve got a gem. Just don’t turn dinner into a drum solo."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xYU5URjBVbTAzVG1kUU1YWXhXbkpvUTJkdllXYxAB",
            "text": "I was very excited to bring my husband here to celebrate his birthday. I’m not one to bash or speak negative of places but I have to be honest and tell my truth. So first things first…Native appeared to be very serious about the dress code. I received emails and text messages and there was even a posted sign at the entrance of the restaurant regarding the strict enforcement of the expected “chic attire”. In other words dress to impress or you may be refused entry. I had no issue with this at all but expected everyone attending the establishment to do the same. Unfortunately it was the complete opposite there were individuals that looked like they were dressed to go to the corner store or as if they rolled out of bed and said I’m hungry I’ll go eat real quick at this place. The decor was beautiful and the entertainment was great however the music was so loud and seemed more for the younger crowd. Having a conversation at this place is not possible without yelling at eachother less than 3 feet across from the table. The gratuity is included no matter the party size. I also had no issue with this but Jada our waiter provided lack luster service and didn’t even attempt to provide a better experience because she simply did not have to. We sat and did not get greeted for over 10 minutes. Waiting for the appetizer also took long and not worth the wait. The sun dish had very great flavor but it was the chewiest goat I have ever had and we couldn’t even swallow it. Jada checked on us once and only once. There was a point in time I needed water and when I found her she forgot to bring it so I had to grab someone walking by with a water pitcher. Now for the entree my husband actually enjoyed his meal the suya beef with jollof rice. The beef was cooked well , tender and flavorful. I had the sliced snapper which wasn’t how I expected with jollof as well. The fish dish was nothing to rave about but it took forever to eat because I was busy sorting bone in every bite."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWU1RGUTNWSEYyY3podGNWOXhTRXBmWmxselRsRRAB",
            "text": "Took a friend their for his birthday! It was a surprise for him and he really like the resturant, the food & drinks!\n\nI had a great time and loved how we were greeted as soon as we came in. Gorgeous staff and decor. It was a Saturday nite, so there was a live DJ, a live drummer & dancer. Lovely adult crowd, no shenanigans! I had the calamari-which was the perfect size but it wasn't crispy and seemed like they rushed to get it to the table. The sliders and side of rice and peas were delicious and I'm excited to try other dishes on the menu! The lychee mocktail was on point, I had 2!\n\nI do have some critiques. First off, our water was never replenished....I only saw 2 servers. The place was packed and could use some more support staff, especially on a Saturday nite. Also, written in bold at the bottom of the menu stated that they charge a 20% gratuity for all checks, which I was taken aback reading because I did not see that on any of the menu's posted on their website.  Our sever was good, but could've been better if she wasn't serving so many other tables & patrons. Will definitely be back for their brunch!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tscVFXWnJTMkptYVd0dWFucHlZWGxqZVdaMlYwRRAB",
            "text": "This was my first time at Native Harlem and everything was chef’s kiss! The food was absolutely amazing; so flavorful and well-prepared. The service was immaculate, and the staff made us feel really welcomed. The vibe was perfect…stylish, cozy, and full of good energy. They also had really good music.\n\nI’ll definitely be going back. Highly recommend if you’re looking for great food and an all-around top-tier experience!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xZk5UZEdUbWxTUlVwR1FVMW1WbkZTZUhwMWFsRRAB",
            "text": "Let's start with the food was good.  The music on point. Great vibes. The ambiance is beautiful. The service on the other hand was horrible.  It took 20 min before someone even came to our table to ask us anything not even I'll be with you in a moment. I had to go get the manager in order for a waitress to come. Though under staffed it still didn't make sense.  The place wasnt even packed and most of the guests were at the bar.  It took a long time to get our food, but ok, kitchen was backed up. One of the orders came out wrong. The waitress rarely came back to see if we were good not even to replenish water.  We had to go looking for her several times. I felt bad for the manager because he was working hard doing everything. The busboys were bringing dishes to the wrong tables.  Our waitress even brought me a drink after we asked for the bill and im like i didnt order anything else which she should know bc she took our order.  She was nice but a ditz. They were messing up so much.  Unfortunately I wouldn't recommend and I wouldn't go back. The table of 3 next to use was so mad they walked out on their bill...ate some stuff but left a whole meal barely touched on the table."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMm9lY1p3EAE",
            "text": "If you are influencer, the beautiful decor of this restaurant is for you. The staff is nice. The waiters are friendly. The chef/owner came out and spoke to all the Patrons. I was truly surprised the Restaurant is only a month old because it was packed. I tried the escovitch   fish and jellof rice with goat cook in red stew. Many of the items we were interested in ordering were not available including the drinks, but maybe they were recovering from Easter weekend. I will return in the future, but try something different."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSR1QweHdVMDVUYVMxbVpGQnlaR3hSWW05Q2IyYxAB",
            "text": "Went on a Saturday around 9 pm, not too busy.  My friend and I were sat by the stage. Entertainment and DJ on point as always. Nice decor and fully stocked bar.\n\nFor apps, I ordered the Asun Goat which was spicy but tasty, and my friend ordered the fried fish tacos which were very good.\n\nFor mains, I ordered the Efo Riro with goat and pounded yam and my friend had the Escovitch fish with sweet plantains. The Efo was a little spicy but not too much, it was very good and it was my first time eating pounded yam. My friend tore up her fish and the sweet plantains were tasty.\n\nThe drinks I had were ok, the Native punch and Uncle Nearest Whiskey drink, not strong but good."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNGFMYkF3EAE",
            "text": "From the time we walked in it was a great experience. Hostess was really nice. Ambiance was nice, great vibes, classy look and everything was delicious from the drinks to the dessert. Every plate was flavorful! We were disappointed that they ran out of oxtail but everything else made up for it. The manager came by and checked on us and made sure we were good. This was just on a weekday so I can only imagine what the weekends look like. It was a group of 5 and we all have raving reviews. This place is a 10 out of 10, can’t wait to see it on a weekend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1eU0wMTZObEpEY0RCT2FrNXVTMUkxU25WRVMxRRAB",
            "text": "Native Harlem is where West African flavors meet Harlem flair. The vibes are here as well as the heritage. After a recommendation from a friend, I had to see what this place was about! Here’s what went down…\n\nNative Rum Punch – sweet, strong, and dangerously smooth. The kind of cocktail that sneaks up on you in the best way.\n\nBeef Suya – tender, spicy, and grilled to perfection. That smoky, peppery kick had me hooked. Pro tip: save a few slices to pair with your jollof. It hits different.\n\nPrime Beef Sliders – juicy, flavorful bites that made my eyes go wide on the first bite. Simple, bold, and crazy satisfying.\n\nOwambe Jollof Rice w/ Chicken – rich, smoky jollof rice paired with juicy, well-seasoned chicken. Owambe means party and this plate is worthy of its name.\n\nNow look... I did have to wait over an hour for my dessert, and yeah, that definitely threw me off. But the food and vibes were so on point, I can't even lie...I'm still coming back.\n\nEvery bite hit. Bold spices, smooth sips, and a soundtrack that makes you stay awhile. Native isn’t just dinner it’s a whole experience. Definitely coming back for round two."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMGNsSldaRU5hZFhKallXWlNhRVp0UWpWeVRIYxAB",
            "text": "Came here for my cousin's birthday we had a great time .however the food wasnt at all what i was expecting i myself ordered the oxtail 44 dollars (pics included) and a side of plantians . The oxtail was so salty .... my cousin (the birthday girl) had to send it back and get something else,  i was told the salmon and jerk was good however"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cc01YUTVjMk16VHpBMFkxUklWR3BET0V4TlFtYxAB",
            "text": "Loved it here. The owner even visited our table. The music is amazing and the food delicious. The snapper rice w/res sauce is my fave. Great atmosphere. One person for app drinks entree will be about $120. Definitely worth it. Make sure to check the dress code and have I’d bc they will ask you at the door bc towards the evening it’s turn into a more party vibe (that’s my guess)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VQZW0wTDI2aHM2Uzl3RRAB",
            "text": "Beautiful atmosphere, lively and there was even a show! We had the escovitch fish, lamb chops, and jollof rice. All the dishes were good 7/10.  The staff was welcoming, and service was attentive.  Good service all around."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMUzQ2dURDb003LVFREAE",
            "text": "We had such an amazing time! We went last Friday night as a group of 7 and enjoyed every minute !!\n\nThe DJ was amazing ! The energy was awesome! The ambience and the aesthetics were pleasing.  The fact that they have that added layer of entertainment was also unique and we all really enjoyed that. We saw dancers, an aerial-hoop performer, a flute player, someone on the drums, it was awesome. The servers did great and I had no complaints at all.\n\nOnly thing I would say to be mindful of for people who are very particular:\n\nParking -  it isn’t the worst but you will have trouble finding parking on the main street, and we did found plenty of good parking on an adjacent street that we didn’t have to pay for.\n\nTemperature - on the night we went it was noticeably warm inside, Which I didn’t mind but I could see being an issue for some people. It could have been just a one off night with AC being that the summer season just started, but the cool air is something to be mindful of.\n\nReservation- we did have a bit of a  wait after our reservation time, but again that’s not something that bothers me plus we were a midsize group so I’m understandable to that. But for some of you who are very particular about start times, that may impact if you’re on a specific time crunch.\n\nIt is a second floor establishment, so the initial entry into the building isn’t the most appealing. Enter in through the NY Sports Club glass doors and up the escalator/elevator, simple as that.\n\nAgain these are all minor things to me that had no effect on my rating, but I did want to note that part of our experience  for some people again who are very particular about certain things. But for me, I paid little to no mind of these notes, and wouldn’t count them as issues, but maybe others would differ.\n\nWould I return? ABSOLUTELY! Was the food great? ABSOLUTELY! Was the staff pleasant and attentive? ABSOLUTELY!  Was the DJ doing an amazing job? ABSOLUTELY!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sa1JtSmZWRkJXVWtNNWRHVlhkRVJRYkZGR01WRRAB",
            "text": "Came here to celebrate my beauties 40th. The service, food and ambiance were top notch. They helped me surprise my friend for her bday and helped salvage the birthday cake!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSRVdsOTJTRUl3TTFOalRHcG5PWGxFUTJObVdFRRAB",
            "text": "Excellent food and ambiance. It was a very enjoyable evening. Definitely will be returning.  Just a note to have more signage on how to enter the establishment for new patrons unfamiliar with area. Otherwise 20 out of 10!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWc2JreFBYMHROV25sMmNHeHphM3A1YlZKRmFXYxAB",
            "text": "We had such a great time at Native Harlem tonight! The entire group is amazing — it took us back to the days when we used to go to Lagos Times Square, and honestly, the vibe at Native is even better. The food was incredible, the people were warm, and the customer service was absolutely top-notch. Huge shout-out to Kaydene and Sheena — you’re both doing an amazing job! Special thanks to Kaydene for going out of her way to make sure we had the best experience. We’ll definitely be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJalZycTdIazRIbHl3RRAB",
            "text": "I must say this is the first time in my life I ever walked out of a restaurant. This is sad too because it has such great potential. The place is beautiful, however, what's a beautiful restaurant with bad service.  Please brace yourself for this review. I brought my fiance here for Father's Day due to the said live entertainment.  So, here's my experience.\n\nThe place seemed closed,however, you can enter through the Magic Johnson movie theater and enter through the second floor. Once you get to the second floor, I was informed by the security that they have a strict dress code, okay, not a problem. I had on my Ugg fuzzy slippers as I had an incident that caused me to not be able to put on shoes, I couldn't walk a week prior. So, I am just blessed and grateful that I can walk. Then, he requests my ID and my partners as well. We go in as they put up a sign that says no Apple or Google pay. Okay!!! Had to go to the car and get the physical card.\n\nWe get seated right away, with a beautiful smile from the hosts. As we enter, it's loud but entertaining as a drummer is there playing African beats as the DJ is playing his own music. They were not in tune. It's a little confusing but entertaining nonetheless. Waitress comes very polite and kind and takes our order. We order drinks and appetizers. She gives us a chance to look over the menu and we order our meal. My fiance ordered the salmon dish, and I ordered the NY steak dish. Simple orders, I would think for a restaurant. We waited an hour and 30 minutes for the food to come. When it finally comes, they messed up on my order, the steak. I requested it to be well done with white rice. Rather, I received medium rare steak with mashed potatoes and spinach. So, I send the food back and explain the error with the meal to the waitress. I waited 20 minutes then the waitress comes back to me and says there's an issue, they gave me the wrong plate and the kitchen said they are not making any more steak and she asks me if there's something else that would be quicker I want to order instead. I asked for the manager and said, \"Where's the plate you took from me? Can't you just recook the steak?\" The waitress repeated to me and said,\"It wasn't your food. They gave me the wrong plate.\" Wait, what!!! Did you give my plate to another customer? Did you give me someone else's touched meal? Now, I must say I am livid. The manager came after 15 minutes of waiting for her as my fiance went and got her. She came and looked at me, so I asked. Did your waitress fill you in, and she says, \"They were supposed to recook your steak,\" \"Right, I said, and she walked away. I sat there for 3 minutes wondering what the resolution was and that I waited all day to eat. I honestly walked out. This was the worst experience ever in a restaurant. That completely ruined the whole Father's Day vibe."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paTFoxcEVZVTl1YzNGbFJHRlBiR05PU21wb2FHYxAB",
            "text": "I'm not a fan of west African food, but my friend likes it so I went. While what I got was more mainstream, it was good nonetheless. The atmosphere was awesome."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOTVlrdE1UbWRrZUhGallYWnFaRmswTVZCcGFIYxAB",
            "text": "This restaurant is stunning went here twice for my friends bdays and had an absolute amazing time drinks food and staff were top tier! The entertainment was a nice touch on weekends."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvelo3Z0R3EAE",
            "text": "I loved the warm welcome that we received upon arrival.  The space is gorgeous and the host provided a really nice tour before taking us to our table.  Our hostess was lovely and provided menu suggestions.  I had the Abula with mackerel and pounded yam as a side.  I expected the soup to be more like a stew but instead it seemed to be a sauce with the yam as a base.  It was very tasty nonetheless.   An enjoyable dining experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sblpGcEhlbHBaTFVaT01HazNkVnB6WVc1aFFVRRAB",
            "text": "Our family truly enjoyed this experience. We were late for our reservation and they accommodated us, thankfully. NY traffic is unpredictable. We traveled 2 hours to have this opportunity. The entertainment was great and the food was delicious as well!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VKX0puUFNadG9IWEl3EAE",
            "text": "This spot is new to Harlem. Good thing, the best thing, their kitchen is open late. Walked in at 11:45 pm on a Saturday. A lot of service people. Security check, I.D. and pay down 😬. It’s loud in there. Was asked about Hooka 3 times. Crowd is lates 20’s - 40’s maybe."
        }
    ],
    "reviews_count": 87
}