{
    "name": "The Good Good",
    "place_id": "ChIJr9rAO3f3wokRg7evFlsrX-Y",
    "grid": "MN10",
    "address": "1694 Park Ave, New York, NY 10035, USA",
    "rating": 4.8,
    "user_ratings_total": 328,
    "phone_number": "(917) 409-0103",
    "reviews": [
        {
            "date": "8시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdVgwUlJUVkpPU0doT2NHSk1hemh5Tm1kR1FYYxAB",
            "text": "Very cute and cozy inside. Everyone who works there is delightful. Food options are unique and delicious"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NdFpuQjVRV2RrT0UxMFJrTnFkV3BmTm5sU01YYxAB",
            "text": "The food was amazing! I got the smoked salmon Benedict and it was awesome. The place has such a cool, hood-vibe design. Note: it does not have the best coffee (only one type of coffee/drip coffee which was not strong)."
        },
        {
            "date": "1주 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pObU5FMW5SekkwT1ROSUxVcHBjRzlqUTBSU2NrRRAB",
            "text": "Je conseille vivement le brunch qui propose des choix de plats soul food, delicieux ! Bel accueil, mais je recommande de réserver"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJNVNuUkdTekkyZUMwMGJHRnlPRFJMU0hkWmFtYxAB",
            "text": "I am in the city of business and wanted some food with flavor.  The Good, Good definitely showed up!  The atmosphere, food and service were all top notch.   Thanks for a wonderful evening!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214TlZFdHdSM0JGUTNFdGFIcGthV1UyWVZselRGRRAB",
            "text": "TLDR: Try to go during the week, away from peak hours.\n\nThe Good Good has amazing ambiance and great food. I was fortunate enough to share many of the dishes on the menu, and they were all great. I went on a Friday night, and despite having a reservation, we waited over 30 minutes for our table. Additionally, I didn't appreciate the manager flirting with my sister as we waited. The restaurant was understaffed, although the team was working very hard to make up for it, nonetheless things took a long time (e.g., drinks took 30+ minutes, consistently had to flag someone down for water). Thankfully the food was amazing, but compared to the professionalism and execution of many other restaurants in NYC, The Good Good fell short."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wVlZVaDRNV3hLTlZoNFUzVnNZWGxvVkhVellYYxAB",
            "text": "I had dinner here last night with my friend and the food was good. I wouldn’t say it was mind blowing but it was a nice meal. It was packed inside on a Tuesday night so we were happy to see alot of people there which meant good food.\n\nThe branzino was okay but it had alot of bones.\nJerk mushrooms were spicy! Like too spicy in my opinion for a vegetable and $17 was alot of money for mushrooms.\nThe Haitian rice was good but could have had more flavor rather than being spicy.\nMy friend had the cod fish sandwich and she enjoyed it. She said the homemade tarter sauce saved the sandwich or it would’ve been kind of boring.\n\nOverall i would come back if i was in the area but the prices are a bit high for what you get"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNE1uRm1UMWx0TFZjdFVsSmxPVkphUWxKRVpuYxAB",
            "text": "This place has it all - great food, great service, great vibe. I'm a vegan and there are plenty of options."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ST05tc3lUbEp2ZUV0QmR6bHZaVlpZWDFKc1ZVRRAB",
            "text": "wandered into this charming place by chance and everything we had was delicious\n\nwould not hesitate to return"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taR04yZGllR3RMUkMxcU9FTm5NV2h0ZDFaTFdrRRAB",
            "text": "delicious food, impeccable service, great atmosphere"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GdVVUWjJkVUZJTlZWa1NtOTZlVnBMVTI1UGVGRRAB",
            "text": "I took my bestie there for here birthday the food and drinks was great and the atmosphere was nice it a small restaurant but it worth going there I’m going to take my family here next week"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMldYQlVWMmM0VTNWeFFqbGFkak5RUW1aWk5VRRAB",
            "text": "Beautiful interior,  drinks on point, food delicious intricate layered flavor profiles. Service fast, bathroom clean. Great service, Chris was a wonderful host."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25welJVUklSRk5WTW01NmFHZHNNRk5tUmtwNWNsRRAB",
            "text": "After hearing about it for some time, me and a couple of gf's finally made our way to The Good Good for after dinner cocktails.  I am in love with this joint! The vibe, the music (live DJ), the crowd...everything including the drinks were fabulous. It was a little hard to hear while sitting at the bar, but I didn't even care.  I can't wait to go back to eat.\nYou should definitely go."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTFYxVlFPV2xqVlMxNE1Va3laMlJFTW1kVmVFRRAB",
            "text": "Great food and experience!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWeU9YQXpRM2MwYjJocmJVSXdURXcxYnpGSVgxRRAB",
            "text": "Beautiful space! Good food. Definitely coming back again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rd1JqazRXV3hzUjNWc01WWnlaSFZXZWpGQmIyYxAB",
            "text": "Highly recommend. If you’re in the market for an elevated dining experience, authentic good vibes, and professional hospitality. S/O to Cameron our service provider whose knowledge and expertise made our dining experience special and memorable. Kudos!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMlUzbFFjMHQyYkZkd1VISkZhbkZxYUVKdWRtYxAB",
            "text": "The menu has a nice wine selection, a wide variety of vegetarian and vegan choices, all of which were nicely seasoned and textured, and a professional and attentive wait staff. My husband also recommends the fried codfish sandwich. The portions were generous and reasonably priced for an upscale restaurant in Harlem."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSVVIwNUJjR2RPTjJ4b1REZERRa2d0WDNoa2FWRRAB",
            "text": "The best vibe in the city! Everyone is so nice and Cameron was an amazing server. Will be returning every weekend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WVYwOURlbVl3TUZGMFZsOTNaRzg0U2paaWFIYxAB",
            "text": "Delicious food, great music, and amazing service!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1VlNtZGZjbFpGUVZKNGVDMVdRVkZ4ZW14RVkzYxAB",
            "text": "Had a very delicious dinner. The chicken with the hot honey sauce was knock-out, as were the plantain and jerk mushrooms - and the rum daiquiri was on-point. Our dinner was accompanied by a backdrop of fab tunes, set in a gorgeous decor and with attentive service. Wish we could have stayed longer. Totally worth the trip!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OTlpVVjFkREU0ZFhObVNXZHpRbDlQT0hKRGRtYxAB",
            "text": "Cool spot with a friendly neighborhood feel. Food was good and I loved the DJ. Will definitely be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KRlRXZDBZaTFOUkZKbVRXcEZOMkY0WmpWQlVrRRAB",
            "text": "Great restaurant. Food is fresh and creative with a lot of personality. The ribeye and the double crispy chicken is a must along with the sweet plantains."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUFlWaGFhRk5sUzAxSmJuaFdlVGhqTFRsUGVtYxAB",
            "text": "Exceptional food and experience"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNNWNtWmhhV3QyVGtOVGMxZEJXRWN4V2paRlpFRRAB",
            "text": "Amazing Brunch. Great food, atmosphere & friendly staff."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnNWJFZHljV3RqTjBjeFpuTXhOWEI1YjBSS1RuYxAB",
            "text": "What can I say about this wonderful gem smack in the middle of all that construction. Well once you find the door and walk in, you are transported with a warm welcome, a bohemian inclusive friendly atmosphere of just wonderfulness. I was not expecting such a vibe an ohh it was a vibe.\n\nThe attention staff pays to your needs explaining not just what’s on the menu but can suggest a cocktail in your own likeness.\n\nWe were a party of 4 and we orders the jerk mushrooms (a must have) that jerk was amazingly delish. Codfish fritters so good we had 2 orders. The rouj fab and don’t forget that sweet hot Fried chicken. Brussels sprouts (with bacon and dates) finger kicking goodness.\n\nThe entire time spent was amazing. Cozy small intimate and the music and lighting adds to the ambiance and uniqueness of this place. So good the named it twice “Thegoodgood!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCZlVrNXFNQzFtZVVGWlNsRjNVREZxVWs1Zk5FRRAB",
            "text": "The smoked salmon eggs benny was divine, perfect poached eggs on an exquisite biscuit!!!\nThe spicy bloody mary was delicious, organic tomato juice and all. The codfish fritters should be on every table. The biscuits from The Harlem Biscuit Company literally melt in ya mouth!!! Waitstaff was very helpful and attentive. Shoutouts to Kat & Dillon!!! Kudos on a great brunch! We Will Be Back!!! By @dino4thewin"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkS05XRTNabVJDY2pCamFuSlBla3RHVDJNeFFtYxAB",
            "text": "Will come back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWck5XbEtNalJDYTFoYWNVcFBOM0Y2V25SM05uYxAB",
            "text": "I just want to say that our evening at The Good Good was exactly the vibe we wanted.  The hospitality was lovely and the food was delicious. It's a perfect place to celebrate a special event."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvemNHSlRialJyY0ZaWFNFbERZV2xCV2s5YVJGRRAB",
            "text": "I was mislead unfortunately. All the food was fantastic flavor wise with no objections. Only issue is I ordered the chicken near the bottom of the menu thinking it was a sandwich since the burger is above and the fish sandwich is right under. The fried chicken is literally just fried chicken. Server acknowledged it was misleading which is unfortunate but oh well it still tastes good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WUVJsSm9NRzVyUTNkbU1XUmlYMlZqYm5wSFNsRRAB",
            "text": "a cosy, vibrant Haitian restaurant with excellent food, music and service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sRWJESjNXRE5KZVdabVFqSXhYMUF6YW5WQmFYYxAB",
            "text": "Fish sandwich was memorable"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsUFQxcHJVREpIZGpCdWRITlBTWFJxZVZCalgzYxAB",
            "text": "Everything was great! The vibe and the food! So much flavor! Definitely gonna come back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sS2VFOVRUa2hTZGpoM01XODVOSEZqVDBreWFrRRAB",
            "text": "Offers vegetarian & meat options"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGMmRGODRNbFpvVFROSVVYaGlTa2d5YzJKcGJuYxAB",
            "text": "All the stuff I encountered were Sublime. The Burger was great but the real star of my meal was the cheesecake. Must come again"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abWNVbHNWR0p6VEU1TlZrZGtRbEU1VEhKdFpXYxAB",
            "text": "Cameron was excellent; his peers were phenomenal. The food and drinks are excellent. But the atmosphere is even better!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOeVpXdExjbDlPV1hKemFHRnVUREEwUkhoS2FsRRAB",
            "text": "Excellent service from the maitre'd to our waiter. Very attentive. Food was delicious. I recommend the fried plantain and cod fish fritters. I had the Coconut fish sandwich which was scrumptious."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWmJFNU1aMXBZU0VGTWVuQnRhamRvY1dOQlFtYxAB",
            "text": "Everything about this place was Awesome.  Food excellent omg. You wont be disappointed.  The staff excellent."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4SWVrSXpTalJPYjA5U1JsQkdZbkZyVmt3MGRVRRAB",
            "text": "Brunch food was good (shrimp and grits, fish sandwich, etc) but the slab of meat on the Chicken Benny is ridiculously large and quite unappetizing. Wouldn’t recommend unless you have a huge appetite. Bathroom is strangely dark."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNVgwbFZMVnBUZUhBMGJWVlFkM0p6T0dwVVNVRRAB",
            "text": "Last night was my first time in with a recommendation from a friend. I had a sense of what it would be like and honestly, I am not disappointed with any part of my experience. As a chef, it can hard to just show up and enjoy a space. Criticism creeps its way into our heads even when we don’t mean for it to happen. Yesterday was the first time in a long time I was about to just enjoy the food, drinks, and service without second thought or pause. Cameron, and our server (lovely black man with braids, please forgive me for not remembering your name) did exactly what they needed to, to set the tone for my experience. The hospitality was 10 stars. The drinks were 10 stars. The food was delicious. This may definitely be my spot for the summer. I’d love to gate-keep, but everyone deserves the experience I had last night and I have no doubt if you’re looking for a space that feels like old Harlem meets new NYC, full of great vibes, this is it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SUE0yMWtYemRVTWxoUFRHZFNXa1ppVlZob1QyYxAB",
            "text": "Good food and even better service! The staff was incredibly attentive and made the whole experience enjoyable."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMlNVOUxVVEp4YUROclNGbGpMWGxGY1RoSmNrRRAB",
            "text": "This is an awesome restaurant in Harlem, NY, and seriously, it was such a great time! Their menu options were just delightful -- something for everyone, no matter what you like or if you have dietary needs.\n\nThe sauteed greens and brussel sprouts were so tasty. And the coconut fish sandwich -- huge piece of fish, perfectly topped with slaw, all on this soft, buttery bun. The branzino was cooked just right too. We even jazzed up the virgin cocktails with a little rum, and those were wonderfully delicious!\n\nBeyond the food and drinks, the whole vibe at Good Good was just it! Good energy, bumpin' music, and that seductively smooth lighting just made the atmosphere perfect. Plus, the service was on point, super attentive. It all just made for a wonderfully \"good good\" time! 💯"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WclF6ZFhjMDh6Wm5KWVUzZFVVRGRQY0ZWR1NIYxAB",
            "text": "If W.E.B Dubois came to 2025, I would bring home straight to the Good Good. The Decor screams Harlem.....but not Renaissance, it's modern Harlem . The food is extremely flavorful and considering what high quality it is, reasonably priced. FYI the shrimp and grits is Southern Grandma  certified. This restaurant is truly Black excellence personified"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ScWVHaDZXbWhVTUd0M1lreFJWWEpMTmxkNU1tYxAB",
            "text": "Super eclectic spot with beautiful vibes, yummy cocktails, and great food. Would absolutely return."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sM1JFUTNSVkZ2VHpGWmIzWmhlbHB2YUV4SGNGRRAB",
            "text": "Haven't been dissapppinted!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1emR5MUtOSEpJV2xabmFHbHdYME42TTJST05GRRAB",
            "text": "I visited from Chicago with friends.  This place is so cozy and wonderful! Love the vibe! Music is off the chain and the food is deliciously amazing!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUldERnllbm90T0cxVGEyaExXV2xxWjFGelpVRRAB",
            "text": "Finally checked this place out on Juneteenth and man oh man was it special. From the cozy speakeasy vibes, to the people, the music and the food, it was all perfection.\n\nOnly got appetizers and dessert but the Brussel sprouts, jerk mushrooms and codfish fritters were all memorable. I’ll definitely be back to try more!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkaFoxQlJPSEZsTWxkUVV6Tk9Nak5rZUZSYWJIYxAB",
            "text": "An ecclectic spot with mix of soul food and caribbean influences on the comfort dishes of owner's childhood. A cozy tiny place with small focused menu and warm friendly staff."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJUGlvdUNCejZQR3NRRRAB",
            "text": "Highly recommend this wonderful somewhat hidden gem! First class food. service and space!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPMmV3T2ZkcWJiR0V3EAE",
            "text": "Had a lovely relaxed time at the good good. They don’t rush you out, that’s a luxury."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKWHRodGE1aG9yaXhRRRAB",
            "text": "With no doubt we’ll be back. Great food great service great atmosphere"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMT20xSjJZMDRUZWV3EAE",
            "text": "Phenomenal hidden gem, wonderful service, cozy but special atmosphere, and really thoughful, great food. It is quite small, so it can be louder if it is full, but never overwhelming"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaVpxQk53EAE",
            "text": "This brunch gem was brought to me, of course, by the one and only Dom in the City—my girlfriend who I always let know when I’m in her neck of the woods.\n\nThe food? Amazing. The vibes? Immaculate. The atmosphere was grown and sexy—even for brunch. You can sit at the bar (which is gorgeous, by the way), and the bartender, as you can see in the video, was a whole vibe.\n\nI had the buttermilk pancakes with caramelized brown sugar bananas and vanilla syrup—chef’s kiss. We also tried the fried chicken Benny and the Pullman French toast with a side of jerk chicken sausage. Everything was so flavorful and well-executed.\n\nWe each had cocktails—mine was off-menu and I wish I remembered the name, but of course I got the photo above to help you out!\n\nAnd the cherry on top? It’s Black and woman-owned—we love to see it. That kind of excellence deserves all the support.\n\nI genuinely love this place. It wasn’t overpriced either—about $50 for brunch and a cocktail, which is pretty standard if you’re from Houston like me. Super easy to get to, right by the train, and reservations were a breeze to make on Resy.\n\nHighly recommend. I’ll definitely be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMX2VrX0Nrclk2MXJ3RRAB",
            "text": "My friends and I decided to explore Harlem one night - so happy we made the trip (from fresh meadows and midtown west)! We ordered jerk mushrooms, curried carrots, roasted yams with peri peri glaze, traditional Haitian rice (diri kole ak pwa rouj), crispy brussel sprouts, hot honey fried chicken. The flavors were delicious - some heat, some tanginess, some sweetness, and lots of fragrant spices. Leftovers heat up well.  The staff are awesome, and ambience is warm, beautiful. Many thanks to our waiter that night; they helped us land on our chosen dishes 🙏🏼😁"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKRC11dkxjeWRUQlJBEAE",
            "text": "Went to see this place after I found out the sister that owns the famous Edge Harlem restaurant also is also apart of this restaurant. The place is a little obscure and smaller than advertised, but it did not disappoint. From the moment you walk in, you felt the energy and liveliness plus the enthusiastic staff were warm and welcoming. The food was amazing. Though the menus could be expanded a bit more, and the bar tender is heavy handed when pouring liquor, which made the drink very unbalanced. Despite the 2 things the place was lovely and I may return before the year is up,"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOE9uSGxBRRAB",
            "text": "The atmosphere enjoyed clean and small and intimate.\n\nFood was decent but not filling. We started with  cod fish fritters as appetizer. Two orders of shrimp and grits, pancakes with a side of pork bacon, and then the brunch sandwich and a side of scrambled eggs.\n\nTwo coffee orders, and two alcoholic beverages the grand mimosa, and a rum drink.\n\nNo complaints of the food being nasty. Just won’t feel full after eating.\n\nStaff was OK so nervous or like it was the first day . When they brought the food, the waitress forgot to bring the syrup and any other condiments. The bill was decent for four people.  It was OK.\n\nA pretty packed place despite being tiny, but made no reservations and able to walk in."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKWG10OFRRNXVqWEd3EAE",
            "text": "Came here last Sunday for brunch. The vibes, service and food were great. You should definitely get a reservation, its a popular place. Loved the menu options as well. This place was very accommodating as we brought our infant with us and they tucked away our stroller and gave us a booth. We will probably come back for dinner."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNF9mb053EAE",
            "text": "Fish sandwich was crispy and bursting with flavorful - on point! but the highlight of the dish was the plantains cooked perfectly and coated with a lime spice.  Best plantains I’ve had in my life.  The biscuits were fluffy and dense - don’t ask me how but take a bite and you’ll taste a bit of heaven.  Fabulous!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIN3ZQVWx3RRAB",
            "text": "We were looking for a nice place to eat while we were in Harlem, and we came across The Good Good  the latter part of a Saturday night.  The staff was super attentive and efficient. The food was really yummy, especially the jerk mushrooms, the codfish fritters, and the branzino.  We decided to order a bunch of items and eat family style.  Awesome decision!  The restaurant also has a super cute decor with comfy high booths.  I would definitely return."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPcnhzNkhadjU3clJnEAE",
            "text": "We celebrated our son's graduation dinner here. I am so happy that we did. The food was outstanding, drinks very good and service warm and accommodating. I cannot wait to come back for brunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucXVQbFZnEAE",
            "text": "This place is on the corner & so hidden/lowkey, if you weren’t looking looking you could accidentally pass it. We made a reservation but it was pretty empty.\n\nThe ambiance in this place is really something beautiful, warm, and welcoming. I absolutely fell in love with this space! From the colorway to the decor, loved the gold accents, plants, & tropical art/wall paper.\n\nFood: the biscuits & fritters were delicious. The shrimp & grits had a burnt roasted taste that was something you had to get used to but the grits were so creamy. The bacon was perfectly cooked.\n\nI absolutely loved their mocktail menu! The ones I tried were both tasty. All in all a fantastic experience & I am already planning my return."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvd2RqY2hRRRAB",
            "text": "Have been here a couple times now. Staff are always attentive, friendly and knowledgeable. It’s a super cute spot with great atmosphere, the food I’ve had has always been good and the cocktails are delish!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3aE92c293RRAB",
            "text": "We live in the neighborhood and we would always walk by this restaurant - I guess when it's so close you only think there's always an opportunity to go lol - but I'm glad we finally made a reservation! First, the environment is cool - and the staff is super friendly. The food was really good - our favorites were the fish sandwich and the cheesecake, perfection. Can't wait to go back to try the brunch!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqdW95ZWJREAE",
            "text": "I recently dined at this restaurant and the experience was absolutely fantastic. The service was top-notch, with the staff being attentive and friendly throughout the meal. The ambiance was also lovely, creating a relaxed and inviting atmosphere.\n\nNow onto the food - everything we tried was delicious. The branzino was cooked to perfection and bursting with flavor. The drinks were tasty and complemented our meals perfectly. The hot honey fried chicken was a real standout, with the perfect balance of heat and sweet. And don't even get me started on the fritters - they were absolutely divine.\n\nOverall, I would highly recommend this restaurant to anyone looking for a great meal with excellent service and a wonderful ambiance. You won't be disappointed!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoa1pHWkpnEAE",
            "text": "This place is MEGA sexy. It's beautiful, the staff is beyond lovely and the food is unreal. We had the deep fried avocado, plantains, and jerk mushrooms (all of this was plant based though the restaurant caters to meat/fish eaters as well). We savoured every single bite because it was just delicious. The music was perfect. Not too loud. The vibe was lively, fun and at times, if invited, communal.\n\nThe drinks were delicious. Try the Rum Ting. We only took one pic of the food because we aren't professional at this and were too busy living in the moment and vibe of this amazing place! HIGHLY recommend."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwLUxDbzZRRRAB",
            "text": "Had a late night dinner here after the recommendation of a friend. It’s a great additional to the Harlem food scene.\n\nThe drinks were strong and the food was delicious. I ordered the Coconut Fish Burger and Fried Sweet Plantains 🔥🔥🔥\n\nThe service was great and the ambiance was super chill.\n\nNot a big restaurant so it feels very intimate.\n\nPrice: a bit on the expensive side but the food was delicious.\n\nWant to get back and try some more items on the menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsbV9HQUR3EAE",
            "text": "Ate here for my birthday and had a top notch experience from beginning to end. We ordered most of the menu and loved every bite! The yams are by far the best appetizer, and I loved the steak and branzino too! I recommend the rum & ting cocktail. They make the drinks strong! The server even brought out a birthday candle in our dessert! Will definitely be going back. I am so happy to have this gem of a restaurant in the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYcU15VVJnEAE",
            "text": "We’ve had this place saved a while as we live locally and we’ve been looking for an excuse to go. The meal was underwhelming: while some dishes were good, for the prices it’s one of the most expensive meals we’ve had in the city recently ($129 for 1 drink, 1 side, 1 main each for 2, before tip) and the food was pretty much average. The burger was very loose, clearly preground, and the tomatoes very inconsistently sliced (one massive and thin, the other slice small and very very thick). At $26, or $36 with fries, it’s maybe the 3rd most expensive I’ve had in the city, and somewhere in the lower half for quality. The chicken and Brussels sprouts were good, but the plating was odd: chicken was in a large bowl with a massive pool of honey at the bottom. Plates for eating were side plates, which meant you ate one dish at a time. The Diri was a very small serving of very standard rice, overflowing in the tiny serving bowl; to serve, they provided a massive serving spoon which meant spilling rice and beans everywhere. Another odd thing were the cocktails - my wife and I both ordered martinis, but one had about 25% more than the other. Overall, for the expense I don’t think I’d return - the attention to detail was low, and with the prices for us it just did not feel competitive with other late night fine dining options we’ve had in terms of quality or expertise."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKMDUyMWNBEAE",
            "text": "My girlfriend and I stepped in to this bustling spot full of charm and amazing ambiance. The Hostess at the front was friendly and had us seated at the bar immediately. The Bartender Zuhri took care of us and made time to check in us if we needed anything. We didn’t stop in for food but, will absolutely update this review when we do. The drinks were delicious and crafted very well, I’m excited to try their future signature drinks! But so far from just the first impression we’re very very impressed. East Harlem needs more places like this and I’m all for it :)! If you’re in the area please give this place your attention, it could be your next little Gem."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1eVlfZlB3EAE",
            "text": "Absolutely loved my experience here. Made a last minute reservation for dinner for 9:30 PM. The kitchen is open until 10:30. The decor is warm, cozy, and inviting. The food was delicious! I had the branzino which was tender and flaky, well seasoned with a really flavorful sauce. My date had the coconut fish sandwich which he ravaged. We also got the sauteed collard greens which weren’t too salty and quite fresh. The curried carrots were also delicious, a perfect mix of spices and a little sweetness. We finished with the cheesecake and the crust was so buttery, I could have eaten that alone. Finally the service was immaculate. Every person greeted us, they were attentive and kind. They joked with us and shared a bit about their background. They were knowledgeable about the menu and able to answer questions. Everything was so good, we’ll be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENzQ2ZnV3RRAB",
            "text": "I live in the neighborhood and have passed this location several times. I couldn't figure out if they were open. When you enter, there are draperies so that the outside can't see in. Love the look and decor of the place. The food was unique and tasty.  The cod fish fritter is not the traditional cod fish fritter \"Bacalaito.\" Will definitely return this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbHJTRVNnEAE",
            "text": "Such a great place!!  And honestly the entire staff was amazing!  Teamwork.  Efficiency.  All perfect.  Food was really amazing, especially the curry carrots and the chicken.  But my special shout out to the bartender, Rosalie (sp?), who…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIaTQ3TkdBEAE",
            "text": "Went here on a date with my girlfriend for dinner yesterday and like the romantic vibes it gives. Found out about this place through instagram and wanted to support a black owned business. The staff were excellent in accommodating us and seated quickly after making a reservation which is recommended.  They have great selections on drinks from cocktails to wine but I wouldn’t call this a place for dinner. This is more of drinks with bites and sides. The only real entree they have is the Branzino but even there you have to buy the sides instead of it coming with it for the price the Branzino is. If there is a knock on this place is that there isn’t any more entrees and the place is small. I had the Coconut Fish Burger with the Codfish Fritters and my girlfriend had the Branzino with the Haitian Rice I cannot pronounce right. Loved the Fritters with the Jerk Aioli sauce and the Fish Burger was massive and put on a small brioche bun. That fish was shareable for 3 people but I love how flavorful it was. My girlfriend liked the Branzino with the rice. The star of the night was the coconut tres leches cake we had. It was so good I give that a 12 out of 10, it was that good. I would only come here again to get drinks and the plate sides along with that cake. Overall though enjoyed the experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROanFQMjN3RRAB",
            "text": "Im so impressed with this place, I wish I could give it more stars! Neatly tucked on Park ave, this is truly a gem of East Harlem. Delicious food, awesome music and a lovely staff. Immediately when I walked in, I was surprised by the vibe. I love the menu options. I had the pancakes which came with candied plantains, the plantains were a bit too hard for me to chew but the pancakes were fluffy and made to perfection. My only gripe was there were no lattes nor cappuccino. This felt like a place that should have that but they do serve an assortment of teas. The jerk chicken sausage was soo good. We ordered two of those. Overall this place gets 10/10! I would definitely come back and I highly recommend anyone come here and see for themselves."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROdF9PSkVREAE",
            "text": "When they're full, the service can be slow. Sitting close to or in front of the door can feel colder, so dress in layers during the winter.\n\nDecor is awesome! Feels very chic but over the top.\n\nServers were very nice and attentive.\n\nFood - we're vegetarians.\n\nFried sweet plantains with lime salt are too dry. Please add a sauce on the side to it. Otherwise, six long plantains is too much for 2 people.\n\nRoasted yams - GET IT even if you only eat meat. Incredible!!\n\nSauteed seasonal greens - hit the spot for us with the garlic in the winter. We think y'all can make it even more garlicky.\n\nJerk mushrooms - awesome. Great sauce as well of the mushrooms.\n\nDiri kole ak pawa - don't get it. It was dry and too much dry seasoning (likely fatalii pepper). For Indians, this would be like adding too much tumeric to a dish.\n\nDrinks wise - Gruner white wine was very very light. Good good rum daiquiri was awesome. Not sweet, but not too sour. Great drink for a date night!\n\nThey're quite strict about reservations because they only have limited space. About a 5 min walk from closest 6 station (116th and lex). Area felt very safe to walk around."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4MmUyMGp3RRAB",
            "text": "Finally, a neighborhood restaurant with an air of sophistication and class, yet, not stuffy at all. On entrance, you will be amazed by the well appointed decor with afro centric pictures adorning the walls throughout. We sat at the bar and ordered a smorgasbord:  jerk mushrooms, coconut fish sandwich and cod fish fritters. We were wowed by the taste; totally delectable. Kudos to our bartender Christine for handling a huge party while still being attentive and engaging to my lady and I. We chopped it up with owner Justine and promised to revisit soon. It felt soooo good to be at The Good Good!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1ejV5N2l3RRAB",
            "text": "We had dinner at this restaurant. The atmosphere is cozy with a nice stock bar and u-shaped tables. Service was attentive and professional. The food was average in taste nothing special that would want you to crave it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcjhhdWtBRRAB",
            "text": "I've been to The Good Good over half a dozen times, and I have never been disappointed! Every dish I've had, and every drink I've ordered has been excellent. In particular, I really recommend the cod fritters, the coconut fish sandwich, and the grain bowl. I actually usually avoid \"grain bowls\" on menus because I think they are often lack luster, but I crave the one at The Good Good! A wonderful welcoming establishment, with truly excellent food! And if you go for brunch, I definitely recommend the jerk mushroom omelet!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdmRtNk1nEAE",
            "text": "Absolutely loved my experience at The Good Good! From the moment I walked in, the service was truly top-tier. It's rare to find a place where they remember you and treat you like family, but that's exactly what I found here.\n\nThe brunch options are incredibly unique and delicious. As a vegetarian, I'm always thrilled to find more than just one or two choices, and The Good Good exceeded my expectations with their diverse and flavorful menu. .\n\nFor cocktails - you can tell they put a lot of detail and care into crafting each drink. They were not only beautiful but also incredibly tasty.\n\nOverall, The Good Good has a fantastic vibe. It's the perfect spot for a relaxed and enjoyable meal. I highly recommend it and can't wait to go back!"
        }
    ],
    "reviews_count": 77
}