{
    "name": "Sea To Soul Harlem",
    "place_id": "ChIJCfeO8RL2wokR7IfrK1Vdd2U",
    "grid": "MN10",
    "address": "2058 Adam Clayton Powell Jr Blvd, New York, NY 10027, USA",
    "rating": 4.3,
    "user_ratings_total": 132,
    "phone_number": null,
    "reviews": [
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMFMwTTJaamRvWDNGbU0yOW5ZWEpLWkY5TldHYxAB",
            "text": "I’ve ordered from here on Ubereats - They normally have great deals and the sea food is well seasoned. I really like the greens.\n\nWhat really caught my eye yesterday was that they are testing out grilling burgers and jerk chicken. Please support yall because I really am craving more grilled food than jerk chicken. Hopefully they can do ribs soon too."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUmJXZENMVVZWYXpsZlFrTjNTMWx6YnpBM1dGRRAB",
            "text": "I enjoyed this restaurant. Not crowded, clean,  good food and service. They had music playing in the back whichade the atmosphere more pleasant... Highly recommend...."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkVFIxWnZiMDlhZFdGUFNYaHdSRkp0YVVkblRVRRAB",
            "text": "The people was so friendly,the food was amazing. Me and have the white fish,mac and cheese,potatoes salad and green beans. We give everything a 8.5. We will be back soon"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNWNWcDBTRlEzT1UxalRYZFRPVWN5VmtvdGRIYxAB",
            "text": "Food is nasty salty"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyNzdhWWdnRRAB",
            "text": "5 STARS. BEST SEAFOOD AND FISH IN HARLEM"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SVdHUjBhazAxVGxSeGIyOTBZek55VEhWa09HYxAB",
            "text": "Was happy to find this place. Went to Nadia's last weekend, Amy Ruth's during the week and was pretty disappointed. I actually told the guy I have high expectations. Lol. I live in a town where this is no descent food. Italian and fast food. Oh and commercial Jamaican food. Thank you!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5eWF6QlRSbGRvVWt4VWNHNTVabU5NZERkZldYYxAB",
            "text": "It was closed"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xad2RtOHhlbWRPVFVKaVdUVlVjaTB4Wmw5NGJXYxAB",
            "text": "I  was here yesterday  the food is amazing !! I ordered the shrimp and fries so good and had a Lemon Drop margarita at the bar while I waited for my food the atmosphere is amazing the music was good as well !! I will definitely be back !! I highly recommend this place !!!!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWSFIwUldhRm81U1RKa2VtOWFiWGRwWkZkS2VsRRAB",
            "text": "The owner made us feel very welcomed! My family and I enjoyed our food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWaFNYRk5YMkozVVRsQlgzSnVhV3h2WlRSelZVRRAB",
            "text": "Great food"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xORlJrTTVZbDl4V0hwNFl6QkZOak5aWmxkVFExRRAB",
            "text": "The fish tasted really good the shrimp was big and seasoned well, the Mac and cheese was ok needed a little more seasoning wasn't bad. My wife had the fish and chips she liked it also the greens was really good the candy yams was  very tasty we will go back again real soon."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Jd1VtUnhNM2gxYXpWWE4wTjJSMGhhTlhCalJFRRAB",
            "text": "AWFUL Fish fried dry and hard snd dry, not crispy. Potato  salad was tasteless. Tried to season the awful macaroni  salad, had to throw  it out. BOTH salads tasted like they had been sitting  out...A waste of  $45.... NEVER AGAIN"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SdlgyVjZiMmhpVDJaNFkybGlOREp3WkZsR2VtYxAB",
            "text": "Visiting our daughter and headed to Harlem on her friend’s recommendation for soul food. Eric the owner didn’t disappoint! Friendly southern hospitality! We started with the sangria. Wow! great flavor and packs a punch I am from Wisconsin…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vMk1FUk9UV1pKVTFOU1QxUmFOMUpIVjJObE1FRRAB",
            "text": "My wife love it service. Nice place to grab some fish cause she was craving it"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcE5sRm9ibXBYYjA4NU4yYzBkR1ZLTURCQ1EwRRAB",
            "text": "Stopped in for a quick bite the other day and was welcomed with great service from the team. Ended up getting the lobster mac and cheese and greens with a sangria. My friend also got the blackened salmon salad which was unfortunately burnt.\n\nDiscovered they have additional seating in the back but unfortunately none of the tables were wheelchair accessible. The sangrias were defiantly worth it and packed a punch!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FdFdrNUdia0Y0Vm5kak1FNXZUM0ZTUVdKek1WRRAB",
            "text": "Fish tasted fresh.  Good sized shrimps and good amount of whiting!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swelIzVkhkSFI2WWw5aWExQkxObFp1YW5WaFYxRRAB",
            "text": "The food is bomb but the yams is way too sweet, and I don’t like that they cut one fish into two and call it a two piece . I believe that was the catfish I brought"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WNWVVOVFlbFZ5UWpSMlptZERWeTEyZDBWM2RHYxAB",
            "text": "I found a place with southern food in the city. Service was considered equivalent to that of genuine southern hospitality. I was greeted cheerfully. The gentleman was friendly. He aimed to show that my patronage was valued. The food was good. It exceeded my expectations."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSFEyZ3RVMmxNVmtZMmFrMVRWMVJLYjJjd05VRRAB",
            "text": "I recommend this restaurant to all, it has the best food in Harlem, stop by and get you a plate or drink or hookah.. 10 out of 10.."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pscWJYbGZjRWc0TjB4TWJEVk1kRVF5V2pKS1EyYxAB",
            "text": "Dope chill environment and not to mention spectacular food! Salmon cooked to perfection, mac n cheese, collard greens amazing….. meal satisfaction!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GV1RrRlVhMlpyZUVScVZEbEZNRmhoY0VkSVRIYxAB",
            "text": "The wings are like no other so don't bother trying to compare. Grab a piece of carrot cake to go, trust me."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOV1RGRjZUVlUwWDNSb2IwUjNNVWQyWjNCd1lYYxAB",
            "text": "Food was great for a sea food spot. The chicken wings were top notch. Definitely hitting this spot everytime I visit from FLORIDA."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4dE0wRmFjMkZNY2xWcFNVSmhhR1F3Tkc1R2RHYxAB",
            "text": "I was in the hunt for some good fried fish came across Sea to Soul decide to give it a try. Everything was great. Food had a lot of flavor fresh just what i was looking. I live in CT I will definitely be going back. Little spot but you will definitely get your money worth. Eric is the owner and he made sure we got the best service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21scVgyeEZhVVptZVRRMFZYSmxVSEYyVG1KYVFrRRAB",
            "text": "Food is delicious!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJcUtvNE9kOWZqcGZBEAE",
            "text": "The food came hot and crispy. Everything was delicious!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJX1QtTkxlMWNuMC1nRRAB",
            "text": "Great catfish sandwich and shrimp starter. Food was fresh, hot, and well seasoned."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMXVMRXdnRRAB",
            "text": "The food was delicious I will be going back the loacation is around the corner from my home"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPS1h5b2kteGRuQUh3EAE",
            "text": "Food is delicious. I would recommend this place."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOExtMGFBEAE",
            "text": "First time going, will definitely be back, food was very good."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdDdIVzlnRRAB",
            "text": "A Gem. The collard greens. Enough said."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJalpLdnhnRRAB",
            "text": "The food was very tasty and delicious. The food was hot and ready to eat. We love the collard greens and yams. Just ask for the collard greens to be in a sealed container so the greens juices don’t spill in the bag. Love The Soul Food"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNGEyaF9RRRAB",
            "text": "Nice spot and the food is good. Just wish there was a larger portion. The sides are pretty small."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOXZEZXlnRRAB",
            "text": "My aunt and I visited this establishment. The owner showed my aunt and I so much Southern Hospitality. He went all out. He presented us with a free taste of his potato salad. This place is very cozy and roomie…. If you need to unwind, eat, drink, relax and hide abit, this is definitely the place.   I will return soon to do so….."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNkxLR1N3EAE",
            "text": "Alhamdulilah I’ve been eating here a lot to break my fast so far zero pork served there !💓 I can say my experience both times ordering over the phone has gotten a bit mixed up both times the owner Mr Eric fixed it. Please support local black businesses!!! Also the two men one in particular always wears the mask is amazing amazing mashaa Allah"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eDV2Mnh3RRAB",
            "text": "LOVE LOVE THIS PLACE! ITS GOOD HOME FOOD! NOT AT HOME!😋❤️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3eWFQNERBEAE",
            "text": "Great soul food/seafood takeout. They have a small bar with the best sangria. I'm from Arkansas. I know soul food!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3dzdyLXhnRRAB",
            "text": "Where do I even begin?! This food was absolutely amazing! From the very first bite, I could tell that everything on my plate was crafted to perfection. The flavors were spot on, the presentation was beautiful, and every single dish exceeded my expectations.\n\nI was blown away by the quality and freshness of the ingredients. If you're a fan of authentic soul food, especially seafood, this is the place to visit! It’s rare to find a spot where everything is so well-executed, but this restaurant has definitely earned my praise.\n\nI highly recommend it to anyone who’s craving an unforgettable meal that’s packed with flavor. You won’t be disappointed!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ZzZ6Vmh3RRAB",
            "text": "Wow this food is amazing I’m so glad my son took me here. Everyone need to try their food hands. Down better than make my fish, they fell off, and light house only give you fish the have cut in half and then cut the half in half. I hope they quality of food stays the same here"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNTdyUS13RRAB",
            "text": "Small place but the food packs a big punch! I was highly impressed with the food quality, I was on the hunt for some good soul food for days tried a couple of other places in Harlem and they were okay but this place right here did the job! Sea to soul is where it's at. The yams were good. Had me feeling like it's thanksgiving in March lol. Mix the yams with your Mac and it's 100 times better. The Potato salad was cold good and flavorful you can see the seasoning throughout the whole container. The customer service there is amazing as well from the owner to the staff ! Will def recommend and definitely be back !"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNTlMX0xBEAE",
            "text": "Lets talk about it !!! Yes its Delicious and flavor able first  time very good mac and cheese and wings  i wont pretend i recommend !! Very friendly staff love it wish they had jalapeño mac and cheese   ❤️❤️❤️❤️❤️❤️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReE5teWRREAE",
            "text": "Just wanted salmon found this on google. Uber eats was trying to charge me for two sides which were suppose to be included. Spoke with Eric and he took care of it.. Oh but the food….  Amazing!!!!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnLUxDWHN3RRAB",
            "text": "The fried fish tasted like dirty oil. The mac and cheese was bland, and the cornbread was forgetful"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnOGZySzVBRRAB",
            "text": "Whitey fish was really good! Not salty an fresh! The grits was ok seem like they could have cook a little more! They already come with cheese in them! So if you don’t want cheese I don’t no how that’s going work for you! The macaroni salad was good! I will go back to try another dish."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbmNER2dRRRAB",
            "text": "The food and vibe is amazing! My first time in NYC and wanted to try soul food! Would recommend 10/10"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBaWU2VnB3RRAB",
            "text": "Very good. We will definitely be coming back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfcmFXaktREAE",
            "text": "Food was fresh and delicious, mac & cheese was hot and buttery. Staff was welcoming and pleasant. I will definitely visit again."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOVpMejNBRRAB",
            "text": "The food was good, prices are reasonable. The service in the back was even better. The place is small is the only downside."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfd2E3THF3RRAB",
            "text": "Sea to Soul is an absolute gem! From the moment you walk in, you're greeted with warmth and genuine care from the owner, who goes above and beyond to ensure every guest feels welcomed. The portions here are absolutely massive – come hungry! I ordered the seafood platter, and it was incredible. The lobster tail alone was a standout-- it must have weighed in at least 10 ounces, perfectly cooked and packed with flavor. Every bite of the platter was fresh and delicious, and it’s clear they take great pride in the quality of their food. If you’re a seafood lover looking for hearty portions and a welcoming atmosphere, Soul to Sea is a must-visit. Highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOUpTQkdBEAE",
            "text": "Had a call in, was mad late, Still held the food. Payed, a left. That meal brought me back that night. Exceptional service."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNma2VXYnl3RRAB",
            "text": "Rude"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzMXJIc21RRRAB",
            "text": "Cute little hole in the wall place for a quick bite!\nFood flavor immaculate. The fish has the perfect blend of spices and seasonings. Cooked to perfection. Entree comes with one meat and 2 sides. Drinks are STRONG but good, especially for the price!\nBartender was wonderful and attentive, cashier forgot our drinks but it happens.\n\nBack room is a cute little sit down bar area with great music and lowlit lights.\nOrder takeout but can dine in."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCd3YtX2dBRRAB",
            "text": "This place is a hidden gem in Harlem !!! They have a carry out in the front and a small lounge bar area with sit down tables to eat. They even have hookah and large flat screens to watch sports !!!\nMost importantly the food !!! Omg !!! Everything was amazing!!! My favorite was the fried whiting and shrimp poboy.\nThe French fries were fresh cut and hot ! Super good !!! Nothing was too salty like many places I have encountered. Everything was seasoned perfectly and the service was fast and friendly! I had the best rum punch too !!! I will be going back soon for sure!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyNk1HMmJREAE",
            "text": "Eric was nice and very welcoming.. first time there, received like an open arms family customer service. When I wasn't to sure on a item he provided samples plus a catfish to take home.. all stars service, the food was great and in abundance.. Must try seafood rice..💯"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzX1BuQlNBEAE",
            "text": "The black guy behind the counter was friendly. My shrimp scampi was good! The whiting was salty. I didn't try the Mac n cheese n greens yet. Oh and the yams were good. I should have taken photos sorry. I was getting my hair braided next door and I'm like let me order food to go home not realizing it was right next door. 🙃 I recommend\nAddendum: I'm pissed bc i paid for a banana pudding and he didn't put it in my bag. It's not in here. I'm really sad and pregnant. Now I'm min u sing some stars"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmeXNPclJnEAE",
            "text": "My friend Michelle n myself Carol yn we wanted some good old drop the mic soul food, with a slice of good prices, before we went to the theater. Jackpot. We  meet Eric, very pleasant and attentive to us. We definitely will be back. Great place, food, and music 🎶"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMbXVieDJRRRAB",
            "text": "The food is delicious. It's a small spot, very unassuming. I wish it were a larger establishment with more seating. We are outside where there were two sets of tables with four chairs. I ordered catfish with candied yams and collards. I can not emphasize how awesome the meal was. My friends ordered whiting, calamari, fries, and Buffalo wings. Excellent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYNE15OVVBEAE",
            "text": "OMG this food is delicious. I wasn’t even thinking of writing a review but it was that gooood, I had the fried catfish collard greens and cornbread. It was so fresh and delicious. I don’t even live in the neighborhood. I looked up this place so because I wanted fish, I took a chance and so glad I did. The cornbread was the best I’ve ever tasted, simply delicious; service was great! I shall return 😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqb0lUcVdnEAE",
            "text": "I judged this restaurant prematurely because it wasn’t crowded, but I’m glad I decided to order takeout. I arrived on a Saturday night starving and didn’t know what to order. I ordered the scallops and potato salad, shrimp and chips, and two mixed drinks! The scallops were a bit small but seasoned well and delicious. The shrimp and chips were also delicious! I’m definitely ordering again and you should too if you’re looking for delicious food and great service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqcWFfR2p3RRAB",
            "text": "My first time here. It was crowded because of an event. But let me tell you.. it was worth the wait!! We couldn’t stop eating lol forgot to take a picture. Omg so delicious. I used to say there were no good soul food restaurants left it NYC. Notice how I said “Used to “.This food was absolutely delicious! We had fried whiting, fried shrimp, yams, Mac and cheese. Broiled shrimp and yellow rice.  They sold out of collard greens so I know those were good! I will be back ! You have a new customer!! Thank you!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5LXZIeF9RRRAB",
            "text": "My first time here. So happy I found this gem. The fried shrimp and grits were a 10 out of 10 and the Mac and cheese a hit! The staff was super helpful. I will most definitely be back to try something new on the menu!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6bU9hZ1l3EAE",
            "text": "Food was great . Drink were too good. And music 🎶 on point"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyM1oySGR3EAE",
            "text": "Awesome and cozy spot. Friendly staff. In fact, I met the owner who is a cool down-to-earth guy.\n\nAs for the food, the fish and chips were seasoned and fried right. Fries were not too hard or soggy and, the fish was just perfect.\n\nAlso had the blackened salmon...very taste.\n\nI strive to support black-owned businesses. But even so, I am going back solely because the food was sublime.\n\nThanks again, Shawn and Eric!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNXNpb3dnRRAB",
            "text": "Hit or miss I guess. I've ordered from this restaurant twice. The first time there wasn't anymore sides, so I ordered just shrimp and fish. Which was tasty. The second time, I order whiting and shrimp with two side (mac and yams) and…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMX2F2c2NREAE",
            "text": "I’ll be back. Thought the whiting could’ve been seasoned a bit more but it was nice and fresh, the fried shrimp was perfect, collards were decent and Mac could’ve used more of a kick but I like it here. It feels like I’m at the crib!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtblppY2RBEAE",
            "text": "This food is good! The shrimp are good the fish is mouth watering. U gotta dig in. The greens are cut goods and the Mac&Cheese is good. They food is tasty 🤤. U can’t do yourself wrong with the food that u get here. Nice easy going music nothing nice on the ears! Plus the sangria packs a nice ass punch 🥊! Try it!…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyN1lMZV9BRRAB",
            "text": "Just went in for some casual dine-in. Unfortunately, we were almost too late. We were able to get a drink while we waited for our food. Bartender was very approachable and friendly.It smelled so good we ate in the car. I had fried shrimp, mac/cheese, collard greens and potato  salad. Everything was seasoned well; potato salad was balanced right amount of everything, greens were cut in nice bite size(almost ask if they sell pot liquor of the greens) mac/cheese was not stingy good amount of cheese and pasta. It is a Black Owned Spot!!!!\n\nWill be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuXzRHbWJ3EAE",
            "text": "OmG. The food, drinks, and vibe are LIKE THAT. I live in BK and schlep all the way up here, on the train, to get that fried whiting, string beans, and macaroni and cheese along with a couple lemon drop cocktails. Just heavenly. Honestly, I didn’t think I’d find real soul food here in the NY and would have to have it imported from my hometown, DC/MD. But, been a few times and going back this weekend lol."
        }
    ],
    "reviews_count": 67
}