{
    "name": "Sottocasa Pizzeria Harlem",
    "place_id": "ChIJM1oV8w32wokR9gt0ynHqypM",
    "grid": "MN10",
    "address": "227 Malcolm X Blvd, New York, NY 10027, USA",
    "rating": 4.7,
    "user_ratings_total": 1501,
    "phone_number": "(646) 928-4870",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkaGFXSlZWM1I0WjJkdlZXSmxTMVZxYm1KaFJtYxAB",
            "text": "Best pizzeria in Harlem!"
        },
        {
            "date": "수정일: 5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NXVqQ0lnEAE",
            "text": "Their dough is heavenly and mozzarella so fresh. The sauce is also the perfect balance. Absolutely delicious and wonderful service.  Had the tiramisu to go, and it was also very good. Will be returning. Update: have returned many times over and still think it's the best pizza I've ever had. Update 2025: still the best."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6d0wteW1nRRAB",
            "text": "By far the best place in the city to have authentic Neapolitan style pizza!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRd09FTlNWMDVvWlU0MFFrbE9jbGRWV2s1dlZuYxAB",
            "text": "And time and again, this is a wonderful place to grab a delicious bite. So far, none of the choices have gone wrong, and one leaves with a great deal of satisfaction.\n\nPREVIOUS REVIEW:\nSmall and simple restaurant with wonderful Italian pizzas, thin-crust, very delicious. But before even starting that, consider the sangria (particularly if the weather is hot outside), and consider finishing the feast with some dessert, eg the panna cotta or the coconut icecream or the lemon icecream with prosecco. Delicous."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OU09VeG9UMlZSU3pCNmVEY3pabkpFVld4cFZGRRAB",
            "text": "Sottocasa Pizzeria Harlem is amazing! The pizza is thin, crisp, and full of authentic Italian flavor — you can taste the quality in every bite. The ingredients are fresh, the dough is perfect, and the atmosphere is cozy and welcoming. The staff are super friendly and make you feel right at home. It’s the kind of neighborhood spot you’ll want to visit again and again."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KeWFXdHpNMmhyUlVnek5VNVNjRGROUzBneFIyYxAB",
            "text": "Had a very unpleasant and disappointing experience with the owners of this restaurant. I arrived right at opening, around 5:00 p.m when the place was nearly empty. I politely asked if the chef could wear gloves while preparing my pizza, since I have Celiac’s disease. I fully understand that cross-contact is possible in a pizza restaurant, but given that it was the very start of service with few customers, I didn’t think this would be an unreasonable request.\n\nThe response I received was cold. The man who I have a hunch was the owner,  told me they DON’T use gloves and that he’d “only do it this once.”  His presumed wife chimed in from the background in an equally nasty tone. You would have thought I was asking for free food here.\n\nAsking for gloves shouldn’t be treated as an inconvenience, it’s a basic request for health and safety for someone with a Gluten allergy. But here’s the reality. Owning a restaurant is a privilege, not a right. Success depends on respect for the very customers who keep your doors open. Gluten-free options or not, I will never be returning.\n\nEdit:\nI was presumptuous to assume it was your wife. I was in error. My apologies on that. The interaction was in 2024. Further details are not even necessary. You having a defensive position by assuming the costumer is either lying or is reviewing the wrong establishment tells me all I need to know about your level of accountability and your capacity for constructive criticism."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdVVHUlVRazFOT0VWNVdIVktSMDFzWTBWTU5FRRAB",
            "text": "Super italian pizza in Harlem.....as in Italy."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMFVGZGpValowZURsemJWODNWRmwzVkdSUWMwRRAB",
            "text": "Super Italian pizza place with very big pizzas!!! Went for the carbonara special pizza which did not disappoint at all. Finished it off with a Panna cotta for dessert. Well priced in my opinion too (from memory I think this came to about $50)."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WSVkyOWhhM2Q0T1dvNWNXMTRhbmxYVldFMk9HYxAB",
            "text": "Great pizza"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZNFNrdGxZbGxoYVhkd01XNWhRalZrVUhkV04xRRAB",
            "text": "We had a spectacular experience. I felt like I was in a pizzeria in Rome. The staff was extremely nice and feel free to practice your Italian with the manager. Grazie mille per la pizza."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJZmEwZERyNnJuc2NREAE",
            "text": "Our local spot and I just love it. The ambiance, the pizza, the wine, the dessert . Love going there once in awhile and their tartufata is just AMAZING."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMlZGaGpkSEYzYzB0M2VFWk1aVVpZZDFSQ1NGRRAB",
            "text": "We are very happy regular customers, the pizza is Italian style with nice ingredients. We love the 4 cheeses and the sausage/eggplant combo"
        },
        {
            "date": "수정일: 2달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210UWFHeDNRazVqWDJwR1dtSjJlVWRRUjB4YU5rRRAB",
            "text": "Étant françaises et gastronomes, nous avions du mal à trouver notre bonheur dans les différentes pizzerias new-yorkaises que nous avons pu essayer. Mais celle-ci était incroyable, dépassant même ses rivales françaises ! J'y ai mangé la meilleure pizza de ma vie avec un service très chaleureux et un décor tout simplement splendide :)\nPS: j'ai pris la Diavola"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNNExXdEJNR1owUlhsa2VqTXlWMVl0YkVWTFJsRRAB",
            "text": "Best Pizza in the USA. Street parking is available in the area without much work. We love the Italian pizza, not Italian American pizza, and there are places that do that, but Sottocasa Pizzeria Harlem is by far the best. I order the Diavola , which has the spicy soppressata which has a nice but manageable kick to it. The Margherita is amazing as well. The wait is never bad. I have done the indoor many times and the outdoor on the Avenue once, in great NYC weather, the Avenue is the best choice."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oeGIwUmhTVk5PVjBNM1NXOWtiV0ZzWWpaclVuYxAB",
            "text": "I recommended this great Restaurant. Great flavors and fair costs considering the serving size. The dishes and employee courtesy were remarkable. Great cooking paired with unique menu selections. The menu items seem tasty before trying."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCc1JtSXRhWEpWWW5ZMVVuWk1UR2RDZEZSMVQwRRAB",
            "text": "They've created something that stands out from other options. What additional features could you want? Friends appreciate both the vibe and food quality here. We got our food when expected. Entirely pleasing!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210UlRHSmhMWEZSYmxKd1MzVlFOMkpDZUY5eVQyYxAB",
            "text": "THE best gluten free pie I’ve had in all of NYC! Immaculate toppings, high quality ingredients, and that perfect wood fired crust"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JNU5rdFRaakZUWkUxMVNEVmhhalJyUzJ0ak1HYxAB",
            "text": "This is the best gluten free pizza I’ve had anywhere. I haven’t been to Italy but have had GF pizza all over the US (SF, NYC, Chicago, Vegas) and this beats everything!\n\nAnd even more proof, my husband who isn’t gluten free normally will try a piece of my pizza and when I ask him how it is says “it’s gluten free”. This time he said this might be one of the best pizzas I’ve had anywhere."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5eVFqUjBTblJxVXpWRVgyVTNUVGN0VjNSME9YYxAB",
            "text": "Delicious, fresh, authentic, friendly and not too expensive. This spot in Harlem is a gem. SO much better than any other pizza in this area. This is true Neapolitan style pizza. *chef's kiss*"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twdWNqaEtRVGhsUnpGc1drODROM0Z4VkRKV2EyYxAB",
            "text": "Best pizza in the city! Don’t listen to all the uneducated people leaving 1stars because the pizza was “soggy” - that’s how it is supposed to be!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6bHJIWmpBRRAB",
            "text": "My favorite pizza spot in Harlem. Don't have to wait to get a table and the pizzas are delicious and freshly made."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sWk4wbFJXWEZxTW1oc1ZVUlJORlJrZFhNNGEzYxAB",
            "text": "They are my hands down favorite pizza in New York"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRk4yVjVSVGhHTFZWc09HRlRSa0UxWHpaRlpIYxAB",
            "text": "delicious pizza and incredibly charming service!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twQ1RXWlZWakozY1U5T1RWSmhWblJHYzNaU1dtYxAB",
            "text": "best Italian pizza in NYC 💕"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wT2RIWklabDlSY21WSmRFd3plRmRMUkhaSlRsRRAB",
            "text": "great little family pizza joint!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wbmRXdG9hemxSYUhkUWRucERWRzF1UlhFdFdXYxAB",
            "text": "Ayo! Best pizza in town! The pizza is always on point! The staff is super friendly and helpful! We have a toddler. They always put us with other families with babies in the back so we didn’t have to face those glaring, judgmental eyes from some of you…👀🤣\n\nWe shut the place down for our babie’s first birthday! Such a great spot! I’d highly recommend it! 🙏🏽"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzNFZFc3lla3BDVW0wNWJYQm5XbHBET1dWTE1XYxAB",
            "text": "Hands down, The Best Pizza in Harlem."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUU1USldVVTVoU2pGeWEyWmpNRGRSVlVGVVNtYxAB",
            "text": "Absolutely loved this place! If you’re looking for an authentic Naples-style pizza experience, this is it. The dough is incredibly light, fluffy, and perfectly charred — just how it should be. You can really taste the quality of the ingredients and the care that goes into every pie. We loved it so much, we went two days in a row! The atmosphere is warm and welcoming, and every bite transported us straight to Italy. Highly, highly recommend — this spot is a true gem for pizza lovers. 🍕🇮🇹"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6OHRYOFZ3EAE",
            "text": "Great service and cute atmosphere. The pizza is amazing!!!!! Best pizza in harlem and possibly in the city. Wish they had liquor too though! Only beer and wine. Good wine though!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SUmRteFdhRVJUUnpScVZIUkdOWEpxTmtKV1VXYxAB",
            "text": "Best pizza in NYC! Reminds me of the best pizza from Italy. 100% recommended and will come back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGd1lUWmtNbGRSVjA1d1dEbE9lbmRsZEd3ME9IYxAB",
            "text": "Fantastic spot in East Harlem! The space is super clean, the food quality is great, and the service is excellent. We had it on our list for a while, and we are very happy we finally went. 4 stagioni was absolutely delicious. Definitely will return!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psemNsRk9PRkpxTlcwMU9VWkdaWE5xWjBsVmVHYxAB",
            "text": "Típica cantina \"veramente italiana\" en el corazón de Harlem. Acogedora y un poco ruidosa. Las pizzas, burrata y ensalada, con ingredientes de primera. Amplia carta de cervezas italianas; también vinos. Simplemente delicioso todo. Excelente atención (también hablan español!)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5aFgzUlZiRkV0UjJjMFJsZzRkbVJpUTJOTFVXYxAB",
            "text": "Love this place for chill evenings"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWGRXVmxZMDE0VkhGbVoyMXFSa0pQU21WQldHYxAB",
            "text": "Their gluten free pizza is the best I have ever had!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQdTBvTTNFbWJUWjhnRRAB",
            "text": "The best italian pizza I tried in NYC!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VObVFyb1Nsc3VUUDdBRRAB",
            "text": "Fantastic place to eat pizza."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLSDN6cFc4cHBLVmRREAE",
            "text": "Sottocasa 😍\nOur go-to whenever we're near 125th (thank god we have family right around the corner!) Perfect for any occasion, from a quick lunch to our wedding rehearsal dinner. We've made lots of wonderful memories at Sottocasa, and always feel welcomed by the staff. The visible woodfire oven in the back adds ambiance, but we've never felt like the room was overheated.\nNot a single pie has ever disappointed. This menu has taught me that less is more, in terms of combining toppings. (Though they have plenty of pizzas covered in toppings!) The appetizers and desserts are also great, if you're willing to sacrifice valuable pizza room. Come with a group, so you can try more things!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNLUJsZV9iN0xPX2VBEAE",
            "text": "Loved everything about this neighborhood gem of a restaurant!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMS2c0Y3VhcTRYVllBEAE",
            "text": "Really good pizza place! The pizza was delicious and the waiter was very nice. We had a great time. I recommend it!"
        },
        {
            "date": "5달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPZjR4dG56LWVxUldnEAE",
            "text": "Ci siamo andati perché fa la pizza senza glutine, entrambi i tipi di pizza sono buonissimi, sia per i prodotti utilizzati che per la consistenza e cottura della pizza."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPbmVfOTJaeHJqSlNnEAE",
            "text": "My favorite spot in Harlem, always a delicious meal every time we dine here. The dough is flavorful, sauce isn't sweet, and the service is welcoming. A true staple in the community!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJTDlvTnVYbHU3RE53EAE",
            "text": "The pizza taste so good. You can tell they used quality ingredients and I didn't feel bloated afterwards.  I definitely recommend this restaurant."
        },
        {
            "date": "5달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMZU12TXlqeHNIQlVBEAE",
            "text": "Non vi scoraggiate se una volta raggiunta la pizzeria vedrete che l’ingresso al locale si trova in un sottoscala di un condominio… proprio sotto casa nel senso letterale del termine! Entrate e troverete un ambiente accogliente e il profumo della pizza che cuoce vi farà sentire subito a casa! Impasto buono, ben lievitato e ben cotto, facilmente digeribile! Ingredienti semplici dal sapore italiano. Promosso e consigliato!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLOFlyZy1RRRAB",
            "text": "Better for eat in than take out but nevertheless our go to in the neighborhood, esp because the gluten free crusts are delicious (note that there is some cross contamination so not ideal for celiac).  Many interesting and tasty options. Huge calzones."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcFllOUF3EAE",
            "text": "Terrific woodfired pizza!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNGFfaU9BEAE",
            "text": "Interesting joint serving top pizza. The truffle was best. Red, green and white tones for Italian and Mexican production maybe?"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdXJpUmJREAE",
            "text": "Fantastic spot in East Harlem! The space is super clean, the food quality is a solid 10/10, and the service is excellent. We had it on our list for a while, and we are very happy we finally went"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaTRLX1hREAE",
            "text": "One of the best authentic Italian style pizza in the city."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvZ3RDOV9BRRAB",
            "text": "best gluten free crust in the city"
        },
        {
            "date": "6달 전",
            "language": "nl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcnBPNm53RRAB",
            "text": "Lekker gegeten, leuke bediening."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzM1lyLUdBEAE",
            "text": "Great Italian food. It was my first time trying authentic Italian food and it was better than I thought. The good focuses on the natural flavor of ingredients, so you will taste what you see. In overall, it seems like not much of seasoning was used, which I liked. Not greasy, fresh and light flavor, so even I could finish one pizza by myself. You will not get tired of pizza. The dough was also really good. Chewy but not hard.\nIf you are used to New York pizza style or salty food with lot of seasonings, this pizza could be bland to you, but I actually liked this kinds of style.\nI got Verdure with Soppierssata added. I really enjoyed it and recommend it!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRcjhITHlBRRAB",
            "text": "The best pizza place in New York City.\n\nI recommend any of the pizzas. Don't change any of them. What you'll get is a Neapolitan pizza where the dough is light and chewy. There is enough sauce to get the full tomato and herb taste without overpowering. I suspect they are reducing and rehydrating to create the deeper tomato sweetness. The toppings are all very fresh and the right amount for each pizza. At this point I've had half of their pizzas and a calzone. All were excellent.\n\nAlso make sure you peruse the beer menu. The price is justified; basically you're getting craft Italian beer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqa2JqWGJ3EAE",
            "text": "I’ve lived in Harlem for a few years now and I am so mad I didn’t try this place before. It was SO good. All the pizzas we tried were absolutely delicious and fresh. The service was quick (even when the place was packed) and we were surprised at how fast our pizzas came out. The Capricciosa and Aglio/olio were my favorite. We also shared a salad that was really good. Now that I know about this gem I will come back. The servers were really nice and the prices unbeatable."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmck96bVdnEAE",
            "text": "This is a popular and high-quality spot, but for someone looking for non-dairy/vegan options, it is disappointing. I ordered the marinara pizza, which was listed as vegan and I was thinking that it would have non-dairy cheese and be a proper vegan pizza. But instead, it was just a pizza crust with tomato sauce and no cheese or anything else. To me that seemed like a lazy way to do it, as if it’s not possible to acquire vegan cheese of which there are many choices. Other than that, there is just one other item on the menu, a salad, that doesn’t have dairy or meat. For people who don’t care about this, however, I think this is a great place to get a very tasty and somewhat large individual pizza with a variety of topping options."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5OGJ1QWRBEAE",
            "text": "LOVED this place. The pizza was fantastic (much better than most neopolitan places in the US, though the pizzas are a bit more busy ingredient/topping-wise than your usual neopolitan pizza), had a great salad. I loved that they had a bunch of imported Italian beer, most of which I’d never even heard of before but was really fun to try. The tiramisu was amazing - tasted truly homemade with actual mascorpone, lady fingers, and the right amount of coffee and cocoa powder. And the lemon sorbetto was surprisingly great and came served in an actual lemon!! Will def go back. One of my favorite discoveries in NYC."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJM19EUFhBEAE",
            "text": "Delicious pizza, fantastic service & wonderful ambiance. Such a wonderful spot — our new go-to for delicious pizza and good vibes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYaWJTVnBBRRAB",
            "text": "Good service. Good pizza. Nice sauce and crust..maybe slightly overcooked...But the BIG miss was our pizza came almost at room temperature...even though the place was not too busy.  😕"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuX3R2UmJ3EAE",
            "text": "The pizza here is SO AMAZING. Their chocolate tartufo dessert is the most perfect blend of creamy gelato and chocolate crunch. I’d definitely be returning for more."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQycDd5STB3RRAB",
            "text": "Sottocasa is one of the best pizza places in all of NY. If you’re worried that a trip to Harlem is “too far” you should reconsider. It doesn’t matter what pizza you order, you will enjoy it. Everything is delicious! The staff are friendly, the vibe is lovely, and the food is delicious! They have an extensive craft beer list and the beer bottle come out in a bucket of ice. Overall it’s an incredible place and needs to be highlighted because it’s too good not to share with others! Will be back 100%"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkbGVlYU5nEAE",
            "text": "Amazing little Italian spot. The pizza was super fresh and authentic. It’s a little hard to see unless you’re right in front since it’s almost like a basement entrance. The lights and atmosphere were extremely enjoyable and romantic with a little candle (electric) on each table. They had tables for two and the service was top tier. I swear I just looked towards the server and they knew what I needed. I’d definitely stop by again if I’m feeling the craving for Italian style pizza. It was reasonably priced and a super cute spot for a date or just to relax.\n\nThere were lots of options on the menu as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqMFl5bThBRRAB",
            "text": "From the pizzas to the service 10/10. Pizzas were amazing and the chickpeas salad really good. The spicy oil wasn’t spicy but that’s ok."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbVluRHN3RRAB",
            "text": "The pizzeria down the street is truly a hidden gem! With a solid score of 9 out of 10, this pizzeria offers an exceptional culinary experience. The pizza is exquisite, with a thin and crispy crust topped with fresh, high-quality ingredients. The staff is friendly and welcoming, always ready to recommend the best choices from the menu. The atmosphere is casual yet inviting, perfect for a quick lunch or a relaxing evening with friends. The only slight drawback might be the limited parking, but it's absolutely worth it for the quality of the pizza! If you love authentic pizza and you're in the area, this pizzeria is a must-try."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcmFUTnBRRRAB",
            "text": "What a taste of Italy. The pizza is athletic and the Italian Beer selection is amazing. They serve it correctly. I will definitely be back. Give it a try. They have inside and outside seating."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURod05HcHhRRRAB",
            "text": "We went there for our son birthday. He is the one who picks this place. He loves all the pizzas, tiramisu, chocolate tratufo. Desserts itself are great. Don't forget their cappucino is excellent."
        },
        {
            "date": "2년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaGNDNVZ3EAE",
            "text": "Locale italiano, situato zona Harlem. Ottima la pizza. Insalata gustosa. Qui si beve caffè italiano. Proprietario molto gentile. Consigliato."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtb3J2MzNBRRAB",
            "text": "Excellent food, very diligent and friendly staff.\nThe wood oven baked pizzas are fantastic.\nThe place is cozy,\nVery reasonable prices too"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBOXA2TTBRRRAB",
            "text": "Great pizza spot under a brownstone on 121st and Lenox Ave!  Great selection, great menu!  Excellent staff!  Pizza is on a soft dough; is a little soupy sometimes.  Be sure to order the pizza well-done! Best thing is that they deliver in Harlem as well!  My girlfriend and I love this place!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIeTliSU1REAE",
            "text": "很好吃，披萨的饼皮都很美味，喜欢这种用炉子烤出来的披萨，点了两个味道都很好吃！😋"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZOHNtSndRRRAB",
            "text": "Wow! Gluten-free pizza was great, and service was good! Dessert was awesome too!\n\nThe pizzas on menu are personal size, and can be made gluten-free. Both of the pizzas we got were delicious, they have more sauce than they do cheese and toppings though.\n\nThe Panna Cotta is made on site and was amazing. Highly recommend!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2Ml9hS29BRRAB",
            "text": "Highly, highly recommended the insalata and margarita pizza! Because this place does a beautiful harmony of flavors that you’ve got to experience"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNta2JuTUR3EAE",
            "text": "Amazing pizza location in harlem that serves a variety of very well done pizzas. Great portion sizes, perfectly baked crust, and fresh toppings. Another surprise were the great selection if desserts. Service was very friendly and professional. Would highly recommend"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtMmJDZUJnEAE",
            "text": "One of my favorite pizzerias in the city. They serve Italian-style pizza and they also have a great selection of Italian beers"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKb1BpRDB3RRAB",
            "text": "Was great was here with a reunion of my old friends and the pizza and wine were outstanding. One of the best pizzas in New York and that says something."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwZ0tURkRBEAE",
            "text": "Super cozy\nItalian restaurant.\nIt was good food, many kinds of pizzas. The pizzas were baked in a real pizza oven. The pizza crust was on the thin side.\nDefinitely recommended."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aktTNGpnRRAB",
            "text": "Nice quiet place and there are certain people who may like this style of pizza, but this is not my case. I didn’t like it because the pizza was wet on the bottom- it came on a ceramic plate, it was not crispy, it was gummy and burned. I…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbHVfd2VnEAE",
            "text": "Great authentic, brick oven, Italian pizza. The pizza is delicious, they use natural ingredients. The restaurant is comfortable, not too loud and very clean. The pizza was ready in no time. Best pizza place in Harlem"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxdjQyX0FREAE",
            "text": "Little cute neighborhood pizza spot. The pizza is great, and the vibe is casual. The owner was chilling and chatting with people at the bar as we ate"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2N0lLMFVBEAE",
            "text": "I have been there twice in a matter of 10 days. Excellent pizza. Having gone to Italy several times the pizza is just like that. The owners are Italian and you will hear lots of preggo and allura in their words! The food is incredible, I…"
        }
    ],
    "reviews_count": 78
}