{
    "name": "Ponty Bistro",
    "place_id": "ChIJNYJPTHf2wokRhjM4dcIZnE4",
    "grid": "MN10",
    "address": "2375 Adam Clayton Powell Jr Blvd, New York, NY 10030, USA",
    "rating": 4.4,
    "user_ratings_total": 1174,
    "phone_number": "(212) 234-6474",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSWlVIQkhPV05oYTNvNGMzY3dTRll4VGxGcFpIYxAB",
            "text": "I find myself here for lunch frequently. He talked freely with people at multiple tables. The setting continues to enhance my meals. The experience satisfies completely. Our plans include coming back on our next trip."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxbVdHZHhMVmR5U0hGUFZrOTRaRXhaTVVkSmIxRRAB",
            "text": "Honest review…. The food is decent which is why I’m giving two stars, however they really need some help. We were in with a large party for lunch.\n\nThe service is atrocious, it is so so slow. We waited over 30 minutes just to get drinks and bread. Come to find out the bread was HARD AS A ROCK. The bread was so hard we were tapping it on the plate and it was making a clanking sound and you had to physically squeeze it to crack it open.\n\nThey messed up the food order on three of our dishes and had to correct it. One of our guests had a piece of metal or aluminum about 4 inches long and about an 1/8th of an inch thick, in his chicken dish. (They did take it off the bill)\n\nThe place needs a good deep cleaning as well, the bar is dingy with stains visible on the walls, the windows need a good cleaning with just some windex, the bathrooms are disaster, just no upkeep. Like I said, we had a large party so we had a bunch of little tables made into one large table, every single table was wobbly and not secure, so our drinks kept moving and tipping, it was just an overall unpleasant experience.\n\nLike I stated earlier, the food was decent, but we will not return, it was just disappointment all around."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUE5HbGpkMVZUUzFwaWJHOUNNRzVwUVVSMkxWRRAB",
            "text": "My future includes many visits to this place because they clearly know what they're doing. Food lovers who care about quality and price will appreciate this restaurant. The entire group of employees performs wonderfully. Their menu succeeds throughout and the place matches my daily path. Without a doubt, I'm coming back."
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJbmRqa3dnRRAB",
            "text": "Dirty bar every time. They need to shellack the bar so it doesn’t absorb the food and drink stains. Also when I asked the staff to wipe the bar down, of course, they did it with grand attitude. Get it together!!! #FixIt\n\nUpdate: this restaurant has improved over the years. I like supporting local restaurants. The floors need to be redone because they’re always slippery regardless of the shoes I wear. The food and drinks have greatly improved as well as the service. Upgraded stars ✨"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FdGVWRTNSRlY1V1RKNE5GVXRkbXR1UlU5aGRXYxAB",
            "text": "I visited Pony Bistro in late September 2025 for a work dinner.   Let’s just say I’m glad this was a work dinner and I didn’t spend my money at this restaurant.  We dined from a Prefix menu.  I was concerned the food would be spicy as it’s an African/French restaurant.   For appetizers we were served chicken wings, calamari and some type of puff.   The puff was spicy and the chicken wings were the only thing that was good.  For dinner I order the steak which came with some type of sauce that wasn’t good.  The steak also had an after taste to it I stopped eating it.  For dessert I ordered the chocolate lava cake which wasn’t any better.  It also had a weird after taste to it.   I also tried the crème burlee which also wasn’t good and had that same after taste.   This isn’t a restaurant I would be visiting again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSbVdqQnZhbkZNYTNwR2RsbG5iamRYZFhWMFVsRRAB",
            "text": "Fantastic spot in the heart of Harlem!\nPonty Bistro is an absolute gem — their cocktails are outstanding, with creative Afro-Caribbean influences that make each drink unique and full of flavor. You can really taste the balance of tropical and African elements in every sip.\n\nThe Senegalese chicken is a must-try — perfectly seasoned, tender, and bursting with spices that are bold yet beautifully balanced. It’s one of those dishes that stays in your memory long after the meal.\n\nThe atmosphere is lively yet relaxed, and the location couldn’t be better — right in the center of Harlem, making it a great stop for dinner, drinks, or a casual night out with friends.\n\nHighly recommended for anyone looking to experience amazing African-inspired cuisine and a vibrant Harlem vibe."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxZlQyNWZVbDlXYUUxbWR6bDVjVXMzZUZWM1pXYxAB",
            "text": "Excellent food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWbFdtY3dPVXBzVFRnNFRuaFJSMU4zZEdKcWIxRRAB",
            "text": "excellent service with a smile, staff went above and beyond to make sure our dining experience was top-notch!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214ZlRWQnhaazVKUlhWblRrdEtaVlZNT0MxZmVWRRAB",
            "text": "First time trying West African Cuisine and everything that I ate and saw on everybody else's dish was delicious and looked cooked with dedication to serving amazing customers.\nAlso the place was very welcoming as soon as you step in and the service was great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sNk0wdEdXVkYzZVdaQ1dIRnNRWGREYVhWZlJGRRAB",
            "text": "This is the place to go to  relax after work, with company or just yourself. Actually anytime is a great. A group of nine of us were there to celebrate one of my sister's birthday. Phillip was the gentleman who served us. He was pleasant, joked with us, and has a great demeanor. I ordered mussels with white sauce. I wish I had taken a picture. OH MY GOODNESS!!!!!!!  It was freaking delicious 😋, with a side of bread that was soft and warm. I highly recommend this place"
        },
        {
            "date": "2달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWdFdXUnBlRmRFVG1GdGFXTnFhVFJwYW1kb1MzYxAB",
            "text": "Délicieux !! Des plats savoureux et délicieux. Une vraie réussite pour un magnifique voyage culinaire. Je recommande 👏🏾"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pod1dDMVJZV3M1UVhsS1kwMVVTbVp1U0VsSE0wRRAB",
            "text": "I ordered catering for my birthday party and they DELIVERED - literally and figuratively. Did a rush order for twelve people and everyone ate it up - delicious risotto, well seasoned wings, and delectable fish stew. Grateful to Chef and the whole team for the last minute hustle; I will be back!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRNGNtbDBNRVF4Y1hOdGJFaHNkemhHY0dJNVZGRRAB",
            "text": "Increíble"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210cVpIRk9Wa3RVUkVzeVpWaG5PVXRUVVRSVlUxRRAB",
            "text": "The food was good and flavorful. My only complaint is that I wish the calamari came out fresh. They do live jazz music on Thursday from 7pm till close."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfOEoyU3BnRRAB",
            "text": "Enjoyed a ladies day out at Ponty Bistro for brunch/lunch on a Saturday. It's an African-French-inspired restaurant.  The atmosphere was low-key. Nice restaurant for friends, family, and dates.\nWe ordered the Crab Benedict, Steak with home fries, Maple French Toast, and the lobster burger with fries. The food was tasty and well-seasoned. The Maple French Toast is delicious!!!\nFor drinks the Virgin Moscow Mule, Bissap, and the Darkar Lemonade.\nThe waiters are professional, hard-working and friendly.\nThere is a bar so you can sit and order drinks.\nOverall my experience was good.\nDefinitely will come for dinner. Try the dinner menu\nPaid parking is on the street. Please read the signs. Don't want a ticket."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRU0xWjFVbkZ1YjJOV2FVaHBjV0poWVV0RE1rRRAB",
            "text": "I had the pleasure of dining at Ponty Bistro for the first time as a birthday treat from a dear friend. The atmosphere was warm, elegant, and inviting.\n\nFor my entrée, I ordered Le Poulet Parmesan, which was rich, creamy, and bursting with flavor. I only wish I'd taken photos before we dove in!  Dessert was the perfect way to end the meal. I chose the chocolate fondant, which had a gooey and velvety center served with vanilla ice cream. My friend ordered the profiteroles, filled with vanilla ice cream and drizzled with chocolate. They were fresh, crisp, and just as enjoyable.\n\nThe only thing that felt a little off was the music. During our visit, the restaurant was playing pop music and I wasn't expecting that. In my opinion, it didn’t quite match the vibe or the cultural essence of the menu. A playlist that aligned more closely with the restaurant’s identity would’ve added another layer of richness to the experience.\n\nStill, it was a memorable day with good company, great customer service, great food and desserts. I’d definitely go back!"
        },
        {
            "date": "3달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMVEwNURPR3RUV1dsSVIxTlZRbTlUTld0dFduYxAB",
            "text": "Dopo la messa gospel, siamo arrivati in questo locale leggendo le altre recensioni. Piatti abbondanti e curati. Ne portiamo un po’ a casa per questa sera. Personale estremamente gentile locale pulito."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCbFptNUxibGR1UlZwUFh6Qm5VRW8wY2xOMk9XYxAB",
            "text": "Love this place so much! This was my first time back in a few years, since Covid, and I was so happy to see them still alive and well. I got my usual lobster BLT, mussels and Prosecco & it was perfect"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxcVQwSlpOMHd6WkVKU04xWTNYMHRyVlRGd0xWRRAB",
            "text": "We stopped in for a couple drinks at the bar and some appetizers.   Bartender was intelligent and passionate about his craft, and I learned they have live jazz on Thursday!    Really looking forward to going back for dinner, the menu is fresh and playful with a true blending of African and French cuisine.    Also liked the stylish vibe of the place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wak1HZDFaR1IxTm0xNlMyVllSVFJrVVU1MVlXYxAB",
            "text": "Great food. I had a fantastic Napoleon Benedict and the eggs were perfectly poached.\nWent on a Sunday, so mixed in well with the after church crowd. Plus, the outside seating was perfect for the weather that day. Highly recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VME1qaDNlWEJOTmt0SU1ISm1XbVJzT1ZZMmJHYxAB",
            "text": "I just happened to find the Ponty Bistro in Harlem while looking for a place to eat. I walked in and was greeted by the bartender Sheick, who was very courteous and pleasant.  The ambiance is quite lovely and cozy, and clean.\nI saw a customer eating salmon with vegetables, and it looked so good I quickly changed my salad order to the salmon and veggies.\nIn the meantime, I ordered a cosmo and was very specific as to how I want it.  Sheick made it exactly as I ordered.  Maaan..that was delicious 😋!\nMy salmon and veggies arrived and let me tell you...I have never had an array of vegetables and sooooo delicious.  It was string beans, broccoli, carrots, and Bokchoy, and 2 perfectly sized potatoes.\nThey were in a sauce to die for.\nNow, that salmon, perfectly prepared the way I requested, was past delicious.  I kept telling Sheick how tasty it was, and he was very grateful.\nI will definitely return to dine at Ponty Bistro."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5dFkyZGFka3d5WnpFMVdqaFFUVGRyWmw4MmMzYxAB",
            "text": "I loved my time there.  Our waitress was amazing and knew what we wanted before we asked. The food was excellent and the atmosphere was busy. Right next to us was a group of ladies that work with a mentorship program. They mentor at risk youths. So if I had to choose which was the best it would be that they open their doors for groups like that."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMFRHdGpTQzE0WVZoM05FSkNOR3h5ZVZkVExYYxAB",
            "text": "Great place to come to for happy hour. Great place for food. Bar tenders are amazing!! Highly recommend"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VORDc4SzZqd3ZyRERBEAE",
            "text": "Coolest place in Harlem. Great food, the best drinks, attentive service, it's a vibe."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPMldscVdobm9Hd3lBRRAB",
            "text": "Service is always exceptional 👏🏾 the atmosphere and food are both good."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlN18zOTd3RRAB",
            "text": "The roach  crawling on the wall next to the kitchen definitely made me rethink eating here.  The waiter tried to kill it and the owner said, \"What do you want me to do about it?\" It was disappointing."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvel9fRnZBRRAB",
            "text": "All the appetizers were amazing. The chicken w/pineapple sauce was excellent! The mains were a little underwhelming. Lamb and steak were overcooked."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvczZ1ZXRnRRAB",
            "text": "I learned about Ponty Bistro when it was in Gramercy. Chef Cisse and Chef Cheikh were incredibly welcoming and created the most amazing dishes, providing many wonderful memories for me and my friend Ruth. My buddy Mel and I visited the 139th Street location yesterday and Chef Cisse was there and it was such a thrill to dine on his fantastic food and enjoy his wonderful energy and artfulness. The crispy tuna appetizer is quite famous with fans and does not disappoint-ever. Lovely, super clean, and beautiful restaurant with a warm staff with great vibes. A MUST when in New York or for NYC foodies!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvemJPTV93RRAB",
            "text": "Amazing food, great service! I’m really really surprised in a good way! Best nicoise salad I’ve tried in New York!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMWFlWlpREAE",
            "text": "One of the best food that I had in NYC. Perfect for brunch/dinner  I Love the vibe. I totally recommend. Had the best New Years Eve there too. I went many times, I use to live above the restaurant. for more reviews follow @cosmopolitips"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeWJhMDhnRRAB",
            "text": "Visited with three friends and loved my experience from start to finish.  The restaurant had a jazz trio performing on a Thursday night and the service was top notch.  The tuna, mussels Africana with fries and Ponty salad were so delicious.  Then Chef Cisse brought out a Chilean Sea Bass with Saffron Risotto that was perfection on a plate. I can’t wait for an excuse to go back to this restaurant.  There’s a reason it’s been around since 2008 and it’s because it’s an institution."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdnAzVUhnEAE",
            "text": "Love this place! Cisse is the best!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMFotd19BRRAB",
            "text": "The server added 20% gratuity to each person’s bill. This entitlement was totally unexpected and disruptive to my planned budget."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJX0lhNFhREAE",
            "text": "Y'all, don't EVER, EVER EVER EVER, eat at Ponty Bistro in Harlem. Months ago, some friends from church, and I went there for brunch. One of them ordered french toast, only to find mold and spores all in her food. The manager was embarrassed, and apologetic for this unfortunate situation, and tried to find ways to remedy the situation.  My church choir, and I practically needed a punch card due to our consistent business with them after Sunday Service.\n\nFast Forward to today, (*FOOLISHLY to our chagrin* We gave them a second chance seeing that we've had great business with them in the past (minus that one slip up)) our food was served to us, and everything started out pleasant. Mid-way through our lunch, we noticed roaches on the wall. When we brought it to the manager's attention, he responded with \"What do you want me to do about it? We kill them here all the time?\" We were DISGUSTED!!! Therefore, we will no longer be contributing our business to them, and we are spreading the word so the general public knows about their unsanitary practices."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dE5uN2ZnEAE",
            "text": "They have awesome cocktails, fish, mussels & wings - it's my go 2 place"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3b01tZFRBEAE",
            "text": "I had the intentions of supporting a local African business as I enjoy giving back to my community. Unfortunately this was the most terrible service I have ever received in the city. I was served the wrong drink which is a small mistake and did not initially bother me. However it took an hour for food to come out for 3 people. I ordered the lobster ravioli and the ravioli itself was flavorful, but the sauce tasted like metal from a can and enough salt to pucker my lips, I believe I would have been better getting chef boyardee from the corner store. My auntie ordered a burger with ketchup, to which they gave her a side that they said was ketchup but it was actually hot sauce. My mother’s chicken was raw with blood coming out of it and the waiter stood there like a dunce asking what was wrong with it. The waiter said the fastest replacement food would be a burger, and that it would take 6 minutes which actually took 30. The only thing he knew how to bring fast was the check. The burger which she asked for no hot sauce, did in fact have hot sauce on it. Nothing was comped. The only refund I got was for the poorly presented burger because I gave it back. Not only a disappointment but an embarrassment."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRZzQtZHl3RRAB",
            "text": "I am a frequent customer of PONTY BISTRO today; I ordered salad nicoise for delivery.I was disappointed because it was more lettuce than any of the delicious tuna and vegetables. While I will return, please do better with this salad; it's beautiful when done correctly."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNneXB2V2NnEAE",
            "text": "We had the grilled shrimp bailaise (sp?) and it one of the best things we've had during our visit to NYC"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcVlmOU53EAE",
            "text": "Had a great Roast Chicken here. actually one of the better roast chickens I have had…in life..It was perfectly cooked nice crispy skin fantastic wine reduction over creamy mashed potatoes.  My companions had the curry shrimp which they loved and it all looked beautiful. This is a great place to bring family and friends  with a cozy atmosphere. It seems the bar has a nice lively crowd a lot of the time too.\nI have had many good meals here and always a good place to bring guests something for everyone."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBOG9URHlBRRAB",
            "text": "Ponty Bistro in Harlem offers an unforgettable dining experience that beautifully fuses French and West African cuisine. From the rich and buttery Escargot Snails to the airy Three Cheeses Gougère and the flavorful Moules Africana, the appetizers set the stage for an exceptional meal. The Poisson Yassa, a traditional Senegalese whole branzino, and the Grilled Shrimp Basquaise with coconut rice and lemongrass curry sauce were both outstanding, showcasing bold flavors and expert preparation. The Chocolate Fondant was a perfect, indulgent finale. With its warm ambiance and expertly crafted dishes, Ponty Bistro is a true Harlem gem that I highly recommend for a unique and memorable dining experience."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfeTd1QkNnEAE",
            "text": "It’s a Harlem staple. Go to spot. Always good. Service is quick. Food tasty."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNkp1OTBBRRAB",
            "text": "Ponty Bistro is an absolute gem! The flavors are incredible, and every dish is made with care. The staff is so welcoming, and the ambiance is perfect for a great dining experience. Highly recommend trying their lamb chops simply amazing!”"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cjdxUFVnEAE",
            "text": "Harlem! Luv it!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoc3ZMU2RBEAE",
            "text": "Food and service...consistently good."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQczdld2pRRRAB",
            "text": "This is one of the winners when it comes to neighborhood gems!\n\nCisse make you feel welcome and the food is consistently wonderful."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQN3EzbVBBEAE",
            "text": "Apps\nThe calamari is sublime\nThe escargol lacked flavor\nThe oysters had a nice sauce on the side though it was too sweet for my taste.\nI didn't like the macaroni and cheese I thought it was too creamy and not cheesy enough.\nMain\nThe lobster and shrimp was good But at the price point I think they should give you more than a half of lobster and three shrimp\nThe shrimp were cooked to perfection but the lobster was overcooked\nThe muscles were divine I loved the sauce they were in but it should come with pasta instead of french fries.\nI didn't like the chocolate mousse It wasn't airy enough it was too heavy."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNEl1LXpRRRAB",
            "text": "Great service at the bar from Shek! Nice happy hour and good vibe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMFB1SXhnRRAB",
            "text": "Terrible food. Price unjustifiable for the quality. Place doesn’t look clean. They are nice, but open a bar not a restaurant!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYd3ZuelpBEAE",
            "text": "NEVER disappoints!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuaV9pRTN3RRAB",
            "text": "Mr. Bass at the bar did a\nGeat job with all the people there.\nI had eaten lunch there had the crabcake it was so fabulous, on my way home  sign \"Happy Hour\" and I had the catfish fingers.\nI was Very happy!\nTreat yourself and go!\nIt was Great! Thank you!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdmNYVVNBEAE",
            "text": "I recently dined at a West African restaurant in Harlem. Tried for the Senegalese chicken, I was a bit disappointed as the meat turned out to be rather dry, accompanied by rice that shared the same fate. The calamari offered a slight redemption, being acceptable in taste. However, the standout feature of the experience was the friendly demeanor of the staff, who made the visit more enjoyable despite the culinary letdown.\n\nOverall, while the ambiance and service were pleasant, the food failed to impress, leaving much to be desired in terms of flavor and texture."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNveHVHTDFBRRAB",
            "text": "My family and I absolutely love this place, it is hands down one of the best restaurants in the neighborhood! The food quality and presentation is truly top-notch. Beautiful classy atmosphere. The background music always creates a nice…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNk51czFBRRAB",
            "text": "This cozy little spot was recommended by another friend that had eaten here sometime ago and was hoping that the food had remained the same if not better. Well indeed everything was a blast & we enjoyed every plate starting with the calamari to the lamb shank. My hubby & I hope to return."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1M3F2b1hREAE",
            "text": "This places is a five star restaurant all around and should be on everyone's list.  They are serving Senegalese dishes that are African and French fusion. The yassa poisson is a delicious fish that is grilled and also oven baked.  It is perfectly cooked and seasoned.  It comes with rice and a delicious fresh salad.  I also tried Moules Africana, I honestly don't want to eat mussels any other way.  The African spices give it so much flavor.  The service is great and the ambiance is perfect for a celebration of any occasion or a perfect date.  Only in Harlem will you find amazing food like this. If you want to see more check out @the_avid_glutton_foodie on Instagram."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVczZEUTdBRRAB",
            "text": "This was my second time eating here and as always the food is absolutely delicious. My go to is the grilled salmon (not pictured) but my friend had the French toast and she loved it so much she took some home and ate it that night. This is a Harlem gem. Well run establishment with great employees good drinks and service.\n\nCan’t wait to go back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2NFlyWlB3EAE",
            "text": "Came here for a late night meal and was very pleasantly surprised.\nI tend to not visit restaurants too late because I know the kitchen has had a long day and the quality of food is sometimes not the best.\nBut in this case I was wrong.\nBoth entrees were fish and they were very  fresh and not dried out!\nWas very satisfied with meal and drinks."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMU5TR3ZBRRAB",
            "text": "We came here for lunch on Tuesday early afternoon and stayed for 2 hrs. My friens and I enjoyed the atmosphere and food. The waitress was able to customize a drink order that was really good and the food was great and prepared well"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNheHEzSTlnRRAB",
            "text": "Visita Dic 19 - Quede impactada con Ponty Bistro, todos los platos estuvieron increíbles!. En los platos fuertes hay para escoger entre platos  marinos,  con steak, pollo, etc, así que no tendrás problema de escoger algo si es que no conoces el lugar. Yo recomiendo los platos marinos, estuvieron excelentes. El servicio fue muy bueno todos muy atentos aun cuando esta lleno el lugar y nuestro grupo era de 6, trajeron todo en el tiempo just.\n\nFui en invierno y la música, la decoración como las velas hacían muy cálido el lugar. Lo recomiendo."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWNjZMMURnEAE",
            "text": "Un des meilleurs restaurants de Harlem.\nLes serveurs sont si gentils et accueillants ! On se sent tout de suite à l'aise et comme à la maison.\nLa nourriture est généreuse et gourmande, tout en était raffinée ! Mention spéciale à la salade de kale, le pain perdu et les œufs."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3enBXaFh3EAE",
            "text": "5+ Stars for the superbly attentive, fast and friendly service. My group rolled in at staggered times for early dinner on a rainy weekend with 3 adults and 4 little kids. Rather than being annoyed, staff treated us like their own family, warmly accommodating every request, quick to keep the drinks topped, cracking jokes to keep everyone's vibe light.\n\nEach bite I tried was intricate and memorable. This menu is showing off deftly layered bold flavors and doesn't disappoint. We tried the Three Cheese Gougeres, Poulet Yassa (massive slab of chicken), L' Onglet a L'Echalote (juicy steak), and Niokolokoba (spicy steak). Our kids enjoyed their virgin mule mocktails, and I'll vouch for the Moroccan Old Fashioned 👌🏽\n\nLooking forward to trying more of Ponty's menu!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXMElyb1RBEAE",
            "text": "I love this place. The food is always good and the ambience is really nice. They play afrobeats that will have you moving in your seat and it’s low enough so you can hear others speak. The waiters are very nice and they clean your table pretty fast. However there was a waiter that kept coming to take our plates… I did want him to chillax so my homegirl and I can feel more comfortable. The calamari with the white sauce is ON POINT. My main dish was very flavorful and so was my friend. The ginger and sorrel juice was very FRESH and tasteful. Overall this place is a must try."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUNHBfYm9BRRAB",
            "text": "I am a return customer at Ponty because I love their food and drinks. However the last time I went, the female waitress delivered terrible service. Aside from taking my initial order and bringing me my check, she never checked on me or looked my way. I had to flag her down to get a refill on my water, order more drinks, order dessert, get a to-go box, etc. Every single time. She walked past my table repeatedly and I'm waving her down, saying \"Excuse me, Ms\" to no avail. In order to get service for the items mentioned above, I had to ask the buss boy or another server. It's no excuse for this type of service. They were not busy at all. She was careless and uninterested in working as she stood looking the opposite direction out the window the whole time. But overall, I do love the food and the ambiance."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCOGNEbjBBRRAB",
            "text": "The place is cozy, intimate, and clean. The food is delicious and affordable. To me, it's a discovered treasure out in Harlem. The service was great!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1eDRESnBRRRAB",
            "text": "This was my first time at Ponty Bistro after my boyfriend recommended this place. However, I was not impressed. My boyfriend ordered a martini and it was very sugary so he sent it back. (Still was charged for it after taking 1 sip from it.) He ordered escargot and I ordered shrimp with rice. The shrimp was burnt and rubbery and the escargot was an oily mess. We barely ate any of our food. Only giving 2 stars because the server was friendly but she didn't come over frequently to ask about the food."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3aWJEQ2t3RRAB",
            "text": "Absolutely floored. This wonderful Senegalese eatery serves up excellent entrées, desserts, and a friendly waitstaff. There was even live music the night we went (a low-key jazz duo). Would highly recommend for date night or with a group of friends."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDb3BMOXZRRRAB",
            "text": "Amazing food and drinks. The staff was very friendly and followed CDC protocols. The 5 seafood risotto was delicious and the lamb burger was super juicy."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyMF96dlVnEAE",
            "text": "My friend and I really liked the ambience in this place. I got the skirt steak with mash potatoes and red wine and my friend got the stuffed flounder which was very interesting. Oh we also had the mac and cheese for an appetizer and that was crazy good 😍 the service was also attentive and kind. I will say the prices are up there, with main dishes over $26 and cocktails/drinks that aren't beer around $15+."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3NjhiaDZBRRAB",
            "text": "Ponty Bistro is underrated, but also a local favorite for many in Harlem. The food is consistently good and fresh.\n\nSome of my favorite recommendations:\nThe Seafood Risotto\nThe African Mussels\nLobster BLT\nPonty Lamb Burger\nThe Fish or Chicken Dish\n\nBest for dine-in or takeout. The food is always hot and ready to eat."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNM2VfVHhRRRAB",
            "text": "Excellent West African food. The half chicken and the whole fish are excellent. All the seafood here seems great. Highly recommended. As good as the African restaurants on 116th Street but with far better ambiance. Expensive, but worth it. Service is good."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLOVpPTXJRRRAB",
            "text": "Ponty Bistro is Dope! It has a cool vibe! There's seating outside! We chose inside seating! The waiter was personable and  attentive! The waitress who came after was friendly. Hot tasty food that arrived quick!  People meeting up to converse, party,, chill and eat!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURncWR2TXhnRRAB",
            "text": "Amazing octopus salad (which wasn't on the menu but a special for the night and highly recommended by our fabulous server!). Great 5 seafood risotto and tarte tatin. Good service and had a DJ playing good music on a Friday night. Such a gem in the neighborhood! Will definitely come back."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNeHUzbERREAE",
            "text": "The food was amazing. I had the mussels with African spices as an appetizer and shared the lamb and  Senegalese fish. The service was great. The owner came and greeted us. I will be back for Saturday brunch!"
        }
    ],
    "reviews_count": 72
}