{
    "name": "Yatenga",
    "place_id": "ChIJLS3UZHH2wokRAGlJECm9GeY",
    "grid": "MN10",
    "address": "3023, 2269 Adam Clayton Powell Jr Blvd #1, New York, NY 10030, USA",
    "rating": 4.4,
    "user_ratings_total": 426,
    "phone_number": "(212) 690-0699",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KdmNHcHVUWEV5ZEZJM0xXVXlSbGxxVEY5eWVXYxAB",
            "text": "A wonderful neighborhood bar that’s way too expensive for no reason. The bar tender is great, friendly, attentive, plays great music and he alone makes you want to come back!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oVlZGbHVWMFowYjFoUE1YVXdVbFowVW1Sd2RFRRAB",
            "text": "TOM should be fired!!!! Terrible service, I was ignored all night- for no reason! He is a poor excuse for a bartender! I left in tears because of his overt mis treatment!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tORWRVcDVhMnBsZUZWQllXMU1UM2N0Ym5wbWRVRRAB",
            "text": "I was invited by a longtime friend in this cool restaurant in Harlem. The young server and the manager were awesome.\nI loved the way the restaurant was decorated.\nBeautiful art all over the place. Rustic table.\nIt’s just a nice place to relax and enjoy life.\nLet’s not forget the great food and the wine selection."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkNFIxaHlZVmx1ZUhCVExVOWZjMWs0WVhkNFduYxAB",
            "text": "i dream about their steak au poivre that i last had 3 years ago, and today i just had their steak sandwich for takeout (my family member was caring enough to pick it out). i reheated it on the cast iron, and oh my god, the creativity, the execution, and the flavors and how perfectly extracted they are, something to be proud of. what an amazing restaurant, one of my favorites for food in the city."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwc1IwdENOSFpNWWt4V1luRk9iMDkwYVZrMlUyYxAB",
            "text": "I can't say enough good about the food here. Everything I've had is excellent. The steak is worth a trip alone, and far outclasses places that charge a lot more downtown. Highly recommended!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WUmQyRjJabkJKTm5kdU5YQjRUbHBoU2xaUFNGRRAB",
            "text": "The food is great!  Dont' let the casual vibe dissuade you.  But, I found the service to be exceedingly slow. For example, my soda didn't come out, until the food --which was a really long time. I ended up bussing my own table and got my own check."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOSzZ0b3pJbW9uRFRBEAE",
            "text": "By sheer serendipity, we arrived just as they were opening at noon on Saturday. I say serendipity, because Google is quite convinced they have been open since midnight, which is very untrue, despite efforts on the lart of the hostess to get it changed (I tried too, hopefully it takes and no one else gets disappointed because they're closed). The place was bafflingly empty for most of our meal, peaceful and quiet, if a bit on the warm side. Honestly, overhead fans are about the only thing that could have improved the experience.\n\nThe whole place is a distinct vibe, even the bathroom felt like a very particular time and place (tidy, big enough I didn't feel claustrophobic, had a place to set my purse). The hostess/waitress was delightfully friendly, bustling around opening windows and setting things up, and she had spot-on recommendations for what to order (and what not to- a few of the drinks on the menu, they're missing ingredients right now because of supply chain issues).\n\nAnd the food... Well, when the New Orleans native tells you the grits are some of the best he's ever had, you listen (and steal a bite, because Damn). The croque madame and home fries got inhaled no less quickly, and my steak sandwich with its fried peppers and onions was to die for. I took a little longer to finish, but only because my salad (dressed to perfection, with bright fresh greens and a bit of shredded cabbage) was massive.\n\nWe are Absolutely coming back, even if we do live several states away."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRejRmN3RBRRAB",
            "text": "My gawd the shrimp gambas"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfaGM2WHhnRRAB",
            "text": "It was a group of eight friends hungry after an art exhibit. It was my first time at this restaurant, and I was amazed at its delicious food. We had macaroni cheese, fries, calamari, gambas, chips and guacamole, Caesar salad, hamburger, and fries. You must try this restaurant. Most importantly, the waitress was so efficient, it was her alone, and she worked the floor, and did not make anyone wait too long. I wish I had her energy. We will be visiting here again for sure!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfeE0zOE1REAE",
            "text": "Best tuna nicoise salad"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQMHEyQXd3RRAB",
            "text": "I haven't had their food yet but have stopped in for happy hour and enjoyed the experience. Nice bartenders and pleasant environment.\nUpdate: French onion soup hit the spot on a snowy day. 😋"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQOVlEMGFREAE",
            "text": "I have been a guest since they opened years ago and I have never had a bad time here...ever. When you enter the restaurant you instantly feel like you're at home entertaining friends. The staff have all been there for years working together; so, you are dining, drinking and hanging out with family! This place is so cozy that it's hard to leave after dinner and drinks! So happy I found this hidden gem in Harlem!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYOGIteXFRRRAB",
            "text": "Delicious neighborhood eatery with a definite locals vibe. Food was well priced for what you received, we had a whole branzino special and then regular menu mussels. All delicious. Service was slow but there was only one server for whole restaurant while we were there, which is probably the reason."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudXRqSUlREAE",
            "text": "Some of the best upscale food in central Harlem. Try the lamb, the seafood paella or the excellent shepherd's pie. Seating indoors and outdoors, full bar. Great place for a date or anytime."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaEtuQ0R3EAE",
            "text": "The food was great, they had a dj playing in the background and the staff were friendly"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibG9Tam53RRAB",
            "text": "Food and service was horrible today.  I went with a friend to dinner and was excited because they had a dj and the music was  great.  Had a table paella was terrible and alla vodka wasn’t far behind it.  We had to get our own drinks.  Pretty much had to beg to order food.  Had to pick up our own drinks.  Two of the staff only spoke French whelp!!!!!  I don’t know when I’ll return or if I’ll return.  Been here several times and never had this experience before"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiOXFIVmRnEAE",
            "text": "Nice service, great meal"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6dHAzenhBRRAB",
            "text": "I've only ordered 1 thing consistently from here, The Chef Special- Gambas.1st first time I had it was pre-covid. I don't live in NYC anymore, but I frequent the restaurants when Im there for work (often in summer months).\nIt's a QUALITY meal!\nFriendly and courteous staff also! 💜"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkdGFhYjN3RRAB",
            "text": "We went on a Friday around 6, only a few customers in the place. Greeted by a friendly waiter who asked us to sit where we chose. Had the Yatenga salad for starters which the dressing was a bit bitter but the otherwise the salad was very fresh. Entrees were the chef special gambas and the mussels. Both plates were well presented, good portions, and very delicious. We ordered the apple tart for dessert which was ok.\nWe will definitely be returning to try some of the other entrees."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNeWVDRUV3EAE",
            "text": "Family feel service. The food is outstanding delicious. Very calm atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNXVEUGpnRRAB",
            "text": "Best brunch in Harlem! The quiche and a bloody Mary are the best way to spend your 20s. Savor it. Nothing lasts forever."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGMHJhTzlBRRAB",
            "text": "Went here for the first time on a Tuesday night and everything was fantastic. Two dishes I'll mention: An abundance of perfectly cooked shrimp on a bed of parmesan-crusted baked macaroni and cheese (and mushrooms) and a very large salad Nicoise topped with a tremendous amount of rare tuna. Happy hour until 8 pm brought $5 glasses of quite good wine, with serious pours, and NYC craft beers. And the service was top notch. I can't recommend this restaurant enough."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaMWRXMlJnEAE",
            "text": "I have been eating at Yatenga since 2011. I so appreciate its presence in Harlem.  I declare that it’s my “go to” place to dine in NYC & Harlem in particular!\n\nFor many years I’d have my “after-theater” repast on Restaurant Row. But no longer. I head straight uptown to Harlem and Yatenga. When friends & relatives are visiting and ask for restaurant suggestions it’s always Yatenga\n\nThe staff is efficient, professional, attentive & personable. Ousman the proprietor has done a marvelous job and is the quintessential restaurateur!\nAnd I must confess that I have a keen admiration for Tom the Barman. The staff here seems to know me and my preferences and I like that!\n\nI once met Ousman on the bus and declared:  I ONLY EAT YOUR FOOD IN HARLEM!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaak91SkNREAE",
            "text": "The steak was great! Service from father and son were awesome too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNadV9pU29nRRAB",
            "text": "Staying around the corner from here, scrolled through 25 restaurants and decided on Yatenga. Well glad I did, good vibes, awesome food, family of 4 and would come back every week if we didn't live in Australia. Thanks guys, loved it!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaOEtMQ2hRRRAB",
            "text": "A great Friday night late dinner. This was a delicious treat - the steak au poivre was excellent, and I was blown away by portion sizes. This is a great, home-cooked spot with friendly staff. Welcoming, unique, with a huge variety."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcjZYRHhRRRAB",
            "text": "If you want some really good food, this is the place. The wait staff and everyone is great, friendly and helpful. This could be my favorite restaurant in Manhattan."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdjlldnVnRRAB",
            "text": "I really didn't  like the food. The drinks were on point & the service  was  great .the staff very friendly  ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeTY3SUh3EAE",
            "text": "Lamb was off the charts 🙌"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKd3JlUk93EAE",
            "text": "We came here on a Friday evening. Initially, there were 4 of us but we were expecting some additional family members to join us. The waiter was nice enough to allow us to sit at a larger table that would accommodate our total party. He was very nice and personable. He gave us some good menu suggestions and checked on us often. The food and drinks were spot on. Everything was great except for people walking past asking for money, asking to taste our food etc. Unfortunately, the restaurant can't manage people walking past but it makes for an uncomfortable dining experience. Next time we go, we'll avoid the outdoor seating closer to the street or just dine indoors."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSeHBxdEdREAE",
            "text": "The food is fantastic and the drinks are great and inventive. The setting is so laid back and relaxed and the service is lovely. This is a favorite spot uptown."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSczVHNndnRRAB",
            "text": "One of my favorite places to get Mac n cheese! The chefs gambas is so good too. They also have a nice happy hour with margaritas."
        },
        {
            "date": "2년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNHA2YnNRRRAB",
            "text": "Toller Laden mit sehr gutem Essen. Ich hatte ein Steak mit Pfeffersosse. Sehr lecker und gut gebraten.\nAuch sehr aufmerksame und nette Bedienung."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcWVTakNBEAE",
            "text": "Great food Lively atmosphere"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCcXRDbTdBRRAB",
            "text": "One of the best restaurants in Harlem."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCd3BLTmZ3EAE",
            "text": "This place always has a great vibe, good service, friendly patrons, drinks & food is stellar. Tom is your mixologist and host extraordinaire!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtOU0tS3ZnRRAB",
            "text": "Highly recommend checkout this establishment OUT! Such an cozy atmosphere to be in. Great bartender as well."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcVozaVN3EAE",
            "text": "I love this restaurant!!!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlaHZ1SER3EAE",
            "text": "A very nice atmosphere, great food and well-made drinks (I had the frozen pina colada and the frozen margarita...both were so good but the margarita was my favorite if I had to pick one to order all night...$6 each for happy hour). Our server was wonderful and always came back to us with a smile. She even gave us suggestions when we were torn between which dish to order. My friend decided on one of the specials of the day. Crab cakes with spinach, wild rice and quinoa. She really enjoyed the crab cakes and told me to try some. They were delicious. She said she didn't really care for the spinach, wild rice and quinoa mix. She said the dish could've been seasoned better. She said she would get the crab cakes again but with a different side dish. I ordered the homemade nachos. It was a large, super filling portion and really good (although I would have rather it come with black beans instead of pinto beans). The nachos were fully loaded with grilled chicken, pinto beans, guacamole, sour cream, pico de gallo, cheddar and monterey jack cheese.\n\nSo many options to choose from here and we plan to return to try them. It’s also worth mentioning that they have a daily Happy Hour until 8pm, a rarity these days considering most happy hours end at 6 or 7 pm."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlNklyNk5nEAE",
            "text": "Love this place"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dE5fVnZBRRAB",
            "text": "The food and the service was good, albeit the wait time was pretty long despite the restaurant not being busy. However, they served us an expired Diet Coke (they said they didn’t have any, so I said it was okay I didn’t need it, but it was brought out anyway)\n\nI informed them that it was expired but they still charged us $3 🤦🏻‍♀️"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1aHFlNDVnRRAB",
            "text": "Maybe this will get me free drink?"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQydTd5Ykt3EAE",
            "text": "Delicious food, nice ambience."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyd0pfZy13RRAB",
            "text": "A nice local neighborhood restaurant."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyOGQyelpBEAE",
            "text": "The food here is so good. Some of the best flavors I have had in a while. I have no complaints and only wish I could have had the whole menu. I will be sure to show them some more love in the future and you should too."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXcjdPTHFBRRAB",
            "text": "First time here, with frequent friends of this restaurant and let me tell you…FOOD-GASM!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXdlBHSW5BRRAB",
            "text": "Great spot for happy hour not rowdy great food and music."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtcUx6Q0N3EAE",
            "text": "The best restaurant in Harlem! Authentic French country and rustic food made by a star chef, served by genuinely welcoming and nice wait staff. Simple and rustic decor complements the unpretentious food and makes for a leisurely and…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHby1MN2hnRRAB",
            "text": "Beautiful food. Beautiful restaurant and great vibes/music."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHM3Rmc0h3EAE",
            "text": "Website said it was open ,it wasn't, i rode from brooklyn on a train."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0LUxxRGtBRRAB",
            "text": "I had the lamb with couscous. The food was perfect. The meat just melted in my mouth. It was cooked to perfection. Karim took good care of us. Being attentive and patient with us. Excellent and wonderful experience at Yatenga"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3bElETHJnRRAB",
            "text": "Great food and a very nice atmosphere!! The staff is really lovely and kind. We had the Goat Cheese salad and the Quiche of the day with spinach. Prices are fine too!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVMHZTeEZ3EAE",
            "text": "Ok, it’s been two, approaching three years since I came here, not because of the food, but because I live several hours away. If I lived any closer, you bet I’d come far more often. Though you may be quick to write off a review of a restaurant that the reviewer hasn’t been to in years, and honestly perhaps rightfully so, I can tell you right now that after nearly three years I still remember the sandwich pictured as being the best I’ve ever had, or at very least, top 3, not that I have a written list. Steak, peppers, egg, and a spicy sauce all between incredible bread. Hot damn did I love that sandwich, and to this day do I love its memory. Give it a shot if you’re in the area.\n\nPS the interior is very nice."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZc2RUdGlRRRAB",
            "text": "Very nice place with North-African food. The Shakshuka is amazing, very tasty and a bit spicy, which is great. Also very nice ambiance with R&B music."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnamUyYi1RRRAB",
            "text": "The place to be Chef Sanchez and Tom the bartender amazing combo know how to pair and  great fun nice croud"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvcC1mUHBBRRAB",
            "text": "Went there for brunch, it was very nice. My eggs benedict were perfect ($14) and the place has a nice and relaxed atmosphere. l'll definitely go again for brunch.:)"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJNWMyNDN3RRAB",
            "text": "Definitely not worth the money. The options were limited and the food did not look appetizing. The whole group ended up ordering the same thing. The lettuce was brown, the bacon was either over done or under done. I was so disappointed."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhMS1ueTl3RRAB",
            "text": "Me and my fiancé loves this place went there twice already\nWill definitely be back again\nSoo delicious 🤤…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdG9lZWVBEAE",
            "text": "The mussels were excellent, service was good. I would go back when I'm in town."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNdWZLN2h3RRAB",
            "text": "Lots to say, but not much time. The place has a very laid back vibe. Lots of young people hanging out or working (coffee shopish). Rustic decor, very charming.\nGreat happy hour 4-8. Can't beat $3 beer and wine.\nSome of the food prices may seem high at first glance, but all of the food was outstanding. We had mussels, salmon, sauteed mushrooms. 10/10 would recommend."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLd09LTU53EAE",
            "text": "Amazing food and service!!!!!! The bartender Tom, Abdul and the rest of the staff care of us! We will be back"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3OWRqVW5RRRAB",
            "text": "The food was good and the portions large.  It's a small space decorated with very eccentric art.  I went on a Sunday and was quickly seated.  My meal looked delicious and it was (Salmon Madame Croque). I can't give them a 5 star because the…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRaW95dzFBRRAB",
            "text": "Great staff and happy hour prices! But the food is expensive if you ask me....I mean a burger is almost $20!!"
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRNGJISXVRRRAB",
            "text": "Food is great. I ordered the duck for dinner. The drinks are great too... I think it's $4 or $5 for house wines, house liqor and frozen or margaritas. The service though is very slow and sometimes they forget orders. A lot of follow up is needed. This level of service happened both times I was there."
        },
        {
            "date": "13년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURReTlPZjZRRRAB",
            "text": "Yatenga is a great neighborhood French restaurant. Friendly service and happy hour until 8pm. They usually have rotating specials Mon.-Thurs. where you can get a top quality skirt or hanger with fries and salad with choice of wine/beer for…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrelkzVzd3RRAB",
            "text": "I ordered scallops over purple potatoes. The portions were generous and the scallops were PERFECTLY done! My friend had the lamb shank and agreed that the temperature was perfectly done while maintaining tenderness.\n\nThis is an excellent \"hole in the wall,\" affordable French Harlem eatery!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRLWNha2t3RRAB",
            "text": "Took my girlfriend here for Valentines Day! Amazing time , chilled atmosphere, super strong drinks just how I like them!! Food was perfect , great flavor , wanted more to eat! Definitely a night spot to chill during the summer...."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnbHZPOEZREAE",
            "text": "Love the decorations and the vibe. Next to one of my favorite venues in Harlem (the shrine). Food is great. I believe it's a French creole cuisine. Been here a bunch of times. The brunch is great. I would recommend the mac and cheese."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRNjRidXZnRRAB",
            "text": "First thing I noticed about this place was its environment. It definitely takes you to New Orleans, Louisiana. The French culture mixing with the native. As the store is not that big it is quite busy and the music is not obnoxiously loud but the best part is its environment, its like a party all the time. With the subtle lighting the whole environment kinda kicks in together. It took them a while to get my drink but the service was pretty good. The menu was not crazy and overwhelming but it was divided in three easy simple sections. I ordered a chocolate souffle and as any other souffle there was a little wait time in between enough time for me to finsh my first drink and soak in the environment. First experience on the souffle was not that good. It was missing the classic cracking noise that you would expect from any other souffle but it was really good. So as far as i can tell for a really decent price this place offers a real good verity of french cuisine in middle of harlem."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDbWNYNU53EAE",
            "text": "a fun spot to chill  and socially distance with others to enjoy conversations and spirits not to mention some good food.  my favorite is shrimp mashed potatoes with spinach.  cocktails not bad either.  and you can get no better friendly and…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbGVqdkVBEAE",
            "text": "My favorite lil chill spot for cocktails after work. They have the best frozen margaritas in and around Harlem (pretty cheap, too). Try the Mac&Cheese with ham cutlets, you will not be disappointed. I also happen to like their french fries."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBX3NLbmxnRRAB",
            "text": "Very nice spot, beautiful decoration and friendly and accommodating staff. The prices are very reasonable as well.\nThe mussels/fries I ordered were good but I did not like some of the dishes my…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3cjZENjZRRRAB",
            "text": "It's always nice to come here (or their neighbor and sister-property, Shrine) to hang out with a friend, enjoy a drink and snack in a laid back environment with good music-- here it's recorded (next door, Shrine has great live music; and a more energetic vibe).  The decor is eclectic and fun to look over and take in.\n\nFood is good, happy hour is generous, service is laid-back and many are from W Africa, which adds an extra air of authenticity, or even a vacation-air."
        },
        {
            "date": "11년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNndy1qRzJ3RRAB",
            "text": "Excellent food, nice atmosphere and good prices. I had an amazing ratatouille quiche,, and the mixed greens salad is awesome. Good beer selection and great coffee. The apple tart was only so so, though."
        }
    ],
    "reviews_count": 74
}