{
    "name": "Enoteca Harlem",
    "place_id": "ChIJAQC8ixP2wokRA33P9pyei_U",
    "grid": "MN10",
    "address": "2220 Frederick Douglass Blvd, New York, NY 10026, USA",
    "rating": 4.7,
    "user_ratings_total": 192,
    "phone_number": "(332) 265-8442",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNmRTMWZVMnN5T0RobWVtUklXWE5PV0RVNGVXYxAB",
            "text": "Party of 2 went for a quick bite around 5pm on a Sunday in October. We were in a bit of a rush so just had the mixtas croquetas. The plate came with 8 pieces, 2 of each kind, so perfect for sharing among 2 people. The place is definitely a bit on the expensive side. The ambience is nice, a bit cool and dim lit on the inside, and the staff was very friendly."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMGREUTVhME5DU0hoVVJtOTZWM1ZuT1hwaFYyYxAB",
            "text": "I’ve been to this establishment before in person and it was decent, but made a takeout order and it was horrible. The Regular Paella was horrible; the rice was hard and stale and instead of Paella, it was a bowl of stale & hard yellow rice with 6 pieces of seafood  ( 2-dried pieces of clams, 2-hard shrimp and 2-dried mussels resting on top of the stale rice. 1 dish was missjng. The fried mushrooms we ok. All of this on top of taking  1 hr 5 min: 1.5 blocks away."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trNFRHMUhWMk41YWxsdVlWRkljall4Y0ZoUExYYxAB",
            "text": "Lindo lugar, deguste las mejores gamba al ajillo, un amor todo el personal"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sWVFVbHVkR04yU2xaSmNYZEthbTFDU0V4dWRVRRAB",
            "text": "Enoteca Harlem I consider myself part of your restaurant family. I must recognize how this place prioritizes service excellence. The restaurant provides a comfortable vibe. You get dishes made with careful attention to quality. We'll return in the near future."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbVRIWnJYM1ptVlVJd2F6RkVSVWxUZDBKeGJuYxAB",
            "text": "Drinks are A+. Great wait staff. Food presentation is good, but items were overpriced. We left hungry. The squid paella was overcooked and much of it stuck to the pan.\n\nThe ceiling AC in the back of the guest room right above the tables could use a severe cleaning. Toilet seat was broken. Both signs sign of negligent management imo. If you want to charge $200+ for dinner, you need to do better!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KRVkySklURWxFZVdOeU1XSkhZWGM0ZUMxVWVFRRAB",
            "text": "Wonderful establishment, great service and the tapas were to die for. Cute, little quaint. It's spot not the best for large groups, but great for an intimate dinner or with a friend. Or if you just want to hang out at the bar. Came on a Saturday night no reservations. I think we got lucky because it was raining. But we ordered a ton of tapas from the patatas bravas, the shrimp with garlic sauce, the crab toast, salad, bacalao croquetas and octopus. The drinks were nice and strong. It was a great Saturday night"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWd09YbElXREJpTTBRM1ExaFVNMkpFUlZkcFFWRRAB",
            "text": "This spot has a cool vibe. Each plate delivered wonderful flavor. Their food choices were presented simply. The people here demonstrate authentic warmth. I'm determined to visit this place again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVWVWRjZMVzV0VTNaVGFrcDZNRlYxYW5KMWNVRRAB",
            "text": "stopped by for after dinner drink and snack. bartender was super friendly as well as the patrons next to us. had 3 appetizers with some red wine, everything was delicious. clean restrooms and great ambiance through the establishment. must visit Enoteca !"
        },
        {
            "date": "3달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pabE0wZGljVzlhUlZoa1kxaHZTVmxRYzJnNFQyYxAB",
            "text": "Tive uma experiência excelente neste restaurante! A comida é deliciosa, preparada com cuidado e muito sabor — dá pra sentir o capricho em cada prato.\n\nOs preços são justos e compatíveis com a qualidade oferecida, o que torna a visita ainda mais satisfatória.\n\nA equipe é extremamente educada e atenciosa, sempre pronta para atender com simpatia e eficiência.\n\nO que mais me encantou foi o ambiente acolhedor e aconchegante — daqueles que fazem a gente querer ficar mais tempo e voltar outras vezes.\n\nRecomendo muito!"
        },
        {
            "date": "3달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVU56bFphME5YZFZGZmRHdFFhVGxFTVRKa1ZsRRAB",
            "text": "Comer bem no Harlem, Enoteca. É um restaurante com culinária espanhola. Em especial eu adorei o polvo com purê de batatas. A paella também é muito boa. Enoteca é uma festa gastronômica."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taU1NqQndlWE5sVDFJMlZtaDJhamd4U0hreWRsRRAB",
            "text": "I wish I could give more than 5 stars! We celebrated a graduation here and they went above and beyond. Our family and friends were thrilled and so were we. It was such a memorable day that we’ll always appreciate. They made us feel both so special and at home.\n\nThank you! Highly recommend — and the food is incredible"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOb1NVWnZaM0ZXYTJaUlpqSTNhWEZXZW5SMFZFRRAB",
            "text": "Fantastic food, ambience, and hospitality. Everything we had was great, Paella Negra was my favorite. The owner, Macro, was extremely personable and went out of the way to give us the best dining experience possible."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMk5VaGZWa2xKWXpSRWJuTnBXRTlLTFhsMGNuYxAB",
            "text": "The scallop tapas and vegetarian paella are delicious, and the extended gin and tonic menu is a delight. What a wonderful addition to the Harlem community."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdVFrRkhXR2wwY0VGeWIzQlBURE5uUnpSR2RtYxAB",
            "text": "Great food and nice ambience. My highlights:\n\n- Lamb Burger was so delicious and juicy\n- The cocktails were great, specially the one with mezcal and the white sangria"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMVdqQm5hMGRIWkRCNExVVXdiMmR5TldsdFpVRRAB",
            "text": "FIVE STARS! Service was excellent. Food was delicious! The eggplant was my favorite. Can’t wait to come back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dVNsTnZlbWhrVFRjNU1sSk9VVzloTlY5TWNXYxAB",
            "text": "What an amazing place! Please go and check it out! The food was mouthwatering, the service was super welcoming, very attentive and as warm as meeting up with friends. The gin selection is huge and the bar is cozy. The bartender went out of his way to give us nothing but the best drinks: great at making cocktail suggestions as well as friendly conversation. A gem in the city!!! We will be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPLUZ1UG1OLTdTSDB3RRAB",
            "text": "This hidden gem was AMAZING. Everything tasted perfect. The customer service was superb. We came for a birthday celebration and omg i want to go back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQblpvNUhDX2ZYd1B3EAE",
            "text": "Been here a couple of times, and the food and service have always been wonderful."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VQM3JnYUdFek1EdWx3RRAB",
            "text": "Disappointing experience at many levels.\n\nThe food is average at best, paella is done with frozen ingredients for instance.\n\nThe service was slow and although they were nice people in general the staff was not professional, missing a lot of important details.\n\nOrder a chocolate cake with passion fruit mouse just to later learn that they actually serve it with vanilla. Even after acknowledging the mistake, the staff and manager did nothing about it.\n\nI don’t think we will be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJVEY4ckwyMWZYdkhBEAE",
            "text": "Spoiled birthday.  Five of us went for a birthday dinner.  We all ordered drinks.  One drink came.  Then another a few minutes later.  Then a third five minutes after that.  30 minutes after ordering, the last two drinks still had not come.  I went to talk to the bartender/owner who said he didn’t get the drink orders.  I asked if we could get them now.  He said we would have to wait more.  I said we’ve already been waiting 30 minutes.  He said he couldn’t do anything and said we could leave which we did.  Never to return."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNdkg1ZHVXdHBMLWxBRRAB",
            "text": "So excited about this new restaurant in the neighborhood! I’ve been twice and brought company when they were in town. I’d love for them to get high chairs so we can bring the baby."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLMy1oX2lZOVBEWmJREAE",
            "text": "Our favorite neighborhood bar! Marco makes you feel like you're an old friend, having drinks and a delicious bite to eat in his stylish, ambient home. There's a lovely, community feel where people are friendly. The wine is list is fantastic - Marco always suggests something I love. The food is never boring, is beautifully presented and very good. The decor and ambience is beautiful."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPWE15NlhGbmNxU2V3EAE",
            "text": "My new favorite NYC bar. The world's best gins meet the city's best mixology."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcE5EQzVBRRAB",
            "text": "We had an amazing evening with the friends who suggested this place.  The food was delicious and the service was fantastic. Even though gin is their speciality, their wine list is well curated and we had a great Ribera del Duero. If the scallops are on the menu when you go, be sure to order them!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvejl5dEJ3EAE",
            "text": "Just tried the new menu and I’m a big fan. The restaurant already has a great design and back deck, and an amazing staff and owner. With the new menu, they’re now my go-to brunch spot as well as my after-work treat. They have multiple vegan brunch options, and kept their delicious jackfruit ropa vieja. The non-vegans in the group really loved the chicken and Brazilian cheesebread waffles. The chicken is boneless and breaded instead of battered. We can’t wait to come try the other dishes and save room for basque cheesecake and flan.\n\nI wanted to note that they bake all their own bread! That’s a huge feat, and it made the Vegan Garden open faced sandwich really stand out. It’s just amazing that they bake challah for their French toast, too.\n\nThe drinks continue to be great. In addition to their amazing giant sangria and curated wine list, the gin cocktails are great. We ordered the Madrid and it was perfectly balanced and beautifully presented."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaVlxM1dREAE",
            "text": "Anniversary dinner before a show. Exquisite cuisine and exceptional service. Loved the ambiance and everything about the dining experience. No misses at all. Visiting from out of town but will be back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOU5mOXVBRRAB",
            "text": "We had a truly lovely time with the Enoteca team this past Saturday; we started with drinks at the Gin Bar, and were lucky enough to be tended to by the owner himself; a true delight and incredibly knowledgeable about the Gin selections (try the Inverroche Classic & Elderflower Tonic). The food was fresh, delicious and unique, and the service team was friendly and very attentive without being overbearing. Looking forward to going back again!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3d3E2akpnEAE",
            "text": "I always have the best of times here! The food is amazing and the service is incredible, Amalio’s energy is a total vibe ⭐️! Will always come back and recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRM0t1QVBBEAE",
            "text": "The food was not good and overcooked. The paella I ordered was cooked with the wrong kind of rice and it was tasteless. The service was nice but extremely slow, even if we were almost alone. The menu was unorganized and confusing. All this topped with high  price, I do not recommend."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRM1BPQ1JBEAE",
            "text": "Well we waited forever, food was not good like have they been to Spain? for Paella they use the wrong rice.. and cook it separately so it wont get the taste.. and the rice was overcooked. the croquettes were also overcooked and kind of deep fried? well I definitely can’t recommend. Not sure how this place got to 4.8 maybe they bought commends?"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNE03MXhnRRAB",
            "text": "The food and service was incredible. Every dish we ordered was better than the next. The service was impeccable and they treated my young boys with the upmost respect."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnM2FhQm9nRRAB",
            "text": "The atmosphere was amazing. We got to talk to the owner Marco, and he was so nice. The food was exceptional. We had the paella as a main entree. I highly recommend. We will be back each time we visit."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnLXBpSVBBEAE",
            "text": "Orange wine is amazing."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBa2N1QzJBRRAB",
            "text": "Best Spanish food I've had in the city in many years (and honestly better than some in Spain!), from the perfect croquettes to the pintxos to the wine list (Txakolina!). Made my heart happy. And don't miss the gorgeous bar! We'll be back soon."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBeXZTMjRRRRAB",
            "text": "Such a nice discovery! Really good service and environment seated at the bar. Jamón croquetas were amazing and also the cheese plate. Will go back for sure to try more plates."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmM052ZUh3EAE",
            "text": "And again we wanted to brunch at your place and it was closed. Perhaps you should fix your opening hours here on google? You are shown as opened but you were not.\n\nYou don’t even have your opening hours on your door. It is 1pm on a Saturday and you’re closed. The food is great though. So frustrating."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmc1ppTnRRRRAB",
            "text": "Calling this restaurant a \"hidden gem\" would be a monumental understatement. We ate dinner here on a whim, and it turned out to be the best dinner we had during our trip to NYC. Everything we ate was phenomenal, especially the croquetas. The dining area is chic yet cozy, with mellow music at just the right volume. Finally, our waiter Ibai was easily the friendliest and most efficient server we've met in months; he made an already great meal into a fantastic dining experience. All in all, this place is absolutely top notch and very highly recommended."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dEpHa01REAE",
            "text": "I will definitely be back here. We had such a great experience for my first time. I can’t believe this spot has been here for three years. I feel like I’ve been missing out on a gem. It’s intimate, lively and cozy all at the same time. Cute for a date night, solo or an evening with friends. The chef and bartender know what they are doing. My friend loved the sangria, the frozen fruit is low key genius… and the orange wine is dangerous so lead with caution…. The ham croquets are the best👌🏿 I like that you can get a croquet mixer and have fun with the different tastes. Each bite felt like something special. The lamb definitely stood out. The pair with the carrots wasn’t preferred but the meat was seasoned and perfect for taste. The scallops. Omg! They were served in cute shell plates. I was very impressed. I love that they offer tapas along with entrees as well. We clearly were excited to try it all but the service was exceptional. The staff were attentive, welcoming and very helpful even on a slow night. I can’t brag enough. 10/10. We were very pleased. This will go on my list of Harlem favorites. Do yourself a favor and come here. I highly recommend. Thank you again!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2M1B1YnNnRRAB",
            "text": "Amazing service and recommendations for dinner. This place has such a fun vibe for dates and the food is also delicious\n\nI really love getting the tapas so you can try a bunch of different dishes"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQeWV5MFdnEAE",
            "text": "Had an amazing dining experience at Enoteca with my wife before heading over to The Apollo. Started with a drink at the bar, one of the biggest Gin collections I have seen. Then moved into the dining room. After placing our order of half a dozen share plates, the waiter suggested he move us to a 4-seater table so we could be more comfortable. Waiter was highly knowledgeable about the food and wines menu. Service was impeccable and the food was spectacular.\nThey even pushed out the desert to make sure we weren’t late for our show. Highly recommend this place to anyone considering."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQN3RiQUhREAE",
            "text": "We've been back a few times.  Tapas are delicious, drinks are creative (and delicious), great wine list and even better service/staff.  We felt spoiled in a beautiful space."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzOTZuMVVREAE",
            "text": "Scallops tasted amazing!!🤩 The sauce was delicious. Scallops were served on a seashell. 🐚"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbl9fREN3EAE",
            "text": "Everything was delicious. We had croquettes and an omelette and other tapas. I also ordered the lamb chops which came with wild pistachios rice which was the best wild rice. I can't believe how good it was. I have to try to make it now. I have to say that I had a dirty gin martini that was wonderful but it was probably one of the most expensive ones that I've had. But great service and ambiance. We will definitely return. It's our favorite place in Harlem now."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzaC02WHlnRRAB",
            "text": "Went here for a celebration dinner, and the service was 10/10. The staff was very attentive, and the owner made us feel so welcome. I haven’t had such a nice restaurant experience like this in a long time. The food was also amazing!! I will definitely be back!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYdU1MM1hREAE",
            "text": "Delicious tapas. It may be Spanish, not Peruvian, but the Pisco Sour is very good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYdUltSVhBEAE",
            "text": "Great ambience, loved their tapas and wine selection."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYazRTWFhnEAE",
            "text": "Las mejores croquetas de NYC. Lo dice un español."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYck9lWmxRRRAB",
            "text": "Food was so flavourful. I thoroughly enjoyed my meal. Would definitely recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudjRLQ3RRRRAB",
            "text": "Great drinks and tapas! The new bar is a great addition to the neighborhood. Meet great people at the bar. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuM2MtYm5BRRAB",
            "text": "Delicious food and drinks."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4bUtEUVhREAE",
            "text": "The customer service phenomenal, I felt welcomed as soon as I walked in and the atmosphere was beautiful and we’ll set up! The staff was great at making recommendations and very informative! I ordered the mix croquettes, which came with 8…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUODRmOW5RRRAB",
            "text": "Great food, perfect drinks, dreamy atmosphere and wonderful service.\n\nLeo guided us through the menu and our vegetarian friends were delighted with the choices. The eggplant with cheese was a winner. And we loved the ropa vieja.\n\nMarco is a phenomenal bartender who knows all about the various gin and made 6 different, beautiful gin drinks for each person's flavor profile.\n\nIt was an amazing experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNllmXzJ3RRAB",
            "text": "Great food. Really enjoyed the classic paella, mixed croquettes and patatas bravas. Jake was very friendly. Will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3NWZTR0hBEAE",
            "text": "Bartenders help me select good wine, good appetizer, and good food cuz my Spanish is lacking. I love the atmosphere too. Enjoyed everything."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdmZPeTVnRRAB",
            "text": "From the days of dulceria/bakery to todays expanding restaurant, this place saw me through pandemic and beyond.  I’ve been there numerous times: solo or with groups, and each time a memorable good experience.  I highly recommend it to all."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXc3A3NjBRRRAB",
            "text": "I really like this place. Best croquettes I have ever tried! I also recommend the meat ball. The Spanish tapas taste really good and they have a big selection of Spanish and chilean wine.\nThe place is cozy and warm. Congratulations!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKcDlyOFlnEAE",
            "text": "Lovely spot. Enjoyed the wine list. Fun Spanish and Chilean wines. Loved the octopus. Eggplant ‘tacos’ were creative and yummy. Will get that again!  Service was great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEMTl1cVVREAE",
            "text": "Food, wine, service, and atmosphere are all amazing! I highly recommend coming here for an amazing dinner and I already can’t wait to come back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdnRhSjZ3RRAB",
            "text": "Celebrated my birthday and it was a lovely experience. Great food and service. Their dulce de leche and passion fruit cake was so nice. Really happy I went."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeWVmV05REAE",
            "text": "This was by far my favorite meal that I had while visiting my daughter who goes to school nearby. We loved the mix of Chilean and Spanish/Basque dishes- beef empanadas, mixed croquetas, shrimp sautéed with garlic and shallots, pastel de jaiba, and Chilean sea bass. We ate them family-style like tapas, and the waiting staff was very attentive. Perhaps my favorite part of the meal was the torta mil hojas (thousand layer cake with manjar/dulce de leche) that I had for dessert. Others enjoyed the postre tres leches and flan. A wonderful feast! Can't wait to go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiX3JlQWlBRRAB",
            "text": "Amazing food! And the most beautiful restaurant in Harlem with an old school jazz type of vibes 10/10"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyc2RyLXNnRRAB",
            "text": "Went for brunch over the weekend and had the best experience. The staff was welcoming and attentive. The food was delicious as well as the white sangria. Definitely will come back and try the outdoor seating in the back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlc3VQQktBEAE",
            "text": "Wine selection is nice and staff is very helpful with recommendations. We had a charcuterie board that only came with meats by accident but we enjoyed it. I don't recall the name of the dish pictured but I thought it was just ok."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobVpmRWt3RRAB",
            "text": "Can’t believe to describe this gem. So glad we went their for brunch. The food, service and decor were excellent!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4bk0taGtRRRAB",
            "text": "Phenomenal food, wine and service.  Perfect place to treat yourself or bring someone special for an intimate bite.  This place is a vibe and I love it. Very exquisite and delicious food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsajhtcTZBRRAB",
            "text": "Excellent service. Cozy, beautiful our waiter was great iva. I definitely recommend it🥰"
        }
    ],
    "reviews_count": 66
}