{
    "name": "Londel's",
    "place_id": "ChIJs_TsZXr2wokRdBl8ZcKroXs",
    "grid": "MN10",
    "address": "2620 Frederick Douglass Blvd, New York, NY 10030, USA",
    "rating": 4.1,
    "user_ratings_total": 431,
    "phone_number": "(212) 234-6114",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0Q1VqTlROM1l6YjNoSWRUUXpibTV6VlRBelptYxAB",
            "text": "If I could give zero stars I would, my family had a reservation for 1230 on a Sunday afternoon for a party of over 20 people, and they completely blew us off. They never opened. We stood outside in the cooler temperatures for over 40 minutes waiting for someone, however no one answered the phone, no one answered the doors… nothing. We understand things come up and emergencies happen, but the common thing to do, is to call your party’s host and let them know. We had to quickly find another restaurant that could accommodate over 20 people with no notice. Londel’s demonstrates extremely poor management and they are obviously very disrespectful."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sa1IzTjJRVGQzVlRGd1QyeG9WMHMwUzNGemRXYxAB",
            "text": "He is very rude and inconsiderate"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWU5rWlpSbEp0U1RsclRrcFBNMVU0WnpocVFuYxAB",
            "text": "I don’t know where to start. Walking in it was hot as haze, no air conditioning and outside was 85+.  There were 5 people in the whole restaurant. A couple walking out stated it’s hot, but the food is good. I wanted to try it.  They stated they had live music, but not even a radio was playing.  We had water, but my friend wanted a ginger ale. The lady took our order, but went to the bar talking instead of going to the kitchen to place our order.  The ginger ale came from a tap and was nasty, so he got a coke and that was nasty as well.  They have a bar, so you would think they had can soda as a chaser.  The server was trying but it was only her second day. The owner was there but he was behind the bar serving himself.  He came over and asked what the problem was with a nasty attitude. Explaining the situation, he states well I guess we don’t have anything for you.  The server was willing to give him something else to drink , offering suggestions.  A few minutes later the owner told us we had to move from where we were sitting because he had a party of 50 coming tomorrow.\nWhen we sat at the table, how come he or the server didn’t say something then. The people at the other table didn’t get their food, and had been there for a minute. We never got to  see any food , of course we left and I don’t plan on going back.  If I could give zero stars I would."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSRVVqVTBkamw1WkdOb1gwNVViM0JZTTFkcmJHYxAB",
            "text": "I came here for a private event, it was truly lovely. The food was delicious and Londel was very humorous and respectable. I can see why many people enjoy coming here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rM1dHWjNSMGRtTWxabmIzUnBRbGwzUm5GcFkxRRAB",
            "text": "No A/C, food delicious"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VManktS0hCOWZuTTlnRRAB",
            "text": "A very cool place, I liked everything about it. Great atmosphere, friendly staff, and delicious food. Thank you for your excellent work. I recommend everyone visit this place!!"
        },
        {
            "date": "4달 전",
            "language": "nl",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNandsTUg2NDZiUlZ3EAE",
            "text": "Zeer goede service. Vriendelijke eigenaar. Geen fooien verplicht in deze zaak, iets wat men in de rest van New York eist. Het eten is basis maar het hoort bij de sfeer."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJdk5vS0gycU1xUzVBRRAB",
            "text": "I went there with my daughters to enjoy a nice birthday dinner. The place smelled horrible. The dining room was a bit dirty, and the customer service was terrible; in fact, the food was not so good as it seems. This is a never again restaurant I'll ever revisit."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQc3ZManp3RRAB",
            "text": "Went for Thanksgiving buffet dinner, never again.  Luke warm food , no seconds and store bought dessert."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQdU9TdUJ3EAE",
            "text": "Avoid this place at all costs! What was supposed to be a festive Thanksgiving buffet turned out to be a complete disaster. We paid for a promised buffet feast but were instead served a single plate of half portions prepared by the owner—no seconds allowed. The food? Lukewarm, bland, and completely devoid of the seasoning you’d expect from a soul food restaurant. To make matters worse, dessert and the bill took an eternity to arrive.\n\nThe service hit rock bottom when we tried to take a family photo. Instead of accommodating us, the owner rudely insisted we move to the bar because he “needed to rearrange the tables for tomorrow,” even though our table was still cluttered with dirty dishes and glasses.\n\nThis was hands down the worst dining experience I’ve ever had. If you value your time, money, and appetite, do yourself a favor and eat literally anywhere else."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3cXNXTmJREAE",
            "text": "I loved the place and the people, the food left a lot to be desired."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6bmRUUkVREAE",
            "text": "Lovely establishment, wonderful staff, delicious food and beautiful atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUNTdhd2pnRRAB",
            "text": "The owner intrusive and rushing people out. I wouldn't have anything there. The food was cold."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMS1qcjRnRRAB",
            "text": "Didn't get a chance to try the food. However, the atmosphere was grown and sexy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENDRpSDRRRRAB",
            "text": "I haven't been here in many years but the atmosphere is still very welcoming and I love it. Food could have been better and the service as well. Nice waitress but I believe they were short staffed. I will definitely come again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdjdXbDV3RRAB",
            "text": "The food at this establishment was absolutely average. I cannot believe that they charged us 125 a person. It wasn't even worth $50 a person . We were given one dry pork chop a tablespoon of macaroni and cheese. Maybe a half a cup of collard greens and a dessert that was about a tablespoon as well"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkNjl1Rzd3RRAB",
            "text": "Title: Enthralled by Steppers Dance Group at Londel's in Harlem\n\nI had the pleasure of being invited to witness the incredible talent of a Steppers dance group at the renowned restaurant Londel's in Harlem. Despite a knee injury that prevented me from joining in the dancing, I was captivated by the mesmerizing performances I witnessed.\n\nThe dancers displayed impeccable hand and foot coordination, executing intricate turns and movements with grace and precision. Their skill and passion for Steppers dance were evident in every step, creating a mesmerizing spectacle for all in attendance.\n\nThe atmosphere at Londel's was electric, filled with excitement and energy as the dancers moved to the rhythm of the music. Although I was unable to partake in the dancing myself, I felt inspired and motivated to recover from my knee injury and return to the dance floor.\n\nWatching the Steppers dance group at Londel's was a truly unforgettable experience, and I am eagerly looking forward to the day when I can join in the fun and experience the joy of dancing once again after my knee surgery.\n\nI would highly recommend anyone in the Harlem area to visit Londel's and witness the incredible talent of the Steppers dance group for themselves. It is an experience that is sure to leave you in awe and leave you eagerly anticipating your next visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0NzRIdmx3RRAB",
            "text": "I ordered a drink, and it took the girl about 30 minutes to bring the drink to me.  I had to remind her. But overall, the vibe was good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROdnRIeDl3RRAB",
            "text": "Gettttto unfabulous spot, rude wait staff, server tried to keep my husband's ten dollars change, after waiting 20mins to order I'm a firm believer of paying service ppl there worth...Left her one sore buck, owner was drunk..Run to another place plz.\n....Trash"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsZ1lqQU1REAE",
            "text": "The music was great. That's it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsaHJhOE1BEAE",
            "text": "I always enjoy londel's place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1am9PWUR3EAE",
            "text": "My first time here was sadly for a repass but I really enjoyed my experience. The staff was amazing and Mr. Londel himself was very charming and accommodating to our group. This is definitely a place I would come back to and recommend others to enjoy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKbWNIMU93EAE",
            "text": "We made reservations over 2 weeks in advance for a group of 30 high schoolers and 10 chaperones.  There were no food, no servers and only one person to tell us that they were not ready for us. We will never  make reservations with them again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbVlISGt3RRAB",
            "text": "We pulled up after a long day of traveling. We had reservations for dinner and when we arrived, they told us they had no food, servers, or a manager. 42 tourists had to search the city for another place to accommodate us after this…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKOU12MlZnEAE",
            "text": "The hours of operations that google returns is often wrong, they are only open Wed -Sat 5-10 or 11 pm\nThe food was ok, the portions we got were a little thin (pork chops), tasty, just very thinly sliced\nService was good and the price was not too bad"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4djRUM0dREAE",
            "text": "This has been one of the worst experiences I have had in a while at a restaurant. The “fried” chicken is burned on the outside and undercooked on the inside and has zero seasoning to it. When you complain about it your pegged as a person who doesn’t want to pay although you are clearly giving feedback so the eject customer doesn’t encounter this problem. When you ask to speak to a manager your waitress (blonde Mohawk) no longer returns although she hasn’t had any of the food and has zero suggestions and doesn’t care how the meal has been going. She tells her manager you are being difficult since you asked to speak with him. Londell the owner arrives tells you there are no managers, his waitress said you were difficult and thought you didn’t want to pay. He is unable to take constructive criticism and clearly will only listen when he is shut down for undercooked food or lack of patrons. He clearly doesn’t get it. The best part of this place are the Chicago steppers who have nothing to do with it and everyone seems to know the food is bad around you and only suggest you get drinks. It’s sad they kept saying it went down hill but in my honest opinion it went over the Cliff. Do yourself a favor and just take your money and throw it out the window before eating here."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4MnYtTU5REAE",
            "text": "Best food in Harlem, you won’t be disappointed"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4OHV5eHFnRRAB",
            "text": "Would definitely recommend 👌 👍 had a great time. Went for a party, didn't have to pay for anything."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4LWUyOER3EAE",
            "text": "The occasion that I was there for, it took too long for the food to be served.  The bake chicken Was not well done.  I think the staff was a little overwhelmed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdTd2N0d3EAE",
            "text": "great cuisine, great atmosphere, nice boss.. to discover .. thank you from Belgium."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSLXB2N3ZRRRAB",
            "text": "the food was excellent and authentic"
        },
        {
            "date": "2년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSLXB1WXRnRRAB",
            "text": "Accueil très chaleureux, le poulet frit était très tendre et les frites très bonnes.\nBonne petite restauration si on passe dans le coin ! Plat typique américain."
        },
        {
            "date": "2년 전",
            "language": "fr",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSLXN1bzhnRRAB",
            "text": "Le buffet n'était vraiment pas terrible, tout ce que j'ai mangé n'avait aucun goût, que ça soit la salade à peine bien assaisonnée, le poulet beaucoup trop sec, le biscuit salé pas très bon, la compote, il y avait trop de cannelle dessus. La seule chose qui était correcte, c'était l'accueil."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPcXA2a0tBEAE",
            "text": "First off  I would like to Thank the entire staff for there kindness, patience, business savy,\nI was there for a repass. They handled the crowd with perfection and grace of a gazel they served food with the utmost care for each person that they encountered , and just let me say the food was excellent to say the least I will definitely visit LONDELS again on a much happier note . Thanks again"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSd0xUX1pBEAE",
            "text": "Very nice place, service was impeccable.  Food was excellent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbDdHSEN3EAE",
            "text": "Nice atmosphere. the place was clean and food was good. On Fridays 7-8pm, half priced drinks."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSeF95Q1JREAE",
            "text": "The food, the service, and the atmosphere are always perfect on any day! We love hanging here! 💪🏿"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSaXBlbGdBRRAB",
            "text": "It was an experience I will never forget. It's an amazing place to dine and to have a family affair ❤️"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbU4tZXRRRRAB",
            "text": "Muy amplio y excelente servicio"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSa05HUUNnEAE",
            "text": "The food was delicious as always"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocjduSFlnEAE",
            "text": "Although the staff was nice, the fried fish was dry and tough, the rice was hard, the cornbread was tiny, had no taste and possibly store bought.  Drinks were ok, but they are definitely short staffed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoajZiRVp3EAE",
            "text": "Neighborhood favorite."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNob3YtUlhnEAE",
            "text": "The food was great. The servers were great.  The bartenders were great. Londell himself was better than great. It was my 1st time eating there. It definitely won't be my last. I understand why my companions from Brooklyn, Queens, the Bronx, and Manhattan speak so highly about Londell's."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoeE4yRVd3EAE",
            "text": "The wait staff was very friendly.. food   was delicious 😋\n😋😋😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCN3B2eE5BEAE",
            "text": "Chicken was dry and the Mac and cheese seemed like it was sitting around and reheated upon ordering.... 4/10 👎🏻"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdHIzSjZBRRAB",
            "text": "I did not like the food I was forced to have during my jobs event today"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCcVB1YnZRRRAB",
            "text": "Stopped by for drinks to celebrate a retirement. Great prices, service and Atmosphere. Bartender  Monae is the best. We had some great finger food. Fish strips and mac n cheese."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtbDZPYXFRRRAB",
            "text": "Beautiful repast for Pamela Lee thank you Londel's"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtc2ZmWk5REAE",
            "text": "We were there for a repast it was great"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtOXFfVnpRRRAB",
            "text": "Our Thanksgiving dinner at Londel's was wonderful. The food was very good, we had a variety of choices from a well organized 2 hour buffet including a choice of desert. The waiting staff was well organized and pleasant throughout the service. I highly recommend Londel's, we'll be going back soon."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1OF9YdWpBRRAB",
            "text": "We celebrated my mom's 78th birthday at Londels. We've been coming to Londels for over 15 years and the Great Service has not, changed. Family oriented atmosphere. We had 66 guest for dinner. We had the entire restaurant to ourselves. Londel and his staff is phenomenal. Buffet spread was awesome. Drinks were great. My mom and my entire family were very pleased with their service. If you have never been to Londels, you're missing out on something excellent in your life.\nBlessings to you Londel and all you do."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrMkpUV1V3EAE",
            "text": "We were here with a group of 40 people and the service was great! Amazing ribs, sausages, rice, potatoes and so much more on the buffet! I would highly recommend this place for events or if you're travelling with a group through Manhatten."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1cUszTXVRRRAB",
            "text": "The Buffalo Wings were excellent! I came here for Thanksgiving before the pandemic & I've been wanting to come back & the wings were just as delicious as I remembered with the right amount of spice & cooked with a crispness on the outside & juicy on the inside. I highly recommend as the prices are also fair. Sheneice was the bartender & she offered great service & friendly conversation. I will definitely be back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhOGJyUzhBRRAB",
            "text": "Cool spot but they need more food on the menu.I'm a slim dude who love to eat"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbTZ5MUJBEAE",
            "text": "Attentive staff, and the food is good. Loved the potatoe salad."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlcy1ERW5BRRAB",
            "text": "I was there as an invited guest for a celebration. It may have been between 15-20 ppl. One waitress a d what felt like one cook. This made service longer than it probably should have been. The company was good lots of conversations. We made the best of the evening. Food was tasty."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndFpLb05BEAE",
            "text": "Great place and great atmosphere to just chillout and have a great drink. Great soul food also!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMweHFfSjRnRRAB",
            "text": "Waited an exceptionally long time for a grilled chicken salad.\n\nNice place with a very good Jazz band playing live when we stopped in around 7:30 on a Friday for a couple of drinks and what we thought would be a quick bite.\n\nIt took over 45 min for the salad to be served. The place wasnt crowded and it could not have taken more than 10 min to grill the thin breast of chicken.\n\nThat said, the salad was delicious. But definitely not worth the wait."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZdWYzOTlRRRAB",
            "text": "OMG.  The food and atmosphere here was super.  I loved the crab cakes, the pork chops and candied yams.  The only thing I was disappointed with was the dirty rice.  It just tasted like salted rice with no discernible flavor.  I was…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnNS1qcXlRRRAB",
            "text": "Love this establishment! We were looking for somewhere special that would host my mother's 65th birthday celebration. My sisters and I narrowed it down to Londel's. I'm elated that we did! The atmosphere made me feel at home. The food it seasoned just right and very tasty! The service is excellent and we will be back to visit!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3eHEtOFl3EAE",
            "text": "Music was good as well as the food. The only drawback was the wait was longgggg...while the waiter expressed that they were short staffed and the weirdest and most upsetting part was that they served one person and then had to wait in half…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbzRHbkpREAE",
            "text": "Went here for the first time. Celebrated my Aunt 60th birthday. The food was served catered style and ee were seated and in a side room for guest with a medium to large party. The catered food was served buffet style and it was superb. The…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlZ01tVmt3RRAB",
            "text": "Food took over an hour to come out besides it being an empty restaurant and  didn’t taste good at all. The collard greens were intensely salted. Fried chicken wasn’t well seasoned either."
        },
        {
            "date": "16년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3LXVxMlRBEAE",
            "text": "Lost our favorite Harlem soul food restaurant last year so gave this one a try.  Service is good but the food is lacking and the pricing is suspect.  Upon taking our order the waiter asked our table of six if we wanted the appetizer sampler which sounded great.  Problem is the appetizer sampler is actually charged as each individual appetizer so it ends up costing about $50.00.  Sampler means sample not throw all the appetizers on to one tray and charge separately.\n\nThe fried chicken was overcooked and hard.  They claim all their foods are fresh but the potato salad obviously came out of a third party container.  It had very little taste and the potato consistency indicated it had been sitting around.  My daughter complained that her baked potato and the consistency and taste of cardboard.\n\nMy mother-in-law did enjoy her catfish so that was a saving grace.  I have lived in an around New York city for 25 years and this has to be one of the worst if not worst meal I've ever had.\""
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLMHRDcUFREAE",
            "text": "The atmosphere is magnificent, the food delicious, the drinks spectacular, the establishment is clean, the staff is cordial, friendly and helpful. The overall ambiance of Londel's is Phenomenal, it's a plus that the owner himself greeted us and showed his concerns about the accommodations"
        },
        {
            "date": "12년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRMWI3YzZRRRAB",
            "text": "I went there only because the Black Party for Book Expo America was there on May 30, 2013. It took us nearly an hour to get a basket of bread and at least 90 minutes to get our food, which was disgusting. I could not believe that the place had been there so long. The waffles were hard enough to knock out a windowpane, the chicken was overcooked and greasy, the spinach had no taste whatsoever, and even the soda tasted suspect. Our waitress was the rudest one that I have had since I can recall. She acted like she was doing us a favor and slammed the plates down on the table like we were at a hole-in-the-wall diner. She never came back to ask if everything was okay but, of course, her tip was added into the bill. One person in my party had to get up and get his own bottle of hot sauce after waiting on it forever. I am one of those people who will brag about good restaurants and bring them business. This is not one of them. My first and last time going there. No excuse for it."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwellLWHdBRRAB",
            "text": "Attended a function there last night\n11/14/19. Enjoyed myself very much. Waitresses & waiters were very attentive, friendly and polite. Fried fish and buffalo wing buffet was very tasty."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwMV8zcmtRRRAB",
            "text": "I was invited to Londel's for a birthday lunch.  I remember Londel's as a nice place to come and enjoy a good meal and a relaxed environment.  This was not the case today.  The food was lousy and not prepared well.  The hostess was…"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURReTVuc0ZnEAE",
            "text": "If it wasn't for the time spent with my family, this place would've gotten zero stars. The staff was rude and unaccommodating and service was subpar.  We asked specifically to be served together but food still came out in waves.  They forgot my meal entirely, so my whole family finished eating before my good ever made it to the table. All of this would've been fine if the food was good, but it was either too bland or too salty, and the portions were so small that even my 7 year old complained of still being hungry after eating.  They sold the place as having live jazz, but instead we were subjected to a bad r&b playlist over an awful soundsystem. I will never return to this establishment and will never recommend it to anyone. Londel's, please do better."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNja2FEMGV3EAE",
            "text": "Old-school Harlem still exists! The fried whiting was cooked to such perfection. This chef really knows how to fry. The owner stopped by my table to welcome me and then the chef himself came out to talk. Non-touristy and priced right, too. On my top list of Harlem places to eat."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyXzlTTkVnEAE",
            "text": "I did a Video and Photography shoot of an Antioch open mic event with Poets and Song artist.  The show was a success.  I will post it on YouTube soon.  Londel's Restaurant gets  Five stars.  It is a divine, comfortable and excellent place to dine.  Prof. Mayam."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBXzZUNm1nRRAB",
            "text": "The service was great from the moment we walked through the door. Someone offered to hang up our coats and the waiter was attentive. The food was good and we didn't wait long for our entrees.  I look forward to coming back again."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRLUotMXZnRRAB",
            "text": "As an avid supporter of African American businesses in my neighborhood, I decided to try Londels restaurant. Unfortunately, I was very disappointed with the lack of professionalism and customer service at this restaurant.\n\nIn light of the fact that the restaurant was virtually empty, the amount of time I spent waiting to be served was inexcusable. I waited 15-20 minutes to be given a menu. I waited an additional 30 minutes after ordering a simple veggie burger. When I inquired about the status of my order, the barista told me that my order was still not ready. I eventually cancelled and left without ever being served with any food. I DO NOT recommend this restaurant to anyone."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJaW8tazZ3RRAB",
            "text": "I came here thinking this would be a good place for food drinks and to enjoy a pleasant atmosphere. The service here is disgusting. Your ignore and for it to be black owned I was treated like a second class Citizen compared to the lighter…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZcnJhTW5nRRAB",
            "text": "My family booked this restaurant for Mother's day  Sunday May 12th.  Beware the website doesn't say on Sundays it is buffett only. It is $35 per person which to me was too high price for the limited amount of food choices.   Also, my.mother doesn't eat half the food on the Buffett . We looked at the menu before making reservations and she would have loved the Catfish or Fried Chicken neither were part of the buffett.\n\nOn the Buffett was the following; oxtails, yams, macaroni and cheese, Turkey wings, collard greens, string beans, rice pilaf,, salmon, green salad and potatoes salad with rolls.  For dessert peach cobbler and plain thin slices of cake.\n\nPros of the Buffett:  diabetics and people with high blood pressure would love it.  The food wasn't too salty or too sweet.  The food was good but I like just a little more seasoning.\n\nThe staff are very professional and the owner Londel only charged half for my mother's meal after having the cook make a couple pieces of fried chicken so she wouldn't be disappointed on Mother's day.\n\nThe customer service goes a long way in my book and they exceeded it.  The atmosphere was great, warm and cosy.\n\nI will try Londel's again when I can order from the menu. So not on a Sunday.  I hope this review was helpful.\n\nMelinda"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRMC0tclhBEAE",
            "text": "In I'm having the greatest time. Kicking off my vacation with the Sunday Buffet. How they get the chicken fried on the outside and so tender on the inside. Burp. Ew 😯, excuse me. The included mimosa 🍸 is a nice addition. She got Sangria.…"
        },
        {
            "date": "6년 전",
            "language": "fr",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvX3RHYkJBEAE",
            "text": "Je ne connais pas le tarif, les plats sont simples, et peu nombreux. Le café est américain, les desserts se composent de gâteaux sablés. En revanche les plats sont ressortis des que nécessaire, et le personnel est assez agréable. En plus le restaurant est très proche des commerces de Harlem."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3aVo3djhBRRAB",
            "text": "Worst customer service. Understaffed, bartender claimed not to have clean glasses, hot food was served undercooked and cold, no silverware or napkins. They should shut down for good. A waste of real estate."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvM3B5RGpnRRAB",
            "text": "We dined today at Londel's in Harlem, NYC. It was my first time but it won't be my last. The occasion was a repast to celebrate the life of a dear friend and Londel's was one of her favorite places. We were greeted at the door by Londel…"
        }
    ],
    "reviews_count": 79
}