{
    "name": "Tropical Restaurant",
    "place_id": "ChIJB43dZONdwokRTnDRnwgRDLo",
    "grid": "QN9",
    "address": "88-18 Jamaica Ave, Jamaica, NY 11421, USA",
    "rating": 3.8,
    "user_ratings_total": 1128,
    "phone_number": "(718) 846-8816",
    "reviews": [
        {
            "date": "3일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGd1JtWndWM1V3Um5ONlN6VjFUVXh1VTBkeVUwRRAB",
            "text": "Una gratificante experiencia,que sabroso todo… el lugar acogedor, la atencion perfecta, recomendado el chaulafan, las brochetas, el encebollado., que rico todo."
        },
        {
            "date": "3일 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKaFUwaEJWbFJ5ZEdjNVRIWmlNMVJQYUU1ZlEzYxAB",
            "text": "El servicio con las camareras super bueno nos atendieron bien pero por lo que vi no tienen control con la gente borracha nadie los controla y ese concurso de disfraces al muchacho lo estaban acosando cuando considero que es algo que sería una diversión pero el tipo de capitán lastimó al muchacho y aún así viendo como lo acosaba el otro señor y no dijeron nada ni intervienen con personas borrachas deben de mejorar esa seguridad porque puede suceder algo mayor."
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMmIwdHlVVk4wUzBKVVoyUTVRMGRwYXpRNWVHYxAB",
            "text": "Muy linda atención la comida deliciosa el bolon 😍😍"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNGNpMHdhRzlsWm5WMGFucE1lV3QwVjFGS1RtYxAB",
            "text": "El mejor restaurante de comida Ecuatoriana lo recomiendo mucho"
        },
        {
            "date": "수정일: 2주 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDM3VQVGpBRRAB",
            "text": "This restaurant has had a poor rating from the health inspection for some time. Be careful that’s not a good sign. They currently have a “Grade Pending” status.\n\nEste restaurante ha tenido una mala calificación de la inspección sanitaria desde hace un tiempo. Ten cuidado, eso no es buena señal. Actualmente tienen el estatus de “Calificación pendiente\n\nBelow 70 / “Grade Pending” / “Closed”\n•\tPoor sanitary conditions\n•\tThe restaurant failed inspection or is awaiting a reinspection after receiving low marks.\n•\t“Grade Pending” means the restaurant is challenging its score or waiting for re-evaluation.\n•\t“Closed” means it was shut down until serious health hazards are fixed (e.g., pests, sewage, or foodborne illness risk).\n\nDebajo de 70 / “Calificación pendiente” / “Cerrado”\n•\tCondiciones sanitarias deficientes\n•\tEl restaurante no pasó la inspección o está esperando una reinspección después de recibir una calificación baja.\n•\t“Calificación pendiente” significa que el restaurante está impugnando su puntuación o esperando una nueva evaluación.\n•\t“Cerrado” significa que fue clausurado hasta que se corrijan los peligros graves para la salud (por ejemplo, plagas, aguas residuales o riesgo de enfermedades transmitidas por alimentos)."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4NVUwVlJTRlpCTkd0SGEwbDNjbVpvTkZaVGQwRRAB",
            "text": "Horrible service horrible food we wait almost 2 hours for the food to arrive and it was only one plate of food and fries for my daughter very nasty service !! I’m love my Ecuadorian food but this place no  I’m hope people red this bad experience"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ORlRubENNWHAyTFhwdE5uZGtVRWRKZGxweGNWRRAB",
            "text": "The bartender guy was awesome, on point with the drinks. Their was one waitress who didn't seem to like her job. Next time I'm staying at the bar! The music was eeeh they played music that no one danced to ALOT, not cool. There was one guy who was with the bartender and he seemed racist. Staring at my friend because she wasn't his racist 🙄 😒 can't believe ppl like that still exists 🤦🏼‍♀️definitely going to look for a new place to spend my hard earned $!!!!!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xka2JGTklla2hIUzJsNE9FTkxSemMxUW1oblluYxAB",
            "text": "La comida ami parecer no es mala , pero uno pide a la 6:30 de la tarde y a la 8:20 un no llega y tu llamas y no saben que mentira inventar undesastre no vale la pena amenos que tengas 3 horas para poder esperar"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gb2VYZzJkMU54VW5KRFoyWm9kbWh0TkRnMVIwRRAB",
            "text": "Las mesero son demaciado lento y la comida dura demaciado tiempo no lo recomiendo"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkQlEyeElNSGszUkRORE1HNUlObVZUTm04MFNIYxAB",
            "text": "Not good service"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwM09XbHBhWEJ6YXpCYWFVMXpVbnBWYUdKdGNuYxAB",
            "text": "La comida 10/10 y el servicio excelente, agradecida con la chica que me atendió que estuvo muy pendiente en todo momento en lo que necesitábamos. Sin duda regresaría"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNFQzQlBOMUkyVUZneFQwNUNjMmxMVm5Od05rRRAB",
            "text": "Hay una persona que coge los pedidos por teléfono pero es una persona desposta y grosera sin paciencia que no sabe tratar al cliente no es cortés y hace pasar mal momento que hasta el ánimo de comer le quitan a uno. Deberían de identificarlo y hablar con el!! Es el personal el que está dañando la imagen del restaurante."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMWVVVkdhSFZ2V1dKeFFqUnFhbGhPTjJjM05FRRAB",
            "text": "No se que ha pasado por las porciones de comida han disminuido, los precios han aumentado, lo cual es entendible por la inflación, pero al menos mantener las mismas porciones de comida de antes.\nLos meseros no son atentos ni carismáticos.\nDos platos de comida y dos cervezas 70$? No vale la pena."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOaGVtWnRRVmROZW14R2JuaEVORXc0U0VsMWRtYxAB",
            "text": "Pésimo servicio"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMFEzSmtPSFp0T0hWelFtMXRSa2xSUzFjMGJXYxAB",
            "text": "No les recomiendo ha cambiado tanto el servicio es lento espere 1 hora para mi servicio y nunca me pasaron mi orden y los meseros pasaron otras órdenes a otras personas que llegaron después de mi no les recomiendo ojalá el dueño cambie el servicio de comida …y encontré otro restaurante comida ecuatoriana Mami  Leos sorry por comentar antes era bueno el tropical y todavía se cobran la propina adelantada"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGU2JXbFpPRTlCWlhSb056RTRUbWQzYWpsWmNuYxAB",
            "text": "El servicio muy pésimo, la comida tardan en entregarla se demoraron mas de una hora en servir la comida y los meseros tienen muy mala actitud y la propina incluyen en el pago final"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sbFlqRkNkRFEwU0haT2VqUjFOVUV3VWtsa1luYxAB",
            "text": "Se demoran mas de una hora en servir la comida"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOb2NrSk5YMFZZWTBvelMxcFBTMUZ4Y1hodlJVRRAB",
            "text": "El Servicio y La Comida Son Suuuper Buenos!! Nos atendio la Venezola muy amable!! 100% Recomendado! ✨"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsVlJEUjZjV1IwTjBSV2QxWmlTakJCTTA5UFkyYxAB",
            "text": "Very rude service especially if you call for a delivery this people think they doing you a favor by attending you"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5UlUybEJabTVQU0ZsUWFHMWphbGd0UlZWV2JHYxAB",
            "text": "Muchas gracias por tu atención señorita\nVenezolana excelente"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paMlQyOXFZaTAwY0hneFNXaFBjMnBWYURoVVgyYxAB",
            "text": "The food was ok and my girl told me that they automatically put a 15% tip on the bill which I thought was absurd"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kcE9HbFlXblU1VGxvMFRXOURWWGRwT1VaNk1IYxAB",
            "text": "Amazing drinks!! Margaritas on point, representable look great\nFood really good recommend the bolon\nStaff really nice and attentive specially the bartender"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSlNUQjRUekE0Y2xkV1NrVTNOM05mVVVwbVRFRRAB",
            "text": "There were 5 people working and only 4 tables, yet they were still running around like it was chaotic. The food came in small portions, and at the end of the meal, they automatically added a 15% gratuity—even though the service was not good. Very disappointing experience."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWSWMybDZVMWRDTURGVFFUaG1jWEpFV2xGSWJXYxAB",
            "text": "Me encanto la comida, la margarita, el mojito. Los empleados muy amable y rapido al atenderme. Recomiendo 💯 el lugar."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poemVFYzJjVTVCWldSbUxWZGZha2RqYUhZNU5rRRAB",
            "text": "La comida y el servicio es terrible!! La comida de muy mala calidad y los meseros ni se preocupan por atender porque la propina ya la incluyen."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMFdYRlhkVGxpZGswNFRXRkxkRmRHWWtSamJVRRAB",
            "text": "Buena comida"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOTVIwdE9Vakp4ZUU5RU9IVjJUa3h1ZG1VdGRVRRAB",
            "text": "The best restaurant in Jamaica, I love the music , the ambience , its clean , delicious homie food , great service, kind people, the food it’s so delicious there it’s a big variety of dishes ☺️☺️we come here often and we are never disappointed and it’s affordable and nice 👍"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlOHBlSGdBRRAB",
            "text": "I had to ask for everything! Utensils,Hot sauce etc. Nothing was on the table, my juice glass was cracked and almost cut my lip."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rME0zZFhiRWM0WDBWRFptdHhNVkZvY1hCMFRFRRAB",
            "text": "Excellent food the service of the girl was amazing. She was so nice and considerate 😍😍😍. I think she was Venezuelan 🌷"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwNFNsUllUelkxZGtWNFRtWjBNR2hxUzFaT2VIYxAB",
            "text": "Had tgtg and it was fine. Filled me up and taste was ok. Would be back."
        },
        {
            "date": "수정일: 4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3dk1DM0JBEAE",
            "text": "Exelente lugar para disfrutar de una deliciosa comida 👌"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VMem85djN2NHMzQTdnRRAB",
            "text": "La calidad de la comida 3 estrellas"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xamFYVXhjblJHTmpsd1lUaEhVRWh3WjNrNVVXYxAB",
            "text": "Que terrible atención y segundo se supone que es un restaurante ECUATORIANO y no saben cómo es la comida las personas que atienden ni si quieran son ecuatorianos se demoran una eternidad solo para ir a tomar una orden que decepción total"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPZ3N5MlJ3EAE",
            "text": "Ordering pick up or Uber eats from this place it's insane. You wait for over an hour. Also i get that prices are slightly higher through uber eats rather than going into the restaurant. But this place charges $8 bucks for a 16oz Poland spring bottle of water. I thought it was a gallon of water until I read the fine prints and noticed it was for a 16 oz bottle of water 😭🤣. I thought the water was made of eggs lol"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQalpwNWVtX0tuLUtnEAE",
            "text": "I really like their food, is nice place to go eat with your family, the service is very good and the prices are not that crazy,I really recommend it .."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQcjZqUGlKbDllQzlBRRAB",
            "text": "Pues para empezar vine a este restaurante ase dos años y la Comida fue horrible . literalmente una pérdida de dinero , pues decidí regresar de nuevo pues mi esposo siempre le a gustado La comida de ahí y pues su plato favorito es la bandera , y pues fue el que me dijo que le diéramos un chance más al restaurante llamamos para ver si tenían cupo para tres personas y nos dijeron si ! Pues llegamos al restaurante , y de entrada nos tocó esperar por una mesa casi 15 minutos después que nos sentamos  isimos la orden de las bebidas y los aperitivos , pues la persona que iso las bebidas trajo una de ellas erróneas .\nSegundo le dijimos al mesero pero totalmente se le olvidó , era un solo mesero para 6 mesas horrible , luego de que nos trajieron las bebidas y el aperitivo, el mesero nos cojio la orden , mi esposo ordenó una bandera , para mi hijo unos nuggets con papas fritas y pues para mi un arroz de marisco , pues esperamos casi 20 minutos para que trajieran la comida de mi hijo y de mi esposo , y al fin mi esposo y mi hijo terminaron de comer y mi comida nunca llegó ala mesa le dijimos al mesero que ya no queríamos nada , pero luego mi esposo le dijo si la tiene enpaquelo para llevar , después que le dijimos que empacara la comida en un segundo me la trajieron ala mesa , ósea ellos tenían la comida lista y se les olvidó oh se le olvidó al mesero recogerla y traérmela , pase un día de las madres horrible mente no disfruté ni comí todo el día y me lleve la comida ala casa con rabia tercero cuando le pregunté dónde está mi recibo para pagar el mesero me presionó para darle la propina y aunque no fue mucho lo que le di se enojó conmigo ! Y pues parse yo debería de estar más enojada  con el por no traer mi comida ala mesa tampoco quería armar un show ya que habían llegado muchos clientes más y para lo último cuando llegue a casa y chequie la comida la orden estaba errónea también y en ves de darme arroz de mariscos me dieron fue un chaulafan mixto   de carne pollo y camaron el peor día de las madres aparte de que e llamado una semana para hablar con el dueño y no me lo\nPasaron porque todos los días me dan una excusa diferente no valoran a los clientes les falta mucho de servicio al cliente ni vale la pena. Este restaurante la verdad pensé que después de dos años mejoraría pero no está peor que la primera vez la verdad cuando salí del restaurante entendí muchas cosas ni siquiera tienen una letra A ni B afuera dice pending grade ! Pues fueeee horrible todo que mala experiencia"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPWFI1cUdqNkpXU3VRRRAB",
            "text": "Me.gusto. . Mucho"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VOMkxqWWZDZy1Qb0pBEAE",
            "text": "Service was HORRIBLE.\n\nWaited nearly an hour , & food came back the way I didn’t want .\n\nWorker flung speaker because he couldn’t hear ."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMNnRrdlNRbWIza1ZnEAE",
            "text": "Es mala la atención"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOTGxxX21za2RHeE5REAE",
            "text": "The food was amazinggggggggggg amazing."
        }
    ],
    "reviews_count": 40
}