{
    "name": "Q Rico No Manches",
    "place_id": "ChIJG-YC5eRdwokRq2aGm4C-2AA",
    "grid": "QN9",
    "address": "79-11 Jamaica Ave, Woodhaven, NY 11421, USA",
    "rating": 4.8,
    "user_ratings_total": 525,
    "phone_number": "(347) 829-3380",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4cFZWcDVkRUk1VFU1Q2JWRjRiekJpZWpsYVYwRRAB",
            "text": "Delicious food"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxa1QyaHdUMVpIV0hNMGNqVXhZblZTVm5reFIxRRAB",
            "text": "Great food and atmosphere"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dE0zWnNia3d3ZW5WRFFUaFVhWFZDUlhCa05HYxAB",
            "text": "Amazing Food and Excellent Service from the guys in the front !"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5TU0zUndVa2hzWVRJdFIyRkRiV2swUTBGM1ZtYxAB",
            "text": "I love this place food is excellent, burritos and tacos are amazing, anything Bria is great and they have great portions for the burritos."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GT1dYWTVaVVl6TlhGbGFtaGhiSHBuTkZvMlUxRRAB",
            "text": "Great experience, food is delicious and staff is very nice. Birria tacos and al pastor are absolutely good!! Always looking forward to going there and enjoy their food."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205NE9UWmtaRlZFYTJOMFIxaHhWWE5TUzBGcWFsRRAB",
            "text": "great food chill spot"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnNVJuUXljamRWYm04eFZWOUphME5IYWtoQ2NHYxAB",
            "text": "Absolutely the best Mexican bowl I’ve ever had! I’ve tried several items on the menu, but there’s something truly special about their steak bowl—it’s incredibly flavorful and stands out from the rest. The portion size is generous, the price is reasonable, and the quality is consistently excellent. On top of that, the staff is super friendly and the customer service is top-notch. Highly recommend giving this place a try!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRMWFVOUpXR2RzUVZRNVRXUm5OVGN6ZEZocFFsRRAB",
            "text": "This place is a hidden gem. The Bowls are INCREDIBLE, chipotle times 100!!! I’ve had it 20x and it’s the same quality every single time they don’t miss. I super recommend this place to any one who desire some quality Mexican food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NemMxbEZTWGd0ZVU5WWFFVllTMGRrVjJabFdVRRAB",
            "text": "Everything good but 15 dollars burritos in Jamaica.  They use to be bigger and cheaper but not it’s the opposite. Not the best bang for your buck but everything is good here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sQ1RHb3lXbUp1UjBGMFRGQnZjbGhWVFMxb2EwRRAB",
            "text": "Love this place. Great food and great service. Highly recommended."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoTFYxTlpNM1p3YmxGYVl6ZDVlRTkxTTBGU1UyYxAB",
            "text": "Food was good, owner was friendly, staff were great! Overall great family owned restaurant!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GRlgwcFRNM0pMUzNSUVFYQndUMWszVTFCaE1YYxAB",
            "text": "Amazing food, amazing customer service!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KWVkxSm9TRzlzUW5KMFRHMU1ZMG93VEROVGFtYxAB",
            "text": "Great food and amazing hospitality.  Could not even finish everything , had to take it home. Definitely get the al pastor pollo."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214eFNYVkthVzFXTUdGM2VFZEtiVnBaZEhwT2VtYxAB",
            "text": "Food was great, they give you really large portions and it tastes really good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUGJHNW9OVnA0YUhCNGNsOU5TbGc1UlUwMVZHYxAB",
            "text": "The food here was amazing. Come and try it out! You won’t regret it!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tweVlWbGlhRFpvY0RkclFUaFRabFZqZWtaemFFRRAB",
            "text": "Great service and food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkTmNqUnpOa3BvYWt4RWJVOW1hVlZ4U2pkVmVtYxAB",
            "text": "Yummy walking taco!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xblZrRlFOMlJEY3pSaE1tMUxZbFUxWlVkWWRFRRAB",
            "text": "Amazing food and service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOek1HVk5lRXh5Y1ZOQ2REbERkREV6V1ZFd2JWRRAB",
            "text": "Delicious taco spot"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kT1ZtZHFVVzk1U0ZFNVRYcE9NVWh3TTNGMFoyYxAB",
            "text": "Amazing food! pleasantly surprised for the area. i lived in the neighborhood all my life. i usually would drive to other locations by car to get good mexican food but now i am happy i tried it here cause its just a short walk. definitely best mexican food in the area by far! the service was great and the menu was large, enough options for everybody! the mango drink was insanely good! everyone in woodhaven needs to try this place and take a menu home to order ! ❤️✨"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKelJEZEVibGh3UTB3MmEySjRlbDlMWDBKVWRtYxAB",
            "text": "The Birria tacos were 🔥🔥🔥!! Service and staff were very nice. Can’t wait to come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkUVlWZHlWblUzY1hwTFpYaDBPR2hzYWs4MGVHYxAB",
            "text": "I ordered a “chicharrón “ quesadilla, which is a pork crackling quesadilla. What I got was NO crackling and a lot of pork fat. I was raised crackling is crunchy. I don’t know what it’s for Mexican but I got soooo sick from the 1st bite. Opened the quesadilla and it was full of what it looked like left over fat only at the edge of the quesadilla. I’ve ordered many times before from here and raved to people about it. This will definitely be my last order."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201bFl6Y3RUbXBTWWtJdFRGZHNWalZWVDA0eFJGRRAB",
            "text": "Muy rica la comida"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJemNXRkRWRWhuUjNCS0xXZEVZbXd5U0RSMmNIYxAB",
            "text": "Live it, they make my order exactly how I want it, and Im kinda pucky hahaha, the service is the best and the food is super good, favorite place"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKelJrMHdkRVJ3YlhkU1ZYbGtUMm81ZVdkMWRtYxAB",
            "text": "Muy rica la comida lo recomiendo"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wZlpVRkZUMGRJZHpNd1oyOXNhMngyVjFKNlVGRRAB",
            "text": "We ate here for the first time in August 2025.\n\nWe tried the burrito bowl, the nachos with steak, the mixed tacos and the burria tacos with horchatas.\n\nThe burrito bowl was delicious.   The shrimp and pineapple tacos were extremely spicy.   The guacamole was good and so were the nachos.\nWe thought the burria tacos need a little more flavor.\n\nThe horchatas were absolutely delicious.\n\nThe people were really nice and the space is nicely decorated.\n\nI would not hesitate to come back and try new things..."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSWVdqVXpiRzk0V25ad1dGWmlZbUozV0doallVRRAB",
            "text": "Absolutely delicious!! Really sweet and patient staff , Banging playlist and a small but comfortable area to eat and relax 💕✨ Will absolutely be going back because everything down to the lettuce was fresh and delicious. I recommend the Birria Tacos and the chicken flautas ✨💕 they do not skimp on toppings and again are such kind staff💕✨. For all of this food we waited less than 15 minutes but as always be patient with staff as they handle online orders, customers walking in and phone calls✨💕💖"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210cVFsUnJkVEpJTmpFeVQzQk1iRmxNZW14V2NsRRAB",
            "text": "I waited 30 + min for my order even after waiting the initial 30 min so an hour in total. They forgot to make my food while everyone’s takeout order was being sent out. Guy lied and said they were cooking it, doesnt take long to make a burrito. Wont ever visit again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kVlIzZEtabTlFVmpFeE5GUk9RMjVzWVdsbmNWRRAB",
            "text": "Great food best tacos in the city, servise was great as well"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taWWEzbEtjbmwyY3pkTVVsZG1XbWgyWjNSbllsRRAB",
            "text": "Great tacos and great customer service!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrM1dWaE9hWEpYVGxZeE9WaEJURnB2TFdndGVuYxAB",
            "text": "Primera vez que vinimos, tratando de cambiar “la ruta del taco”. De entrada un chico vió que entramos y las mesas estaban sucias y él sentado, tuve que acercarme a él a decirle, puede limpiarnos la mesa. El solo recogió los platos y ya, creo que deben hacer un poco énfasis en pasar y limpiar las mesas porque al sentarme, limpié la mesa con una servilleta y ésta quedó negra, quiere decir que no se limpian las mesas constantemente. Un plato eran tacos de pollo con champiñones asados y no estaban asados, parecían blancos sacados de lata. Siempre me fijo mucho en el servicio al cliente al entrar a un lugar."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WUGMxSlNlbUl6VWtoSFRtVlRiMk4yUVhkcVJsRRAB",
            "text": "Took 25 minutes"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxaGJHSktVelZsTW1vMVNsaHJVMkpRTmtKTWNuYxAB",
            "text": "I can't even front... the burrito bowl puts Chipotle to shame. Also, thier busy as well. However, you have to understand why, lol.\nPlease be patient. These guys work very hard."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205T2RXVXljVkJqU2xCVWQwRmpVRlkzUVdSRFdIYxAB",
            "text": "This place and the food is amazing. I forgot to specify an allergy to avocado and without a hesitation they changed the entire order and remade everything. No attitude or anything!! This place and the service is a 10/10!!! I got 2 Al Pastor and 1 shrimp taco. Mad yummy !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOcXY5WmFGMnZEcGpBRRAB",
            "text": "Really good tacos, especially the lengua"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLaWI5YTN0NTdMaHJRRRAB",
            "text": "My family and I eat from here 1-2 times a week and we never get tired of it. Best tacos and birria I’ve ever had I love it.\n\nLa calidad de la comida es buenisima, mi familia y yo comemos de aquí 1-2 veces a la semana. El servicio es excelente, los trabajadores son bien buenos. Muchas gracias!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdHVDUm13RRAB",
            "text": "Amazing !!! Their Tostadas are to Die For😋 As well as the Birria Tacos, however My Favorite would have to be the Tinga Tacos 💯 A MUST TRY!\nOh & They have some Desserts. The Fruit Tarte hit the Spot as well."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaFlfNEFnEAE",
            "text": "I ordered at this location online by mistake when i meant to order for Brooklyn. I called them and they were nice enough to call the other location and place my order. Lost no time or money.  Great folks! Also yum!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeS1YaGZ3EAE",
            "text": "Atmosphere is great! Customer service is phenomenal! Love their food especially their birria quesadillas uff *chefs kiss*"
        },
        {
            "date": "수정일: 6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMk1fWndnRRAB",
            "text": "Excelente comida y servicio. Al visitarlo se siente como en casa. Seguiré visitándolo"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMjd6SEFnEAE",
            "text": "Amazing food, especially the Viagra & the salty beef taco. Very fresh and flavorful. Stumbled upon this place by accident and thank god I did! Service was great and the people are very hospitable. Will be back sooner than later. Excited for the new location in Brooklyn as they’re expanding their menu with various avocado toast specials and cappuccinos ! Thanks again guys."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmazUtNkFnEAE",
            "text": "Where do I even begin?! First of all, the food was so good I started wondering if any of the chefs are single because I would trade my firstborn child to have these delicious dishes for dinner every night! I highly recommend the birria tacos, cheese flautas, and anything with rice and beans (because they were to die for!) I will absolutely be visiting again. Second of all, everyone was so friendly! I think they are family-run because they made us feel like family! Third, look at how cute the plate and lil bowl they served my tacos and consome in is!!! Fourth, the decorations!! So cute!!\n\nThe only negative is the amount of noise. They were playing music and also had two TVs on. I think if they lowered the volume on all three a tad bit it would be slightly less overstimulating 🙈 Still, I will be back regardless!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNad29PMEtnEAE",
            "text": "Ordered this because of a recommendation from a friend! Wow! these tacos are so yummy. The tortillas taste fresh & soft & the meat is so juicy. Everything came super hot & their portions are great. Prices are also good! Glad to have this gem in our little neighborhood!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoODVtb1FREAE",
            "text": "I finally came here for the first time with my daughter and so glad we came. The owner is extremely nice and welcoming. The food is so fresh and delicious. I also loved the drinks. Will def come back!!!! If you are thinking about coming, Do it! You won’t be disappointed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMk03bkdnEAE",
            "text": "This is me and my husbands favorite spot in the Neighborhood! Ronaldo is always so welcoming and makes sure you are attended with the best care. The food is fresh, delicious, and he is always there to recommend a new dish. We love coming…"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyMEt6TnFBRRAB",
            "text": "Estuvimos visitando el mes pasado New York, encontramos este restaurante y nos encantó la comida, el trato y el ambiente. Una atención de 10 y todo estaba muy rico. Sin duda, merece la pena recomendarlo."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUNElhNVlREAE",
            "text": "Went on Google to see what I was gonna eat for lunch and happened to find this gem of a restaurant. Food was AMAZING, me and my girlfriend had the Birria quesadilla with the consomé which was the best birria anything I’ve ever no lie. We also had the shrimp tacos which were delicious, the chicken flautas with rice and frijoles which was so good the rice was so soft and moist and frijoles were tasty. My girlfriend ordered the Crazy burrito which was absolutely MASSIVE had to weigh like atleast a pound but it was top notch very very good. Overall this place was amazing and will def be coming here regularly whenever I want Mexican food. 10/10 !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqOXFTcDVRRRAB",
            "text": "First time placing an order from this restaurant.I order 3 Birria Tacos.1 Carne Asada Torta & 1 Carne Asada Loaded Fries. It was the worst food I ever had I was so mad that I spent $42 & food was put in the garbage the meat taste funny & weird looking pieces wish I can get reimbursed."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbTVhSVp3EAE",
            "text": "I LOVE THEIR FOOD!!!!! The tostadas are the best. They're delicious. These and the steak burritos are my favorite!! Everything they have to serve is very tasty and satisfying!! I give them 2 big thumbs up!! You have to try there food if you haven't done it already. You won't regret it!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdjliYURREAE",
            "text": "The food is great. I ordered beef taco and birria tacos combo and cheese quesidilla. I also got the mango smoothie and I think it was pork tacos. All of them taste good and satisfy my cravings! Highly recommended. BTW, the owner and the…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYd3BhSGZ3EAE",
            "text": "The staff was incredibly friendly and nice, they helped my friend who didn’t speak really well in English navigate through the menu, the Tacos were so good that they surpassed our expectations. 11/10🔥"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMUppTHlRRRAB",
            "text": "The food is good, we had the nachos and mega torta. The nachos were good and vegetables were fresh. The mega torta was the golden one. Wow the mega word honored its meaning."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcTRxb2N3EAE",
            "text": "Amazing smoothies 10/10 the S1 healthy life is my favorite !! The quessabirria is amazing very well seasoned with the soup dip the chicken quesadilla is sooo good very big size will be back often!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPZ3J1cG1BRRAB",
            "text": "I had the Birria tacos, they were amazing. Every bite was a climactic experience! And the service was one of a kind. If you’re looking for really good food not just tacos this is 100% the place!!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdUxpV2NREAE",
            "text": "Great place being run by Rolando and amazing food being made by Cristina.  Second time I stopped by and definitely was not disappointed at all. We tried the birria quesadilla this time and it was phenomenal. Also tried the mangonada and it was a nice refreshing drink to go with the birria. Adding on top of the food, Rolando is a super friendly and genuine guy who just wants to give good food to people."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNFpibWxnRRAB",
            "text": "Nosotros trabajamos en la escuela cerca del restaurante. Mis compañeros y yo nos encanta la mangonada que ordenamos 6 pero no me dio tiempo para tomar una foto de todas juntas porque todos querían los suyo. Pero hoy pude disfrutar mi mangonada y mis tacos ☺️ gracias!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtOGJuYzR3RRAB",
            "text": "This place is amazing! The food also tastes amazing! I had the mega torta the other day and I was blown away by the portion size and the price. The prices are great compared to other spots. The owner is very friendly and welcoming. The restaurant inside is also kept very clean. I would definitely recommend this place and I look forward to coming back again soon!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoLWN6ZDFRRRAB",
            "text": "All I can say is the customer service and the food are ABSOLUTELY AMAZING! I decided to give this place a try and ever since, I’ve been ordering from here almost every night! I’ve ordered a variety of different foods, like birria tacos, tortas, flautas and so on. No matter what food I get, I know I’m eating goooood 🤗"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyLTlQSEhREAE",
            "text": "Stopped by at this hidden gem, was amazed by the food and cleanliness. Very friendly staff super help full\nRecommend me their newest item the walking taco"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOGJ6ZVRBEAE",
            "text": "The food is really good but they have no urgency to get food out. I stop by for a quick taco order and it takes like 20 minutes. It’s not like it’s even that busy. The kid taking orders is especially slow my word. Bro does everything in slow motion."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtOGR1dTJnRRAB",
            "text": "This is the place to be !!! As you can see we were way too excited by the ambiance and smell of the food (which by the way was the reason we walked in). The tacos, sandwiches, rice bowls, and drinks were on point !!!!! You will not be disappointed"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKb0lxSXJnRRAB",
            "text": "The food was amazing ; hands down the best birria tacos and quesadilla I have ever had. The consume is delicious, packed with flavor; the quesadilla was so cheesy and delicious 🤤; the Mangonada 😍 refreshing and well balanced flavors from the mango bits , Tajin, chamoy, tamarind and a gummy worm on top as a bonus ; official favorite Mexican spot"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqa01LbHdBRRAB",
            "text": "Tacos are my favorite food. When I asked what was inside the tacos, they only gave me onion and cilantro. I asked to add tomatoes. He expresses his self-discipline. I find Tacos Fulton 3398 Fulton St, Brooklyn, NY 11208 many of my delicious tacos."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1bnBuckJ3EAE",
            "text": "This place was absolutely delicious! Muy rico de verdad 🤭 I had a burger with fries and a Jarrito de Tamarindo\nFeels very comfortable in here and the atmosphere is warm and pleasant. Will be coming back for a torta 🤞"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSME5McEdBEAE",
            "text": "Es mi primera vez en el lugar y me pareció súper acogedor, lindo todo y la comida asombrosa. Mi esposo pidió una quesadilla que no me resistí y le tuve que quitar un poco. Soy fan de los smoothies 🤩 y el servicio 10/10 definitivamente volveré.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPeEtPS29nRRAB",
            "text": "Delicious Mexican street food!!\nI suggest you try the Taco Loco and the behemoth of a \"torta\" =Crazy Torta!!\nDID NOT DISSAPOINT!! check out the images, these 2 dishes are plenty flavourful.. the Crazy Torta is definitely for more than 2 people, I say 3 or 4 the most.. it is HUGE!!!\nI will return specially to try their famous Mangonada... stay tuned folks 😉"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1dHN5TVJREAE",
            "text": "10/10 my new favorite local Mexican quick food spot. Friend recommended me and would definitely recommend. Carne asada bowl was great. Would definitely come again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKb3RfYTZBRRAB",
            "text": "I had to wait a long time before I got the Food but it was delicious. I ordered beef tacos. The bread, meat, vegetables, and sauce tasted amazing. Price is also okay."
        }
    ],
    "reviews_count": 68
}