{
    "name": "Austin's Ale House",
    "place_id": "ChIJ9-CAs7xgwokR0dG6ectdSDo",
    "grid": "QN9",
    "address": "82-70 Austin St, Kew Gardens, NY 11415, USA",
    "rating": 4.4,
    "user_ratings_total": 1484,
    "phone_number": "(718) 849-3939",
    "reviews": [
        {
            "date": "수정일: 2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMk5lMDRnRRAB",
            "text": "This is the place to be. Everything and everyone is fantastic!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMVkwNVBSM041Vm1wd1F6ZFZibmRIYTNkeFlWRRAB",
            "text": "Excellent service and you can't beat 40 bucks for an aged prime rib"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aeE9GRXlTMDl6UTA0MGNIcElUVWxWV2taNmNrRRAB",
            "text": "Not bad at all"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SS1VtUllURUZNYjAxRVdVaFVWSFJRZUVGWE5HYxAB",
            "text": "🤘🏻💗😎✌🏻🤗😋👍🏻 EXCELLENT VIBES ALL AROUND\n✨✨✨✨✨ 5 STARS"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQybmRyQUtBEAE",
            "text": "Braided ribs are fantastiv"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVU1tTTJhbkJYZWxoM1JIUk5jRFpXZEdscFpHYxAB",
            "text": "Very good food. Pretty great vibe.\nThis was my first bar and I’ve been rocking with Doogie for 15 years. I love their other spots in Bayside but this place will always have a place in my heart.\n-Kazooo"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRN0kzUjVRRRAB",
            "text": "Lots of televisions and other activities"
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEd2RpTFVREAE",
            "text": "Good, local sports bar"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrM1JGQkdXSGRYZG5Zd2JYWXRObTQxYVZoSlpHYxAB",
            "text": "Exceptional Food (top quality meat) Service, Ambience\nAs a world traveler and a long time New Yorker, I am amazed by this gem in my neighborhood.  Ale House encompasses perfection in combining all ingredients to make everyone feel so “at home”. My last two visits accompanied by a friend, we have spent after and evening eating Lunch & Dinner.  The atmosphere is so inviting, that it’s difficult to leave.  Thank you a million times 🙏"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RM2RsRnJlV2d4VHpSWGRXMUVUekpoVURNNFZGRRAB",
            "text": "Good steak...must try, fear price"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vNVRVNWxYMHhzTjFGSGQxQlNXakpPU0VKdFFuYxAB",
            "text": "Came here after seeing a movie nearby. I had the Mac and cheese with chicken which was pretty good. Service was fast and the atmosphere was nice. Would highly recommend and visit again if I’m in the area."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKU1ltYzRRbXh3VlRSblRsUjNiMWhCUkUxRlNXYxAB",
            "text": "Holy moly is this place awesome! The food is fantastic and the atmosphere is lively. My favorite experience was on St. Patrick’s day of last year, there was live music and it was so festive! On a regular day though you’ll find sports to watch, there’s a bit of gambling to be had, good food and really lovely staff. They even have a huge outdoor seating area that’s heated in the winter. I’ve never been disappointed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSU2RsZ3dVRTVSUlRNd2NVeHdOVkUyZFZCb2RWRRAB",
            "text": "Eating here is always a pleasure! The food, the ambience and especially the service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkUVQwaHRSR056VFcxSFVHeDNWMjlQVGpCMFkwRRAB",
            "text": "Large portions of quality food and great variety as well. Beers of course are great and bar part is usually full. Back area by train station allows dogs too.  Device was excellent 👌. Beautiful newly remodeled bathrooms downstairs. Great local place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkSFprVnBiblJxUTBOMk1qZDJaRFZ6ZEY5RVFWRRAB",
            "text": "Unfortunately, we didn't get a chance to try the food here last Sunday. After waiting outside at a table for 20 minutes, a server still hadn't asked our drink order despite one walking by us multiple times. I asked a host if someone could…"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjeVNWbzFSVXRtWkRnNVdERTJRMGRPZG1JNE5sRRAB",
            "text": "Helllllo…. This is a GEM A GEMMMM. Now ladies on Thursday you drink free from ten to one. And now I’m hereeeee now and I just seen the owner and he is a sign that says they have BAR PARTYS $49 a person 2 hours open bar OMG let’s GOOOOOO"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wbWMyVk9NM3BNY2xSVFIyTnZaMlo2YWsxNldFRRAB",
            "text": "Five stars but please bring the bowling machine back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OUlltZHFUa1pYTjJ4bU0wdFBhbFF5TW1OdldHYxAB",
            "text": "Good food and convenient location for friend gatherings.  The happy hour is not clearly advertised, it's only applied at the bar."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUmNrODBYM05zZGtSeE9GbGZSRTloZUhCUlZIYxAB",
            "text": "Good place for some drinks and appetizers."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cck4xZEZkVFpmTkRSRFVHOTNZMUZGVVVzNGExRRAB",
            "text": "Austin’s is quaint pub steak house. We stopped noon on Saturday. Friendly staff.  Steak sandwich was cooked just right. Alcohol drinks were good.  Irish coffee delicious.  I highly recommend with the right company."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oeFIwSlhWRGd5UTA5c04wdzFZV2RqYkVoNlRrRRAB",
            "text": "If you guys didn't close, I'd never leave!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVGNUTlVNR0l4TWpkUVVFTnlNbE5VUjNSNFoxRRAB",
            "text": "They are less concerned for delivery order, like took an hour but when asked, it's always 5 minutes."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGNDduaER3EAE",
            "text": "Food is good, service is good as well. It's a nice local place we've been going to for years. In the warm weather, the outside patio is very nice. Staff is always friendly and professional, prices are reasonable. We love Austin's!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psRVVrRm5XVkUzYjNaTFdVdFhhelJXVkRoQ01HYxAB",
            "text": "Austin ale house is a great place to unwind.  The atmosphere here is welcoming. So if you want to relax after a hard day of work or a chill vibe on the weekend, give it a try"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMTDU0OVBDcHR1cVZnEAE",
            "text": "Had a great time. Food music the game. Perfect. Eat here twice a week at least. Even if it’s just a pick up & carryout.."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLYmw0T3Z2M2VpdGZBEAE",
            "text": "Good food, good people."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKM0RrcTdxdzZmdzB3RRAB",
            "text": "This bar is absolutely amazing. While it may look unassuming from the outside, don’t let that fool you. What’s inside is a whole different story. I stopped by on a Wednesday in the late afternoon and early evening, and the experience was nothing short of fantastic.\n\nThe service was truly top-notch. I couldn’t put an empty glass down without another full one appearing almost instantly—talk about attentive! The staff clearly takes pride in what they do, creating a warm and welcoming vibe that makes you want to stay awhile.\n\nIt’s the kind of place that sneaks up on you in the best way possible, and I’d come back in a heartbeat. Highly recommended."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMN3QwYkRabTZLRTZRRRAB",
            "text": "Great food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMbnU1cURRczUybV9BRRAB",
            "text": "Always a good time. Food offerings are a bit more limited than before but still some good items on the menu"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VOQ0FsLTNLeXJ5TXhnRRAB",
            "text": "Food is always good here"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvb2RTdk9nEAE",
            "text": "Their latest surf and turf is absolutely spectacular!\nWho would have thought of it, a Kangaroo steak as the Turf, with Platypus as the Surf!\nYou can only get this special if you know who to talk to and the man to talk to at Austin's ale House is John!\nJohn is not there all the time so you've got to time your visits, and it's worth it because John has access to other \"secret\" menu items, that are out of this world. Ask about the Alien Burgers.\n.\n.\n.\n.\n.\n.\n.\n( This is a spoof!, but you already knew that! )"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3eGVIRWNBEAE",
            "text": "Good location.  Tuscana pasta, chicken, sun dried tomatoes. Sauce was ok.  Portions huge.  Salmon and veggies were good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHaHVhM0d3EAE",
            "text": "Tried their special Thanksgiving dinner menu for the first time. Service was a little slow in the beginning but it was worth the wait. Good portions & good prices, food was very good. We had to take part of our dinner & dessert home to finish & enjoy later. She had the turkey meal(obviously) & I tried the rack of lamb...both very good & tasty. Btw, it was a 5 course meal with choice of appetizer, soup, salad, choice of entree, choice of dessert with coffee or tea."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREeXZtdmtBRRAB",
            "text": "Great food and service. Definitely try the Poutine (topped with short rib) because its delish!!\n\nStaff is friendly and SUPER attentive. Darlene was our waitress and she was a pure delight! She single handedly made us decided we will be returning again! (Thanks, Darlene!)\n\nThe outdoor seating is cute and quaint with the LIRR passing right by you.\n\nWill definitely return simply on how great the staff is and how yummy their food is!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYc3FheW1nRRAB",
            "text": "My best friend and came out here with some friends and it didn’t disappoint. With best food in Queens, Austin Ale House shows its charm. Decorated to feel like a cozy bar on one side, and tasteful casual dining experience on the other. The recommendation was Prime Rib. Thursday and Friday nights are ideal for this delectable cut of meat. They have other specials throughout the week and I would tell you to check them out. The Shepard’s Pie empanadas were great too. Check out the horseradish dipping sauce and au jus for the rib….they have two sizes . The queen cut and the king. If you plan to take any home take the king otherwise enjoy the pictures and check them out ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobHRQZnV3RRAB",
            "text": "The area is nice and comfortable. Once you walk in, you're in a bar, but I went with my kids as well since they have a dining area as well. Staff was friendly, food was good and before we left they had a live band playing. If you're in the area and want to have a good time with friends, please stop by!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcl9DZW13RRAB",
            "text": "My family LOVES this place. Food is really good, they have a good deal on Sundays (kids eat free!!) and they have the romantic outdoor space. 3 businesses we can't lose in KG - 1) Bagel's dozens, 2) Dani's and 3) Austin's Ale House. Long Live Austin's Ale House!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1MUx2WGRREAE",
            "text": "A great place for a nice meal! 3.5/5 tbh.\n\nThe schnitzel was really well made. It had a nice crisp, sauced well, and had a robust flavor.\n\nThe clam chowder was decent. I think there could have been more flavor.\n\nI'm not sure if it was a bad night for the wings, but unfortunately my wings were on the dry side. The exterior of the wings were nicely coated with the delicious mango habanero sauce and the skin had a nice crunch. Sadly, the meat was a bit too overcooked for my liking.\n\nThe waiters were really nice but the service seemed a bit slow that evening. The dining area wasn't too crowded, so I'd imagined something was going on behind the scenes.\n\nCertainly not a bad place! I'd try it again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdUpTQUhnEAE",
            "text": "So sweet) chef make for me Russian type of cesar salad)\nNot exactly off course, but he tried his best 🥰"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwbWNfQVNnEAE",
            "text": "Went in for team dinner. The place looked great and pretty spacious.I liked how the bar is separated from the dining room. Also liked the food & drink I ordered. Little pricey but the food was amazing. Would definitely want to try their burger which looked very palatable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMbjlmZnZBRRAB",
            "text": "Austin’s Ale House\nEst. 1991\n\nLayout/atmosphere\n*Bar area to the left (eight TVs, high top tables, Internet jukebox); dining room to the right (TVs, fireplace, brick walls); tables out back covered by tent\n\nService\n*Good\n\nFood/drink\n*15 beers on tap\n*Third Rail Burger (Cajun seasoned 12 oz. beef patty, pepper jack cheese & spicy honey caramelized onions) with French fries [pickles & coleslaw on side] - good; lightly toasted club bread; spice on the back end; slight sweetness from onions; fries had solid crisp but needed salt"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNULU5PQjVnRRAB",
            "text": "I sat outside for lunch on a beautiful April afternoon.  I ordered a pasta entree which. Was delicious.  I had a. Refreshing cranberry and vodka cocktail.  The atmosphere was friendly and casual..there were  couples and. Babies. I was dining solo and really enjoyed my meal.\nUpdated to review their brunch. Brunch is served 12 to 4 pm Saturday and Sunday.\nI ordered the Challah French Toast. It comes with a basket of muffin and bagel with butter jelly and cream cheese\nAlso there's a fruit cup and cocktail. I ordered an orange juice instead of the cocktail.\nThe Challah French Toast comes with bacon home fries maple syrup and orange slices. It's so delicious.\nThere are many choices from crab cakes to omelets to chicken with waffles.\nThe dining room is wheelchair accessible . Enter to the right of the main entrance."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZeTlhb3NRRRAB",
            "text": "We came in to Austin's ale house for dinner.\nThe place looks nice and clean. There is a bar on one side and a restaurant on the side.\nWe sat on the restaurant side which is more quiet.\nA waiter then came to ask what we want to order, he was very nice. We ordered the buffalo wings as appetizers. I ordered the 3rd Rail Burger and a beer flight and she ordered the Turkey burger. We got beer and house bread really quick.\nThe wings came out about 10 minutes later and we ate them for about 20 minutes. Then we were waiting for our burgers for a while. After about waiting additional 30 minutes I asked the waiter about our food, he replied that its coming in about 5 minutes saying he waited to put in the order for the burgers a little longer than he should have and that he is sorry. After about 20 more minutes that we didnt get our food, I was looking around for our waiter to ask him about it. The manager passed by and I told him that we are still waiting for our food, he apologized and said he will check on the order. After a few minutes the manager came back saying the waiter forgot to put in the order but it should be ready in 5 minutes to which I replied that thats what the waiter told us 20 minutes ago. The manager was really nice and compensated us with free drinks and took the appetizers off the bill. He apparently also switched our waiter because some one else was serving us from that point. I must say that the food was really good and if not for that little delay I would have left a better review, and since the manager compensated us for that Im giving it a 4 star review.\n\nIm sure it is an unusual delay and that the service is good at that place, also as I said the food was really good. I still recommend trying it out."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyM2JlY1pBEAE",
            "text": "This shrimp and rice dish arrived fresh off the skillet and very, very hot! Once it cooled a bit, it was delicious. I was dining with friends and we all liked the place a lot. There is quiet area for dining that is separate from the bar. They also have outdoor seating."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzLVBmSElnEAE",
            "text": "Wonderful environment,  nice soft music, kids friendly, great food. 1 of the best steak if had. Over all I loved it. I do have to mention, the crab cake needs work, I've had better, but everything else made up for that."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtb2VXamZnEAE",
            "text": "Great drinks, prices, staff, music, food and atmosphere, they really make you feel welcomed every time you stop by, would recommend. This is easily becoming my new favorite and goto spot from now on."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMjlubDhBRRAB",
            "text": "We enjoy dining here whenever we are in the neighborhood.  We usually sit in dining area side (right side after main entrance) as opposed to the bar (left side after main entrance).  Austin's has a pretty robust menu, plenty of daily specials, and even cool events.  The service here is good - nice, friendly, and attentive wait staff.  We always order the French Dip Supreme.  It is definitely a sharable portion, especially if you are ordering an appetizer or saving room for dessert.  The French Dip Supreme is thinly sliced roasted prime rib of beef with mozzarella served on toasted garlic bread with a cup of au jus!  It is absolutely delicious and tastes like heaven.  This time we ordered the poutine as an appetizer and was not disappointed. I highly recommend you trying the place out."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlN09PeXhnRRAB",
            "text": "Parking is very difficult around the neighborhood. Haven't been here for years and this is the first time for takeout. Had diarrhea all day after eating. Might be the fried food? The fonion rings and fries do look very dark colored. For what I got burger with fries and onion rings and an order of chicken wings. They could reconsider how they pack the food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxcEpTclV3EAE",
            "text": "From out of town. Stop here for lunch on the way to JFK. Food was good and reasonably priced. Servers were friendly. I would visit frequently if I lived in the area."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd0pxX0N3EAE",
            "text": "Best place I've been to in a while. They have tasty, delicious food of all sorts! The staff and servers are patient and polite. I recommend trying to take a bite at!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3eTVqaEFREAE",
            "text": "The hostess was very welcoming as well as Wendy my waitress. The only disappointment which was little was that I had to be moved to twice to two tables as I was dining. Once because a musican was setting up and next because a table was reserved. I dealt with it but was difficult as I am autistic. Otherwise, it was wonderful experience. Next time, I look forward to coming back with my husband."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiazdPOFRREAE",
            "text": "The truth is that I spent an unpleasant moment in this place due to the bad attention and rudeness on the part of one of his waiters, a haughty and rude person. I don't understand how to take care of the staff. Although the food and the atmosphere are good. This waiter affects all the good that the place can provide."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobVl6U3JRRRAB",
            "text": "My second visit, dinner and lunch. Dinner was Salmon and vegy; lunch was Quinoa and spinach, both times food was delicious."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtLWNMSGNBEAE",
            "text": "First time there.The atmosphere was good.The burger was the worst burger I ever taste in my life.It had No Seasoning but the fries was good."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRaS12NUNREAE",
            "text": "I recently had the pleasure of dining at Austin's Ale House, and I must say, Madison, our hostess, truly made our experience memorable. From the moment we walked in, she greeted us with a warm smile and a friendly demeanor that instantly made us feel welcome.\nMadison was efficient, quickly seating us at a table that had a fantastic view. Throughout our visit, she checked in on us to ensure everything was to our liking, demonstrating excellent customer service skills.\noverall, I highly recommend visiting and experiencing her wonderful service for yourself!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJcGEtQjlBRRAB",
            "text": "Here's a very cool neighborhood watering hole that is really quite antiquated and fun. Between the entryway which divides The Bar from The Main Dining Salon, it retains the original tin tiled ceiling and wood mouldings everywhere. The walls are overly decorated with local artwork by students. And the table spacing is cozy though crowded.\n\nInsofar as the menu, it's definitely an American pub-styled fare. Moderate to expensive. On average, more homespun than anything else. And, difficulty getting past the funny taste with the ice cubes -- which signals something inside the kitchen ... like Gordon Ramsay's Kitchen Nightmares! Otherwise the wait staff is youthful, bright and intelligent. Articulate and ultimately fruendlier than the male patrons over on The Bar sidelines. Food plus beverages did add up, but given this is the only decent restaurant serving this kind of menu ... burgers, steaks, etc., it's great with the locals. For business meetings as well."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDdllHRGJ3EAE",
            "text": "Good service as always and plenty of outdoor seating! Chicken nachos were delicious as well as the frozen margaritas!"
        }
    ],
    "reviews_count": 57
}