{
    "name": "Caribbean Cabana",
    "place_id": "ChIJrdrd1K1gwokRahAVcFMSqAI",
    "grid": "QN9",
    "address": "116-02 Jamaica Ave, Richmond Hill, NY 11418, USA",
    "rating": 4.2,
    "user_ratings_total": 1301,
    "phone_number": "(718) 849-0500",
    "reviews": [
        {
            "date": "7시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sUmVIWnJjMTlPY1hCemNHNVpla3BVUVhac2JWRRAB",
            "text": "all kind of great Caribbean dishes"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCbFJXTTNVM1oxWjJwSlNHNU5VSEZNWkdwTVVsRRAB",
            "text": "Amazing food and service. Good price for the service"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ka01VcGxWMWd6UmpkNmFuUXhZV2syWDFjMWJtYxAB",
            "text": "The food is really good, best price and good amount."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMWJHMDNZamMzTW5wUU4xTjRlRkZWUzE5c2IzYxAB",
            "text": "Food is not the same as it used to be to be about 2 years ago"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwSVQxTkNlRFpFU2pSTFFqbG9aRUpQUmtsUGNHYxAB",
            "text": "Great food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVMVMwMTNjVTk0WVVvNFQyNU9TbnBYTmxReFQwRRAB",
            "text": "Always good times is CC. Can't go wrong with chachikhai chicken, hookah, late night music. Get your groove on"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSQ01YSkhZMnB0UTBvMVQxRlhVV05VVGkxRmFFRRAB",
            "text": "Worst fry rice I ever had it was slimy and the rice smell spoil"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CS1RFRXlPR3gwVlRCRk9WRTBUREl0YVU5S0xYYxAB",
            "text": "Food pricey and veggie fried rice and chowmien"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poVGVHdFZNWGxaUVdKQ1dVa3RaMjVRVEdGNFNVRRAB",
            "text": "Live in the area and 1st time here and had a really great experience. We were a group of 12 and our waitress Vani was very pleasant and catered to our every needs. Food was great, atmosphere was great. Music was good and not too loud. Would definitely come back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OemVHbzNOMWx3TUhOcGNHUlJOMDFhUjBneVNFRRAB",
            "text": "Amazing!!!! Its a great place to hang out after dinner. Club and restaurant separately. The food is great 👍🏼 👌. The vibes is top notch. If your into Caribbean/west indian vibes its the place to be. Love going there"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5dGFsZDFRbVJvUVdKWWRHRldWMmhLV1dVM1gzYxAB",
            "text": "Food was food id rate the food over all a 8/10. I truly loved the food & the ambiance. Definitely coming back. I tried; Piña colada, Fresh Soursop juice. Appetizers: Fried Shark 🦈, Fried Red Snapper, & Mozzarella Sticks. Dinner: Spicy Chicken Wings Lowmein House Special Fried Rice | No Pork (It comes with chicken, shrimp, crab meat & pork.)"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBNWFUNlVnEAE",
            "text": "Great food, beautiful people, friendly atmosphere and always happy to serve you. My go-to spot every weekend. I’ve tried all of their dishes and everything is really good. Flavorful and good proportion for your money’s worth."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVlZWRjRka0ZVYjNwUlZ6aGtORjgwTVdVelpYYxAB",
            "text": "It has been a while since I found a restaurant where the food was good. I was very pleased with the food, very delicious...going back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZemNVUldOVzF2YkhGcFlsOU1NRUY0Y1Zwck4xRRAB",
            "text": "Great 👍"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPNTlTeC1BRRAB",
            "text": "Cold food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRWNEQlVMVFYyT0dkRE0wYzNTbWhtWkVNeGNIYxAB",
            "text": "Staff wasn’t welcoming. good was not fresh. Bought Chinese food and had sauce on my fry chicken. Idk since when fry chicken getting some kinda soy sauce on it. Bought black pudding and it was definitely hot up and not fresh. Will not be going back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOZmRUQXlaRWhoTjJkV1JHRnJWMFptZWpKaFJFRRAB",
            "text": "Absolutely disgusting. I ordered from this restaurant through DoorDash and it was a complete waste of money. The food arrived looking sloppy, smelled awful, and tasted even worse. It was so nasty I couldn’t even finish a single bite I’m seriously considering reporting this place to the health department because I don’t know how they think it’s okay to serve food like this to people.completely unacceptable Never again — save your money and order somewhere else!”\n\n“I honestly think anyone who’s had a bad experience with this place should be reporting them to the health department. The food is unacceptable and could seriously make someone sick. This restaurant needs to be shut down or put out of business before it harms more people.”"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKSVdWcHhjRXQzWmxkbWJVdHlTRmsyU1Rrd2JHYxAB",
            "text": "This is my favourite place for dine in . Everything about this place is great , all the staff are very nice and welcoming, appetizers are delicious and wide variety of drinks as well.\nOverall if you want a good food with great service visit this place, it’s worth it!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkaU5HTm5WMk5zWlRaaE5WRjVSbGR5TWtWMVZIYxAB",
            "text": "Clean and friendly people"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVFQzWlJaMVp2Y1hWZmRXdFRVVGhJVm1SVFRHYxAB",
            "text": "The food and drink are delish here. I especially love the wonton and the house special. And for drink and drink you get here will be good the bartender does a great job. The service is usually pretty good. Brunch I'd say is a little wait but dinner service is fast. Also i love how they are a all-rounder restaurant that caters for all ages. During the holidays they have goodies for kids. There is also a bar on the other side for those that want to continue their night after dinner. The music is usually good and a fun time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25obVZsUmxMVVJZTFd0dlprUkRPVmRGZFU0d1JuYxAB",
            "text": "As a Trini, I will admit that Guyanese chinese food is better ours and this spot has probably the best Guyanese Chinese in Queens: 10/10. Most flavorful fried rice you’d find. Shrimp wontons are so crispy and loaded with shrimp. The restaurant itself is sort of a side piece to their lively bar, so don’t expect upscale dining or anything, which is fine for what it is. West Indian vibe is on brand. Highly recommended for the food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxbVVWWXhaMUZZYkVwUk1qWkxTRVJXUlhjMllXYxAB",
            "text": "I like to give a special thanks to Lisa she's an amazing bartender also was my therapist and she deserves so much recognition for her hospitality."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ac1ZqUjZSR0V4VDBSM1pIRlhkbHBEYjBKQlVrRRAB",
            "text": "Overpriced and is charging extra for using  other forms of payment. The portions are very small and the drinks are very expensive. Unfortunately their business will be closed shortly."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWNlQxb3hWVkJzWW05V1pubEZRVzVMYWtoVFdXYxAB",
            "text": "I have been exploring new food in NYC. This one is definitely my most favorite. The house special fried rice was amazinnngggg.\nCant wait to try it again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VKR0Q1WldSczV6ODdBRRAB",
            "text": "Food is good No happy hour"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJenRtT3lYdzZqN1JREAE",
            "text": "A nice place to hangout with friends and family. They have a decent seating area and the service was good. The food was tasty as well. They have plenty of options for food, drinks and desserts. If you're in a Caribbean \"mood\" or just want to experience a little bit about the food of that part of the world, you may visit this nice restaurant!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMWHVnNFRIN0pQMVVREAE",
            "text": "Great experience service was not bad at all. Good timing for everything."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQeUN6T2JxdXJxN0VBEAE",
            "text": "I placed an order for pick up got my order and went home to find out that they gave me one order short. When I called and told them about it they said that they will have it delivered to me and I’m still waiting for my wonton’s…I’m very disappointed in Caribbean cabana you guys need to do better. I ordered 2 chicken fried rice, 2 chicken chow main and 2dz of fried wontons and paid in cash and only received one dozen. Very disappointing."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJLU5QelZBEAE",
            "text": "Saw this spot on tik tok and decided to try them today...walked in and the place was very clean and welcoming...the staffs at the front was very nice...got my food to go....not a long wait time either....the food was very fresh and delicious...I got lamb black pudding and chicken fried rice...the only thing I didnt really like was the very small serving of pudding for the price...the price was $14.95...anyways I will definitely order from this restaurant again...."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJZ0tXWGtRRRAB",
            "text": "We were a group of 25, celebrating a birthday. It was my first time being invited to this restaurant. I was happy to find parking right across the street. The first glance at the restaurant from the outside was not much to contemplate with, but once seated- it was a different experience.\nThe staff were all attentive and very friendly. The food was absolutely delicious! I probably ate almost half the menu, and every bit of food was savory and so delectable! It was refreshing to finally find a place where, without having any expectations,  left me feeling fully satisfied.  I would highly recommend you try this restaurant. Take a cab, you might not be as lucky to find parking as I did 😉"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQydnBMazhnRRAB",
            "text": "Service sucks"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaTlLbVNBEAE",
            "text": "We visited on a Friday night with family, and the food was excellent. The appetizers come in large, shareable portions, and the drinks were all great. Service was quick, but the female staff/waiter could have been a bit friendlier."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSamZEX1pBEAE",
            "text": "A lively restaurant that when I went (a Saturday evening) was very busy and full. The atmosphere was nice, good music and Caribbean decor. The food however was hit or miss. My food, which was the Chicken and Vegetable special, did not feel special as it was bland with little flavour. It also was partially warm, like it was reheated in a microwave. My partner's food however was tasty and flavourful."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXaHNxOFBREAE",
            "text": "Had a great experience with my family. Food was delicious... We ordered a lot of food and they did not disappoint. The atmosphere is really nice. The staff are super friendly. Our waitress Samantha was the best. Family friendly for sure."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdGFHZ1ZREAE",
            "text": "The red snapper, wonton, jerk lamb is good.  Do Not order the steak.  It was dry and had to send it back.  Atmosphere and service is good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyaW9QNHpBRRAB",
            "text": "Amazing food if you just want to come and eat. We visited during the day and had to come back a second time in the same week. Lovely service too as soon as we came in, plenty of seating. Jar of pepper sauce upon arrival is the best. Will def be back during the day for food ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUbTh6T0tnEAE",
            "text": "The food was absolutely on point! Banga Mary, pumpkin, rice and peas, oxtail roti and dhal puri … fantastic!! Bahama Mama - perfect!  Comfort food for real\n\nI do have ONE complaint - I wanted Odouls and they only had Heneiken zero (lol)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhdElpUklnEAE",
            "text": "Been here several times and the service is always amazing. Brought new friends on each occasion and they have all loved it here too! Drinks are good, food is great and there's hookah for the hookah lovers! Def recommend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPX0pHTHZnRRAB",
            "text": "Can't say enough great things !!\nKajol ! Kajol ! Kajol ! Yea that's her real name she made my entire visit perfect and amazing ! From entry to exit ! Very friendly and very comfortable I don't…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEcUxLX1J3EAE",
            "text": "Great spot for some great Guyanese food At Anytime But A Great spot to go to late nite after partying & having a few drinks. It was my first time there & it definitely won't be my last time 👍🏿- A must when visiting queens 👌🏿💯"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUXzZHaWVREAE",
            "text": "I like the food here it’s very close to home majority of their dishes, I can’t speak for all but majority is good. But they’re too expensive and the price you pay for what you get is outrageous. I just ordered some Karelia and roti from them tonight and I just realized for a veggie meal it’s pretty pricey ($13+)and look at the picture it’s a half bowl not even a full bowl man, and it’s those medium sized bowls not even the full pt size. karela real expensive on liberty or what?"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRMExQdnpBRRAB",
            "text": "This restaurant always hits the spot. The butterfish and spicy wings are a must! There’s a combination plate of white rice, shrimp, crab meat, lamb and half a chicken on the side that is very tasteful. The resturant itself (decorations) is…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGLWRIWlhBEAE",
            "text": "Food was delicious! Drinks were strong and the atmosphere is always calm and friendly.  One of my favorite places for dinner"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvdTVDTGVnEAE",
            "text": "Great food and service also outside dining is a must with good music and obeisance, there chicken fried rice is the best I've had in a long time! This in my top Guyanese restaurants I've visited they really hit the mark with all their dishes I can't wait to do it again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhdmNxTFJBEAE",
            "text": "Great very late night spot with unique Guyanese Asian inspired menu. Staff is friendly and attentive. Next time we will poke our head in to the booming night club that is affiliated with the venue."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtNk5PQWNnEAE",
            "text": "Stumbling upon this place for some late night Guyanese food and vibes was truly a blessing. I would definitely recommend trying the food here. Hands down one of the best dishes I have had the privilege of eating. The staff was friendly and very cool."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbjY2N3JRRRAB",
            "text": "Sadly the food was cold when we mentioned it to our server, she took the platters heated it up and brought it out to us, the chicken was still cold but with rice and noodles was hot...not a great experience"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxX1Ayb3FBRRAB",
            "text": "Never eat here before. Decided to try house special fried rice. Fried rice fine but the chicken was not cooked properly. Chicken had a rancid taste like it was spoiled. Not eating there again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhazUtcVp3EAE",
            "text": "We went party of 8. Not a warm welcome. Messed order twice. Took back the food and replated the dish.\nHad to ask for salad dressing, condiments etc.\n3 stars for food minus 2 stars for the hospitality. 🙄🙄…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMbk1tR2hnRRAB",
            "text": "I order from Caribbean Cabana almost everyday. Their delish ceasar salad (my fav item on the menu) so cheesy, extra dressing and the most crunchy croutons! Love! Their curries are the best paired with a dhal puri! To die for! Freshest puri. And their fried rice or chowmein is classic guyanese chinese style. Hands down fav restaurant! As a vegetarian they have many amazing options."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNveUtETDVRRRAB",
            "text": "The bar section was a bit too dark & overly loud for my taste. When the bartender has to speak into your ear, that's a problem. Their food is good. The roast duck was a bit salty. The chicken wings were tasty and moist. My friends said the jerk chicken fried rice & mixed fried rice were delicious. Overall good service."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpbXF6aVJnEAE",
            "text": "First time going here, and won't be the last! The service was great, and fast. Drinks were made well. Food was tasty... Thank You 😊…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXNE1EaXVRRRAB",
            "text": "First time (2/12/22) at this restaurant in a large group.and I have to say that I was impressed with the food and services.  Food was very delicious n service was very good.  I will definitely go again and recommend this restaurant.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUODZPbnB3RRAB",
            "text": "This was a great caribbean restaurant that me and my wife went to.  The food was amazing, the service was great and the food tasted like home!  I will definitely be back to visit Caribbean Cabana!"
        }
    ],
    "reviews_count": 54
}