{
    "name": "Due Fratelli",
    "place_id": "ChIJ1ePSSCBdwokRkwmtrGE5xSk",
    "grid": "QN9",
    "address": "90-10 Jamaica Ave, Jamaica, NY 11421, USA",
    "rating": 4.8,
    "user_ratings_total": 134,
    "phone_number": "(718) 849-9300",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wa1l6RlNaVzFRYzFweFUyeHlTVVp2VEZWS2IwRRAB",
            "text": "Good"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xb1oxUmxSMVpCZVY5Sk1FeDJURmhhVTFSVFZVRRAB",
            "text": "So good"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205dVlUbFJhSFpKYUUxWGFtTlpTVzVpVGpGVWJFRRAB",
            "text": "If you want authentic New York pizza I suggest you stop by because this is thee BEST pizza in the neighborhood & they even have Parmesan cheese :) The staff is also very friendly! Thank you guys #thumbsup"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOTVRtSlhVMVpZU0ZKZlltaERTazU1ZFRZM1FuYxAB",
            "text": "Chicken rolls all pizza delisious"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gdk5sRkpjbTltTWpNMlgyZFllVE5ZWmkxNWRGRRAB",
            "text": "Calidad sabor y buen trato recomendable"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkSWVGaGxVMFp0WVhGc05FbFNUMmt6YWpGNlVuYxAB",
            "text": "The pizza taste amazing\nTHIS IS THE SPOT IF YOU WANT REAL NEW YORK PIZZA"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCd1l6QXpTV1ZvVmxWa1ozUkRjRnBoTjJ4R2NYYxAB",
            "text": "I can here to eat pizza and it was amazing and I really enjoy it! I would definitely recommend this for other people to come and eat here! 👍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sR01VMXlRV2hVZUVKQmNUbDBOVkZLV0c5MllVRRAB",
            "text": "Amazing food i love it so much my brother and i come here often. Owner is very friendly"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRlIzQkRRM0l5WmxrdFExQm1VMTlXVFY5c2JYYxAB",
            "text": "Those are my guys. There are always very kind... i recommend they have an amazing Cajun chicken slice to drool for. Also good burgers and pastas"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205UVMwcFJhVkJZUVVoTFZEQTFValJNYmxkTlNXYxAB",
            "text": "The food is really good and I come here often and the service is great"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0VU5FRmhNRVJKYjNaMmVtNDVZMFpOY25Gek9XYxAB",
            "text": "The best pizzas in the area, especially the chicken and peppers. The service is fast and friendly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGblNGWjVPRXh5Yld0aFJXZHBPWFJxWkVsdGJIYxAB",
            "text": "Jesus was amazing"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tocVdFUlNUSFE0ZEVoamRsWm9jWEZaU1Y5NVFYYxAB",
            "text": "Recommend 100% best pizza and best customer service ever! Come support!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MUxERk9REAE",
            "text": "Ordered take out here for my husbands birthday very dissapointing to say the least.Would give iy no stars if I couls.The pizza was burned old dough was used.My daughters cesar salad was just a bunch of green leaves.The pizza made us both sick to our stomacks and rude and disrespectful when we phoned to exspress our dissapointment. Today 8/11/2025 ordrlered cheese fries with bacon for my daughter only to find they screwed up the order 3 times.My husband had to go over there and have them fix the order again and again and charged us an extra 5.00 for their screw up.Never again Done with this place maybe close by but cant get an order right.No way and charge you for their mistakes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCbmIwUkpTMXBCWjNoek1FZHFkVU42VDBGeVVHYxAB",
            "text": "Fine pizza"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5S1RUWmtOR1pqTTBGYVkzUnJVVVJwZERKU1VYYxAB",
            "text": "Best pizza ever"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeFkwSnFiQzE0WDNWME5tOVFSRFJyTVZSVWRXYxAB",
            "text": "THIS IS THE BEST PIZZA IN THE WORLD"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWaFUwTjZUMlF4WnpsWlowSnllRmt6VUZRd1MwRRAB",
            "text": "Muy buena experiencia la pizza sabe muy deliciosa, y son atentos, definitivamente lo recomiendo"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoaldUaG1iREZVZFZFdGNsUjFlbEZQYmtaVlgwRRAB",
            "text": "after a long day I always come back to get my pizza here ~ chill atmosphere where I greet the staff, wait, and go home to enjoy a+ pizza ^^"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdE1GUlpTVUpJWkhwc2RVaHNNWE5NWDBscGNsRRAB",
            "text": "Very neat and spacey restaurant in the Woodhaven neighborhood, I bought few slices pizza from them for dinner and they were surprisingly delicious, soft dough,  not very salty and my kids like it."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRMmVEZHlTM0k0V1hkeVYySjJhbGw2VGtKTWNWRRAB",
            "text": "Una atención muy amable cordial y la calidad de la pizza es espectacular me encanta 😬👌🏻"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWSWJtSmhUbWhCTlVSRVFYRlhNbHB4VDBGUWJHYxAB",
            "text": "The Caesar salad pizzas are delicious, the best in the area, and the service is excellent."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneXJyRWZREAE",
            "text": "We ordered from GrubHub. We got a Lentil soup which was excellent, I liked the small potatoes. Then there was the mozzarella salad, which was pretty good, but some of the pieces were unnecessarily large, but it was fresh, and the dressing (balsamic) was tasty. Next up were the entrees, chicken parm and spaghetti, it was a small portion but it was enough for 2 people. The chicken francesse was a large portion and it provided 2 plates for us. The chicken was tenderized and the linguini was a little soft, but it was tasty. I have not ordered from here since De'Leos closed. The food was good and worth another order, budget permitting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIMFAyTHlBRRAB",
            "text": "I really love this pizza. Every time I go to this place I have an excellent experience. The service is  fast. The staff is very polite and respectful. Not to mention the quality and good taste of the food. Thanks Jesus and Andres."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKUldVTnFPVTFpV1Rjd1VUUmxjVlV3U1hFMlNFRRAB",
            "text": "Not gonna lie, I was skeptical at first, especially looking at their pizzas, which appeared pale and average, before they threw it into the oven. I drove from Philly to pick up family at JFK, and took a quick detour to get some pizzas. My husband and I are big foodies, and have been trying to find a decent place for pizza in Philly for many years despite trying everything including the most famous Philly pizzas. On a spur of a moment, we figured since we’re in NYC, why not give it a try. We have been to NYC many times and also haven’t found a pizza place we enjoy. So far, the best pizza we’ve ever had was actually in Korea believe it or not. However, we found this place on google with a higher rating compared to a few other places. They’re under the El, so I felt like I was in back in Kenzo in Philly, and wasn’t expecting anything good. Went in, there was no wait surprisingly since it was 7:30pm, and the staff were super friendly. Price was cheap, $2.50/slice and you get a free can of soda with every 2 slices you buy. Pizza tasted better than 70% of the pizzas in Philly. They were generous with the toppings and cheese. It was not overly salty or bland, just right. My husband and I got the regular cheese pizza, pepperoni, margherita,, and chicken/broccoli. Service was great, the guy even chased after me bc one of my slices was missing and he made sure I got it. It’s not the best pizza you’ll ever have in your life, but definitely has great taste and totally worth it for the price. This tasted better than some of the pizzas I’ve had in some of the top fine dining restaurants in Philly and California. My husband’s only regret was not getting more than one slice of pepperoni since it tasted that good. Overall, I would totally recommend if you’re looking for some great tasting pizza for a cheap price that’s worth the money WITH quick friendly service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyaEtqOHFRRRAB",
            "text": "These guys make the best chicken rolls in the area.  The pizza looks bigger than other pizzerias. I will definitely keep ordering from here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqcXZlYjlBRRAB",
            "text": "Came by tried their pizza with some friends & it’s so good , love the atmosphere very friendly too !! Will come back again for sure ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbDUyQnVnRRAB",
            "text": "The best place to go and has the best pizza in town"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmOTg2dlVREAE",
            "text": "This spot has been in my neighborhood for 20 plus years, I am not sure what they have done however I just had a pepperoni pie from them and WOW it was amazing. My son says it’s the best pizza he has ever had. Cooked well crust was crispy and soft all at the same time and the flavor just as a New York pizza should be 10 stars guys keep it up. Also nice new look!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSc1JrZFdSSGxQU2xCQ1VUZGxNSFJYZEU1R1dFRRAB",
            "text": "Great pizza and really great service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdThmQWxRRRAB",
            "text": "I recently had the opportunity to visit this wonderful pizza place and I must say that the experience was exceptional. From the moment I walked in, I was greeted with a warm welcome and attentive staff who went out of their way to provide…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRM04yTzF3RRAB",
            "text": "This used to be a respectable pizzeria. They had loud Mexican music playing. There was almost no heat in the place so I was very cold and the worst part was the pizza. I ordered a large pie and instead of making one fresh they reheated an old pie I guess they had lying around and it was horrible. Such a shame. I asked if they were new in the neighborhood and they lied and said they had been there for years lol. Go to prima pizza for a real Italian pizza experience. This is more like the .99 pizza slice places in manhattan. Fail!!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMk5VMTVNVXd6TVRWV1J6UmpNekkwYlRWSmFIYxAB",
            "text": "Great pizza!!! And great customer service!!! Yummyyyy"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aek1YVlFlbmRrV2tsWlR5MXhjVFJyV1hjeVZWRRAB",
            "text": "Love going here close by and the workers are nice and respectful the food is great too"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdTRYcm1RRRAB",
            "text": "I decided to give this new spot a try and that was an absolute big mistake. Absolutely the worst. Pizza was more sauce than anything. Cheese and condiments literally slid right off the pie. Taste was mediocre and quality of ingredients were bad, as if they were weeks old. Definitely would not return again. This place used to be good when it was owned by different people."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdTVfVjVnRRAB",
            "text": "la pizza esta rica, orilla cronchi sabroso 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdnBLTFBnEAE",
            "text": "beautiful pizza 🍕 delicious well cooked thin"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdnJ1dXl3RRAB",
            "text": "delicious pizza 🍕 🤤 fresh"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMlBtYTFRRRAB",
            "text": "This pizza place is really good with good prices and the service is great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMaHEtT053EAE",
            "text": "what a tasty thin pizza well cooked 🙂"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidDkzTUl3EAE",
            "text": "Their pizza and wings are so 🔥\nThey are really nice and accommodating. I'll definitely be a repeat customer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyaEwyWnRRRRAB",
            "text": "You guys have the best garlic Nuts And the pizza was amazing and The cashier was very nice.😃"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMOEw3VnRRRRAB",
            "text": "Muy rica la pizza, las slices son grandes y a buen precio. El lugar es muy limpio"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqdTRHQU1BEAE",
            "text": "Todo muy rico 100% recomendado"
        }
    ],
    "reviews_count": 44
}