{
    "name": "Pollos Doña Maria Restaurant & Bar",
    "place_id": "ChIJn6XeWuNdwokRSBB-HoyQQkE",
    "grid": "QN9",
    "address": "93-03 Jamaica Ave, Woodhaven, NY 11421, USA",
    "rating": 4,
    "user_ratings_total": 1021,
    "phone_number": "(718) 805-4000",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pneVFWRm9NV0pHV0hkYWNVVXlUazl6TlUxRlNrRRAB",
            "text": "I absolutely adore this place—it’s one of my absolute favorites around here! The food is fantastic, and the service is top-notch. I especially love their bandeja de entraña!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWZmRGZHhWRjh4TWt0b01ITlpSV0l4VjJnd1lrRRAB",
            "text": "The food is great here. You must try the bandeja Paisa. The Margaritas are the best with patron tequila."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toQk1uTnJhM1JPVlRsU01GUjBlbEp1VVdaeVgzYxAB",
            "text": "WOW! Amazing! The owner Don Ernesto was incredibly nice! He was super amicable and truly Appreciates long time customers. He offered 2 free shots and 2 free drinks to me and my sister who has been coming for over 19 years to this restaurant. Elizabeth the waitress was sooooo sweet and personable, she recommended her favorite drink MOJITO TROPICAL 🌴 OMGOSH THE BEST DRINK I EVER HAD!!!! Best experience!! Thank you to both the owner and waitress Elizabeth for such a warm and welcoming experience! AMAZING!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGZlVWcGxVV2RNYUY5SmQxcHpRWFIzZFRGMFVsRRAB",
            "text": "My second time coming here and the food has never failed to satisfy. Well seasoned meat, ample portion sizes, delicious drinks and friendly efficient service. The menu is varied, but the Bandejitas and Super Bandejitas are where the ideal choices are taken from."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poc2QwSkZSMU5pTmpsbGR5MDVVVlYzV2t0cmFIYxAB",
            "text": "Pedí un Sancocho de gallina grande la sola sopa y viene sin gallina... y parecía mas a una crema de pollo que sancocho de gallina..."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnNWQyWllWRU5wWjJJeFlreFRkR1F4VG1sZlYxRRAB",
            "text": "I ordered food they charged me 70 $ for and I ordered a tres leches wish in the picture they show here is what I expected and the picture below is what I received and they don’t want to give me my money back or send me another cake"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRlVHOVFMVEp1WWpCamJYZEdlRlJwVFZkSFJYYxAB",
            "text": "Food is good and very well portions I would say another for the money food was ready quick also 😋"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGd1JYVkJaME5RYjBaNWEzUXlVV1UwY0U0M04yYxAB",
            "text": "El servicio por parte de las meseras terrible. Se quedaban hablando con la visita y uno esperando a que lo atiendan"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWFVqUmFVbG96VTNOeWFtbGhXWE56VDFaeU4yYxAB",
            "text": "Exelente servicio"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psaldrVnBTR05mYlVSd01VTjVYM0ZZVmsxYVYyYxAB",
            "text": "10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVFJDMHpiRk5FYW5Oc1NIVm9OVkZxUmxjMlprRRAB",
            "text": "This is the best place and the best Food went 2 days back to back with my husband and Daughter"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205amRFMUpWbXBZVjFSb1dWSjFTMUI1ZVVSSVltYxAB",
            "text": "Great Spanish bar restaurant great food the place is clean I can’t complain."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OcWFrUldNbUU1TVdGMWNVOUhUVmRHTkVKamJrRRAB",
            "text": "Great food."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQR0NtNVMyaVlxNnpBRRAB",
            "text": "HORRIBLE !!!! Pedí  un Delivery de una picada,  lastimosamente no me fijé en los comentarios anteriores y está totalmente todo tostado literal quemado , incomible y lleno de grasa , no viene nada de carne , solo chicharrón, plátanos , y costillas , no pierdan su tiempo y su dinero 60 dólares en la basura , además llamo a el mánager y dice que él la cambia que no la toque cuando ni siquiera escucha ni presta atención a las cosas que no están bien de una manera déspota y grosera !!! Ya se me había pasado el hambre para que voy a querer otra igual …. Debería darles pena vender comida en ese estado   Lugar para no volver jamassssss"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNZkdwTFRlOVlXMTBRRRAB",
            "text": "Delicious Colombian food! Very authentic.\nThe chicharrón Is to die for...\nThe staff is super friendly and welcoming."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNGVxVXN3RRAB",
            "text": "A favorite for many years. Great quality food at great prices and friendly staff."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM19yS1h3EAE",
            "text": "Una experiencia excepcional de principio a fin. La comida deliciosa, el ambiente acogedor y el personal muy amable y atento. Sin duda, un lugar al que volveré. ¡Altamente recomendado!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNGEyV1NBEAE",
            "text": "I come here very often with family & friends. Esteban is the waitress that serves us most of the time. He is beyond amazing. Always serving in a good mood with the upmost attitude. The food is great aswell. Thank you Esteban for making it a great time when I come by & is one of the reasons I still come til this day."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJb2ZqRF93RRAB",
            "text": "Excellent Hispanic food."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJLXNHVnF3RRAB",
            "text": "La calidad de la comida ha bajado"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3aGV1ZFJ3EAE",
            "text": "The meat tastes great, but the meat was well done and too chewy. Drinks were great as-well."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3X2RiTVZBEAE",
            "text": "Shady waitors ; they put gratuity and then do not give you an itemized receipt .\n\nKnowing what they do , I don’t include gratuity on already included table\n\nDays later find an $15 additional charge .\n\nPoor management ; unable to help.\n\nNo good in bad business"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MmV2Z3BRRRAB",
            "text": "This is a great spot to be, plenty of parking and public transportation. Food is well priced and the service is great. Love coming here."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRLVByM3ZBRRAB",
            "text": "Muy colombiano ☆"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNl9EdzB3RRAB",
            "text": "La comida y la atención es horrorosa por favor no vayas a este lugar"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndWVhLV9nRRAB",
            "text": "Very disappointed after buy a family combo. Came home after a very hard day at work and was very excited my husband had gotten food for us so that I could get home and rest. What a disappointment when I went to serve this meal. The chicken was extremely cold to the bone like if they had taken it out from the fridge. They rest of the food was of quality but the main thing ( the rotisserie chicken) was bad. Had to take it apart and put it on a pan. Never ordering from here again!!!!!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOWE2N1dnEAE",
            "text": "I went there for lunch with another person and the bill came out to 70 dollars. This was worst food I have ever tasted. The chicken was dry and burn and the rice with beans was served lukewarm.The waitress added a 20% tip that was automatically added to the bill. Do not waste your time and money going to this restaurant,.it is not worth it."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbFphaXNRRRAB",
            "text": "Pedí un delivery por medio de Uber eats el día de hoy 16 de 17 de enero  y la comida que me llegó estaba insípida, un plato de 23 dólares que se supone que debería tener churrasco tenía solo 5 tiras de carne que estaba quemada y toda estaba con mucha grasa; los frijoles eran solo agua y la sopa era puro caldo y zanahoria. Totalmente decepcionada solía ser cliente pero no volveré. Que pesar pero la comida estaba muy fea."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmX3J5c1dREAE",
            "text": "Fue terrible el sabor de la carne ,nos han dado una carne cruda ,sabía a carne reposada por\nMuchos días ,está demasiado feo feo feo ,es mi peor experiencia de comida ,adicional a esto los precios de la carta no están correctos,pedí una parrillada y cuando pedí la cuenta era algo totalmente diferente al precio de la carta 👎realmente es de lo peor 👎tienen todo por mejorar ,nunca más regresaré a este tan mal\nLugar"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmLXNtQlV3EAE",
            "text": "Pedí un delivery que me llegó la comida por fuera porque  no fue bien sellada, no me enviaron factura, los frijoles eran sola agua, pedí una soda de 2 litros y me enviaron una más pequeña cobrándome una 2 litro, llamé a quejarme para que me enviaran la factura cuando me llegó me di cuenta que me cobraron doble vez tip, prácticamente terminé pagando más en tip que en comida. Esto no me hubiera importado siempre y cuando la comida hubiese estado agradable pero no fue así es muy desabrida y sin sabor."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNma2R2VDVnRRAB",
            "text": "La mesera  tiene un horrible  servicio. Se enojo por que no le di la propina  y nos trato mal."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dXBfcVVnEAE",
            "text": "Pongan  cuidado con los precios del menu cuando tu pides la cuenta los precios son otros  y la excusa de ellos es que los menus nuevos no ha llegado con los precios nuevos lo cual no te dicen en primera estancia  que los precios an aumentado  eso a mi no me gusta  es haber si le cuajaba  pero conmigo no me  tuvieron que dar al precio que estaba en el menú no me imagino acuantos les han cuajado por que no prestan atención a los precios  que les estan cobrando para mi muy deshonesto de su parte la comida pedimos la parrillada la carne estaba cosinada arrebatada so por dentro cruda  muy bland  no teni sabor  la chuleta nada que ver  lo unico rico fueron las tostadas con chicharron  en resumen vean su recibo la parrillada me estaban cobrando 76y pico cuando en el menu aparecia 74y pico y la chuleta empanada 20y pico y me cobrando 21y pico  so oko pelado"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQb19xVktnEAE",
            "text": "Best colombian food in queens"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQZ2RMVlhREAE",
            "text": "Excelente ambiente platos exquisitos, y muy buena la atención"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVN19lMzhBRRAB",
            "text": "Always good food and good service nice like always people friendly"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYd2FqWWJ3EAE",
            "text": "Las empanadas muy llenas de aceite, la parrilla me gustó bastante carne súper bien asada pero no concuerda los precios que están en el menú con los que llegan en la factura , así que deberían colocar los precios reales, ya que ningún precio del menú concuerdo con lo que me cobraron"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuaTRTR2hRRRAB",
            "text": "Carlos and the weight staff are excellent. The food is great and it makes me feel like I’m home. had lunch there about two weeks ago with my niece. She loved the place and I tell her it’s my go to spot whenever I feel melancholy. The music is excellent or Columbian. It’s just great and like I said they make me feel like I’m home."
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNN3UteVFREAE",
            "text": "Sitio agradable. Pero no me gusto que  se tenga que pagar un sobrecargo por pagar con tarjeta de crédito."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3d2RHNnhBRRAB",
            "text": "Typical Colombian, Excellent food, service and reasonable prices. Great daily specials. Like always great fresh juice to order\nTry it you'll be back. Right under subway stop 🛑"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaXBpT0tnEAE",
            "text": "Great casual place with good food. I tried the salmonand it was delicious 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxc19mVEhnEAE",
            "text": "We went by for another restaurant but decided to eat here instead and it was a great decision.\n\nWe tries the bandejas, which were absolutely delicious. The chicharron was perfect and very nice service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUbjhLTkFREAE",
            "text": "Very delicious and authentic Colombian food. The meat was very well seasoned and everything on the plate tasted fresh. I also recommend the frozen lemonade."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwaTdUQnh3RRAB",
            "text": "Quaint family type restaurant in Queens, serving Colombian food. Service is wonderful. The only setback is that there is a charge for using credit card. There is street parking and it is close to the J Train. There are daily specials and delivery available as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURyOHFZSRAB",
            "text": "We had the parillada de carnes , bbq meats , let me tell you something , what a delicious y amazing tray. The chicken is special season by the chef. The service by the staff and owner is top service. Thanks for amazing diner with my family."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtMGZiSFNREAE",
            "text": "Fast service and huge portion sizes! Taste was kind of average though, to be honest. And I think they screwed up the final price of check in the end, but I’m not 100% sure and I would give them the benefit of the doubt anyway that it’s just a one off thing, so no stars off for that."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVMVotNFlnEAE",
            "text": "Low key place right on Woodhaven and Jamaica aves. The carne asada was to die for. Charred just right but still tender. The drinks were good and beers were cold. Had a great time there with the music playing in the background. Definitely worth a visit if in the neighborhood."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtcV9QbEJnEAE",
            "text": "Ordenamos a domicilio una picada y el sabor desagradable. La comida no estaba fresca y se sentía sabor a aceite rehusado. La carne estaba dura y el pollo de un aspecto y sabor terrible. Duro y amarillo. Adicionalmente todo sin sal.  Nunca recomendaría comer allí, al menos una picada"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtLXVHWVdBEAE",
            "text": "Buena atención al cliente. Comida deliciosa y ambiente tranquilo y familiar"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtcS11eUV3EAE",
            "text": "The picada is old, the beef is dry and the chicken in there tastes like it was fried with oil fish or similar, it has a funny weird taste. Definitely not a place to recommend"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTNzZiYWNREAE",
            "text": "Food is good and big portions. I had to cut up the steak and chicharron to make it easier to eat."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxcDRXWHRRRRAB",
            "text": "Service was okay. It was hot because there's no a/c only fans. The food was good. My friend and my son didn't enjoy it. I was happy with my piña colada."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzNjR5YnB3RRAB",
            "text": "Wow! the food was amazing my wife and I enjoyed the food very much great service"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwbjhDR1FREAE",
            "text": "My first time in this place and i loved it, the food comes very fast :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOaWNuS1RnEAE",
            "text": "My son enjoyed the steak, and I opted for grilled chicken with rice, beans, and a perfect salad at our favorite local restaurant. The waiter was delightful, providing excellent service that made us feel at home. The food was delicious – hoping the same cook stays in the kitchen! 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0Nm91cDBRRRAB",
            "text": "The food was so so and some of the food wad a bit cold, when I received the bill they charge me a convenience fee of 18% of what my bill was and a customer service fee for using my bank card, when the bill was all summed up, they wanted me to pay another convenience fee for a tip of 18% I did not pay an extra 18%. That is crazy. This place has become ridiculous with prices. I can see why the place was so empty. I’ve been to better high class places great food great atmosphere and never once was I charge as much as they charge me in Fee’s and I’m a great tipper, but this was ridiculous. Will not be returning ever again."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3cUpiRkpnEAE",
            "text": "The steak is good but the other dish i order which is a steak dish also they should put more plantain on my plate not only two"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiam9LRUlREAE",
            "text": "Exelente lugar muy Buena  comida."
        }
    ],
    "reviews_count": 57
}