{
    "name": "Neir's Tavern",
    "place_id": "ChIJj6Zpx-ddwokRm5R41uLVdJI",
    "grid": "QN9",
    "address": "87-48 78th St, Woodhaven, NY 11421, USA",
    "rating": 4.7,
    "user_ratings_total": 1034,
    "phone_number": "(718) 296-0600",
    "reviews": [
        {
            "date": "수정일: 8시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxa2FFbEZSVk15WmtSNlNWWkRTMHBJT1hoM1RYYxAB",
            "text": "Love having a Goodfellas spot right down the block. The place just feels like real Queens history with great food and good people. The Neir’s Famous Goodfellas Burger is incredible, juicy with those crispy edges that make you want another one. There’s always something happening too, from trivia to live music, so you never just stop in, you end up hanging out."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSa2EyUkJYM2wyY1hkT1owTkpiMDlrUWxNeGJVRRAB",
            "text": "Was there yesterday for the first time with my brother. Good Food Good Atmosphere Good Memories"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsMmNYcE5SRU0zTVhad2VWcElZelZuUTI5VFpIYxAB",
            "text": "No buybacks and I tipped every round. Don’t bother coming here"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSaVEzTnpUM0F6UzA5bllYVk5jbVJTTWtSck1sRRAB",
            "text": "Because it's iconic, and I was here, and a young lady was wearing a fair coat.Who did not realize the irony that in the movie goodfellas carbone was tossed out of the bar by Deniro Because his wife was wearing a fur coat and later was killed due to it.\n\nLive Jazz followed by karaoke"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNFFtUkxTRUk1WlhoVk9IcEtaMWN3ZFZkQ1QyYxAB",
            "text": "Neir's Tavern has been around forever. You forget how great it is, and then you go back there.\nGreat food, pub atmosphere. The\nFried chicken sandwiches are dripping down your arm, and the French fries were crispy and perfect."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNFdrcGxVelowVUVkT2VYVjNRbmhYY2xGQ05tYxAB",
            "text": "My all time go to food is Caesar salad so I can only judge that food wise and it was amazing! Paired with their Pinot Grio and French martini. I really enjoyed my solo experience here. I would highly recommend for comfortable, neighborly vibes but I also wouldn’t recommend because I don’t want y’all to make my new spot too popular"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJdFJXOUhjemt4U21ObFlVRk5hRGRPZDNZNGVWRRAB",
            "text": "I took my spouse, brother in law and sister in law there for an overdue group date night...we had a great time, great food, great comedy show just a wonderful evening.  Place isn't to big but we were sitted comfortably..the patrons and wait staff were fantastic.  Due to my own personal beliefs I didn't like all the comedians but overall a great show.  My favourite were Aaron,  Momjombo ( I'm sorry if I misspelled your name) and the last lady who resides in NJ (my condolences). The comedy host was fantastic and very polite too.  Food was delicious.  We had pretzels, wings, fries, burgers, sodas, beers and mixed drinks...not super expensive either.  I believe this will be our new hangout spot.  Although parking is terrible."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMFJXODVTekJSUW5kamVFbEpTelZ3VEhoSE9VRRAB",
            "text": "Great bar, great food and great staff!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxNE5lOHNRRRAB",
            "text": "2025.  Good staff, good spot but way 2 expensive,  if you got the money go for yours. I still go when I have the extra bucks."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xadGIxZEpiV2xpZFhoRFNua3hhMlJSYm1aa1JWRRAB",
            "text": "“Goodfellas”, being my favorite movie, “as far back as I can remember”, it is sad it took me this many years to take the drive to this local Woodhaven staple.\n\nPlace is definitely for locals, but felt just as welcomed as a newbie at this bar.\n\nMy father and I came for a beer and quick bite. Server was friendly, attentive, suggested what food bar was most notorious for (cheeseburger) and served a refreshing IPA.\n\nThe cheeseburger which I had no expectations of was very flavorful and delicious. Lives up to the bite!\nThe two with a side of Mozzarella sticks ran us a little around $30 which is great considering the history this bar has .\n\nComing from the city, Neir’s is worth the experience, especially if “Goodfellas” is one of your faves and you idolize the OG traveler Anthony Bourdain like myself.\n\nCan’t wait to go back next time in Queens!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGSVFXZEZObU5mVVZoS2NFcEZOVkJqTWxKTmJFRRAB",
            "text": "A real old school neighborhood joint. Been there forever. Both a local joint and a tourist spot. Good burgers.  Cold beer. Street parking only and its tough to find a spot."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Od1dXSnFUR05uVkRaWFFscGpaRGswU2pONFlXYxAB",
            "text": "Staff is attentive and courteous. Food is always delicious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4cGJYWTVkbW8yYm1rNU4wSjRTbWxxTFhOUGVsRRAB",
            "text": "i love this bar! little local spot. good bar food. great prices. friendliest staff in NYC. oldest bar in Queens? spot by...you won't be disappointed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScWIwOVJhR1kwTW10WFdUTmFNbmMwTFhablpGRRAB",
            "text": "Very good food.  OMG\nI was living New York for 5 years\nbeef burgers was so tender and Juicy."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNNU5qRllkMUUyVGpkWVNtTlVaV1ZRYjNaNFpYYxAB",
            "text": "very unfriendly vibes here"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREX08tYi1RRRAB",
            "text": "Great food, fun place, great karaoke night. Friendly folks. Ice cold draft, the best!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214MlFrcFVaR1EwT1cxVVZtTnNRV1pwVkdabFJHYxAB",
            "text": "Our first time at Neir's and had a fine time.\nWe had cheeseburgers that were done perfectly. I had seasoned fries and my wife had sweet potato fries, both were excellent. We arrived before the Friday dinner rush but the service was spot on."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KU1NIaGlRMFJHTVZwcmQyeDZiMmxDUzJwM1NYYxAB",
            "text": "A little slice of history right there in Queens."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xneVFsTjVjREZPVGsxNVpYUmFNM1o1WDJKR2VVRRAB",
            "text": "Good Guinness...and their French fries are AMAZING"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CdVdqbHJUbkZOUkZsSVYxZDZNMWxMVlc5WGNXYxAB",
            "text": "Went there to play beyblades and eat. Wonderful place. Nice people and great atmosphere."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoa1EwTTVVVlZ2WnpsaVNYaFdRMFpKZFhodWFrRRAB",
            "text": "We had Dinner last night I just want to say we will definitely come back, we sat down outside because there was no space inside but Lu was there from the beginning until the end taking good care of us, the service was excellent the food was really good, we had a great night. thanks!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkMFJ6azVTbEZhTW5wSGVtSjJWVEZrTFV4ZlprRRAB",
            "text": "The staff are wonderful; food is delicious and ambience exceptional.  Thank you Neir's for staying open for a piece of history in our backyard ; )"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTWVsUjNSR0pQZG5ZNVNHaGpWbFpmTFdWUk9WRRAB",
            "text": "The burgers are amazing"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVlIxZGhYM2RhTkVSTVVFb3dSVkJZVURCU2RVRRAB",
            "text": "Great place to have a drink and dinner."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkT1JtZzJVVEZxY0VkNFNEUTFRamRXTVc1VE9XYxAB",
            "text": "Yes, this was the setting of several of the best scenes from Goodfellas, and maybe that’s why you came, and if so, you won’t be disappointed. But it’s also the kind of cozy, friendly neighborhood bar that you don’t find much anymore, and that’s an even better reason to come. The coldest beer in Queens, top-notch pub grub, and a great staff. You’ll love every bit of it!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prMldWaHFVQzFNU0U5RVlrUTNPRXBsZFc1MFpHYxAB",
            "text": "Classic Burger was fire.\nSo good I ended up buying a 2nd burger 🍔 on the spot. Very good 👍🏼 👏 👌"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twQ2FqWjVUbW96TlRCc2Nra3lRbEpGUVZveGNWRRAB",
            "text": "I loved the service and ambiance of this historic tavern/bar I visited on my way to the JFK airport a few days ago. 😊👍\nSince my friend and I were short on time, we just had drinks, but Im definitely going back for more drinks and food on my next visit to the area. 👍😊👍…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25STldXVXllV1V0VTNBdE5GOTFSM3BaV25aMU5uYxAB",
            "text": "An amazing piece of history! My family and I visited here and it's definitely as described! Also they have the coldest beer on their tap system!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdWFWZHFMV1JEY2xoSk5HUmFNVVkwUkhKbmNGRRAB",
            "text": "Great food with superior service."
        },
        {
            "date": "수정일: 3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPV0drcTJQNnF1aWdnRRAB",
            "text": "Delicia de lugar para disfrutar entre amigos"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlb2ZLNkhBEAE",
            "text": "We had an early dinner and stayed for the Karaoke with Chris. It was a very fun night. A couple we met the week before at dinner came back and reserved 4 tables with friends. They ate and stayed for karaoke too. Every table was filled tonight and we turned it into a sing along.... so much fun!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkZmFuSTBSVUo1UW5CTE9URmtaSE15UzJOUE5FRRAB",
            "text": "Not enough stars here to say how great Neir’s is.   Today, tomorrow, EVERY DAY\nTop notch from food to drink to staff.  And the atmosphere     A must visit     Highly recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RMGJXcHBOamRpTWxwS00zZEdPVWhPUnpFd1RsRRAB",
            "text": "My single favorite bar in the world!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsM1YwMTFja2RHTlZOUmRrdEpNR1poZUdVNWJVRRAB",
            "text": "Great place, great people! Road to 200! Food and service are excellent! (So is Karaoke 😉)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214R1EyaFRRMncwWTA4MWJsUlRjekJ6U0daMWIwRRAB",
            "text": "Love the genuine old look of the place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSTFRXVjZTMmRsUkVOQmVFRlJUbFZCV21kTGFYYxAB",
            "text": "I went for open Mike night.  Lots of fun.  The sweet potato fries are the best."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25scU1uaGxNM0YyWHpGTVNucDJjSEZIVjNCWmMyYxAB",
            "text": "Came here with my wife and friends for my birthday as I am a huge Goodfellas fan and have been wanting to go. Firstly, the bar itself is awesome, with photos hung on the wall not only depicting the significance of their relation to the Goodfellas movie but also the history of Neir’s. The staff and owner were SO nice speaking with us about the bar and its history. On top of this, the food and drinks were amazing. I give Neir’s my absolute highest recommendation!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twSlZtUkxjbkoyTW1aTWIxaFZPRlJpVVdGV05XYxAB",
            "text": "First time going and we will definitely be back. The food and service was excellent. Best chicken nachos . Amazing.  Ice cold beers ,the bartender was very nice explaining the movie scenes shot in the bar. Nostalgic"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xscFJWWTNiR1pMUnpSVmFHeFRUMkpWUnpGRVIzYxAB",
            "text": "Es el bar mas antiguo  de la ciudad de NewYork,  tiene una gran historia , además de llevar ya casi 200 años ,incluso está dentro de los bares mas antiguos de los Estados Unidos,una trascendencia a través del tiempo importante para la historia.\n\nEn cuanto a las bebidas puedes pedir cerveza   de barril o en botella , tienen cócteles pero la manera un poco antihigienica por parte del bartender deja mucho de que hablar en cuanto a la preparación de los mismos.\n\nTambién  puedes pedir comida, ideal para ir solo, con amigos , en pareja.  En fin lo mas interesante es conocer la historia detrás de este famoso bar."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJclpvTVR5cm9mTnB3RRAB",
            "text": "the  atmosphere were amazing. This is the best place in earth for me"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3b3JTcm5BRRAB",
            "text": "For as touristy as you would think this place is, I think we were the only tourists there. It seemed like just the local tavern to the neighborhood folks. My fiancée said she enjoyed her margarita here more than at The Campbell at Grand Central. Happy hour deals. Plenty of history. Good service. Fair pricing. Definitely glad I made it out here."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNVptRXp3RRAB",
            "text": "Had the pleasure of stopping here last night. Food was really good and loved the atmosphere. Pretty empty besides people at the bar but what would you expect for a wednesday at 7:45 which honestly was perfect for us. I had the chicken sandwich and it was stacked! Chicken was super crispy as well. I also had the thai chili wings and they were delicious as well. I am not a huge fan of queens but id come back for this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxd2JXWTVBRRAB",
            "text": "Loved this old fashioned tavern.  It's been around since 1829.  I loved the decorations.  The bartender, Michael, was great.  The people were nice.  The food was good.  Prices are reasonable.  They even had live music.  It's located in a quiet residential area.  I will definitely be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCZlZEZFNlRVpvTjNGcU1VNWxZVXN6WlhwV2NuYxAB",
            "text": "Great service and delicious food. I ordered the Thai honey wings with fries and they were absolutely amazing. Great service by the staff!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHXzRLaW9BRRAB",
            "text": "We had our celebratory medal Monday dinner after the NYC marathon as our team knows the owner. But it was first time for me & to my surprise the food was amazing. The burger & chicken wings were hit. We ordered the chicken wings 3 times. The server was very nice & friendly. They have both indoor & outdoor seating. Didn’t know good fellas was shot here."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXNDhiX29RRRAB",
            "text": "UPDATE (Sep 2024): Even though I ate here a month ago and still love their food, I cannot eat here anymore after seeing that they have a B grade from NYC Health and read online why they received that grade. Until things change, I will not be going back.\n\nORIGINAL REVIEW (2022): Finally visited after wanting to come here for a while and was not disappointed. Prices were fair, food was good, and the atmosphere was pleasant (although I DID come at an usual time: Sunday at 9pm).\n\nInside was smaller than I thought it would be, but I liked it. It has a nice \"taverny\" feel and also a couple TVs for entertainment. There's a bar, but also ample seating area so it can definitely be a family-friendly dine-in option for people in the area.\n\nIt's not too far from the J train so the location is also convenient to people who don't live in Woodhaven.\n\nAs for the food, I really liked the wings and fries. I ended up getting two orders. I also tried the fish and chips, but I wasn't a huge fan of the fish because it had too much batter which didn't seem to be thoroughly cooked, but other than that, it was pretty good.\n\nAlso, something to note is that the drinks were a bit... odd. Ordered a coke and ginger ale for the table, but it didn't taste like Coca-Cola or a popular brand of ginger ale. They tasted like a generic \"cola\" and \"ginger ale\". They weren't BAD, but I wish I knew beforehand that Neir's didn't serve Coca-Cola products if that were the case. If they WERE using Coca-Cola products, then their soda machine was not mixed properly cause the drinks were definitelyyyy off.\n\nOverall though, it was a good experience and I will definitely return. Our server, Joseph L was also pretty nice and attentive."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbFlicEhnEAE",
            "text": "Had a blast, Great history and a must for any Goodfellas fan. The atmosphere was relaxed and Mike the bartender was friendly and very helpful. The Goodfellas Deluxe burger was outstanding and while your enjoying a drink and great food you have Mae West and Goodfellas history to look at on the walls of this almost 200 year old Tavern (One of the oldest in the country)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsNFBtM1dBEAE",
            "text": "Neir's is one of the last landmarks that still exists that was used as a location in the movie Goodfellas, and it is approaching it's 200th year, meaning it is technically the oldest continuously operating bar in New York City. But bars are made and lost because of bartenders. Nobody wants a drink, no matter how good it is, served by a pretentious, unfriendly, bartender who thinks himself above the people he's serving. Mike is one of the best bartenders we've run into in a long time. He chatted us up, made great cocktails and recommended great beers that he himself orders. No attitude here. He shared the history of the bar, told us all about the Goodfellas scene and how the filming went down, and kept the conversation rolling. The food is also very good. Try the Wise guy cocktail with the Goodfellas burger. Yes, it panders to the marketing aspect of the bar, but both are outstanding. As out-of-towners we're jealous we don't have a similar neighborhood bar to call home. If you're a person interested in pop culture history, Nier's won't disappoint. It's a must stop when you are in Queens or if you're just touring through the borough and need to stop for food and drinks along the way."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcWVTZVNnEAE",
            "text": "The place has the history of being 195 years in business and the feeling of 'Cheers' (charming, friendly)!\n\nThe drinks were great, food was delicious, and the charm of a Tavern!\n\nThe Goodfellas Burger, Fish & Chips, plus the Onion Rings were really good!!\n\nI look forward to being a regular!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURueW9uXy1BRRAB",
            "text": "Cool little historical place to grab dinner or brunch especially if you’re a fan of the film Goodfellas(some scenes were filmed there).  Definitely has an old school vibe, I think it’s the oldest tavern in NY.  Food and service were also great as well, crispy fries!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdThfM0p3EAE",
            "text": "I went to this beautiful restaurant yesterday the staff was nice and friendly serving me and someone I know. The staff who told me more about the place and the history about it I find amazing. I will come back for sure when I get a chance to. recommend it to anybody"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcnNDc3JnRRAB",
            "text": "Joe was very good, helpful with advice and attentive. The cocktails were tasty. The Thai Chili Honey Wings were standard. I liked my Fish 'n' Chips and she liked her Famous Neir's Burger. They have a new menu (photos attached) which eliminated things that I wanted to try."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvanZlaGJnEAE",
            "text": "We made a last minute reservation and they were hosting a bingo night but they found a table for us and they were so kind! The food was great (probably the best chicken of my life) and even if we were just tourists from Italy we felt like locals. If we come back to New York, we will definitely come back to Neir’s. Thanks!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveTgzRzBRRRAB",
            "text": "For being the oldest bar in the city, it’s a must for tourism or watching sport events.\nTottally recommend it!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtM0xyaUdBEAE",
            "text": "The food and vibe at Neir’s is amazing. Such a local hidden gem in Woodhaven, Queens. The drinks are flavorful and strong. The owner, Danny, makes sure all customers are satisfied. Amazing hospitality and service. Ambiance is very cozy, great hangout spot!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNHBhbE5REAE",
            "text": "What a great neighborhood place with a history that dates back to 1829 and key scenes for Goodfellas were shot here.\n\nBartender mixes a mean old fashioned and the burgers are great.\n\nWe loved it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2c18zazhBRRAB",
            "text": "Omg I didn’t know we have this good in the neighborhood! Good delicious burgers! I ask for medium but was more to the medium well side, but was so good that I didn’t complain. Chicken sandwich? So tasty and juicy. Real crispy fries! Good good good!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUcVpIRWJ3EAE",
            "text": "Beautiful venue, lively entertainment and delicious food. 5 stars all around."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxLUtEOWxnRRAB",
            "text": "Neighborhood Tavern with lots of layers.\nFood is typical pub/restaurant fare, but done excellent, fresh and tasty. Drinks are fairly priced, with a selection expected for a smaller kind of pub.What makes it a stand out is the inclusiveness of the crowd, the staff treating you like a long awaited friend and the awareness of the history of one if the oldest taverns in the US.\nCan't wait to be there again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0aFB2MXJRRRAB",
            "text": "I'd love this place just for the coziness and history, but on top of that the burgers are great and so are even the cocktails! Hoping to make this a regular spot."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzLU5laUhBEAE",
            "text": "We went to Neirs for Lunch on a Saturday afternoon. Their was a big hype about this place since it was supposed to close the doors after over 150years of buiesness .\n\nUnfortunately we still came in Brunch time ( till 4pm on weekends) because I really wanted to see their dinner menu.\n\nWe decide to stick with a Burger. The waitresses ask how we wanted to like the burger cooked. But by the end this didn’t made a difference is was cooked mega well done.\n\nBut everything was really really tasty. On tap are American staples.\n\nIs great little neighborhood Bar to hang out with friends, watch sports and have a cold one ...\n\nIs not a fancy place but is a place with a great wipe of friendship and community! I would recommend it to everyone and will be back for the dinner menu one day :)\n\nThanks for the hospitality"
        }
    ],
    "reviews_count": 61
}