{
    "name": "Punjabi Dhaba (Original 2006)",
    "place_id": "ChIJHYl05r5nwokRnVI8bDLjchg",
    "grid": "QN9",
    "address": "119-16 101st Ave, South Richmond Hill, NY 11419, USA",
    "rating": 4.2,
    "user_ratings_total": 986,
    "phone_number": "(718) 487-8002",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsNFZYQTNTRkpoY0MxT01FaHNaMWMwVVZJd2NuYxAB",
            "text": "good"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNelYwd3hTbGRVTFdkUk5rZHZiWFJGYmtvNU1sRRAB",
            "text": "Very beautiful delicious sweets and foods here ..Indian foods very taste and quality food"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oYVdYTnZUa2gyVEhGNVEzZHlRa0pZY0doZmIxRRAB",
            "text": "Bery bad, no tissues, no water, no service"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkNlIwd3lkRE5NVlVOeGVrMUhhVlZsYzNSVFZHYxAB",
            "text": "Had dinner, dined in, did not order dessert or pastries, of which there were many.  The food was amazing - I wish I were more educated in the nuances of Indian food, but it was like little else i’ve eaten in the US.  Vegetarian! Not expensive."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKZmNIQkZSRkpwUjBFd04xOXNZVzlKT1VoVGIyYxAB",
            "text": "Very delicious food and served with lassi that makes to digest food even much easier. Very tasty with reasonable price."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kSE5VZDVjR3gyYTNvMldqZFdTM05HUlZVNVJXYxAB",
            "text": "Such a delicious food and staff treat customer very well."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vemIyMVVabGREVm1KaWRXTk1XV1ZhVEdseFZVRRAB",
            "text": "Don’t buy kaju katli i bought it was tasteless nd also not pure kaju katli its mixing nd also when u eat u feel like kudwa pun much better buy somewhere sweets some sweets are good bt not at all don’t waste ur money everywhere is same price she will not give u a free 🙌🏻…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSmQxVlFObWh0YVhoRUxVMVFaMkZoYzA1M2VsRRAB",
            "text": "Fantastic"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGS09FWlFXRUZDYUhkSE56Wm9kbHBXUjBGNVoxRRAB",
            "text": "One of my favorite places to eat when I'm on the area, their talk lunch specials are to die for, their Saag Paneer is seasoned to perfection, and the atmosphere alis warm and inviting, a cozy sort of joint."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWVJHazJTbVV0TkRBd2VXRlJSamN5VjNoSFNVRRAB",
            "text": "My all time fav food like home aunty ji on front she so good and nice I feel my mom from her best food simple home food no one else challenge them really OG know what is this place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205clYzSktMVmxRYTA1MGRYcERPVlkxWkZwWGQzYxAB",
            "text": "What is a very release number one service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WUGJHTXdlR2xXTkdsbWIwWklSV0ZwVWxRdGFXYxAB",
            "text": "Food was Great"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxeVVpMHRhbTlqTUZSRlZIZHNkR0ZXTWpWM1FsRRAB",
            "text": "Taste change!Vary bad quality."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5eVVra3hZMVJOZGxnelVFeFRhMlI0V1dkNFFXYxAB",
            "text": "I  order veg biriyani it was horrible not good at all i was feeling hungry at night and i order food i didn't  eat also  my money gone waste i want refund or you have to send me good food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSSmNWWXRUVEZGTUZSQlNrMDNlbkZGTjNsUU0yYxAB",
            "text": "The worst food i ever had in my life.it is just over hyped ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213eGRWZDVhblUxV0d0eVZUSkpjbmN3WlRSSlUwRRAB",
            "text": "Really good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOU1ZYVTJkMkl6VVhKMk1YbEJWalZDV1VGQmJtYxAB",
            "text": "Tasty food with affordable prices."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SUlJXbE9VazVNWTBoNGJ6STVOR2hWUWsxb04xRRAB",
            "text": "Best food I had in states so far."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjM2RFaExhbXRyTVcxdFRWZGtTa0pOY2poeFdtYxAB",
            "text": "Good tasty food with little hot spices"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnd09YbE1Wa1JUUVY4NFRHOHRlVEZEVVhoclNrRRAB",
            "text": "Food is very Delicious & I recommend to everyone come here for food."
        },
        {
            "date": "1달 전",
            "language": "hi",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSR04zZEdXREpyWkU4eVFubG9ZV0ZJUm5wNE5XYxAB",
            "text": "Jabardast ❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Oa2FUSnZTbTVvU3pGNVkxVm5ZM2gwVkVjd2JHYxAB",
            "text": "An excellent Punjabi place in the neighborhood with delicious sweets, breakfast parontas and especially the Saag and Makki di Roti!!\n\nWe have been going here for many years and love it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKNlJEWXhiVVEyYlhCaFJFWmpWRk5HYUhOUmNHYxAB",
            "text": "Very bad service of thali"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SZlUweDVRbVJWV2xSbmJHNTZZM1ZoYlVodmRuYxAB",
            "text": "Takes forever for ANYTHING here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5bFgweHdiM1JXYkRKUlJVZzFVRk5GVUUxMFdsRRAB",
            "text": "I had an amazing experience at Punjabi Dhaba on 101 Punjabi Ave! The food was bursting with authentic flavors — from the perfectly spiced yellow Daal to the fresh, fluffy naan. The staff was warm and welcoming, making me feel right at home. The portion sizes were generous, and everything tasted freshly prepared. Definitely my go-to spot for real Punjabi comfort food!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wT1JsRTBjSFU1TlZoQ2RYSTRWRGgxUjJGWVlXYxAB",
            "text": "best food in NYC"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205TVpXUlBVVFppWjB4a1pqVlJjemgwY1d4UlFVRRAB",
            "text": "I got overcharged for spoiled food. The customer service here is so bad. I got overcharged for spoiled food because of a mistake on the shop’s end. I put in an order for a tray of malai kofta and was told the price is $55.  Told the lady who answers the phone that we will pick it up at 2pm tomorrow. We called at 12pm on a Thursday and this lady decides to go ahead and get the order ready for 2pm that same day. Like, what? When we went to pick up the order the next day, they overcharged the spoiled day old food for $65 instead of $55. So basically, they overcharged me AND gave me spoiled food so what did I pay extra $10 for? Refrigeration charges???? This is the reality of Punjabi restaurants. They don’t care at all and would blame the customers than take responsibility."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cc05raEpPVmhVZUV4WGRXWTNUemhFT1ZCRVEwRRAB",
            "text": "Bad service :"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KMFdIVklTWGhmWkRsWlJHTTVMVlIwUVhKSk1FRRAB",
            "text": "Very bad service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkV1RGUmlPRk5ZWVhOcFJUTnBUVU5QUzFoZlRIYxAB",
            "text": "The food at Punjabi Dhaba is really good! The dal makhni and shahi paneer were absolutely the best—full of rich flavor and perfectly cooked. They also serve a complimentary lassi that is mind-blowing—it gives a true and amazing Indian taste!\n\nThe gulab jamuns were soft, sweet, and very delicious. The butter naan and garlic naan were soft and fresh, just right. However, the plain tandoori roti wasn’t as good—it was too thin, hard, and chewy, which made it unpleasant to eat. Also, the laddus didn’t taste great and could definitely be improved.\n\nThe chole bhature are also highly recommended. They have a subtle yet rich flavor that makes them really enjoyable and satisfying without being too heavy.\n\nOtherwise, it’s a very nice place with great food overall!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nelZHZGpYMXBEYWpkSlNHTnJibU5aU1VKMFVVRRAB",
            "text": "Excellent Pani Puri. We really enjoyed our meal. Perfect on a hot day!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nNFpsWlZObXBWT1dWd1ZHeHNZVGhSUTI1TlQwRRAB",
            "text": "We were super hungry and the food was so delicious that we totally forgot to take pictures!! We ordered paneer pakode and jalebi(which were okish), chole bhature(really good), dahi poori(very tasty), salty chaach(kind of unlimited supply) and Noodle Burger (which was just AMAZING)…  my cousin lives in Boston asd he was so impressed with the food that he got packed 4 vegetables and 1 biryani. The quatity was super large (like almost 3 bowls in one container) while most items are priced at $12-13. Must say I have had good punjabi food after ages in New York. This is definitely my to go destination for food again…!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OdE1GcGxka0p0Y1dGclNqWkZhbmcwYjFOblMyYxAB",
            "text": "Very Authentic customer service but makhan (homemade butter) and free butter milk made me over come it… very nice delicious quality foods here"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSc09UY3hkVkE1TFZWVWQySkJhR1pZWjBScVIxRRAB",
            "text": "Nice foods …🥘…. Attractive place"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJT1o2ZnlXamNPeFB3EAE",
            "text": "Really good food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMSExvY2FybnJ5LWd3RRAB",
            "text": "It's ok, could be a bit more delicious though!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210M1N6Vm5OR2N4WDB0UlJtcERkV013UkhKVVgwRRAB",
            "text": "Amazing"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOdVlqSUQwdFpqcjR3RRAB",
            "text": "Good food"
        },
        {
            "date": "5달 전",
            "language": "ro",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJcWYzNjdWZ0l2VHl3RRAB",
            "text": "desi taste"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLX0VqYlNwNG9DWTBnRRAB",
            "text": "Not good"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdFp1SUxBEAE",
            "text": "I'm Pakistani and I had a craving for Halwa Puri but I couldn't find a place that had it so I decided to go here for chole bhature. I was not expecting too much but it was one of the best meals I've had. My husband is American and doesn't like Indian food that much but as soon as he took one bite he was in love. His favorite dish was the aloo tikki and chole bhature and the chia was amazing ❤️❤️❤️❤️❤️❤️"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMC12UXB3RRAB",
            "text": "My mom and me had multiple meals in 2days and it was worth a place to go back and have authentic Punjabi food. Food was fresh and like home made. My mom didn’t any other place in last 4 months but this one. Can’t praise enough about this small n cozy place. Everyone was very friendly and accommodating. Food was amazing. If you are in this area I would recommend going to this place. Sweets were fresh and so yummy."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOdmgzWk92M0o2RjZRRRAB",
            "text": "The food here is incredibly authentic and absolutely delicious, it truly tastes like home to me.\n\nThe Thali was spectacular. Every dish was perfectly spiced, and the cool, creamy buttermilk was the ideal way to wash it all down.\n\nThe Dahi Bhalla was a beautiful balance of tangy, spicy, and sweet, with cold, soothing dahi. It was generously topped with onions and potatoes, adding both texture and heartiness.\n\nThe Moong Dal Halwa was a standout, it wasn’t cloyingly sweet, but delicately tender and moist. It tasted divine, like it had been made with mother’s love. In fact, every dish felt like it had been prepared with genuine care and warmth.\n\nI’ve also tried the Chole Bhature and Mooli Paratha on previous visits, both are excellent and highly recommended."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMDdxcXBnRRAB",
            "text": "This place is a hidden gem with delicious food. An Indian friend recommended it and we were the only non Indians eating there. The food was fresh and and delicious. The restaurant is super casual and you order at the counter and then they bring out your food. Service is a bit slow but worth the wait. The place wasn’t too busy on a Thursday around 7pm, but after 8pm it was a nonstop stream of customers. I highly recommend the chole bhature and aloo tikki chaat.\nPRO TIP- you can pay after you are done eating, but I’d suggest just paying when you order so you can skip waiting in line again to pay at the end."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMaS0teG13RRAB",
            "text": "Very nice workers. Great customer service. They treat you like family here. So friendly and respectful. Food is of course 12/10!!! Amazing flavors and I will definitely be using them as my caterers for my wedding day!! Highly recommend"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzcHRmQnBBRRAB",
            "text": "ordered malai chaap but got only raw chaap with oil and when called them to ask about this, the ladies replied that it is malai chaap and we do not add oil but in pictures and videos it is oil\ntotally fake and no good customer service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvekxtYTlBRRAB",
            "text": "Everything is amazing. Just try it. I tried their THAALI at brunch. Masha’Allah it was amazing like pure Lahore Dhaba 🥰"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcjV6M2RREAE",
            "text": "One of my fav places to go  for religious items. The employees are always helpful and the owner is also very helpful. Found my favorite sweets."
        },
        {
            "date": "1년 전",
            "language": "pa",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqaHREdXBnRRAB",
            "text": "ਜੇ ਕਿਸੇ ਨੇ ਸ਼ੂਗਰ ਕਰਾਣੀ ਹੋਵੇ ਫ੍ਰੀ ‘ਚ ਤਾਂ ਏਥੇ ਆਓ ਜਰੂਰ ਪੈਸੇ ਪੂਰੇ ਤੇ ਸ਼ੂਗਰ ਫ੍ਰੀ ‘ਚ ਮਿਲੂ ਜਿਹਦਾ ਇਲਾਜ ਏ ਨਹੀਂ ਕਰਨ ਗੇ ਸਿਰਫ ਡਾਕਟਰ ਕਰਨ ਗੇ ਸੋ ਇਸ ਕਰਕੇ ਇਸ ਦੁਕਾਨ ਤੇ ਜਰੂਰ ਜਾਇਆ ਕਰੋ ਤਾਂ ਜੋ ਤੁਸੀ ਤੰਦਰੁੱਸਤ ਰਹੋ ਹਮੇਸ਼ਾਂ ਤੇ ਖੁੱਸ਼ ਰਹੋ ਕਿਉਂਕਿ ਰਾਹ ਜਾਂਦੇ ਪ੍ਰਸ਼ਾਦ ਮਿਲ ਰਿਹਾ ਮੁੱਫਤ ‘ਚ ਆਓ ਤੇ ਲੈ ਕੇ ਜਾਓ ਜਲਦੀ ਮੁਫ਼ਤ ‘ਚ"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMHVUX0N3EAE",
            "text": "No good service. To get one order to done they taking more than one hour still they dint serve food if people who come in hungry if you come to this place we should die hear only waiting waiting please don't come hear and waste your time and health.\nBad service worst atmosphere. I highly recommend not to go hear."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTMC1UblVREAE",
            "text": "Hey proud Vegetarians! I am back with this exciting place i tried in the New York City. You should definitely try Aloo Tikki Chat. Chats are all about chutneys and they make is the right tangy, sweet and spicy. The kind lady will only charge you $6 and serve you food worth $20. I mean the quantity this Dhaba serves is huge. The taste of the food is soooo good that i bet you won’t miss India for a moment. I also tried their veg thali as you can see. It costs $8 and is super delicious made with pure butter, fresh vegetables, lot of paneer and LOVE! QUANTITY at less price, EXCEPTIONAL TASTE and LOVE is what makes this food joint special. I would definitely travel from New Jersey to New York around 40 miles to have this delicious food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2bDdESkNBEAE",
            "text": "This is the most disgusting food I’ve ever had in my life. The chicken vindaloo was not chicken vindaloo. I don’t know what the hell that was but it was disgusting. The chicken was all brown and dark. The rice was old and it was just a…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDdTlENzVBRRAB",
            "text": "Food made us feel sick. Yogurt in chaat papdi was sour, had gone bad. Called in just to make staff aware but they denied it without even checking. Also chutneys are diluted, there is no real tamarind chutney, just sugar water with food…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtaWRDMzRRRRAB",
            "text": "The best punjabi food in Hicksville area. Jitender is an amazing server who recommended me to t try their Amritsari Kulche. Top notch and unbeatable. They reminded me of Puniab!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZOTVucW93RRAB",
            "text": "Food is decent. It is very reasonably priced however the quality is mediocre. Malai kofta was good but food is very oily and buttery. Service is definitely slow and restaurant does not appear too clean. They only have one waiter for about 9 tables."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDLUltaV9RRRAB",
            "text": "Love that they are purely vegetarian and i don't have to worry about contamination from non-veg foods. Food is also my level of spicy and tasty. (Visited in August 2020)\nAnother visit, delicious as always. No complains."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVajhHWi1BRRAB",
            "text": "An authentic Punjabi dhaba 30min drove from JFK. Very Authentic customer service but makhan (homemade butter) and free butter milk made me over come it"
        },
        {
            "date": "9달 전",
            "language": "bn",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcDd6ZjZnRRAB",
            "text": "Chole bhatura is just amazing…  so good."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwbk1pQjJBRRAB",
            "text": "Very organized set up.  They had alot of options set up on tables,  possibly because of Diwali. They were very kind.  A box of 12 pieces cost about $8. The sweets were good."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzeXVyQW9BRRAB",
            "text": "A perfect food gem for the Punjabi’s visiting NYC. Good parantha and service. Lassi (buttermilk) is complimentary and don’t hesitate to try it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdC1mUHBRRRAB",
            "text": "Food is good\nbut service very bad experience also she’s very rude don’t waste your time here don’t come"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLbjVvZkNsaExXdTF3RRAB",
            "text": "Good respect.. clean restaurant. Good taste . Reasonable price, I will visit  again again..sagar"
        }
    ],
    "reviews_count": 62
}