{
    "name": "Tourmaline",
    "place_id": "ChIJs51u3sNfwokReADwE3QBrME",
    "grid": "QN9",
    "address": "106-17 Metropolitan Ave, Forest Hills, NY 11375, USA",
    "rating": 4.9,
    "user_ratings_total": 44,
    "phone_number": "(646) 535-5799",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWFIxaDFRWEZGTWxad1lUUXRiRkZ6V1hjMFZGRRAB",
            "text": "What a wonderful restaurant bringing the cuisine of France to Forest Hills effortlessly! From the warm and personal service to the elaborate and refined food served we had an amazing time for the birthday of our son! We're so lucky to live in the neighborhood and we will become regulars! Highly recommended with affectionate applause to the talented chef and its able crew! Great hospitality and professionalism, thank you all! We'll be back for more of your amazing deserts!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1MVExaGthaTE1WDNremNERlZRV2xyTm5OM2JsRRAB",
            "text": "Our new favorite restaurant in Forest Hills! Every dish was cooked, prepared and plated to perfection. The servers and staff were terrific as well, and the ambiance was upscale yet cozy. So glad we came and can't wait to be back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMk9ETnhZV2hsV1dGT2JsWnlORmwyV0VVME9IYxAB",
            "text": "Once again we had an amazing experience at Tourmaline. For appetizers we had assortment of cheese, pomegranate, chicory salad and a truffle pasta .The cheese assortment was delicious, the salad nicely balanced flavors and the pasta was flavorful. Then Chef Yvan presented us with DUCK À LA PRESSE. The presentation and combination of flavors and sides were fantastic. First time we tried this dish and it definitely did not disappoint and it surpassed our expectations. To finish our meal we shared the Raspberry Pavlova and the Chocolate Pod for dessert. For those who are Chocolate lovers, the Chocolate Pod was rich and creamy and for those who like sweet and tart flavors the Raspberry Pavlova is the perfect choice. The staff makes you feel welcomed and are attentive. We will definitely be going back again."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVVMzVjBWVU52V21WUWRVTnpjbUZST0cwemRWRRAB",
            "text": "Great food experience at this Forest Hills restaurant that my wife and I recently had.  We sampled some of their menu offerings and were delighted with the quality and great taste. Tourmaline is a fine dinning establishment that fills a need in our community and I’m so glad to see them here."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdGQzQXhRVGRaVDJvM05qaE1kelV0YUdWQ1EyYxAB",
            "text": "We had the best night of our lives celebrating our wedding at Tourmaline! We still can't get over how incredible everything was from beautifully set up space, food I'll always be thinking of, the incredible service, and Rebecca's effortless coordination of the flow of the night. Thank you from the bottom of our hearts for making us feel so special. We cannot wait to visit again soon."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GQlNWZHZWa0k1TldweGRHOUJhMjVCTUU5cFNsRRAB",
            "text": "My fiancé and I had dinner at Tourmaline tonight and it was absolutely spectacular. From the moment we walked in the service and ambiance was amazing. The presentation and quality of the food made me feel as if I was in Europe. We celebrated our anniversary with drinks and dessert on the house! A true gem added to Forest Hills."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kc2FraFhNWEYzU1dSVk0yRkNXbXhPZVcxUk1uYxAB",
            "text": "10/10\n\nGet the duck. Get everything.\nImpeccable food and service.\nFirst time I've had a good cocktail in Forest Hills.\nA deeply appreciated addition to the neighborhood."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsU1EwOUlSWFoxWm14Q2NGSXpPV1JOVFVaSlExRRAB",
            "text": "Note: basket of bread is extra, not complimentary. The [quail] Eggs in Nest were cute, and taste like … well, eggs. The chicken breast was very moist and very delicious. The pernil (pork) was just ok. The scallops were delicious but rather on the smaller size and left me hungry. Good thing I ordered an extra dish: The mushroom and truffle pasta is to die for! To me, this was the star of the evening. My friends, though, thought the chicken was the star of the evening. Deserts were just ok. The restaurant is only two months old, so not bad for a running start. Good luck to them and hope they improve tremendously from very good to very great."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SNVJsVnNUakpSVFdFeGQxYzRUbFJyY0U1RUxVRRAB",
            "text": "My wife and I enjoyed 4 incredible courses here.\n\nI think other reviewers have summed up Tourmaline very accurately. Fine dining, inspiring food and fresh ingredients—you can taste the difference. This elevates Tourmaline to a league of its own in the neighborhood.\n\nOne of my favorite parts of eating here was the fact that every table is a chefs table thanks to the open kitchen.\n\nWe will be back very soon!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sbGQyaDVjVVZTWVdoSVRVdElTVmM0U1ZFMFMwRRAB",
            "text": "I recently dined at this absolutely perfect restaurant. The owners are wonderful . The server staff was attentive without hanging on you.   The food!! Oh my I couldn't have asked for a finer experience. We pre-ordered the pressed duck which is a demonstration of classic French cooking and preparation. The duck was perfectly prepared. It is a long process which takes at least a week akin to Peking duck but takes it a step further. Our dessert of peach and a crispy buttery pastry was devine.  The wine selections spot on.  I have no issue with paying a premium for a premium meal and experience.  It's also a beautifully appointed space.\n\nWe will be back, and judging from the full tables, I am confident that Forest Hills, and all of the five boros will enjoy this fine dining experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ScWJ6UjFaVWxQTUVnM1RrOHRWVkl4UkhKcE0zYxAB",
            "text": "Creative menu. Delicious and generous portions. Everything that we had was delicious including cheese selections, lamb lasagne, burrata with peaches and pernil. A must try restaurant!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkU056Sm9WRXgzWm1kMFNYZFFPVXN4TXpJMlprRRAB",
            "text": "So sophisticated!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRVVESTVOVkpEZEhrM1YxSkRPVzQzV2pSQmVXYxAB",
            "text": "I predict a future Michelin star for Tourmaline in Forest Hills. French- trained Chef and owner,  Yvan Lemoine and wife Rebecca Sussman, actress and event planner extraordinaire, have elevated the property value on Metropolitan Avenue with fine American and French-inspired cuisine. As you read this, try and get a reservation."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sd0xXZzNWalZpVVhKbU1qVkpTamQxVW0xbVdFRRAB",
            "text": "Tourmaline is exactly what FOHI needed. Refined French dishes, friendly staff, and a beautiful atmosphere. The duck has to be ordered ahead, but the presentation we saw at the next table showed it’s worth the effort. The owner was really friendly and gave us a tour of elegant yard which is perfect for small events. The whole experience felt special, warm, and inviting, easily the most sophisticated new restaurant in the neighborhood. I will be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwRFJYUlNVVVJ6UlVwQ1lUSnNTRFZHVWpsNlozYxAB",
            "text": "Finally got to try Tourmaline and it was a really great experience that lived up to the hype. It's a small intimate space with just the right amount of energy on a Friday night and the service was attentive and warm. It's a thoughtful menu and we definitely have to come back because there were many things I want to try but could only responsibly order so much in one seating. We were a group of four and shared the eggs in a nest, latkes, bread service, two pastas, the duck press, and 3 deserts inclusing the outrageously good kouign-amann. The duck is a very unique experience and it was fun talking to chef Yvan about the history of the dish and press itself- this is definitely a special occasion type of order. The portions were generous, and we brought home some leftovers. All of the dishes were really good and so were the cocktails. Really excited to have this in the neighborhood, the bar has been raised!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMGNtNHdhbVpHWDBOME4wSmlTVnBYZW1oZlIxRRAB",
            "text": "I’m so excited Tourmaline has opened in Forest Hills - it’s a very welcome fine dining option in the neighborhood. I’ve been twice so far, and the food has been incredible and service kind and attentive. Some highlights were the hanger steak (and the onion tart that comes with it!), the wild mushroom and truffle pappardelle, the celery root latkes, and wow, the peach kouign-amann dessert is out of this world. I’m excited to come back in the fall and see how the menu changes!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWT1NXZFBNVXREYW10Rk5USXdaMDVtYjA1bk5sRRAB",
            "text": "A really welcome addition to the neighborhood as it is in a class all by itself. Probably the highest end restaurant in a 2 mile radius while simultaneously having very reasonable prices. There’s a lot of attention to detail with the ingredients and food. The menu is creative with a good depth of flavor. For example, I had the hanger steak and there was this onion tart as one of the sides which was unlike anything I’ve ever had. Little details go a long way. Very excited to see how this place continues to grow."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSc1RFUlpaMjlhUzFKM1pXbFlPWFJHUldSdWNYYxAB",
            "text": "Such an amazing dinner today! the service and details are impeccable and how lucky are we to finally have a fine dining restaurant like this in Forest Hills. Bread/Latkes/Eggs in a nest/Pernil/Lamb pasta/Cod/Steak and everything else we got was fantastic and do not skip out on dessert, the pavlova and panna cotta was delicious! Cant wait to go back for another special meal!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWlJGTkpNelZKVFdWV1l6ZENXUzFxV0RRMlYzYxAB",
            "text": "We've been there 3 times already. Each dinner was better than the last.  Staff is excellent and friendly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxSmJGTTJYMHQwVmxwMFEybDJRbmRHYldsd2JrRRAB",
            "text": "Went with friends to this excellent resturant tonight in Queens First let’s talk food. Their speciality is a dish called Duck a Le Presse.  A whole duck aged and prepared wonderfully and along with a wonderful presentation table-side .You need to order it a week in advance.  The duck was succulent and tasty without being gamy\nOne person had chicken.  Incredible as was the salad and desert\nThe service was super friendly and professional.  We sat at our reservation time.  Good cocktails and staff knowledgeable about wine choices  The chef/ owner and his wife are up front andpresent.  Both really nice and very professional.   We could not of asked for more.  We will be back as I hear some menu items change as per season."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xdWVXWnFOMUE1VlRSMFRFeHdURTlsT1VKUWFYYxAB",
            "text": "These reviews are always tough to write—because the more people who read this, the harder it will be for me to get a table here again.\n\nThat said, this was one of the most exceptional dining experiences I’ve had in recent memory, and without question the best I’ve had in all of Forest Hills. It’s not even close.\n\nMy advice: stop whatever you’re doing and book a reservation at Tourmaline right now.\n\nEverything here is deliberate—the music, the décor, the silverware, the service, the atmosphere. It truly feels like you’ve been transported to France.\n\nAnd the food? A perfect 10. I haven’t had a meal like this in Forest Hills since I moved here in May 2025. Here’s what we tried:\n\nPlaisirs de la Mer – like the best lobster roll I’ve ever had. Buttery, rich, and unforgettable.\n\nEggs in a Nest – a brilliant play on texture.\n\nCelery Root Latkes – fishy in the best way possible; even better than a bagel with lox.\n\nDuck à la Presse – one of the rare places that offers this dish. Worth the trip to Forest Hills for the presentation alone—absolutely spectacular.\n\nI’ll be back as soon as possible to explore the rest of the menu."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVVVuazRUMk14UjJsRFgxUTBUemhXYlZCWlltYxAB",
            "text": "Forest Hills has been waiting for a restaurant like Tourmaline — and it does not disappoint. Since moving here from Manhattan a few months ago, we’ve been trekking to Brooklyn for fine dining, so we’re thrilled to finally have an elevated option right in the neighborhood.\n\nThe food is phenomenal — perfectly cooked, beautifully balanced flavors, not overly salty, and served in portions that feel just right. The French American menu is thoughtful, and you can taste the quality in every bite. The pastry chef, who comes from Le Bernardin, is truly exceptional — save room for dessert!\n\nService is warm, attentive, and genuinely friendly. Presentation is refined without feeling pretentious, and the ingredients are clearly top-notch.\n\nThis is the kind of place that instantly becomes a neighborhood staple — and for us, it’s just a quick 7-minute walk from home. Rebecca, the hostess and co-owner let us know that the menu will rotate according to the seasons. We’ll definitely be back again and again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVldtbzFVbFppWXpNMVdGSlBTemhLU0doWk5XYxAB",
            "text": "Excellent meal from start to finish with amazing hospitality. Will definitely be coming back soon."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sM2VrSXlTWHBpYkdnM2RqTkRTVEk0UmxacWFYYxAB",
            "text": "❤️❤️❤️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200NWR6aDBaR0V0Y0RoSldXRXlTV3RhY2tsaU5rRRAB",
            "text": "Right in the Forest Hills neighborhood. Went for a quick bite and drinks - they have amazing outdoor space in the back and the ambience was amazing. The food was curated and the execution was spot on - got the carpaccio, kale salad, latkes, and cheese cart 👍.\n\nThis is a new place and I will definitely become a regular"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psVFdGRklNRUZFWkV0bFNFVkxWRm8wVTNCcWNVRRAB",
            "text": "Unexpectedly the best meal of my weekend in Brooklyn and Queens. Everyone working there is clearly passionate about making a solid experience for guests. From the cocktails to the cremant, the cheese to the salmon cake latke, the pavlova to the peach kouign amann…incredible food. I hope they’re able to get the back patio open for service because it’s a gem for summertime dining. Don’t miss the desserts—maybe the best I’ve had at a restaurant in ages. The pink peppercorn ice cream will be living rent-free in my head for a while."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GUmQyOWtlV1ZmTm5WR2NUaE9NVk5GU1RoamNuYxAB",
            "text": "I have a tradition with friends where we venture to a new restaurant every month and for this month’s edition was Tourmaline! We were excited to find a new restaurant in forest hills that brings class, elegance, and of course exceptional food. Service was attentive and willing to accommodate. My friends and I would definitely come back to Tourmaline!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBd01DMVRiM1pmZGxoaU1XaG1hRmwyYlZab1duYxAB",
            "text": "Growing up in the restaurant and hotel business in Germany and owning a Cafe gave me insight into the culinary world.\nTourmaline is captivating ....  its atmosphere, its service and the artistically designed delicious dishes. I loved every minute of being a guest at Tourmaline and highly recommend it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WUGJraHZVMUJRYW01Uk1VOUxiRFUzVWkxb2RVRRAB",
            "text": "We had a lovely time at Tourmaline. We enjoyed the duck dinner (which is ordered in advance - check with the restaurant); it was most special, prepared tableside by the chef personally. Service was both friendly and professional. It was a pleasure. We'll happily return."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSa1JtZzVUV3RvV21kVmJXcHRZaTE1TFdOZlIzYxAB",
            "text": "About time Forest Hills has an upscale dining experience. The wine list is on point too!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GclZuSnlhRlpOWTJsU01FUTRkUzE0YzJKcFUzYxAB",
            "text": "What a special night! It was local. It was fresh, it was everything and more! So glad to have this gem in FH! Be sure to save room for dessert!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aeVNUYzJOa0ZqUkVGdlRuTkJXWGs1VVRGWlMxRRAB",
            "text": "Amazing spot. Met with some family on a Wednesday night. Beautiful ambiance and delectable dishes. The cod with the corn chowder was perfect. I also had the beet salad. This spot is bringing a much needed culinary infusion to the neighborhood."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5dWFtSjBaVzlzUWxRMWNYZ3RXV1UzY0dkbVJVRRAB",
            "text": "This is the kind of place I’ve been waiting for in this neighborhood - legitimately good food, in a nice space, with good service, and at surprisingly reasonable prices. Dishes are well thought out, seasonal, and just simply good. I’m looking forward to coming back to try more things. Can’t wait to see how they evolve. You should come here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJdFoyWXRhMDlYY1RkNGFWVXhjelIzWDBKNFRuYxAB",
            "text": "We were so excited to try Tourmaline following their beautiful renovation this year. The space is accompanied by a stunning bar and staff that made us feel right at home. We opened our meal with the Eggs in a “Nest” and Plaisirs de la Mer. Both dishes were unique and spoke to the special ambiance of the evening. For my entree, I enjoyed the Maine Lobster Cappellaci. The dish was decadent and I would certainly order it again. My husband had the pernil which has not stopped referencing since. The meat was succulent with crispy skin and a refreshing salad on the side. Always leaving room for dessert, we chose the peach tart and raspberry meringue. I normally would steer clear of peaches anywhere near my dessert, but I couldn’t get enough of this one.\n\nTourmaline is a wonderful addition to our neighborhood. I am so grateful to have a new, exciting restaurant to spice up a nice weekday or celebrate life’s special occasions."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kM1pXZEZkbEZWUVVRNFZrWmxVMTlNYnpNMmVWRRAB",
            "text": "So impressed with this new gem in the neighborhood! Today was their grand opening of the restaurant side of their business, expanding from what was previously a private event space—and they absolutely delivered.\n\nThe service was top-notch, and the interior design is stunning, with a refined, modern atmosphere and beautiful, classy servingware that made the whole experience feel truly special.\n\nWe ordered the Eggs in Nest, Plaisir de Mer, Alaskan Cod, and Crispy Pernil, and ended the meal with the Raspberry Pavlova. Every dish was gorgeously presented, worthy of a Michelin-starred restaurant. The Pernil stood out as my favorite—crispy, flavorful, and deeply satisfying. The dessert was also exceptional. The Raspberry Pavlova had a complex, layered flavor with bright tartness, flavorful ice cream, and delicate textures—each bite came with a delightful surprise, making it both refreshing and indulgent at the same time.\n\nI’m so happy that we finally have a refined French restaurant in the neighborhood. It’s so much more than a local spot—it’s a true dining destination. I can’t wait to return, especially to try their Duck à la Presse, which requires a pre-order and a larger group than just two. A must-visit addition to the area!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkV1IxUXhkMGszU2pFemVqZDVTa0kxVGkxUk5IYxAB",
            "text": "What a wonderful experience at Tourmaline! Fine dining, yet reasonably priced. The service was amazing, and the food was even better. Rebecca welcomed everyone as if it were her home. Can’t wait to go back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOR1dHcEpXSEp5YkVod1NFdHFkVEk0WW1oRmNuYxAB",
            "text": "Amazing new restaurant in Forest Hills! From the second we walked in, the experience was warm and welcoming.\n\nThe petits farcis appetizer is fun, unique, and delicious. I love pernil and Chef Yvan’s take on the dish is a home run!  Rebecca, Matt, Dani, the whole wait staff are incredible, attentive and friendly. They were busy tonight but they still stopped to have a genuine conversation.\n\nDon’t be shy, go visit and have a wonderful experience!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21relkwY3phR05WUjJsRVNXY3lkVXhHV0dzMGNFRRAB",
            "text": "A special place. The food is delicious and the wine list is well curated. No detail has been overlooked.I thought I was full but then dessert was served and all I can say is pace yourself, it’s worth it."
        }
    ],
    "reviews_count": 38
}