{
    "name": "Vincent & Andrea's",
    "place_id": "ChIJmTLSEqxgwokRbJbLH7PblKY",
    "grid": "QN9",
    "address": "113-17 Jamaica Ave, Richmond Hill, NY 11418, USA",
    "rating": 4.3,
    "user_ratings_total": 305,
    "phone_number": "(718) 846-7070",
    "reviews": [
        {
            "date": "13시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdmNWZGpSMHR6WjJoTFlXUndiMVJxYUd3eFJtYxAB",
            "text": "Best Pizza!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NeFoyTnpabXM0TlhwR1JqZHhORXd5VWtwRlJGRRAB",
            "text": "Food is great! We loved the carbonara and chicken parmigiana. The services was excellent, friendly staff, very attentive. This will always be our pasta place.\n\nThank you for the excellent service and food ✌🏻🍕"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTU9IWjJkVEpDVG1ONFRuUm1UVGxPTmtzd1UzYxAB",
            "text": "Great pizza, friendly staff."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201Q1JIaDRaVXBsUkROSE5tWmtUVFZrWm5KSlgzYxAB",
            "text": "We were exhausted and ordered this via Grubhub. Not the restaurant’s fault that Grubhub let us down, again, and didn’t deliver it for almost two hours.\n\nI can hear to post a review because the pizza that arrived cool was STILL really tasty. All of us were commenting on how delicious it must be hot and fresh. We know pizza here. This is fabulous (we did grammas w onion). The Caesar was decent, no disappointments but no rave reviews. Priced well for the size. Good value overall."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNbHVEZ1FREAE",
            "text": "Vincent and Andrea Pizza is really good and everything else is pretty good and the prices are reasonable"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVVYwRnRNa1I1VG1WSE9UaFFRWEJDWm1Kbk9IYxAB",
            "text": "very nice food or person very nice service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnd1NrOWlaMXBUTVVGU05tSTJTMnR3TjJ0TlJsRRAB",
            "text": "Delicious Pizza! Free 1 mile radius delivery in the neighborhood. The prices are too competitive to beat! And the delicious pizza is such a great quality. Will definitely keep ordering from them and would 100% recommend this amazing local spot to everyone who’s in the neighborhood looking for a good pizza near Jamaica and Richmond hill."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWTVRUUm1UVFY1YTBRdFlYWTROMlEzUmxkUVNXYxAB",
            "text": "Pizza taste like cardboard"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVk0yZ3lSMHh5VWxwZk56QkdRMnBUVERaeVJuYxAB",
            "text": "Food is good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poQ2JrOHlVMkZ6VEROd2NIazBSazlIVUV4UFpIYxAB",
            "text": "Nice and the food is really good :))"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRmJsbFVaR3B3Y0dFdFMyTTBWbWhGU1hSc2IyYxAB",
            "text": "Good food with good price !"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWbGNVdG1UbE5oTWs5NVFsaHJiR1ZaZW1FMmRIYxAB",
            "text": "Buena atención de parte de los muchacho"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oWWVscHZWWFJNY2psTldWbFlZVVJmU0dJeFIzYxAB",
            "text": "Everyone's nice! The food is also great! Keep up the good work!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRlgwZGtjSGRuYlVkTWFYZHBjV2RCYzBGV2JIYxAB",
            "text": "Amazon pizza y el servicio bueno"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOaFpWcFNOMjVmV1ZKMlVGUm5NVGhvVURSTWFFRRAB",
            "text": "The food is good The service is great"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VeU1uaHBlRzlyUW1wTE1tZHVja0ZvVGpKQ2NrRRAB",
            "text": "La mejor pizzeria de Richmond hill"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4SWFtdFhPSE5yWjJsd1JuWTBNMFZUTjIwM2JXYxAB",
            "text": "Very good place!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVVVIUk9WR3RQZWxaR1VTMUJjM04xYVZaV1oxRRAB",
            "text": "If you’re looking for more than just great pizza, this is just the place! I got their penne alla vodka—and WOW, it was incredible. You can tell they put so much care into all their dishes. Definitely a hidden gem. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xWk0zSlRMV2RTVkMxb2FVRjZMVUpTY0dSTmNtYxAB",
            "text": "Not responding, too\nmuch attitude."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkMVZFbHVZMjFOU1hjNFZpMHpiV3hHZEZrd2EyYxAB",
            "text": "Too long for make order."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sc01VRm5NbFV3Ukdad1Nrb3hlRkJaWTJOaVFsRRAB",
            "text": "For delivery order, it take too much time. The driver wait like 1 hour."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdElUbUJ3EAE",
            "text": "Delicious pizza!!!! Try the margarita slice."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMjlUZV9nRRAB",
            "text": "La pizza es muy buena pero no me gustó la atención, el empleado parecía molesto"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bzREY0VnEAE",
            "text": "The pizza is amazing."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3X2NqRUpREAE",
            "text": "I have been coming here since high school, so about 10 years!!! Their food is always, without a fail, TOP TIER. My go too is the chicken and broccoli slice with a pepperoni pin wheel. I hope they never change and stay open."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3djdtOG9BRRAB",
            "text": "The aroma pulls you in & is inviting to the taste buds ... Customer service is top-notch, plus the atmosphere is relaxing. Ordered two deep dish slices with buffalo chicken topping & it was seasoned right, crispy crust with a great Italian style soft dough ... Wonderful all-around restaurant to make you want to return."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbHF6UkNREAE",
            "text": "Vincent& Andreas pizzeria is one of my favorite pizzeria restaurants in Jamaica… the male staff & crew make me feel very comfortable & are very friendly & all of them are gentlemen & allow me to bring food/beverages from outside too & I have even took cat naps here at there tables & have even served me free hot water & are very accommodating towards me & other customers at there restaurant…the pizzeria is constantly clean & organized & make me feel safe & welcomed at there restaurant & are constantly kind towards me no matter what day it is every day of the week… & I luv the staff & crew of Vincent & Andreas pizzeria & restaurant & I am very grateful for them…. thank you always, Kathrine Varakin/Kim"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbjZfWlVBEAE",
            "text": "V&As Pizzeria: my favorite pizzeria in Richmond Hill.\n\nDon’t let the looks fool you—Vincent and Andrea’s Pizzeria is a hidden gem. The pizzas are fresh-made and absolutely delicious, with the perfect crust, sauce, and toppings. The chicken wings are crispy and full of flavor, and the steaks are tender and perfectly cooked. If you love Italian food, their pasta dishes are near perfection, just as good as any high-end Italian restaurant.\n\nThe staff is super friendly, making every visit enjoyable. And the best part? The value is amazing—you get top-quality food for a great price. This is my go-to spot whenever I’m hungry, and it never disappoints. If you haven’t been here yet, you’re missing out!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBem95S2RREAE",
            "text": "My husband and I normally order from there a couple times a week. The food is good, very tasty. However there are times where I'm very disappointed. I normally get lasagna with extra cheese well done. And many times I regret it. It will have extra cheese not well done. No extra cheese but we'll done. Once I got nothing but cheese and a small piece of lasagna and another time barely no cheese and a lot of sauce.\nSure I do call and complain. This evening I ordered a Sicilian pie with sausage and meatballs and it took to long to be delivered,   the meatballs and sausage were in the cheese, the cheese was not melted and it was cold. Oh yeah I called and complained.\nIve never saw a Sicilian pie with the meat under the cheese. I'm an ER and I had to leave for work so while I'm taking a a few minutes break I figured I would write a review. I asked my husband how was the pizza and he said he doesn't know that to ask the trash can in the morning when I get home. We're really starting to more and more disappointed. We do like the place and the food but we're probably going to have to look for another place."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmc3FfZmtRRRAB",
            "text": "I need to tell the world that when if they come to New York or if they’re in New York or wherever they’re at this has been one of the best pizza shops I’ve had yet since being back in New York being from New York and this new area where I have been in for a couple years now, but holy shit I love Italian people. But to know their pizza even taste better when you warm it up the next day the service was great coming to my house, enjoying it even the other food i got every piece of the pizza Was so good fulfilling hot when it got to me finger licking good the cheesecake even so freaking good they get 10 stars and I can’t wait to go sit and eat in their restaurant. There was so friendly so respectful God bless him treating the food with extreme love come here when you come visit you don’t wanna miss it"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzbGVHTExnEAE",
            "text": "It was take out"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtenFLX0pnEAE",
            "text": "The wrong dish was delivered to my home. I was told they would bring me another one without any Attempt at an apology and offer to rectify the situation. I was told to sit on the dish It had been wrongfully delivered While they would take 40 minutes to deliver the right one. No compensation Or respect was offered."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzeC1EZWZBEAE",
            "text": "The staff is aggressive"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbU5yNEtREAE",
            "text": "Had delivery from this place and the pizza is awesome! My new go-to for delivery pizza!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURucy1qMkFREAE",
            "text": "Best pizza on jamaica ave"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuMFAta0tREAE",
            "text": "Used to really like this place, but it fell off, and we stopped ordering from them.  Decided to give them anotger shot.  Pizza was ok at best.  Ordered some chicken fingers too, and 2 of them were stuck together and still cold in the middle.  This place just doesn't care all.  At all"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINVBhMGhRRRAB",
            "text": "The garlic knots i got from there were very dry and were also stale as well and the beef patty with cheese i got was also dry when i went in the pizza on the shelf looked at least 2 or 3 days old not fresh at all there was a homeless man in there as well not very clean"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIczl5NTl3RRAB",
            "text": "Best pizza place in Jamaica Ave and decent prices. Really have to try my hardest not to spend all my money here for lunch everyday"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIanBfcWtBRRAB",
            "text": "Been going here for over 18 years the best always !!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNacFphbU5BEAE",
            "text": "Great pizzeria.  I've ordered a few times now and the pizza is delicious. Thin and well done like it should be. Eggplant rolatini was also delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaFl5STdBRRAB",
            "text": "Great pizza with an excellent crust. Generous amount of cheese. Love it."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNLXNDa1VBEAE",
            "text": "Really good pizza pie the toppings didn’t melt off and the cheese was good and the toppings were well made"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoczliYndRRRAB",
            "text": "Good spot to order food if you have a group or kids. The food is decent and the prices are pretty affordable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyeU8zUkJREAE",
            "text": "Poor customer service. Tried ordering a full tray of Shrimp Scampi Pasta today since we love it. The guy on the phone keeps saying that I was not clear of what I want and blaming me. But I did call yesterday and when a different person picked it up he got my order right. So ended up ordering nothing and will never order again!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNscGQ2RG1RRRAB",
            "text": "2 stars for food quality as expected for a $26 14 inch. Paid $4 for just a light sprinkle of thin small mushrooms, and jalapeños. They barely cut the pizza I have to cut it properly and half the huge portion they attempt to cut. I called in to request for an additional single herb topping and was told will get it but did not."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkN29fTnhnRRAB",
            "text": "I have been having pizzas from this place I was in high school. I went Richmond Hill High and graduated in 2011. Great pizzas from what i remember. Haven’t ate here for years now cause I moved out of New York but I’m glad that this place still up and running."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJMTdiYjN3RRAB",
            "text": "Great people with delicious pizza and pasta dishes.  it's not a fine dining place but for sure you'll go home full and satisfied. My family and I love to come to this place esp when we're tired of cooking at home.  It's our friendly convenient neighborhood pizza place."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjbTlQS1F3EAE",
            "text": "I ordered 1 pie of pizza from grubhub and it took them 2 hours to deliver my pizza. The store is 10 minutes away from my house. The pizza was so soggy and nasty. The pizza crust was burnt. Its like they did not care about how the pizza would taste. The garlic knots tasted so bad i threw them out. Do not order from this place."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzb2ZqQ1RREAE",
            "text": "I love this place, and normally I would give them 5 stars but lately they've been a little off their game. Last couple of times my orders have either been burnt (pizza & garlic knots), undercooked (calamari), or salty (potatoes). But I understand sometimes businesses have off periods so I hope they get back on their game.\n\nBtw, best BBQ Chicken slice in town..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidC12V2xnRRAB",
            "text": "We got burgers here and it tastes like frozen patties, there was no condiments, nothing but the burger and bun and overall just not appetizing."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3eU1YMEhREAE",
            "text": "We placed an order over the phone last night and they forgot to include the sauce for the gyro and we called them to let them know. They sent the delivery person again but sent us tartar sauce.  They don't pay to much attention when taking orders. The zeppos tasted old and were very greasy. I won't order from them again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJMHFqYmdRRRAB",
            "text": "Old style traditional pizza place circa 1974, but the guys who work there are Hispanic.\nThis is how I remember pizza should taste and feel in your mouth...a mixture of…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUcE9TT3JBRRAB",
            "text": "Great pizza and great staff! Highly recommend grabbing some food to go or eat in! Delicious!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPcjc2Qkx3EAE",
            "text": "Love love love their calzone!!¡ The Best I ever had and it cannot be ate in one sitting. The marinara sauce IS THE ULTIMATE WEAPON!!!! My favorite Italian Food to order for lunch!!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtd3RfcWZREAE",
            "text": "The food was ok. The pizza was not fully cooked the sauce and cheese were not melted into each other.\nWithin an hour I had a headache and threw up the pizza. Idk who didn’t wash their hands when the pizza was made or who put the oven temperature too low and didn’t let the oven kill any germs but they gotta go."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0anJ2RjR3RRAB",
            "text": "Their customer service was great but the seafood combination I got was nasty, the garlic nots were soft and under cooked. They took more then an hour to deliver. I dont recommend other foods unless it is pizza u are ordering."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKb083ZGJBEAE",
            "text": "The food at this place is taste amazing. I found them on DoorDash when I move to the neighborhood. I have never been in person. This has to be the #1 place I order from on DoorDash. The food is consistently great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyZ1B2SDB3RRAB",
            "text": "Since my husband and I discovered this place, we order very often. Very good service and food. 😋"
        }
    ],
    "reviews_count": 58
}