{
    "name": "Halal Crisps",
    "place_id": "ChIJ7WN9NgBdwokRYhnrjyTHlbg",
    "grid": "QN9",
    "address": "80-12 Jamaica Ave, Jamaica, NY 11421, USA",
    "rating": 4.8,
    "user_ratings_total": 652,
    "phone_number": "(718) 785-0055",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZdFEzWkNPVTAyYmtaSVdYbDNjV0Y2UVV0aVVIYxAB",
            "text": "Great Food and Great Service."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNeFZqWjVYMHB1VDNCQ04xRXdjMGhMVFhac2VtYxAB",
            "text": "Great customer service and food."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdE5sbzVlVmxCWTBWeWNtaFFXa05RWnkwd1RuYxAB",
            "text": "Great food ... great employee's.... great music ... you won't regret it .... good late night eats"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVWRuWjJVVmM1TFc1SVQwRllUMVEwVG10SFdsRRAB",
            "text": "visited around 9 PM and ordered a plate of chicken over rice with extra chicken and jalapeños on the salad. The guy making my food was being really stingy with the portions, even though I kept asking him to add more — especially after paying extra. Please don’t be so cheap with ingredients next time, especially when customers are paying Extra for it."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sWllXMXJaazl3YkVWclRtTldTV0pGZEc1TWNHYxAB",
            "text": "It is so appealing to the eyes in here , food is fresh"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CMVJYaG1UVkJQTlhkNlFrSnRRMHRGVWtKdlZVRRAB",
            "text": "Nice little restaurant!\nThe rice was tasty and fresh."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gc1JrZDVVVlpPZDBONFZYRjJaa1prTkcxWFluYxAB",
            "text": "👍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVVMySjFVMUpSYTBobVJFZzBlRUpKT1U1dFpsRRAB",
            "text": "Just waited almost 20 minutes  for the worst shake of my life. It’s not cold and it tasted horrible."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKaVpVdHBjV05MVjFwS1lWTkpablpIZWprNE9YYxAB",
            "text": "Cool spot."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCbWNXbFBUR2d5TTI1R1VuRnlTM0EzUTJJMFNrRRAB",
            "text": "Solid spot. The chicken is well-seasoned with good spices, and portions are filling. Service was decent and the place is clean. Nothing over the top, but definitely worth a visit if you’re craving halal. 4/5."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WFgxQkJSV1Y0ZDJ0bmNIZDZiakJ2U1RadWVIYxAB",
            "text": "Best halal spot in Queens. Great food, great service and very affordable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOVlprbG5iMWxwVG1oeFZGWnhWamhGTW1GRU0xRRAB",
            "text": "I was excited to try this spot after seeing a lot of positive reviews - however the experience firsthand was a bit underwhelming.\n\nThe spicy rice is unnaturally red and doesn’t pack that much flavor. The meat to rice ration is also not substantial, which is not worth when it’s already overpriced for a below average chicken over rice platter.\n\nThe salad is fresh and is packed with a variety of vegetables. Probably my only positive note from this meal."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvODhuRXlBRRAB",
            "text": "I've been going to this place since they first opened and its great, quality food every time. Best chicken over rice out. Would be fire if they had a rewards system!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOclZrSmpkVTkxUjFoUmNUWTFhbVZ3Vkd3NWRYYxAB",
            "text": "Very good food and fast service really nice place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMU1UQkVaakZMZVZOVVdpMXhkMVkyVFd3M1UzYxAB",
            "text": "The food of this place is genuinely good and I think others should give it a try and the food is always hot and ready. The people are kind and place is always clean with great music"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKalEwMW9TVkExT1V4bk1reHNaSGRDZVhCemRWRRAB",
            "text": "Very good food and the service is fast"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdFpXVlRSVTFOU0VSMlVIVXpVRGh5UTFoRWNXYxAB",
            "text": "I love the food and the service…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMU5qZGZNR05oWm1VMmFTMXBOV3hVVGtwQ2RWRRAB",
            "text": "Spotted this place driving down Jamaica Ave. About 5 months ago. Glad I did. It is a weekly drop in spot for me,and the family. The food is amazing and the staff are awesome. If you are in woodhaven, and if you aren't.... stop in you won't be disappointed."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSNWNWOXJVSFZ0YTBoUlMzUlhlQzFyVEROZlRXYxAB",
            "text": "Very good meals here with good service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SVVEaFVOMjUwTW5WRWIyZGxVa3M1ZERaWFdIYxAB",
            "text": "great food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFdFVFTmZTamhKUTBoNlEycFNWVVJTUWtaRmFGRRAB",
            "text": "the food is delicious and super good def 10/10 would recommend!! 🔥🔥"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdFMyMVJNVFEwYkhKSVJVdGZRblYxVm5KeVJrRRAB",
            "text": "BRO HOLY THE FOOD IS SOO GOOD AND SOO GOOD BUDGET BRO AND THE MUSIC IS FIREEE BRO 10/10 FOOD"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdmRYWnhiMDFTVnpjMlpqSk1jRGRoZEV4YVpXYxAB",
            "text": "Goated freaking food. Chicken over rice was fire and flavorful with the addition of the spicy rice. Leagues better than your regular gyro spot and pricing is very good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5aWNIUTRhMnBDVjFCUU5WcEZOR2hmU0ZaVlVGRRAB",
            "text": "Best halal combo plate in NYC, was blown away"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMlIzVkxUMFppWjBaNU5UVjNOWGx3ZEhodmQxRRAB",
            "text": "I like this place a lot reasonable price and the staff are always friendly"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wTE4ySlBSa1Z4YlRsYVpYQk5NbkJoZFVsRGFFRRAB",
            "text": "Service was chill and the music was a vibe, cashier was nice was short on some change and blessed me with a bev. The smash burger was fire"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KUFFqbElTVjh0YzJob2N5MXNZa1ZXWTBSRldWRRAB",
            "text": "My first time buying here they food was absolutely delicious everything was fresh and tasty service was outstanding would definitely try again 😍"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tveGFVbFVUWGhaUmsxVk9WWlNSR290YlVOM2RVRRAB",
            "text": "Service, atmosphere, food, clean. everything is perfect."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWQ1NuUkRUWEpOWVV0WloycDRhV1JWY0RGWFduYxAB",
            "text": "Really good service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25adGRVVmtYMVl6VlVsNE5qbFFUMmxpUm5jMWNrRRAB",
            "text": "Great customer service and very nice people and food portions are very generous. 100% recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKblYyWTRRV2RHT0hsUllqTjRjblZNYlVGT2NtYxAB",
            "text": "good food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FdE15MXZRVTFVU0VOUWJuRTJiMlJVWWpGV1ZrRRAB",
            "text": "Good coustmer service and good food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwMFF6VktXa1YzTmpKWFVGOURNVTlCVWxodWFuYxAB",
            "text": "i’ve been coming here since they first opened and i think come here like 3 times a week and it’s safe to say they’ve never disappointed. the chicken over rice platters are too good, chicken always seasoned right, rice never dry. honestly got me in a chokehold.\n\nthe philly cheesesteak is another problem… i told myself i’d just try it once and now it’s basically a weekly routine. addictive isn’t even the word\n\nthe workers are always chill and friendly, service is quick, and the food is consistent. this spot never misses. my number 1 in woodhaven!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkRE5uSXlURk5QUjB4S2JYUnJXVzF5YTNNdFozYxAB",
            "text": "Bad customer service really bad"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCQk0wWldSMVZITlhZemFrMUJibkF0YTNKUmRYYxAB",
            "text": "Best mac and cheese I have ever had!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5SFZVMVFXazVGZERWaldFbHNMVlZmYUdsTlgwRRAB",
            "text": "My fiancé and I recently visited this place, and unfortunately our experience was disappointing.\n\nI ordered the smash burger, and the patty was smashed so thin it barely felt like there was any meat in the sandwich. None of the toppings were portioned well — it was supposed to have slivered pickled onions, lettuce, tomato, and cheese, but I only found one or two tiny onion slices, the lettuce was soggy and watery (soaked right through my bun), and the “spicy” mayo was flavorless and watery. Overall, the burger left me still feeling hungry because the portion was so small compared to the price.\n\nMy fiancé ordered the Nashville chicken sandwich, and it wasn’t much better. The chicken tasted old, and it was clear the cook wasn’t confident preparing it — there was a cut in the piece of chicken where they had checked to see if it was cooked through. That doesn’t inspire confidence, especially in a dish where food safety is so important.\n\nThe biggest issue overall is the lack of value. Portions were stingy, and the quality simply didn’t match the price point. That said, the place does have potential — if they can tighten up their menu, improve the quality control, and make sure customers get value for what they’re paying for, they could really become a strong spot in the neighborhood."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oelZucFBhelpEZFd4UFVYQk9iR2hSVTBaeVZGRRAB",
            "text": "The food is good but there is heat inside"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xka2FrWXpTMlZxWVRaMWJuaE5RVzkyY1RkcFgxRRAB",
            "text": "one of the best chicken and lamb over rice i’ve had in a while. chicken bites are also great"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SUVMwSXpRakZuU1d3eE9GRTVVVTlpZGxrMGVtYxAB",
            "text": "Everything about this place it just WOW so amazing from staff to food, such a great place. Sooo elegant and clean. Thank you."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4M1VURTVSVEYxWjBKSFIweE1SblZ3YlZWVVEwRRAB",
            "text": "This place is amazing. Some of the best food I've ever had, also very clean place and amazing customer service. 10/10! We're visiting from Michigan which has great food and this place was even better."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MmFFNVRPVW80WWpsZlFURjFiMnhXTVhoVWJYYxAB",
            "text": "This eatery is AMAZING. Food was immaculate, service was speedy and the employees were so amiable and welcoming :) I would 100% recommend and I tagged everything I ate below. You will NOT REGRET IT. If you’re around the queens area, this is a must have 💗💗💗."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SdFJGWm1RMjluWXpZMVJISkVSM0EyVnpBeE5WRRAB",
            "text": "I tried the Combo (chicken + lamb) over Rice & Crisps loaded Mac. One of the best Halal Restaurant. The portion of the meal was worth the price. Anyone who loves spicy & soft flavors definitely try these out! I highly recommend it!🤩"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNE5IbHllakYxV1UxSFkxWTFPRmhJUkVwMlVVRRAB",
            "text": "I usually go to this spot after church and it hits every time! The amount of food you get for the price you pay is so worth it. The employees are so nice and welcoming, and the atmosphere just puts you in a good mood. 5/5 I could eat this everyday and not get tired of it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMVFlfSldONHBuZ0J3EAE",
            "text": "I dont usually leave reviews but I honestly have to post this. I ordered from them using ubereats many times, the last 2 times i havent been very pleased with some of the items sent. Before today I ordered a oreo milkshake which wasnt secured properly using a sticker on the mouth piece where the straw goes which they have done in the past, leading to my drink spilling all over the bag. Today I ordered the same milkshake with a tres leches slice. The milkshake was perfectly fine but they gave me a red velvet slice when i ordered a tres leches, which has MOLD ON IT. this is absolutely unacceptable and they need to check their inventory and quality of their food. Absolutely disgusting."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdU5qX1N3EAE",
            "text": "Food was decent. I had the chicken over rice and an order of the hot honey bites. Portion sizes were smaller than pictures show but not bad. Fries were okay. Luke warm and not crispy - flavor was good. Was spicier than usual but that's not bad. Could have used more salad and sauces - they skimped on those compared to other pics people have posted. Hot honey bites were good but they didn't have the special sauce all over. Just a little on the bottom. I'm sure it would have been better if they drizzled it properly. Overall the food was good but not great. I have had better from other places like halal munchies and blazin chicken food truck."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQX2VXVWd3RRAB",
            "text": "The combo rice platters were delicious. Lots of protein, flavorful rice and the seasoned fries were a nice touch. The salad was very refreshing. I especially liked the spicy white sauce and green sauce. The loaded Mac and cheese surpassed expectations, the chicken was still crispy and the signature sauce paired well with it giving it a slight kick. The Philly cheese steak was okay, I think it could’ve used a little more steak but it satisfied cravings."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NXRXODJ3RRAB",
            "text": "I usually do delivery from them so won’t be able to speak about service or atmosphere but their food quality and packaging quality is good. They don’t use those horrendous paper takeout boxes that sweat inside and become soggy and instead use good plastic ones. The sandwiches are decent but the platters are really good."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzelozT3FBRRAB",
            "text": "Started eating and almost forgot to take a quick picture , but let me say this GEM just opened up by me and it's amazing I had the chicken over rice and it tasted great I also shared the Nashville chicken sandwich and I can't wait to get it again. The workers there had a great attitude and very accommodation. Definitely going back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWllucHdhVVpRYUhocWRVcG9TRkV0UzJsRlNVRRAB",
            "text": "Food is great, and the food isnt over priced. Good quality overall."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzN2NETUZnEAE",
            "text": "Proper store front which lures you into the restaurant as it did me. Entering with greetings from the hosts (not normal around here), well spoken and attentive to your orders. I’ve only tried two selections so far but it brought me back twice in 2 days (and definitely a new spot for me). Chicken over rice: very good taste, not over-seasoned (good for my taste), great salad ingredients, and not cheap with portion. Love the addition of the seasoned fries.\nTeriyaki Crisp bites: awesome flavors and great portion.\nThese two cost me under $20, my lunch and dinner. I look forward to trying other options on their menu as they have lots to choose from.\nThey also offer desserts which I will be trying on my next visit."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wM1JHTlBWMGh0WVROYVkweHVXVlp1V2xsaFFrRRAB",
            "text": "Visiting NY from Toronto, Canada. Decided to try this local take out. No regret! I ordered the Halal Chicken over season Fries with white sauce & hot sauce.. it was Phenomenal. The price & portion was great. Dinner for two was under $23 US. I would definitely return. Maybe this place can open a location in Toronto 🥰"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneGVlUlV3EAE",
            "text": "Tried for the first time with my girlfriend. The chicken over rice platter was very tasty, put together, and fresh. My girlfriend ordered a mac and cheese and was also very delicious and fresh. I must say as a walk in business serving halal platters, in competition with very known “Halal Trucks”, this place did extremely well. Very nice atmosphere as well along with decor. Would come back again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5WVVWaG1NVmxCV2xNMU16aFBjV2x4U25GWE0yYxAB",
            "text": "Best Halal I’ve ever had. It’s a smaller shop, can probably seat 6 people, but it’s clean in their & I can’t say it enough, it is the best quality food you’re going to get."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTlN6ZDJPVnBEV1VKUWNrMDBWalJ3Y0cxVFExRRAB",
            "text": "I love their special sauce! Tastes sooo good! Also the chicken over rice is superb too! Would definitely comeback here!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCZmRVeHlNVjlKUkVGNFJXZEVOVU5QTURCUVFXYxAB",
            "text": "Excellent food and service!!! Everytime I come here, I leave satisfied!! My favorite item is the Nashville Hot Chicken Sandwich!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNGRMU2RBEAE",
            "text": "So I ordered food yesterday from this place, what I ordered was chapli kabab over rice but i received completely wrong order. I received chicken tenders over fries which was very wrong but i was starving and decided to suck it up. But while i was eating my food I found a strand of hair in my food!!! Which is absolutely unacceptable. I got my refund but it’s still very wrong and i was very disappointed about the whole experience. On a side note no utensils were provided nor any napkins, very bad customer care :(  I have attached the picture in which you can see the hair on the food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNkplaW1nRRAB",
            "text": "Waited months to try this!!! It’s absolutely what you expect and sooo much more! Service is great and it’s well priced!!!! Insanely delicious :) It’s an absolute MUST try!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbk9PZGhnRRAB",
            "text": "definitely recommended! I ordered a hot honey sandwich w Fries and let me tell you the sandwich was delicious n perfectly cooked decent portion for $12 will deff come back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzc2E3Mm1nRRAB",
            "text": "Clean and excellent service. The gentleman at the register is very good with customers. Fresh Food& the quality of food is great! ( wish the portions were a little bigger but other then that no complaints) .\nI hope they stay like this . The neighborhood needed a place like this and appreciate it is open till late"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPTFFoWmJTMWVpZjR3RRAB",
            "text": "Unfortunately, my recent experience at this restaurant was far from satisfactory. It used to be a place we cherished for its commitment to quality and halal offerings, but sadly, those standards seem to have slipped considerably. During my last visit, I was served banana pudding that was unmistakably moldy. This was not just a minor oversight; it was a glaring indicator of how the food quality has deteriorated.\n\nMoreover, the service, once attentive and warm, now feels indifferent and rushed. It's disheartening because we genuinely want to support halal establishments in our community. However, such negligence and lack of care for customer experience make it difficult to continue doing so. We hope this serves as a wake-up call for the management to return to the high standards they once upheld, as we’d love to see this restaurant thrive again."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvODl1eGZBEAE",
            "text": "This was amazing food, great service more people should definitely come. Me and my brothers ate good!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SZldXRXRRMnAxYzFKYWNETlVhV0ZoTkc5ZmFXYxAB",
            "text": "Kamal showed great instantly as soon as I walked in the door very helpful with the many sauce option overall great experience will come again !!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQc29paUx3EAE",
            "text": "I tried halal crisp the day they opened and were giving out free platters from 2-4. I was hooked. The customer service is impeccable! The food is fresh, fairly priced with nice sized portions. The chicken over rice with signature sauce and spicy white as well as green sauce is amazing! The chicken loaded fries are my new favorite! If you in woodhaven hit this place up, you will NOT be disappointed. Definitely worth it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVWR6ZHNUMWhFUzNoemQxOUtiWGhhU0ZsdFNIYxAB",
            "text": "Best food spot in queens\nHands down\nBeen eating here for the past couple months and I've yet to be disappointed\nAnd now they have burgers so yea\nI'll be here when I don't feel like cooking in the house.\nIf you fan of lamb and kebab meats you'll be amazed of the different flavors that you'll experience in each bite\nThey also offer 2 types of rice\nOther than the one order they messed up for my girl\nI really can't complain about this place\n5 stars"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeXRUdF9RRRAB",
            "text": "Halal crisps truly stands out as a halal restaurant that goes beyond expectations. The food is authentic and delicious!! The service makes you feel like family. They food is fresh and they take their time to perfect every order. If you’re looking for a wonderful meal, this place is a must-visit. Highly recommended!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbDcyS0JREAE",
            "text": "I’ve been trying to find a halal spot in this neighborhood for awhile now & let me say this place did NOT disappoint. I ordered the chicken loaded fries and it was so good that I had to order 2 more to go. I had mango lassi too and it was delicious. My wife enjoyed the chicken sandwich as it was crispy and cooked to perfection. WELCOME TO THE NEIGHBORHOOD HALAL CRISPS! Keep up the good work! Shoutout to the owner and the whole hard working team!!!👏🏻"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2preGRYTlpXSEpLTVdWNmJsaGllRXQ2YlRaTWMxRRAB",
            "text": "Food was decent, chicken bites are dry, mac & cheese was average and the beef  smash burger was absolutely terrible. But what I will say is their chicken and lamb platter was very delicious and meat was tender, rice was flavorful with the added sauce, the wings are also excellent. If I do try them again it’s only going to be for the platter, and wings."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVeGFFMWZSamhIWTJKSGN5MTBabmhWY1hCMFMxRRAB",
            "text": "From the moment we walked in, the atmosphere was warm and welcoming. The staff was friendly, attentive, and made us feel right at home. Every dish we ordered was bursting with flavor and beautifully presented — you can tell the chefs truly care about their craft."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeGIySXNRRRAB",
            "text": "Super clean spot with great vibes and fresh food! I had the sweet chili wings and they were delicious - perfectly crispy on the outside and juicy on the inside. The sauce was a perfect balance between sweet and spicy. I would recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQVDZwYWlRMWFQU253RRAB",
            "text": "The food has great taste at a great price. Halal Crisp is honestly one of my favorite spots to get a tasty and well-valued meal. The combination of a chill environment, diverse offerings, and speedy customer service brings me back time and time again!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzZ1o3Z2R3EAE",
            "text": "Atmosphere is very clean and impressive. I’ve ordered their popular chicken over rice platter with their highly recommended signature sauce and it was PRONOMINAL!"
        }
    ],
    "reviews_count": 71
}