{
    "name": "Hibiscus",
    "place_id": "ChIJ_bnP4EpnwokRIl7G2y8p6Dw",
    "grid": "QN9",
    "address": "124-18 101st Ave, South Richmond Hill, NY 11419, USA",
    "rating": 3.7,
    "user_ratings_total": 1276,
    "phone_number": "(718) 849-4225",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wa2RHUllPVWRoUTJOcE5qZFBVemwzYmsxTVJrRRAB",
            "text": "I enjoyed their meals and had a great service by Sarah."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CcU1tWkxZMHBCZW1GemRqYzFXbUZuWWw5WVNXYxAB",
            "text": "Always a pleasure dining at Hibiscus Restaurant!\nSarah consistently delivers top-notch service — our orders come out quickly, and she always checks on us without missing a beat. The food is great, the atmosphere is welcoming, and Sarah truly makes the experience even better. Highly recommend stopping by and asking for Sarah!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeFV6TnFOVFpDTTNsMU9HUlZRekYyVTJsSlpHYxAB",
            "text": "Really bad, I would not recommend anyone going to this place. The waitress was very rude and disrespectful when we ask after 1 hour and no food is being served she started cussing at us calling us names and insulted my kids..she should be fired"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1ckx5a2NBEAE",
            "text": "Great Guyanese cuisine.  Always have to go there when my friends come to NY."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VelIwTlFkM0l0UjNsRFZGcFhUWGRqUTNoeGFWRRAB",
            "text": "We got in, was greeted with you guys can take a small 2 persons table . Which we did. We sit there waiting to be attended, but never. We was passed 4 times by the waitress. Never was asked if we want anything to drink."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUmJEQlNRWEZNY1c4eE9GQkRla1JSVTBrMlNYYxAB",
            "text": "Customer service- I received a take out order that was missing a whole meal. I called to rectify the situation. I was placed on hold serval times and each time someone returned to the phone I had to repeat my concern. I eventually hung up the phone without getting my missing order. Additionally, presentation is everything. The food was thrown on the plate. Extremely disappointed."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paSFVsUjRkMng2YWpkVGJTMXFTbU5UVkZoR1UxRRAB",
            "text": "Worst food wastage of money"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMFZsQkNNa0pQWWxKeFowSkJjVXBEY2tKVmFtYxAB",
            "text": "I’ve been going to this restaurant for many years now haven’t been there in like 6-8 months the food wasn’t the same"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WUmVEZG9lbkJtTVV0VWFrcEhNaTFzU1ZCR1ptYxAB",
            "text": "Food was great, definitely worth the price. The server was really friendly as well"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOQk9WbHdXVWcwVFZKNVJVZ3hRVVZDV0VwZmFtYxAB",
            "text": "First day we walked in about 2-3 weeks ago, NO AC. Today, since the AC was working we decided to stay. There were multiple available seats in the restaurant so we chose one that’s a booth  & sat down , it was four of us(two adults & two toddlers) as we walked in, there were 2/3 tables that were uncleaned, I’m not sure if they’re short staffed or whatever the case may be. Anyway , The rude obnoxious waitress walked up to the table, no greeting, not even a hello . She simply stated “how many of you are there? 4? You can’t sit here , we don’t allow guests of 4 to sit here it’s for 5 or more” NOT EVEN THE DECENCY TO SAY DO YOU MIND SWITCHING TABLES , she just proceeded to say “you have to go over there.” There were multiple available booths for parties of 5 or more like she mentioned , all of those were opened actually… terrible service. my husband even asked if we need to buy an extra meal or pay extra for the seat just to be a bit more comfortable with the kids, she refused and simply said “NO, do you need a high chair” then seated us the closest next to an unclean table!!! I decided to then walk right out with my family. We didn’t even bother staying because that introduction right there was very unpleasant ."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oVFdIVnJNWE55TTAxcGIyWnhTRFZhT0dkRGVrRRAB",
            "text": "This is the worst fried rice I ever had. The food had no taste. Don’t even waste your time or money."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kbGJURnZVWFpxTmtJMVdYSnRNMDlFZWpoUU0wRRAB",
            "text": "Had a bad experience there, and I'm never going back, their standard dropped so sad."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KSlVHaFlRazlVYWxKSVZHOVBWbTFXT1V0VFUwRRAB",
            "text": "1 star for the friendly server 1 star for the hurricane drink the food was subpar. Big portions of subpar food. Good tasting drink in a small fluke more ice than drink. Tried more than once. Disappointed each time."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWM00wVnJhbFpCZFVkTVIydHJUWFpVWmxjMGNHYxAB",
            "text": "Old rubber chicken and expensive"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBbThpNk1nEAE",
            "text": "Food is not the same as it used to be, dhall very chunky and looked rushed, not cooked properly. No pepper sauce whatsoever, no napkins, no spoons or forks! Why do you have to ask for the thing?"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJZmlucGl5NnJIWXVBRRAB",
            "text": "Maybe we came at a bad time but the overall experience was absolutely terrible. We came on a Sunday around 8:30pm (they close at 11pm so it’s not like we came last minute). Maybe the waitress was tired but she forgot our order twice. After giving her our order 3x, she still messed it up. I ordered chicken with mixed vegetables, she brought only the mixed vegetables. She brought the chicken separate and said she won’t charge us for the chicken as if it was a favor. WELL DUH why would I pay extra for an order you messed up? The food was tasteless, rice was hard, the PEPPER SAUCE WAS SPOILED BY THE WAY, and barely any chicken in the spicy garlic chicken fried rice order. They also automatically added a 15% tip when the service was absolutely trash. Not worth it.  Would not go back and would not recommend. Rice Bowl on Liberty is way better. 👎🏼"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3a3UzMzV3RRAB",
            "text": "they r rude\nUpdating my review so disappointed, decided to spend Mother’s Day at home since it’s my mum first Mother’s Day in New York, I love hibiscus and I ordered $160 in food and appetizers plus payed for extra n did not get it, boy oh boy I was ashamed Chinese chicken was hard as rock, I order no pork no beef, my forking food came with beef I am Hindi.. I don’t eat beef.. I did Uber eats, I called them now I have no dinner I literally live 10 mins drive. I cal and the cashier said call back she have to talk with the boss(female). They told me filled a claim on line to get refund, me now thinking they’ll be nice to deliver my dinner so I can have a meal and happy Mother’s Day\n. Never again never they’ve losted a loyal customer"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJalBnTENpLWJfZWd3RRAB",
            "text": "The food was overcooked. Men who were inebriated were going in and out of the kitchen. Tables were not clean."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJLWd0THJPdHNlTmlnRRAB",
            "text": "Please do NOT waste your money on this restaurant. We ordered over $100 on food and it tasted as if it was recooked 5 times and the chicken was dry and no taste, almost choked eating it. The rice was hard no flavor except sugar. I tried calling to speak with the owner/ manager and per usual they aren’t available ever. This restaurant deserves to shut down at this point. Customer service is -1/10. Guyanese restaurants are such a let down!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNWEowTmI0dFlEZS13RRAB",
            "text": "Listen.. the service can improve but the food and the atmosphere is definitely something that you should experience!  The fried rice is hands down top three best taste in Queens!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQcUl1SkdMM2RTd213RRAB",
            "text": "Hibiscus Restaurant and Bar serves a unique blend of Chinese and West Indian cuisine. The fusion dishes are flavorful, and the portions are generous. The restaurant has a vibrant atmosphere, and the service is prompt. It's a great place to experience diverse flavors in one meal."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJN3FDcnRnRRAB",
            "text": "I go here for the chicken and fried rice 10 out of 10"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJam91aDJ3RRAB",
            "text": "So disappointed with this restaurant for their service was very bad we ordered house specials fry rice with no pork because we don’t eat pork at all  I specific told the Waitress that she said no worries we got the food my Start eating an there Where we go pork at at the bottom of the food I try to explain to her but this waitress was very rude and mean she Accuse us saying we put the pork in the food like how why we will do that she have very bad ways but they did disregard with the money for the food but that’s not the point what if something happens to us after we got home I will never buy food from this place again ever I do not recommend this place to nobody that’s is Muslim don’t go here plz an the Upper management need to talk to their Waitress the red hair girl sorry I have to Describe her like this but I don’t know her name to all my Muslim sisters an brothers don’t support this place at all they don’t know what they’re doing in the kitchen at all I told her go check the Camara she will see everything she refuses to all she did was fighting with us so guys please be careful when ordering food from Hibiscus restaurant don’t trust them"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NDdfandRRRAB",
            "text": "Great food and atmosphere. Trisha is the best server there. She always takes extra care of my orders."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bFpfS0xREAE",
            "text": "Service food was good"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBamJ2TEF3EAE",
            "text": "Another great caribbean forward place to go in queens. The prices is definitely worth the portions."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzZ182cjRRRRAB",
            "text": "Jerk chicken was very dry and not sure if that's how it's supposed to be prepared. I was very hungry and didn't want to complain about the dry chicken."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmX2RpRFB3EAE",
            "text": "I bought  chicken  with fried rice and chicken  was burnt\nRice was hard .\n\nHard enough  to choke a horses\nAnd it's  not 1st time."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcGJUdnRnRRAB",
            "text": "Visiting friends from Trinidad, taking them for what I thought was a great Guyanese experience, only to be met by the most disrespectful and disgusting server. Waited 15mins, no service. We walked over to the bar and got drinks. When the server finally approached I asked if they were under staffed and without missing a beat the server decided to inform us that we were loud and obnoxious, only two servers and they were busy! Busy with 2 seated tables…… I will never visit this establishment and hope no one else does. Had a great night at Nals’s Nest where customer service is top tier!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNma1lhVDV3RRAB",
            "text": "Disgusting food. Black and soft boiled rice which supposed to be fried rice. Real turn off. I’ll\nNever ever eat from there again. Poor service."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcjd1Z2N3EAE",
            "text": "I was there 2 weeks ago with my Bf and his family for Lunch. We ordered our food, we had a very friendly waitress. when she brought our food - I Noticed a hair on the rim of the plate. I said something not sure if she heard me or not - but my Bf family said “ it’s ok don’t say anything to her mistakes happen” which tends to happen. Not going to disagree. ( she had her hair opened down). But I honestly feel that management needs to reinforce that all waitress must wear a net to protect their hair from falling into peoples food / plate. Someone else might have made a ugly scene for such poor quality. I know they want to display their beauty for attraction while serving - but keeping your hair underneath a net might save you from getting bad reviews, and maybe losing customers. I mean - whenever we go to Queens we always look forward for Hibiscus food, and good quality service's of  course ( Excellent food )!!! We love eating here and I hope next time when we go back they have on their hair net. Thank you!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bTlET0NBEAE",
            "text": "First time and definitely the last food was overpriced and disgusting"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2eTd1Skx3EAE",
            "text": "I ordered $80 of food on Uber and they sent me recooked food from yesterday. What a shameful service from you. This is embarrassing and unacceptable service. Will never buy from here again. Can clearly see on the chicken is refried."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dHVPRnpnRRAB",
            "text": "Good use to be good now it’s disgusting."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdl9MZDd3RRAB",
            "text": "So disappointed. I was excited to hear that this restaurant was back because they used to love their fried rice, but the quality of their food has gone down and they constantly have items out of stock. I made an order on Uber eats and my order was missing items twice in the matter of two weeks. Uber was unable to reach the restaurant to get a refund and the restaurant was unwilling to provide a refund or to replace the item, even though I offered to come pick it up and show them the physical receipt that I had in my hand that I was charged for all three items each time Their waitresses and managers are very rude and unprofessional, and I will be spending my money elsewhere."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQbWEtSWJnEAE",
            "text": "Honestly give them no stars. Food was horrible! Especially for a Saturday! Food tasted spoiled and dry.  Had to throw it out. The manager refused to do anything. Theresa is full of BS! Didn't ask for a refund, asked to make over my 4 plates…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQdm96ZWFBEAE",
            "text": "When I was there with company few months ago we ordered fried shrimp 🍤, one came with the shell on so they replaced it. Now we ordered veggie lo mein & the same fried shrimp. BUT THE SHRIMP WAS NOT THE SAME & THE VEGETABLES WE'RE LITERALLY RAW NOT EVEN A LITTLE STIR-FRIED ...... BUT THE REASON I'M DOING THIS NOW IS THAT THERE IS A STAPLE IN THE FOOD I BIT INTO. I'LL KEEP IT JUST IN CASE. I HV PIC. Just be careful, hibiscus is not what it used to be at 124-18 101st Ave. Richmond Hill Location. So upset 😡"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNid28ySjBRRRAB",
            "text": "My family has been coming to this place for years, over a decade and the food was always hit or miss. Sometimes, the food would be good and other times the food would be rather mediocre. In my most recent visit, the food was actually great but in our three visits before that, it wasn't that good. We like to order fried rice and sometimes you get a good amount of meat and sometimes they skimp. Sometimes the rice tastes nice and flavorful and sometimes it doesn't taste like much. Overall, no consistency which is why I normally would've gave this place 3 stars. I gave them one because in almost every visit we've had with them in the past few years, some of the food containers will have lids that aren't secured over the food. Like in our most recent visit, two out of the four containers of food had loose lids which meant that there was nothing stopping the food in the containers from spilling out into the bag. When taking the food out of the bag, I had to rip the bag from the side and hold the food from the bottom just so the food wouldn't spill out. I'd understand if this happened once or twice but given that it's a reoccurring issue, I won't cut them any slack. I've never had any issues with loose containers of food at Kaiteur, New Thriving, Jade or Caribbean Cabana. Just saying, Hibiscus can definitely do better"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1cFpPVVNREAE",
            "text": "Visiting from Australia ( the only Guyanese living downunder..hahaha), I have been watching Hibiscus Restaurant and Sybil's Bakery on Utube, promising myself a treat whenever I visited NYC. Well, my wife and I were taken and treated to lunch by dear family friends. Guyanese food is on another level, the perfect mixture of Guyanese Chinese / Indian food and style of cooking and Hibiscus restaurant didn't disappoint  : from Spicy Shrimp, Spicy Lamb, Dahl puri and Dahl,House Special Chow mean, Beef Cook-up rice, Beef curry and rice, Chicken curry and a Roti..all went down deliciously, scrumptiously well,washed down with Mauby, Sorrel and Kola Champ. Thanks to the waitress who served us expertly,always smiling, and thanks to our family friends Mignon and her son LEE for taking us there and paying for lunch."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNbWRiTzh3RRAB",
            "text": "My first time there cause a family member told me about the restaurant and it didn’t disappoint. Nice cozy spot and I got to watch cricket, which I haven’t seen in a long time. My food came out quick and was tasty. My waitress Trisha was great and kept checking on us. I will visit soon again with family😉…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSeHZ2UG9RRRAB",
            "text": "It’s been awhile since I visited this location. I was craving authentic Guyanese cuisine so I got one of my BFF and we had drinks and ate there was no take away that’s how much we enjoyed what we ordered the waitress we very courteous and attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6a0lyZzR3RRAB",
            "text": "I order food today and this is what I received. The fried rice look burnt, it has no vegetables. Not sure why. Smells disgusting. The chowmein smells like it was cooked is stale oil. You can look at the picture to see the oil on it. Not sure agin why there was really no vegetables in these food. Unless they don’t make it with vegetables."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxNmFqYnV3RRAB",
            "text": "I ordered Shrimp Chow Mein & Boneless Chicken Fried Rice. Both meals were fresh & flavorful. I'll be ordering again or have take out. Delish."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNUp6bHR3RRAB",
            "text": "This is totally unacceptable. Duck chowmein ordered 3/1/23 ~6:00pm got the entire duck neck it seems like with leg part filled with feathers and few other bone (ribs looking area of the duck) I didn’t expect my order to be filled with so…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLbXZDRUJnEAE",
            "text": "Order a mixed fried rice, mixed Lo me in and general tso chicken via Uber eats. Didn’t receive my correct order. One wrong order had egg in it which my son is allergic to. I’m planning to file a law suit. Disappointed."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjbXNHNHpBRRAB",
            "text": "(1)Love the roast pork fried rice, my issue is the long wait for food. Delivery is always 60 to 90 min.  (2) my dining in experience was overall great. The waitress are friendly and service is great, great prices"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPbXBXR3R3RRAB",
            "text": "Food was nasty,this place should have zero star ,I ordered chicken fried rice and chowmein, food looks like leftovers that was cooked numerous times along with chicken which was stiff and hard,there is feathers on chicken ,called and spoke…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNleXFhWmdBRRAB",
            "text": "I had food here on a 3 occasions because my dad bought it. I would never go buy this on my own. The first time I had it never liked it. My cousin was craving some guyanese chinese unfortunately chef quang (check them out) was closed early. He bought this instead. It was extremely tasteless like where is the flavor?  I really struggled to finish this lol this is what I get for being greedy."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwMV9LNTJnRRAB",
            "text": "There is a bit inconsistency in the taste of the food, I always get fried rice, lowmein and chownein. The chowmein seems to be tastier than the other two. The fried rice tastes ok but the rice is always a bit too hard. This is the place we…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNbzhldjhnRRAB",
            "text": "Found out about this place from my girlfriends family and wow! Great food here. Their vegetable fried rice is perfectly cooked and has great flavor. Also their chicken is great, just be careful of the bones. Love the food here and will…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3cTllekxREAE",
            "text": "They have good food.....\nBut it is UTTERLY UNACCEPTABLE that EMPLOYEES /GUESTS SMOKE RIGHT IN FRONT THE ENTRANCE.\nNOT GOOD DISPLAY FOR PATRON. AND ESPECIALLY EXPECTING MOTHER'S AND CHILDREN. ESPECIALLY FOR NON SMOKER\nTHAT IS THE PROBLEM HERE."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRa2JHLVZ3EAE",
            "text": "Pretty good food and good service for both eating in and taking out. Taking out is the best by the way. When you order for pickup and they say it's going to be ready in 25 mins, get there in 20, because its going to be ready in 20. The…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPcGRmWTl3RRAB",
            "text": "Food look like it was predigested when i open the tray. The chicken was only chicken bones. No meat at all food was dry and nasty. This place seen better days"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvdF82Q1pREAE",
            "text": "Shrimp fried rice and the hibiscus drink is amazing here. The best caribbean food I had in a while. Will be coming back soon."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJN3FqSFFBEAE",
            "text": "GUYANA 🇬🇾\nEat the World NYC review:\nIn a two month long search to find Queens' best cricket bar for a story that never happened, I kept returning to The Hibiscus in South Richmond Hill. There were stories of the owner coming in long before opening time with his friends to catch a feed from somewhere on the subcontinent, the kind of thing many European expats and football fans in this country do at early opening bars so they can watch English Premier League or Italian Serie A.\n°\nA lot of the menu, like most Guyanese restaurants in this section of Queens, is devoted to Guyanese-style Chinese food, a mashup with beautiful results. The jerk pork lo mein ($11.95) is one of these beauties, luscious and fatty hunks of pork full of pepper and spice placed right on top of overly sweet western-style lo mein noodles.\n°\nThe combination works well, and so do the rest of the entrees and appetizers that toe this line. Every country with Chinese immigrants (probably every country in the world?) has their own versions of tweaked Chinese foods to cater to local tastes, and Guyanese is up there in the running for the best."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYZzVYUEFnEAE",
            "text": "The food was good, but if you're going to pay these prices for food you expect to get your monies worth. I ordered chicken fried rice and the chicken was half a leg cut up, I also ordered shrimp fried rice and like the other restaurants expected the large shrimps but there was just small shrimps in the rice. Will not be patronizing this business again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJaU9qa0F3EAE",
            "text": "I'm addicted to their fried rice and chicken. Lovely place to eat while listening to some nice Caribbean music."
        }
    ],
    "reviews_count": 57
}