{
    "name": "Nals Nest",
    "place_id": "ChIJfcW5GFtnwokRk-J2g76sPtI",
    "grid": "QN9",
    "address": "125-17 101st Ave, South Richmond Hill, NY 11419, USA",
    "rating": 3.7,
    "user_ratings_total": 822,
    "phone_number": "(718) 514-6482",
    "reviews": [
        {
            "date": "10시간 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWmIxcHhWM0UyUzJsNE5IQndSemxxZEVvd2JsRRAB",
            "text": "Food is on point but the service sucks the ladies working in the front feel that they everything need to improve on the service"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0TGVGWkNUREJmVDA1NE1FcEdWV1o2VVRGNWJuYxAB",
            "text": "The fried chicken fried rice is one of many that I had in queens hands down the best of all I date that 10/10 excellent very tasty reminds me of fried rice from guyana even better highly recommend"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdmNFRmZhRWN4YlhoV2EzaGlWRVUzTTJvM2NHYxAB",
            "text": "1st time there food was on point the presentation was the most beautiful I've seen so far but only dislike the booth area chairs are extremely uncomfortable it a very tight space and the chairs are so up right it hurts your back so I won't dine in again but will definitely order from them and waitress are very professional"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTVVtTXhOVEIzTWtKcE4xbzVXblZCYWtaWWJYYxAB",
            "text": "Good service"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSdVdURnNiVWQ1Wm5ob2IwaGhXa1ZhVEcxV2EwRRAB",
            "text": "I hosted a dinner party here and it was fantastic. The food was delicious and a big hit with all our guests. The staff were attentive, friendly, and went above and beyond to cater to our needs. Highly recommend for anyone planning an event or just looking for a great dining experience."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsRGRVSTFkVUpTWW1Gc09YVmpNMjVQY0VoVk1VRRAB",
            "text": "Cristy is a fantastic bartender, she always checked up me. Mad sure my glass wasn’t empty. The food was amazing definitely recommend the cha chi Kai chicken. Always good vibes here."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxalRFa3dlSGh6TFdsdVVHeHhla2gyVG1sT01WRRAB",
            "text": "Love the food and atmosphere! Trish service was great!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204NWJHRkdkWEppVUc5ZmMydHNNRFJVUVhoeGFHYxAB",
            "text": "Great atmosphere , Delicious food and amazing service by Trish!!! My new spot whenever I'm in Queens NY!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kbk5uZ3RXV2RzYUVvMFNHVklSRTFoVURsTVptYxAB",
            "text": "Food was good service is terrible order fry snapper fish  wasn’t fresh ask for a glass of of water never get it need more staff"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taSk1XcENhRmxUZUc5b1FpMW5URmQ2YWxSQmJtYxAB",
            "text": "nice"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wa09HMWFNVXBUY1dkSGNrcFpNRWxXTkdFMllVRRAB",
            "text": "Im uber driver The restaurant Employees are so bad in behavior. they don't know how to do respect for the person. they don't have manners as well . They never talk politely with anybody. the are so disrespectful."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NGVsSktWVXM1ZVhkcVRXSllSVTAwVDBWNFoyYxAB",
            "text": "Took a whole entire hour for them to make a single fried rice. Don’t accept an ubereats order if you can’t have it ready in a timely manner please.\n\nEdit:\nIn hindsight, I realized I was probably just hangry. The food was exceptional. Perhaps it was more Ubers fault than yours."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkekxWRmtZelpSZGpKRlREbG1ORWN5Y2pkNWRVRRAB",
            "text": "Our servers were Trisha and Lick, their service was amazing, the overall experience was really good. The food and music is great, definitely recommend locally !!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKU2RGTklOMU16VEdkT1VVUjFOV0UwYVZvMlJrRRAB",
            "text": "Trish and Nick was our server\nAnd they where amazing ❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1Sk5UTTFUMlZ0ZDJzeE5XazBZa2Q0Ymkxd1lWRRAB",
            "text": "They food is really good but the service sucks when ordering through door dash, if they cannot prepare the order on time through door dash then come off the app or give people more time for the food to be delivered. Thank you"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJeFFXeFpPV05uYVZsbWN6QlZNRXhVVEV4WU1rRRAB",
            "text": "We ordered some paku fish, grilled shrimp, nal's wing, gilbaka curry with roti, nal's wings fried rice, chicken fried rice and chow mein and everything was delicious. We also ordered some leeche martinis and pina coladas which were also good. Our server, Trisha, was courteous and friendly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CWlVtTmhaVXBwVjJaM1puWnVVV2xRVm5ORGVrRRAB",
            "text": "I was there last night with my mom n dad n husband the food was really  great lots of flavor.  The cha che kai chicken the pepper shrimp and the lamb pudding was the bomb\nThe food is really tasty. The waitress was nice . Awesome place to try . Lovely environment.  I will recommend  ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4NGRHWkpaRGxNYmxKdlNVUmllbWRNTjBodk5uYxAB",
            "text": "So the food is fine and staff but the wait time is ridiculous and I came with a family and it was there birthday and they don’t allow you to bring your own cake"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnNmVPMlV3EAE",
            "text": "Delicious Caribbean food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nMFdteHZUR2gzV1RWR1pHMUNTazFmTFd0NlJXYxAB",
            "text": "Tricia is a pro. Food is very tasty and the place was redone nicely ."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJbjNtZXJJOTYzMXFnRRAB",
            "text": "The only good thing about this place is their atmosphere.\nThe service is so horrible. We waited 15 mins to get our menu. Our food took 45 mins and they wasn’t a lot of people in the restaurant. The portions is very small after the “New Opening”.\nI was very disappointed with the service and food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KbmNUSjJNVkJsUTBsaU5rTnJPVGR6T0hwSVNsRRAB",
            "text": "I Celebrated a birthday party and everything was great. Amazing food and environment!! Sandy is amazing, she ensured that everything was the way me and my family wanted. Nals nest is always a vibe!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMFpFNUtORzR0TWtaTGVHNTJTakp2U1haelVYYxAB",
            "text": "Slow service if you can’t give orders on time then stop delivering online"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsM2IwWTFRMDB4Y2psaWEybHZSSE5NVVdsa2FXYxAB",
            "text": "I was here with my family last weekend for dinner and Im so glad we gave it a try, literally all the food we tried was on point, packed with Caribbean flavors and tasted amazing, we reordered some more to take home, our server was Ashley, love her she’s super kind and really helpful. Good vibes with good music. Definitely going again, would totally recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRd2RFUnZRMTlIV0RKaWRsTk1NMFZ3YmkxT1RXYxAB",
            "text": "Good place to relax and chill"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNNVgydFhUMDVRY1drek1sbGxOVFZPVlhwVWJrRRAB",
            "text": "The chicken was super dry and unseasoned, the place is clean and looks nice but there was a drunk man who kept yelling and talking super loud and also harassing someone"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210U1FrTjJPVVZaV0ZrNVkxUXdZM1V4YVdKcE9XYxAB",
            "text": "This place is amazing!\nFood is great!\nCustomer service is on point!\nThank you Maria, you were exceptional!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTFdtTTJMVkE0YmtORFEwOXpiWE14TlUxM1dFRRAB",
            "text": "Trisha was great! Let us in late before they close and the fried rice was great! Best rice I had ever, me and my family had a great experience"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrblpYV2N3EAE",
            "text": "Space is beautiful. Food is delicious. Waitress is very nice.\n\nNeeds caribbean desserts & additional waitress (I see they are working on this with the help wanted sign).\n\nWe've been visiting regularly since the renovation and have plans to continue supporting this local business."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSRlRWUnFOa0YyVTNwU1gyWkdWalI1VGxOUFdsRRAB",
            "text": "I had the pleasure of visiting this restaurant yesterday, and I just have to say, Trish, our server, was amazing! She was incredibly friendly and made us feel right at home. The food was delicious too! I highly recommend checking it out!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZMFVWcGlORE5VTW1vd1RHaHFSWEJKVVZKdFJtYxAB",
            "text": "Trisha was so nice and took care all our needs . Food was fantastic thank you"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tod05tSkJSazFCZDBJeExXdGtVSEYxY3pkb2NWRRAB",
            "text": "Highly recommended"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toekxWTkRjbkpvY1c1MGFuRklOR2hqU1hOTGFGRRAB",
            "text": "Great atmosphere, service and the food is very delicious and fresh.."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVWQxTXdURTFmYkZrMlpGbE1WRlYxWW5GMGJVRRAB",
            "text": "Did my daughter 5th birthday at Nal nest and we had an amazing time all the staff was very nice I really appreciate the effort they put in their job"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJd0xXdHpYMlUzWVc1UWMxOUphWEkyWkU5S1owRRAB",
            "text": "Came straight from the airport to here and the food was so good I’ll be back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvMmFVUkphMjlGWDJaMGRYVmpiV1Y0VjNoQmQxRRAB",
            "text": "Very poor Service food is good but wait time for food is Unreasonable. 45 minutes and food still wasn’t served… won’t be back here to dine in …"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psQlQwbzFlRTF3VEdkTU0zVXdhV2N4T1d4eFNGRRAB",
            "text": "Great food and atmosphere. Celebrated a birthday party and everything was delicious. Trisha was our server and she was amazing. We will definitely visit again when we are back from Canada."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kNVIzaFNNVUZZTmt3MldrZENNWHAwZVRSUlkxRRAB",
            "text": "I bought $80.00 worth of food just to bring it back to Long Island to have spoiled food and on top of that had to wait an hour for it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVVdFNHpkR013WmpRNVZtWjJOemx5TjBodE5XYxAB",
            "text": "Absolutely amazing environment."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOWU5VbENRVGhyYjJaRFNtRk9aMlJYYkhwWlRuYxAB",
            "text": "Too much salt. Not edible"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQX1p6TlF3EAE",
            "text": "The remodel of the restaurant is beautiful!! The owner greeted the party and suggested great options off the menu; we were not disappointed. The lounge/bar that is located on the other half of the venue has a great DJ with great soca music! My only suggestion is to revamp the cocktails; the price point didn’t match the taste. Overall, I would come here again to dine!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3allia25RRRAB",
            "text": "Went to this restaurant for dinner. I’ll start off with the pros. The restaurant is beautiful. Everything is new and well decorated. The table set up is really pretty with the plates, chargers and decor. The staff had the best mannerism I have ever encountered at a West Indian restaurant. The food and drinks were great. They didn’t seem to have enough food menus and they didn’t have a drink menu. We were told they would be getting that soon. The appetizers we got were the cha chi ki chicken and nest wings and we got the egg fried rice with jerk chicken and house special fried rice with pineapple. Everything was very tasty.\n\nNow here is where I get iffy and docked a star. When we got the bill there was a service charge of 10% and another charge for (I’m blanking on the term they use on the receipt). If you paid in cash it takes off that second charge when I did the math. Adding gratuity to a party of three is a little skeevy, but I would let it go because regardless I always tip well (especially for their great service). However, on top of that  tacking on that other charge for credit card under different terminology adds another layer.\n\nI would definitely come here again because it’s close to where I live and the food and service was great. The monetary part is questionable so just beware when paying your bill."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIaFlydlFBEAE",
            "text": "The food was beyond amazing! Yes, they do take a little long to bring the food out BUT thats because everything is made fresh and isnt just sitting there for a while.. the cha-chi kai chicken is the best Ive had thus far, definitely will be coming back!!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHZ3Y2YkdnEAE",
            "text": "Randomly stopped by here on a Saturday afternoon for lunch. It was not crowded so it was easy to get a table for two. Our server was a very lovely woman whose timing was always impeccable. The portions were large and the food was fresh. I was able to get a barbecue meal that was being freshly grilled outside. It wasn’t the best BBQ, or even close, it was just, OK… Just a fact to note, a 20% service charged is added on each bill, no matter the dining party size. It’s really a tip for your server, which is convenient, and the servers are really lovely."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzd3RyZzlRRRAB",
            "text": "The food was delicious, but I think they could do a little better with the portion of the cha chi kai chicken.\nHowever when it comes to the bill they already including the tips and other fees without your consent I saw from a lot of reviews a lot of people experience that also\nAlso the drink on the little expensive side"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201TlRrcHVTbWRHUnpWaE1YZFhhR3hmWWtoNVRtYxAB",
            "text": "Had a great experience here! The place has a calm, pretty vibe with fun Caribbean music. Trisha was super nice to us and made some pretty good drinks! The food was also amazing, it looked good and tasted even better. Would definitely go again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJLU12Q2FBEAE",
            "text": "I've been coming here for awhile. I loooove the food, Trisha, karen and waitresses are very nice. Drinks are strong, prices are decent. Drinks a little pricy and music 🎶  is always on point. I love it here!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205blZ6TTRTVXhFU0ZOalRuUkVMVVJmU1hOTU4xRRAB",
            "text": "This place is simple beautiful, the decor is amazing.  It's a great place for your family or date night. The food was simply delicious. The service was amazing and the staff will give you a recommendation if you want. Me and my friend had the House special fried rice which also comes with a piece of fried chicken, vegetable lomein and Cha Chi Kai chicken.  They also have a separate room to rent for parties. I will definitely be back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbWFlQWdnRRAB",
            "text": "The ambiance was beautiful. The staff were very sweet and the food was amazing! The presentation was chefs kiss! I will definitely be going back and would love to see what their lounge is like"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3LS12NmRnEAE",
            "text": "Went to nest today for the first time since it reopened. Service was extremely slow since just one server tending to the entire restaurant. We ordered a cha chi kai chicken, sambala chicken fried rice, and banga with dahl &rice. Our drinks came out 15 min after ordering, and our food took an additional 30-40 min. Don't come here starving  and expecting to eat in a timely manner because that's not happening. The cha chi kai chicken was excellent; I have no complaints. The Banga was fishy a bit, but not too bad. The Sambala chicken, in my opinion, was not good at all; it's not the same Sambala chicken as the previous nest restaurant . This chicken had buffalo sauce and didn’t go well with the fried rice at all. I didnt eat it. The fried rice was standard, neither good nor bad. The portion sizes were very small for the price. Usually multiple people can share a fried rice but now its one per person. Our bill was $70, which was costly for just two meals, one app, and one bottle of soda. They also charge an “operating fee” just for using a credit card…It should be noted that when ordering any curry/Banga, the price does not include rice or dahl, which is usually standard when ordering these meals at other restaurants. I was charged $5 for rice and $5 for dahl. The banga mary was $15, so I paid $25 for that meal. The restaurant is nicely redone, but they need to work on the smell of toilet cleaner upon opening the door. I wouldn't be returning, as this was not worth the hype and value for my money."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoOFBhSVlnEAE",
            "text": "This Asian Guyanese fusion restaurant is the only one I’ve been to in queens and I don’t need to go anywhere else! This is my second time coming back to this place and both times the curry goat was delicious. I came here with my wife and I…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCMnQtanpBRRAB",
            "text": "Nice atmosphere- unfortunately, that's going to be the only positive point from my experience. When I got there at 10pm, the place was pretty empty. There was only 1 other person waiting for his food.\n\nI asked the man behind the counter if the meat is halal. He said, \"everything is halal except for the pork\". I thought that was a little odd since I don't recall going to a restaurant that sold halal meat AND pork at the same time. I also noticed there were no mentions if \"halal\" on this maps reviews of this place.\n\nI took a chance and proceeded to look at the menu. The waiter says the food will take about 30 minutes to make. They had some good items on the menu and I settled on the Ox tail and my friend picked duck. The waiter had really disappeared and nobody was around to take our order. How strange!\n\nThe man that was waiting was getting really frustrated too. He was telling me he'd been waiting for over 30 minutes for his order. My friend and I ended up leaving the place. I took some pics of the restaurant because it looked decent. However, I couldn't experience their good. Perhaps it's for the better..."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbXNERkJ3EAE",
            "text": "Delicious food,  friendly service, and upbeat atmosphere. We have always catered or ordered takeout, but it was nice to finally enjoy a meal in-house."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcVA2ZGNREAE",
            "text": "A staple Guyanese Chinese restaurant in the Queens area. We’ve been coming to Nest since I was a kid and continue to come back every time we visit. Some of the best things to order include the lamb black pudding, pepper shrimp (low mein or rice), garlic chicken fried rice, and chicken fried rice. Portions easily feed 2 people per order!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmOHNLVWlRRRAB",
            "text": "Very disappointed!\nI placed an order for roast duck fried rice and shrimp wanton..\nThe shrimp wanton is crap, I ordered this before and got *Shrimp wanton* the real deal!\nThis time I have no idea what I really did got.\nWhen I called them to confirm what they really sold me, they said the shrimp wanton is mince,\nlike who the heck sells mince shrimp wanton?!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCaDVyY0x3EAE",
            "text": "Terrible times 10. I saw their rating after traveling to NY since 1997 and I thought I would give them a chance.\n\nWell, the fried rice was so disgusting I had to toss the chicken in there to give it some flavor.\n\nThe pepper shrimp, they gave us a handful and we paid full price.\n\nThe chicken foot soup had no flavor at all. Not sure who the chefs are but shame on you. I will never ever venture out again. Do not order here.\n\nThe fried rice perhaps was the most disappointing ..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIanY2MFdBEAE",
            "text": "This one deserves a 5 star. I wanted to Taste test the new Nals Nest restaurant, I decided to order on DoorDash and let me just say this is the best decision I made. The chicken fried rice is a 10/10 the chicken was very flavorful and tasty. The fried rice was really sold and tasty. The garlic chicken was really good. Definitely will get Nals Nest again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIMElTLXVRRRAB",
            "text": "Nal’s Nest offers a mixed dining experience, with some standout dishes and a few areas for improvement. The House Special Fried Rice with pepper sauce is a definite highlight—packed with flavor and a must-try for anyone visiting. I also tried the Cha Chi Ka Chicken and the Lamb Black Pudding, which were decent, though not particularly memorable.\n\nWhile the food is tasty, the kitchen operates at a leisurely pace, so this isn’t the place to visit if you’re in a hurry. Takeout orders face similar delays, likely due to what seems to be a small kitchen staff. The service, however, is friendly and attentive, making the wait more bearable.\n\nThe interior is nicely decorated, but the layout could be improved as you have to walk past diners to pick up your order at the cash register. Prices are on the higher side, especially considering the portion sizes, which could be more generous.\n\nOverall, if you’re in the area and have some time to spare, Nal’s Nest is worth a visit for the House Special Fried Rice. Just be prepared for a bit of a wait."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VLS1Nucm5kcGJ5cV9BRRAB",
            "text": "Did a takeout order. Chicken fried rice was really good. But the roti....if u can call it that was horrible. Couldn't finish it...threw out the rest. The goat curry tasted fatty. Who in the world is cooking the Indian staples? And how can food quality be so inconsistent. Who is checking the quality? Definitely very, very disappointing. Nest under previous management made roti that was delicious."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbmZmNHpBRRAB",
            "text": "Today I ate at the restaurant after they completely remodeled it, and I was a little surprised by some of the new features they added to their bills,\nFor example: tips are included and when they send you the receipt, it says gratuity as if they did not charge you 10% on your meal already.\nI ordered House special Friend rice w/ chicken and they had to change it 3 times till they got it right, also I purchased a Can soda, Coca-Cola to be exact, They do not tell you the price on it, So beware, the can soda was $4 which is outrageous cause I don’t even pay those prices in Manhattan. so if you’re eating here, make sure you stop at a supermarket and get a 12 pack for $7 and a Cup of Ice, the rum punch wasn’t really rum punch.\nAnd it came out $14 😱 as much as I like their food, I probably wouldn’t be coming back here again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VOZTFfWXpyNUluM1V3EAE",
            "text": "2 women Waitresses or bartenders at the bar in the restaurant side were very rude. One of them had short blonde hair. Went to pick up food and they completely ignored us at first and gave us an attitude. Got the food and went home then found out they forgot 2 orders. We called them and they told me i was wrong and it wasn’t on the receipt, which it clearly was because I ordered online. They told me to come back in and show them proof it was in the receipt. We went back and showed them. The blonde one again completely ignored me.\nThe customer service provided was terrible, the attitude of the girls are not professional at all to be in a business dealing with people. It will make people not want to come back.\nHorrible experience at Nals nest. They need to be better at hiring staff."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOV2RqLUxxX0xPYmpRRRAB",
            "text": "Nest Restaurant & Bar offers a delightful fusion of Caribbean and Chinese cuisine. The jerk chicken wontons are crispy and flavorful, and the chicken fried rice is a must-try. The sorrel drink is refreshing and complements the meal perfectly. The staff is friendly, and the ambiance is cozy, making it a great spot for both lunch and dinner."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNGN1T2t3RRAB",
            "text": "So it was my cousin birthday and we done in here Monday 04/14/2025 it was great service from the waitress she recommended the chi-chai chicken which was great. On our own we order peppers duck and roast duck. Along with  few other dishes. Apparently 3 of us ate the duck which got we  stomachache. I got vomiting. The person who didn’t eat the duck was alright. With  conclusion the duck we order got the 3 of us sick."
        }
    ],
    "reviews_count": 63
}