{
    "name": "UnderGround Lounge",
    "place_id": "ChIJ5WvtiElnwokRSbTJpgWtWa8",
    "grid": "QN9",
    "address": "104-09 123rd St, South Richmond Hill, NY 11419, USA",
    "rating": 3.6,
    "user_ratings_total": 113,
    "phone_number": "(718) 322-4144",
    "reviews": [
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKampzczNDcTdYZnJnRRAB",
            "text": "Don’t waste your time and money here. They serve drinks in 4oz cups. Overpriced for nothing. Rum punch tasted  horrible. Went there on a Saturday night and there was 2 bartenders and they were sitting most of the night because nobody was buying  their overpriced disgusting\ndrinks ."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQeUlybE5BEAE",
            "text": "My daughter was laced last night"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYNXJTQ01REAE",
            "text": "Fun late night spot. Very good strong drinks."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJM3YzQ3h3RRAB",
            "text": "This is definitely my go to spot...the vibe is nice, the staff is friendly...it's always a good time when I go..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuenVYQzBnRRAB",
            "text": "Went here a few weeks ago and it was definitely a vibe. Started off at the bar on chill mode and as the night progressed and patrons started flowin in the vibes caused me n a friend to buy a bottle n move to table. The djs def were on point Labor Day weekend and the staff at Underground were cool too. Kaysi was workin and creating an experience for me and my friends in itself. He was cool, dope and attentive, funny as hell and just a good time! would def revisit just to unwind."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROb3FPSUxBEAE",
            "text": "Bartender completely lacked customer service skills, didn’t saying just stood there, and the place is very ratchet, armed security cause there was some shootouts in here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsbnFtN3dnRRAB",
            "text": "this place is probably one of the worst spots i’ve been to in queens. These people are money hungry and would charge you to breathe if they can. don’t waste your time if you want good vibes and good night , DO NOT COME HERE ! and psa. the drinks there suck 🤮🤮"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNseHM2SWp3RRAB",
            "text": "AVOID AT ALL COST!\nI came to spend $1,000 at the bar & give everyone free drinks since at 3:25am there wasn’t a lot of people but I guess the Spanish women had me waiting twice next to people that wasn’t even talking or spending money after I asked for drinks 🍺 and nobody else was ordering.\n\nCongrats to the owner, you saved me $1,000 plus the 20% tip I had planned for the young lady.\n\nI’ll go to another bar & spend real money"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwLTZtYjdBRRAB",
            "text": "I am an out of town retired military police officer & current law enforcement, Tactical firearms training officer. I work with local, state & federal agencies. I have to say, when I first arrived with my wife. I was taken back, because the security guard. Looked like a character from call of duty. But the system they have is very impressive. & even more impressive was the searching, my wife carries a various of self defense items. That I got for her over the years, because she's a nurse. Does home visits & also works at night often. Usually, wherever we are visiting. She gets in with most of the items, simply because security is clueless as what to actually look for. Not only did the bouncer find her knife comb. But he found her lipstick taser & her pressure point tool. He also knew specific case law on why each item couldn't be carried & answered every question about the establishment. He returned the items as we left to cap it off. With a warning to be cautiou of trying to enter places with them. Because some bouncers might not give them back. It was refreshing to stand & talk with someone. Who clearly has years of taken the craft seriously. I asked multiple times if he served in the military or law enforcement. Because of the setup of his plate carry. He had a us flag & sheepdog tag displayed. He just laughed it off & politely brushed it off. Whatever training he has. Shows in how he approaches the job! Also, he pointed us to the cloeh & she was friendly. & helped us with all our needs, she sat her & the prices was decent for a place not far from JFK Airport. Only con was, the food wasn't available till 12ish & then we didn't see it once ordered. Till maybe 1230! Also, once you go downstairs, don't expect to use your phone. I see why its called underground. Had no service whatsoever. Would've been nice if they offered wi-fi in some capacity. Maybe on the menu or once you book your section. But I was there to celebrate my wife's promotion, so I wasn't too worried about my phone. Just when I had to use my card & check a few emails. Give this place a 8.5 out of 10. Can wait to return to nyc, this will definitely be my go-to intown lounge!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdGUtcFh3EAE",
            "text": "DON'T GO TO THIS PLACE!!! The vibe is addictive. You've been warned. You'll fall in love and forget about any other place in NYC ❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aE9tcWRREAE",
            "text": "I’ve been to underground for many years, since the beginning, the early days. Obviously have not been there in years as the scene has changed, I no longer frequent  “lounges” like this as it not a preference any longer. Recently as my cousin was visiting from overseas, we decided to take a quick couple drinks. It still seems to be a decent venue, music was great as always. However, I was really set off when I gave my credit card and id for a drink and without my approval, the bartender took it to a copy machine right by the bar and start it d to take a copy of my ID….without any consent! Was I seeing things? Haha I asked if they were copying my id and nonchalantly she replied “ummm, yes” like this was normal business practice. I think someone needs to update Underground on compliance with privacy laws, violation of privacy rights and protection, storage and compliance of a persons private information. As a business establishment in the present era we live in, it’s an obvious miss in considerations of someone’s privacy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNlA2ZldREAE",
            "text": "Music and vibes are good but the food is horrible. The wings look like they boiled it and then threw seasoning  on top. My whole table sent back their wings. And the lady at the bar just kept saying they were fully cooked lol wish I took a pic. But we got our money back anyway. The fries were soggy as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaDZPVlFREAE",
            "text": "The big fat pills berry security that scan ID very unprofessional illiterate and lack understanding and reasoning ability. I did everything and pass to go in and he was rude and for that reason I did not go in he is very rude and…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoX3ZIdmFnEAE",
            "text": "Best place to spend your bday 🎉🎉…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNV9tLVFnEAE",
            "text": "Nice spot. It’s a vibe"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNV9udUxnEAE",
            "text": "Good so far,  friendly staff."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNocmJ1U2JnEAE",
            "text": "Over price...ND the drink were very weak and water down ... find some where else to go don't waste your time ..."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcmZHSlpREAE",
            "text": "I did my birthday celebration here. From the moment we arrived we were met with niceness from the staff.  Chloe helped me out with drink selection and seating.  She really looked out.  I was very impressed with the atmosphere.  Everyone was…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMVp6Snd3RRAB",
            "text": "Pretty dope spot, had the perfect range of music to please the entire crowd, super friendly staff, they make you feel welcomed and make sure you have a blast!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCcjQtZV9nRRAB",
            "text": "Nice neighborhood spot. Lots of tunes reggae rap and soca/dance hall. (no Indian music) which for me personally is a fresh take to the area.  hookahs are FIRE and bartenders are cute too. Got two bottles from Jamie paid cash. me and my…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCeDdfclhREAE",
            "text": "I love the lights and the music is poppin"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCeDdfT0J3EAE",
            "text": "Underground lounge was a great experience. I had so much fun with me friends. The ambiance was really nice. I’ll recommend the Underground lounge."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCeDdfTTVnRRAB",
            "text": "2nd time here and I enjoy It each time ❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdXR6cy1BRRAB",
            "text": "Excellent spot. The host and owner Josh was very attentive and organized! We had an awesome bday party !!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtZ3RpRTRnRRAB",
            "text": "If i could rate this -5 stars I would. They promoted $5 hookah on Wednesday’s until midnight. We arrived at 11 & the hookah wasn’t even there yet and no one had a clue what time it would arrive. Also, we made a table reservation for 11 pm…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtdktYMFlnEAE",
            "text": "Complete highway robbery. Mandatory gratuity and this was not clear before you place your order. I order one drink and she tipped herself 3 lol unbelievable. Never again"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURleFpTNGxRRRAB",
            "text": "Amazing drinks Hookah and music. Always have a great time with friends here🔥💃🏾…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlOEltRkdBEAE",
            "text": "I love underground the vibes is different Over here"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlOE9TT1ZBEAE",
            "text": "It’s a lit spot"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlOE9UMGF3EAE",
            "text": "Thursday Nights are LIT for the ladies complementary bottle of champagne ‼️‼️ I had a blast great music and atmosphere"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlOEtTdjRRRRAB",
            "text": "Best place to have a ladies night\nWe got a free bottle of champagne"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlbWVlOTF3RRAB",
            "text": "Don’t waste your time or money. Overpriced bottles overpriced liquor. And you wonder why there’s no one there wen u get there. Spend 400 for a couple drinks left went to a spot not to far got shots all night left with a$500 bill this place…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlc096a0RnEAE",
            "text": "Worst club Lounge EVER. Spent over 400 dollars on food and drinks. Purchased a bottle and serval drinks for VIP. Was seating for an hour and a half. Then was told I had to move because I didn’t buy another  bottle. We paid the chef and was not allowed to eat in our VIP section had to to leave before the food was even done because this establishment wanted to give special treatment to another guest. It’s a whole scam do not EVER go there. It’s very small in there and the service is horrible. DO NOT WASTE YOUR TIME AND MONEY. Worst experience I’ve ever had. My things were literally moved from my vip section. Before I even got up. Unprofessional hood establishment.\n\nWE NEVER FINISHED  THE BOTTLE. YOU GUYS ARE LIARS. YOU ONLY HAVE 3 VIP SECTIONS. JUST BE HONEST!!! WE TOOK THE REST OF OUR BOTTLE WITH US. YOUR 1 SECURITY GUARD TRIED TO STOP US. AGAIN HORRIBLE SERVICE. OWNER CLEARLY CONDONES THIS HOOD BUSINESS BEHAVIOR. NEVER AGAIN!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPZ3NPc0ZnEAE",
            "text": "Tried reaching out multiple times in the last few weeks to discuss hosting my daughter's 21st birthday. Spoke to a gentleman one time, he stated he will send a link for an deposit for bottle service and haven't heard back that was…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3dE9PbUN3EAE",
            "text": "Nice place, one of the few spots iv found that play’s good hip hop, reggae, and r&b."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXMnFMZnpBRRAB",
            "text": "I’ll give them a 3 of 5 because the music was decent. But the guy behind the bar is extremely disgusting and thought he would get away with cheating me out of my money. Beware of this man.The price on the menu reads one price but then they’ll try to tell you the price is different. I ordered wings and on the menu it says $9. I gave this man a hundred dollar bill expecting to get back $91. He gives me my money back rolled up and when I open it and counted it there’s only $70… I called him and asked for the rest of my money and he gives this phony apology and gives me $20 more… I asked him where’s my dollar and he’s telling me the wings cost $10. I show him the menu and where it says 9. Keep in mind I got no receipt or anything. Now he’s behind the bar talking about me being rude trying to make me feel as if I’m being annoying. So I told him I want to speak to someone else and he just has me standing there until I called someone else on my own. After all that I eventually walk away then someone comes up to me and tries to slide me the dollar on the low… I paid $$$ for a section and that’s how they treat paying customers. Won’t be going back. They obviously don’t know how to do business. And the wings were disgusting anyway. All that I went through just to throw the wings away."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXbXVLQm5BRRAB",
            "text": "If I could give this place a zero I would. First off, they said open at 10:00 pm, got there at 10.30 and to be told that cannot allow us in since there is no DJ, security or bartender present at the facility.  At 11:05pm finally got in then to be told my jacket has to be checked in, and there dress code clearly states that all COATS, not jackets to be checked in. According to the definition of a coat it's an outdoor clothing that is below the hip. My jacket was way above my hip, and no fur or hood attached. The representative there  didn't care, he was only concerned with his $3:00 fee he has to collect. If jackets are to be included and strongly recommend that the facility update there dress code that is clearly displayed in the lounge and to educate their door representative.  This is the first time I have ever experienced such a bad time at this facility."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxMWJxbld3EAE",
            "text": "Had my birthday party there it was well spend love the atmosphere an the staff was great somewhere I will always visit for sure"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLM19DNzdRRRAB",
            "text": "Josh,  your lounge has always been a fun and enjoyable place from the food and drinks to the music and staff... it's always a pleasure to be able to visit"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLNExEQzRBRRAB",
            "text": "Wonder how much it cost to rent out the hole spot?🤔…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURveExHMHRBRRAB",
            "text": "I'll start with the good, then transition to the not so good. The bouncers were nice guys, very respectful and just doing their job and the music is great (Good DJ). The bartenders are attentive to patrons. The drinks are standard but not consistent. Good luck finding parking in the area. The $35 hookah was a waste of money (not worth it and they can definitely do better in this aspect). The $30 credit card minimum purchase is ridiculous and most importantly REVIEW YOUR RECEIPT as an automatic 20% charged gratuity will appear when you do swipe your card. I personally cant stand when businesses do this but I guess this is a way to encourage cash transactions. Overall I'm indifferent about returning to this establishment"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwNm9lLWlBRRAB",
            "text": "Josh! Josh! Josh! 👏🏾👏🏾👏🏾👏🏾\nHe's the manager of the UNDERGROUND LOUNGE and he made me feel like I've known him for YEARS when I came to celebrate my birthday Friday even though that was our first time meeting. My party had it's own section and the staff was very thorough with bringing out my drinks food and hookah on time. If I wanted it, I got it. They were very personable and friendly. I started with 11 guests and they ended up accommodating about 30 with no problems.  This place has a lot of heart, good music, and the initial vibe you feel when you walk in is very awesome and inviting. The chef that night made chow mein and baked chicken. EVERYBODY LOVED IT! It was really quite tasty. This was absolutely THEE best birthday thus far and I owe it all to the UNDERGROUND and their staff... JOSH FOR PRESIDENT! I will definitely be back. 🙌🏾🙌🏾"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVNXZpeVRnEAE",
            "text": "Bad experience, couldn’t get in because my ID expired 3 days ago! despite the bouncers being able to see my age. On top of that, I watched at least 6 people go into the lounge prior to me and some didn’t have to show ID and none of them…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRN2JxWkFREAE",
            "text": "Went there for the first time for a quick drink on a Thursday night with a friend.  Though the place was aesthetically pleasing the bartender was very indolent and uncongenial. We had to ask her to garnish with drinks appropriately and…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjeWZhWDZnRRAB",
            "text": "The security guards that worked Friday March 13 are disgusting & money hungry. Me & my fellow service members go to the underground often, we always dress decent but because the club wasn’t getting any money they told us we can’t come in…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNrb2JYYzJRRRAB",
            "text": "Cool place. The staff is down to earth. The drinks are good and decently priced. The DJ is ok. It's a cozy spot. The only reason why I didn't give it 5 stars is because once you go down there, you lose internet connection. They should have the wifi password displayed on the menu, bar or somewhere else. Still, I will definitely go again."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURReG9tNVdBEAE",
            "text": "They are very strict about your age you must be 21 and older to get into this place other wise the bouncers will not let u in even if you're 20 years of age.. The DJ was great, good vibes nice club especially for Caribbean people."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzeHQ2UzlnRRAB",
            "text": "Underground Lounge is a vibeeeee. Intimate space that holds a decent sized crowd about 100 ppl. Decor is nice and NOOO DRAMA. If you love Soca this is the spot for you. They play Reggae and hip hop also but about 75% soca (its a Guyanese spot in Queens) I brought in my birthday here and got a very affordable package that came with 2 premium bottles of my choice plus a bottle of Belaire Rose making it 3 bottles for under $400. What a great price. The service from start to finish was professional.Josh handled our party and I was able to pay for everything beforehand. Transaction was very smoove. I would definitely come here again. Oh and food is available- Rasta Pasta and Jerk and curry is on the menu. You will definitely enjoy yourself."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLbGREamJREAE",
            "text": "Bare vibes, great music and the owner is amazing!!!!! Not to mention the food was really really good also. And I had the best mojito of my life here too! Genuinely will be back with all my friends"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3b05TRkh3EAE",
            "text": "I love this lounge. Even though the one time I bought my boyfriend here, the bartender accidentally gave my boyfriend's debit card to the wrong person. Big inconvenience to him that night. Isolated event though. She was apologetic. Still 5 stars."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3eDlIZFJnEAE",
            "text": "The music was ok, drinks subpar, but the bouncers/security here are very unprofessional and they have a poor attitude. Their presence is over bearing and does not suit the atmosphere of this type of establishment."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwNDlfUy13RRAB",
            "text": "The place was not good I dont recommended anyone to go there the service was bad. They give our VIP to someone else after we pay for it.  The hookah was over price and the refills. Music could have been better."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVN3MyTm1RRRAB",
            "text": "This bar/nightclub is a horrible choice if I can have a negative -5 I would give it to them they charge you with gratuity with horrible service one  then there’s a minimum of $30 on a  Credit card  with a photocopy of your ID which they…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVM2JyTnBRRRAB",
            "text": "Be careful ladies when you are out there partying away,taking selfies , hold your cup, and. Do not go to this club alone because they drug females in this cub..... I’ve been there frequently and the same this occur every night . Be aware."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRNjhpU3pBRRAB",
            "text": "The Bar isn't too pocket friendly.. small cups, a lot of ice, measured drinks. Mandatory coat check, make sure that sweater isn't too thick.. the Caribbean music and DJ is the only thing carrying this place and review."
        }
    ],
    "reviews_count": 55
}