{
    "name": "Caridad",
    "place_id": "ChIJbxvhS-NdwokRVDAY6IOlfek",
    "grid": "QN9",
    "address": "90-19 Jamaica Ave, Woodhaven, NY 11421, USA",
    "rating": 4.1,
    "user_ratings_total": 749,
    "phone_number": "(718) 847-7575",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KSGRUbHFZMkZhVkZka01XbEVXRE5SWDJocE0wRRAB",
            "text": "I order from here FREQUENTLY! Their lunch meals are so affordable and delicious and the quantity is great. I usually have leftovers for the next day. Definitely a regular spot for me."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wdFUxZE9iazFhWHpOdU9ISjBZM0J1UWkxS1kzYxAB",
            "text": "Good food and great price."
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwemNHZG5PRkZRTVMxWVMyOU1WV1JDUmxaUWMzYxAB",
            "text": "un lugar pequeño pero agradable y sobre todo  muy buen sabor"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OTlZsRnVabk5DVFd4Vlh5MDRMVE5vWVVsNGFWRRAB",
            "text": "My number one place since I was 18"
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5MWQ3cElREAE",
            "text": "Never disappoints. Been going there for 15 years. My go to when I need Dominican food. It brings me comfort."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWd1NXWkpaRUpHV1hwaFMxQmZaVTlSWWtsYVJGRRAB",
            "text": "This place is good but i think its a lil over priced. Especially is nothing different than other dominican resturants that serves typical dominican food."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGaVRHbENTRmxIUm5wUlpuYzNhVEZpY1hkMVZuYxAB",
            "text": "Excelente servicio y comida muy buena lo mejor"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KR1dqaEtOMk42Tlc5WE1WQmFTMFJ0VlRCbVZuYxAB",
            "text": "Anytime I eat here or get take out the food is always great, from morning breakfast to dinner the food is comforting. When I get take out they always offer me seat if there’s seating available. As I’m waiting they gave me updates how long my food would take. This is always a must stop before my long drives home."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MmFGSmlaWFpVVm1OS1NqZzRSMVJrVFdZMmVGRRAB",
            "text": "Ordené los tres golpes (Mangú, queso y salami) y el Mangú parecía como que lo habían licuado, los huevos los pedí medium well y llegaron demasiado bandidos! El morir soñando que pedí parece que le echaron avena para espesarlo! En cuanto a…"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWFIxaDNXSGRyVDBaRFNXbFRiRWRvTXpocVduYxAB",
            "text": "Qué horrible establecimiento hice mi orden por llamada una hora antes del\nCierre la muchacha me dijo que mi pedido se tardaria menos de 30min ,exactamente llame a preguntar cuando mas Tardaria mi pedido luego de 40min y me dijo que el chico saldria con mi pedido Justo en ese momento ,luego de un rato el chico llama a decir Que esta afuera pero mi esposo salio y results que el chico estaba en otra dirección le dijo a mi esposo que ya se dirigia a la dirección correcta y resulta que la muchacha del restaurante lo llama a mi esposo y le dice que el chico del delivery regreso al restaurante ¿entonces porque le dice a mi esposo que va a dirigirse a nuestra dirección y al final se regresa?\nLa chica le dice que no se preocupe que ahora mismo nuevamente ya sale el reparatidor y obviamente para ese entonces ya daba la hora del cierre del restaurante ,pero mi esposo y yo estuvimos todo ese tiempo afuera esperando la comida que JAMÁS LLEGO y cane recalcar que JAMÁS CONTESTARON NUESTRAS LLAMADAS PARA INFORMARNOS QUE LA COMIDA NO SE ENTREGARIA.\nDespués de un día largo de trabajo es absurdo que ordenes algo para poder comer y el RESTAURANT decida no entregarla… PÉSIMO SERVICIO!!!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oYVFuZFhVblJGT0hsNGJXNVlWRzF3UzFWTU9WRRAB",
            "text": "Compre una costilla con pelo y arroz blanco. Y no es lo primero que ha pasado no les recomiendo comer en un lugar de calificación B en NY."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZemJuTlBVR0ZPVlVwVWRGWnJSa1pEVUdwM1gwRRAB",
            "text": "Los mejores desayunos en Queens. No te pierdas el Five Stars breakfast."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbU9IQmtkakphTFVkcVRITnRZVzgxUTJsSlZtYxAB",
            "text": "No good"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SRldWWmlSRE5MYm5aUFZGZDJVell0YlRrNVRtYxAB",
            "text": "Buena la comida"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSWFkwTnZhVVkyTTFWSlpuVmhZM0JHVjBZMFVVRRAB",
            "text": "Absolutely HORRIBLE service. Waited over 15 minutes for an order placed for pick up.\n\nKept lying and saying it's ready in 2 minutes.\n\nWaste of time."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VNV0N4NnplNDlhNDNRRRAB",
            "text": "I mean I've been coming here for years, however the food is just not consistently good or well made...staff is mostly slow in taking orders, food has been cold several times and the last time I had a lemonade it tasted as if the lemons or limes were spoiled or just rotten...I can do without...sorry Caridad, but its just not the same over there (Woodhaven, Q location)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPeW45cXlhLS1IZlh3EAE",
            "text": "Horrible service. If u not Dominican they treat u different. Never dining here again"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VKckY3dUw0alliVDRRRRAB",
            "text": "None of the food was labeled, I didn’t know what anything was without asking. The food was great! But also there wasn’t prices posted that I could see."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJbWNqWWF6X2RqaEhREAE",
            "text": "Excelente servicio"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaWNDV2hBRRAB",
            "text": "La comida es muy buena!"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZeU0zOXhRRRAB",
            "text": "Jamas volveria a pedir comida en ese restaurante me dieron un pollo podrido con una peste orrible y el arroz siempre  esta crudo NO LO RECOMIENDO"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbDZPS0VREAE",
            "text": "Very tasty Chicken and Beans with Rice.\nFriendly staff."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJM0pySWJREAE",
            "text": "Recomiendo este  establecimiento, Por el buen sazón de su comida también por la buena  atención al cliente es 10/10. Otro punto adicional es su ambiente tranquilo para pasarlo con la familia y lo mejor de lo mejor es que puede pedírtelo desde cualquier app de comida.  Un punto negativo es que no tiene su propio parqueo pero después de eso no encontré nada  más que analizar en mi reciente visita."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdTRybWlnRRAB",
            "text": "The food is really delicious here and the service is always great. They have an awesome menu selection to pick from and the service staff are super nice as well."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBNnYzR3BBRRAB",
            "text": "First time I get myself from beef stew from here with plantains , it was very delicious, love it , it made my stomach smile and must come back here again"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmX2VmeWpRRRAB",
            "text": "Perfect for any occasion! Whether it’s a casual dinner or a special celebration, this restaurant delivers every time."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmenJiV1FREAE",
            "text": "Hmm, u know all was great except food!\n\nSteak tastes like rubber🥺\n\n90$ waste for to person."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNnFHWHFRRRAB",
            "text": "Recomendadisimo, riquísimo, los combos qué tienen, super buenos, la carne guisada deliciosa, el pernil riquísimo, los frejoles riquísimos, hasta el pollo horneado es rico, y encima te dan una gaseosa grande dentro del combo, el otro día probé la ensalada de papa y me gustó también"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRby0tU2N3EAE",
            "text": "Great Dominican Spanish Creole. The food is tasty & fast. The lunch special extremely reasonable 7 bucks. The the empanadas are not so great but I guarantee you will love everything all the way down to the liver steak with onions. They also have fruit shakes natural. The staff is welcomeing, always with a smile."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJaXQ2MUJBEAE",
            "text": "This restuarant is pretty decent , the food is good and it's service is good. I had the mofongo and fresh squeezed orange juice which I believe they watered down and it kinda disappointed me but other than that I like their food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURicU0tdWRnEAE",
            "text": "No season at all on fries so upset not even salt  do not order breakfast from here I could imagine the other food if you can’t even season some potatoes"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdmZEMm5BRRAB",
            "text": "Me informaron que acá la propina es obligatoria te cobran el 15% así seas buen atendido o no te obligan a pagar ese monto dejaré un ejemplo de lo que pague y yo pregunté si es obligatorio me dijeron que si no me parece que no avisen esto por qué si algo no les gusta igual tienen que dar la propina el 15%"
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaaUxQLVhREAE",
            "text": "Extrañaba tanto comer aqui luego de 3 años ...La piña colada la mejor q he tomado y el mofongo esta delicioso.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUM2QzRTF3RRAB",
            "text": "The food was great, the service was amazing spectacular and the windows placed gave it a very authentic Hispanic vibe"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXelpTck13EAE",
            "text": "Ordered a small plate of mangu and a small lemonade juice, the delivery came pretty fast no complaints there but the delivery guy tells me its 16$ Not including tip A bit over priced if you ask me but it doesnt end there, the mangu taste like it was made with old mop water 😷🤢🤮. WOULD NOT RECOMMEND!…"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudUtqdlFREAE",
            "text": "El mangu espectacular y el café súper rico también! Definitivamente regresaría!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQM2E3VVZREAE",
            "text": "We had dined in at the restaurant I ordered a platter to try all of there meats let’s just say I left there throwing up with food poisoning the next couple days. I WARN YOU ALL THIS ESTABLISHMENT NOT ONLY HAS POOR CUSTOMER SERVICE BUT ARE SERVING DISEASES TO YOU ON A PLATE BE AWARE STAY AWAY AND DO NOT EAT FROM HERE I WILL BE REPORTING THIS RESTAURANT TO THE FDA AND NY FOOD AND HEALTH WERE WORKING ON GETTING THEM SHUT DOWN THIS PLACE IS KILLING PEOPLE."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyci1EZjFRRRAB",
            "text": "Que tipo de omelette es este le pedí con pimientos y me salen con esto, esta  súper mal aparte la persona  que recibe las órdenes uno le dice lo que quiere y el manda todo mal, y se le olvidan las cosas que uno quiere siempre es lo mismo con este restaurante y hoy fue mi ultima orden con ellos un Cliente menos"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkcWVxZnNnRRAB",
            "text": "Stopped in to grab dinner to-go with my mom and niece.  There were three people sitting down, eating in the restaurant part, and no one at the back where you can order food.  We stopped for a second to see what they are serving and a lady asks us what we wanted to order.  We order, and with a rushed, stink attitude she takes our order.  She rushes to put our food on a plate, and barely gives us a second to ask for extra gravy before she is sealing the food!  Like I said before the place was not busy at all, so I was confused why she is rushing.  She takes our orders with an attitude, to the point where my 12 year old niece, says \"what is her problem?\"   She gave me three pieces of beef with my small order of beef stew!! Then low and behold, I order my food in Spanish and she has a look of shock on her face!!! Yes, I am African American, who knows some Spanish!!!  I'm not sure if she was treating us with an attitude because we were black, or because we didn't come in speaking spanish, or because that is simply her personality! Of course when she was handing us our food, she tried to smile, but I'm not tipping for poor service! The cashier, not sure if he was the manager was nice, and I wanted to tell him, how she was treating us, but I let it go, and we left.  This staff member needs to go to the Spanish restaurants in Corona or East Elmhurst, where they treat everyone the same, and are consistently nice to everyone!  Food was good, cashier was nice, but staff by the take-out area, needs to be nice!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoenNxYlNREAE",
            "text": "Had the 3 golpes and it was very tasty! Would be back just for this."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNnV6SDFnRRAB",
            "text": "This location has been going down hill. The food is still holding its value but the service has been on decline for a while now. The constant attitudes from the staff when placing an order to slow service when ordering inside. For me to get to this point has been a long time coming. But my advice if you don’t like your job people, go find something that makes you happy.  Won’t be going back anytime soon."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2akp6Rld3EAE",
            "text": "Got food poisoning from the food, especially the sancocho, chicken soup, meat smelled like raw animal and stale hard platano still recovering from sickness 3 days later. They are reusing/reheating old food."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnanB2WUd3EAE",
            "text": "Great food. Nice atmosphere. Had the western omelette. Good but they don’t have Jalapeños here."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2N3BUVFJ3EAE",
            "text": "Very nice Dominican spot for all Dominican breakfast lunch and dinner clean environment good food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxLWNuaXVRRRAB",
            "text": "The food is ok but the service is horrible, I ordered some food for my Nee Year Eve  party . I place the order Saturday, for 6:00 o’clock Sunday . I called to confirm Sunday morning .  I got my food 2 hours later , mean while I call twice and they kept on telling me it was in its way since  6:30 I live 10 minutes away.  The food was cold when it arrived .  The rice wasn’t a full tray like I ask for. I promise myself I never order food from them again."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzMktldmt3RRAB",
            "text": "Caridad Restaurant is a hidden gem that’s as authentic as it is welcoming. With over three decades of serving vibrant Dominican dishes, Caridad’s reputation for quality and consistency is a reason for its customers. The moment you step inside, you’re wrapped in an aroma that feels like a warm hug from a familiar place. Their menu is thoughtfully curated with Dominican classics like pernil and mofongo, each with flavors that remind you of home, even if you’ve never been to the Dominican Republic. Caridad’s commitment to quality is evident in every bite, with fresh ingredients and expert preparation ensuring a meal that’s as satisfying as it is flavorful. For anyone seeking a Dominican dining experience, Caridad Restaurant is the place to go, where the perfect reminder of Santiago's food is."
        }
    ],
    "reviews_count": 46
}