{
    "name": "Heat Caribbean Kitchen & Lounge",
    "place_id": "ChIJ7Scsw_hdwokR6mF9tyW_HDQ",
    "grid": "QN9",
    "address": "100-05 Atlantic Ave, Richmond Hill, NY 11418, USA",
    "rating": 4.2,
    "user_ratings_total": 569,
    "phone_number": "(718) 847-7300",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScFNTMXdTa1YxZEVwSVZXUnpTbU00YmtNNVpsRRAB",
            "text": "My go to place, recommend the jerk chicken chowmein OH MEH GAWD. 🤤& the mac pie. 12/10"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDa29PaDNnRRAB",
            "text": "Friendly service, delicious food and cozy environment."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwZ19qYVpREAE",
            "text": "Good,Drinks,good food,a nice staff and the D.J  plays good heat,all with in an economical Bill..."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25reFRXVlJSRFJpUVdoWVVrZFNOVFl4ZUVwd2JtYxAB",
            "text": "Good food, and Coldest beers by request Nia😉, Thanks Sunil great place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwclJIVkpWMjlYTWxCdWFGRm9WMUl6T0RGaWNXYxAB",
            "text": "I really enjoyed my meal at Heat. The food was great and the interior was beautifully decorated, which was a pleasant surprise for a local spot. It's a fantastic addition to the neighborhood and I'd highly recommend it to anyone in the area."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2aW9qQTFRRRAB",
            "text": "Beyond disappointed 😑…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21abWNuZFFRV2xwU21wd1JEWm1jRUl3WDNCU1YyYxAB",
            "text": "Well is was a Sunday night looking for some caribbean food, which we found at heat caribbean kitchen, the food was very tasty to our likings 👍 😋 😜"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213eGVqUnVRVWxRWlhGdmNUWTFTV05VUWxwUFQxRRAB",
            "text": "The wings? Absolutely amazing. The staff? Top-notch. I was blown away by the customer service - especially from our waitress, Naiomie. She knew the menu inside and out, gave us perfect recommendations, and every single one hit the mark. The owner was respectful when checking in to see how things have been, the drinks were on point, and the ambience was spot-on.\n\nI had the shrimp lo mein (delicious) and the jerk wings (flavor-packed). The fries were crispy perfection. I grabbed lamb sliders to go for my wife - she loved them so much she was raving about them the next morning, still fresh and tasty.\n\nWhat I love most? The consistency. Whether I dine in or take it to go, the food is always excellent—even the next day. This spot delivers every time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWNlpUUXRUSE42UVVkaWFERkJNWGN0VmxsQ01XYxAB",
            "text": "They served me rotting oxtails. That ish was horrible. Not only that, the drinks were also horrible. Will never return"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGWGVFdGpXRTR3Vm5OTlgwZEZOelpEWkRCS1VIYxAB",
            "text": "Got there around 1am to try their food. The guy outside (Not sure if he was security or not because he was leaning on a car outside) told me the kitchen was closed. Then told me to hold on while he checks. He came back out and mumbled something. I asked \"The kitchen is open?\". He nodded yes. When I walked in I couldn't tell who worked there or not. I sat at the bar and waited about 10 minutes while the bartender walked in and out of the bar not paying me any mind. There was only about 8 ppl in the place INCLUDING THE STAFF. Everyone saw me walk in and not one person gave me any type of service. At that point I wasn't about to argue with anyone about why nobody is helping me. I got up and left. Wasted my time even driving there."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZM1gyUXlTM05HTURFelJGWm1UekZJUldkamVVRRAB",
            "text": "Came here because my husband wanted to try Guyanese food while we were visiting from the Berkshires since we don’t get authentic ethnic cuisine here. Heat’s food is all halal and they don’t serve any pork (although there’s a bar here so not sure about mixing alcohol and halal meat 🤷🏽) and the food was absolutely delicious! Every single thing was distinct. We got the Heat Special Chow Mien, Jerk Chicken, Chicken Curry (that my husband exclaimed reminded him of his Guyanese friend’s mom’s cooking), fried yuca, and mozzarella sticks. They didn’t have daal poori nor roti which should have been delicious with the chicken curry, I bet! Mocktails are $6 each. Music is VERY loud (but maybe that’s Caribbean culture) and they don’t have a high chair although our toddler was able to sit one of the stools. They also charge 20% gratuity for parties 4+ but still recommend for the food and flavors!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLV29ycy1QLS1YWFp3EAE",
            "text": "I  did enjoy the lamb chow mein. But felt turned off by it smelling fresh . No season at all no veges like it use to be.\nManager look into your chefs. They making customers turn away."
        },
        {
            "date": "5달 전",
            "language": "mi",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVM2QzcHhjRkZKTTB0eExXVnZSbk5zTXpWUlFrRRAB",
            "text": "Vibeeeeee"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdVltelVBEAE",
            "text": "As per usual the food is exceptional and the service is great...\nAwesome place for hookah, drinks and GREAT VIBES..."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VObnNtZmZuamFtTFVnEAE",
            "text": "Good vibes. good food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNGFYdlVnEAE",
            "text": "yummy!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcnZUc2NBEAE",
            "text": "This spot's food is always amazing. However, I just ordered shark bites to go and when I opened the food  container everything was half empty, including the sauces.I've ordered the exact order before and it's never been like this. Very disappointed, consistency is everything. CHECK YOUR FOOD BEFORE LEAVING!\n\n4-10-25 Update- I am not sure what's going on, but the shark bites pieces and packaging are getting smaller...at least to go food. I wish I had known beforehand, not enough food now.. even less food than my previous review . I ordered three orders, feels like 1 or 1.5 orders. Uploaded pics from today and from the last two years...what a difference=["
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OTVDRmlBRRAB",
            "text": "I used to love ordering dinner at Heat on Fridays when I work late @ School District 27.  Heat is close to the District & taste &  portion of the food use to be good.  I stopped ordering because I have been surprised too many times when i look into the containers at home. The portion of very expensive containers of food are not even sufficient to feed my seven year old niece.  Last time I ordered, there were 3 pieces of oxtail and lots of veggies in a bowl of gravy 😅🤣😂."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3X3RUT1BnEAE",
            "text": "👌🏾…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NTVIdWNBEAE",
            "text": "Bumped into this spot on a quiet Saturday night. It was more diminutive than expected. Especially from the pictures. Ambiance was dark but favorable for a local neighborhood spot. The DJ was more than good that night. The bartenders were very attentive and made the drinks good."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRc19TTVNREAE",
            "text": "Great food and cocktails"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNklQME5REAE",
            "text": "The food and drinks were amazing. The seasoning was on point. We had oxtail Ramen and a curry goat roti. My guava margarita was delicious. The staff was kind and knowledgeable.  I've already told my friends about it. We'll be back. Ohhhhh and the DJ had me jamming in my seat. Good vibes and good eats!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnaVliSkRnEAE",
            "text": "Service is always great and good is always amazing! My husband and i favorite is the oxtail, of course!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbnJMMlN3EAE",
            "text": "Fire !!!! This is my new go-to spot in Queens.!!! The food is amazing, prices are great and the service is excellent!!! Sundays is a vibe and the specials are crazy ! Just check it out you won’t be disappointed!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbHB1VnBnRRAB",
            "text": "Great food, super friendly service\nGood comes a little slow but definitely worth the wait."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMy1IRjV3RRAB",
            "text": "If you love Caribbean food filled with flavors then here is the place to go!\n\nThey have a wide menu with tons of different options to order from as well as drinks & hookah.\n\nMy ultimate favorite is the Steak from the food menu, every time I visit I always get this as my entree. Also I add to my order is a Caribbean type sauce that goes on it, lots of seasoning & spice. I'll attach the video to the bottom of this review so you can see.\n\nIt's a nice cute small place so it gets packed quickly, you might want to call before going. Also parking is a little tough in that area, since it's directly on Atlantic ave.\n\nThere's also live DJs there weekly which makes dining more of a vibe! Drinks here are always on point, be sure to give your bartenders a little tip for their exceptional service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdGR2eHpRRRAB",
            "text": "I went here on Saturday for my friend birthday, and I must say the DJ have us all dancing great vibes,food and drinks was epic,and not to mention our server Naomi,she constantly check on us her services with the food was great..HEAT truly living up to its name,ill definitely revisit this place. only downfall is,wish place was bigger"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMWJuUWJnEAE",
            "text": "Planned a big party for one of my friends, a party of 12 and everything was perfect, from the drinks to the food everything was on point. Ordered the lamb sliders which were magnificent the service and music was also great, the bottle specials were excellent, it was a great night overall I highly recommend it"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBbGF6Skd3EAE",
            "text": "Between the food, service, drinks and music I don't know which one is the best, it’s my go to place to relax unwind and chill out with some top notch food and drinks. The staff is very knowledgeable and friendly, does their best to make you feel at home. If ever in the queens area it has to be on your list to go check out, from Sunday brunch to Saturday nights with the live dj’s spinning soca to reggae, it’s always a vibe."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNWFHdFVBEAE",
            "text": "I placed two to-go orders over the phone, but the lady forgot to include utensils. The food was really dry, and when I asked for extra jerk sauce, she didn’t put it in the bag. Both the customer service and the food were disappointing. I definitely won’t be going back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfc2VTSTRRRRAB",
            "text": "One of my fav places to just chill vibe and eat ! Whether alone or with friends it’s always a vibe. The owners as well as the staff have made me feel like family. I recommend Heat to everyone I know !"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxMGRLUWRREAE",
            "text": "I've visited this restaurant twice already, mainly because they serve halal meat. Drinks came in a timely fashion but we waited almost 40 minutes for the food to arrive. We ordered the steak and jerk chicken tacos which were good but…"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzOHZXOHBBRRAB",
            "text": "Great food , but the portions to price doesn't match  .  Paying too much for the amount you get .... we go there to eat , not pay full price for a sample...  took forever for the order to arrive  , and when it did come.  We thought that the rest of it was on the way out.\n(Nope , that was the order)"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfd05qdTVRRRAB",
            "text": "Great little tucked away spot. Hookah was strong. You HAVE TO GET THE WONTON SOUP!! We literally couldn't get enough."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNThTLUVnEAE",
            "text": "Best Cho mein"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcDhTaWJ3EAE",
            "text": "The staff is very friendly and attentive. The drinks are amazing and the good is full of flavor. You can ask to modify for dietary restrictions. They are also halal."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcDhpOTBRRRAB",
            "text": "If you’re looking for amazing food, great drinks and a good time - look no further! Heat Caribbean Kitchen has it all. Whether you want to come have a nice family dinner or late a night drink and hookah this is the place to be."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmeF8yYnpBRRAB",
            "text": "One of my favorite places to go and have a good time. The food is amazing, the service is great and the vibes is always vibing. One of my favorite go to places that never disappoints."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5NHNTbXFRRRAB",
            "text": "I had an issue regarding a bartender tipping herself after I gave my card for a purchase with a tip already included … she changed the amount on her own. I left a review about it & the owner gave me a call ….\n\nUpdate: Months later & They never resolved the issue to my account or reached back out after stating they will check with the bartender & reach back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdmFiVzJnRRAB",
            "text": "Good food, service and DJ Supreme was on point."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNueGJmS3pnRRAB",
            "text": "This review is long overdue! I visited a few weeks ago, and let’s just say I was definitely feeling the Jack and Cokes. I’ve been here three times and tried the Oxtail Ramen twice and the blackened salmon. The Oxtail Ramen was something new and unique, packed with flavor and nice, huge chunks of oxtail—very filling and satisfying. The blackened salmon was new to me, with a smoky, sweet taste that wasn’t too spicy, and it had a nice bit of crunch. My boy ordered the lamb, and he really enjoyed it. Everything was great, as far as I can remember, because the photos in my album look amazing! If you’re not into loud music, it’s best to come earlier because it gets pretty lit at night. And they don’t play with the drinks, so definitely don’t drink and drive. Highly recommend this spot for great vibes and even better food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNObWJMUzlnRRAB",
            "text": "Clean, quick service, friendly staff. Variety or music on rotation keeps you happy. Drinks are well made and food is delicious. The portion sizes are more than enough to fill you up. The atmosphere is very relaxed and incites you to stay longer. You could easily hang out there for hours. The mini tacos are anything but mini. The jerk chicken Ramen is hot, well seasoned and a huge portion - there's no skimping on the meat here. You won't regret visiting."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaZ0lfdTVnRRAB",
            "text": "First time and had a great experience. The place wasn’t too packed, music was popping, staff was nice and attentive. They have hookah too. I had the shark which was 10/10. The mussels were the best mussels I’ve had in a while. Most people don’t know how to make sure a simple dish. The wine was so good in it. The shrimp and grits was nice and tasty. Just slightly a small portion. The rum punch really punches you. It taste like juice then after 2 cups it kicks in."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2NXJXTVpREAE",
            "text": "Came for a Friday happy hour drink and meal with friends. We ordered 2 rum punch, and 2 mango mojitos, mozzarella sticks, fried calamari, and 2 heat meals (chicken,  shrimp, and lamb) with rice. They cooked the rice with the shrimp and lamb and the chicken is on top. The portions and definitely enough for the price. Between 3 people bill came out to $90. Pretty good. The food was really good 👍 and the drinks are fire. The fried calamari was fried perfectly to a crisp 😊 super tasty! The chicken does need a little more sauce but everything else was great. Thanks to our waitress with the ash blonde highlights and bomb lashes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMM2NMdXRBRRAB",
            "text": "I had dinner a little over a week ago and I was impressed with the food. We got the lamb meatballs, jerk chicken with rice and peas, penne, and steamed vegetables. All were very good and large portions. We chose to eat inside and the seating was cozy. Our server was very friendly and helpful. The DJ consistently played good tunes, just know it will get loud. Now if you want a quiet dinner, there is outside seating. Overall we had a good time and will be back soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5NmFmb2lnRRAB",
            "text": "Food was amazing. Chicken Curry w/Roti was cooked to perfection. My wife got the oxtail which was excellent. Portion sizes were perfect. Staff were great. Atmosphere is very enjoyable. Happy Hour deals are extremely worth it. The value here is simply unmatched in New York City. Enjoy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxNUluTmJnEAE",
            "text": "The food here is absolutely delicious. The flavors are immaculate. The Music and atmosphere are great as well. Will def come again"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdEp1MDNnRRAB",
            "text": "It took me a while to write this review because I still couldn't get over my experience at the Lounge.\n\nFor starters: service was spectacular, my friend and I arrived early on a Saturday (I think it was as they were opening) and we had the bartender's immediate attention. My mojito was oustanding, truly\n\nNow for the bad part: idk what chef they have back there but they should find someone else because the letdown was real. Or get him/her a proper cookbook for reference.\n\nFor the appetizers, my friend and I ordered fried shark, quesadillas, and parm-truffle fries. I ask you to take a look at my pictures. The one with the yellow triangle cones were the \"quesadillas\".....nowhere on God's green earth have we ever seen such horrible looking quesadillas. Those were not quesadillas, they tasted like fried corn and the chicken was ground chicken and it was tasteless (-9)\n\nThe parm-truffle fries were so drenched in truffle oil that it left a really strong after taste in our mouths....\n\nFor the fried shark, not only was the batter heavily salted the platter was a mixed of fried fish and shark. And yes I know what fried shark is supposed to look like.\n\nFor the entrées, I had the oxtail Ramen and that one they did good with, I mean you cant mess up ramen.......my oxtail had meat and was stewed well. I wish there were choices added (corn, scallion, parsley, maybe throw some pork belly in there)\n\nBut my friend's meal was trash, she ordered the oxtail meal with rice -- first, her oxtail was extremely sweet like syrup was added and the rice was uncooked and unseasoned. And I felt horrible because I chose this place after seeing it popped up on FB, big regret smh\n\nTheir bar is A1/outstanding but for the love of God stay away from their food.\n\nI'd give 1 star but the bartender did her thing so I don't want to drag her down with the kitchen but fire ya head chef /cook asap"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHd09QZVZREAE",
            "text": "Hubby and I came on Halloween night. It was the night after our anniversary, and wanted someplace with music, hookah, & food.... HEAT definitely delivered. We loved every appetizer (see pics) and the HOOKAH!!!!!! hands down the best and smoothest smoke.\nLooking forward to dinning here again\n\nThey check vaccine cards, but have a nice, heated outdoor space as well"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0dGRtZ3J3RRAB",
            "text": "Had a great time eating here. The only bad thing really is the location, if you blink you’ll miss it and the physical menu is limited because it hasn’t been updated as of yet but if you pull up the online menu it’s ton of options you can…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqaUx2Y1h3EAE",
            "text": "Good food and attentive service. Music a tad too loud. Would recommend the goat curry and puri. Rum punch is also great."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpa3RHa29RRRAB",
            "text": "Party of 5, first time here and everything was on point. Well made drinks, delicious food, great hookah, chill music, clean environment, and most importantly the customer service was excellent from beginning to end from everyone especially Jamie and Shaq! Would definitely come again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSLVl5VGRnEAE",
            "text": "So if you want good food, good music, good drinks and good hookah, this is the place. It is Caribbean so like the name implies, the food is spicy but amazing. The music is a vibe so don’t expect it to be quiet. The lamb sliders are the best…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCbXFmZFBnEAE",
            "text": "Great atmosphere, friendly servers who showed they cared about their customers. Unfortunately they could not offer anything fried at the time which limited our options. They were unable to serve frozen beverages as well. Forgot to bring out the appetizers we ordered. We were also unexpectedly charged when asked for water which came bottled. The food was just okay, I've had much better Jerk Chicken, Rice and Beans elsewhere for half the price. Otherwise a great spot to chill but I wouldn't expect much other than that."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2dDRDSlZnEAE",
            "text": "The Rasta Pasta was quite amazing. I had the Jerk Shrimp and he had the Blackened Salmon. We enjoyed every bit of it. Go during Happy Hour. Best seat is at the Bar. Try the Mango Mojito or Rum Punch if you like Passion Fruit."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRdlpfWkNREAE",
            "text": "I've been here multiple times and they never fail to disappoint. The food is always tasty and the portions are large. The owner is friendly and makes sure that you're having a good time and enjoying the food. One meal feeds me 3 times !"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlemF6QUdBEAE",
            "text": "I’ve been passing by this place for years and only thought it was a bar. My bf suggested it when I said I was craving jerk chicken, canceled my lash appointment and I was like LETS GO. I got the jerk chicken fried rice and the Mac and cheese bowl. OMG. Amazing.\nWe went during happy hour so they had a $7 rum and punch drink, bomb. My bf got the steak and asparagus, steak was really flavorful but I do suggest telling them you want it cooked medium… They didn’t ask how we wanted the steak to be cooked, so they made it well done by default. It was still really good!\nMusic is loud, like a lounge. It’s not entirely my preference but hey, it was great food, great drinks, great vibe, and 5 min from my house.\nHighly recommend, I’m already trying to figure out what I’m gonna eat the next time I’m there."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNLTdTWDJBRRAB",
            "text": "Drinks are excellent. I haven't tried their food yet however, from what I've seen and smell in that lounge is yummy. My only negative is that they never open on time. Business hours states 12pm - 2am Tuesday through Sunday but I've notice…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtNC1PQzFRRRAB",
            "text": "They have shisha , food , drinks  . And the food is good and the rum punch was nice . Star off because the sliders came out cold . The service was good ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSd0lMTmt3RRAB",
            "text": "This place was a vibe and exactly what me and husbae were looking for .It's small but the perfect date night.  We both had oxtail pasta, and it was delicious. The drinks were good as well. They are a little pricey but worth it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKNnRTQUVBEAE",
            "text": "1st time and we will be back ! The food was amazing, but don’t order rice sorry that’s the only disservice you will have at this place. But music is good, service is good plus it’s good food all but don’t eat the rice lol"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXX09tSHNBRRAB",
            "text": "Lamb chops w Rasta Pasta and Jerk Chicken with Rasta Pasta were so tasty. Great drinks, hookah and music. The staff is amazing as well. Can’t wait to be back for the lamb chops tho 😋"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPamItWE5REAE",
            "text": "I went there for my Bday, recommended by a friend and loved it (My new hangout spot). The place is full of good vybes and the drinks/food are on point. The bartender 'D' took care of us, she is amazing. Go to this place U won't regret it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyMF82Y1dnEAE",
            "text": "The food was not good and service was good. The regular soda was hot and my table the air conditioning was leaking on my table overall is not good at all this was the fried rice was not good"
        }
    ],
    "reviews_count": 64
}