{
    "name": "Atlantic Diner",
    "place_id": "ChIJ8RSPC1NnwokROqduH5qlaBs",
    "grid": "QN9",
    "address": "111-16 Atlantic Ave, South Richmond Hill, NY 11419, USA",
    "rating": 4.2,
    "user_ratings_total": 3342,
    "phone_number": "(718) 849-6673",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OM2JYWjJkbXBTTlVKclZFOTFSVEE0UWtvM1VuYxAB",
            "text": "Perfect Breakfast! 😋"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrNWVsUlRZWEpQZUROa09ITTFORFZxTTNSQ1FuYxAB",
            "text": "Let's be real, this isn't a Michelin star restaurant. You can't just waltz in here at 3am and expect a perfect gyro or shrimp scampi. If you're coming in late then it would be best to stick to waffles, a burger or something else that's simple. The staff are very patient and reflect the kindness that you show them."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsQlRVaHRZamh0ZVdSU1EzbzJOa0ZvYnpnM2ExRRAB",
            "text": "The staff was lovely, the food was great…"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVdE9HSkhSRnBoVFZaVldIaDRVRVZ4TW5kV1UxRRAB",
            "text": "I ordered shrimp and scallop scampi. I had one bite of the scallop and it was spoiled. I then proceeded to smell it and it taste like ammonia. I decided to go to the manager and speak to him very respectfully. He went and got the food then ate it and said there's nothing wrong with it. He started yelling and yelling me I don't know food I'm the type to order a bacon egg and cheese. Which was very racist for no apparent reason."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wYVRuVjNNRk40UjJoWE5VaEhWakEzYm1wb1MwRRAB",
            "text": "What an adventure in disappointment. Been coming to this diner over 40 years. Brought grandma and daughter for dinner.\n\nGramma ordered omelette with hash browns. It came with two over-fried dollar store frozen hash browns.\n\nMy gyro platter came with over-fried onion rings and the gyro lamb was hard enough to eat as jerky.\n\nBut over 40 years, you can’t expect perfection every time.\n\nHowever..\n\nWhen I bought this to the attention of the waiter, his response was “ I only serve the food. “ He said he’d bring the manager who never came.\n\nNo offer to take anything off the $82 bill. I paid at the counter and said I wouldn’t pay to for service and food. Cashier turned away completely indifferent.\n\nI used to take clients and public officials to eat here.\n\nNEVER AGAIN!!!\n\nClassic on Jamaica and Esquire on Woodhaven will graciously have my business from now on."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRmIwaENOV3h2WWtZM1RTMU9aMjVNY25aWlVHYxAB",
            "text": "I have been reintroduced to good diner food. I've had breakfast, lunch and Dinner and have not had any complaints whatsoever.  this is a new late night (Thursday Friday Saturday) spot."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCaWRWQjVNVzR6ZEd3eGMzRnVXbHB1V25OZk0xRRAB",
            "text": "Been going since 1990 , last 24 hour place left. They have a great overflow/party size room"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twMFpUbG5iak4zTFdwVFVqVnZVR1ZrT0cxcVdsRRAB",
            "text": "I've been a customer for years,the service used to be very good.but now it's terrible.my wife and I went to breakfast October 1 at 9.45 am .is a gentleman afro American guy .server. I'd never seen him before. He take the order never ask if we want to change anything.also included juice we never received the juice.the food came burning. We need to call him to ask please change the food. He never said or coming to our table. Anyway.is bad service.he need more customer service. Thanks. I give 3 stars.  Also the cashier old man terrible. He very rude."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSFZIWlhZWGxDUjBaQllsQnFTM2hOYmkwelUyYxAB",
            "text": "Trash"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WcmMxYzROalV4YkVWNmJITXlhbFkzUW1vMU1XYxAB",
            "text": "Classic diner vibes. Food ok."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wTFZGRldOVXRwYW1RelUyNDFZemt0ZUVWMVRFRRAB",
            "text": "Great food and delicious desserts 🍨"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tneGRtNUtabXhYU2xGa1R6bG1UV0o0V2xadFIxRRAB",
            "text": "Horrible service!!! Get your servers to actually serve. My to go to order was incorrect!!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TE1HeHpZV1p6V1hjd1FUQmtNMUpsZEdFNVozYxAB",
            "text": "The food, service and atmosphere is beyond measure.\nPatronize often."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVVRIbHJUVE5tZGxoRGN6RnhaV1F0ZURVNWJuYxAB",
            "text": "Always a pleasure dining here. The food never disappoints."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toMFJVRnZaMlZXYkdSNmNUTndVRXBxU1hCVFZtYxAB",
            "text": "Stopped by for breakfast last week and loved it — great food, cozy vibe, and friendly service. No idea why it’s rated 4.2, I’d give it a solid 5."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25admRXNXJUekpJVTBGM2NXZ3lSak0wYjFadVNrRRAB",
            "text": "This was a place we have been going to for years and the quality of the food took a nose dive, while prices have sky rocketed. It is just canned, frozen food thats reheated.\n\nThe staff however were wvery kind and attentive"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cGM3SDhRRRAB",
            "text": "The best diner in queens and os perfect for the whole family or any event. Delicious food and nice places. awesome stuffs."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0T2JrbGZTVGRyWmpkWlNrOHhNbDlaTFVJMmVrRRAB",
            "text": "Our server was awesome."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WWFpUUnVaRTh0ZVhRd2VEaGhNMk56YVU1SWRuYxAB",
            "text": "The server was not sering the customer I had to wait long before had to get his attention\nPlus when I got my order I asked for toast again I had to wait long had to get his attention he was more attentive to people he knew"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aM1lUaExZMlZNVlVwUWNISlhkMWxZVDNKa1NIYxAB",
            "text": "Always a great Diner"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTVpXaFFiSEpqUVZwbFFWVmtPV2hhVlVVMlJIYxAB",
            "text": "Typical diner. Food was decent . We were there a little after 1 am , staff were polite, atmosphere was to be expected at that time of the night, . Very somber."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNemQyNVNSWEJRVDFWU1kwOWhTSGhNYUMxTWVXYxAB",
            "text": "Their food is awesome.  Been going there for years."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMXVES29RRRAB",
            "text": "Just went last night with my husband; besides a regular menu their meal specials are delicious & enough to take home leftovers for another meal"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CaWJYSjFWMWR2Um5sWVptNUZURzVVYmpFMFVWRRAB",
            "text": "Very happy to find this 24 hour restaurant after arriving on a red eye at JFK.  Service and food were great"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wRGRHcDFiVWRzUjNCbGQxZzFVR1l3TTNGalEwRRAB",
            "text": "Food was very good,  nice variety. Staff was very friendly and accomadating."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWM1ozbHZVM0UxVUdjeGVHTnhiRm8xTldGdVgwRRAB",
            "text": "Their breakfast were delicious, need more work on the burgers."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRWJURTNRa3N5ZDJJMFpYWmhaVlpSV1dGQ2NVRRAB",
            "text": "I was visiting Atlantic Diner, based on the Google reviews. The food & service were both amazing! I’m from Canada and ended up going back to this diner twice within my one week visit to NY."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRNWJVdGpiRk5MVTNoRE5tMWtabVJ1VlZBd1MxRRAB",
            "text": "waiter has a shitty attitude as if he burnt the damn food himself"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsd05XYTV3RRAB",
            "text": "Awesome people, great food, good portions, and tasty"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMjRxYkhREAE",
            "text": "Added: a photo and -\nI did eat one egg and english muffin, none of the sauce or the feta cheese.  I had put it all to the side of the plate. Unfortunately, I only took one photo. I had asked the manager for half price not full price discount but he gave me full. As expressed below, he was nice about it and I am thankful.\n\nI give them 3 stars because they refunded me the main dish that I ordered, which honestly was the worst egg dish I've ever had in my life without exaggeration. I sincerely think management needs to reevaluate their egg dishes, particularly the one I will describe under.\n\nService was kind; the server tried to accommodate me. Manager was nice too and respected how terrible their egg dish was. Right now, I've forgotten the name but it's the egg dish that comes with a cheese-like sauce (at least in this place__other places dont have so much yellow cheese added to the sauce) , boiled egg, english muffin on the bottom, and feta cheese, which was interesting. This was not my first time having this dish, and typically, I've enjoyed it. However, their yellow sauce is absolutely horrible. I can't even put words into it past, horrible."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VORG9wSnkxMjlyblNREAE",
            "text": "After arriving at JFK very late, and not having been served any food on the flight, I was absolutely famished. Since it was already past midnight when I walked into the Atlantic Diner, I figured I’d just have something simple: a couple of eggs, some toast, and bacon.\n\nTo my surprise, a massive plate landed on our table (see photo). It came with six strips of bacon, a generous serving of country potatoes, two slices of toast, and what was supposed to be two scrambled eggs, but I’m pretty sure it was more like five!\n\nOMG, it was a huge breakfast. Everything was cooked perfectly, and the service was excellent. I definitely plan to go back while I’m in New York."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUMnRhZWdBRRAB",
            "text": "I enjoyed my visit here.  Overall, the restaurant was neat and clean and well-maintained.\nMy food was hot and fresh and enjoyable.\nI deducted stars because...\n1) The parking lot is a mess.  It looks like it is being repaired, but for my visit, it is a disaster.\n2) Cleaning supplies left out in the hallway in customers' view.\n3) My drink sat empty on my table until after our meal was finished.\n4) I was disappointed to learn that EVERY refill for soda is another $3.00.\n\nOverall, it was a nice experience."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfX0luOVd3EAE",
            "text": "The Turkey Burger was a bit of a letdown. While it looked appetizing and was a decent size, the patty was too dry, making the overall experience less enjoyable. Maybe fresh ground Turkey can be used instead of ore made burger patties since you can't eat this medium.\n\nThe Steak and Eggs was excellent! The steak was cooked perfectly medium well—juicy, tender, and well-seasoned. Paired with eggs cooked to my preference, it made for a hearty, satisfying meal. This is a dish I would definitely recommend.\n\nThe cheeseburger was fantastic. It was juicy, flavorful, and cooked just right. The melted cheese, lettuce, tomato, and onions on a soft bun made every bite delicious. It’s exactly what you want from a classic diner cheeseburger.\n\nThe staff was friendly, attentive, and quick to accommodate requests, making the dining experience even better!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyM2YydUJBEAE",
            "text": "Great parking. The food was ok.. the waitress got our order wrong, but we ignored it because it was probably a rough day for her. The fish I had was pretty good."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuczZfVWRREAE",
            "text": "El lugar tiene un ambiente agradable, pero la experiencia fue algo decepcionante en varios aspectos. El café estaba claro, casi como “agua de café”, lo cual no fue una buena señal. Además, pedí leche caliente y me la trajeron fría, a pesar de haberlo solicitado de nuevo.\n\nEl servicio fue apresurado, los meseros parecían estar con mucha prisa, preguntándonos varias veces si estábamos listos, pero sin darnos suficiente tiempo para decidir qué queríamos. Era evidente que trataban de atender rápido, pero eso dificultaba que pudieran ayudarnos de forma eficiente.\n\nEn cuanto a la comida, era buena y las porciones eran abundantes, pero la atención al cliente y la profesionalidad dejan bastante que desear. Un mejor servicio haría de este lugar una experiencia mucho más agradable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqdnViSkZREAE",
            "text": "I took my sister out here for an amazing early morning dinner.  It was awesome. Thanks to you all for that.. I am recommending this establishment with the highest honor.  Mind you, all goods are baked on site. In the house, how cool 😎 is that."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQcE4tNml3RRAB",
            "text": "I've probably been here three times in my lifetime and the food was always average for your typical diner. Most recently, I got a philly cheese steak with fries and a brownie sundae on UberEATS. For one, the cheese steak came on a roll instead of a hero which did surprise me but it wasn't the end of the world. The cheese steak itself was very average at best though, as it didn't taste much like a cheesesteak. In fact, the sandwich really didn't taste like much at all if I'm being honest. It was basically a roast beef sandwich with cheese and onions which I actually wouldn't have minded too much if it had more taste. The fries that came with it were pretty good though. The brownie sundae that I ordered was great though, no complaints about that. Prices are average as well, definitely not too bad."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaLXFfRmJREAE",
            "text": "Atlantic Diner is not quite the flashy New Jersey style diner, but it is a place with style. It's well appointed with an undersea motif, good ambiance, and 90s music playing in the background.  Right now it's George Michael.\n\nThe upholstery is a little worse for the wear. Though probably not dating quite to the 90s.\n\nI'm here at 5:30 on a Friday afternoon and must have beat the rush. Seating and service were prompt and professional. The menu spans the gamut in typical diner fashion.\n\nOne of the views looks across Queens Boulevard. As the people of Queens parade by in pursuit of work, pleasure and the mundane tasks of life, I realize how much they are a  Cross section of the world.  Hundreds of languages, races, nationalities, cultures and subcultures.... crammed together in the small space that is New York City; rubbing shoulders throughout the day, everyday - and living in peace.  No need for government mandated equity and inclusion.  The people of Queens have been doing that successfully, naturally and peaceably for 100 years....  Top-down intrusion in the name of inclusion never works anyway.\n\nMy cheese omelet arrives and is good but not fantastic. But truth be told: I didn't pay for fantastic. A large 4 egg cheese omelette Was only $12.95.  So who's complaining?\n\nAfter thinking about it, My third time here I asked the chef if he could cook the eggs in butter for me instead of oil. And good sport that he is, he did. And it made all the difference much tastier. Thanks Eddie!!\n\nThe cheesecake is amazing. The slice is beefy in size and creamy in taste. It doesn't have that cheesy flavor that a lot of cheesecake does.  I've been eating cheesecake for a few decades and this is the best I've had. Even better than juniors in Brooklyn ...\n\nThe menu is broad enough to support several return visits and I will be making at least some of them."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VQbUkzWVdKcjhfZzV3RRAB",
            "text": "This is your typical diner with a full menu. I usually come for breakfast and have been coming here for years. The breakfast is pretty good, and it’s a huge serving. A few months ago, I was lucky to have Susan as my server. She is super sweet and friendly and excellent at her job! Now, I always ask to be seated in her section. They also have a free parking garage downstairs."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaTVqMFBBEAE",
            "text": "They can do a little better with the Tv suitation, ( 3 very small tv's with the captions going, but if your facing the other way, you are out of luck ) but the service was quick &  and the coffee was freshly brewed. Our waiter, \"  Roy \"  was on point with the service."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdk9PMUdnEAE",
            "text": "The location is good and they have parking. Customer service was great!\nGreat environment to sit and chat and the environment was clean. The food quantity was very good but wasn’t very flavorful. It was very dry and my coleslaw had something I bite felt like sandlike."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2aThxeW9BRRAB",
            "text": "Great local diner.\n\nEstablishment was clean and the staff very courteous.\n\nPro: Food was delicious and made fairly quick.\n\nCon’s: there was a bad piece of bell pepper in my salad which should have been cut out as it was non edible.\n\nLunch for a family of 4 was about $80.\n\nI’d definitely visit again though:"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2bjh5Zk13EAE",
            "text": "I really wonder how this place has so much 5 star reviews to be honest because my one star review is only because it's the lowest I'm allowed to give on Google. I decided to go to this place because it's in my neighborhood and the icing on the cake was that I went here for my birthday to have dinner. To start with, it seemed as though the waitress was trying to rush us to place an order, however it was a lot of us and they have a big menu so obviously it would take a while. I ordered the half chicken with stuffing, mashed potatoes and broccoli. The apps we got were calamari, Buffalo wings and mozzarella sticks. The calamari was stiff and chewy, Buffalo wings was literally dry, fried wings and the mozzarella sticks were very salty. The mashed potatoes were tasteless and the broccoli had no taste as well. My brother ordered the steak well done but it was burnt, hard and tasteless. Unfortunately, it seems as though none of their food has any taste. But here's the best part, when my food arrives on the table, it has an egg shell and a carrot root in it. I requested the manager and tried to explain to him that my family and I want a refund on my plate as well as their plates seeing that they didn't start to eat yet.  My family honestly were not going to eat their food after seeing what was in my plate as they are obviously prepared in the same kitchen. He immediately gets angry and starts quarreling. He honestly should learn some manners, especially being the manager of a FOOD place with the fault being on HIS side. We grew tired of the arguing and soon settled the bill, a whopping $200 and yet none of us even got to eat and we surely were not going to carry home any of that food. I honestly wish I could've given this place negative stars especially because of the nasty attitude the owner has. This was the absolute worst birthday ever."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VOLUw4SlRMcE5PMUFREAE",
            "text": "Service was horrible, no class no kindness, tone in voice was un appropriate!! Even my son said, U need to b in the best behavior if u want to have a business. That says a lot! Also my cup was dirty and could only mean one thing, they don’t probably clean the right way. Never coming to this restaurant again!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyX1lUdEl3EAE",
            "text": "Huge menu, fresh food, incredible service ⭐️\nOur table of 5 had to wait a little while for a seat on a Sunday afternoon because it was so busy here. Obviously a local favorite.\nMy burger was so delish. Salad was fresh. And the service was above and beyond expectation.\nThe menu is extensive; what you would expect at a diner. Hard to choose what to eat! Great range of options for everyone.\nVegan friendly options with the veggie wrap or platter."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxajhxaC13RRAB",
            "text": "Love it here! I always love coming here and it's never a miss :) They have valet parking too. Bathrooms are clean. Food is delicious and they're always attentive when it's a full house, which is great. Nothing to complain about 👍\nUPDATE: More pictures!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeGNLdFFREAE",
            "text": "pleasant little diner off Atlantic. pretty good veggie omelette, hard to mess up an egg plate."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCYU1qZFdlVFE0YVZwYWFrbFNZVkZrVGxkM1VWRRAB",
            "text": "A dependable diner that nails the basics. The vibe is cozy and retro, with friendly staff and quick service. Breakfast staples like pancakes and eggs are spot-on, and the coffee keeps flowing. Not fancy, but it delivers comfort food just the way you want it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQU1lfb3lXMEtpUS13RRAB",
            "text": "Ok, I understand it’s father’s day! Waiting time 30 minutes or more for a table okay fine i understand. But being seated for over 1 hour with a baby waiting on our order is insaneeeeee. It shouldn’t take over 1 HOUR FOR OUR FOOD MY GOD. It’s perfectly fine to wait on a table, but to wait so long for food is crazy, NOT TO MENTION I ASK FOR THE MANAGER AND HE REFUSED TO COME SPEAK WITH ME, WHILE I CAN SEE HIM AT THE BAR AND HE SEES ME. VERY UNPROFESSIONAL PLEASE GET A NEW MANAGER THAT CAN PROPERLY SPEAK WITH CUSTOMERS AND TRY TO RESOLVE THE ISSUE. Not a good first impression."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHM1BmN0lREAE",
            "text": "Omg idk where to begin.... before we even got to the second glad door the host was coming to seat us with menus. Very polite. As soon as we sat down, we were greeted very fresh water and ice with napkins. Very attentive. Our waiter came over and took our orders. Coffee came quick. We ordered French toast deluxe with eggs and cheese, cheddar cheese grits, and extra pancakes. These French toast was the best French toast I ever tasted. They were toasted to a crisp so perfectly and warm and just right in the middle. The flavor was hitting. This chef understood the assignment. The presentation was superb👌 🙌 👏"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyeGNHdlJREAE",
            "text": "Ordered from here yesterday had it delivered through uber eats...I checked off priority so it got here pretty quick.\nHowever the food was not what I expected! I literally just gave birth and was…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMeXZxdGdRRRAB",
            "text": "BEST BURGER EVERRRR!!! I got the cheese burger with fries on the side and they had a little bit of onion rings. it was very yummy. they give you the lettuce on the side along with the tomato. we also got some ice cream and it was very delicious"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGSGFrWmZabXBJTFhFeWRuTk1XakJpYzA5RFQwRRAB",
            "text": "Fuimos por primera vez con mi familia a este restaurante griego y nos encantó. La comida estuvo deliciosa, ideal para disfrutar en familia. La variedad en el menú es excelente y todos los platos que probamos estaban llenos de sabor.\n\nDe postre, decidimos compartir entre todos porque tienen muchísimas opciones, ¡perfecto para los más dulceros! Pero lo que realmente hizo que nuestra experiencia fuera única fue la atención.\n\nLa señorita Kris, quien nos atendió, fue increíblemente amable y paciente. Es peruana y nos explicó con mucho detalle cada plato sin perder la sonrisa ni la disposición, incluso cuando mis hijos hacían preguntas. Nos ayudó a que toda la experiencia fuera especial.\n\nSin duda, volveremos. Recomendamos 100% este restaurante y si pueden, pídanle que los atienda Kris. ¡Gracias por tan linda experiencia!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCM2F1T0d3EAE",
            "text": "Cold not ask for better service, the Gyro as you see I love them I try them everywhere!!!Juicy meat!!!!Sauce was nice salad delish and FRESH HOT FRY,If your going to eat them and jepordize ur fattness may well eat them right!!! pastries are lovely took one home with me!!!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZcVBuMURnEAE",
            "text": "The honey fried chicken had no honey. At least the waffle was good. I liked their mimosa, I rarely like mimosas. The coffee was good. My son's chicken burger was underwhelming."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRN3Y2YkZ3EAE",
            "text": "Overall I like this place\nFood : 100 %\nService : 80%"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MUttNjBRRRAB",
            "text": "I've only ordered twice now but I really enjoyed their MASSIVE pancakes!! The French toast was also delicious, but I'm more of a pancake fan. I've also had their omelettes and they've both been large and delicious! Both orders also arrived on the earlier end of the estimated time of delivery, which was lovely."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhZ092c3B3RRAB",
            "text": "I used to come here when I was a teenager and when I came back to the old neighborhood I decided to try out the old Diner for nostalgia sake.  I was greatly disappointed.\n\nMy Brisket was dry and tasteless.  I had to add salt and pepper to help it and that did not help.  My potatoes were cold and the Broccoli was just as bad.\n\nThe ONLY saving Grace was my server Angela.  She handled everyone in the spot by herself that night with style and Grace.  She was absolutely amazing.  Without her I would have given this place a negative star."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRb2YzODR3RRAB",
            "text": "Great diner!! I flew in, got my rental and asked the Hertz rental agent for a good breakfast place and this was her recommendation. I'm running an Ultra this weekend and this was perfect fuel after a flight. The waitress was so nice and gave me coffee to go. Thank you!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbWEzY2tnRRAB",
            "text": "Came here with my wife told have breakfast and the waitress Lia B, overcharged us. My wife, her breakfast was a dollar more & my breakfast was $4/more. When I called I spoke to the manager to let him know. Puts a bad taste in my mouth after this experience though. Not cool at all. Everything is already expensive and to do this, not very nice. I should have doubled check or remembered the prices myself but you just don't remember to do that till later. So beware. She's very nice & friendly too. Making that extra money for the boss isn't nice."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPLWUzem5RRRAB",
            "text": "The price was great but the service was horrible and there was a hair in my salad. I will never go back to this place again."
        }
    ],
    "reviews_count": 61
}