{
    "name": "The Classic Diner",
    "place_id": "ChIJrwhiFa5gwokRn6R30SU7M2U",
    "grid": "QN9",
    "address": "117-33 Myrtle Ave, Richmond Hill, NY 11418, USA",
    "rating": 4.4,
    "user_ratings_total": 1915,
    "phone_number": "(718) 847-7500",
    "reviews": [
        {
            "date": "수정일: 13시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210Q1ZUWmtNa3BhUVdWVGFHUk5OR2RDTmtOVE5HYxAB",
            "text": "They false advertise on uber eats crappy customer service over the phone the guy just wants to hear himself speak. The French toast picture has eggs bacon and sausage but its 14 dollars for just two slices of French toast it was also not good. Total I spent like 40 something dollars. I ordered on Tuesday nov 4 at 12:40pm that guy on the phone is the worst ruined my whole brunch"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOQk5HVlRhM2hyWmxVeU4ydEZabFJzTjBGelJXYxAB",
            "text": "Great diner. The name says it all!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toUWIyRkphM0JoV2tGTGF6VkRaMHc1WVdGMU4zYxAB",
            "text": "Beautiful setting and welcoming people. I’ll definitely come back!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMVYwUkRYMmxZU0dSR1pIZ3lSRU5hTVhkWWMyYxAB",
            "text": "Called the diner to order their vegan club sandwich on uber eats because I didn’t see it on the menu but I know they serve it, and I was answered by Mike who was so pleasant and helpful about assisting me with my uber eats order. He even made sure to confirm which bread I’d like for my sandwich! In the notes, I was pretty annoying with some special instructions and to add a pickle + coleslaw, and to my surprise when my order arrived, everything was made with love! The lettuce was crispy and not wet and soggy, the tomatoes were perfectly firm and not too juicy, the bacon was extra crispy and the vegan chicken cutlet was perfectly crispy and juicy. Literally the most perfect delicious sandwich and I’ve been plant based for almost 10 years, have tried most vegan restaurants in nyc and I’m prettyyyy picky. Usually with uber eats the food comes soggy and steamy and not in the best condition, but to my surprise my sandwich arrived absolutely perfect. The fries were perfectly soft with crispy edges and had the perfect classic diner fries taste we all love. Not only did they pack me a pickle and coleslaw, they even packed two of each with no extra charge. Customer service was great, food was great, and delivery was fast!  Do yourself, me and the owner of this restaurant and try their Vegan Club Sandwich asap!!! You will not regret it! Thanks for an amazing experience Classic Diner!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WNVJHTXpTR2RZVUVoU2NYSXpWa2x0TXpKZlJWRRAB",
            "text": "Awesome service. Great food. Great prices. Classic diner."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sUVRFWktlVXhEY2xGa1VETXdlR1JLU1RVNGRHYxAB",
            "text": "Somehow the waitress didnt understand my accent, I had to get someone just to translate what I wanted to order, this is the first time I felt discriminated, I haven't got that issue in any of the hundreds of restaurants I had visited"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKeU5tMVRaVmRpTmtkeFdYZFVjVGd5T1doaU5HYxAB",
            "text": "The service is so good. Actually almost too good. My wife and sister in law were going through something and crying a bit and the waiter kept coming around every two minutes asking if we needed any refills or anything else. lol.\n\nFood and prices are standard for diners."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUmFrWmhjVXRqT0VOaWJXc3lTVkJ3U0Vsb2VVRRAB",
            "text": "Great customer service great experience"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJci1ydkNBEAE",
            "text": "Nice place to go"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSSVJYVjRZa2w1TFc1aWFYbFFYMDgwTWpCTE1GRRAB",
            "text": "Friendly and inviting classic diner - a great way start your day with all the favorite breakfast and brunch options. Burgers sound good too, will try that next time"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRN3VPUTV3RRAB",
            "text": "My kids' favorite place since they were little kids, and they are teens right now. We still have breakfast together here. The place is very clean, the staff is very friendly, and the food is good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTlVGWndNR3ROYjA5MlZsbGtNMjR4YWtoeFEyYxAB",
            "text": "Nice diner with a standard diner menu. Food came quickly and was tasty."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxbVZYQlBObTV4VFVkbFNFeHNRVTFMY1RaWGQyYxAB",
            "text": "We had a great outstanding service from Tomas. We had ordered the lunch special but the tasting wasn’t phenomenal it could be better for the price. The music in the background was great, the restroom was very clean, organized and good space for mothers with children."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVU5XeGFlazFJY21Oek56SmpOWFZsYTAxMGQwRRAB",
            "text": "This was my second time here. My first time went well. Breakfast was good and had good customer service.\n\nThe second time was not so great. I ordered a Mexican burger and the burger was very greasy and had no seasoning.\n\nThe waiter was nice and service was decent so we were planning to tip. I was going to leave a cash tip on the table but didn't have enough cash so I figured I add the tip when we were going to pay.  As I walked up to the front to pay, the employee had a nasty attitude and looked at the bill really hard said \"you have to leave a tip\" with an attitude. Like sir, I was going to leave a tip. It was my second time here so I thought they had a system where they swipe your card via a tablet and then the customer adds the tip. The employee's demeanor was demanding and I called him out on it saying that the plan was to tip.\n\nIm surely not coming back again. I always tip as a sign of respect and even if I was not going to tip that employee's response is highly inappropriate as tipping is not mandatory by law."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxUFZHczNNSFppWW05SFgydGpiMHhEU1RCellsRRAB",
            "text": "Hands down my favorite dinner in nyc area\nFood always done to perfection\nThe cakes are 💯 delicious 🤤\nThe coffee not so great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vd09YVjRkRWhTY2tsQmFrUXdkbWhmZUhkemEzYxAB",
            "text": "Amazing staff, the owner is so welcoming and friendly. He makes the entire environment feel like family, he treats regulars like family. The waitresses and waiters all treat you the same: like family. They address you by name, they know your orders, and they check up on you regularly while eating. The busser boys do an amazing job at refilling coffee regularly, refilling water, they bring you condiments if needed, and they are very warm, welcoming, and the first to greet you when you first sit down to enjoy your meal. Overall ive never had a single complaint at this facility except for the fact that I could not post 10 stars on google maps! Hahaha, definitely recommend this place for any breakfast, lunch, or even dinner. I’ve experienced all 3 before and this diner never fails to satisfy. It has that 80’s feel to it, and they always play classic 80’s and also 90’s (if i remember correctly) hit songs! PS: the cooks/chefs are very good at what they do. They can accommodate any type of diet as long as you inform the waiter of anything you’d like to add or remove from your order. This best applies for people who have dietary restrictions."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWbWFrSTJjV3hKVUhGdVZXWlpkakphUzE5VVExRRAB",
            "text": "I love this place. Quintessential NYC diner. Has all the classics including the slightly too long menu. Excellent breakfast, good strong coffee, big juicy burgers, and my personal favorite - the very generous and delicious eggplant parm on a hero.\n\nIt's always clean and welcoming, the staff are always attentive and friendly, and the food never disappoints. I grew up in NYC and have loved eating at diners ever since I can remember (RIP to El Greco in Sheepshead Bay) and this one takes the cake in consistency and quality.\n\nI hope it never closes so I can grow to be one of those 90 year old dudes getting breakfast solo or with family a few times a week."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWFUwUk9UVlZ0ZG1ReVVqWjZOMlJFVlRKVU1HYxAB",
            "text": "The food and servers here are great, but I had an issue with the cashier. My brunch came to $39+ for two people, plus $3.50 tax. When it was time to pay, I was directed to the cashier by the entrance. She asked what percentage tip I wanted to leave, and I said 15%. She then calculated the total and told me it was $58+. Excuse me, but my math is just fine—there’s no way a 15% tip on that bill adds up to $15! That’s ridiculous. Customers, be careful and double-check your bill."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5dVdGUllaMlpQVjBsSWNqaFVkWGcxZEZsR1FuYxAB",
            "text": "Food was so good I started eating before taking the photo lol. This was my first time ever trying a egg cream drink, 10/10. Service was quick and we were seated quick too (2 guest)👌🏼"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxZlRqWlhXazVXUldkc1kxcHpTRUp5U2tWd1gyYxAB",
            "text": "Friendly & warm atmosphere"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4elNsTnBaVFpxUzFaa1QyOUNUSFl6VVdscVpIYxAB",
            "text": "They are beautiful"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTmIyZEllbU5WZG1saVNYTkdVMDFmYzFGM2FWRRAB",
            "text": "Cute and small diner. Their cheese fries were good. I got a veggie wrap with balsamic vinegar dressing and it was okay. Service was good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjNGVFeG9iMnh0UVVNeFgwOUljbmxqTlZNM1dVRRAB",
            "text": "Had breakfast for dinner today😭 we’ve lived in this neighborhood for years and never been here. From the service, to the food and the atmosphere it was 10/10. I highly recommend this diner to everyone who appreciates quality diner food. Our server Micheal was so catering to us and checked on our table a lot. Our food was flavorful and delicious. I loved that they also played 80’s music. This diner is like a flash from the past and we absolutely adored it. We’ll definitely be coming back soon."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0V2JtYzFVMEV3TVhsRU4wWlZlVGxQZEdwUmRtYxAB",
            "text": "Cost too much. Crossbay still the best"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOMFVYWlFaR2x2WkZOd2VVNXpXV1ZEZGkwMlNVRRAB",
            "text": "Very attentive and kind waiter however this place is very overpriced and there was a bad vibe since I sat down at the table, simply because I came to have tea, a snack, and use the wifi. News flash: welcome to NYC, almost everyone needs to…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWWJFZEZkelowY1dkeFZVaHplbGRhYWs0NFgwRRAB",
            "text": "We stopped in 7/24/25  for quick breakfast, as we were early -jfk 4 pickup. This place had great reviews & we totally concur. The off st parking is bonus. We were greeted & seated right away. Nice old school vibe as diner. Many folks already well into their breakfast.  Hostess took order & coffee great. Like good cuppa . So easy to get to & back to van Wick. Cleanliness= great\nI would hope 2 return, 5 star place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wTVJuQkpTa1ZwYnpOWlUxQkpRV3B5UXpSSVNFRRAB",
            "text": "Besides having really delicious food, the staff there is very kind. I am pregnant and made a delivery and got a cheese on my sandwich I couldn't stomach and they sent me a new order with the right cheese. They didn't have to because I messed up but they did and they've earned a customer for life there 👍👍👍 thank you classic diner"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdVFVRmxWa1pFYnkxelVXVkVPR3hsY21OTlkyYxAB",
            "text": "Great food, great staff, great fast service… Kids approved the pancakes!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prek9HVm9XVWx6TTBkNmFtRkRkRFJCWWpCNWIwRRAB",
            "text": "Nice inside. Quick service. Decent food. Had brunch"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMGVUaHJRbEpCVlhsaWIwTXhVa2RwU25Wa1NtYxAB",
            "text": "The Classic Diner is a local favorite. I'm never disappointed with the food. Coffee is always fresh. Service is friendly. Facilities are well kept. Great place to bring your family."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oeGNHTlZlR2g1UTBONlQycGZNVEJtWVZaaVowRRAB",
            "text": "Great Service Great Food Great Staff Excellent Everything"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aSVNqUm1SbkJVYkVKR1ZWWnlUbTE1ZG5KTlluYxAB",
            "text": "It was a great experience and the staff was really helpful and kind."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNFQxOWhVbWx2ZW5VMVRscDBNbEpSTmkxT2FVRRAB",
            "text": "Very nice place, menu for a diner is extensive and expensive"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5UGJuZEVWR2hmWHpGRFNteG9jbk5JWXpoclltYxAB",
            "text": "Always a good time 🙏✨"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VMFVYaHdTWGh1ZVdGUVpreEtkVmQ1ZVRCMVZWRRAB",
            "text": "Everybody there is awesome! I feel very welcome when I go there. The food is great and the service is great, can't complain. There is a servant, his name is Mike—he's is very cool and funny. Love that guy! 🙏🏼❤️"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLdU9McXV3RRAB",
            "text": "Delicious food, fast and friendly staff, spacious, and decent sized parking lot."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJMmNWRnpXa0ZrZDI1NFFsOU1hazVuYzJzNGFsRRAB",
            "text": "Corn beef hash is the nastiest thing I ever ate."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPVE84OUt4ckxpMHdBRRAB",
            "text": "We go there often on Sundays after church.  Our waiter Mike is a true professional as well as the rest of the personnel. Food and desserts are good.  Some desserts aren't, just like some food items.  Overall a nice place to dine."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJSFZpOEN4M01DWVJ3EAE",
            "text": "good chicken and waffles"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MmVXQnJnRRAB",
            "text": "Me and my wife have been going here almost every other day or everyday. The food visual is amazing and it tastes just as they look. My first time in got breakfast now I can’t stop getting the chicken cutlets sandwich (stacked) w/ fries.\nMy wife gets the omelet she loves it. The coffee is endless and the toast is a must. We have tried a few other things like the Philly cheesesteak, the Cobb salads. We normally as for our food well done. Check it out brunch options available."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyc2VLZGZREAE",
            "text": "I had just gotten off the plane at JFK Airport, returning home from Puerto Rico, and was hungry. I put on my phone, diner near me, and this was the closest. We were immediately greeted by this Greek gentleman who looks authentic. We were seated immediately. The service was quick and very attentive. You get the diner book of a menu, which I love selection. Look very family oriented location. We enjoyed it on a Sunday afternoon"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRamMyQTVRRRAB",
            "text": "Leslie is the best waitress I have had throughout the years since going to that dinner. The food was good but could've been better. It was difficult to make a gyro because the salad was cut in huge chunks and huge slices that did not fit in my sandwich, especially the feta cheese, tomatoes, and onions. The grilled chicken sandwich w/ mozzarella & roasted red pepper was on the dry side and the bread was slightly burned, it make it uncomfortable to bite into (rough on the gums and roof of the mouth) And the classic diner wrap was mid. Felt like it was missing something, flavor wise, other than the honey mustard. Order of Mozzarella sticks come with 7 pieces. They were yummy. Cheese pull was on point!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUb2ZLLVBnEAE",
            "text": "The fact that I haven’t reviewed this diner when I dine here everyday when I’m on Queens on business is crazy! I’ve eaten and brought guests to eat here or take out at least 10 time is the last year and I HAVE NEVER BEEN DISAPPOINTED! Everything I have eaten, from the beef and barley soup to the NY Strip has been delicious! This diner in Jamaica will always be my go-to for great food! And the desserts! ❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1OHRDR2h3RRAB",
            "text": "Excellent diner food at an affordable price. The staff are friendly and attentive which is an added bonus. The waffles here are crisp and fluffy with yummy toppings. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOblpEZGFBEAE",
            "text": "We went there to kick off the New Year & they didn't disappoint us! The food was good (could be a little better) but their service was excellent and the server was very nice and professional. They have a decent seating area and the restrooms were cleaned. The place has positive vibes and good music. If you're looking for a good diner place around the neighborhood - this is the restaurant we would recommend. Have fun 🍻"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHamJlM0RREAE",
            "text": "Great place in the heart of Richmond Hill!!!\n\nTHE CLASSIC DINER, the name say it all.\nSparkling clean, great food, great service.\n\nYou can be certain that everything you order will be to your entire satisfaction.\n\nSeveral types of food from different nationalities, but be certain that any plate you order will be a great experience. As a new option, the desserts, those are amazing! Delicate fresh and right on point.\n\nThe prices are fair to low compared the the food and service you will receive.\n\nDon't miss it, you will enjoy the always friendly service!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OGZfX3p3RRAB",
            "text": "Who says you have to go to New Jersey for a good diner?  This place has good food and fast service."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLbV9lc2FnEAE",
            "text": "Great way to start the morning with a nice and hearty meal. The portions are fully loaded. The menu is large enough where anyone could find something. You’ll definitely leave here a very full and satisfied individual. The staff is nice and professional. You’re definitely getting a good bang for your buck."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcTQta29BRRAB",
            "text": "First time here and I had a great experience. I went to a near by diner and had a bad experience but this place is awesome.  I had the pleasure of having Gloria help us. She was very attentive and friendly. I actually love this place. Definitely recommend it!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHMlp1TmxnRRAB",
            "text": "This was my first time at this diner and I am so glad I tried it. From the very beginning, we were greated and cared for by amazing waiters. They were very attentive and provided fast service. The food was also great. Eggs benedict were delicious along with their pancakes. The atmosphere also gives a slight retro vibe with some art  highlighting parts of Queens. Clean restaurant, kind waiters, and good food. Highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaTQ3X1FBEAE",
            "text": "I have visited many diners while living in nyc and I have to say this is by far the Best diner in NYC! very aesthetic, and the food+ dessert was delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkMTliUFZBEAE",
            "text": "I’ve been coming here for years. This is my favorite diner. Employees are friendly. Food never disappoints. My faves are the farmers omelette and lumber jack pancakes. My boyfriend loves the disco fries, sweet potato fries, philly cheese steak wrap, and burger. We come here for brunch dates all the time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKeEtiQ2lBRRAB",
            "text": "Cozy diner in queens with lots of parking, the food is delicious everything I tried so far was perfectly cooked. Their coffee is on point! It's definitely worth going, no disappointment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyaE1HMFBREAE",
            "text": "Great duner took my daughter here for Sunday breakfast. The food was fresh, tasty and hot off the grill. Please atmosphere. Will be returning...and my waiter she was awesome sorry forgot her name.but I was the lady with the little girl who ordered the Belgium waffle and bacon and I had the fluffy pancakes with Virginia ham, and orders 3 orders to go."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNU1HcC1RRRAB",
            "text": "Woke up early and had a craving for diner food. I had been wanting to give the Classic Diner a try for some time so it was time. I went with the sausage omelette with home fries and toast. Everything was great. Service was fast and friendly from start to finish. Will be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXbk82RXNBRRAB",
            "text": "The absolute best diner in Queens. I love their delicious foods and service is 100/10. Very friendly staff and amazing cooks alongside waiters/waitress. My favorite is the lumberjack for breakfast. Amazing chicken noodle soup. For dinner I…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHZ2RfY3ZRRRAB",
            "text": "Came here for dinner. Tilapia was very good, but the burgers, cole slaw, and bacon were all either dry or tasted old. The dessert here is definitely worth a visit, but the burgers not so much. Waiter is very friendly. Seating is nice as is the music. Enjoyed the ambiance. Clean bathrooms."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dE9US253RRAB",
            "text": "This place had the best reviews for area diners so we stopped in for breakfast before heading to JFK. They had a small parking area for guest (maybe 6 spots) so we didn’t have to look for parking. As soon as we walked in, I noticed the place was very clean, we were greeted by our server and she sat us at a booth. Another server came around and he poured us coffee. Our server came back and took our order, I ordered the lumber jack (pancakes, 2 eggs, sausage, bacon and ham) My friend got 2 eggs, hash, sausage and rye toast. Our order came out in less than 10 mins, my lumber lack was delicious, had a stack of 3 pancakes, a nice sized sausage, 4 strips of crispy but not burnt bacon, and the ham was good too. Eggs were a perfect sunny side up, so I could get the runny yolk coated over my pancakes and sides. My friends food looked good and he enjoyed his meal as well. Coffee guy came around a few times offering refills and our server always checked on us to make sure we were good. I’ve been to some terrible diner’s, this one was perfect as was exactly what I wanted and expected. I also liked that the menu wasn’t a novel, it was 2 pages and easy to read, not cluttered with everything they have to offer. They probably give you a different one for lunch and dinner time because I didn’t see any sandwiches or burgers listed on the one we received. I didn’t care cause we came for breakfast. Service was great, food was perfect! My go to moving forward when I’m craving diner food!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2OE8tS2dnRRAB",
            "text": "Nice food , nice service\nDefinitely I'm gonna back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSLUxYMFJREAE",
            "text": "I ordered chicken and pancakes first pic is rhe small piece of chicken they gave me I was upset bc my meal was $30 for the amount I paid did not satisfy the food that was given I asked the waiter for another piece of chicken bc it was really small he jokingly said it’s a baby chicken then proceeded to come back with chicken tenders which is didnt even want I wanted what I ordered the waiter was nice but Im irate that I didn’t get what I paid for!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlaktfaDNBRRAB",
            "text": "I don’t understand whats happening to the Classic Diner . They used to be so good. Now I can’t even get a salad that I can enjoy. My daughter thought the big slice of green pepper was a bracelet. That tells you a lot. I wouldn’t serve or cook this for my family so why would they serve people food like this. Everything was sliced way too big and sloppy. The mushrooms taste like canned mushrooms. After a few times of giving them chances. Its going downhill. We will definitely not be ordering from here anymore."
        }
    ],
    "reviews_count": 61
}