{
    "name": "Pop’s Cocina & Bar",
    "place_id": "ChIJIQ4bDeRdwokR_BBhTMGHD7o",
    "grid": "QN9",
    "address": "85-22 Jamaica Ave, Woodhaven, NY 11421, USA",
    "rating": 4.3,
    "user_ratings_total": 729,
    "phone_number": "(718) 846-2037",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20weFpVNVhhM2xJWmxoYWJWOTZjeTFOWWxOV2QzYxAB",
            "text": "Excellent place to unwind after a stressful day, dinner was extremely delicious, fresh food, and the pina colada was amazing !"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJNVExbEVWV1ZtYkRKVFZtVlhha2xuTjA4MGFWRRAB",
            "text": "Just wanted to share that the food is good here but the service from the Giraffe looking bartender/waitress is horrendous, she always has an attitude and carries herself like she does not want to be there every single time I visit this place. Everyone else courteous and welcoming which makes this place a 5 star review on all categories when of course she is NOT there!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMFExWkRlVVpEYzNoSVgzcDZOVGRHVUhoV1VWRRAB",
            "text": "Excellent  service  , food  👌🏻  amazing  👏"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZMk1FSXliWGhRVm5OMVJEaHJPVVZHUVVwWWNrRRAB",
            "text": "We celebrated my mother’s 60th birthday surprise dinner with 50 guests and it was a very lovely experience. Niurka upon meeting her was very sweet charismatic and ensured to answer all of our questions before booking the space. We kept in communication to make sure everything was right before the night of the dinner. The night of the dinner she made sure everything was set up before our arrival! Every person working that night was professional, friendly, attentive and efficient. The food was amazing as well. This was my first time here, and I will definitely return for another dinner night!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pObVMxZHlOa3QxVkZRdFlrTnlXR1pPTFY5WmNrRRAB",
            "text": "Cute, decent spot. Enjoyed the chicken mofongo. The churrasco was alright. We really liked the strawberry tres leches."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5a1RXUmpNMFUxYlZkTGVETlFlWFZTTVRsSGRXYxAB",
            "text": "Excelente lugar. si quieres pasar un momento agradable con excelente comida y bebidas Pops es el lugar indicado. Henry haces los mejores tragos, y Nuirka te recibirá con las mejores atenciones. 100% recomendad."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQ01sVmFWR3BhV2xwcVFXbDZSMnhNUnpsTGFuYxAB",
            "text": "Amazing food and service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4eVdHOW1iV1ZyVURkNVJYRkxURkZUUzA1blZFRRAB",
            "text": "This is my first time here. The place looked like a nice and cozy place. Food portions were somewhat small and food was fine."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gc2Vrb3hXRmt6UVVGcmVTMTBjR05PWXpORVprRRAB",
            "text": "Been to this place years ago when it was just pops dinner and its was great. Now its Pop's cocina and I must say its wonderful. I was there with my 2 kids and husband on a Saturday night and we enjoyed our self. The drinks, the food, the atmosphere and the whole vibe was great. Looking for a small upscale vibe this is the place. Definitely will be going back to try the mofongo with pork belly."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psaFIwOTVNR2syZVU5Nk5YazJXVXN6YVhkb1VXYxAB",
            "text": "Comida excepcional . Servicio 1A"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OeVZsUTJiM0ZqVDB0cFZ6VlRXbFF4WkZrNVVsRRAB",
            "text": "Food very good😋"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWRFNqazVkV1ZGYnpRd1gzZExWbUZNTVMxblZFRRAB",
            "text": "Fun environment, mature crowd, and friendly service.  I would recommend it as it is price-friendly and surprisingly good wine selection for a Dominican spot."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdlZuUlNaRU5tVGpOeGNXTTBlV05zY0VKcE9IYxAB",
            "text": "I’m so glad this place is in our neighborhood it’s always great quality food. We finally made it to their brunch and it was all great. Got the lumberjack, eggs pancakes and will have it all again. Coffee was good as well!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMRDBnLUtLdy02OGJREAE",
            "text": "Had the most delicious shrimp mofongo  today mom had pork mofongo and really good chicken empanada, spicy wings and a really good drink called La Isla"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQLVM5LWYtN0t5M3pBRRAB",
            "text": "The atmosphere was peaceful and cozy. The food was generally very good. We ordered several dishes—chicken, seafood, and beef—and everything was cooked to perfection. Our waitress - Niurka - was excellent. The suggestions she gave us for food and drinks were spot on. Thank you, Niurka."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKSEhwTWFYOHVtU2tRRRAB",
            "text": "I have to start with WOW!! We were walking from dropping a U-Haul rental to eat in another restaurant and then thru the window we saw this girls toasting with frozen margaritas and we decide to check the menu and 💥 I see mofongo in the menu and the drink specials for 5 de Mayo with DJ.  Totally shocking and happy for the whole experience.  The food was exquisite and blown away with the cognac sauce. Told my friends to come again in the weekend\nThanks Henry you made my day!!! 🙏😍"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNTZyX3BnRRAB",
            "text": "Food tasted bland and cocktails tasted terrible. Service is horrible they don’t accommodate to customers and overcharge. Never going back ever again. Worst place to spend a birthday. Highly disappointed and unprofessional service. Deserves zero stars."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJeVBIMGhBRRAB",
            "text": "I love this restaurant! The meats are great, especially with lime juice. I even met the owner of the restaurant, Pop!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjaGFfU3RBRRAB",
            "text": "We don't servers touch your plate before asking, I hate that...ask are you done before you touch the plate 1:1 rule of a server. Turned a great meal into an overwhelming moment."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfajdTeW5RRRAB",
            "text": "Always great service, and tasty food and drinks."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmM0otQ1JBEAE",
            "text": "Great food and nice environment!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MnRxVkJBEAE",
            "text": "I dont like how they Serve the food but their food was good."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQclpleHZBRRAB",
            "text": "Really delicious food and a chill atmosphere! Had their Passionfruit Tres Leche...we wanted more...but my friend is getting ready for her wedding lol"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYNWNmR0RREAE",
            "text": "Great place to chill and have drinks!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbTZ2X2tBRRAB",
            "text": "Come here every now and then. Whenever I come I somehow also end up with same waitress Iliana she remembers my oder even tho I don't come for months. Never had a bad experience here"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueV9TME9nEAE",
            "text": "Excelente servicio al cliente , una amplia variedad de platos, recomiendo el salmón, los camarones scampi y la tuna tartara. No dejes de probar las margaritas frozen. Recomiendo retomar la música en vivo."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMXFuSjNRRRAB",
            "text": "The shrimp mofongo, taste was off . The shrimps taste rubbery and like it was expired."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbW9tR21BRRAB",
            "text": "Restaurant charged additional service charge + tip included on the bill.  18% service + 18% tip . On the other hand, the food was good but not coming again."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVeU1lSEhnEAE",
            "text": "Great atmosphere for me and my friends to hang out and talk during happy hour. The waitress was helpful with making recommendations. I would definitely come back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaVlMUjZ3RRAB",
            "text": "Been here a few times and everything I've tried has been great- fried chicken sandwich is perfect & they have a good happy hour."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiN3EzQ1lnEAE",
            "text": "Love everything here 🙏🏼❤️ food is good service is 🤩 fresh lemonade love it! Drink and cocktails 🍹 👌👌👌"
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkMXQyZzV3RRAB",
            "text": "El servicio muy bueno"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6N1l2VEJnEAE",
            "text": "Delicious Dominican food with a gourmet touch. Excellent customer service and beautiful decor. Highly recommended!\nP.S.: their \"Morir Borracho\" is a must try. Delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6NTZDeXJnRRAB",
            "text": "I come here regularly, and while the menu is rather small,  the food, drinks, and service are always consistent. It's just as good on a Monday afternoon as it is on a busy Saturday night."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUaThTZFpREAE",
            "text": "Atmosphere, food, and service were all amazing. Can't wait to go back."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUXzlPNkp3EAE",
            "text": "Me encanta pops , la comida siempre muy buena, las atenciones y el ambiente muy acojedor. Es siempre una experiencia super agradable. 100% recomendado."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUOXVUanh3RRAB",
            "text": "The staff was amazing"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4Mm9Dc3dBRRAB",
            "text": "Nice place ,food taste good and service is great is my to go to place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaMF9LLUlnEAE",
            "text": "This place is beautiful. The atmosphere was peaceful and cozy. I had breakfast with my sister on a rainy day and it was so nice. The food was perfectly cooked and coffee was so good we had two cup's.😬 The check was less than $40!! We went…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcThLcU93EAE",
            "text": "My sister took me here for my birthday; one of the best places for brunch no doubt. The food was really really good. The drinks were strong. The proportions were good enough and prices appropriate. The customer service needs some help, we…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1bnMtRDNRRRAB",
            "text": "I enjoyed my dinner here. I took myself out Saturday afternoon around 5 pm , it was not busy , the staff were pretty quick and friendly. I am not fluent in Spanish but the waitresses got my order correct and understood what I wanted. I ordered an appetizer, with a Salad , and two margaritas. Everything was good !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaaHFEOVBBEAE",
            "text": "So I walked into Pop's on Jamaica Avenue in Woodhaven the other day And much has changed.\n\nBeen coming here for almost 20 years but haven't been here for a few.\n\nSadly they've removed a lot of the beautiful wood although some remains. The old fountain counter is gone, As are the booths and other seating to be replaced by elegant tables And a bar.\n\nI have to say it makes a cute little restaurant, although I do miss the old Pop's.\n\nThe food was good. This is no greasy spoon. It's a step above diner food, but with the ambience of a somewhat classy restaurant.\n\nThe new Pop's is a nice place for couples or families to dine; or to dine alone - as I was."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxN09xT1Z3EAE",
            "text": "The food is great at Pop's Cocina. I would just suggest going there when it isn't too busy. I have have been there three times. When it isn't too but the food is wonderful and the service excellent. When they are busy,  the food and the service suffer tremendously."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3MG9LZlZBEAE",
            "text": "Had steak as an appetizer and it was very tasteful ! Also , had the sangria and la Isla to drink . Both drinks were good , sangria was strong & the la Islam drink was smooth . The POPS burger was also well cooked and well seasoned . They have hookah and live music which was a plus on my side . Great customer service !!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMkxXX3NBRRAB",
            "text": "The place is nice, the service is good the employees are friendly. The only bad thing is that sometimes the food takes a little longer than normal but I recommend the place. It has good food at good prices.\n\nLa comida es 10/10 el servicio es 10/10 y los precios son muy accesibles… lo remiendo"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJeTd2TndRRRAB",
            "text": "Its a beautiful spot if you are on a date or just hanging out with friends/family. Food is always delicious. Went today for lunch and ordered pork chops with a side for only 10$. I usually come for dinner and get a skirt steak which is a…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSX2E3LVNnEAE",
            "text": "I had a great experience with my family at this place and it was 17 of us. My first time here and we just winged it. Great environment, food and staff. I would recommend and go back again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NEtYUk9BEAE",
            "text": "Was pleasantly surprised about this place....since we were looking for something on Sunday morning brunch ...Trust me you wouldn't be disappointed with PoPs . My cousin decided to Surprise me"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnanZQZGFnEAE",
            "text": "Mid afternoon lunch. Not crowded. Great food. Great service.  Will be back.\nCame back for Empanadas and Sangria.  Was really good. The sauce for the chicken Empanadas was excellent."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhbk0tZ0ZnEAE",
            "text": "The place is nice, the service is good the employees are friendly. The only bad thing is that sometimes the food takes a little longer than normal but I recommend the place. It has good food at good prices."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5cl9iRlVnEAE",
            "text": "10/10 I enjoyed very much, food is tasty, fresh and fast. Music was perfect. The waitresses were always making sure everything was perfect. Definitely going back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5Nl83RjNBRRAB",
            "text": "This is my favorite local go to!\nYou can never go wrong with any item on the menu from the drinks and appetizers to the main entrees. Tonight was a steak kind of night. My husband had the Rib eye and I had the sirloin. The far Rockaway drink has been the beverage of the night. The staff is always so pleasant however Niurka went above and beyond elevating a casual experience to a spectacular evening with her attentiveness, enthusiasm and conversation."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4dS1LVHZRRRAB",
            "text": "Pop’s is what I call my second home. Food, drinks and the people are just amazing.  It’s always a good time. By far the best drink and dinning place on Jamaica ave."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNZ19iSmFREAE",
            "text": "It's local. It's authentic. We enjoyed the empanadas, but their breakfast is definitely to go for if you want to support neighbourhood restaurants. Love the amount of daylight that comes in, great service, would visit again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtelBxWGZnEAE",
            "text": "This place is a go to for me. The setting is real nice. It’s kind of a hole in the wall.\nI love their mini monfongito, the sauce and chicken is amazing. The plantains are just right.\n\nI order to drink the Morrir Borracho , it was a delight . 5 Stars!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCak1DdTVRRRAB",
            "text": "I love this place but I was highly disappointed with my order last night. Their quality control is usually on point which is why I was so surprised with the meal I received. The shrimp Mofongo in garlic sauce looked & tasted so bland.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTc2RIa3NnRRAB",
            "text": "Right now they set up like a hut outdoors for dining. Nicely decorated, with music and heaters for warmth. The food and drinks delicious as always."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtaElTdURnEAE",
            "text": "What a great experience I had at Pops for my first time ! Brought out my mom for dinner and drinks for her birthday and I was not dissapointed , drinks are freshly made by the bar, food was delicious,  the whole vibe felt very nice and…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURROHJpcFZREAE",
            "text": "I had one of the night's special, it was veal with some baby potatoes. It was just mind blowing delicious! Loved it. The drinks were great, the bartender Henry is very attentive and experienced! Had a great night overall! 🙌…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2dHBqcjhBRRAB",
            "text": "Their breakfast was excellent! I had the Tres Golpes and enjoyed it so much. Definitely would love to come back again if I come to visit Queens again. The outdoor seating was really cute."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhNUk2ZTVRRRAB",
            "text": "Awesome food and atmosphere. Drove past this place for years and didn't have a clue we had a gem like this so close. Great staff and the menu had something for everyone."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwa3R1aGdnRRAB",
            "text": "Very delicious food, the waiter was amazing and we had a great time."
        }
    ],
    "reviews_count": 62
}