{
    "name": "Empellon",
    "place_id": "ChIJ8b70m_tYwokRqGwQgnijLEc",
    "grid": "MN5",
    "address": "510 Madison Ave, New York, NY 10022, USA",
    "rating": 4.4,
    "user_ratings_total": 1094,
    "phone_number": "(212) 380-1215",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nM05GQXhTRkZwY21wak1uQm1TREpDV1VWV1JYYxAB",
            "text": "Love the atmosphere and the food was delicious. It seems like one waiter is working, but the staff is always helping him out which makes the transition a little better, but we waited for awhile to get our check."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXbnVlTHRRRRAB",
            "text": "Top spot in the city for me when it comes to business lunch. Excellent staff, delicious food, caters to every diet including vegan or gluten free. Lovely interior and attentive staff who remember you."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxcGFHMDJaamgyUmsxbFUyc3hOMWxYTFVkeldGRRAB",
            "text": "Best taco shrimp I’ve ever had! Also the best mushroom taco! The famous avocado shaped dessert is also a must!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wcFdEQlpkR2RuYkVaamFXaGZNR1JMV1ZSRU5FRRAB",
            "text": "The food, staff, atmosphere was amazing. Save room for the flan. Absolutely will be back to try more on the amazing menu. Unbelievable service and gorgeous restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSSWJFaDFTa1JEU1hsTE9HNXRjMlprZEVKV2VHYxAB",
            "text": "I went there with my partner on our anniversary. The food was top notch, especially the dessert that looks like an avocado. The service was amazing as well. One thing we really appreciated was that we had extra bags with us which they stored safely in their closet so that we could sit more comfortably. I highly recommend this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGUFVFRmlVMmRTYUZFMk5HMU9UMnRxUW1OTU1WRRAB",
            "text": "Really fun yet creative and upscale experience"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psVlpUUlBURmRDTFdaTGRrcGhZa3hKZEdkbmVHYxAB",
            "text": "They gave me salsa options, from mildest cremé of verdé to the spiciest red salsa on the face of the earth. Naturally, I went for the red head. 🥵\nPerfecto Empellon, perfecto"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoNlJGQnNZa1pHZUc4emRscHFVVlJ5TVVWRVJYYxAB",
            "text": "Quite possibly the best guacamole I've ever had. It was fun eating it with the 7 salsas they provide (the spiciest of which is deadly, be warned). We also had the crab nachos and fish tacos, which were both excellent"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSFV6RlJWalZaV0RGVmNuRnZaRnBtV2xONlJFRRAB",
            "text": "We stopped by for a quick lunch and were not disappointed.  Our outside dining was a bit uncomfortable as it was difficult to get around the tables. (Hence the four stars for atmosphere.)  The food, we both had the tempura fish tacos were delicious,  my husband had a V&T and I had a glass of wine, which were both generous and satisfying. The wait staff was attentive and friendly.\nMy husband has mobility issues so I hesitate leaving him, and when we went out to hail a taxi, none seemed to be coming our way.  I noticed one of the women who worked there come out and walk to the corner.  She actually hailed a taxi and told him to come around the corner where we were standing to pick us up.  NOW THAT'S WHAT I CALL CUSTOMER SERVICE AT ITS BEST."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGWlZXTnpNR0ZMT1daalJYbzRNemhPYlRCVlZsRRAB",
            "text": "The nachos were incredible. There are some odd very miss fusion items."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOWE1GOVZVelZDVURoaGFFOXlNRmsxUjI1TlNrRRAB",
            "text": "It’s a very good upscaled place! Food is a bit pricey but was worth it !\nThe pastrami tacos were amazing !!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwT05tcEhTRXBqUVdNNFVYQmFORTFuWDJrMk9XYxAB",
            "text": "We came for lunch and the food is amazing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBdFNURTNkV1p4WjJ3d1RsbGtibVptTTNreVYxRRAB",
            "text": "Innovative and modern Mexican cuisine, chic decor, great service… this is a gem in midtown."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRFRVWjVVMVJzYlZndFgwTTBOazVuVGpCRWQyYxAB",
            "text": "I had an absolutely wonderful dining experience at Empellón Midtown—a true gem for elevated Mexican cuisine in the heart of the city. From start to finish, everything was exceptional.\n\nI began with the Crab Nachos with Sea Urchin \"Queso\", and wow! what a unique and indulgent twist on a classic dish. It set the tone for a flavorful evening. For the main course, i enjoyed the Branzino Alcaparrado, beautifully cooked and perfectly balanced with its bold, briny flavors, paired with deliciously crispy Brussels Sprouts that were bursting with character. I ended my meal with the Creamy Avocado Dessert, which was surprisingly light, velvety, and a delightful finale.\n\nWhat made the evening even more memorable was the warm and attentive service. The entire team was gracious, friendly, and genuinely service-oriented. A special thank you to Genc Islami, the Director of Service and Hospitality, whose presence and leadership were clearly reflected in every interaction. Caroline, the manager, was incredibly sweet and lovely, her warmth really stood out. And Hernan, our waiter, took great care of us with charm and professionalism.\n\nEmpellón Midtown is more than just a restaurant; it’s an experience. I can't wait to return!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkMWRYTlVSMDl6UVVaV1ZIRmpSV1JmZFdOeFYzYxAB",
            "text": "The food is amazing.\nAll 7 salsas are great. The cashew is especially good and the guacamole is the best in Midtown.\nBesides the shock value of pastrami or cheeseburger tacos, the tacos are incredible.\nThe highlight might have been the avocado dessert.\nIt is super loud though."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WGFVWmxYMGN3U1c1eVREWTJPWGxSZUc1eVEzYxAB",
            "text": "Loved the ambience of this place. Crab nachos, beef tenderloins tacos, and desserts are a must! I loved the avocado dessert but the corn ice cream sandwiches were also adorable and delicious."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWU1qQkpNMnRtYVZaTlgxRXdWRzFvYmpSUFFtYxAB",
            "text": "Great atmosphere and food but somewhat expensive. It was an extremely busy afternoon but still the food came out quick. Sufficient vegetarian options. I would recommend this for team lunch or even family get together if you are into Mexican food. Don’t forget to try the Seven Salas. Pretty unique"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLU2E1Y2J1NDk2M1Z3EAE",
            "text": "Excellent food, bit fancier than the average Mexican cuisine, would go back for sure."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQSDhpNmJudU5HRThRRRAB",
            "text": "I was hesitant at first, but by the end of our visit, there's no question in my mind that we'll be coming back.\n\nThe manager, Gence, was beyond accommodating with menu suggestions, meal descriptions and overall friendliness.\n\nHe took time to talk with my family and I about the restaurant, business, his personal life and his employees.\n\nOur server, Carmen, was very attentive, friendly and extremely helpful.\n\nThey both offered suggestions to other restaurants for my family and I to visit while in town (upon our request).\n\nNo question that we'll be coming back!\n\n...oh ya, you have to try the avocado dessert!!! Amazing!!\n\nThank you guys very much for a great experience!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJem54T1NEaWRlZklBEAE",
            "text": "If you want $25 tacos with finance people, this is the spot for you. The salsa sampling and tortilla chips are very good, though."
        },
        {
            "date": "4달 전",
            "language": "it",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQSFJqc2FVbzZxOE9REAE",
            "text": "Mi hanno fa"
        },
        {
            "date": "5달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOVF9oYjMtdjlUY1NBEAE",
            "text": "피쉬타코가 맛있었습니다. 내부는 시끄러워서 대화하기 쉽지 않습니다."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMXzd1cXVPdWZ2aWVnEAE",
            "text": "Amazing service from entering the restaurant to the end of the meal. Enthusiastic and professional hospitality."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQU0l3dEdMc29PdVV3EAE",
            "text": "Came here for my birthday and had the best meal and service. Mariia was so sweet and knew every single thing about the menu making the experience great. Next time need to try the cheeseburger tacos😌"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLMkhxWXZxa2FEQmhRRRAB",
            "text": "The staff were excellent and the food was great. I loved that you get 7 different salsas to try!! My favorite was the cashew and the tomatillo.  My friend and I shared the rib eye fajitas with bone marrow. Was so good and perfect to share."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJaVg3YWYtbDczbWt3RRAB",
            "text": "I love beef taco in here,, such a nice taco yam"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMkwyaGdRRRAB",
            "text": "Great Tacos and Margaritas,  excellent service. The shrimp tacos are a must."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcGJfSzhnRRAB",
            "text": "Guacamole was amazing, salsa flight was delicious. We enjoyed the steak fajitas and margarita. Service was outstanding. Really nice restaurant."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNGEtcWpBRRAB",
            "text": "Love this place. Mexican food is my absolute favorite, and I am extremely picky.  The food was amazing, everything from the chips and salsa flight to the guacamole, to the steak fajitas, absolutely delicious. Awesome margaritas, and the service is impeccable. Shout out to the manager who leads by example, he was so attentive and supportive of his staff no wonder why they are awesome."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdXM2cUJREAE",
            "text": "Excellent service and food. Went out of their way to make our experience memorable"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMk11V1J3EAE",
            "text": "Overall perfect restaurant, had great ribeye, ice cream, and peppers. Great service and nice vibe."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdDczN0NnEAE",
            "text": "Outstanding all around. Really enjoyed the food and service."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bXVyN1BBEAE",
            "text": "Nice place and atmosphere… we went in for a dinner with colleagues.. fish tacos were a bit salty\nGuacamole was great.."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJb19IUlVREAE",
            "text": "Was sat 25 minutes after reservation, hostess was very rude, was sat in the bar area, no free item to make up for this, just bad hospitality overall. $34 tacos for just shrimp and barely anything else on them, total scam."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcUlpU3JRRRAB",
            "text": "Absolutely loved this place! Every single item on the menu was fantastic, and the whole spectrum of hot sauces they had in a tray was really unique. I’ve never seen anything like it. But what really stood out was the service. From the…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJc09yeUhREAE",
            "text": "Unfortunately, they’ve charged more than what I authorized on the credit card. I wasn’t expecting this kind of issue from a restaurant of this caliber."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3Zy1ITl9BRRAB",
            "text": "We had lunch and everything was really outstanding. The guacamole was exceptional and it was fun trying all of the accompanying salsas. We really loved the carrot appetizer. Tacos are also a standout, with corn tortillas that are fresh and flavorful. I would love to go back. One nice touch we noticed is that  cold dishes were served on chilled plates which made the food extra refreshing."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3ajRYSUJBEAE",
            "text": "Alex Stupak is a genius!\nThe crew was perfect also.\nGood food, good drinks, good location, beautiful place… awesome experience"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3ajV5MWZREAE",
            "text": "Decent Mexican food…. Outside of California and Mexico?  Yes. You’ve come to the right place. Before I get to the food, David the waiter from Bogota was incredible. His suggestions were spot on and his service was of course 5 stars.  Sometimes, you get a great meal but mediocre service.  This place gives you both.  Ask David what he suggests depending on your taste buds and he won’t steer you wrong.  I had the ribeye tacos and they were as good as he described them. Muy sabrosos!  The wine list is surprisingly decent with great choices from Oregon.  We had a very nice Pinot noir that complemented the ribeye tacos.   Check it out for sure."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3Mll6VTNBRRAB",
            "text": "A bit disappointed with service/food0"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMzVuOWNBEAE",
            "text": "A great space with a very buzzy atmosphere, this is a great after-work spot. They serve up great margaritas with a few creative takes - their saffron margarita was definitely a new one for me. And the chips with guacamole and seven salsas are awesome - I’d come just for a couple of drinks and an order of those! I also had a couple of their elevated tacos - the pastrami and the fish tempura. The pastrami was nice, but I felt it could’ve been a bit more tender. But the fish tempura was outstanding with a great crunch and nice flavors. All in all a great spot that I’ll come back to."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcV9tNTJ3RRAB",
            "text": "Great food, vibe and drinks. Always worth a visit when in NY. New on the menu was the Ribeye for 2 to share and it did not dissapoint."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMDR2RDFnRRAB",
            "text": "The BEST !"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNXN5Y1hBEAE",
            "text": "An elegant Mexican bar and restaurant. Its delicious multi-layered dishes and wide selection of tequilas are also attractive. If you think drinking tequila is a punishment, you should experience the beauty of tequila at this bar."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTURRaFBGaBAB",
            "text": "I don’t even know where to start. The ambience delight and the music is phenomenal. The service is top notch, one of the best in the city. Before you even think about it, the service staff already knows that you need something. The servers and waiters are extremely attentive and polite. The food every entry of the menu was better than the next we received. When we thought we couldn’t be wild with more, we received a complementary dessert which was out of this world. We will for sure be coming back. Thank you to the team and the chef for such an amazing Experience."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbVpQY1VREAE",
            "text": "Empellon offers outstanding hospitality and a unique experience. The food and service are memorable. We usually do not even think about dessert, but found both dishes extremely interesting and genuinely remarkable in presentation and flavor. Considering the flavors, it was no surprise that every ingredient was fresh and made with dedication."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRaE16UHFBRRAB",
            "text": "This place is excellent. Everything we tried was amazing.  The service is outstanding as well.  I highly recommend."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnZy1md25BRRAB",
            "text": "Always perfect for a business lunch!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBLXN5V2V3EAE",
            "text": "The best fajitas in town, hands down, and their sauces are incredible. I highly recommend you visit and try their food ❤️ you won’t be disappointed!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfN0lpMVdnEAE",
            "text": "Delicious restaurant with a lot of great dishes!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBbmZTczFnRRAB",
            "text": "The elevated Mexican food was very good. Surprisingly the pasta (cappelletti) was my favorite, but the rich salsas and the pastrami in the tacos were also good. The pastrami tacos are large and filling. The carrot salad, while tasty, wasn't really a salad, just carrots on coconut cream.\n\nThe service was very attentive. While there is plenty of space between tables, the place is very loud and didn't feel intimate."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2ODgyQVRnEAE",
            "text": "Stopped in for a drink and appetizer so can’t comment on much of the menu but there were definitely some different choices I would come back to try.  The queso was very good, a different rendition with chorizo on top but the cheese was creamy and the chorizo cooked well and tasty.  It was served with corn tortillas that were thin, chewy and warm, for me a perfect tortilla.  The cucumber margarita was tasty but a little light on alcohol. I didn’t try, but saw the guacamole being served and it looked great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYelB1LVd3EAE",
            "text": "Empellon offers a memorable experience of contemporary Mexican cuisine in a chic, stylish setting. The service was great from start to finish. The flavors of each dish were delicious, and the standout for me was the guacamole, served with seven distinct and delicious sauces."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwN0k3aWtBRRAB",
            "text": "Came here for lunch at 2pm on a Friday.  Food was good and the service was decent.  First time having nachos with crab meat and uni!  Usual pairing but it works.  The tacos come in two's.  The Brussels sprouts were well done too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqM3VxWnNnRRAB",
            "text": "A nice high end Mexican spot with a very nice interior in a large space, prices are on the high end because of this. The guacamole was very fresh and the presentation was stellar, the give you a bunch of different sauces to try from mild to very hot. Tacos were overpriced, more than 20 for 2 fish tacos. Definitely try out the dessert, the flan was very good!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURabU9HU3hBRRAB",
            "text": "Ate at the bar and enjoyed chips, quac, a selection of 7 salsas, multiple margaritas, mushroom tacos, fish tacos and the smoked black cod appetizer.\nService was great, drinks were on point and food was fresh & tasty!\nAs noted by many other reviewers, it’s very noisy inside. If you want to have a decent conversation expect to yell. But it’s a fun, lively atmosphere and the food this is good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aHBTek1REAE",
            "text": "Upscale place at Madison Ave with Chef's Mexican fantasia that will leave with a mesmerizing experience.\nTheir Guacamole with seven salsa servings ( ranging from mild to spicier) is must recommended.\nGreen Chili Shishito Peppers, Queso Fundido, Tuna Tartare are other good options. Decent cocktails options though limited non alcoholic mocktails, out of which the Apricot is the best.\nThey do Tuesdays Taco if you want to visit the place during specials 😀\nPumpkin Seed Cappelletti is slightly greasy, however it sets a nice taste on your bud.\nThe Tacos and Mains are generally good for two people as the quantity is sufficient."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybVplT3lRRRAB",
            "text": "Food are good especially loving the crab unit nachos. The shrimp fajitas is flavorful but the shrimps are not very fresh. The most thing bothers me was the service. The server told me the chef thinks if I order appetizers first and entries…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4MzhpbkdBEAE",
            "text": "Looking for tacos in nyc? This is the place. Two places for tacos that I love is Birrialandia and Empellon. Very different style but Empellon is really delicious. I odered a lunch set which comes with appetizer, main and a dessert (only for $45) and it was a HUGE deal! Starting with the salsa tasting, that was such a fun experience. For appetizer, I got the lobster salad, and this salad was not filled with veggies but filled with lobster and it was so tasty. The tacos were amazing and adding different salsas and guacamole made it perfect. Plus the dessert was refreshing for a hot day. The staff were so nice and always give us more chips if needed. Environment is pleasant and comfortable. Overall, go for it! Worth being int the NYT best 100 top restaurants in NYC."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsNHNDLW5RRRAB",
            "text": "I couldn’t recommend this place enough! The food has so much flavor and the service was phenomenal. Everything from appetizers to desserts were delicious. Based on all the other reviews we decided to try the avocado dessert and it didn’t disappoint. Your eyes see an avocado, but your taste buds taste an amazingly sweet/tart dessert. I wouldn’t pass up on it. We can’t wait to be back  ❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcGQtRVFnEAE",
            "text": "Had an extensive meal here for dinner and I have to say you definitely get your money’s worth here. Food is not just tasty but inventive and unique as well, especially their ice cream tacos. Service is prompt and friendly, and the wine offerings are decent too."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPMjdpWEh3EAE",
            "text": "Very big portion for a fine dining restaurant! The rib is amazing, probably the best one in the city! Mushroom taco is incredible. The only downside is that it is located in the business area. Most customers look like business people dining here after work. If you look for somewhere intimate for a family/date type of occasion. Not the right place. But overall, food is delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMeThfMG13RRAB",
            "text": "Empellon is a fantastic choice for a higher end Mexican restaurant and/or a work/event lunch. The three course lunch menu offers plenty of options and each dish was aesthetically plated and well flavored. I really enjoyed my meal here! Make sure you order the \"avocado dessert\" -- a quasi off-menu item. It's very unique."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqaWYzNHVnRRAB",
            "text": "Another incredible experience at Empellón. Crab nachos, pastrami tacos, and arroz con leche dessert all to die for. Continues to set the standard for upscale Mexican dining in NYC and a crime they haven’t been awarded a Michelin star. Must visit."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlajRxbHpRRRAB",
            "text": "Amazing lunch at Empellon!\nHad a fantastic time, food is top notch and service couldn’t be any better. Very attentive and friendly.\nThey offer a lunch special for $42 which includes appetizer, entree and dessert. Great deal!! We loved everything we had.\nHighly recommend"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdG9TSkhREAE",
            "text": "Service is impeccable. Manager was hands on in getting us seated. Our server was polished, friendly, and knowledgeable. She immediately asked about any allergies which we liked. The transition between courses was smooth, and seamless, dishes taken away new plates and cutlery set without any disruptions to our conversation. The space is set up very eclectic with a nice soft ambience.\n\nThe tacos were delicious, we had the fish tempura and mushroom ones, and both were amazing.\nThe shishito peppers, and sweet potato were nice but way too many and overpriced for something that basic. We needed to ask for more crema for the potatoes too.\n\nThe avocado is not an avocado. It was a culinary illusion and strange. With a salty ice base, and tangy eucalyptus yogurt, in the shape of an avocado the eye saw something while the tongue tasted something else.  We personally did not like it.\n\nIt is pretty expensive but with the service we received worth it."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNeGJ2N3NRRRAB",
            "text": "Trendy restaurant, interesting dishes.\n\nGuacamole with 7 salsas was a great start. Tempura Fish tacos were delicious. Short rib was unique and tasty, but was a lot for just the two of us."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0NlBLUUp3EAE",
            "text": "The food here is absolutely amazing! Our favorite dish was definitely the wagyu fajitas, but we also loved the guacamole with 7 salsas, as well as the pastrami tacos and the crab nachos. The octopus tacos were a pass. Loved the margaritas as well. Totally recommend eating here. Service was amazing too!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeHRIUkVBEAE",
            "text": "Empellon makes one of my all-time favorite fish tacos, which you can also order at their taqueria locations. We also really enjoyed the crab nachos and the surf and turf fajitas. The fajitas order was more than enough for 2  people and basically consisted of a massive ribeye, tortillas, and a few onions and peppers. The steak was perfectly cooked and came with a tasty black pepper salsa. They also make a tasty margarita."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKeF9ha3RRRRAB",
            "text": "By far the best Mexican food I’ve had. Mexican fine, fast dining at its best. Someone took me there on a 3rd date and since then I’ve been there twice. It’s a bit pricey for tacos but it’s worth it. Everything taste so good and fresh. My new favorite place. ❤️❤️❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxMU03X2pnRRAB",
            "text": "Very nice spot - fantastic ambience! Really enjoyed the vibe here. The food was delicious - got the veggie tacos and they really hit the spot. Had some drinks by the bar and those were very chill as well. Good spot - do come check it out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWaXRHVldnEAE",
            "text": "Chopped cabbage Salad was fantastic. I wish i could have it everyday. Surf and turf was great . As far dessert~ avocados dessert is iconic dessert in nyc. So not to mention, it was great! Service was good too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaN29mY0VnEAE",
            "text": "Was my first visit to this Mexican restaurant in NYC and it was a delightful culinary experience. Particularly impressed with the starter - guacamole, chips and the seven salsa dips. It was certainly a big hit with our group. The salsas were at varying degree of hotness and each was distinctively different from the other - a great experience. Also the \"avocado\" dessert which is a must have. The halibut I had was somewhat bland but combined with other savory stuff, it provided a balanced experience. Will highly recommend this place if one is looking for Mexican fare in midtown NYC."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2Ml83ajl3RRAB",
            "text": "The location was perfect for our plans. The service and ambience were good. The waiter spoke very softly and fast so I had to say \"what\" a lot. Seemed to be trying to upsell - listing all the sides, asking if we wanted 3 instead of 2 tacos. Our water was refilled very speedily! The guacamole and salsas were standout. We had fish and mushroom tacos which were ok but not exceptional.  It's not really Mexican food."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHODZDelpBEAE",
            "text": "Second time visiting today. Work-holiday lunch. Got to try most of the tacos prior (all good) so today went with prix fixe. Double guac for the table with the great 7 salsas. Excellent crab nachos. My meal was chorizo molotes. Jumbo prawn salad. A few margaritas. Pumpkin flan. The flan had nice textures, not much flavor. Ordered the “avocado” gelato and they threw in an ice cream sandwich for the table. Great coffee and espresso too. Everyone commented how good that was. Wonderful. Great service."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHcDhlZURnEAE",
            "text": "Call me cheap, but this place is really not worth it. You are paying for the service and the location/ambiance and that is it.\nFood was very mediocre, I have had far better authentic Mexican dishes in my neighborhood.\nI would recommend to go if you want a nice vibe out with friends, but I guess my fault for expecting more from a “trendy Mexican” Midtown restaurant.\nTwo “dry-aged ground beef” tacos for $20, honestly not sure what about the quality makes the food overpriced.\nThe flavor is still lacking, presentation is literally the same quality as Taco Bell (I’m sorry LOL), and there is nothing special or creative enough about the food that made me wow.\nCool aesthetics and interior, I’ll give a star for that."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVX1BhU0hREAE",
            "text": "For the price point, there are much better offerings out there. The savory food overall was decent, but given the price tag, it should have been spectacular.  The tacos were good. The chanterelle was definitely the best. The pork taco was tough and the meat was barely enough for half of the taco.  The prawns were VERY overcooked and tough, thankfully they tasted good.  The appetizers were all decent, but nothing to write home about. The clams were more masa than anything else.  The desserts were what I was most excited about. The avocado and chocolate prefixe dessert were fabulous!!! The corn tacos had great flavor and we got some complimentary mezcal to pair with it (perfect pairing).  But the texture was not the best, I was hoping for a crispier shell and the ice cream was grainy and a little too cold to get the flavor across really well. The strawberry dish was fun, even though kind of gimmicky. The jelly roll had a terrible texture (I hate firm agar/kelcogel gels).  But overall it was entertaining to eat.  Overall, I wish in would have been able to eat when Stupak was doing the tasting menus for like 4 people. I think his ideas are great  and he's beyond talented as a chef, but some things seem to be lost in translation percolating down to tyw rest of the staff."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJOU9iV0NBEAE",
            "text": "Was invited to dinner and was pleasantly surprised as I had not looked up Empellon before arrival. This must have been one of the best meals I've had in a long time. The names of the dishes provoked a sense of intrigue, and when they…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtcjlQNk1BEAE",
            "text": "Went out with friends pretty busy as it was mostly after office people . They say they are influenced by Oxaca cuisine but I definitely had better food in small city of oxaca and the price was 1/4 😀 the salsa platter was good the free chips were delicious was not crazy about mushroom tacos . The sides dishes were good also I am vegetarian and they did Accommodate me .it’s not Texmex so you need to have the taste for it .it’s in expensive side so just keep in mind .the desserts were weird 😀avocado dessert not too crazy about they need better desserts  my thoughts"
        }
    ],
    "reviews_count": 79
}