{
    "name": "THE GRILL",
    "place_id": "ChIJ8UxZqPxYwokRQSC7-Qoeea0",
    "grid": "MN5",
    "address": "Seagram Building, 99 E 52nd St, New York, NY 10022, USA",
    "rating": 4.5,
    "user_ratings_total": 789,
    "phone_number": "(212) 254-3000",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTU5UWkVMVTlMYkY5WlRtcE1NVFJ1TVhBdGRXYxAB",
            "text": "The Grill came through with flavor and finesse. The food had depth rich, seasoned right, and plated with care. You can tell the chefs know balance. The service was solid but could’ve had a little more connection, that extra spark that turns a good night into a great one.\nThe atmosphere made up for it classy, confident, and calm, just how I like it. Overall, a place worth revisiting.\nLouie K’s Up  I rate with respect, but I keep it real. 🔥💯"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OMGQxVTNUbDkyWTBWRE16SndUSGh1VUc5VVdWRRAB",
            "text": "Want to start by saying, the food was amazing and if I was just rating on food alone, I would have given a 5 out of 5.\n\nHowever, the service for $$$$ restaurant should be top notch and the service was atrocious.\n\n1) Our reservation was at 8:00 pm. We did not get seated until 8:20 pm.\n2) It took awhile to get our menus. 2 tables to our left who sat after us received their menus and before us.\n3) we told our captain that we have an onion allergy. The literal first thing the team brought out they mentioned caramelized onions…I felt awful for the team member who brought this dish out, clearly he had no idea there was an onion allergy.\n4) the wine was not at all as described. We still liked it, but not what we were expecting. Our glasses were also empty at multiple times throughout the course and we had to refill our own glasses.\n5) Spilled a fork into our drink then didn’t serve the rest of the dish.\n6) Never checked on us once throughout the meal.\n7) The bathroom was disgusting. There was water all over the floor, dirty and toilet paper all over the ground. I felt like I was in a frat room bathroom.\n\nOverall great food. Service was extremely subpar for a restaurant of this quality and price. Would not go back because of it."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1b0llMDJBRRAB",
            "text": "Great spot, had a fantastic steak and they really outdid themselves with pressing fresh pasta sauce. Definitely solid experience as they brought a number of things close to the table to cook, but the one thing that was a little bit disappointing was getting kicked out of the restaurant because they need the seat and moved over to a different area just for dessert.\n\nBar creates some strong drinks! Dessert tray was just ok."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OaWJtdFVaQzFRZFhsalIzcFpPVXQyWm14MFEzYxAB",
            "text": "The vibe here adds value to your meal. The kitchen makes good meals, the service is fast, and everyone is helpful. The service complemented the chef's imaginative preparation. Employees maintain kindness consistently. Ultimately, the food was fantastic."
        },
        {
            "date": "2주 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxbGRWcHpiR1paTVdKU1dtbFJUbmN4T0daRFMzYxAB",
            "text": "除了用餐位置稍微侷促一點之外，餐點、服務、空間，都非常舒適，特別是服務人員的說明及關心，感覺很特別。"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kcFEyTjRNbTkyYlc0eGVsUjVYM3B2V0VaWGEwRRAB",
            "text": "Absolutely elegant and delish"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdWVXUkJOREptYlZNMlowODFkRk5YVkdGS1EzYxAB",
            "text": "Wonderful place."
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GUFFqazJUVmxNY1dSak5rUjJNakYyTlRGbFZWRRAB",
            "text": "An Exceptional New York Dining Experience\nDining here feels like stepping into the glamour and sophistication of Manhattan in the 1960s — elegant, lively, and effortlessly refined. Every detail, from the service to the ambiance, reflects the kind of timeless hospitality that makes eating out feel truly special.\n\nThe pasta à la presse was exquisite — rich, silky, and bursting with depth of flavor. The crab cake? Absolutely unforgettable — crisp on the outside, melt-in-your-mouth tender inside. And the wine list is nothing short of extraordinary — one of the most impressive and thoughtfully curated selections you’ll find anywhere in the city.\n\nThis is a restaurant that defines what fine dining in New York should be. A must-visit for anyone who loves great food, great wine, and that unmistakable touch of old-school Manhattan magic."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVeWFWOTZkM3BJU1ZadGFXWTBPVGR0TkVJNUxVRRAB",
            "text": "We went here last night for dinner after the show, and absolutely loved it. They have later reservations available, which was perfect for us.\n\nWe had pasta with white truffles (they’re in season now) — so delicious. The oysters were super fresh, the steak was amazing, and for dessert we tried the lemon cake and another one that reminded me of a fancy version of a Snickers bar — both were incredible.\n\nEverything was just perfect — the food, the service, the atmosphere. We’ll definitely be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeE9WYzVZMTh5V0RSVlJHVXhabGhHZUdWaFkxRRAB",
            "text": "We went to the Grill for a special occasion dinner that my boyfriend had kindly planned for my birthday. We knew this place was fancy and were excited to celebrate. I ordered a glass of wine and handed our waiter the menu. He grabbed the menu and told me he didn't think I would like that wine, and he would bring me something he recommended instead. My assumption was he would bring a glass of wine within the same range ($30). We were left with a sour taste in our mouth when the bill came and the wine our waiter ensured I had was $75 for a glass. We  felt taken advantage of and honestly ruined what was supposed to be a special night. Sure, this place is nice. But I would recommend a steakhouse with a bit more integrity that is worth your money."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5bU5VVnFTalprTTFWUFMxTjBaR2RMTlU5WlQyYxAB",
            "text": "The food was spectacular. The pasta and prime rib are very much worth the visit. Service was perfect. The restaurant is a gorgeous place to eat. I had the best time. Must see place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMFFYRmxaV1JFY25CYVMzVXdUbWRHZEVaUFEzYxAB",
            "text": "The duck is amazing. Servers are experts at upselling."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205T2RsUjVOR3RWTTJ0VlVVbFZUbkUwUW1RMU1tYxAB",
            "text": "Perfect for business lunch / dinner.  Pricey but you only live once. If expense account no brainer. If date night or tourist, you can do better. Room is a bit dated and cold given wood paneled walls and high ceilings w strong mid-century mad men vibes. Staff from front door to server team are pros.  Everything Ala carte. Entrees cooked to perfection."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbk4yUlJWVGd0ZWpOR05GVTVVRUZRVTJSeGVrRRAB",
            "text": "Excellent all the way around"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKMWEwWlJhelpFYWxONVluSkRabTFTZEhFdFJtYxAB",
            "text": "The Grill is such a special New York spot!\n\nThe room is gorgeous, with the energy feeling modern and fun. Lighting is beautiful and the layout is spectacular.\n\nService is outstanding. Everyone was friendly, welcoming, and made the night feel seamless.\n\nThe food was even better than expected. The steak was amazing, with the duck and tuna being a must order. The sides are all perfectly paired with whatever you order as a main.\n\nThe whole experience, the atmosphere, the service, the food, makes it one of those places you’ll remember. If you’re looking for a true New York dining experience, The Grill is it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WelRqTkNRazl5ZGxaZlVVbDFaa2RtU1ZGV05XYxAB",
            "text": "Lovely, lovely, lovely."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psM2FUSkNiaTFqVTBVd1YyVkdVRnBHY0ZkZkxVRRAB",
            "text": "I’ve wanted to dine here ever since I saw the Eater food review interview with Carbone & Solares on YouTube back in 2017.  So when I had the opportunity to dine here last month, it lived up to that delicious review experience and did not disappoint.\n\nIf you’re familiar with the video review I mention, then you’ll know that it spotlighted The Grill’s famous prime rib.  So that’s what I got - see pics.  Flavor was off the charts.  Texture was luscious.  The side rib bone seasoned somewhat cajun style sent me up onto cloud 9.  The server’s said not to be shy and eat it finger style like baby back ribs;  it was epic.\n\nSummer vegetables baked with crispy parm on top, and Chappellet cab sauv made for excellent pairings.\n\nService was effortlessly classy and simple.  Server Ben took good care and was super knowledgeable about the overall operations of the restaurant.  Enrique delivered the prime rib via trolley cart and grated horseradish from the root vegetable.  Alexis checked to make sure everything was in order.  The whole team was fantastic, professional, and experienced.\n\nThe night ended with melon sorbet that hit the palate and concluded the meal perfectly.  I highly recommend The Grill for your next special occasion where you’re willing to not think too much on price, but rather on that meal you won’t forget for years to come!  Cheers!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wM1lubEhWRTF6U21sNVMwOHRUVUZuY2t0SlZIYxAB",
            "text": "Just all around great experience. So professional - top notch"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0cmVsWk1PVXh1UWt4TGVYRjRWMlJHYldReWJtYxAB",
            "text": "We celebrated our first family reunion in New York here, and it was absolutely beautiful with such an upscale vibe! The food was fabulous — we ordered salads, crab cakes, vegetables, and two prime ribs (perfect size for four). By default, all prime ribs are cooked to a perfect medium rare, and they even served ours halved — just right for sharing!\n\nWe started with cocktails and ended with wine and dessert cakes, which made the evening even more special. From the moment we entered to the time we left, the service and atmosphere felt like stepping into another world.\n\nPricing is on the higher end — easily $200+ per person — but for the quality and experience, it feels well worth it.\n\nAs for the dress code, it shouldn’t be a problem — just avoid shorts and athletic wear. Clean, upscale casual is perfectly fine, though you’ll also see people dressed very elegantly.\n\nHighly recommend for a memorable dining experience!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201UGIzQTJRWEJsTFc1T05XeEljVlZOUzBwdE5FRRAB",
            "text": "DANGER!!! LADIES!!! BE VERY CAREFUL WITH DRINKS AT THE BAR HERE!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbmExRlNkbnA1Y1VaM1pFWkNTMGgwZVcxS2RuYxAB",
            "text": "Probably the best experience in NYC. Everything was so perfect!!! Food, service, atmosphere!\nPasta, steak tartar and tiramisu are the must to try!!!\nThank you to everyone who made this evening amazing and unforgettable!\nHighly recommended!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tObWFEaEtkazlEUlRWMlJtVmpiVXhFWXpVMmJtYxAB",
            "text": "Dover sole was amazing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCV05WbDFkbU5uYlZscmJWVnJPRmwzY1RaMFVFRRAB",
            "text": "A reliably refined and elegant experience. Excellent service that manages to be unpretentious despite the iconic status of the establishment. We ordered the porterhouse for two and it was an excellent cut. Very potent cocktails and a wide…"
        },
        {
            "date": "2달 전",
            "language": "ar",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVd00xcGlTa2RJZVdKdGVHZHhhbTB4Y0ZOU1oyYxAB",
            "text": "رااااائع"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSGRIWkRkbEJVZUc5WlVWOHdMVUZ5VTJ4bU5GRRAB",
            "text": "Excellent restaurant with tasty food and good decoration"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sNlpXZFRabVZIVVdsTWFGODRNREYxWDNsR2FWRRAB",
            "text": "Beautiful interior and vibe, love the server\nDisappointed they were out of prime rib at Sunday 8:30-9:00 pm\nLOVED THE SIDE TOMATO DISH\nI tried fillet mignon it was bit salty but loved how the peppercorn sauce taste hit me up\n\nWill try again for the prime rib"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSV1pqZEhjbmxFVm5GTlNHTXRNSFY1YW1KRVJsRRAB",
            "text": "Rare that I find a restaurant with no notes, but from top to bottom the grill exceeded all expectations, best place for any special occasion"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUmR6SlVlRkJNTkZWdFR6SXhVRzQyT0ZZNGVFRRAB",
            "text": "Finally got to try the prime rib at the grill! It did not disappoint. Prob right up there with keens and Bowery meat company. The steaks and sides were also great. What you’ll remember is the guy using the manual grinder to press fresh jus for the pasta dish which was amazing. The vibe is pretty finance bro centric as expected for the location. Not much to complain about here it deserves a top 10 spot in your steakhouse playbook but the steak is what I remembered least. Verdict: probably not but worth the try."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwemN6UjNZbE5UWVd0TmNWQjNXbFJTTFc4NE5HYxAB",
            "text": "Very negative experience. Was aggressively upsold on items that we didn’t need or want, and found the food to be very mediocre for the high price tag - eg, $19 (!) for a small portion of fries"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205VWNHTnlSMWgwTTNoUGFYSlVhWEZqUkVOU2JXYxAB",
            "text": "The Grill in Manhattan is not just a steakhouse—it’s a living monument to mid-century glamour, impeccable service, and unapologetic indulgence. Housed within the iconic Seagram Building, designed by Mies van der Rohe, the restaurant embraces its architectural pedigree with grace and grandeur. The moment you step inside, you’re enveloped by a space that feels cinematic: warmly lit, layered in travertine, gleaming sculpted brass, and enveloped in rich textures that echo the elegance of a bygone era without ever feeling dated.\n\nBut the real magic isn’t just in the setting—it’s in the experience. Service here is among the finest in the country. Every movement, every pour, every plate drop feels choreographed yet never robotic. There’s warmth beneath the polish, a genuine hospitality that makes you feel as though you’ve stepped back into an era when dining out was an event, not an errand.\n\nAnd then there’s the food—flawless across the board. From icy-fresh oysters and pitch-perfect cocktails to pastas, sides, and of course, the steak: each dish is bold, beautifully executed, and deeply satisfying. The famed tableside melted Parmesan—served in an extravagant cascade from an entire cheese wheel—is equal parts spectacle and comfort. Call it gimmicky if you like, but you’ll be scooping up every last bit with your fork.\n\nYes, it’s expensive. Extravagantly so. But what you’re paying for isn’t just dinner—it’s a fully immersive experience, one that balances decadence with refinement and leaves a lasting impression. The Grill is, without question, one of the finest steakhouses we’ve had the pleasure of visiting—and one we’ll remember for years to come."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Ga2MzcGtVekJVWDJONFRWbGZOVVY1TTFkeU4xRRAB",
            "text": "As a chef, I love exploring unique flavors and this place is hands down one of my best experiences. As both a chef and a New Yorker, it definitely made my top 10 list! Chef’s recommendation you won’t regret it!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNNE1VdHhTMFo2Y1RsUWR5MUZhRFpxVlMxRFNYYxAB",
            "text": "Everything came out hot, fresh, and on time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0UldFbHZVMlZOZHkxeWExUlVkRzAzYlZsVVEwRRAB",
            "text": "One star because zero isn’t an option\n\nIf this place aspires to any kind of gastronomic reputation, it should start by hiring a manager who’s actually up to the task. The attitude of the current one is simply disgraceful. Cold welcome, barely disguised contempt, snide remarks, and a condescending tone from start to finish. You’d think we were bothering her by choosing to dine there.\n\nNo sense of service, no elegance in demeanor, absolutely no understanding of hospitality. Just arrogance, tension, and a clear message: customers are not welcome.\n\nThis restaurant hides behind a so-called “high-end” image, but beneath the surface: zero warmth, zero professionalism. An arrogant and dismissive manager is enough to ruin the entire experience.\n\nThere are neighborhood cafés far more deserving of your time and money than this pretentious establishment. A true disappointment."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oU2FYWldNSFF5TkVnMlNUaERlVEZsUzJaaGRtYxAB",
            "text": "⭐ 1 star\nThe Grill: Where Glamour Goes to Die\n\nI’ve been coming to The Grill for years. I’ve always admired the space—the architecture, the history, the romance of it all. It was once a jewel of New York dining. What I experienced last night was a total betrayal of that legacy.\n\nI brought a friend visiting from Paris, hoping to share a bit of New York’s classic steakhouse magic. We were 15 minutes late due to a thunderstorm—understandable in any major city. Instead of grace, we were met with smugness. “Your table’s been canceled,” they said—then magically found one a minute later. The attitude? Suffocating.\n\nRight before being seated, we were informed we had 75 minutes to finish dinner. Yes, a literal time limit on vintage champagne and prime rib. Are we at JFK or a steakhouse? The staff didn’t seem to care about providing an enjoyable or gracious experience—it was a ticking clock to flip the table and maximize the bill, all while making you feel like an uninvited guest at your own dinner.\n\nTo make things worse, my guest has a disability—he’s hard of hearing and deaf in one ear. Any time he asked for clarification or for someone to repeat themselves, they looked at him like he was an alien. The staff acted visibly annoyed, as though accommodating someone’s basic needs was somehow beneath them. Is this really how we treat people now? With irritation and contempt for needing to hear clearly in a loud restaurant?\n\nOur other Parisian friend stopped by to say a quick hello and have a martini. We were at a large corner banquette with plenty of room, but were told she couldn’t join us unless we moved to the bar—mid-dinner. So we were shuffled to a cocktail table the size of a Frisbee, surrounded by crowds and chaos.\n\nAnd then came the pièce de résistance: just as our prime rib arrived—our grand, dramatic steakhouse moment—a very large man standing double-parked at the bar literally imposed his entire backside over our tiny table, and ripped a fart directly into our faces. We were crop-dusted with our dinner. We asked them to cancel the mains. They brought them anyway—plus extra food we didn’t order, as if force-feeding us would fix the experience.\n\nThe staff were visibly miserable. The energy was oppressive. The vibe? Like stepping into a haunted version of mid-century glamour where the ghosts have all quit out of frustration.\n\nWe spent over $1,000 on food for two and a martini for one, and left feeling disrespected, stressed, and honestly—scammed.\n\nIf The Grill responds to this review, I fully expect the same cold, robotic, customer-service speak we received all night. A beautiful room doesn’t make up for soulless hospitality.\n\nJFK and Marilyn would be rolling in their well-dressed graves if they saw what this place has become. And as for Sophia? She won’t be jumping in the pool—the water’s toxic."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRE5raEJibVkxVmtka09UUjZialZRWlU5eE5sRRAB",
            "text": "New York is home to countless steakhouses, but The Grill undoubtedly ranks among the very best. Stepping inside feels like entering a bygone era of elegance and glamour—the ambiance is nothing short of spectacular. The bar is equally impressive, offering a creative twist on classic cocktails to suit every palate.\n\nThe wine list is extensive and thoughtfully curated, making it effortless to find the perfect pairing for your meal. While every dish we tried was excellent, the Pasta alla Presse was a standout—rarely seen on menus and flawlessly executed. The Louise Crab Salad was another highlight, fresh and refined.\n\nAs expected, the steaks were superb, but the true showstopper was the Honey Mustard Duckling—a dish that steals the spotlight with both flavor and presentation.\n\nOne of the restaurant’s most remarkable features is its extraordinary collection of Château d’Yquem—the largest in North America. For dessert or a special treat, consider their 5-glass tasting flight, which includes vintages dating back to the previous century.\n\nIn short, The Grill delivers not just a meal, but a memorable experience worthy of New York’s dining elite."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTE5VaEZTR2RPU2swd1EzZGZVbU5SVHpJd1pWRRAB",
            "text": "If you’re looking for an old school, upscale restaurant in Manhattan. Please look no further. The food, environment, and service is unmatched. Be sure to dress somewhat “formally” so you look nice as you enjoy some of the best people watching in the city. You will remember your visit! And ask for Paul, he’s a fun and attentive waiter."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214d1dtTllXRU0yZEVRNFdEUnNjbmRWT0RCT2IzYxAB",
            "text": "The Grill is a very Manhattan upscale power dinner type of place (fun to people watch), and we had a wonderful dining experience.\n\nThe service was exceptional, as expected.\n\nThe cocktail and wine menu is substantial, excellent martinis.\n\nEvery dish we ordered was excellent. Of note, the crab cake starter was pure lump crab meat, pairs well with the complimentary fresh bread and butter.\n\nThe Filet was flavorful and perfectly cooked, the Guinea Hen was different choice for me, I enjoyed it, very tender and flavorful. Next time I want to try the Prime Rib, it looked amazing on the trolley cart.\n\nThe peanut butter chocolate for dessert was also great.\n\nDefinitely an expensive dinner (even by Manhattan standards), but worth a visit, whether for a special occasion or just a nice night out.  If you are unable to snag a reservation, the bar has ample seating, whether for just a drink or a full meal (dinner only)."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aYWNHcDRSbmcwWWsxVWNGUlRWMnByT1RsbE1FRRAB",
            "text": "The Grill was absolutely wonderful. Our family could not stop talking about how divine everything was: the service, the food, the dessert, the experience, all of it could not have been more perfect.\n\nYou HAVE to experience the Pasta A La Presse appetizer. The Prime Rib was prepped tableside and very delicious. The asparagus with hollandaise was out of this world for some reason. HUGE and very tasty.\nIf you think you don't have room for dessert, get it anyway. They have a couple desserts that require tableside preparation with fire which is neat. The lemon cake was so wonderful as well - light and delightful!\n\nAbsolutely no complaints at this place. It was exquisite and we would go again and again if we lived in New York. I wish I could remember our server's name because he was excellent as well - he kind of looked like the actor Héctor Elizondo.\nThank you for the wonderful dinner experience!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VLTFVuZHpmbHN1WlBBEAE",
            "text": "Came here with my dad to get a drink before his work dinner. Why did it smell like sardines? It was baffling. I brought it up to my dad after a few minutes of trying to ignore it and he said it also stank. We eventually became nose blind to the smell but it was super off-putting to walk up into the dining area and smell that.\n\nMy drink was delicious though, and the cottage potatoes I snacked on were also decent. I’m just very confused about this smell."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLYjgyZWFncFBXNWlRRRAB",
            "text": "This is a fancy and upscale place.  Service was excellent. Prime rib was not as flavorful as Smith & Wollensky.  The higher priced menu is for the service.  The place is spacious.  The service was at comfortable pace.  In comparison, Smith & Wollensky was tight and rushed.\nHouse of Prime Rib in San Francisco is still on the top of the list for me for the  flavor of the prime rib."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLZXVtTS1BaGZXc3VnRRAB",
            "text": "The former Four Seasons Restaurant's iconic Grill has been saved from the new owner Aby Rosen's handiwork due to it's landmarked status. It was one of my favorite places for cocktails back in the days I lived in NYC. I never fail to visit when I'm in town. It is a great example of what New York chic looked like. It is worth a visit to enjoy what the best of New York was like.\nSadly the greats like Lutece, Cote Basque and La Grenouille are gone. The grill is the last man standing of the iconic New York watering places."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VObnlwX1N5N2FXZlhREAE",
            "text": "Excellent food and service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPcjQ2N2YxbXRDUGJREAE",
            "text": "Even better than the four seasons which preceded it."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOGFfTXBnRRAB",
            "text": "This is one of my favorite places to go for a nice occasion. Their service is always exceptional, the food is excellent and the ambiance is so so so good. I always have the best time here!! I always take photos in the ladies room - the lighting is perfect for photos"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvX2F2ektBEAE",
            "text": "Take all my money!!!! This was an amazing experience"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvLWNQb3RRRRAB",
            "text": "We absolutely loved our experience at the grill. We enjoyed the crab gumbo as our starter. The prime rib and lobster were both standouts however all the dishes were really good. The banana foster flambe was such a fun dessert to watch at table side and was absolutely divine to end the meal with."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbXJYa1RREAE",
            "text": "Came in to grab a quick bite with my family and heard the so called “manager” talking absolutely terribly about her staff members. I was appalled as a customer to hear some of the heinous things that woman was saying about her high-schooler employees. It was extremely inappropriate and extremely immature. As a manager it is crucial to stay professional and bring drama related issues directly to HR or the employee. I am still baffled I had to listen to that. If the girl is as terrible as the manager says she is why not just fire her? Why keep her around and talk badly? Clearly this manager thrives off drama. My family and I will never come back as long as she works there. I will be sure to let my family and friends know how disgusting this woman was towards her employee. The food was excellent though. So great job cooks!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvX1BmT3hBRRAB",
            "text": "Great appetizers and strong dessert options. The steak, though, was disappointing — chewy, gristly, and lacking proper marbling even at medium rare."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJd3ZMemtnRRAB",
            "text": "Very pricey but the food was worth it some what.  Just bring your wallet."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJa2VhSHZRRRAB",
            "text": "Excellent"
        },
        {
            "date": "9달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmeWV1SXB3RRAB",
            "text": "맛있어요\n좋아는 사람과 함께라면 추억을 만들어줄수있습니다.\n각인을 세워주고 싶은 분과 함께가세요 ㅋㅋ\n백종원 픽 같은곳 가지말고  더 그릴을 가세요"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRZzRXTWx3RRAB",
            "text": "The food, wine, and service were very good - no complaints. Our one big complaint and dissatisfaction has to do with where we were seated. And we are not complainers.\n\nAs architects and designers who love modernism, one of the main reasons for having wanted to go to The Grill for a birthday dinner is to take in and experience dining in this iconic and historically designated dining room for a celebratory occasion.\n\nWe were unluckily seated at a table directly adjacent to and facing the kitchen portal, which, understandably, has a constant traffic of wait staff, bus service, carts, etc etc coming and going in and out, some brushing against our table trying to pass each other by.\n\nMy wife and I were seated directly facing this kitchen portal with the room behind us, so we could not even see to admire the interior space we came to enjoy. Plus the room was exceptionally loud, and having the kitchen right there in front of us did not help.\n\nIn retrospect, shame on us for not immediately insisting to be seated at another table. My strong advice to anyone who dines here is to absolutely not accept any table near or facing the kitchen portal.\n\nWe dropped $1000+ plus tip for some worthy delicious food & wine (including a king crab leg special appetizer plus a 72 year old after-dinner Seagrams 7 Crown whiskey!) but the overall experience left a bad taste in our mouths and it was not worth it."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRb3I3Und3RRAB",
            "text": "I had a wonderful experience at THE GRILL to celebrate my girlfriend's birthday and our anniversary. We ordered the gumbo, house salad, and prime rib. Despite gumbo being a very strong and hearty soup, I was pleasantly surprised to be able to taste the crab through all of that. The salad was refreshing I appreciated the variety of vegetables and other produce. The light flavor contrasted well with the hearty gumbo flavor. The prime rib, however was the star of the show. It was brought to our table via trolley and sliced next to our table. The meat was well seasoned, tender, and fell apart in my mouth. There was a strong crust seasoned well, and we got some meat on the bone as well. We were also provided complimentary bread service, which included a pretzel stick, sourdough-like bread, and a classic dinner roll. All the food was delicious and was further elevated by the service. We were served by maybe 3 staff during our visit, with Anne being our main server. They made sure we felt welcome during our stay without feeling overbearing. Whenever we looked at other tables and wondered what they were being served, she was quick to point out what the menu item was and how it was being prepared. Thank you to THE GRILL for a wonderful experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5eGJhUU5nEAE",
            "text": "Beautiful atmosphere. The food, I would say mediocre at best. The drinks are decent. Where the 4 seasons used to be, the vibe is very retro 70s chic. The women’s room looks like a dressing green room, quite elaborate and fancy. I think you definitely come for the atmosphere. The food was very underwhelming. We had 2 of the strip steaks to share and the ribeye, prime rib, the duck, the oysters, the pasta and the baked Alaska / hazelnut cake. Nothing really blew me away and the price tag was extremely hefty. Once again, Major food group seeks to drum up some hype and underwhelm. If you’re seeking to impress with the price tag, this would be the place. The meal itself doesn’t live up to expectations, however."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmeHBQWV9nRRAB",
            "text": "As good as a steakhouse gets. Tartare and crab cake were excellent. Pasta ala press was as good as a dish gets. Steaks were cooked perfectly and sides were great as well. We were too stuffed for desserts. Cocktails were proper. Yes, it’s expensive. But worth it. The night was exactly what we hoped it would be."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIcFBYRmhBRRAB",
            "text": "The interior is incredible. The food and the atmosphere are amazing as well. We ordered oysters, clams, chopped salad and filet Mignon, also champagne cocktails and Manhattan with rye. Honestly I am so happy with our experience. The staff was very mindful, very demure  :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyeDVlOXZBRRAB",
            "text": "The Grill and Pool room is the former sight of the legendary Four Seasons restaurant. While that establishment is long gone, the feel of that place, which has now been split into two restaurants, is the exact same in this new establishment. We had lunch at the bar this time today, and the overall experience, while expensive, was excellent as usual. The Grill room is one of the most impressive Midtown lunch spots in NYC."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIaGRxdzBRRRAB",
            "text": "What an awesome restaurant!!  The actual restaurant architecture was excellent. Then the food was super great. I had a prime rib and scallop.  Then flambé peach for dessert. Can’t recommend it highly enough."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4aXFDUlF3EAE",
            "text": "Wow ! No other words can describe our dining experience. We enjoyed a stunning Friday lunch at the Grill. Julian Black and his well trained team delivered a superb experience. The service is seamless, the food is epic and overall feeling is one of joy. A must do if you’re ever visiting NYC. Thank you to the Grill team for looking after us. We’ll be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEOWZMQ3JRRRAB",
            "text": "Non-alcoholic cocktail and the lemon chiffon cake was note worthy. Soup had too much sodium and steak tartare was just average. Don’t know if anyone really goes here for the food. Won’t be disappointed by the service or celeb spotting though."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKMUlESVpBEAE",
            "text": "I went for dinner to The Grill before a concert. We really wanted to try it, so we squeezed it in. Great experience! Excellent ambiance, very luxurious, clean, and inviting. Service was top notch. The steak was delicious! I had the ribeye and my husband the new york strip, and they were both excellently done. The mashed potatoes were surpisingly good and flavorful, the steak sauce, the roasted garlic....delish. It was a perfect date night!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0aElyX3ZRRRAB",
            "text": "Definitely on the fancy-end of dining, lots of people in suits.  The steak tartar was perfect with the anchovies, and my burger was exactly how I asked for it.  The real surprise was the crab gumbo, which was delightfully spicy.  I'm not really into the atmosphere personally,  but I have no complaints about the food."
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNudWIyNzZnRRAB",
            "text": "Top Restaurant. Super Service, super essen, sensationelles  Ambiente. Auf der Karte stehen überwiegend Klassiker der amerikanischen Küche. Drinks an der Bar sind top. Perfekter Ort für ein Lunch oder einen rasanten Abend! We love it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiM296MjJBRRAB",
            "text": "Delayed review for our Thanksgiving dinner at The Grill. We were seating in the private dining room but the main dining space was popping and was very fun and lively. Dinner was decadent and delicious with an exceptional black truffle pasta course. Would love to come back here for a non holiday dinner!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXa1pHaU9nEAE",
            "text": "We went to celebrate our Anniversary\nAnd loved it . The girls hostess were so pleasant , gave us nice table even we came late. Service exceptional\nFood was fresh and delicious\nDrinks were perfect\nDef would recommend for any occasion or some special ones.\nFood, service ambiance 10 out of 10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWMk4zZEd3EAE",
            "text": "My wife and I had a single night in Manhattan recently.  As we were staying on 5th Avenue, we decided to make reservations at The Grill as it was an easy walk.\n\nUpon entering, we found the staff welcoming and gracious.  We were shown to our table in an expeditious manner.  We asked to see the Sommelier as we wished to get our wine (2017 Margaux) breathing. Willie came to the table and was very helpful in getting the process started.  He also recommended superb cocktails.\n\nJohn our dining Captain came and introduced himself.  John is a pro. Terrific!  My wife began with the Champagne cocktail.  Delicious.  I wanted an old fashioned and was talked into the version with The Grill’s signature bourbon.  Oh my, was it good.\n\nWe started with the Avacado Crab Louis prepared at our table.  Off the charts delicious.  So fresh and plentiful.  We then moved into the next course, Pasta a la Presse, again prepared table side.  This was the highlight of the evening’s menu.  Everything was amazing but this was sinfully delicious.  With our ribeye for two we had the mushrooms and steamed spinach.  The steak was very good.  Not the best that we have had but superb nonetheless. The bread service was equally amazing.  My wife is a skilled baker but had to admit that the dinner rolls were better than hers.   We finished with the baked Alaska table side…a must.\n\nThe service was exceptional.  We were ‘touched’ by no fewer than 6 associates.  We never felt rushed and we took our time and paced ourselves.  We plan to head back to Manhattan next Christmastime, we will definitely eat at The Grill again.\n\nWell done!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCNHJET3FRRRAB",
            "text": "I recently had the pleasure of dining here and I must say, the food was great! From the appetizers to the main course and dessert, everything was cooked to perfection and tasted amazing.\n\nThe service was also top-notch. Our server was friendly, knowledgeable, and attentive to our needs.\n\nThe ambiance of the restaurant was nice and welcoming. The decor was stylish and the music added to the overall atmosphere.\n\nOverall, I had a fantastic experience at this restaurant and would highly recommend it to anyone looking for delicious food and excellent service. The food was great and I can't wait to go back and try more items on the menu."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNleThYVmZBEAE",
            "text": "First time visiting The Grill and the experience was exquisite from beginning to end. Absolutely delicious. Our server, I believe his name is Matthew was lovely. So rich and knowledgeable about food and spirits, it was inspirational. Our…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYNW9XM3RRRRAB",
            "text": "Where do I start...incredible architecture in a legendary building by modernist hero Mies Van Der Rohe, I never witnessed so many waiters taking care of you with such professionalism. The bread basket is flawless which is always a good sign. The oysters and meat (the Porterhouse) absolutely perfect. The truffle pasta, the sole, the wine...This will stay in my top 10 experiences ever."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0cTc2cHh3RRAB",
            "text": "The Grill somehow manages to thread the needle of “fancy,” “theatrical,” and still “relaxed.” The ambience is refined, the service is exceptional, and, despite being served by people in tuxedos and seeing your food being presented in a trolley with a silver dome, you still feel relaxed and able to enjoy the meal. And the food is delicious.\n\nWe shared: tuna ravigote (refreshing, light), pasta a la presse (the definition of “theatrical,” and also very rich in flavor), honey mustard duckling (crispy skin, tender meat, mustard sauce with a delightful kick to it), and the prime rib (amazing texture and flavor). For dessert, I recommend the lemon chiffon and the cruller.\n\nDrinks are strong.\n\nHighly recommend for a special dinner; it’s an experience you won’t forget."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROaUx6Ujl3RRAB",
            "text": "I’ll keep it simple and rate the food items out of ten. Pumpkin soup 7/10 very rich and delish but 30$ is a bit steep. Pasta ala presse 10/10 absolutely divine, white truffle over egg omelet 1/10 worst thing we got there easy skip for 165$. Guinea hen 9/10 not a fan of foie gras but the rest was excellent. Prime rib 7/10 it was just ok nothing too special for my taste. Lamb solid 8/10 the jelly they had complementing the dish was surprisingly delicious. The experience as a whole was excellent the only blemish being the truffle dish that my server pushed pretty hard."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURka2JteklBEAE",
            "text": "Cliff notes: A must visit.\n\nTHE GRILL is another Major Food Group fine dining establishment with a monument to the glory of mid-century luxe continental dining. Sitting within the historic Seagram Building, THE GRILL has in it more than just a restaurant—it bids one through a time machine to an age when elegance and sophistication reigned supreme.\n\nAs you walk in, the dining room begins to gleam with its golden opulence—an ode to timeless design, distinguished by the New York City Landmarks Preservation Commission. Since it was first opened 60 years ago, THE GRILL has celebrated outstanding cuisine, an incomparable landmark of beauty and heritage recognized for its splendid interiors.\n\nBut The Grill is not all about the beautiful sceneries. This place defies description. Food becomes the message, and service perfection takes any form known. From the minute you alight from the car to the moment you step out of the restaurant, you are wrapped in an experience that seeks to satisfy all of your senses.\n\nThe classic midcentury steakhouse vibe is special and best of the best in New York Ciry. But in the tradition-of-a-culinary-revival kind of way. The menu reads nothing short of a love letter to American fare: It's adorned with a most extensive selection of dry-aged steaks from the finest purveyors who are celebrated for the taste and quality of their meats. When customers wish to have a complete real-time interaction culinary experience, THE GRILL is always at the forefront, presenting all live table-side preparations as a display of culinary magic, directly placing customers in front of their eyes so they can take a first look for themselves at this wonder that unfolds in the kitchen.\n\nThat all adds up to an experience that is nothing less than memorable—be it the grand setting, the exquisite food, or the impeccable service in THE GRILL. And for all those who visit New York City with a wish for something classic and full of finesse when it comes to steakhouse, THE GRILL awaits you.\n\nThank me later ;)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtd091Unl3RRAB",
            "text": "What a wonderful experience! I love the interior of the restaurant, it’s very open. The food was amazing! I enjoy a good Dover Sole but this one blew me away! If you like Crab then I suggest getting the Dover Sole with Neptune’s Crown. So delicious! The Seagram Crab Cake was fantastic too. Highly recommend this place!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScTdfTzNRRRAB",
            "text": "Modern NYC steakhouse. Very nice busy ambience and service is excellent. All the food served are very high quality and tasty. Expecially the pasta ala presse..using the concept of the french pressed duck, where as using a special machine and compressed the bones of game and duck and veg and squeeze out the juices from the bone. Then uses these bone juice essence to make a sauce to make the pasta....a good show and delicious.\nPrime rib is also very good but I think overpriced. The jus is a bit weak and diluted and can be improved.\nAll in all this place is good and I recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaenZuVDhRRRAB",
            "text": "Still as iconic as ever, even with the change in name. And perhaps ironically, while it’s a steak house, it was the crab cake and the pasta a la presse that were the stars of the night. All the natural sweetness of the crab with the texture brought forth by the thinly slice potatoes and all without the heavy touch you would usually find in most crab cakes - this is perfection in a dish. And the pasta - it’s a showpiece dish to see the carcass reduced to a bowl of jul right in front of you.. a tad schadenfreude if I may say, then toss in the pasta that brings about an explosion of flavors.\n\nThere is the steak of course and there’s nothing wrong with it of course - the NY strip is a joy, perfectly medium rare, perfectly seasoned but it just meets the (high) bar one would expect.\n\nService is of course impeccable with David a wonderful somm to make sure we have the right wine to go with the night."
        }
    ],
    "reviews_count": 75
}