{
    "name": "O'Donoghue’s Times Square",
    "place_id": "ChIJWVh7F1VYwokRG50ZNb_73zk",
    "grid": "MN5",
    "address": "156 W 44th St, New York, NY 10036, USA",
    "rating": 4.4,
    "user_ratings_total": 2554,
    "phone_number": "(212) 997-2262",
    "reviews": [
        {
            "date": "18시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SSVUwSlJNbVZKTmprek1VbDFMVXhqTjFac2JsRRAB",
            "text": "Do you want more 5-star Google reviews? Best of all, they’re free! We can provide as many as you need to help your business reach the top of Google Maps. Contact us on Telegram: @gthisjpeg"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WSGNGSmlVVWhzV0RWbE1qTmhPWHBJUzJkWlQwRRAB",
            "text": "Great location and ambience. Superb service and good menu."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5SFVFSjNaalJ0ZW1oc1dITXdiRUZKWDBKRFJFRRAB",
            "text": "Great place for a quick drink"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNNFJFWTFkMjVHVTE4eGVrZGpiekl5YzJJMllXYxAB",
            "text": "A pesar de que la recepcionista de tarde nos dijo que no hacía falta reservar, cuando llegamos había bastante gente, pero aún y así, nos consiguió una mesa.\nLa cerveza estupenda, y no demasiado cara  ( $7 ), la comida estupenda y en su justa medida, y el servicio, muy amable. Lo teníamos enfrente del hotel y es una lástima que fuéramos el último día, porque hubiéramos repetido."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSVdVeDJhbEZGTkZSM1Z6QTFhMUJqV1VGMGJuYxAB",
            "text": "Lovely Irish pub, felt very at home there and staff were very friendly. Didn’t have any food but it looked and smelled great and will try to pop back to sample something off the menu"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOU1RXSlhaa0ZLVERkMFJqUjVPVXRPUW5CNGMxRRAB",
            "text": "Very rude and uncousy staff. The food is average, the avocado in my salad was partially black."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kc1EwRnJTRWhXWlVWQ2QwZ3pVREZhUjFGbVYzYxAB",
            "text": "Excellent cute place great service very reasonable being in times square area! A must stop"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twU1RFUnFWbFoxWWxOSmNuZENiV2RuUVZNeU1GRRAB",
            "text": "The bald bartender was very rude. He did not acknowledge us for over 15 minutes. Once he came to my friends and I he did not want to help us and was very rude. He said if my friend could not pronounce a drink properly he could not serve us. We had a very long day at work- all we wanted was a drink. We were. Very dissatisfied"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25scmVsaHFRVFJ3ZWpoVWNGcFFZbnBUYUhkZlowRRAB",
            "text": "Good ambience, good cocktails. Open until late in the night right there at Times Square!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4M1owRjRiRTl2UWxVemQwTnZXa0ZIVUcxRlpWRRAB",
            "text": "Lovely Irish pub, great staff and great food. Highly recommend the bankers and bash"
        },
        {
            "date": "2주 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paT2RFcFZWbmN6ZDBoZlVXVk1ha2hXV0dneFQzYxAB",
            "text": "Franchement ? On est tombés là un peu par hasard… et on a grave bien fait.\n\nO’Donoghue’s, c’est le bon vieux pub irlandais comme on les aime : bois sombre, serveurs cool, bières qui coulent à flots et ambiance ultra chill au milieu de l’agitation de Times Square. T’as l’impression de faire une pause dans un autre monde, version Dublin à New York.\n\nLa Guinness est parfaite, crémeuse comme il faut. Et je te parle même pas du burger : j’ai failli demander la nationalité irlandaise après la première bouchée.\n\nCôté ambiance, c’est cosy mais vivant. Tu peux papoter, trinquer, rire fort (voire très fort), personne ne va te regarder de travers. Et même les serveurs sont drôles et détendus, tu sens qu’ils aiment bosser là.\n\nOui, c’est Times Square, donc c’est pas les prix d’un PMU de campagne, mais franchement ça les vaut. On a bien mangé, bien bu, bien rigolé. Que demander de plus ?"
        },
        {
            "date": "3주 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5a2IxQmxXWGh2VFZoaVYzaFZTRzl6YldWSlRWRRAB",
            "text": "Perfetto per passare una serata in stile newyorkese"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OTWFYUk5WMk5hTVMxM0xXZHpjbEZhYzFOQmNIYxAB",
            "text": "very loud, not conducive to any level of conversation."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWbE5Xb3hVVFJCU25KWmExWndXa042VWpsTFJVRRAB",
            "text": "In a sea of restaurants in the middle of NYC, choose this one. We came in out of the chilly rain and were seated immediately. Our kids ate their best meal of our trip. The beef stew and fish and chips were great. Guinnesses as good as you can get this side is the Atlantic. But most importantly the service was wonderful. I believe our server was Benny. I forgot my purse there, and he tried to chase us down once he found it. I was able to come back the next morning before they opened to get it. Really really thankful he was so kind, hospitable and accommodating.\nAnd the music was great. We’ll be back whenever we’re in town."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201b1dqZFRkbUpFV1VadU5VNUZSR1ZHTlRKNE5rRRAB",
            "text": "Generous and tasty food, quick service, good whiskey and handy location when you’re waiting for your show to open the doors"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0aFQycGFTVE0xYWpOcU4wVjROMmxUYUdWTWRFRRAB",
            "text": "Good atmosphere! I love it."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SWE1VNVNXVlJ2YzFkMFQxaE1PRVJ4WWt4TFNIYxAB",
            "text": "Absolutely love O'Donoghue, as a party of 6 , they were very accommodating, amazing drinks and quickly ordered. Food was lush and they had a large selection to choose from so everyone was happy as well as the children's menu. Definitely recommend \"Sally's Irish ice cream sundae\" (21+) if youre looking for a boozy sweet treat. Made multiple trips here during our stay as we loved it."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1UFFUVnFXSEZGTWpaT1ZIZFdhbXhJU1hBeFlVRRAB",
            "text": "Went for lunch, not crazy busy.  Got seated right away.  Lovely waitress, great service\nOrdered Shepard pie, great and plenty of food.  Wife got a turkey sandwich.   No complaints, great Irish pub decor.  Enjoyed our lunch"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWmJWSk1jamR3VGpOeVZtNURZMFYxVG05WWJIYxAB",
            "text": "Great bar in centre of New York."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toblVFOU1NbVpHV2paV1FVaFpkbUZ2ZDFkWlRVRRAB",
            "text": "The bartender Seamus was very friendly and attentive and the Flirtini is very delicious. I’ll definitely be coming back again."
        },
        {
            "date": "1달 전",
            "language": "ko",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxQlIzaDNiM2RLYVhKdWVYWktlazk1Tm1sSlYxRRAB",
            "text": "맥주가 맛있지만 사람이 아주아주아주 많음 그래도 직원은 친절하고 나이스"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KU1dXbG1SRGRhY1ZwcGRXYzRla2hLZFVFM2FsRRAB",
            "text": "O’Donoghue’s Times Square is a lively Irish pub nestled in the heart of New York City’s Theater District. With its warm ambiance and friendly staff, it offers a welcoming spot for both locals and visitors.\n\nFood & Drink:\nThe menu features a variety of traditional Irish and American dishes. Patrons often recommend the Shepherd’s Pie and Fish and Chips for their hearty portions and authentic flavors. The bar boasts 24 beers on tap, including a selection of Irish brews, ensuring a refreshing choice for every guest. That said, food and drinks are a little pricey compared to other spots in the area.\n\nService:\nService is generally attentive, with many guests praising the staff’s friendliness and efficiency. However, during peak hours, some have noted slight delays, which is common in bustling city centers.\n\nAtmosphere:\nThe pub exudes an authentic Irish charm, featuring cozy interiors and a vibrant atmosphere. It’s an ideal spot to unwind after a day of sightseeing or before catching a Broadway show.\n\nOverall:\nO’Donoghue’s Times Square offers a delightful blend of good food, refreshing drinks, and a welcoming atmosphere. Just be prepared for slightly higher prices. Still worth a visit whether you’re in the city for a short stay or a local looking for a casual dining spot."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkMlVFUlpTamh5ZUY5RFpXRTFkVmgzU1ZVM1NYYxAB",
            "text": "This restaurant proves that quality matters most. The servings are generous and the prices reasonable. Every service interaction met our needs. Your first visit won't be your last. O'Donoghue’s Times Square will see our continued patronage."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWFZrSlpPVmRQV0hVNE9EaHFNR3Q1Y3pWQk5rRRAB",
            "text": "The fish and chips, and the shepherds pie, are delicious. Upgraded from 4 to 5 stars after a couple more visits and comparing prices / quality to other spots in the city. Atmosphere is better further back in the restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkeVRGVm5NVjlNYTA5SFZYaE1MVWhFVmt4c09WRRAB",
            "text": "I went to O Donoghue’s just the once it was very busy lively and had a good atmosphere possibly due to this the service was slow and my beer was unsatisfactory I had two beers hoping the second would improve it didn’t the prices are semi reasonable for the area around here\nI would not return though"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoTVlWWm1ZalpzVVVWV1kzbzFObHBDYzNGSWNIYxAB",
            "text": "Brilliant food and drink and staff"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOallXaEVlRGRaZFhVNFFUZ3plSFJ4T0ZkZlVrRRAB",
            "text": "Always a great pub to go into,,whether it's thirsty or hungry  you are  You will get a ,very warm welcome from all the staff there..Helen is nearly always there with her warm Mayo welcome  She will always have the menus ready  I hope she's still ,because it was May 2024 and she told us that her partner had Parkinsons and  that she was finding it difficult to combine both. So Helen we are thinking about you  . Keep up the good work over there"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkS2FEQlJZMmxUYVhsd00wNTVXV0p4ZUdkMGVWRRAB",
            "text": "Terrible service. Made us feel unwelcome."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OUlVVdElUbTl5U2pobVpVRTVTWE5zU20xNFluYxAB",
            "text": "Best English music in New York. And Irish cider!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkclNsWXdNVFZtVW05RVIyWXpZa1ZtVG14bWVIYxAB",
            "text": "It was exactly as expected from Irish pub. Pretty fast service"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xR2NuVkVMV3BNUVdORE4zTlRSR000TkRCWmVuYxAB",
            "text": "Excelente!! Muy buena onda. Desde Argentina"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SGIwaHdMVEZvUzJSRWVVcHhjVGhvTTNkbFVrRRAB",
            "text": "Awesome place!!!!!"
        },
        {
            "date": "2달 전",
            "language": "cs",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RGVWcHZVRGhSTUdoV1NXMWtjamszZFhFMWJtYxAB",
            "text": "Příjemná Irska hospoda"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVVEwZHdjV3hXU2pGbE5rOVViek5EUTBoM1ZHYxAB",
            "text": "Popped in for something to eat, glad we did, the steak with mash & veg was delicious, lovely friendly staff too."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsS05EWm5UemN3ZWtKS2FrVkdWMmMyYkVkWlltYxAB",
            "text": "My friends and I came here last year on our first trip to New York and we all absolutely loved our waitress. The food and drinks were absolutely delicious.  So much love to you all from Idaho, Arizona and Oklahoma.  We will be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OYWNUSXdSWEZIUVRkb1FXbzJWV1J0WXpjNGQzYxAB",
            "text": "The food was great. Service great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSeE9XcERPR1J5VG10NlVFUmhhMGx1TVVGd2RFRRAB",
            "text": "Visited 2 days in a row. First visit included food, both days involved beer. The service was great and felt authentic with so much of the staff from Ireland."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20welNFaFhWMlJoVWpKSGRFNUtaVXgwT1ZsblRGRRAB",
            "text": "Wherever you go around the world you'll find an Irish pub."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkbGNqTmFiSGgzV0RCbWVUTkVVM1pSUTNCU1dYYxAB",
            "text": "Good place to come drink with friends"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nd1F6Qm1SRVJPVmtWcFowOHRVV2g2ZVcxR05uYxAB",
            "text": "I ordered the shrimp wrap with amazing french fries but unfortunately they only gave you four shrimp that were butterflied and we're overcooked... The atmosphere is fun and lively with Live music.\nThe fish and chips are a must have."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxa00xcFNNbHAzVDFCYVdtbHFXRVZyZFU1MlFsRRAB",
            "text": "great atmosphere, great foodwe showed up requesting a table for 9:00 and they got it ready for us within minutesI would definitely recommend them for a great meal near Times Square"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMlNTMVFZVmhSZGt0bmVrMHlaMlpKVEZKUWQyYxAB",
            "text": "I ordered a vodka soda with extra lemon juice. The bartender didn't warn me and just brought me a vodka on the rocks with a single slice of lemon. There wasn't even any soda in it. They can't make the world's simplest cocktail. Enjoy your beers, if that's what you like."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSbmJtZzRiVFJsV0hwZk1qSlFhbTFUVDFaek0xRRAB",
            "text": "We've had a great time, every evening we were over there to call it a day. Great staff, friendly !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZeFNVTm1RVEIxVVUxR1dGOVJNa1ZQVVMxbVYxRRAB",
            "text": "Five star Irish experience in the heart of Manhattan!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkSVVIUnBWVnBQUVhwQmJFRmZjME5XWm1aR2FsRRAB",
            "text": "Great staff!! BUT! An Irish pub that does not serve Guinness in a proper Guinness glass… disappointing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxNE4yNTVSa2REVVUxV1kxWkhibnBNVVdKSmIxRRAB",
            "text": "Way better than I expected. Price wasn’t too shabby for close to Times Square. Bangers and mashers damn good. Too much to finish. GREAT burgers. Fish and chips incredible. Solid Guinness stew. Great service. Super friendly."
        },
        {
            "date": "3달 전",
            "language": "ar",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUmFtOTROMHhwZW1KdGNtaG1NbTB0U0hjM1ZGRRAB",
            "text": "5star"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTGEyWkRiaTFGTUdvdFExVlhiRVJPWm5sc2JsRRAB",
            "text": "I had the lobster 🦞 ravioli and it was superb. It was loud in there and also dark but I wasn't in there for anything other than food. Staff were polite, the food came out in good time and the pricing is very reasonable given the location."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWc0xXWjRWbkZTYWpaNVIwazBRa1ZLYW5GV1RVRRAB",
            "text": "really great prices! extremely clean bathrooms for a bar let alone one near times square!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aelZIbDROMlEzTmxBMGVXbGZPRUZJUlhCYVozYxAB",
            "text": "Food was great! Service was not so great. After being seated we didn’t get waited on for nearly 20 minutes."
        },
        {
            "date": "4달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2treVZXRlFaemw1VUhaTFlVWlRNazQwWWxaS1kyYxAB",
            "text": "흥겨운 라이브공연이 있는 멋진 펍입니다. 맥주도 맛있어요."
        },
        {
            "date": "9달 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBemJlWG93RRAB",
            "text": "홍합스튜 없는데..? 망고퓨전 맛있었습니다. 오징어 튀김에  같이 나오는 할라페뇨 튀김이 특징(맛있음)."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNGJYUDZRRRAB",
            "text": "홍합스튜 미쳤음 개맛있어요"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcVk3Vm5nRRAB",
            "text": "I love Irish Bar and Pubs for their welcoming and happy vibe. So when I was disappointed by Gravy’s Irish Pub and went hunting for another one and to my surprise discovered O’Donoghue’s and instantly loved it. The service is spot on with interactive and polite servicer’s. They were happy to help and gave good suggestions. Angel was very helpful is offering me choices to as to what to eat as I’m a new vegetarian. Even Jonathan was great to talk to, he seated me on the  best table possible. Everything is was a good experience for sure. Clean and neat washrooms. Would surely revisit. Cheers."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFdFFVZFpkMDVGWWxOeFZWUmFNRkZsVnpBM01rRRAB",
            "text": "Incredible staff… Leonie, Benny & We Conor…absolutely wonderful… great authentic Irish ☘️ service.. if you’re near Times Square it’s definitely worth stopping 👍 Sláinte 🇮🇪"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdGZ2d21RRRAB",
            "text": "The beer was good. I'm a pale ale kinda gal and enjoyed one of their specials. The flatbreads were fantastic! I tried both. Enjoyed the non-vegetarian option better. Only minus- our server disappeared forever and was not the best. I'd come here definitely with different server. Prices reasonable and open late."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuN2FxamF3EAE",
            "text": "We were exhausted after a busy day of touring & shopping in Times Square, not to mention famished after wasting an hour trying to find a place to eat. After experiencing massive disappointment at 2 major American chains, we were so grateful to have stumbled across O’Donoghue’s, and with some time left to enjoy happy hour! I can not say enough good things about this place. The pub is beautifully designed and meticulously clean. The entire staff was so cheerful, attentive, and helpful – even during a super-busy dinner rush. We enjoyed some fabulous drinks and entrees. I have to mention that the salmon on my Caesar salad was cooked perfectly – which is a rare find – so huge kudos to the chef. We would absolutely love to visit again on our next trip. Thanks so much to everyone for such an enjoyable evening!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZc2VTRVRREAE",
            "text": "The shepherds pie was better than the black forest cake.  Would be interesting to hear the Irish music they host. Seems like a good place for a drink."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kek9FZExOMGxFTVdkaFRuSnpVak54VGxoamJHYxAB",
            "text": "The best place to eat a high quality and delicious food at a fair price close to Times Square, don’t look for any other places."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydnAzSnRRRRAB",
            "text": "Great pub off Time Square, which truly reminded me of our visits to the pubs in Ireland. The front desk seated us promptly with our reservations, and our server came by right away.  Typical pub food, but with a nice variety, which we had Crab Mushrooms, Salad with grilled chicken, and Fish and Chips.  The crab mushrooms were excellent with lots of real crab, and the Fish and Chips were very well made with crisp texture and very little oil. And of course, Guinness on tap…\n\nOverall a great getaway to a friendly pub away from the crowds of Time Square.\n\nTips for your visit: Make a reservation to ensure you have a table"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLbmVrdm1BMzRhR3J3RRAB",
            "text": "Voy a ser completamente honesto: No me acuerdo que bebimos ni que comimos acá -quiza solo bebimos.\n\nSe que tuvimos una gran experiencia, habia gente tocando (no se qué, jazz? creo que no).\nCobraban entrada pero lo que gastabas en la entrada te lo daban en bebidas (tampoco estoy seguro de esto)\n(deberian sacarme la licencia de Google) (no existe)\n\nLa foto es para destacar la belleza de sus aguas, el esplendor con el que te ofrecen un refresco y acá me pongo cipayo. En Argentina ni siquiera te ofrecen agua en los restaurants y acá te lo dan en esa jarra hermosa de Bud Light que no me la llevé solo por amabilidad."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMVA2MWRnEAE",
            "text": "We stopped here for drinks prior to going to see a musical. O'Donohue's in Manhattan is an absolute gem! From the moment you step through the doors, you're embraced by the warm and welcoming ambiance of a true Irish pub. The staff are not only attentive but also incredibly friendly, making you feel like part of the family.  Excellent dirty martinis!\n\nThe atmosphere is lively yet cozy, making it the perfect spot for catching up with friends or unwinding after a long day. I can't recommend O'Donohue's enough—it's the kind of place you'll find yourself wanting to visit again and again!\""
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQbHBmYlZnEAE",
            "text": "O Donohue's is a great bar that serves the best beef stew I have ever tasted. The smell of great food and a warm Irish welcome on a cold, frosty evening is a welcome you just can't resist. This lovely establishment is an absolute must to visit & try the food & wines here."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQbjdIMnBnRRAB",
            "text": "Great atmosphere, staff that actually remembered us on a second visit and bar tenders you will end up having great conversations with!\n\nGreat selection of drinks and food too."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0R01sQjVUa2xGWDBnMWFGUm5OREZCWDFZNE1uYxAB",
            "text": "Well priced and huge portions, and rte on the screen.  I was impressed by the attentive staff.  No one walked by us without checking if we needed anything.  And it tasted great.  If you dont like Guinness they have Harp."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKckc0UF9xNF92QjdnRRAB",
            "text": "Great atmosphere. Great Guinness. Really friendly, attentive bartender. Spent some time at the bar watching Spurs win a rare trophy! Definitely worth a visit (didn’t have food but it looked good)"
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNU8yV0h3EAE",
            "text": "Nous avons dîné dans ce restaurant.\nLe personnel est très sympa . Les quantités copieuses (salades également).\nBon choix de bières également."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxaVlsQm9aRm90UldaVGRrWXlTRU5WVlhwM2FFRRAB",
            "text": "Very good food, friendly service, and a great location. Loud, as most bars are, but you can still hear the people you’re with. We’ve been twice due to the location and will probably return.\n\nNot a fan of the new trend of charging for every iced tea glass, but at least you get a full glass here."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfOHNQcWlBRRAB",
            "text": "Amazing atmosphere.  Great service.  Yummy food and good portions.  We even enjoyed the music!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMWJEQjJSbXhWVTA1SE9XRm5jeTFmT0ZOSmFFRRAB",
            "text": "Great pub in Manhattan. Food was delicious, drinks hit the spot. Our family really enjoyed our evening. Unfortunately had to leave as the live music was starting but it sounded great too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxMGVfdnFRRRAB",
            "text": "Visiting O'Donoghue's Irish Bar was a delightful experience. The bartender stood out with his exceptional kindness and humor, creating a welcoming and jovial atmosphere. Service was notably efficient and friendly, ensuring a pleasant visit. The fried calamari I ordered was a culinary delight, perfectly cooked with a delightful flavor profile. Accompanied by a glass of wine, it made for a satisfying meal. The pricing was reasonable, offering good value for the quality of food and drink provided. Overall, O'Donoghue's is a commendable choice for anyone seeking great food, excellent service, and a warm, inviting ambiance."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtajltcnZBRRAB",
            "text": "I got the crab cakes and they were delicious! Definitely a smaller portion than I expected, but the taste and mango salsa that came with it made up in quality. My friend got the fish and chips, which was a generous serving size. It was very busy and crowded, but had a cool atmosphere that I would expect in an actual Irish pub."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdHVqbWV3EAE",
            "text": "Great place for a few drinks and something to eat. Live music on weekends and a great service. Food comes faster than a fast food joint!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1bnVUVGJBEAE",
            "text": "O’Donoghue’s is a well-established Irish Pub that has a welcoming sports theme and a causal lounge-like vibe. I loved the customer service waitress, who patiently explained the orders my sibling and I wanted, and delivered them in style. I especially loved the BBQ Wings and the Angry Orchard Hard Cider, both bursting with Irish signature flavor. I would go back and eat a heartier meal just to casually watch the sports I used to see with my dad growing up. Politeness and gratitude are key to a smooth service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeUlTek53EAE",
            "text": "Perfect location, great bar with a lot of drink options. Food options were pretty fun looking but we concentrated on drinking lol. Lots of tvs to watch whatever game on with a lot of bar seating and tables for dining. There is an outside patio as well for dining outside. The staff and bartenders are super nice it's been a pleasant visit."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaUtTTjZBRRAB",
            "text": "We chose this bar initially because of its location adjacent to our hotel. We continued to visit each night after a long day of exploring NYC to unwind and have an enjoyable time. All staff members at this establishment displayed a welcoming and friendly attitude. The beer selection was diverse and the food was tasty not to mention the establishment was clean and most importantly so was the bathroom. Our appreciation goes to Seamus, Jonathan, Josh, and especially Benny for adding to our remarkable experience in NYC."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dThuQWlRRRAB",
            "text": "Dropped on for drinks. The first round was amazing, and second, not so much. Ordered pork sliders, and they didn't have much flavor and really fatty. The christmas decorations and overall atmosphere was magical. I'm not sure I would return."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMlBMQWlnRRAB",
            "text": "Very friendly and helpful waitress. Nice food and drink. Lovely decor, definitely worth a visit."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tacGVDMUVhV1ZCWjJSUVVWSTFSRVpxWmpsWFkyYxAB",
            "text": "Not bad, but much less of an Irish pub than we expected. The food was decent. Our server never seemed all that interested in serving us and wasn't very attentive. Not a bad experience but not what I'd call great."
        }
    ],
    "reviews_count": 79
}