{
    "name": "Juniper Bar",
    "place_id": "ChIJ5Z-4NaxZwokRF98-wGsCVDM",
    "grid": "MN5",
    "address": "237 W 35th St, New York, NY 10001, USA",
    "rating": 4.3,
    "user_ratings_total": 1221,
    "phone_number": "(212) 967-2511",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toeFQxVnBNVk4xU2todVQxOVdlVGxOZEZWclQzYxAB",
            "text": "Nice medium sized restaurant and bar with great service and good food.\nI sat at the bar and had the pressed chicken au jus."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaNmVXOXNSamN5Vm1KRFZqWmtOblpLU1dsc2VIYxAB",
            "text": "Braily & staff were extremely accommodating. It was the perfect after concert atmosphere close to Madison Square Garden. Amazing cocktails and great service!!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sWFNscHBVa05oWHpsYVpHdGZlbTE2VUcxS1JrRRAB",
            "text": "I attended a book signing event on 10/25. The space was cozy and quaint and the service was amazing. I was really happy they had a coat rack. There aren’t many places that consider this and as the we approach the colder months coats can get clunky! Our server was Kendra. Quit witted, professional, knowledgeable, attentive and kind she was! She didn’t miss a beat. We were maybe a party of 10-15 people over the course of a few hours and she was prepared for each in and out flow. As her shift came to an end, she ensured Eduardo was fully downloaded on everyone’s specific needs or expectations and the hand off was seamless! Big thank you to Alyssa as well for assigning Kendra to the section. You picked the best person for the job! If you aren’t already I’d encourage you consider her for a promotion for sure. She’s mastered her current role and she’s ready to support you all in a bigger way. I can feel it! The pineapple, coconut mojito could've been a little stronger and a bit more creamy for me, but I won’t give Lucas too much of a hard time on it! Thanks again!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFdE5UUlhOM1JZYmxZMVUxZFBiMnQyZDNGd1ZVRRAB",
            "text": "We came in with 7 people without a reservation; they put us in the lounge the bartender was our waitress as well: she was amazing. Hats of to an amazing staff."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWbGRVSlZaMHAzVEROc1VGTjNaRzVQYzJKMWIwRRAB",
            "text": "The male bartender was great. My first time there and we go back again. The drinks were also great"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVeFdWRTJTRFpXWjJ4aWVubFJkMHQxWVdObWFXYxAB",
            "text": "A decent place with a pretty good drinks and happy hour specials. No complaints."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMVkzcENNWHBuZVZkSmNHVmlhMFJxWVRKWE9HYxAB",
            "text": "Got a glass of red wine here to kill some time - great selection to choose from! Sat at the bar and read a book. Very nice."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sb1JEVjRYelo0VUdsek5sRmhWbU42Tkd0TFZFRRAB",
            "text": "The food and environment of Juniper Bar was great during lunch time. However, I am extremely upset by the staff that was working during the time I was there. To start when our meal was finished it took 3 times of a staff member walking by and us asking to finally receive our bill. Once our bill was brought to us it was the wrong bill and that wasn’t pointed out to us until after I gave my card for payment. We at first understood the mistake because it seemed our waitress was new and being trained. She returned with the new receipt and once again left us waiting for nearly 20 minutes before actually taking payment again, causing us to nearly miss our trains home. To top it all off it appears that my card information was swiped at the restaurant. Shortly after we left and my card was charged my account reflected 8 balance inquiries and now today, the next day, I see a charge from Amazon reflected on my account that was in no way me. I am extremely upset with the service that was received and the staff that has newly been hired at the establishment clearly needs to be looked into."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdmZlby13RRAB",
            "text": "I've been to Juniper Bar a number of times, including company events, and always enjoyed the food. This time was no different.\n\nHowever, we were disappointed at the waiting time, given that we had a prix fixed menu agreement. The wait was so long that they brought out an additional appetizer.\n\nOverall, it's a great space with great food and drink; were the meal timing better, it would be a regular haunt for me and my coworkers."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sV1VpMVNZekJ6Y2kxYU5sZG1RM3BVUzFReFVuYxAB",
            "text": "Junipers is such a gem! Their drinks are top-notch — the martinis especially were fantastic — and their happy hour menu is one of the best I’ve found. We shared the margarita flatbread and truffle fries, both of which were delicious and perfect for pairing with drinks. The atmosphere is lively without being overwhelming, making it a great spot to unwind after work or meet up with friends. I’ll definitely be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oTWJHdE1XbGM1YlZkeU1YcElkVzlZYVdwa1ZuYxAB",
            "text": "My favorite place to eat in NYC. Amazing food, attentive staff, the music and drinks are also awesome! Would highly recommend. The wings are divine!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUmRFaE1NRXB6UlU1YVYya3pRMkp4Vm1kdVVHYxAB",
            "text": "Food was delicious, service is customer-focused and friendly. Table next to us was quite boisterous making it a distraction. All in all, it was a lovely place for our Sisterfriend reunion. 🥰"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aYVVtVkJhRlY2VW5GdlZHeFdabTl5WVZWdFIxRRAB",
            "text": "The food and the drinks were great. Evelin, was very attentive and amazing  with us!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKQ1oyRjNUbEYzUlhaR2JrSnVPRE55ZVZrNGVYYxAB",
            "text": "Service was really good had no complaints the Vietnamese wings are 🔥🔥\nLobster Mac needed more seasoning as it was a little bland and it needed to be a little more creamy\nCheese burger sliders were good the bun was a little stale\nBuffalo chicken pot stickers needed to be a little more crispy they were very soggy"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMVZVVnlVV3BRTUZkSk5YcFdXRmxtYmxjMFNYYxAB",
            "text": "Steaks were dry and warm like there were under the heat lamp for a while.  Food took forever to come out.they serve basic fare should not be that hard to do  Out of 8 meals only 2 tasted good. Would not recommend."
        },
        {
            "date": "3달 전",
            "language": "iw",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkb05HUm1NR2xvY0ZOZlptVm5jbVY1WjFKSmNIYxAB",
            "text": "אחלה מקום, אווירה כיפית ואוכל מצויין. מומלץ ביותר."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wbFlVUm5iVGRRVlV0amFqUk5TbkoyV25VelJVRRAB",
            "text": "not a fan of the overcooked tuna"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWlNWWlNjVUZtVHpoWmJ6TnpWbUZXV0Y5M01WRRAB",
            "text": "July 10, 2025 first visit for dinner to celebrate our friends birthday. Everything was great, except that the music was a little too loud and the mahi tacos were not to my expectations. ."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNXNmb0hnEAE",
            "text": "UPDATE: I had to deduct a few stars because I can’t believe this is what I was served for $35. I used to love the salmon entree but seems they’ve fallen completely off. A few bites of rice and 3 pieces of bok choy is crazy and sadly, its not as flavorful as it once was either.\n\nMichael is an amazing bartender! What was supposed to be my friend and I having a glass of wine turned into us being there all night because he had such great customer service. The food here is also top tier. We had both steak tacos and the salmon and both were amazing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWkxXWmpVMWx2V1VRNFRWUkhTWFZ4Y1VnMU9WRRAB",
            "text": "The food at Juniper is tasty and great for groups. The number of wings is good for the price. The flavor choices are nice because they’re not the regular common favors available at other places, yet it’s not so uncommon that folks won’t try it.\nJuniper get crowded pretty quickly, so last minute big groups probably won’t work unless you get there at open. We were able to make reservations for 6 the day before, went in 15 minutes later to change to 7 and it was unavailable.\nThe staff are super friendly and accommodating. They deserve grace because they are super busy all the time. Good happy hour spot."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGQldrd3lOMXBqZURjeFdHNTFOa0o0ZWtwMU5HYxAB",
            "text": "The atmosphere was a little discordant, but otherwise solid place"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMdko0S3JIOWYyRWhBRRAB",
            "text": "The staff was attentive contrary to reviews. This restaurant has a nice mood, clean surfaces, and minimal decoration. Food quality here surpasses expectations. The staff exceeded our expectations. Full stars for the wonderful food and attentive staff."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsQk9UUm9jR0ptYUVkVFZYZHBiamN4YjA5cVZHYxAB",
            "text": "Decent watering hole with good mainstream hip hop beats."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLYTMxdl9QMk9lVFNBEAE",
            "text": "Held my small book club meet here. Atmosphere was great, food was delicious and so we're the drinks. Will definitely come again"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOYWtuOXFiNHVyUk5nEAE",
            "text": "Came by after work with some coworkers and got seated downstairs, food was good in flavor, and quick service with friendly staff. Truffle fries and artichoke dip were great for sharing. Wings were a bit burnt and tried this potstickers dumpling too, both were skippable for new, fish taco was meh for me too but others liked it. Good option in the area if you're looking for a place to go! Chill vibes."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VNS0U4YjZoNmRxaHVRRRAB",
            "text": "Crowded during happy hours, but drinks are average. They blocked some area for. A small party… We didn’t stay for long."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPS05ncnpXck1yTDR3RRAB",
            "text": "Great place for happy hour! The Vietnamese wings are to die for. It’s in a great location close to penn station."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNaVNzY1NQakxTbHlBRRAB",
            "text": "Great spot super close to Penn.  Clean, roomy, nice decor and great service.  Went for HH, sat at the bar- bartender made great drinks and service was great.  homemade chips & dip were awesome!  Nice music for atmosphere and not too loud.  Would definitely come back!"
        },
        {
            "date": "5달 전",
            "language": "pt",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJU0YtZS1ZOEpiMDFBRRAB",
            "text": "Bar para happy hour, onde as pessoas vão depois do trabalho. Os petiscos são perfeitos! Eu particularmente nao gosto de musica alta, por isso 4 estrelas, mas para quem quiser também dançar beber e conhecer pessoas me parece perfeito."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZa29tek5BEAE",
            "text": "Good place for after work drinks and food. Music was too loud to hear without yelling."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvanZEeS1BRRAB",
            "text": "Great place for after work dinner"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMzdEeXNRRRAB",
            "text": "Great food and service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbHRfelJ3EAE",
            "text": "Went for drinks great spot"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveHE2eDZnRRAB",
            "text": "Great find with great food we ordered a bunch of stuff for the table the kale artichoke dip was good but a little bland the house chips were divine. Espresso and marshmallow martinis were hits!!! The chicken Parm sliders were delightful but slightly over cheesed and the fish tacos were amazing. The fries were standard bar fries. The cheesecake is magical and deliciously tart. Service was impeccable. Can't wait to return."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJek1qZFVnEAE",
            "text": "10/10 would always recommend! I was supposed to meet a friend for drinks during happy hour, but she ended up not being able to make it so I was by myself. It was still A VIBE! I had an awesome time and stayed past happy hour. Yankees game on the TV. Good music/atmosphere. You can actually hear people when they tell you something. The drinks were really good. $10 delicious classic margaritas. The drinks were a highlight!!! I almost forgot to mention the most important part: the service. Friendly and kind staff. They took care of me. If you want to have a good time by yourself or with friends definitely come."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcUwtQjZnRRAB",
            "text": "Loved this place - so much that I had lunch & then late night cocktails here!   Wonderful interior & nice bartenders.   We enjoyed bourbons, steak satay - so yummy & the egg rolls - decadent & delish!    They have a great HH from 4-7 which I would try to do next time."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOFpmVFlREAE",
            "text": "Having a long day in new york. Wasn't right away and greeted very promptly by waiter. Food was great."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3azhxa1lnEAE",
            "text": "If I could give it no stars I would . My fiancé and I were looking forward to eating there. It had good reviews and a good menu. We went there before the Knicks game. However, there was no hostess so we walked right in . Practically all the tables were reserved so we walked to the back where we saw a table with no reserved sign. A blond woman came out of nowhere and said we couldn’t sit there in a rude manner even though there was no sign on the table. And she tried to seat us so close to another couple. Which is uncomfortable, I do not like to sit so close to people especially when eating. We were already turned off by the lack of seating especially in such a busy area. Why be open if there’s going to be lack of tables for people who want to come in and eat. Thankfully we found another spot closer to msg with better customer service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3azdQTFRnEAE",
            "text": "This place has a happy hour from 4-6 pm. At 6 pm the place was packed !! Happy hour only on drinks- no food. Music is not too loud."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdzlXeGpBRRAB",
            "text": "Our group enjoyed the food and service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMFllRjBnRRAB",
            "text": "Juniper bar is always a great spot! From their amazing apps, like the cheesesteak wontons and their wings were really good. If you like tuna tar tar then it’s definitely a must get!!!! Their drinks are on point!!! I had the old fashioned and the Negroni and wow they are made to perfection. You won’t be dissapointed here."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNGEzTEh3EAE",
            "text": "Awesome food and atmosphere, highly recommend the grilled cheese and miso glazed salmon"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNROV9lZVVnEAE",
            "text": "Looks great! Really cool! SO busy at happy hour.  I think their drinks are divine.  Bring a hot and cool friend!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbzVXaldREAE",
            "text": "Very fun vibe, manageable noise level, great location."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndFBHWmd3RRAB",
            "text": "Bibi, our bartender was excellent, courteous and engaging. My drink was perfect."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNU9mdXNBRRAB",
            "text": "Had a great time at Juniper! Despite the packed house, the bartenders were always keeping an eye on empty glasses  The mushroom flatbread was perfectly crispy with earthy mushrooms and just the right amount of truffle oil.\n\nThe happy hour cocktail menu has great prices. The vibe hits that sweet spot between upscale and relaxed. Ideal spot for after-work drinks or a fun night out."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMXNuMVJnEAE",
            "text": "We tried this place out after reading some reviews and it was SPECTACULAR!  Great vibes and atmosphere, delicious food and drinks and WONDERFUL service. Annelise, Lucian, and Braily were beyond KIND and made our experience so amazing. We will DEFINITELY be back and you should as well. Thank you all!!\n\nPS. BEST SALMON EVER!!!\n\nOlivia"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBcTV2N3FRRRAB",
            "text": "Cannot say enough about the service and food.  Must get the spinach dip, and the calamari.  Mira, Diego and Caesar were so nice!!   It's a awesome place!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1aEtPdDJRRRAB",
            "text": "I Googled for a good place to eat near Madison Square Garden, and fortunately for us, the name came up. Looked over the menu and booked the reservations. Arrived early, and they were very accommodating, and sat us almost immediately. Waiter was great, well spaced everything, and then even gave us time to consider dessert. (Of course we split a slice of Limoncello cake and it was wonderful!)\nFor dinner, we split the Cheese Steak Spring Rolls. They were delicious. For dinner we each had the Bacon wrapped Pork Loin. It was absolutely amazing. My husband and I are still raving about it, and it was over a week ago!\nOn the way out, I realized I was developing a small blister (new shoes...dummy me) and the girls at the podium in the front of the restaurant were both so kind, and one got me a couple of bandaids.\nI haven't been in this part of the city in so many years. I can't wait to schedule something at \"The Garden\", so I have an excuse to come back.\n\nP.S. the Water Closets (bathrooms) were clean as well."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfeThpNGd3RRAB",
            "text": "Perfect forntue moment. Really nice place."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2Z2NHUk13EAE",
            "text": "Came here on a first date and was very surprised. The place was quiet, but that belied the quality of the food, service and ambiance. The staff was attentive and the food was great, especially with Manhattan prices. They also have soft, but great music that adds to the mood and you don't have to talk over. I was very happy and plan on returning."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdV91MVB3EAE",
            "text": "Tried Juniper for the first night of a trip in NYC for New Years. Went with family and was struggling to find seating for a party of five, but we were seated immediately here.\n\nWe missed half of the experience as we did not order anything from the bar, but we were starving and placed our orders soon after our waters. I ordered the fried chicken banh mi as well as some burger sliders hoping to share with others. My wife ordered the glazed salmon.\n\nOur food arrived promptly and was great. The kitchen did not slack on how much chicken they put on my sandwich, the bread was crisp on the outside but soft and airy on the inside, and the veggies offered that classic cold crunch. My wife and I agreed the salmon was cooked excellently and the glaze was gentle but remained poignant. The sliders were a tad overcooked, but that's the only knock I can think of.\n\nThe wait staff was attentive in a relaxed and pleasant way. The atmosphere is amazing for many different scenarios. The high ceilings and dim lights call for a romantic evening. However, the big screens behind the bar and sound of pop music rising in volume as the night goes on invite the relaxed sports bar feeling as well.\n\nGreat introduction to the city for our beginning to the New Year in the city!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzOXEyM3hnRRAB",
            "text": "I found this place on a whim and have gone back since and the service was amazing and top tier! The bartenders are mostly females and the drinks slaps! The place is always buzzing with working class people! They also have a downstairs if you want a quieter experience and it’s up for rental for private evens too! Met the owner and he’s so friendly! Check out my pics as it says it all!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5ck1lTmJBEAE",
            "text": "It is a highly recommended place. The wait time for a table was relatively short for us. The staff was quite friendly and attentive, always looking forward to providing the best service. The wait for the food was not long, we ordered the Vietnamese wings, although for our taste they had a lot of sauce but they were delicious. We also ordered the mango habanero wings and they were exquisite, the white sauce and the wings made a perfect match.\nWe also ordered the mini burgers and were able to change the regular fries for some truffle ones, both meals were perfect. To finish, a cheesecake and although it was too sweet for our taste, the chocolate and fruit sauces compensated well for the flavor of everything together.\n\nThe liquors were the best, we ordered a rosé wine, a red sangria, a margarita and the ivy martini, the latter was the most delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYZ19UdVpBEAE",
            "text": "Came here as a central spot with easy access for my friends from Queens and the Bronx. Happy hour ✅ good cocktails, good food, good service! Really beautiful interior."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSanY3a1NREAE",
            "text": "I recently visited Juniper Bar in New York City with a group of 17 people, and we had an amazing time. The open bar from 6 to 7 was a great way to start the evening, and the host was incredibly friendly and efficient. The food platters were a highlight of the night - everything we tried was absolutely delicious, but the fried shrimps were my personal favorite. The sliders were also a hit with our group. It was clear that the staff at Juniper Bar take great pride in their food and service, as everyone in our party had a wonderful time. In fact, 14 of us were visiting New York and we all agreed that it was one of the highlights of our trip. I highly recommend giving Juniper Bar a try if you're in town - you won't be disappointed 👍"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGb3ZDcEl3EAE",
            "text": "What a classy, beautifully decorated bar & restaurant with great vibes! My guest & I stumbled upon Juniper Bar because it was near our hotel (Henna Hotel) and we wanted an early 3:30pm dinner. I enjoyed the Fried Chicken Ban Mi (a Vietnamese-style sub) with perfectly cooked fries. And my guest had a slider. Our server was courteous & efficient. // As we were leaving around 4:30pm, some of the front tables were being rearranged or cleared - apparently for the happy hour crowd to arrive. Next time I'm in town, I'll have to come for happy hour!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1dm9YNVpREAE",
            "text": "We shuffled over to Juniper after a day of walking around. The fact that they had a happy hour on a Saturday really appealed to us.\n\nWe did partake in a martini, beer, margaritas, and our kids had Roy Rogers, though our waiter had no idea what that was, and we informed him that it was simply Coke and cherries.\n\nUnfortunately, Juniper's happy hour menu does not include any food items, so we ordered our kiddos 2 orders of truffle fries at $11 a piece. They were very good and came with 2 dipping options.\n\nThe fare is American in nature, and the ambiance is decent. They have awesome music with a bar area, hightop tables to the side of the bar, and full tables towards the back half of the establishment.\n\nOverall, a good choice for low key fare and a decent value on happy hour drinks."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHdmZUVWNBEAE",
            "text": "Amazing place. Close to MSG. Pleasant atmosphere. Food is delicious. Portions are big. Prices are sweet. Service is outstanding. All staff is cheerful and professional. Only one setback -  my cocktail was warm. They have a great cocktail…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcjV5bjFnRRAB",
            "text": "I didn't expect to get such a delicious burger from this place! I went for happy hour because our show at MSG. Margaritas were so tasty! I got the pesto mozzarella burger and it was the best burger I had in a long time! Now it may have just been because I've never had a burger with this flavor but I loved it! The truffle fries were amazing as well. Service was amazing. The place was super loud up front by the bar but the seated area was somehow quieter. Loved this place, I'd return!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaX3NyM0x3EAE",
            "text": "This is my go to spot when I'm early for an event in the city or when I have time between trains. It's 2 blocks aways from penn station so grabbing a drink and bite  before starting or ending my night makes this place so convenient. Bar is very long so there always lots of seats available. Food is amazing always pick from one of there silders and their truffles fries are the best! They had a watermelon cosmo which I loved! My date had a sixpoints beer."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4N29qcXJnRRAB",
            "text": "Juniper Bar is a great find in mid-town Manhattan. The restaurant/bar has and old school vibe to it. Their happy hour is awesome, especially on a Saturday, which is hard to find. Where else can you enjoy a Saturday happy hour starting at 4pm? Juniper's food is also tasty and made with care. Juniper Bar is a great place for all types of people, and a must visit while in NYC.\n\nAlso their prices are pretty reasonable. The Surf and Turf sliders and their fries is very fulfilling and recommended."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCcU1Xa2dRRRAB",
            "text": "Chill vibe, excellent service, great food and drinks! Their happy hour felt limited though in drinks - also wish food/apps were included.\n\nWas a great time but food was not memorable enough to go back. Super convenient location, though, easy walk from port authority."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBOFkzY0x3EAE",
            "text": "Went for brunch without a reservation and got a seat with NO WAIT!\nAmbiance was lovely - high ceilings, rustic chic decor. Food was very tasty as well- both the red velvet waffles and heart attack stack were delicious! Not too sweet and not too salty. Recommend for those not on a diet :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeWZtZmJREAE",
            "text": "Adorable place to go for a happy hour (5pm-7pm) before a concert at Madison Square Garden. I had the Beef Brisket Sliders, with shrimp and cole slaw. Sounds weird but it was so good! Drinks were a little sweet so maybe stick to a beer or wine. Service was fast and efficient. Atmosphere was inviting and air conditioning was just right for the Summer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkLV9QS1lREAE",
            "text": "In my experience, this is the best Happy Hour in Midtown. Absolutely inexpensive, with great serving, and a cool and elegant atmosphere. The staff was super fine and we had a great time. I will surely be back again!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeGJyM3lnRRAB",
            "text": "I love coming to Juniper, but today I was not satisfied.\n\nUpon arrival we were seated quickly but were provided no happy hour menu, having to grab one off an empty table.\n\nThe drink menu has changed but not entirely reflected across the website. I wish I could’ve tried the Bohemian Rhapsody.\n\nThe food menu also changed, and my favorite dish the “Vietnamese Style Wings” were scrapped from the menu… so sad. Now it is replaced by “Gochujang Wings” which just makes me feel like Juniper is trying to get into the K-town hype. The Vietnamese wings were unique and sooo good, they NEED to bring them back.\n\nOverall, it was a good experience as always but these small things definitely mattered."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCc3VIdWN3EAE",
            "text": "Delicious cocktails! Great Happy Hour w/ lots of drink options. I had a few of “The Signature” gin cocktails and was not disappointed. Beautiful presentation. And the service is top notch. Intimate atmosphere perfect for a dinner date or happy hour. I added on the Truffle Fries (do it!) to the Surf and Turf sliders- very yummy.  Conveniently close to Penn Station."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4OTRlcEJnEAE",
            "text": "Had reservations for 2 at 5:30. The bar was already pretty packed and it's really loud in there. Hard to have a convo without yelling.\n\nStaff was friendly and attentive. Food came out at a good pace as well. The cocktails were boozy and excellent. The watermelon cosmo was refreshing and tasty. Also got the a martini which was equally as good.\n\nFor apps we got the calamari. It was tender but the breading did not stay on very well. The sauce was a great addition though for flavor and the calamari was seasoned well. Said it was sweet and spicy but the spice was pretty absent.\n\nThe surf and turf sliders were great. The shrimp on there was a great combo with the coleslaw and short rib. My fries were soggy though which was a bummer.\n\nThe marscapone cake tasted like it was a typical frozen pre-made dessert.\n\nMy friend later that night ended up not feeling well after her burger though which is really unfortunate. Probably wouldn't be back unless I was just getting drinks."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNLXBMSThBRRAB",
            "text": "Place was huge.  Was able to catch lunch before the midtown crowd showed.  Drinks were on the strong side but good.  Food was good.  Cheesesteak spring rolls were probably my fav so crunchy n delish..."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaN091c2lnRRAB",
            "text": "So Just for the record.  Juniper Grille is absolutely worth a stop.  The Bartender Cynthia just absolutely killed I'd say easily a top 10 \"Old Fashioned\" in my entire Travels.  She is a legit Mixologist, and watching her perform magic concoction was delightful.\n\nThe food was spectacular.  Cheesesteak Eggrolls were literally top 5 I've ever eaten.  The Burger Sliders were as easy going down."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURncThhc1pnEAE",
            "text": "Came here for a quick lunch with the folks and sister. Didn't realize it was much more of a bar with seating in the back than a full restaurant with a bar. But it has good yelp reviews, so there we were. Inside, it's really pretty with velvet wallpaper and old wood. No drinks for us this day but the food was pretty solid. For appetizer we shared the flatbread grilled with mozzarella, cherry tomatoes, arugula, and balsamic. Light and tasty - a good start to the meal. I had the three sliders - burger, crab cake, and shrimp. They asked me how I'd like my burger slider cooked. Kind of an unexpected sophistication for a humble slider. And it came out as asked. The shrimp were plump and juicy and tasted real good in between the buns. And the buns were soft brioche and not stale as I feared. The crab cake was a bit disappointing since it wasn't really lump - but it didn't claim to be either. The sliders came with hand cut fries that were like Belgian frites.  Sis got the salmon - didn't try it but everyone said it was quite good. My parents shared the goddess salad. The server was more than happy to split it in the back for us - always a plus since some places are weird about that. The salad was very fresh with a variety of components. They opted to get it with grilled chicken. On the whole everyone enjoyed their meal. I think even more so because these food wasn't as salty as typical restaurants. These servers were pleasant but the dish clearing was a little aggressive, especially considering the place was only half full. Three entrees plus appetizer for lunch came out to around $70 + tip. High, but not terrible considering it's Manhattan. Definitely a place worth checking out."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2OWRpNDR3RRAB",
            "text": "I came here for the first time today for lunch. The food and service was great. I got the Surf and Turf Sliders with Truffle Fries and it was absolutely delicious. The restaurant/bar looks immaculately clean and the food comes out fast. I will definitely come here in the future."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4Z01XZmZBEAE",
            "text": "RECOMENDADO 100%\n\nPasamos de casualidad por este restaurante y nos llamó bastante la atención , la decoración y el ambiente es lo primero que te atrapa, luego sus precios y la calidad de la comida es excelente.\n\nKrystal aun recuerdo tu nombre, muchas gracias por hacernos pasar un momento agradable por tomarte el tiempo de responder a cada una de nuestras preguntas y darnos tu opinión sobre cada plato .\n\nDEFINITIVAMENTE vamos a volver.  🎉 🍺 🍔"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkb2FtNEd3EAE",
            "text": "Layout/atmosphere\n*Long bar with three TVs and high tables; raised back area with tables & booths; intimate lighting; dance music playing over the speakers; private room with bar downstairs\n\nService\n*Solid\n\nFood/drink\n*Truffle Burger (short rib blend patty, white cheddar truffle aioli, Bibb lettuce, beefsteak tomato & roasted shiitake mushrooms in truffle oil on brioche bun) - Good; get the immediate smell/taste of the truffles; juicy patty; bun fell apart a little towards the end\n*French fries (hand cut fries with ketchup) - Good; fresh\n*Paper Plane (Yellowstone Select bourbon, Aperol, St. Germain, lemon) - good; solid mix"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSeW9MQnV3RRAB",
            "text": "Great service. Went for happy hour. Recommend the Bourbon Lemonade. Our appetizers were great. Cheesesteak Spring Rolls and Kale Artichoke Dip.  Will be going back"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzanZxeFp3EAE",
            "text": "Blueberry pancakes were delicious. Chicken sliders were pretty good and spring for the truffle fries for $1 extra. Strawberry mimosa wasn’t anything special, but I heard the Bloody Mary was good"
        }
    ],
    "reviews_count": 77
}