{
    "name": "Marea",
    "place_id": "ChIJvWSDS_ZYwokRiG9D395loxo",
    "grid": "MN5",
    "address": "240 Central Park S, New York, NY 10019, USA",
    "rating": 4.5,
    "user_ratings_total": 2918,
    "phone_number": "(212) 582-5100",
    "reviews": [
        {
            "date": "2일 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swNWVWOVViRmxMVmpCaU5uRjNRMmhaVlMxU1pWRRAB",
            "text": "Muy sobrevalorado"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21saE1FRmhOSGsxYmtoSFVtNUlPRGxoYzFsR2EwRRAB",
            "text": "Great food, service and ambiance."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BNE1IRmZTV2xvZG1Sc05GSmlNa0pvU25SNE5VRRAB",
            "text": "Personable and friendly waiter named John.  We recommend him highly.  Nice atmosphere with delicious food. Definitely try out the unique tiramusu."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CU2RFOXNVV1ZSYTFwRVFsSTRRVGhWWVRCZmFIYxAB",
            "text": "Top-notch food and friendly, efficient service. Spot on."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWcFRrWkpiRUpRVEVWT2ExQjZlRXhVUmt0b2NFRRAB",
            "text": "Amazing food and staff. The waitress was fantastic and service was spot on just like the food."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gd2NtSk5YM1pMUVVJMVh6VlRhRWhaVDJZMllWRRAB",
            "text": "How the mighty have fallen."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5MWJHU2JREAE",
            "text": "I went to Marea after a few weeks, the week after I had been there a couple of weeks ago. The food was amazing as always."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRVJHMVdWR3hpUzI5VGRWSkdaMlUwVFRkWFRuYxAB",
            "text": "We visited Marea as a family with two kids. At first, we were seated at what was clearly the least desirable four-top available, but that’s understandable and sometimes part of the game when you arrive with children.\nAs the evening went on, once the staff noticed we were genuine guests who appreciate good food and ordered generously, the service became much warmer. Our waiter was attentive and kind, and overall the service started positive.\nThe food, however, was absolutely outstanding. Everything was refined and beautifully prepared, from the raw seafood to the lobster, scampi (langoustine), and top-quality oysters.\nThe pastas were excellent: our daughter’s butter pasta was surprisingly special, the mushroom-and-taleggio risotto was rich and creamy, the lobster risotto was spectacular, and the homemade spaghetti with clams was truly sublime.\nFor the main course, we shared a Dover sole, which was good, delicate and flavorful, though a bit dry and with a few bones, so there was some room for improvement. What didn’t quite work were the side dishes recommended by the waiter. The butternut squash/zucchini with curry and salted ricotta, while interesting, clashed completely with the fish. The sautéed mushrooms were also well seasoned, maybe too much, with rosemary and herbs, again not really matching the main. Both sides were tasty on their own but simply not the right pairing.\nSo, in summary: the kitchen delivered excellence, even the sides were good, just mismatched. The service, while friendly at first, faded toward the end, the waiter never came back after we finished, and someone else dropped off the bill without a goodbye. We would have left a higher tip if the service had ended on the same positive note it began with.\nThat said, we’ll definitely return, Marea is an excellent restaurant with exceptional cuisine. The only area that fell short this time was the service toward the end of the meal."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RWQxQXlUazFPYWt0TFZuSnpPVlIyYnpCbU9XYxAB",
            "text": "Top notch"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kd00zbE1SakZRTm5KTFltUkdOM3BmUlVZdFEyYxAB",
            "text": "Great food and service in a lovely room that's lively without being noisy. Excellent pasta and fish!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SSWRYRmFjalp2Tm5kNVZYbEJYMjV0V2xveVVWRRAB",
            "text": "I recognize the value this place offers its customers. The team remains observant, addresses questions enthusiastically and performs wonderfully. I've found every dish to be worthy of recommendation. The best food quality in the area. I'm ready to go back to this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxM1YyVm1XbWRYTmtGSFZtaDJSRTVKUm1aeWNtYxAB",
            "text": "Wow! A delightful dining experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SeWRscHdORVJOTWsxRk0wOUpVRVpvTTBoR09IYxAB",
            "text": "Get the fusilli with octopus and a Negroni at the bar… SUPERB!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twTmMzRkRjbVJoZHpobGRIbEtXR1prZFhaUVpXYxAB",
            "text": "Phenomenal food and exquisite service. We sat outside which was ok, would have preferred inside. Overall, one of the best meals I have ever had. Thank you, wonderful to spend anniversary here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WV2QweENNbTFPT1VoRWFreHhjVTFtTlhWU1dYYxAB",
            "text": "this was excellent."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sUWNFZDFWbkZUT0c1VFZuTlpPRzQzUnkxM1NHYxAB",
            "text": "Marea truly showed me what fine dining with seafood can be. The dishes were refined and flavorful, and the whole experience set a new standard for how seafood should be enjoyed at its best."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCblRrRm5WMUJVYUdGTk5pMW9hRFJPZVc5V1EzYxAB",
            "text": "Been to this restaurant multiple times, and I found the quality of their food is consistently excellent and the service is also top-notch as it usually is. I highly recommend their octopus fusilli, one of their signature dishes, and their halibut, which, in my opinion, is one of the best dishes on the menu."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdUtUeUlnEAE",
            "text": "Excellent upscale spot for Italian seafood cuisine. The octopus fusilli is one of the main dishes they are known for (we enjoyed it), but the clam spaghetti was definitely one of our favorites. Definitely also get at least one of the crudo starters, the raw fish selections were amazing. Attentive, friendly and knowledgeable staff."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNVJYY3pVSFE0T1VSeVZFdFVla3BCZVVadllWRRAB",
            "text": "Yes I did a DNA sequence on this lobster roll and there is infact lobstah in here, somewhere under the tomatoes, eggplant and on top of the burrata that takes 90% of the volume of the so called lobster roll. Yes I know you can't tell that's a lobster roll, yes it's $52 a pop, and yes an absolute joke..."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kMVdVSXlPVFpTVmxGUk5IUjFlbkk0U1ZOcFRuYxAB",
            "text": "$50 lobster roll with one pinky sized piece of lobster. 3/4 of the roll was burrata (why?), pickled eggplant (??) and cherry tomatoes. Travesty of a roll. I’m tasting cheese with fish, when the roll is already soaked in butter. Ridiculously overpriced establishment. For not one good reason. Skip this place and go to Avra down the street if you want real sea food. The servers are very kind though."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsaU4wWlBhVGN6TURkb1NGQm1WRmxWVVdFMGFYYxAB",
            "text": "Outstanding service! This place is beautiful and the food is exceptional. Everything we had was cooked to perfection. Fresh and interesting flavors paired together with superb presentation.\nThe staff were amazing and even brought us a little surprise for our anniversary."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wb1dGVXdOWGhoUkRWTFgweFVWbmsyV0ZKamVIYxAB",
            "text": "If you want to try one of the best sea food places in NY this is your place\n\nIf you want to experience one of the worst service at the entrance from a rude host, without vocation for this job then this is your place too"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSbVkxRm9jVXRuVEZWUWVUVklTVlZLYUc1b1ZrRRAB",
            "text": "Marea is amazing! Elegant atmosphere, excellent service, and delicious Italian seafood dishes. Perfect for a special night out in New York."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyOGNianBBRRAB",
            "text": "Beautiful handmade pasta and multiple different varied fish dishes. One of the best pasta places I've been to,  and main courses around fish and seafood are also very good. The fusilli was amazing and so was the lobster ravioli.\n\nSat outside this time (2025) and they had a great server with a good sense of humor, had 3 different pastas, the bombolini dessert was solid, and while the seating wasn't the most comfortable (a lot of noise and heat), the food and service was worth it. Appetizers were ok, probably have to try the oysters next time (the sea bass tartare was ok for me, others liked it more)."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRemMxcHRVQzFNWWpSNVdWUjRlV3huVDA0eVVrRRAB",
            "text": "This is my all-time favorite restaurant for every occasion in New York City. The food is outstanding every single time. The service is excellent. The space is beautiful. I have no respect left for Michelin for not recognizing this restaurant, while giving stars to much lesser establishments. Madness!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTFkwVlJUa2h2TkhseGJXRjNTVXhJWmpkMGJFRRAB",
            "text": "They not only won’t let you pay the bill if you didn’t make the reservation, they embarrassingly wouldn’t even let me split it. Ridiculous policy."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psQ2VVUkdWVGhUTkc5eGJYVm1ibUl5U1Y5MkxXYxAB",
            "text": "I am deeply disappointed by the lack of empathy and rigid attitude shown by Marea. I made a reservation for two guests, fully aware of their 24-hour cancellation policy with a $50 per person fee. However, my client was flying in from Spain and unfortunately fell ill after something they ate on the plane. Out of respect for the restaurant, I called at 4pm to explain the situation and to kindly ask if an exception could be made given the circumstances.\n\nTo my dismay, the staff showed no flexibility or understanding. Instead, they simply repeated the policy and, as if offering a grand favor, extended a $100 gift card. Frankly, this felt more insulting than accommodating, as it disregarded the genuine situation of illness and reduced it to a transactional matter.\n\nFor a restaurant of Marea’s caliber and price point, one would expect not only fine dining but also a level of human empathy, discretion, and understanding toward guests who face unforeseen circumstances. Sadly, what I experienced instead was inflexibility, greediness, and a total lack of compassion.\n\nIn the hospitality industry, true luxury is not only about exquisite food and elegant ambiance — it’s about how you treat people. On this front, Marea failed entirely."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGSFZteGpPRkJCU20xV2NUQkVhV2xFU0c5Zk5rRRAB",
            "text": "Awesome food and service! Had a great time!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214c01GcGhMVjlmZVhGSVNEVlpjbEZVV1RWQ1prRRAB",
            "text": "Amazing place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkbWFFMUxUSGhNZEVNd2RIRldaazFLVVVGNFJrRRAB",
            "text": "Very tasty. Great wine list"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdWNEaDRMV2RVVlVaalh6UXlWWFJQTFhoclZWRRAB",
            "text": "We celebrated our wedding anniversary at Marea, and everything was absolutely perfect from start to finish. The team made us feel incredibly special — attentive, warm, and professional throughout the entire evening.\n\nEvery dish we had was exceptional. The Gambero Rosso and the Capesanta were simply outstanding — fresh, flavorful, and beautifully presented. When it came to dessert, we were torn between two options, and to our surprise and delight, they brought us both in honor of our anniversary. Such a thoughtful gesture that truly made our night unforgettable.\n\nA special thank you to Greg, one of the best waiters we’ve ever had. His deep knowledge of the menu and ingredients made the experience even more enjoyable. You can really tell he loves what he does, and it adds so much to the atmosphere of the place.\n\nThank you, Marea, for an unforgettable evening. We’ll definitely be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWFdIZDBZV05TYTNoMVVrOXFXbms0VW5KaFNXYxAB",
            "text": "I ordered fuzili and it's the best!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WZlNuWjJXRjlLZDIxYVZXbHdSMVJsTUVWbWVXYxAB",
            "text": "Marea exceeded expectations—from the moment we arrived, the staff made us feel truly taken care of. Attentive, warm, and professional throughout.\n\nThe food was just as impressive. The seafood dishes were fresh and flavorful, but even non-seafood options like the steak and pastas were just as memorable. Dessert was a showstopper.\n\nA refined dining experience with top-tier hospitality. Highly recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psYWJqUTBXRTFyY1dWME9HdFBkRzR0VVRVNFIzYxAB",
            "text": "Hands down best pasta I’ve tried in NYC. Highly recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5WlNEZEVTMnBPU25OQmFVNTBTWGMyZDNnM2RXYxAB",
            "text": "Food not what it used to be. Pasta over sauced."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prellsSmlhRFowY1hOUFJXTndZMGQwZUdOSU1YYxAB",
            "text": "Excellent! As advertised."
        },
        {
            "date": "수정일: 3달 전",
            "language": "ms",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vMlkydFZOekp4Y1V3MWQzQnFTbUpxZUdOQ2NuYxAB",
            "text": "Elegent"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWlJFUm9TRUY2YlZScmFWUnlNRzlUVWs5U2VtYxAB",
            "text": "I had high hopes for Marea given its reputation, but unfortunately, the experience fell flat. The food was mediocre at best. My pasta was overcooked, and the garlic was so overwhelming it masked any other flavor the dish might have had. The risotto was especially disappointing—it tasted like rice mixed with brown sugar, with no depth or balance. For a restaurant of this caliber and price point, I expected much better execution. Very isapointing"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kVE5HTlpXVTVqYUdwb1kwZEZlWGREVVRVM2JFRRAB",
            "text": "Classy."
        },
        {
            "date": "3달 전",
            "language": "ko",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OUmNUUTBTakJ1YkV3eFdGRXlSVmRMZDI4d1NWRRAB",
            "text": "몇년전 처음갔을때하고 비교하면 점점 퇴보하는 느낌이 든다. 이집에서 먹었던 그 푸실리는 역대급 파스타로 미국에서 먹는 파스타중 최고였는데.\n매년 방문해왔는데 간이 매번 바뀌고, 서비스는 예전 만큼 좋은 느낌도 안든다. 푸실리생각나면 들리겠지만 그거 빼면 메리트가 점점 떨어지니\n아쉽다."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21waFgyOVRhRUZmUW05ZlFsa3ROVzVrVVVkQ1pXYxAB",
            "text": "Where do I even start? Fantastic food and service. The branzino tartare was *chef’s kiss*. The halibut made me gasp. It had last supper energy. Sheer artistry. Staff were also perceptive and patient. I will be back for sure."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWQ1NXWnpkRWMzV0Zwbk9XVlhhRVkzYzJSbmNuYxAB",
            "text": "The perfect spot for date night or a nice dinner with friends. We love the ambiance -- polished and comfortable, and the food is always great. Definitely recommend the oysters, astice appetizer, and all the pastas. It's not cheap, but we feel like we get our value"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KME55MVVjV3N3U1VkS05uQkpkblpXWHpNeldWRRAB",
            "text": "I ordered the Astice. It was the best lobster I’ve ever had and I’m not sure what they do to the mozzarella cheese but definitely the best I’ve ever had. The service was impeccable and has a great atmosphere.  Highly recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NmR6UkRNV1JDUjFkbVYxOUhZazV1U1VNNWVYYxAB",
            "text": "A very great atmosphere. The swordfish was awesome, and the bread was great too. The service was exceptional and I was brought water refills and water quite often."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNVUyWjJSRUZaUlZsWlVYSjNObTltVmswelJuYxAB",
            "text": "What an absolutely incredible meal. The food was absolutely fabulous. The service was superb. We will absolutely be coming back here again. Worth every second of our time."
        },
        {
            "date": "3달 전",
            "language": "ja",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kMGNWRmxXRGw2UnpsNU9GWkpXUzEwWldGbldtYxAB",
            "text": "料理もサービスも最高でした！ペペロンチーノおいしかったですし、モクテルもよかったです！\n\nトイレもきれい！"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201WFpXbEdNR3N4U2xoeFQxSjFZV1ZxTld0RmNYYxAB",
            "text": "Checks all the boxes for fine dining."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKUU9VbFhlaTFNU0d3d1IwRnpTWGsxVmpoRVZrRRAB",
            "text": "A severely overpriced, fair to pour Italian food near the park. Not the greatest service, but the main thing is the food is not good and way way way overpriced."
        },
        {
            "date": "10달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbzh5SFNBEAE",
            "text": "음식과 서비스, 분위기 모두 만족하였습니다. 여러가지 모임에 다 어울리는 편안한 공간이네요. 연말이라 자리가 없어서 예약하고 다음 날 다시 갔습니다. Astice와 Fusilli, Spaghetti Pasta는 유명한 만큼 맛있었고 디저트도 괜찮았습니다. 부드럽고 고소한 문어의 맛이 일품이네요."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMbDZDeGFREAE",
            "text": "카사레체와 푸실리 엔초비 샐러드 먹었는데 대체적으로 음식이 짜다.\n조금만 덜짜면 더욱 맛있을텐데  좀 아쉽다.\n분위기는 좋은편이다.\n서비스는 매우 좋은편이다.\n다만 테이블간 간격이 좁다."
        },
        {
            "date": "11달 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQNG9uNF9nRRAB",
            "text": "맛있음. 음식에서 수세미로 추정되는 것의 일부가 나왔으나 적절한 대처를 제공함. 와인리스트는 꽤 좋지만 가격적으로는 좋지 않음."
        },
        {
            "date": "9달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfczVQeU5nEAE",
            "text": "맛있음 하지만 비쌈.\n비싼만큼 단조롭게 맛있다가아니라\n정말 입안에서 폭죽이 터지듯 다채로운 맛으로 한입 한입 먹을때마다 이렇게도 음식을 표현할수있구나 알아가는 시간이라 정말 좋았음.\n좋음 경험을 하고 가는거 같아 만족스러움."
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzLWN1OEJnEAE",
            "text": "런치로 먹었습니다. 음식 자체는 신선하고 좋았습니다. 식문화의 차인지 음식자체가 너무 짭니다. 서비스는 친절하고 좋았습니다. 좀 더 메뉴 추천 받고 드시면 좋은 음식 먹을꺼 같아요"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSNU56U3dBRRAB",
            "text": "푸실리는 대단한 맛이라기보다 우리가 문어파스타에 요구하는 맛의 정석이었다. 신맛, 단맛, 고소한맛, 씹는맛을 모두 포함해서. 가장 놀라웠던 포인트는 랍스타의 삶은 정도."
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3LXJIbTJnRRAB",
            "text": "POLPO 는 정말 맛있다. 정말 맛있다 시그니쳐라고 할만하다\n관자도 맛있다. 하지만 기억에 남을 맛은 아니다\n파스타는 맛있진 않다. 그냥 보통 수준 별 3개로 마무리 하려고 했는데 아니 화장실이... 어마어마하다. 화장실 타월이 수건인줄... 쓰고버리기 너무 애까워서 4번 5번 써야할 느낌"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPMnBmSmNnEAE",
            "text": "센트럴파크 초입에 있는 이탈리안. 평일 런치로 먹을 수 있는 파스타가 많지는 않은데, 메뉴가 외려 간결해서 좋음. 가격도 저렴한 편. 음식 3개(샐러드 + 파스타2종) 주문해서 약 110불 정도로 가격에 비해 맛이 좋음. 내부도 쾌적하고 조용한 분위기. 서버들도 친절하다. 문어 강력 추천!"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyNUxTUElREAE",
            "text": "개인적으로 문어(polipo)는 특별하다고 느껴지진 않음.\n그 외 요리는 다 맛있었다고 생각.\n티라미수가 짱이었음."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMTZUWjJ3RRAB",
            "text": "Great! 뉴욕와서 모든 것이 맛없다던 남편도 맛있게 잘 먹었어여. 문어랑 관자 너무너무 맛있었고 푸실리는 식갑이 정말 특이했어요. 서버분도 친절하고 정말 좋았습니다. 푸실리 하나만 시켰는데 두 그릇에 나눠주셔서 편하게 먹었어요 ㅎ"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNTlyS0NnEAE",
            "text": "에피타이저로 먹은 문어요리(Grilled Octopus)가 제일 맛있었다. 본식으로 먹은 관자요리(Capesante)는 소스가 입맛에 맞지 않았다.\n디저트 Cioccolato는 페레로로쉐같은 강한 단맛이었다. 티라미수를 먹을껄 하는 아쉬움이 들었다.\n목테일은 맛있었고 분위기도 정말 좋았다."
        },
        {
            "date": "수정일: 8년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBaEtMQm9nRRAB",
            "text": "음식마다 뚜렷한 개성이 있음. 에피타이저 오이스터 강추. 너무 맛있습니다. 서울에서 먹던 같은 메뉴의 이름이라도 음식의 내용물이 전혀 다를 수 있음(ex 봉골레) 5명이 샴페인 1잔 곁들이고 적당히 먹고 500불 정도. 단품만 먹으면 비싼거 빼고 20~40불대에서 웬만큼 커버 됨."
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnaWJXTkxBEAE",
            "text": "점심 5코스로 먹었습니다. 역시 미쉐린2스타의 스타터와 디저트는 흠잡을데가 없네요. 회의 드레싱이 굉장히좋았고, 랍스타와나온 크림소스도 환상적입니다. 파스타는 나쁘진않지만 평범합니다. 메인디쉬가 생선요리인데 맛은 매우좋습니다. 크림소스베이스에 새콤한야채가 잘맞아요. 단지 고기가 없어서 아쉬웠습니다. 디저트는 아이스크림과 크림조화가 정말 좋은 디저트였어요. 가격은 2인기준 와인1잔씩 포함해서 30만원입니다. 가보시길 추천드려요"
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRc2EtZE53EAE",
            "text": "뉴욕의 미슐랭 2스타 이탈리안.\n문어를 사용한 전채와 파스타가 시그니쳐.\n\n생선이나 고기류의 메인 요리는 감흥이 떨어지지만 파스타는 최고다.\n\n특히 점심 2코스 메뉴는 미슐랭 레스토랑 최고의 가성비를 자랑하니 꼭 먹어보자."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZaHYzTlRBEAE",
            "text": "점심 2코스+디저트 먹었는데 맛은 괜찮네요. 서비스나 이런거 따져서 한국기준 1스타 정도 어떨까..ㅎㅎ 그래도 좋은 가격에 잘 먹었습니다. 예약 필수!!"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURieEtUUV9BRRAB",
            "text": "뉴욕방문때마다 자주 가는곳\n음식이며 와인셀렉션까지 다 만족스럽디\n지난 5월에 갔을땐 아들 대학졸업식이 있었는데\n디저트에 저렇게 축하메세지를 예쁘게 써줬다"
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzODV1UV9RRRAB",
            "text": "5 테이스팅 코스 먹었어요\n진짜 맛있어요\n특히 두 번째로 나온 랍스타 치즈 요리가... 짱\n비싼 돈 주고 먹어도 아깝지 않아요 ㅎㅎ"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqX2Z5LW1RRRAB",
            "text": "음식은 맛있었습니다만, 불쾌한 식당이었습니다. 저희가 앉은 테이블은 창과 가장 먼 내부 깊숙한 곳이었는데, 서버가 제대로 들어오지도 못할 정도로 테이블 간격이 좁았습니다. 저희 자리 주변 테이블은 모두 아시안이었네요. 창쪽  빈 테이블도 많이 있어서 이렇게 몰아서 앉히지 않아도 되는 상황이었고, 몇주 전에 미리 예약했었는데도 그런 자리를 배정했다는 것은.. 한국 국적이 드러나는 전화번호를 남겨두어서겠죠."
        },
        {
            "date": "8년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnNDRTWExREAE",
            "text": "뷰도 좋고 맛도 좋고. 남자들이 먹기에는 양이 좀 ㅋㅋ"
        },
        {
            "date": "4달 전",
            "language": "ko",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKZlRvYzJaNlpYWHBnRRAB",
            "text": "동양인은 메인홀에 자리가 남아있어도 절대 자리배치 안해줌 구석탱이에 안내하는 인종차별 대놓고 함"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkamF2N1hnEAE",
            "text": "I went here for TWICE while I was in nyc.\nEverything was perfect here.\ni had astice, fusili, bronzini, gnocchetti, tiramisu, doughnuts(I don't remember the name of this dessert menu), duck steak (this one either..sry). and I loved every single bite.\n\n뉴욕에서 진짜 맛있게 먹엇던 몇 안되는 곳. 개추 박습니다."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxa29DTGNREAE",
            "text": "죵놔 뽝취눼요 인죵차뵬하는 양놈들.\n딱 들어갂떠니 가방 바다주는 여좌 1차 띠꺼움, 그리고 안쬭 방으로 델꼬 들어가더니 거기엔  우리 포함 세테이블 나란히 한쿡사램 이었고요 아니나 다를까 그 뒤로듀 계쏙 둉양사램 들어오네.\n한큨 유명 유튭버 보고 오는 한큑새램들 등쉰취급 받지 말고 가쥐마세요를레히."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1enMtR0VBEAE",
            "text": "푸실리 진짜 개맛있다. 리조또는 한국에서도 먹을 수 있는 맛. 근데 푸실리는 처음 먹어보는 맛. 존맛.. (둘이서 4개 시켜서- 문어, 랍스터, 푸실리, 버섯 리또 배부르게 잘 먹엇음) 믄어나 랍스터 중에는 하나 뺐어도 되었을듯 하지만 둘다 맛있었고 피터루거보다 맛있었고 더 비싸게 나옴 ㅋㅋ\n맥주1잔 와인1잔 추가 해서 총 230불 정도. 팁까지 270불 냄"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbE15MWZREAE",
            "text": "와이프와 특별한 기념일에 이곳에서 즐겼습니다. 음식은 더할나위없었고, 서비스가 너무좋았고 너무친절했습니다. 추천해요"
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNdDhYMHBRRRAB",
            "text": "평일점심에 예약하고 방문하세요.\n엔트리+디저트 67불 . 5코스 테이스팅메뉴 105불이라 후자를 선택했는데 좋았어요.\n분위도 좋고. 해산물 파스타 특히 문어가 들어간 요리가 아주맛있네요"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtc2FLRWFnEAE",
            "text": "식전빵+올리브유 풍미도 좋고 애피타이저로 시킨 뽈리뽀도 상큼하니 맛있었어요! 푸실리는 말모 말모... 여기서 먹고 이탈리안 갈 때마다 푸실리 시켜먹는데 여기만한 곳이 없네용 센팍 근처라 분위기도 좋습니당!"
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBa2V5NmJBEAE",
            "text": "음식맛도 훌륭하지만 화장실이 압권. 호텔인줄 ㅋ"
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3a29yZk5BEAE",
            "text": "맛있어요. 가격도 메우 비싼편은 아니구요."
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRelpqcUZBEAE",
            "text": "예약 필수!! 모든메뉴가 맛있었어요\n런치에 방문하면 더 좋음!! 친절하고 분위기도 좋고 위치도 센트럴파크에서 가깝습니당"
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRNy1EaVlBEAE",
            "text": "맛은 있었으나 인상적이진 않았음."
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3a1AzLTZRRRAB",
            "text": "뉴욕에서 먹었던 가장 맛있었던 요리입니다.\n절대 후회하지 않습니다.  뉴욕가면 꼭 다시 가고싶은 집입니다."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHX0l1MmJBEAE",
            "text": "분위기는 훌륭했는가 4\n직원은 친절했는가 4\n양은 충분했는가 4\n가격은 적당했는가 5\n맛은 있었는가 5\n\n.5점 점수제라면 4.5점"
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwcmVud1FnEAE",
            "text": "스파게티와 리조또가 짜고 디저트나 소스맛은 훌륭함"
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbXF1Rk13EAE",
            "text": "음식 분위기 모두 품위 있어요"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwdUxib0tBEAE",
            "text": "디저트가 맛있어요"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVZ3JfcnB3RRAB",
            "text": "가성비대비 맛이좋다"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVeDVhaVVREAE",
            "text": "매너가 너무 좋은 바텐더"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVcVllS0pREAE",
            "text": "요리가 예술이다"
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzeE5qR1JREAE",
            "text": "만족스럽네요"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwd1VESlRXbFozVXkxNVZVWk9RMVJFVDBSbGVYYxAB",
            "text": "This place offers a beautiful ambience with an elegant vibe.\nThe service was top-notch, and every dish was exceptional - you truly can't go wrong with the menu.\nThe octopus fusilli and lobster burrata stood out the most for me - both were rich in flavor and perfectly crafted. I'm already looking forward to returning for another unforgettable meal."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3c19EUDlnRRAB",
            "text": "Came here the other day for a birthday lunch and it was delicious! We shared the salad with anchovies which was crisp and fresh and the dressing also on point. For the mains, we tried the shrimp gnocchetti, the halibut, and the scallops - all cooked to perfection. I didn't try any of their cocktails but did have the elderflower mocktail which was tangy and refreshing. Dessert was amazing - the tiramisu with a twist, the millefoglie with pistachio and raspberry atop the deconstructed pâte feuilletée was decadent and light. I had no idea that there was also a birthday dessert with the bomboloni and a mini pistachio cake from the kitchen! Service was incredible - we felt attended to by the wait-staff and I must say the bread basket that continued to circle the dining room was the cherry on top. The ambience was quiet but not stuffy - the perfect setting for a family meal. I would certainly come back here again to try other items on the menu!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJa1BQRHpBRRAB",
            "text": "Made a last minute 5pm dinner reservation for a solo dinner before a show. First mention is the service was impeccable; warm and attentive without being overbearing. Food was delicious! I got the pasta ribbons with king crab and breadcrumbs, and the broccolini. Both were absolutely delicious. Also got a grapefruit mocktail that was delicious, and they refilled your sparkling water as if it were tap water which I really loved. This place is definitely expensive, but was perfect for a treat-yourself dinner date."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNX2YxX1RsbU1uajVBRRAB",
            "text": "Long overdue review. I had wanted to try this place for a while and opportunity arose during the X'mas holiday when we were in town from SF. We loved the food and service so much we returned with a friend for our last meal in town. Pasta and food was exactly what I had craved and missed - a cross b/w food in Italy and Italian food in Japan. Something we don't find at Italian restos in SF. Huge draw was also seeing my favorite razor clams (this one was prepared as a crudo)! We pretty much tried as much as we can on the menu during our 2 visits - caviar, oysters, crudos, pan-seared fish, scampi and most memorable was their pasta! Our favorite was the fusilli with red wine braised octopus and bone marrow and casarecce with lump crab, sea urchin and Calabrian chili. Be warned that one order of pasta was so HUGE, it was more than enough to share! Service was warm and attentive - they kindly sent us home with a box of yummy chocolate bon bon - and if you made it till here reading this, what are you waiting for?! GO. NOW."
        }
    ],
    "reviews_count": 91
}