{
    "name": "Indian Accent",
    "place_id": "ChIJ5zM53_lYwokREUcpQkveG1w",
    "grid": "MN5",
    "address": "123 W 56th St, New York, NY 10019, USA",
    "rating": 4.4,
    "user_ratings_total": 1784,
    "phone_number": "(212) 842-8070",
    "reviews": [
        {
            "date": "수정일: 22분 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xdVdDMXJXVlZpTUVjNVRWRmZWREF5Vm5SaWNHYxAB",
            "text": "Doda barfi treacle tart was fantastic. Warm tart + ice cream is always a winning combo. The blue cheese naans were … not for me."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdVNGcEtTVVJWWVRBeVMzVlRjRzFzTUZoNU1tYxAB",
            "text": "Service was stellar, the food and ambiance was good however I felt it missed something special. We did get a nice booth which I appreciate. We left feeling absolutely full after the four course however found both our mid course dishes were the best."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSSGEyUklTVkl0TjJoa1JsWmZTREp0TWxnek0wRRAB",
            "text": "Incredible! My wife and I are retired from the restaurant business and this was the best meal/service we have had in years!\nIf you like regular Indian restaurants this is a must for the artistry and quality of the food."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKT1NUWm1Oa0o2VWxseVprZGtaelJQVFZwMFluYxAB",
            "text": "good......."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUVlVaGxWaTFhYmtrd1ZUTktValZXU1dnM04yYxAB",
            "text": "Great lunch!  Food was delicious and well proportioned. Service was great,."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONU0zaEthMll5ZWpCelUzazNlR2xuVDJOMGFXYxAB",
            "text": "The food is good. I wouldn't say exceptional. Good flavors and presentations."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkU1YzcE5hRlJuTkZCTlVWSkJia3RRZGpSRE4wRRAB",
            "text": "Excellent service and left a great impression for the meal. My group did the tasting menu of $135. It was a TON of food! You leave very full, that's for sure! We didn't finish one the courses and the staff offered to pack it up for us. The service is great; after every course they replace the plates and silverware. Great for a special occasions. Since it's in the Theater district, the staff starts off by asking if we had theater plans to make sure to keep you on track/be done with dinner on time which is thoughtful."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FeFJ6TTBRV05IUkU5TlQzUlJaREV6TWpCSWFWRRAB",
            "text": "For the price of the food, the service did not match. We had the tasting menu. My partner is dairy-free and asked for accommodations which they said they could make but did not provide and served him dishes with dairy. The vegetarian options on the tasting menu felt like a second thought. The lobster course was very dry and overcooked. Nothing about the food felt special or curated (not seasonal either) and the coursing was not consistent in the timing of each dish coming out."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMGNDMTFTSGMwTFV4V1QyVkhXRmRhZW5ReGEzYxAB",
            "text": "Incredible meal with truly impeccable service; one of my new favorites in nyc as an Indian fine dining enthusiast. And better than the delhi location!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdldFWkpibUZCYnpBeVdqaFVjV1paU0doc2VrRRAB",
            "text": "The Lamb dish and the shrimp dish were great! The paneer dish wasn't good - prepared in salsa sauce!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zMVNVTnNWbUpXUjFRM2NsTjBUM2R1VHpjMldXYxAB",
            "text": "The food at this place was outstanding! Absolutely loved the Kashmiri morel (mushroom), ghee roast soy kheema dish with quail egg, and doda barfi tart with ice cream. Also got the proper copper drink which was good.\n\nNot only one of my new fave Indian restaurants in the city but also one of my fave restaurants overall!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSlVUTmhjWHBxZEZkU1UwVjRZV0ZMYWpGdFJYYxAB",
            "text": "Tried their four-course vegetarian dinner - loved the chaat, tofu vada, paneer (spicy!), and mushroom kulcha. Friends enjoyed the pork, prawns, and lamb. Great service, small portions but filling. Only miss: dessert mix-up, so I never got the famed makhan malai. Groups with 10+ members can have trouble seating together."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKMU9GUTNaVnBrV1hWaVZETllWbWQ2YkV4NFgwRRAB",
            "text": "The morel appetizer and dahi kebab were outstanding. But I found the laal paneer main course and the black dal a little underwhelming. Service was incredibly thoughtful."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNGJsaDJURmszVEcwd01sUlZiWE5MVG1ONFNVRRAB",
            "text": "Service was slooooowww food was amazing the decor was okayish it isn’t the traditional Indian restaurant but the dishes were great"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxNktINnJBRRAB",
            "text": "The food and service were the BEST. The best Indian food I had in the city- it was better than Semma in my opinion. The cuisine was outstanding, with each dish being exceptionally flavorful. I particularly enjoyed the spicy eggplant fish, and the service was excellent, complemented by delicious cocktails. Tbh, I enjoyed every dishes for real; butter chicken kulcha was also so good. We got the 4 course meal and I was super full!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTlZGSTRZa2RKVW01RkxWOURMVVl4VTBaS1VFRRAB",
            "text": "Wonderful place and good fine dine experience"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGa01WVkdXR3RTT1VOMlRYTmpXWGt5VEU5VFVuYxAB",
            "text": "our server autumnwind was fantastic! the paneer panic was great."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5UWJHcHpTRWxMYm5kT1JHWnpRbkJNYlVOdk5rRRAB",
            "text": "Quite good one, really liked the ambience and the way they serve food is commendable. Quite detailed Menu. Would come again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMFRsWXRaVFUwYTJ0cE0wZG1jbmd5Vmt4U1FXYxAB",
            "text": "Good presentation and tasty food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWa01rUTJRWEZNTVhWV2VrMUdRbFZ4WW5GVGQzYxAB",
            "text": "The wagyu on the bone was incredible. Great food and great service. One of the cocktails we had was great, the other was too tangy."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTVQxcEZSRk5QY2xwNlkxY3dWbVI1Um5JNVFsRRAB",
            "text": "Today was a gala day. With a friend visiting from the West Coast who wanted to eat at not one but three Indian restaurants how could I not agree to break bread with her? This was Shobha’s first time eating here. I had eaten here at least four times. We both had the three course tasting menu for $56. An amuse of tiny blue cheese naans accompanied by a coconut and pumpkin shorba was given. The naan was tender, chewy and sharp in flavor. Both of us had the Sweet Pickle Pork Ribs which Pete Wells, former New York Times food critic, wrote that this dish could not be removed from the menu. Shobha ordered the Tandoori Lamb Chops, Black Dal and Kashmiri Morel Pullao. She had ordered a kulcha which was not given sonthe rice was perfect with the dal. Chicken Tikka Meatballs with my favorite garlic nan were my choices. We shared some of the dishes and enjoyed the cuisine. The dessert of Makhan Malai, Saffron Milk and Rose Petals resembled a fluff of air. Similar to a soufflé, this was both creamy and light and perfect as we both were feeling rather stuffed. Service was unobtrusive and professional."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25seWVVWjRUVGgwTkZkM05rUTNRbEZTTkZobVIyYxAB",
            "text": "Another Outstanding Experience Start to Finish\nThis is one of 3 Indian Accents worldwide; the others are New Delhi and Mumbai, and it’s clear why they earned Michelin Stars.  Warmly greeted by Ambrose on arrival- she remembered our favorite table.  Service is attentive, never rushed.  Servers are terrific about advising you on 3 or 4 course; ours recommended one of each so we could split the amazing dessert.  She also recommended good pairings- important with such distinctive spices and preparation.  For appetizers we had the potato sphere chaat, and Assamese broth dumplings in nettle oil, with crispy black rice. For mid course we had the smoked eggplant bharta cornets, & rock shrimp with gunpowder [chili]. For mains we had the Branzino, & ghee roast lamb- my favorite.  For dessert we split the [non dairy] coconut & jaggery kheer, banana cashew cheesecake, black rice chikki.  Doesn’t really matter what you order- just ask your server for advice.  We’ve never had a disappointing dish; neither have the friends we recommended try this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twMGVsZDZNRzFzWnpsTmJIb3RMVlpFVGtkTllrRRAB",
            "text": "Always a great experience!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOUFJXVmhZbXR0Y21oNmFVc3hSWEJHZDJGRGEyYxAB",
            "text": "Food was decent but nothing special, I expected more from a $100 tasting menu. Generally lacking flavor for an indian restaurant except for a few of the appetizers. It's the lowest value for money fancy meal that I've had in Manhattan. Example: the shrimp dish is flavorless overly fried pieces of shrimp. Chicken Malai is in meatball form with a relatively flavorless creamy sause. The specialty cocktail was delicious at least, and so we're the deserts. As for atmosphere, nothing wrong with it but on a Saturday evening the restaurant was only about half to 2/3 full the entire time (8:15pm seating). A bit odd for a highly rated place in this area."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaeFlYUnhTSE16ZEU5UVQzZ3piRTFEZVVRNVgyYxAB",
            "text": "Overall a great fine dining experience at Indian Accent. The stand out dishes were the amuse bouche starter of cheese naan and warm pumpkin shot, wagyu pathar kebab on marrow bone with garlic, the restaurant specialty ghee roast lamb with roomali roti pancakes, and the doda barfi treacle tart. The flavors and execution was wonderful. I found the lamb dahi vada a bit too sweet for my taste and the lamb itself was lost. And while I did enjoy the black dairy dal naan and black garlic raita, it too hit a sweet note; I wish it was more savory. The restaurant ambience is high end and refined. And the service was great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5d05qWjVWV2xRVGpabWJIbERkRmd5YmpFeE0wRRAB",
            "text": "During a recent work trip to New York, I decided to treat my wife to a surprise dinner at Indian Accent, and it was an experience that was nothing short of stunning. While our arrival began with a less-than-warm welcome from the maitre d’, whose curt comment about not having a reservation dampened the initial mood, the rest of the evening was a true showcase of hospitality and exceptional culinary artistry. Every server beyond that first interaction was gracious, attentive, and eager to make our night special.\n\nThe food itself was nothing short of extraordinary. The small plates set the bar incredibly high: the sweet potato shakarkandi, yogurt kebab, aloo rasa, and roasted beet were flawlessly executed, each dish balancing creativity with authentic flavors. These courses alone were worth the visit, offering both comfort and innovation in every bite.\n\nFor the main course, we opted for the Kashmiri laal paneer, which while flavorful, leaned on the drier side, leaving us unsure if it was intended to be enjoyed alone or primarily with accompaniments. Thankfully, the sides more than compensated. The black dairy dal with naan was rich, creamy, and deeply satisfying, while the chole kulcha brought a wonderful textural contrast and flavor punch. Together, they rounded out the meal beautifully.\n\nDespite the rocky start and one main course that didn’t shine as brightly as the rest, the overall dining experience at Indian Accent was remarkable. With inventive dishes and unforgettable flavors, it earns a solid 4/5 and a strong recommendation."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGUmVqSk1NVWx4VEVoU1UyNDFPVEY1YWtWU05VRRAB",
            "text": "If Michelin won’t do it, I will…STAR! Without a doubt, STAR. I don’t think there is a restaurant that I have “frequented”, but this will certainly be one."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkNWNFZDNWMUEyYTNGUVl6UlNOSGN6TjJaQ2RXYxAB",
            "text": "This restaurant meets every need. You can expect good preparation in all their dishes. No waiting period and service team is quick! This spot presents beauty alongside genuine welcomes. This place should be on your shortlist."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJM05HMVNaazE0T1dJMU9XMTJaWGN6VTNWTmFsRRAB",
            "text": "Not what was expected with a pick from a set menu style of dining. Food was very tasty however comparing to a British Indian curry was a mistake as if that’s what you’re looking for you won’t get it here.. unfortunately our waitress hardly spoke English however the table next to us had a male server who was on the money and really knew his stuff..\n\nNot cheap, but top quality, well presented food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204NVZIRm9iMFV6WW1rNVRsVnJRVFJMVlVaNldHYxAB",
            "text": "Wonderful meal with excellent service. Incredible flavors and great value with the tasting menu. Can't wait to return"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oT1psVXpSVzVKY3pVM2ExRk9OVUZDYjBZM2NHYxAB",
            "text": "Good food with enjoyable mini courses. The main course was on the heavier side, but the unique desserts made for a memorable finish."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oQlRuQnlhMjFPU0VsSVlUQmpNRzAxTUZkQ1YzYxAB",
            "text": "From the first bite to the last, everything was"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vMWEwZDFWMHR4U0hZMWJsaHFNMjAyTURKd1IxRRAB",
            "text": "Really felt like a very special dining experience - there are so many small things the staff do to really take your experience to the next level. Reasonable portions and excellent flavors! New take on a lot of Indian dishes. We loved our time here and can’t wait to come back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poTlgyZzBORkpWVjAxYWN6bHJkM0pVVVVobFUyYxAB",
            "text": "The dishes were creative and combine many cuisine favor but somehow they manage to have the Indian note standout. The starter with Morels mushroom was rich, flavorful and delicious. I could eat that all day! They should make a pasta dish out of it. For the main course, the lamb was fun and creative. It is a mixed of Peking Duck with Indian chutney but with lamb. We order several expensive wine and One of the white wine was bad, I could smell it right away and yet the waiter was trying to convince us that it may be because it was just open and came of our the fridge… I mean why questions it… we waited 15 min and the white wine just smell so bad. For $300+ bottle of wine, I expected better. I am still glad that I get to try this restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psd1ozaHlRa2huTkROQmVscHphM0kwWVU5dGMwRRAB",
            "text": "Words and pictures don’t do justice. Simply superb 10/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbGFGZ3hSVXhpVUVkUllXaGlOSFp2VlVGMU5VRRAB",
            "text": "Really great upscale Indian spot! Definitely go for the multi-course menus and share so that you can try lots of things, it’s the best value for your money. We really liked the smoked eggplant, and the roast lamb with roti pancakes (sort of like Indian version of Peking duck). Also the black dal was delicious, I think comparable to the famous Dishoom version."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205cFlWZFJkV1Y0WlZwU1IwWk9jMWxTUlZwWmVYYxAB",
            "text": "Love the meals I’ve had here, top notch in every way. Portions are generous, everything is so well flavored and prepared. Gluten free friendly and gluten free roti available. Staff are super sweet. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjekxYb3dObVJITmxscFdUSlNSRWcwU1hOaGFsRRAB",
            "text": "Really delicious Indian fine dining in a beautiful space with attentive staff"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wR1lsRk5RV1JQTUZkQll6UlVZVk52Um5SVFIyYxAB",
            "text": "I had a very disappointing experience here. The restaurant is highly overpriced, and the food simply doesn’t live up to the hype — lacking in authentic taste and far from worth the price. What’s worse, the menu pricing is unclear and feels intentionally misleading.\n\nThe staff seemed more focused on confusing us with over-explained items than actually helping us make a good dining choice. When the bill came, it was shockingly high, with no proper explanation. It honestly felt like we were being taken for a ride.\n\nAvoid this place if you’re looking for real Indian food or a fair dining experience. Total waste of money."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5cmIxQk1hRlo1WVhaQll6Sk1lRXRVWTJ0T1MyYxAB",
            "text": "Very creative dishes"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRa3M3X0NnEAE",
            "text": "Our favorite in NYC -- and that's saying a lot!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WVgwVlNaalZSZURWRlZGWlZlVTVYWldoclExRRAB",
            "text": "Best Indian food in city"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBd1JFWXdVRlU0TFZnNU5rTTNlVkpUVEVGV1JuYxAB",
            "text": "Food had no taste"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sNVpHRmljMEZzWlMxUU9GVnhYMGxSV1ZoWVIyYxAB",
            "text": "Delicious"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KS2NpMVhWM2xvTFdzM2RVVlBjalJzTjFoRGVXYxAB",
            "text": "Glad we visited! Definitely worth it!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkVlkyOU5hV2xUT0hsTWNYbzViazFTY2paek5sRRAB",
            "text": "This place was incredible. Best meal we had while visiting NYC. It’s all fixed course menu , and it was plenty of food for two of us. We were stuffed when leaving. They were super attentive and the food was excellent. We were here just over two hours.  A+ experience. Would recommend a reservation. We arrived at 7:30 on a weekday and just made it in.  It was packed within the hour."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201VVoycHJUMXBzUkMxMlZrSjBNbTVHYXpOamNtYxAB",
            "text": "I finally got to try Indian Accent in NYC and wow, what an experience. I went in with high expectations and somehow it still managed to exceed them.\n\nWe started with the sweet potato shakarkandi with starfruit and crispy okra and the Kashmiri morels with walnut and parmesan papad. Both were phenomenal. Each bite was bursting with flavor and really set the tone for the evening. If the idea of an appetizer is to leave you wanting more, this absolutely nailed it.\n\nThey served us complimentary blue cheese naans, which I had heard a lot about. Personally, I found them okay ,maybe just not my thing but I can see blue cheese fans loving it.\n\nFor the mid-course, we tried the tofu medu vada with Madras gunpowder and sambar cream, and the yogurt kebabs with aloo rasa and roasted beet. The medu vada was interesting, not my favorite bite of the night, but the sambar cream? Mind-blowing. It had that nostalgic sambar flavor, but in this luxuriously creamy form I never imagined possible. The yogurt kebabs though, wow. They just melted in the mouth. Absolutely heavenly.\n\nFor mains, we had the Kashmiri laal paneer with tomatoes, dried fruits, and lotus root, and the arbi shaami with vegetable nihari and walnut and caramelized onion pulao. The paneer was rich and comforting, paired with a buttery black dal and black garlic naan that made it feel indulgent in the best way. The arbi shaami was soft and paired perfectly with the pulao and crispy lotus root. Oh, and the chana masala kulcha with sesame butter, a nice touch, hearty but not overwhelming.\n\nTo finish, we got the makhan malai with saffron milk, rose petal jaggery brittle, and almonds. What a way to end. This dessert was pure joy. Creamy, foamy, delicately sweet, and beautifully balanced. I swear my body did a little happy dance with that first spoonful.\n\nOverall, the experience was absolutely lovely. The food, the quiet ambiance, and the thoughtful presentation. It felt special but not stuffy. I’d definitely go back. Highly recommend if you’re looking to experience Indian cuisine in a truly creative and elevated way."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoR1kxSm9UMGhOUXkxNVJYVTBVRnBZY2t4WFEzYxAB",
            "text": "Must try restaurant. One of the best dinners I have ever had. The service was amazing. The food was incredible."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTWNrcEVaVkZXYjJkZlpFSTVNakJ4UVZkQ00zYxAB",
            "text": "I recently visited this place ordered Pav Bhaji, but unfortunately, the taste didn't quite meet my expectations. From second option I ordered Butter Naan, and while the naan was delicious, I was surprised to find that it wasn't served with any curry. At least waitress should suggest that we have add additional curry. I think the Uttapam would pair well with some vegan curry options"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taak5WcDVTVm8wZFhWZk9UVjJjbWN4U1VKVWMyYxAB",
            "text": "Wow, this place is great! Indian Accent is definitely the nicest and most formal Indian restaurant in NYC as the menu is pretty much all a tasting experience. The food was unique and great, the decor was sleek, and the service last night was out of this world. Really, the service was one of the best experiences we've had dining out at a restaurant. We couldn't recommend this place highly enough for a special meal!"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZdUt2Y0l3EAE",
            "text": "조용한 분위기에 음식과 서비스가 훌륭합니다.  와인리스트도 범위가 넓습니다."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMM3c3cHVQcTR1SllnEAE",
            "text": "This place is the definition of cultural appreciation.\n\nEvery item on the lunch menu is small yet, of course, deceptively so; I was perfectly satiated by the end of the meal. The flavors were so strong, so bold, and reminded me of my own grandmothers’ cooking, even contributing to a sudden homesickness for them. Every item was rich and celebrated Indian flavors with such pride - how did they manage to make palm-sized dishes pack such a punch to the palette?\n\nAlso, notably, no menu item looked like what I pictured it would be (coming from a background built off the canonical versions of these dishes). At first, this was off-putting, but it quickly made the meal all-the-more exciting, making me guess what the next course would look like.\n\nSome notes - the side of veggies that came with the entrée was unseasoned and a bit slimy; frankly, it wasn’t needed at all. The dessert - a generic, caramel-tasting sticky tart - was pretty much overshadowed by everything else.\n\nNonetheless, this meal was nothing short of memorable, and the restaurant is an absolute gem."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNU2s3SWFZakphVlNBEAE",
            "text": "Got the three course lunch:\nComplimentary blue cheese naan and soup: 5/5, great way to start\nPao Bhaji: 5/5, excellent, one of the best I've had (including in Mumbai itself)\nPotato Kofta: 3/5, just OK. I'd try a different main next time.\nMakhan Malai: 4/5, my first time trying this dish, I liked it but I'm not a huge dessert person in general. Not too sweet, excellent texture\n\nIn general, everything was rich and full of flavor with great presentation."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMZVM0S1RWeE5MLXJRRRAB",
            "text": "Well, the first thing you need to know is that it is a prefix only menu. You have to have the three or four course meal so be prepared for that. Also the prices are pretty high and the portions are very small for what you get.\n\nI will say, though that although I was worried about being hungry by the end of the meal; I definitely was fully satisfied.\nThe food doesn’t appear like you would imagine it for example, if you get chicken tikka, you may be getting meatballs not the typical fast food versions.\n\nWe really liked the dumplings (you only get 3), and the shrimp (also only get three).  I was very happy that the garlic naan was full sized after eating the complimentary blue cheese doll house version.\n\nHave an open mind and I’m sure you will enjoy yourself here."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKS0xyYW5zZzl6OUt3EAE",
            "text": "Dining at Indian Accent was a beautifully curated journey through modern Indian cuisine. I had the Chef’s Tasting Menu, and every course was thoughtfully crafted, starting with blue cheese naan and pumpkin & coconut shorba—unexpected yet comforting.\n\nStandouts included the lobster tail with Amritsari masala butter, crispy tilefish with raw mango curry, and tender tandoori lamb chops bursting with flavor. Even the sides—like dal moradabadi with chur chur paratha and spiced baby potatoes—were full of character.\n\nDesserts were unforgettable, especially the makhan malai and doda barfi tart. Service was warm and attentive, and the optional wine pairing was a great match.\n\nI think I caught a glimpse of Chef Kapoor that night—he looked busy, but I’d love to say hi in person next time! Highly recommend for anyone seeking refined, imaginative Indian cuisine."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dE82S1hREAE",
            "text": "Fine dining at its best in midtown NYC. We went to Indian Accent for a dinner recently and thoroughly enjoyed the experience. It's not just the food, but the whole experience. From the moment we stepped in to the moment we were handed our coats back, everything was fantastic. We reached there about 20 minutes earlier than our reserved time. It was a busy Saturday night but since they had the space to accommodate us, they welcomed us immediately. they confirmed the notes from our reservation and coats were checked in at the reception counter itself. The ambience is very welcoming and upscale. Our server Shane was very knowledgeable about chef's creations on the menu and very prompt every step of the way in terms of checking in. The food was delicious - very flavorful but not hot spicy. Each of the vegetarian dishes we ordered was finely prepared and presented in a nice manner. The taste, presentation and portion sizes for the food gets 10 out of 5 stars. Each course was spaced out just perfectly in terms of timing to allow us to enjoy the experience without rushing it or waiting too long. We have been to many fine dining restaurants throughout the years and Indian Accent ranks amongst the best."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMQ3U4cUdPbG9HaWV3EAE",
            "text": "Food was fine.\nThe waiter forgot to mention that a dish contained peanuts, but luckily I was able to ask upon its arrival. No indication on the menu either.\n\nKind of unfortunate and dissatisfying experience from such a restaurant.\n\nCould have been a lethal event."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcjlTRjFnRRAB",
            "text": "What an amazing experience we had ! We chose the 4 course meal for 98$ and I ordered a cocktail on top of it . From veg to non veg , everything was made with care and love and presentation was fabulous as well . The food had a fusion twist without losing the authenticity. Loved the food, courtesy of staffs . Highly recommend this place. Reserve before going"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoLUtMcXB3RRAB",
            "text": "Have been here a few times now and this place always holds up really well! The pulled jackfruit tacos are an absolute must - please do not leave without trying those!\n\n———\nReally nice place for fine dining Indian cuisine. Loved their take on some of the Indian staples so would definitely recommend this spot. I think the kerela pepper chicken was my favorite - absolutely delicious dish! The drinks were great too. Would recommend this place to anyone looking for a fancy Indian restaurant!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3N002QVlnEAE",
            "text": "We had 3 four-course dinners and thoroughly enjoyed it.\n\nDrinks ( both alcoholic and non-alcoholic) were delicious.\n\nService was excellent. Wait staff is amazing.\n\nBathrooms are clean and well designed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcXFUT0dnEAE",
            "text": "The chili crab had flavors I have never had a combo of before , garlic prawns were good.\nAmbience service is all great! I’d take two stars away from the food because it was wayyy to rich ( I mean tones of butter and cream used in curries) made us feel full till being sick.\nSometimes great food can also be made without excessive use of oil and butter."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2eG9laG1BRRAB",
            "text": "We went to this place for our anniversary dinner and we were pleasantly surprised ! The atmosphere of this place speaks’Posh’ !! They had 2 options - 1) a 3 course meal 2) a 4 course meal , we opted for option 1. We ordered the Shakarkandi, Star fruit and okra chaat , pao bhaaji for appetiser, and the chaat was the best out of both. I never knew that sweet potatoes could taste so good with starfruit and fried okras .. amazing !! For the main course we had the chicken with creamy base( I am forgetting the exact name of the dish ) and Lamb ghee roast, along with Butter Chicken Naan and Chana Masala Naan. Out of these I loved the lamb ghee roast and the butter chicken Naan the best. The presentation of the lamb ghee roast was also pretty unique and deserves a mention. They had served bite sized Phulka Rotis along with the lamb and a mix of salad and chutneys (I loved the green chilli chutney, although it was quite hot !). The lamb was well cooked and pulled , and had well balanced flavours. For Dessert we ordered the makkhan malai and banana cake with salted toffee, both of which were very delicious and we devoured both to the last morsel 🥰🥰🥰. Overall after eating the food, in my mind I was transported back to India and I was child again who was whole heartedly enjoying her mom’s cooking !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdjUyQVRREAE",
            "text": "I found myself exhausted—heck, beaten—from the day, meandering down 56th when I decided to try my luck at Indian Accent. And boy, what a magical place. From the moment you walk in, you’re greeted by an incredibly warm staff. Every single person I interacted with was kind, outgoing, and generous with their time and knowledge.\n\nThen came the food. Was it desi with proper mirch masala? Yes! Was it innovative, inventive, unique? Absolutely. I was lucky enough to try eight items—each one better than the last.\n\nThe blue cheese naan? Check and check again if you want to be blown away by a collision of tandoori naan, a mild blue cheese, and a pool of butter. The phulka pulled jackfruit—Lord, what did I just eat? It was comforting like home, but elegant and complex—like the feeling of home you get at the Taj.\n\nThe smoked eggplant bharta cornet with goat cheese mousse was a crunchy delight—like a new-school throwback. The soy keema, baked paneer, and rainbow tomato makhani was the most “ordinary” classic dish, but I’ve never had masala and cream so precisely balanced. The mirch hit just right—it had the Punjabi in me dancing and saying, “Chak de phatte!”\n\nStill not impressed? Then go stuff your face with the wild mushroom kulcha drizzled in truffle oil. Am I dead? Is this heaven? Is this what kulchas should’ve always been stuffed with? Seriously—a life-changing dish in my opinion.\n\nAnd the desserts—oh man. Ever wonder what a cloud made of saffron would taste like? Makhan malai answers that question for you. I had the privilege of finishing with the doda barfi treacle tart. I can’t even explain the mind-blastingness of that dish. For a southern boy like me, it was reminiscent of pecan pie—but with a whole world of desi magic.\n\nThank you, Indian Accent. This was a phenomenal experience. The food was only rivaled by the kindness of your staff. A special thank you to Karishma for going above and beyond in making this the best meal I’ve had in my 20+ trips to NYC."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQaWZ1dDd4MHVHQkRBEAE",
            "text": "Good, above average food. Modern twist on Indian food. Standard 3/4 course meal per person. Great staff. Good for special occasions."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dzktbFpnEAE",
            "text": "Absolutely amazing food and amazing food presentation. Each dish had so much flavor ! Short ribs were so tender. The small shot glass of pumpkin soup was served nice and warm and I could have had a whole bowl of that! Desserts were amazing. Our waiters were super nice, will definitely be coming back and bringing our friends!"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzN295UGJ3EAE",
            "text": "The place provided us with an outstanding dining experience filled with unique and delicious flavors. Each course had amazing dishes. Additionally, the staff was friendly, and the service was impressively quick, making our dining experience even more enjoyable. We highly recommend trying the potato sphere chaat and makhan malai dessert!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINS1QeXVBRRAB",
            "text": "This was our last stop for lunch/brunch during last week’s US Open event.  And both of us were blown away with the delicate infused taste that each dish presented our palettes.  Service was fantastic with much attention to detail…. We will definitely be coming back for more (dinner for sure) when we are in town again.  If you like Indian fusion food then this is a must stop!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcV9lOEpREAE",
            "text": "We came in with an already pretty full belly from a late lunch, but it still completely blew us away. While most of the dishes didn’t taste traditionally Indian, we still loved every single one. The cocktails and amuse bouche were the perfect start and had us intrigued right away. From there, each course kept surprising us—they were beautifully presented and packed with flavor. Even though we didn’t come in starving, we couldn’t stop eating as everything was just that good.\nOverall a perfect date night before our Cabaret musical :)"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2b1BiaVBnEAE",
            "text": "They say you eat food with your eye first. I was in for some visual treat and then burst of complex flavors at every bite. What an incredible experience. Thank you Indian accent for an amazing food. I wish I had requested to see chef just see who is behind this amazing work."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkXy1pSjhnRRAB",
            "text": "My son and I were there on 2/24/24 celebrating a long-awaited visit. We ran a little late for our reservation because of traffic, but our table was held. From the moment we walked in, we were treated with exceptional service and hospitality. We each had the four course meal. The food was absolutely amazing. The ingredients were fresh, deliciously spiced, and tantalizingly presented. I loved the soup so much that I was given the recipe. What a special treat. My son said he would bring his coworkers to the restaurant in the future. I highly recommend Indian Accent. Pictures to follow. The only photo missing was of the Mudra Punch (non alcoholic). It was sublime. I didn't want the drink to end."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2amNyNGRBEAE",
            "text": "This was amazing probably the best Indian food I have ever had! Must try. Another thing I really want to recommend, but I unfortunately did not get a photo of it, It was their Dapper Truman— it was a blue cheese and olive Brine foam martini, i’ve never had anything like it. I was blown away. Their Kulcha accompaniment is a must have as well. Top notch restaurant not one complaint! Very reasonable prices for lunch too."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRejYzbUd3EAE",
            "text": "It has a cute ambiance and good vibes, but the overall experience was just okay. The food was average—nothing particularly creative or impressive in terms of concept, plating, taste, or technique. The Kashmiri root vegetables with Koshihikari rice were especially underwhelming—bland and lacking depth. Service was friendly but not particularly attentive, falling short of fine dining standards."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfay1TZG93RRAB",
            "text": "The weekend brunch menu is fabulous.\nCreative and delicious.\n\nFrom vegetarian perspective- methi papdi chaat, millet khichari with arbi, pav bhaji and burrata are must try.\n\nDoodh malai dessert is amazing."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBXzd5akhBEAE",
            "text": "Everything here on the menu is excellent, it’s certainly one of the best Indian restaurants in the city. Our favorites were the lamb, the jackfruit, and both desserts pictured here. Highly recommend"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbmZqLXhnRRAB",
            "text": "I came here for my 30th birthday and had the most deluxe experience! From the blue cheese naan, all the way to the desserts, I was surprised at every turn of flavor. It was a joyous ride! So grateful to have celebrated such a milestone moment for my life here. I would highly recommend! Karishma is the absolute best at Indian Accent!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdTdDOV9RRRAB",
            "text": "Amazingly interesting and creative food, especially the lamb, and patient service from a very good waiter. However we were rushed out, first the manager hovering, then getting the bill too early, but most obnoxiously a half pour of our third glass of wine. The restaurant wasn’t even that crowded. I’ve never actually had this happen before. Plus there is zero ventilation in the back of the restaurant. We won’t be back, unless to sit at the bar."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneW9Lc3hnRRAB",
            "text": "We opted for a three course meal -\nFirst - the Pao Bhaji (kinda ok), Burata chat (nice spin to the chaat)\nSecond -Milet Khichdi with Arbi (loved it !!), Mushroom Uttapa was good too.\nFor accompaniment- we had stuffed chana (kinda ok again ), Dal Naan (which was fine too)\nDessert - Malai Makhan (good and highly rated) & Dodha burfi Tart  (best best - has chocolate in it & a crispy base)\n\nI would totally go back for the Khichdi with Arbi & the dodha dessert - both were amazing!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNnN5NDB3RRAB",
            "text": "This restaurant blends traditional Indian culinary elements with modern cooking techniques, creating a unique and delicious style that might redefine your perception of Indian cuisine.\n\nThey maintain traditional Indian flavors in their choice of ingredients and spices, without compromising the fundamental elements of Indian cuisine for the sake of modernity. Building on this traditional foundation, they innovate in cooking methods and presentation, making each dish exceptionally refined and flavorful.\n\nBeyond the food, their service and ambiance are also outstanding. The waitstaff are enthusiastic and attentive, passionately explaining each dish and providing proactive service. Moreover, the pacing of the meal is excellent, with dishes served in quick succession to maintain a seamless dining experience.\n\nHighly recommended for those looking to savor refined and innovative Indian cuisine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIakxqNk93EAE",
            "text": "Modern fusion Indian food in an elegant setting. I think purely for Indian food there are tastier places, but Indian Accent is exciting for its creativity. Brunch was really good value for the level of food, service, and atmosphere. Portion sizes were humongous.\n\nThe sweet pickle pork ribs were fall-apart tender with a tangy-sweet flavor profile that reminded me of Chinese takeout in the best possible way—I’d demolish an entire box of this. Garnishes thoughtfully modified the bites. Delicious.\n\nThe makhan malai was impossibly light and airy. As soon as you put a heaping spoonful of it into your mouth, it will disappear in a saffron-scented cloud. Garnishes were once again thoughtfully added, this time for texture. It had a chalky gritty residue I wasn’t fond of, but everything else about it was super fun.\n\nI’d go here again if I want Indian food but also something different."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNbTBoOE9EcnFmZFVBEAE",
            "text": "The place is great serves best food. We loved the pumpkin soup and many other dishes we ordered. We went for anniversary dinner and they literally got us a dessert with candle on it which was kind of cute! Must try place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxb1pyay13RRAB",
            "text": "This restaurant is close to Columbus circle.  The ambiance is very simple, but elegant.\nThe service was simply amazing.  The wait staff went out of their way to make us feel welcomed and explained the menu very well.  The food and drinks came out promptly.\nThe menu is prix fix and has many great options.\nThe starters were small, but so full of flavor that it was satisfying.   The main dish was just the right size, be sure to get the naan and dal accompaniment.\nIt was all finger licking good!  Definitely visit, you will not regret the decision.\nI am a vegetarian, and had many options.\nThere is a complimentary starter drink that is simply divine.  I asked for more, and they were quick to bring it with a smile"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUd3RmNWxRRRAB",
            "text": "The food was absolutely exquisite.\nTruly traditional Indian food. Reminded me of home food back in India. Anyone craving Indian food must eat here in Madrid. Spice levels were all adjustable and the restaurant crew speak Spanish, English and multiple Indian languages. Our host Koshi was amazing. Made us feel very welcome and was interacting with all the guests.\n\nWe ordered the Palak Paneer, White Basmati Rice, Chicken Curry and Dal Tarka, as well as dessert of course! The Mango Kulfi which was so sweet and cool and refreshing. Just delicious mango ice cream.\n\nThe food was very flavourful, fresh and temperate hot, ready to eat. Also the garlic naan was so delicious, crispy and just perfect to eat with the Indian food. The ambience is so nice with yellow coloured walls, Indian decoration and beautiful paintings and chandeliers.\n\nIf we come back to Madrid we are 100% eating here again.\nService and food was 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUM1lhWVZBEAE",
            "text": "Great Indian fusion place in NYC. Expect the unexpected in terms of the selection of dishes which some consider unorthodox but were truly delicious. Many gluten free options also. The service and ambience were second to none. Highly recommended and bookings a must."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdU15b2VnEAE",
            "text": "This Indian restaurant is truly one of a kind in the city. The food was outstanding, with rich flavors and unique dishes that impressed us from start to finish. The atmosphere was warm and inviting."
        }
    ],
    "reviews_count": 84
}