{
    "name": "Brasserie Cognac Midtown East",
    "place_id": "ChIJAQBcFv1YwokRn7zc7K1d9Jc",
    "grid": "MN5",
    "address": "517 Lexington Ave, New York, NY 10017, USA",
    "rating": 4.6,
    "user_ratings_total": 414,
    "phone_number": "(212) 392-5976",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xNFJFZDBlSFJxZUVKSU5HNXJiR1l3UjFCUlptYxAB",
            "text": "Good ambiance, good service, good brunch menu but the kitchen seemed to be in a state of disaster!  The coffee I ordered came out lukewarm.  Our server, Edgar, suggested I have a cappucino.  But perhaps the cappucino machine was not working properly so the cappucino came out warm instead of hot.  The brunch menu had an item called \"Scrambled eggs in Puff Pastry\"  which came with grilled asparagus and mushrooms and home potatoes.  I thought it was intgeresting and wanted to try it but ws told that it was not available.  So I ordered the Herb Omlette but instead was served with the Egg White Omlette.  Once again, Edgar was attentive and took away the wrong omlette and a while later brought out the correct one.  My friend ordered the Kale Quinoa Bowl which came out right and was delicious.  When I did get my correct order, the Herb Omlette was delicious.  Perhaps Cognac can ensure that the correct orders come out of the kitchen and that the coffee and cappucino is served hot like it is supposed to be.  Our server, Edgar saved the day otherwise our brunch experience would have been a total fiasco!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204M2VURmtPVkl4UWpKR1pVSnhSRVJEZEVvek1FRRAB",
            "text": "The food was amazing for brunch. Great cocktails and overall a great experience. Food is decently priced and delicious."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMFZtSmtlSFp0VmpoRVlsSktYMmMwWDJ4TGFHYxAB",
            "text": "Had apps and drinks at the bar before seeing a show. Beautiful atmosphere and even better service. The bartender was phenomenal.  Would recommend."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cWExQm1aRlZtWW1oYVowVnZhV1Z2V0d0bmNIYxAB",
            "text": "Great spot good food excellent cocktails\nNice vibe"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200eWNtNUdibWRTV21OTVNsTkpkSEp3Y1dsSE1VRRAB",
            "text": "Love love love this place.\nService is amazing.\nWe had the cod fish, the jump shrimp risotto, the lamb chops, the profiteroles were amazing.\nSo cozy and nice, the staff is amazing.\nThe host was so accommodating and friendly."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGQlNuZE9VRW8xV1dSVVpETnNTVTF6UnpVeExXYxAB",
            "text": "Extremely pleasant place to eat at lunch today. Rain hammering down and I am in the dry with Cote de Rhone excellent"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVlVIRTVOV2hrT0d0Zk1sQk1lVkJFVlVKcVJFRRAB",
            "text": "The Tuna Bowl was delicious!  The staff were great!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OWGFFbFpPSGM0VDJSeVJHaEZRMXBCZGxoT2RrRRAB",
            "text": "Ordered the ‘scrambled’.  Coffee delicious.\nEggs cooked perfectly.  Meat was delicious.    Potato amount wasn’t proportionate with plated items.  5 pieces.  Like, really?\nSalad was wilted."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCQk1YaEtiRFZNYVZwSE4ydFBTWGhJTkdOVGJFRRAB",
            "text": "Lovely place. Cozy vibes. Simply perfect for catching up or catching your breath in between meetings."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1VllpMWxjQzF6ZVdKWlVESlBVVGxHVGpWd1ZWRRAB",
            "text": "I visit monthly, sometimes more than once a month.. the tuna poke bowl is amazing! Service is outstanding!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aSmVtaFJOV3RWT1VoUVZIQnZTWGxTTTBsb09IYxAB",
            "text": "I have dietary restrictions, and the restaurant did an excellent job of accommodating my needs! Top notch service and food! The waitress was great!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxQmRrdDBha0ZGWmxKdlNqSjZNMWQ2TVZkbGMwRRAB",
            "text": "Really? Onion soup? Did you even ask me what i thought about my lunch?? No!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205dFgyUkpYeTB6WDI5NFZrZHFSRXQwWm5NM2JWRRAB",
            "text": "This spot is too good to share with everyone. The plates come with ample food, and I saved leftovers for the next day! Workers combined competence with a pleasant manner. They focus on consistent quality and friendly interactions. This restaurant impresses with its quality."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnMmVsbEplVGxsTjIxUU0wdHJZblJoYW5GaGIzYxAB",
            "text": "Great bartender, she’s very friendly and fast!"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkT2JWWndiME00TkdKYVl6ZDBTR1JGU25SbE0yYxAB",
            "text": "Always pleasant with great dood"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsVFluUjNURTFUY2twSFNTMTJaR05qTUhFNFprRRAB",
            "text": "Went for a quick breakfast and enjoyed it. The bagel and lox were great and my friend got the omelette which was good as well. Atmosphere is as expected. $50ish for 2 people (no drinks)."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GcFpVTmhRakl3U1Rob1RubzNNMDVqZUdSeVZuYxAB",
            "text": "I discovered this restaurant completely by accident. The meals arrive with abundant food. All employees approach diners with true friendliness. This spot serves community interests. I've given my allegiance to Brasserie Cognac Midtown East."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMVdFUXROWGxQVjBFeFMwWlViekoxV0haVWVYYxAB",
            "text": "This week I tried something different thanks to Yelp. The food shows consistent excellence. The restaurant's name Brasserie Cognac Midtown East attracted me right away. Staff members deliver perfect service alongside outstanding cuisine. Brasserie Cognac Midtown East is sized perfectly for a quality experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tod05tMXpUME13TmtGUU1WUTBlVVZmZFZsdVlrRRAB",
            "text": "We had a delightful evening. Great atmosphere, Not too loud but not dead either."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMU9WcEdUUzFzVGpBeVVFeE5lWFI0YUVZeFIyYxAB",
            "text": "We had an unforgettable dining experience, thanks in large part to the exceptional care of Edgar, our delightful and attentive server. From the moment we sat down, he guided us with enthusiasm and genuine passion for the menu. When I asked about his personal favorite, Edgar lit up and recommended the Miso-glazed cod over farro—and what a recommendation it was. The cod was melt-in-your-mouth perfection, while the nutty farro provided the ideal textural balance. Every bite was a pure harmony of flavor and finesse.\n\nBut it wasn’t just the food—it was Edgar himself who elevated the evening. His thoughtfulness, charm, and impeccable taste transformed the meal into a true experience. I was so impressed, I returned three times in a single week—something I almost never do, even as a New Yorker spoiled for choice in restaurants.\n\nThank you, Edgar, for making every visit a palate sensation. You’ve set the bar impossibly high."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxZmIwYzRSMnM0TUUwdFZIVk5VRFpWWlVzNFFYYxAB",
            "text": "great food and service and music"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214VVpteFRTREJ2WldrdGFITjRiV0ZmWVUxNFNrRRAB",
            "text": "Have been here twice for breakfast and brunch and it's super solid. There's a $25 breakfast prix-fixe that's a great deal especially for the area."
        },
        {
            "date": "1달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wb2RVRjVNRlJaY21aZlpXZFBUMGg0YURkcmRYYxAB",
            "text": "J’ai pris le Salmon Benedict et c’était vraiment très bon.\nLe saumon était frais, les œufs pochés parfaits et la sauce bien équilibrée.\nAvec les petites pommes de terre et la salade à côté, ça faisait un brunch minimaliste et réussi.\nLe lieu est agréable, on s’y sent bien."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPN3ppTVdRM0t1NHV3RRAB",
            "text": "Amazing every time! Dinner, drinks, dessert, everything is phenomenal. I'm here once a year with visiting family and it's our favorite spot to catch up and dig in to some great eats. The pizzas are very creative and the meat/seafood options are all cooked to perfection. There are vegetarian options and fantastic dessert choices. See you next year, Brasserie Cognac!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJcnMwTy1tcTZ6QjNnRRAB",
            "text": "My Daughter Carrie took me here for a birthday dinner.   I left ordering completely in the hands of my Daughter.  She ordered Manhattans, one for her and one for me.  I prefer Old Fashioned as the Manhattans were too sweet for me.  But they where perfect Manhattans and served perfectly.\n\nThen she ordered \"Steak Fries\" for both of us.  Perfect New York Sirloins, cooked Medium rare as we requested.\n\nThe fries where hot and perfectly cooked however they are the \"string\", narrow fries.  I prefer \"Steak Fries\", much wider ones.\n\nThe service could not be any better anywhere.  Perfection in every way.\n\nI don't like to have dinner in a noisy restaurant.  I want to be able to hear and understand what my dinner partner is saying.\n\nThis restaurant was relatively quiet and a conversation between dinner partners was no proble,.\n\nI don't like a restaurant with tables that are too close together. I don't like talking over my adjacent tables conversation and I don't want what I say to my dinner partner heard by others. This restaurant had plenty of space between the tables where we sat, which was something that met my preferences.\n\nIn conclusion, let me say that I can recommend everything about this restaurant. It checked every box of my preferences and I'm a very picky person.\n\nIt's a comfortable walk from Grand Central Station. So if you want an experience that will meet even the highest expectations, I recommend visiting Brasserie Cognac Midtown East"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbVJWVndkeTFzTFMwM05EUnRkRWRVT1hOV2NWRRAB",
            "text": "This is the second time I’ve ordered the Miso Glazed Cod, and it is such a winner! Really delicious. Arrived piping hot. Needed no salt or pepper. Portion size was perfect: I could only finish it because I didn’t order anything else including bread. Service was prompt and cordial. I’ll be back. $53 including a $10 tip. It was noisy because of a private party, but the music is not too loud."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJaWcyNF9JcFlfTzJ3RRAB",
            "text": "A great dinner find in Midtown East. The Cognac Brasserie on East 48th St has a definite French vibe. And the food was great. We enjoyed the two fish dishes, Miso Glazed Cod and Halibut. Their sides (cod was paired with organic black rice and the halibut with mushroom risotto) made the fish dishes nicely substantial. And the pork chop with apples and potatoes was also delicious. We shared the house specialty, a chocolate cake with chocolate and raspberry mouse and almond jaconde sponge. The cake was light and made for the perfect finish to our meal. The staff was friendly and attentive. We look forward to visiting their other two locations on Central Park South and Upper East Side."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBc182MmRBEAE",
            "text": "I had the pleasure of celebrating my birthday at Brasserie Cognac in Midtown East, and it was an absolutely unforgettable experience! The ambience is dim and cozy, with a perfect mix of elegance and warmth that made for a wonderful date night atmosphere. The lighting, the music, everything just set the mood perfectly for a night out with friends or even a date.  As for the food, I couldn't have been happier. Every dish we had was delicious, but I have to give a special shoutout to the clams in garlic butter—hands down one of the best dishes I've had! So flavorful and perfectly cooked. I HIGHLY recommend trying them if you visit.  The service was also top-notch. Our server was friendly, attentive, and even offered to take a picture of us when they saw we were on a date and catered to our picture preference.  I had and have absolutely no complaints about the service or the food. Everything was simply perfect. Definitely a place I'll be returning to🤞🏾"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dU1Eek1REAE",
            "text": "I came in here to have a quick business meeting early evening. We sat by the bar and we just had two drinks. The place inside is nice and reminded me of the old good NY bars. We met Dino at the bar who was great! Very attentive, knowledgeable and social. We didn’t try the food so I cannot express my opinion about this. Also hostesses need to be a little more smiley."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQenNIa2tBRRAB",
            "text": "This was a fabulous little bit of Paris in NYC. The ambiance was reminiscent of a Parisian bistro. The waitstaff were attentive. The food was delicious. Highly recommend the steak tartare, one of best I have ever had. So much flavor. It paired perfectly with cheese puffs gougeres. And for dessert a floating cloud of bliss. Will definitely be back each time I visit!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMTVqYUJREAE",
            "text": "quick NY breakfast before work. friendly servers and delicious food. Ordered the Eggs Benedict which was cooked to perfection with just the right portion size. the meal also came with a small bowl of fruits to help start the day."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzX3Z6TWZnEAE",
            "text": "Not offensive, but not great. Food was okay, maybe 3 1/2 stars. Had the octopus salad with additional grilled shrimp and it was just okay.\nBar and table service was quite good."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGT05VZ3dia0l3VUdJNU1tRmhhM0EzVFhOUVZFRRAB",
            "text": "Great food, high touch service and energizing atmosphere. Ahmed makes the experience even better. Love the steak Caesar."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKNGZlNVlnEAE",
            "text": "Brasserie Cognac’s new location in Midtown east is an excellent addition to the neighborhood. The dimly lit, music-filled ambiance creates a warm and inviting atmosphere for a delightful dining experience and the attentive and friendly staff add to the welcoming environment.\n\nWe started with the cheese puff gougeres, which were warm and cheesy, leaving you craving for more - do not skip!\n\nThe escargots, prepared \"Burgundy style,\" are a true standout with their perfect blend of garlic butter and fresh parsley.\n\nThe steak tartare is a work of art, perfectly seasoned with capers, cornichons, shallots, Dijon mustard, chives, and a touch of Tabasco. The quality of the meat shines through in this standout dish.\n\nFor a refreshing option, the spinach and avocado salad is a harmonious blend of vibrant greens and creamy avocado.\n\nDefinitely recommend the cognac wagyu burger - absolutely perfect, and the spicy rigatoni was cooked to al dente perfection.\n\nThe excellent service and cozy ambiance truly elevate the dining experience. This restaurant is a must-visit for those seeking exceptional food and a memorable night out in midtown. It is the perfect venue for a date night, client outing, or family gathering."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUdE16M0RnEAE",
            "text": "Pretty standard hotel bar/restaurant. Grabbed a few appetizers and they were ok. Zucchini was greasy, even after dabbing on a napkin and sliders were fine, nothing special.  Service was okay and there is a good amount of bar seating. We only had a beer but the bartenders were making a lot of cocktails."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdmRXUGNBEAE",
            "text": "Excellent Eggs Benedict with yummy potato wedges & a spring leaf salad, good service, in a quaint Parisian style cafe. Recommend for a good brunch /lunch."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNdWhqdHI5cy0yUm9nRRAB",
            "text": "Stay away and find some other place to eat!\nWe were very disappointed by both service as well as food at Cognac on Lex and 48st. I suppose the first sign of disappointment was when we first walked in and instead of being greeted, stood in front of the receptionist who was busy staring at her cell phone while we stood there for 20-30 seconds.\nThis was just the beginning, when I noticed a discrepancy between the menu description and what actually arrived at the table, the manager who was also a receptionist got down right nasty!\nFood was mediocre at best. The Escargots were small and tough, I've had better buy escargot purchased at the supermarket and warmed up in the microwave. Potatoes that came with my main dish were cubes and had some undercooked pieces. Everything was swimming in a tasteless brown and white sauce. It seemed that the restaurant had an idea that drowning food in sauce made it French.\nOn the positive note, the cocktail I ordered was excellent. French onion soup was very tasty as well.\nThis, however, was not nearly enough to make up for the disappointingly bad dinner and staff interaction experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJMFNFNW5aRFptUkdSRGExTnRVemxxVnpOTldVRRAB",
            "text": "We went to Cognac for a classic brunch menu, hoping for and expecting a lovely experience based on reviews. We were sadly quite disappointed.\n\nWe made a reservation at 11:30; the host seated us with hardly anything more than a half-hearted hello. Not the end of the world by any stretch.\n\nWe were quite pleased with the vibe of the place, has a lot of that classic but charming French chic. When we came in, there were a couple of larger parties finishing up their meal. When they left, we were (I believe) the only customers in the restaurant; quite odd for Sunday 11:30 brunch.\n\nThere was just one server on staff it seemed,  clearly not having the best day, but she still was very friendly to us! We mentioned going to Brooklyn later in the day, and she wrote down some recommendations. She was a bright spot in an otherwise dismal experience.\n\nWe ordered Iced Coffee and a Quad Iced Americano, which were serviceable. We then started with the Gougères which were the best thing we had by far. (Hard to mess up cheesy bread!)\n\nI had a Salmon Benedict with roasted potatoes. The Benedict was fine; not great, not horrible. I added hot sauce to it to add flavor. My plate came with 7 small-ish cubes of roasted potatoes, and then a large handful of undressed lettuce, perhaps to cover the rest of the plate? The dish was disappointing overall.\n\nMy partner ordered the Quiche, asking for roasted potatoes instead of the salad. When the plate came with the salad, we kindly mentioned the error to the man who brought it to us, and he seemed perturbed at us! Definitely not great. While we waited for the potatoes, the quiche proved to be very bland. We expected something along the lines of a Quiche Lorraine, but it was just flavorless. We had no desire to finish it.\n\nMy partner’s potatoes did come out eventually, and it was clear these ones were fresh, with some roasted red pepper thrown in. These were actually delicious, in contrast to the potatoes I was served; they showed some of the potential of the menu that we never realized.\n\nOverall, we were left wondering if we were just given what was left sitting under a heat lamp. A disappointing experience, and we do not plan to come back when we are in town next."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKTGVVWnJhbms1VEdkVFdrWk1ha3RqYjFWSlRGRRAB",
            "text": "I usually give restaurants at least 2 tries before leaving a review. I feel justified in leaving this lacking first impression. The service we received at Brasserie Cognac was less than impressive. First our hostess failed to greet us warmly, but it is NYC, and it was a Wednesday, so I was willing to forgive a chilly greeting if the rest of the service went well. Later, we were discussing the menu and our server, Edgar asked us if we were ready to order. I was not, so I asked politely for a few more seconds to peruse the menu, to which he grimaced, sucked in his teeth and asked if we had a reservation. We did have a reservation, but I was curious to know if he would have asked us to leave if we did not. When I ordered a glass of wine he carded me in the strangest way, repeatedly asking how old I was instead of just asking to see ID. Not sure when it became polite to ask a lady on a date out loud how old she is, but I guess we are in the modern century. Finally, I witnessed him haranging a poor busboy and angrily shoving him. Snobbery is one thing, but mistreating your subordinates is another. Our server never cleared our plates before the entree, and our tiny table was very crowded as result. The food itself was okay. We did not order much, just a glass of wine and two entrees and the bill was $80. My salmon burger was fine, if a bit small for the price. For such a high bill, please go to a place that actually serves good food in an accepting and welcoming atmosphere. Despite the poor service we did tip, as it is almost a requisite when you dine out in NYC. As an alternative I suggest the Smith, which has 5+ locations all over NYC and much better food and service. La Pecora Biana, which I have not reviewed yet, is another nearby candidate much more worthy of patronage."
        },
        {
            "date": "수정일: 1년 전",
            "language": "ja",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6a2Y2cEZBEAE",
            "text": "テラスで、一人でワインを片手にステーキフリットを楽しめる点が嬉しいです。\nステーキフリットはお肉こそ日本人的な印象からすると、少々硬く、予想通りだった為にカットして提供してもらいました。火加減はシェフのお勧めにしてもらいました。\n日本で言うところのwell-doneです。\n一方でソースは私の好み通りの味で、ビストロ的な味わいで良かったです。\n10ozもあることから完食出来るのか?不安でしたが十分に楽しむ事が出来ました。\nワイン3グラス、Steak fritesで合計118ドルです。\n2024/6時点。"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbmRlbkpnEAE",
            "text": "Perfect for my breakfast this morning! Just steps away from my hotel, surprisingly uncrowded. Staff was pleasant and service was quick. All menu choices for breakfast were appealing but I chose healthy and stuck with bacon and eggs. Potatoes were yummy and just the right size! Most important? Coffee was great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiem9MX3VBRRAB",
            "text": "Went there on a Friday evening for a quick bite. Quiet and just what we needed. Staff were friendly and professional. Service was quick. We ordered a draft beer and a burger with fries. The wagyu burger was really good. The cooked, caramelised onion was definitely French, but I didn’t quite like it. Music and other customers weren’t loud. So we liked that a lot. Would definitely recommend this place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SSWVGa3paSGRrZEdjMVkyUTBSak5SVFZKNVJHYxAB",
            "text": "Recently held an intimate wedding dinner here for 20 people and I have nothing but great things to say. Everything worked out perfectly, passed hor d’ourves, cocktails and entrees were all terrific and aplenty. The space was just the right size and very cozy and intimate in itself. The service went above and beyond for us. Would absolutely host another dinner here and highly recommend others to do the same."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWUxYRXhVSEJoYkRjM1RYSnhWVFpWYURKT2VtYxAB",
            "text": "I had a business lunch meeting and it was a great location. I came in from Grand Central and it was a short walk. The food options were wide but since I was there for a meeting I didn't really focus on the food. I had a salad."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MmFtZWZREAE",
            "text": "Trendy, casual but nice french bar and restaurant. Their paloma cocktail was very good along with their Malbec. Tried their tuna tartar, goat cheese and tomato tart, and french fries. The food was just ok but the drinks and vibes are great."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfd01LdUZBEAE",
            "text": "This is the perfect spot for that chill, relaxing vibe you've been searching for in NYC. The interior is so chic and the bar is gorgeous. Elisabeth makes amazing cocktails like this Apple & Oak creation pictured here (winter bourbon obsession unlocked)! 5 stars and a warm hug ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5cklqbmd3RRAB",
            "text": "I was a lone diner and Cesar was my server for the night. He was warm, friendly and checked on me throughout my dining experience. I had the strawberry basil martini which was delicious and the tuna salad that was both wholesome and very filling."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLTzRxWkRtc2NUSTl3RRAB",
            "text": "BEST mussels ever!  Absolutely delicious oysters, salmon, burger, everything.  meal!  Excellent wines.  When we arrived, we were seated by the bar, it was quite loud so we asked to be moved and staff put us at a lovely table out of the way!  Would highly recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRFNqTnJhRzFqWlRaT1RHOWxZaTB6ZHpSMFNGRRAB",
            "text": "BEWARE: The OYSTERS were Rotten, I became sick immediately after eating 2 of them and I sent them right back, they smelled awful and were green -- and the cocktail I ordered tasted like toilet water. This place puts absolutely zero effort into food or drinks, I have no idea how they are still open, the place was completely empty at lunch time and now I know why!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTFgxTnFkR0p5U1hRNFFWZFpObGh4Y0d3eFZuYxAB",
            "text": "The whole experience feels worth returning for again. The restaurant serves community needs well. Helpful personnel make service excellent. The menu features tasty items I suggest trying. When I come back, I'll order differently."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPMlZyclR1MGQ3QlpnEAE",
            "text": "Sat outside, ordered and waited 40 minutes for food. No water refills or bread unlike other tables so ordered another round of drinks (the cocktails were good), said no worries for the wait and food finally came within another 10 minutes. The sauces were congealed with a layer of film so my guess is 20 minutes waiting under the hot lamp. My steak was just short of medium well not medium rare like I ordered. I tasted a bit being so hungry and it was completely unseasoned. So I didn't eat it and refused to substitute for another dish. I'm glad I didn't because they charged me full price for it so I would've paid for 2 meals maybe eating one. My girlfriend's pork chops was very good despite the sharp little bones in it. I will never come again."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNONVBHb1VBEAE",
            "text": "Local excepcional con un gran servicio, en especial el señor camarero,coctelero Dino, donde pasamos mi marido y yo todas las noches de nuestra estancia en NY.\nLa comida es de 10 sobre 10 el ambiente también y los cócteles buenísimos.\nSin duda alguna volveremos cuando volvamos a NY"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQcmJzLS1yNk1LNUZBEAE",
            "text": "Excellent food friendly service. Perfect location"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYckplbHBRRRAB",
            "text": "Came in and instantly became in love with the place. I was served by these 2 beautiful girls, Valentina and Ana. They are the sweetest people ever, they were patient when I was confused with the menu and helped me out through out the entire way. Definitely coming back, I hope to see them again. Felt like I made 2 new friends!!!"
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEaDd2M1FnEAE",
            "text": "Die Brasserie Cognac ist immer einen Besuch wert. Jedes Mal, wenn ich in NYC bin, gehört sie zu meinen liebsten Bars/Restaurants. Das Essen ist hervorragend. Frisch, wunderbar  zubereitet, mit Liebe serviert. Egal ob Fisch oder Fleisch oder vegetarisch - es schmeckt alles vorzüglich. Die Preise sind absolut fair und das Preis-Leistungsverhältnis stimmt. Das Cognac wäre nicht das Cognac ohne Dino. Selten hab ich solch einen aufmerksamen Bartender erlebt. Freundlich, herzlich, witzig - genau das, was man sich wünscht um einen unvergesslichen Abend zu erleben. Auch als Frau kann man das Cognac sehr gut alleine besuchen. Für mich eine der top Locations in NYC. Danke für all die unvergesslichen Abende."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxOW9PVGtRRRAB",
            "text": "I wanted to love this place. Menu looks good, waitress was pleasant and offered good suggestions. When the food came it was clear the attention to detail stopped there. Picture below is the eggs Benedict before eating. Already comes out a mess. There was egg shell throughout the first and I didn't get any further. With the amount of egg shell and the size of the pieces I struggle to understand how the kitchen staff didn't realize it was in there. It was a large thumbnail size piece. I wouldn't come back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMWZ2Nk9REAE",
            "text": "Great for lunch. Staff attentive, the music non intrusive. Decor classy.  Nice food served quickly"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1T1MydzFNSHBaZVVKU2ExQjRTRUZZYVVZNGEwRRAB",
            "text": "Very overpriced for the food quality.\n\nSteak was a little dry.\n\nLamb chops were a little dry.\n\nSteak tatare was okay but lacking flavor.\n\nFoie gras portions were a little small.\n\nCalamari tasted like paper."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJeU95TDF3RRAB",
            "text": "Love this spot! It was the first warm day of Springtime in Manhattan 2025, we sat  outside and had the best eggplant salad I’ve had in years."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdHFPSDlRRRAB",
            "text": "I'm sorry to say this place, newly opened under a new name since COVID destroyed this whole area around mid-town and Lexington, doesn't cut it. I went for breakfast at 0730. Location brilliant. Interior decoration is really nice. It looks the part. The waitress service was friendly and engaging. But, oh my word, the breakfast menu is limited and dull, (you can't have eggs \"your way\" in Manhattan? Are you serious?). I chose scrambled egg and bacon off the fixed menu. But I changed the sourdough toast to an English muffin. I want this to be toasted. Then I can put butter on it, and add jam or marmalade to my liking. But no, the chef decided to stick it under a kilogram of metal on his griddle plate, squish it flat, so it looked like it had been deep-fried. Utter nonsense. Potatoes were boiled and horrible, \"greens\" were lifeless arugula leaves with no dressing, the whole plate was just wrong. Get a new chef. For goodness sake."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKcUs3Y3ExcTh1ZFNnEAE",
            "text": "Food was good. We had the octopus salad, the wagyu burger and the pork chops. I think the best was pork chops. The wagyu burger just tasted like regular meat, nothing special"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvX01HZW1nRRAB",
            "text": "This is a review for both breakfast and dinner.  The food is okay, with some dishes better than others, but not enough to jump to four stars; just too hit or miss.  Same thing goes for the cocktails; just not hitting it.  The wait for the food, both breakfast and dinner, was far too long and the staff seemed to be running on autopilot with very little connection to the patrons.  The atmosphere is good, but could be even better.  This could be a 4-5 star contender, but too many things aren’t working…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMMmRwX1Rwck5IclRnEAE",
            "text": "Excellent food, reasonably priced and great service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCbVZVWnlhMHBVVjE5T1JVeFBTa1ZoZFd4eFVXYxAB",
            "text": "Everything was delicious and fresh . Service was excellent. Highly recommend 😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEaU5IQ1RnEAE",
            "text": "Quite possibly the worst restaurant in New York...quite an achievement! The original Cognac is wonderful. This is not. On my own, I was consigned to the back of the restaurant, a gloomy, poorly lit table behind a pillar. I was not allowed to order off the lunch menu, even though it was 1pm on a Saturday. Service was OK, but everything else was substandard. I used to think Lexington Brass was bad, but this has redefined the word. Avoid at all costs!"
        }
    ],
    "reviews_count": 65
}