{
    "name": "Bond 45 NY",
    "place_id": "ChIJdY2zDlVYwokREzNdClSZvTA",
    "grid": "MN5",
    "address": "221 W 46th St, New York, NY 10036, USA",
    "rating": 4.2,
    "user_ratings_total": 2754,
    "phone_number": "(212) 869-4545",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZd2JHNVdaMnN0VDJRMFRVRmpSVWd4YVZWU01YYxAB",
            "text": "Best spaghetti and meatballs ever… fantastic service… Peter at the bar is a ray of sunshine."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNmQzaFlOMjF2WXpSaGJXcEdSak4yUjNkWWRHYxAB",
            "text": "Our breakfast place everyday during our stay in Hotel Edison Times Square!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsbk5WbHhibE5mYkZabVNVaHpXRGhyUlhCamMxRRAB",
            "text": "The chicken parmesan was delicious"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oSFNIZHRUMUZxYmxBd1lUWnlPWGN6ZUhKUlNWRRAB",
            "text": "Exceptional place. Service outstanding and the food delicious."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4MmVYUm9RVE5NVlRsTk9FSTRXbmgyV1ZaWU9GRRAB",
            "text": "I was torn on what to get, as I was craving an Alfredo. The server suggested the ricotta mushroom ravioli dish. My sister got the chicken Parmesan. Her dish was HUGE! Enough for 3 people to eat. My dish was the best tasting food I’ve ever eaten! I wish I had more of it!!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkSU0wbDJVMjQyWDJGRU1EVjRSazV6Wm1SSGIzYxAB",
            "text": "We did not have a reservation but they accommodate me and my sister. Warm welcome from the get go, staff always smiling and asking questions regarding our show time and allergies. Highly recommended for a pre-Theater dinner. Cheers! Don’t forget the chocolate mousse at the end. Amazing"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnM05rTkhiekpLUzIwd2QwRjFZV2hZWDNwSFdYYxAB",
            "text": "We were looking for a quick bite before our show. We didn’t know what to expect due to the Times Square area. However we were blown away by the attention, service and food quality. I recommend the Calamari and the Espresso Martini"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poU1JuQTFVVlpNTFVsTlZGQm5NalZxZFdobE1uYxAB",
            "text": "Great location, quick preTheater meal. Pizza was on point and Tiramisu for sure!"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sRmVrcFJNRmcyYVZjNVVFcENVbFYwTUhNeFRGRRAB",
            "text": "We had a pre-matinee lunch at Bond 45 this week and were very pleased with the experience. The service and food were excellent. They offer a Lunch Prix-Fixe menu with 3 courses for $39 with some nice choices.  I had the Caprese Salad starter and and the huge Chicken Parmigiana which is just meat. If you want a side a pasta if needs to be ordered separately. They do offer gluten-free pasta.   My wife had the Caesar Salad and Filet Mignon which has an up change but was cooked perfectly and delicious.\nFor dessert we had the Tiramisu and watermelon which is great for limited diets.\nOverall the service was excellent as was the food. We had a 11:45 reservation and finished up with plenty of time to walk down to Times Square for a look or head to many theatres.\nOverall a great experience."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSdFZ6RmpWMGxSUldKd1R6Vm9RMGhaZFZBNGVrRRAB",
            "text": "Quiet location but definitely feel like I paid $30 for hamburger helper"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201QmVGaDNSekJ2Um5wTlVFMW1PV1ZwV0ZwVWRtYxAB",
            "text": "The Italian wedding soup is probably the best; two of the four of us have ever had! The short rib meatballs were amazing! This is a restaurant all four of us agreed we would return to and the service was excellent!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOa1RtUkVVMnh4UkRsNmRVaDFhV2hwVWs0MWJYYxAB",
            "text": "Great food and service"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SQllrTjNiV0Y2UlRGak1HeGxlbWx5WVU4M0xWRRAB",
            "text": "Ordered ravioli and it came slightly undercooked... Waiter insisted the plat be returned and they over delivered on round two... I would eat here again knowing they are happy to correct mistakes."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pocFluRnhjVkphY2pGU1NXTlpiMWRSUVhCV01YYxAB",
            "text": "A NYC bar and  restaurant who doesn’t have have the Yankees game on. Can we really call them a NYC restaurant."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVlIyNTZaa2RVWlRoSmMyaDZaRVowZEY5TFIyYxAB",
            "text": "Todo genial 🤩"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbE5GVmZNMkpUY0c1NFFuUlZNRTQyU0RWdk5YYxAB",
            "text": "Really good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prMlNHNHlRV3hFYzA4eVgwNURja04xWVRkVGVXYxAB",
            "text": "I stopped here for a quick lunch before a Broadway matinee. I had less than an hour and JJ made it happen. He was friendly and efficient which I appreciated on a short timeline. I  had the lunch prix fixe with the caprese, rigatoni, and chocolate mousse and I highly recommend all of it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wR1NtRTRlR3RTYVdWcFoyUjNOVFZPYTJGZlExRRAB",
            "text": "Saturday Night Ava and Taylor took exceptional care of me at the Bar. The Garganele with Red Shrimp and Arugulawas delicious and the Chocolate Mousse would have been equally as good but I didn't have room. The last time I ate here was 17 years ago in their original location with my daughter to see the Rockettes and I was so impressed I knew I had to find it again.  Dont forget to ask for Taylor and or Ava who will make your experience memorable. And definitely order the Chocolate Mousse."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psTU0wOUNMWFJZZW0wMFdreFpkMUpwV1Zwc1NHYxAB",
            "text": "I had an amazing evening at Bond 45 NY   the staff was attentive and friendly. Every dish was flavorful and beautifully presented. Can’t wait to come back again soon!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twemJtcGFabWx0T0RaWVRWcFpjVzk2V25Wa00zYxAB",
            "text": "The food at this restaurant was absolutely fantastic, and our server was excellent as well. Unfortunately, our experience was overshadowed by the hostess. When I asked where the restroom was, she looked at my friend, who is Latina, and replied, “We don’t have public restrooms here.” I explained that we were dining there, and at first I even thought she was joking since she was the one who had seated us. I can understand restrooms being restricted for non-customers, but making assumptions based on appearance was very disappointing. Still delicious pizza"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOT1RtOXlhR1JrY0VKcmFGZDVOV3RJZVdwd0xVRRAB",
            "text": "Great comedy night by Stand up NY at the lower level"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxRGVFOUNaMFkzTkV0dk16QktlbkZMUlRGNllsRRAB",
            "text": "Just a quick shout out to your amazing restaurant, where my daughter ate safely with a soy and nut allergy with the most incredible waiter, Pete. He went the extra mile and it was so appreciated! I cannot say enough good things about our experience. We were referred to you guys by Brooklyn Diner who couldn’t serve her safely. Thank you x a million. We WILL be back next time we are in the city."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214aWIyMXlkMlJ4VUVsb1lqUnFaVlYyT1c5UGIyYxAB",
            "text": "Excelent food and drinks . Service is outstanding .\nDefinitely best breakfast around Times Square area and more."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sSFFUSmZOWFp4Wm1aYVJFVjBTSGRrVFVKVFpIYxAB",
            "text": "Wow! And amazing old Italian restaurant in the middle of time square. Great everything. Wonderful athmosphire. Great service. Amazing staff. Great food and drinks. Affordable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZM1YySXplVFUwVGpGSU1sZzRjWFZ3TTNCRGFHYxAB",
            "text": "So close to theaters and the wait staff is excellent. We go any time we are in NYC!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jeFJXeERRa3B4YUVGaldXRkpUelI2WVY5amFrRRAB",
            "text": "Best lasagna I've ever had and cheesecake was great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMlVWOTZNRmRJY2tOSFdEY3hPSE15YUdrMVZVRRAB",
            "text": "I ordered the lasagna, but it arrived cold and lacked flavor. I had visited this restaurant on December 26, 2024, (to celebrate my daughter's birthday) and had enjoyed fantastic service and delicious food, despite the crowd. I was eager to bring my team here since they love Italian cuisine, and this place was conveniently close to our accommodations.\n\nUnfortunately, the waiter never returned to check on us after taking our order. I managed to get his attention to request a second glass of lemonade. Another waiter noticed my meal sitting untouched and asked how everything was. When I mentioned that my food was cold, he responded with an, \"oh no, who's your…\" but was interrupted when the original waiter approached us. I explained again that my food was cold, and as he asked if we wanted it boxed up, he offered to bring the manager over to help.\n\nI agreed, but guess what? The manager never showed up. I ended up leaving the uneaten food behind. As we were heading out, I saw that waiter standing near the door with someone I assumed was another manager; they looked our way but didn't say a word as we left. I can confidently say I will never recommend this restaurant again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wZmRIbFFlWGhIZWpKeVFXcDRTVGR2WXpsQlFtYxAB",
            "text": "The staff were all amazing and the food was really nice, lovely decor as well. Xx"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZNVYzQXhVMmhOU1ZCelJVUjVUelJHUmxsSFMxRRAB",
            "text": "good variety of Italian favorites\ngarlic foccacia was superb!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SRE16VkxkREYzVFZOMlFqRkxkVEowVVdwcmFWRRAB",
            "text": "Delicious and huge portions! Highly recommend the chicken Parm and veal chop!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOaFgwTjNRMEpaVkVGME1VNU1UVXRJWVVkSlIxRRAB",
            "text": "Thanks to Stephon the best waiter of all times.\nNice and kind. Keep this guy there please."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSR1NGcG1iRE0yZVRWMVgxUkJTMW8xV0RSTk5XYxAB",
            "text": "Bond 45 was great!  Service was exceptional and the food was delicious and great portions.  We had a group of 7 ppl., and we didn't really have to wait long for drinks, appetizers or entrees.  Menu selections were diverse and plenty,  reasonably priced too.\nWould definitely recommend and return."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFNGJXNVZUbm96UkVkWVdXVkphRU55UTNFelZFRRAB",
            "text": "If you go you want Trevor as a waiter. He is super funny, and friendly… definitely will make you feel welcomed and happy! The food was very tasty! We got a few different appetizers, and desserts and it’s what you would expect for a NYC Italian place, not good, and not bad… just right in the middle! Definitely will be going back. And lastly the atmosphere is very claiming; there is so many relaxing paintings on the walls, and it’s just such a nice vibe!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poZk9WSnFTVWh4Y0VSbWJEWTBOVGRGYkRkTE0zYxAB",
            "text": "The pepperoni pizza and lasagna were to die for!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwc1VtbEZhVzR3TVVac2QweHZhM3B3TlVaVlkwRRAB",
            "text": "We called ahead to see if they could accommodate a dairy allergy and, although they did, the options weren't great. What they made was amazing."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzem9qd2l3RRAB",
            "text": "I’ve eaten here many times, since this is a restaurant area in the theater district and very close to all, and was here last ,two weeks ago. However, I didn’t call in for a reservations but since they’ve always sat us before, I didn’t think it will be a problem. Awful and rude hostess, she looked at us and decided, she won’t seat us or she was waiting for a tip. . We came in at 6pm and asked to be seated and the hostess said she can only sit us after 7 pm. We walked out. I won’t be back here. There are plenty of restaurants that can accommodate us. We found a wonderful restaurant just on the next street."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GQk5WQkJTMEp5VjNkcVJ6bEdZMGhhVjB0SWJGRRAB",
            "text": "Get the lasagna. Trust me (and my daughter). Incredible. How can a lasagna seem fluffy? Order it and find out!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wMGFtTkxTSGxtWlhoalZFaEhUMVZuVUhWME1IYxAB",
            "text": "I loved that place so much best location and food was great I loved the drink"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWlJ5MTBXR0UwTjNGbFNtVjJNREpCUVc1V05uYxAB",
            "text": "The scallop risotto is good.\nThe margarita pizza has syrup in it, so it’s quite sweet.\nOthers may not like it, but I kinda like it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205WVMzaE1ZbnBvYVU1c1RGZEhOV1ZhVEdSTkxVRRAB",
            "text": "Bond 45 is one of my go to restaurants in the theatre area.  I know the food and service will be great and the noise level is low enough to allow easy conversation.  This trip it was the wonderful bolognese that I enjoyed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WalEzaGhabFJ3UlV4clZYTkhTM05DYkVSQ2NrRRAB",
            "text": "Great Italian restaurant in the heart of Times Square. Service was on point, and the food was delicious. Antipasto vegetables is a must."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201dlkxSkRWMDEyVUVkZmNWUlBOa3BZTW5RMGFIYxAB",
            "text": "Se supone que teníamos descuento por parte del hotel, nos habían dado una hoja de información avisándonos del descuento y nos lo negaron en el restaurante."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CYU16TnNPRTA1Y1hJeFUyWm9aRzh4WnpCVGJHYxAB",
            "text": "wonderful lunch. Veal Milanese and Pasta Carbonara . Trevor was great and heldpul"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVFN6QTJTVFZ2VVd0Q1RERjZNbWx0VW5kU2FWRRAB",
            "text": "Bond 45 Restaurant at edison is the worst spot I’ve ever eaten at.  Somehow two orders of chicken and waffles with a side of bacon is 75 dollars.  Not even what we ordered.\n\nAfter asking twice for my syrup I had to get up and walk to the prep area to get it myself.\n\nTotally wrong order, cold food, waiter took 20 mins to give me syrup, never checked on us. And an order of Diet Coke apparently translates to a.  Cup completely filled with ice with a splash of Diet Coke on top.\n\nI always tip well.  But for you lady, you get no tip, just the shaft. Bad service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSSlgwMTFWbTVWVUVRNFJESnFPV0V6VWpaVlpuYxAB",
            "text": "Don’t waste a meal here!! Go 2 blocks south to carmines for MUCH BETTER and AUTHENTIC Italian food!\n\nWould have been just 1 star but the waiters and staff were very kind!!\n\nThe food here was expensive but tasted cheap! We ordered the meatballs to start— arrived cold, we sent it back and they brought it back warm. Service was great! Our waiter was kind and attentive!\n\n- also ordered carbonara - sauce tasted like—I kid you not— powdered Mac and cheese mix.\n\n- tortellini mozzarella - filling was good and tasted fine but the pasta was too thick\n\n- chicken parm was good but skip the side of spaghetti\n\n- they do serve coke products (win) but they are watered down (with or without ice still watered down)  :/"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkMWRFNUtlVXRUU1RsdUxVdHRPRVZIVGkwMFZIYxAB",
            "text": "Let’s start with the good. The Death Becomes Her mocktail was delicious. So was the 12” mozzarella stick and the meatballs. The okay: the chicken Parmesan wasn’t anything special, nor was the five pomodoro spaghetti or the carbonara (which only had two thick pieces of guanciale, making the entire pasta a bit lacking, but still tasty enough). The not so great: while I loved the meatball on the lasagne and the pasta was very tender, there was way too much cheese and not enough sauce (which is something I never thought I’d say). I’d go back for the meatballs and mozzarella stick, but I’m not sure what else."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xQ1ZsRXlUbmxsT1Zad1lVbGZVMUZrVkhneVFYYxAB",
            "text": "The restaurant is perfectly located if you're planning to attend a show. It has a lovely ambiance, and the service is great. My husband and daughter enjoyed their dinner, but unfortunately, I did not.\n\nI ordered a gluten-free pasta carbonara, but it lacked flavor. There were barely four pieces of pancetta, and the sauce was not the usual creamy texture; it was yellow and entirely liquid. Carbonara is my favorite pasta, and I knew as soon as the plate was set in front of me that it was a fail.\n\nI chose not to complain or return the dish because I dislike sending food back, and we didn't have time to wait for a replacement. Overall, it was very disappointing and quite expensive for what it was (2 pastas, arugula salad, and a milanesa)"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdGNuWjRhSFJhU2xaTmExOVlPVUZHYlhkeWRWRRAB",
            "text": "I arrived there for lunch just after 2 p.m., it was not busy on this Monday, a day on which many shows do not perform. The service was slow, my meatball appetizer arrived lukewarm and had little taste of meat. Upon entry, there are a lot of different vegetable items displayed. A person can order 1 for $13, 3 for $26. The red and yellow peppers combination had a lot of eye appeal so I ordered that by itself, it had little taste. After that, I was full, so I left. The restaurant is on 46th street between Broadway and 8th avenue, on the other side of the street of the Richard Rogers Theater (Hamilton is playing there now). There is a large painting in the back with images of famous people. It was fun to see if I could recognize them, it was not hard."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNlltRnljVTFEU1dGTldVdGtSSEV4Y2pCM2VtYxAB",
            "text": "The service was great.  They were friendly and attentive. They had a lot of pretty cool mixed drinks available that corresponded to the musicals playing on Broadway. The food was less than desirable."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSQmQxTmhhVEV3VldwS1h6WXRhVjl4VmkxdmRVRRAB",
            "text": "Broadway + Dinner + Eating A Lot of Food Drink Options Related to shows = Great Date with my partner."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaNjlfNE13EAE",
            "text": "환상적인 칵테일, 친절한 직원"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kcGR6VTBUMWhYVVZsclJURlZjbmxGWlRSTlFrRRAB",
            "text": "Dinner here was very good. Our favorite was the grilled artichoke. It was my birthday, which the host confirmed when we checked in, but the waiter never said anything about it. Just a weird situation for them to confirm it and then never bring it up again. Drinks were very good as well."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4amRtSmlaMWcwWTJkS2NGTXhVMk5SVEdoMlpHYxAB",
            "text": "We're frequent patrons of Bond 45.  The menu has evolved and that's expected.  Service this time was pleasant even if slightly below the usual top tier experience we usually receive.  Our appetizers and mains were exceptional as usual.  We'll be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUFZqaENXVTVoTUZOVlRDMUdla2RUWkVSMk9GRRAB",
            "text": "An excellent meal with fantastic service at Bond 45 New York. We really wanted Italian food and it was right across the street from our hotel.\n\nWe went for a late dinner during the Tony awards.  We made a reservation, and were seated quickly. We had tried to get in the night before, but it was booked, so having the award show helped us out.\n\nWe started with several appetizers, including the Burrata Caprese salad and shrimp cocktail. The Burrata Caprese salad was excellent and I really wish I had ordered a second one. The tomatoes were fresh and delicious. You should really try it out.  For dinner we had the filet mignon and chicken Parmigiana. For sides, we had the roasted heirloom carrots, brussels sprouts, and cauliflower Milanese.  The vegetables are fresh and you receive large portions.  For dessert we had the limoncello tart, which was outstanding.\n\nOur server was Margaret and she was outstanding, professional, and very attentive. She was engaging, and we had several very good conversations with her.\n\nOverall, the price point is high, but I think worth the money. The food and service were just that good and honestly our price point is skewed given that we had drinks and wine.\n\nOverall, a great experience, and we will be back the next time we come into New York. It was well worth it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvLWR6ZjF3RRAB",
            "text": "Went to dinner after seeing Hamilton Broadway show across the street. We receded quickly and our server was very attentive. Love all the choices on the menu so hard to pick. They have an awesome vegetable appetizer bar to choose from. Food came out hot and in a timely manner. I had veal Milanese with tomatoes and arugula very good.\nMy husband had pasta carbonara, which was creamy and extremely tasty.\n\nOur appetizer were the short rib meatballs, which were so tender and the sauce definitely complemented the meatballs.\n\nThe chocolate mousse is absolutely to die for the portion is enough to share, but definitely could be eaten on your own, lol. With delicious real whipped cream.\n\nHighly recommend this restaurant if you are in NYC."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLbm1qdXFTejRQeHFnRRAB",
            "text": "We were recently in NYC and had reservations at another local Italian restaurant …..they were completely overrun with guests and it became clear we would not be seated and served in time to make our 7:00 Hamilton show. We cancelled that reservation and resigned ourselves to fast food. But we happened upon Bond 45 right across from yeh theatre. It was 5:45 and the show was at 7:00 but I asked if they could accommodate a party of 3…. The host said “Let’s do it!” We mentioned to our server that we had 7:00 theatre reservations and he also said “Let’s do it!”. Around 5:55 we ordered our entrees and I kid you not….they were on our table at 6:04. Amazing service! The spaghetti with short rib meatballs was delicious as was the regular spaghetti with marinara. But the star was the carbonara. Best we’ve ever had! I will come back again to enjoy the amazing looking raw bar, marinated vegetables, cocktails and of course that carbonara!. Thank you for turning our night around and getting us to the show on time! This is what great service looks like !!! We will be back whenever we are in New York!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dExEbkNBEAE",
            "text": "I found this spot on a humble. After checking the reviews of other Italian restaurants in the area, this was a no-brainer.\n\nThe atmosphere was warm and welcoming.\nThe staff was very helpful with the food and drink menu. The service was excellent. They were very conscious of patrons with food allergies. The food was fresh, flavorful, and timely.\n\nGreat location, good food, drinks, and people. We will, without a doubt, be returning."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNNmt2ZUg4MVlPc0lnEAE",
            "text": "This restaurant impressed with its diverse menu and vibrant atmosphere. The chicken parm was perfectly breaded, tender, and topped with just the right amount of savory sauce and melted cheese. Paired with a couple of well-crafted mixed cocktails, the meal was a hit from start to finish. A great spot for both variety and flavor."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ei1xOWtRRRAB",
            "text": "Perfect spot to eat/drink before checking out a show at the theater. I was in town for the day to see Death Becomes Her next door at the theater and stopped here to eat before. I sat at the bar and was greeted immediately. They had themed drinks for the show which really added to experience. The octopus was absolutely delicious and cooked perfectly. The drinks were great. The staff was awesome, I left my purse in the bathroom and so glad they found it and brought it back to me at the bar, silly me. Some of the staff had seen the show and advised I was going to enjoy it as they did. Also ordered the lasagna as well which was pretty good too. Definitely recommend. It was a real busy street so I recommend getting dropped off at the corner and walking if you’re on a time frame."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMYXdyLWJycUpLV09BEAE",
            "text": "Shoutout to our amazing server, Trevor! Food was delicious and our experience was elevated by Trevor's attentive and excellent service. Will be back soon to try more of their yummy thin crust pizzas. One piece of advice if you are ordering pizza, make sure it is brought to your table as soon as possible as ours were no longer warm when it arrived, but still delicious!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VNMmZ0WXFCZ2VhOUVREAE",
            "text": "Was there for dinner last night. Appetizers is good , and it came promptly. Dinner was terrible, had the fish , it was salted and excessive tomatoes sauce, partner had the fresh dish, it was chewy and rubbery, it insipid, he ate nothing of it . Our server, ruin the entire experience, forget her name , she is the blond witn an Irish accent, she is loud and can’t fully comprehend her. After we finish with our appetizers, we were ignored for over 20 minutes, our main course never arrived until we had to inquired from the runner to send her and yet she never come to inquire from us . The  food is not worth for the price per an  insipid entree and Mediocre service . I would have never give gratuity , but my partner gives a decent amount. I do not recommend this restaurant."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcU5uYUxREAE",
            "text": "We came here for breakfast during our stay at the Hotel Edison.  Convenient location right off the lobby. Our room stay gave us a coupon for 6 dollar breakfasts. Simple and good breakfast.  Good Coffee. Great service.  Loved the decor on the walls. We also enjoyed a glass of Beleni with breakfast that tasted great!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVWMxSmlTa0ZXYzA5aGJtUkJiRTB5Wm5SV2QxRRAB",
            "text": "Very uneven brunch at Bond 45. Where to start. First they sat us downstairs where there was a private party complete with microphone and speeches. We felt like intruders. We asked to be moved, and they did accommodate us, but we were seated practically in a serving station :(\n\nBest part of my meal was the espresso martini with chocolate shavings.  The shavings were scrumptious!  A great touch was while waiting for our meal - fresh chocolate chip cookies from the oven were offered table side. We had a fantastic appetizer of  short rib meatballs! Perfect.\nBUT I was very disappointed in the chicken and waffles benedict. The hollandaise sauce was barely on the eggs. The waffles, which were supposed to be challah bread as stated in the menu, were cold in the center. I was never asked to substitute waffles for challah bread! The chicken in the other hand was crispy and tasty. It was a ok meal. You don’t leave hungry, just not what you’re expecting. My husband had the Bella Benedict. It was a poached egg, Italian ham, mozzarella,parmesan hollandaise and potatoes. The bread was very dense but at least he had hollandaise sauce.\n\nDesert was yummy! We had the limoncello custard tart. Oh so good, custard was nice & tart and the caramelized sugar on top added just the right amount of sweetness and crunch.\n\nFor the amount of money we spent, the expectation was for a bit better meal.  Bond 45 is a bit tourist-y (our mistake).\n\nOne footnote that amused us greatly: someone at the table next to us had a birthday.  And the waiters assembled to sing this:\n\nHappy Birthday to You,\nHappy Birthday to You,\nHappy Birthday, Total Strangers!!\nHappy Birthday to You!!!\n\nBond 45 scores points for that!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJN1BEZlVREAE",
            "text": "Eating at Bond 45 was a terrific experience! The food was amazing! I had the home made  fettuccine noodles with the bolognese sauce. This dish was recommended by our server, and he was absolutely right!\n\nThe serving staff was fantastic! They were friendly, insightful, and there was always someone coming around to freshen up our beverages.\n\nThe atmosphere was a relaxing and classy.\n\nThe price matched the environment and quality, would definitely recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQMjFudm1jajRpT0dnEAE",
            "text": "I purchased a $40.00 pizza that arrived cold and lacked flavor; I strongly advise against ordering from this establishment. My wife picked up the order from the restaurant adjacent to Bond45 after placing it online. Upon arrival, the pizza appeared stale and cold.  After returning the pizza and explaining the issues—its temperature, appearance, and missing items—the manager claimed it had been sitting for an extended period.  I presented the order tracking information to refute this, at which point he agreed to prepare a replacement. However, instead of making a new pizza, they simply reheated the original and returned it. This represents the worst customer service I have ever encountered."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydnVmQnJ3RRAB",
            "text": "Bond 45 is located right in Time Square by the Marriott Marquis New York, an awesome location for catching a meal before and after a show on Broadway.  The restaurant is set up with very close tables, and the noise level is very loud.  We arrive on-time for our reservations and were greeted and seated right away.\n\nThe server came by right away for drink orders and provided us ample time to review the menu.  We went all out on the meal, with a 3 choice Antipasto tray, Toasted Gorgonzola Loaf, entrees of Lasagna, and Veal Cutlet Milanese, and ending with a slice of Cheesecake.  All the food was good, but the Gorgonzola loaf was an outstanding item with a loaf of bread stuffed and baked with cheese, very decadent.  The portions were generous, and we left satisfied. Overall, the service and food were well done, and was worth our one-time visit.\n\nTips for your visit: This restaurant is popular, so make sure you make reservations, and be aware this has a loud volume atmosphere venue for dinner."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSM0xUbFFkWFJYVUZCRmFXaGFRbVJHV0ZKZlIyYxAB",
            "text": "We celebrated our anniversary last night at Bond45. Had the most delicious dinner of porterhouse for 2. Impressive display of the steak with arugula and roasted potatoes. Sorry I didn't snap a before photo but was anxious to dig in to that beautiful steak. It was the tastiest steak, so tender and delicious. We were not disappointed. We chose roasted asparagus and peppers as our sides to accompany this tender meat. The service was top notch. Jessica was our server and was kind and very accommodating.  Knowing it was our anniversary we were seated downstairs at a small table, we were approached by the maitre' d and asked if we wanted a different table so we could sit across from each other instead if next to each other. We declined. When another table cleared we were again asked by our waitress if we wanted to switch tables. We were too full for dessert but we were surprised by a delicious chocolate mousse and whipped cream dish that had a sparkler on it along with 2 glasses of moscato on the house to celebrate. Jessica then asked if we had our phones to take a picture for us. We made the right choice by celebrating at Bond45. Great service, atmosphere and food. Thank you for making our anniversary dinner so special. We would highly recommend Bond45."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WblkyVnNORXRrTlZCZlFtaGlTSEZYUkRWaVUyYxAB",
            "text": "My family and I decided that this would be a good place to try before going to see The Great Gatsby. Let me say it exceeded our expectations! It was a late birthday trip for me and they mad it very special! The food was great and so was service! Special mention to our server JJ. He was wonderful!\nHighly recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ajRIQVFBEAE",
            "text": "My boyfriend and I came here for dinner while on a little vacation, and I’m so happy we chose this restaurant! Kevin was our server and he was amazing! I got the truffled fettuccine alfredo, and it was one of the best dishes I’ve ever had. If I’m ever back in the area, I will for sure be stopping here!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbEwzVTRRRRAB",
            "text": "I visited Bond 45 a couple weekends ago after seeing Death Becomes Her and was looking for a chance to wait out the snowfall. My party and I sat at the bar and had the opportunity to be waited on by Ava. We were not disappointed!! Her knowledge of the menu was refreshing!! She suggested the best food options after hearing what we were interested in and made amazing drinks! We all had a different drink themed after the play. With her assistance, our night at play was completed with great drinks, amazing service and good company. Thank Ava, for making our night one to remember!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNmUyMWVBEAE",
            "text": "Service was great, and the pizza was really good! But the crust is cracker thin and not worth $28. The lavender mocktail was very tasty but $10 for a non alcoholic drink is insane! I’d go again and get the lasagna."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNk1PVjRBRRAB",
            "text": "The food was good. Pizza was mediocre. Not worth $25 for cheese and one basil leaf. Veal chop had way too much breading. I would have liked to taste the meat. Cheesecake was delicious. Waiter was sweating profusely and was a little too busy to be attentive. I don’t think I would come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzek9HanVBRRAB",
            "text": "Stopped in for a drink only.  Food looked very good. Bartender was funny and attentive. Would definitely come to try the food if I needed a place to eat before a show.  They have a downstairs area which looked fun and they have live comedy shows. Am definitely going to look into that."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdTh5Tl9RRRAB",
            "text": "Very nice experience. Friendly staff from front to servers and bus staff (huge shout out to our super friendly and attentive bus person from Bangladesh, he was amazing!).  Great food, recommend the pepperoni pizza and house salad. We also had two aperol spritz and they were really refreshing as we came during the June heatwave. Thanks for a great time, we will return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEallmdEN3EAE",
            "text": "Popped in here after seeing Water For Elephants.   All the food choices looked good so I asked the bartender to help me choose.   I went with the Ravioli.   It was cooked perfectly and so delicious.    I would definitely go again the next time I am in NYC."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJelNoNEhxbl9ub09nEAE",
            "text": "I brought my Italian wife to NYC for Mother’s Day. We spent all day today walking around the city and I suggested we go to a comedy club to eat. My wife didn’t want to and we compromised and we decided to go to a regular restaurant. After walking all day we were so tired that we decided to eat in the restaurant near our hotel. Bond 45. We ordered the 12” mozzarella stick which was great. And we split what “New York Magazine” claimed is the best Pizza in town. My wife and i after getting the pizza, asked the waiter if the chef has ever seen a pizza. The waiter said that the chef has. We told the waiter this “pizza” is not even a pizza. It was basically a circular piece of Jewish crackers, the matzah cracker and some melted burrata cheese with prosciutto.  The waiter told my wife that they make it exactly like it’s made in Italy. At the end of the day, it seems we ended up in a comedy club after all."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnLWZpMVFBEAE",
            "text": "Food and Atmosphere were great! Portions were a great size for the price. Drinks were yummy! Thank you Henny & Alex, at the bar and table for your service and conversation. Chicken parm was delicious, cheese cake amazing."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNHJTcXZRRRAB",
            "text": "Spectacular from the outside.\nThe interior is very nice.\nThe staff is a bit arrogant. They want to sell Italian cuisine, but have little to do with it.\nThe food is also overpriced (perhaps due to its proximity to Times Square)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMjZmSFhBEAE",
            "text": "What a great spot! I went to a private party here, the food was really wonderful. The drinks were well prepared and good selection for an event (Thank you to Chandon sponsor). The food was delicious! A really lovely selection. My only complaint when having an event like this… the food is presented for the visual display more than convenience of serving oneself."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNybDh6Z1JnEAE",
            "text": "Had a great meal at Bond 45! Our server quickly asked if we had theatre that night, which was wonderful because he ensured we got out on time for the show. Our server was friendly, personable, and attentive. The food was AMAZING!! One of the best meals I’ve had! Definitely recommend if you’re in the theatre district!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLRHp1NFRnX1BlNWhnRRAB",
            "text": "We were in New York for 2 weeks and had to go twice. This place has amazing food and is definitely worth the visit!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdC1DMXpnRRAB",
            "text": "Good food & drinks, great service, big portions, prices are a little inflated but that is to be expected due to its location in Times Square. Our sodas were a little flat. Carbonara was delicious. The pizza is thin crust and reasonably priced compared to other restaurants in the area. The chicken parm was HUGE and tasted great, but bit of a bummer that a side of pasta is an extra $13. Overall a good choice if you’re looking for a sit down meal in Times Square. Oh and don’t skip on the Chocolate Mousse, honestly some of the best I’ve tasted and the portion is huge! More than enough to share among 5."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMHQ3a1hREAE",
            "text": "We were sad we didn’t get a reservation at carmines on Christmas Eve but I’m sure this was better. No wait. Excellent service and even better food. The chicken parm is a must and the cheesecake melts in your mouth. Truly a beautiful restaurant all the way around."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJckk2ZWxBRRAB",
            "text": "Great service and solid quality food options make this an excellent choice before or after catching a show on Broadway. Portion sizes are generous so plan on sharing or taking something home."
        }
    ],
    "reviews_count": 84
}