{
    "name": "estiatorio Milos Midtown",
    "place_id": "ChIJbRaexvlYwokRYc5RgUjlsIY",
    "grid": "MN5",
    "address": "125 W 55th St, New York, NY 10019, USA",
    "rating": 4.5,
    "user_ratings_total": 2278,
    "phone_number": "(212) 245-7400",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKeWFXUTBNVFk1T0VWemNGSjNNRUZVWTNab1JFRRAB",
            "text": "Some of you know I have travelled extensively around the world running marathons etc and I have had a lot of dining experience. This authentic Greek restaurant offers excellent personal service, pleasant ambiance and fine dining at its best. They have really ‘nailed it’. I can think of maybe two or three others I have been to that match it. If visiting Manhattan and looking for somewhere special to dine I highly recommend Milos. 🐟 🦀 🦞 🍆 🍾🥂"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NNVZ6STNVVXd6U21oa1gyWm5WV2RWTjNKS01FRRAB",
            "text": "Tried salmon tartare, grilled octopus and salad with grilled vegetables and cheese. Then had coffee with and a walnut pie (I see on the photos that it’s usually served with ice cream, my pie wasn’t served with ice cream tho). Food quality was good, but portions are small and very overpriced. The vibe is meh, service is meh as well. I know a much better Greek restaurant in Forest hills, Queens."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUGJIaFpXbnBDZFVGd1pIRlFRaTB0VG1WWmNVRRAB",
            "text": "I was there many years ago and felt it was a little cold the atmosphere, but I was pleasantly surprised the other day. It was very warm. Multiple people were happy having dinner there and the service was excellent."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WYU1uWTBPRVUxZURWUFNVbHdjak5DTXpGSlFVRRAB",
            "text": "Was good service, main dishes they brought was not hot even we choose Fishes by pound as special order! Wine was ok! But bill was shocking, average for person we paid more then $ 200 plus tips!\nNot recommending at all!"
        },
        {
            "date": "5일 전",
            "language": "it",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oMFFVUnBWRVJVVkdwME1XYzFUMFp4UTNoUlkyYxAB",
            "text": "Già provato 3 anni fa, sono stato felice di averlo ritrovato ed esserci tornato.\nBravi nel servizio e cibo ottimo, da provare assolutamente !!!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJNFJHRmFPSFZCWkZKV1VGRnJRMlJEZW5GcFFrRRAB",
            "text": "The food exceeded all our hopes."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdmFHOXZibUZ6YW5sS1RtcHZaMkZTTkc5S2QwRRAB",
            "text": "I usually come here every time I come to NYC, it is one of my favorite restaurants. This time our waiter was extremely rude, the other staff where really nice to us, but the waiter in charge or table was rude. There was a poor offer of fish available. Hope next time is better."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZeGVsUnVUWEpXWWt4dGNIRkxiMFpYTUZGMVpFRRAB",
            "text": "The dishes tasted fresh, the staff helped us well, and we had no complaints. The meal was decent but didn't match our best experiences. Their staff demonstrated both genuine interest and friendly manners. This place creates a good environment. I'm making plans to return soon."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3N2N5aW5RRRAB",
            "text": "Milos is one of the best seafood restaurants I’ve ever been to. The service, selection of fish, and appetizers are amazing. Everything I ate was fabulous.\nIt has two menus: one called the Pre-Theater Menu, designed for people who need to attend a show after lunch in Broadway where it is 7 min far away walking and the original menu. The concept of these menus is really nice and practical."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oa2FrVlFNRXBvVG1WUlp5MDFSRE0wU1cxU1RYYxAB",
            "text": "From the moment I walked into Milos Midtown NYC, everything was pure perfection. The atmosphere was elegant and inviting, the service attentive and gracious, and the food absolutely extraordinary.\n\nA heartfelt thank you to Biron, Fotis, and Vasilis who made my evening unforgettable. Biron greeted me with warmth and genuine hospitality, Fotis ensured everything was timed perfectly and made wonderful recommendations, and Vasilis added charm and expertise that elevated the entire experience.\n\nEvery dish was exquisite, from the freshest zucchini flowers to the perfectly grilled octopus and the decadent espresso martini and delicious rose wine from Greece. The attention to detail, the presentation, and the flavors reminded me why Milos stands among the very best dining experiences in New York City.\n\nI left completely impressed and can’t wait to return. Milos Midtown is truly a masterclass in world-class dining and hospitality, thanks to an incredible team that goes above and beyond every time."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUVRrZDBNM3A2Um1obGIwdDFYemRuWjJSa0xYYxAB",
            "text": "A team that's knows the service dance, authentic and having fun."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2treVVtcEpNRFI1VFhNd1FXOXJVMkZXT0VNek9FRRAB",
            "text": "Came here as part of a special weekend in NYC.   We had a very wet weekend with a Nor-Easter blowing in and decided to stay close to the hotel.   This place is better than anything we experienced in Hells Kitchen.   Food was very memorable with a delicious cheesecake to punctuate the evening."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OUWFITlRlVTl1ZWtaR1NuVmplV05KZFc1VmQyYxAB",
            "text": "This was a really elegant dining spot. The food was great, the atmosphere and the service as well. We celebrated our friends birthday. This restaurant fitted perfectly for this purpose."
        },
        {
            "date": "2주 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvNFNHNWZRM0ZOUVVKSk5VcENWWHBuVDFsRWRXYxAB",
            "text": "전체적으로 해산물이 신선합니다. 재료 자체의 맛을 내려고 하는 접근이 좋았습니다.\nCrab cake, Robster salad, 굴, 관자요리 등을 먹었고 모두 좋았습니다.\n양이 많은 느낌은 아니지만 저에겐 부족하지 않았네요.\n직원분들도 친절합니다."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoUGIwcDFjVkE1ZW5WRlpGWk5NRW93Y0V4cFRGRRAB",
            "text": "Delicious food, I tried the oysters, salmon sashimi, salmon and tuna tartare, ceviche,  grilled octopus, calamari, lavraki, red snapper, lamb chops, and the rib eye.  Great fresh fish, delicious rib eye.  Was a little loud but overall good food.  I wasn’t paying so I have no comments on the price."
        },
        {
            "date": "3주 전",
            "language": "el",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCSWRXbHZXR2sxYzBOTWNtZERRV280ZW5KV1VrRRAB",
            "text": "Very nice service. We like the Soutzoukakia Smyrneika (σουτζουκάκια σμυρνέικα) very much."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxU01tbENhWHBaVmxkcFlsUmFRM0ZPY21Kd2NHYxAB",
            "text": "Great food, delicious flavor combinations, beautiful atmosphere, and amazing customer service.\nThe location is excellent as well — super easy to find, especially if you’re coming from Central Park and looking for a good meal.\nWe had the three-course menu and it was fabulous! The fish was incredibly fresh (you can even see it near the kitchen), and the presentation and taste were impeccable.\nI recommend making a reservation in advance since it’s a busy place.\nNext time I’m in New York, I’ll definitely come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMllVeEVXbkZqYTBndFZtWjVRekZ0T1hsU2NrRRAB",
            "text": "Love it the food was so fresh & delishhhh"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0V2VWcGZTMmt3TkVwTGRXOUZSMnBwWTJwU2EzYxAB",
            "text": "Fantastic!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GeWFHTk9iR3BCVjNWYWJWcEVVRUoxZWswM1YyYxAB",
            "text": "Great food and very attentive staff. We made a reservation with a party of 5 as all of us were going to Masquerade held a block or two away from this restaurant. We were asked upon entry if we were going to a show and we informed the staff we had to be leaving an hour from our entry. We were brought full service and attention by the staff with amazingly tasty food. We did not order courses but rather shared plates family style. The Milo special was delicious and the ribeye was cooked to perfection. We ordered other items but those two were the highlight for me personally.\n\nLadies, if you want to dine some place close to Masquerade and will dine in your fine attire, this is a marvelous place to eat and rest before your event. We dined at 5:30pm, left at 6:30pm and we were one of the first in line for our 7:15pm showtime. Delicious food to share amongst others and very professional and attentive staff (not to mention beautiful interior and other similarly dressed people, your sparkly Ladivine dresses will be perfect here)."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xad09FVk5UbUpNV2tJM01uaHhlVkZ3YUdneFNIYxAB",
            "text": "Superb Greek food. Fantastic taste and atmosphere."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OalkyaEJOalZKV1V4SFRHRk9VbEZIVmt4VVQyYxAB",
            "text": "I came here with a group of coworkers on a Friday afternoon and it did not disappoint! You can't beat the lunch special here which comes with an appetizer, entree and dessert. I opted for the octopus appetizer which was cooked perfectly, the tuna burger and a walnut dessert. There are some dishes that come with an upcharge but they looked worth it in my opinion. If you're looking for a fresh seafood restaurant in midtown, this is the spot."
        },
        {
            "date": "1달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xocE1FcGhPRll6Y0ZaTGVFdzRTRk5sZGpaSGNHYxAB",
            "text": "Yemekler harika, ortam güzel ama fiyatlar çok yüksek. İyi yiyip içtiğinizde, kişi başı 200-300 arası gelebilir."
        },
        {
            "date": "1달 전",
            "language": "ja",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVlpFUjBTbXRsT1c1TldtTnVhREY1TW1OVGFuYxAB",
            "text": "美味かったよー"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MFlsRk5NRWMyYTBWRU5qRnpURk5oU0Y5Mk5VRRAB",
            "text": "The food was fantastic but the service was terrible. Probably because it was so loud they couldn’t hear.  We were in a group of six and could only barely talk to the person next to me. It’s such an easy fix for them to put acoustic panels up on the concrete ceiling it would really change everything. I won’t got back as it is."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUGMxOU9RbVZYVTNVeFlXNTVlRFo2YTNNMlRYYxAB",
            "text": "Nice food but very loud. Can't understand your own word"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkc09URlFia0ZmVlhCaFFWVnpVak42U0hoaWNGRRAB",
            "text": "Sure, the food is good—but DEFINITELY not $1,000-for-two good. The location is rough (hello, it’s midtown), and the crowd is exactly what you’d expect: escorts, finance folks after work, or older men with their second wives. Truly a hidden gem for tourist wandering around midtown though!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWalMxUXpaRXhOT0Vka2JFRkJZMGRPTVRkUlozYxAB",
            "text": "Good Mediterranean food place. Unfortunately limited vegetarian options but whatever i ate was good. Place is a little loud (maybe need some sound engineering), tables are very close to each other and difficult to have a conversation."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsbFYyVnhZMVo1VnpOclIwZHpZWFI1ZEhZNFQyYxAB",
            "text": "Nice people and amazing food. The baklava was amazing and so were the raw fish dishes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SV1pVTnRVbXRJT0RZd1IzVnROMGhVUW1wUFMzYxAB",
            "text": "The entrees are pricey but the service was sub par at this price point.\nDirty plates sat in front of us for 25 min and we were never asked if we wanted a second cocktail. We paid, left and went across the street for a drink. Very disappointing!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKaVZtMVVhVUl4VTNWS01HTlFSREI0ZDBaWVlsRRAB",
            "text": "Milos Midtown is my favorite restaurant in New York.  The service is always impeccable, the ambience is excellent, and the food is outstanding. I would eat their Milos special (zucchini tower), their grilled lavraki (branzino), and **especially** their lobster pasta for breakfast, lunch, and dinner every day if I could."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SWGJtd3RVVXN3YTJGNWVtSlZjMnBQVFRaRWJYYxAB",
            "text": "I like  to b thank  Mr. Josue and  Mora for  their  excellent  service and  care"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201T2MwcFFjRkZJVDNVeFJGUmpVblEzUWkxdVJsRRAB",
            "text": "Very relaxing atmosphere and … that’s what I call a tomatoes! Fresh salad and fish. Friendly waiter"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoTVVrOVdXa1ZoYmpWVFlVTlRaa1oyYURGRWIyYxAB",
            "text": "Good food and service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKalprbFVTakoyY0d0ak1USnRVUzFOUzI5NmRXYxAB",
            "text": "Some of the best seafood in NYC! Love the open air fish market aspect where you can choose your fish. Expensive but definitely worth it! Excellent Mediterranean cuisine.\n\nWe have held several private events in the room upstairs. The menus are excellent and the staff is very easy to work with for a private event."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVNGREVmhibVp5V2xsUGJrTmpaREIzU1dWYVlrRRAB",
            "text": "Classic Mediterranean spot - definitely the OGs of elevated Mediterranean but prices are WAY too high for the portions. The decor inside is very lackluster. Service was great though and the team members were very attentive. Suggest trying the Tartare, filet mignon & crab cakes"
        },
        {
            "date": "2달 전",
            "language": "zh-Hant",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkS2NTMWplVlpZWTJoUE5FSnZWa3BGV0hWR1FsRRAB",
            "text": "食物口味尚可\n魚口感偏淡\n生蠔非常小顆，沒有甜美味"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoZlQzb3pNakkwVWt0ME5WOURUVFZ2V0VsdVUzYxAB",
            "text": "Excellent food and very very welcoming staff"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRk56VkpRalF6TUZoMldrbDRSVTVsTVhaaGFYYxAB",
            "text": "“I went with my wife, and it was an unforgettable night. We began with fresh Oysters, followed by the Grilled Octopus on Fava, an exquisite appetizer that set the perfect tone for the evening. For the main course, we enjoyed the restaurant’s most exquisite and expensive dish — the Bronzino, perfectly cooked and bursting with fresh, delicate flavors. The wine selection complemented our meal beautifully, and every course felt like a celebration of taste and freshness. From the warm ambiance to the attentive service, everything exceeded our expectations. Truly one of the best dining experiences we’ve ever had.”"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaTllUWnZNbUZyTkVoUWIybGpVazgxTFVGMWEzYxAB",
            "text": "This place is an absolute gem! From the moment you walk in, you’re welcomed with warm smiles and a cozy, inviting atmosphere that instantly makes you feel at home. The food is simply outstanding – every dish is fresh, flavorful, and beautifully presented. The grilled octopus was tender and perfectly seasoned, the moussaka was rich and comforting, and the Greek salad tasted like it came straight from the Mediterranean. Portions are generous and the ingredients taste incredibly fresh. The service is exceptional – attentive without being intrusive, and the staff truly care about making your dining experience special. Whether you’re here for a casual lunch or a romantic dinner, this restaurant captures the true spirit of Greek hospitality. Highly recommended!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wemQySXRhVGczWlVJMFRFMHlORE5CUzFkWVVGRRAB",
            "text": "Amazing!!! I didn't expect to find a restaurant in the middle of NYC, where they would have such rich selection of very fresh fish from all over the world, beautifully displayed on ice like you're on a market.\nWe had soft shell crab, a tower of zucchini with fresh cheese and haloumi, a \"simple\" cucumber and tomato salad with feta cheese as starters. As a main we had two types of fish, which were prepared as a ceviche. Wow! So fresh and so tasteful!"
        },
        {
            "date": "3달 전",
            "language": "ar",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WeGEwNVFhbFo0TURjMk9FZHdUbFJtZGpseFQwRRAB",
            "text": "👍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5S2RXUmlNMk5oTVRoa01uQlNiRkpRU25ONVIwRRAB",
            "text": "Very good after theater option (especially if your play ends late)."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nd2FqRmtOMDV5TlZCME4xUlpZWFp2ZUhwMlpsRRAB",
            "text": "Excellent Lobster pasta"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJMlJHc3lhalZXVGtsQ1JtaFdZbU5ZVTBvMFRYYxAB",
            "text": "Ambiance number 1! food is fresh and delicious!\nalways good spot to take my guests"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5d2QwUTNibE5VTTBOVFlYVlhlazFSVEVFdFRIYxAB",
            "text": "The grilled whole fish is perfection.  Never had a bad meal at Milo’s!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xRVJ6UlphRXN6YW1KaFVIZHhNVEV0UkhkRVUyYxAB",
            "text": "Everything was prepared to perfection.  Rib eye, tuna steak, stuffed zucchini flower, steamed beats, and beans.\n\nThe oysters were east coast.  Not their fault, but I always forget to not order East side oysters….they simply lack depth and taste."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSNUxVMXhlRjlpVWpoWGRrWTRjbGsyYXpoc1JHYxAB",
            "text": "This is a true dining experience. The food is exceptional and the atmosphere relaxing. I will definitely go back the next time I am in New York."
        },
        {
            "date": "3달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkcmJsbHFUMVJ4TlhWU05YRm1kSFZvT0hWMU9YYxAB",
            "text": "Gran bel posto. Cucina greca e ambiente newyorchese."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poT1lYbDZOVkZsZVZkSllrc3dSRUZ4YzNWZmFXYxAB",
            "text": "I can’t say enough great things about this restaurant! The food is consistently delicious, the atmosphere is cozy and welcoming, and the service truly sets it apart. I especially want to highlight our amazing waitress—she’s always so kind, attentive, and goes out of her way to make sure we’re taken care of. Even when we’ve made last-minute reservations or changes, she’s been incredibly accommodating with a smile every time. It’s rare to find that level of genuine hospitality these days. Highly recommend! Mimoza thank you for always being such a sweetheart. You’re probably the reason why I’m here four days a week."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWLTlqWXBnRRAB",
            "text": "이곳의 해선물은 신선합니다.\n요리도 맛있고 사람들이 친절합니다.\n저녁보다는 낮에 가면 좀 더 조용하게 즐기실 수 있습니다."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvNDkzeW9BRRAB",
            "text": "뉴욕 출장와서 먹은 첫끼!\n\n깔끔하고 맛좋고, 분위기도 고급지네요."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvc2YtcGxnRRAB",
            "text": "맛있고 친절합니다 소바 짱"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOZmE0X3ZNbU9MNFB3EAE",
            "text": "Came here with hubby for our anniversary after watching a Broadway show nearby. Place did not disappoint-- can always count on this restaurant for good food and service and ambiance. Place feels fancy but the staff/servers are not stuck-up.\nMy only gripe is that it is sooo pricey, if ordering a la carte.\nThe fresh caught fish from the selections was anywhere from $70 to $95 -- a POUND!\nWhich would make a 2 pound Branzino $200!!! Now, I LOVE branzino but there is no way in hell that I'm paying $200 for it!\n(Besides, I make whole Branzino at home regularly, so it's certainly not a novelty for me.)\nOn that note, they were very smart to do a pre-theater menu for $65 (albeit with smaller-sized dishes, which was actually completely fine), which draws people in, I'm sure.\nWe ended up doing one pre-theater menu - 1 appetizer, 1 main dish, and 1 dessert (had the grilled octopus, which was delicious and the Dorado, which was good but not great, and the cake with ice cream, which was very good) and a few dishes a la carte. We had the Greek Salad, which was delicious, the giant prawns (too chewy), and the scallops, which were divine! Also had the dip trio, which was very good!\nBest dish, hands down, was the scallops!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzeGVWUllaRkZsVWtKbllURkZMV1l4U2twbk4zYxAB",
            "text": "Dined pre-theater $65 for 3 courses. Seated in an awkward tight corner next to the waiter station. Enjoyed the octopus, not much else. Fish was missing ingredients, fries soggy, dessert basic. Place was packed by the time we left. Maybe try a different menu. (3/8/2025)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMnV5aklnEAE",
            "text": "I had an issue when I first sat down. Very high number of the best specialties were for multiple oeople. Being on a business trip, I was a single diner. When I got up to leave, and rip the waiter for his trouble, he insisted he could solve it. He personally found a smaller fish from their huge selection and customized a full off menu for a single diner. That customer focus is what takes a restaurant from great to absolutely spectacular. And the service continued at that level throughout the entire meal.\n\nNow on to the food..\n\nThe ceviche was beautifully presented and the flavors on point. Just enough acidic to complement the fish and and the herbs and beans..\n\nAdd the fresh artisanal bread and the strong Greek Olive Oil to the massive Greek salad and it was almost a meal in itself. And note the fresh herbs cut at the table into the olive oil. None of that weak 'pale' olive oil. This had that robust flavor you expect. The salad had a lot of tomatoes all of which were heirloom varieties. And the entire salad was dressed as it should be. Enough to be noticible but as a support for the natural flavors of the fresh ingredients.\n\nAnd finally the fish arrived. Gently cooked with a nice does of herbage, olive oil, and capers. The flavors of the fish were spot on, accentuated by the herbs and olive oil but not overwhelmed. A stunning presentation of simplicity. And even the accompanying steamed vegetables were well cooked but still had that womderful crunch of not being over cooked.\n\nAnd througout, severs came by, managers stopped by, and yiu could see the passion for the customer from top to bottom. So nice to find a restaurant that cares.\n\nMy only regret is coming alone so I could not sample more of the menu items as I watched some very appetizing and intriguing ones go by. And watching the precision, having done a few myself, of the serving of  the salt baked fish.....\n\nThis is one of those places you never forget and always recommend.. Bravo and accolades to everyone here"
        },
        {
            "date": "6달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvLThYR2JnEAE",
            "text": "Ristorante eccellente front desk un po meno. MA IN COMPENSO si merita un 5 ⭐️ piatti e sapori che risaltano la Grecia e non solo. Una bella degustazione di piatti che merita farla.\nAbbiamo assaggiato di tutto.\n\nNY is the best even in catering."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLV2N6SVNBbU8tSHJ3RRAB",
            "text": "Milos has many locations. Even in NY there were 2. But I went to the location in Midtown. Been to the locations in Vegas and Miami as well. My fav location would be the Vegas one. I normally order the same thing every time I’m there. But sometime their seafood if not in season the time I was there then I just switched to other dish that were available. I love their Greek salad and Greek yogurt. First time tried their stone crab and it was not as good as how I was expected. They weren’t sweet. That’s the only dish was ok. Other dishes they were phenomenal like lobster spaghetti, grilled shrimps, octopus. I had their seabass at other locations was very tasty. One of my fav restaurant that’s why I have been to 3 locations so far when I was on my trip. Overall everything is excellent. As for parking. We walked or uber. Cuz it’s hard to find parking in NY and they cost an arm and leg for paid parking Lol."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VOU294TlNBMnJYY09BEAE",
            "text": "We recently dined here as a family of five. While the food was indeed good—fresh fish, well-prepared lamb chops, and thoughtfully composed dishes—the prices were exorbitant to the point of absurdity.\n\nOur bill totaled over $700, and unfortunately, the experience simply wasn’t worth it. For context, we regularly dine at high-end establishments in New York City, Washington, DC and other destinations, and are more than willing to pay for exceptional food and service. But $97 per pound for prawns? $33 for an appetizer with just two tiny scallops? A $76 lamb dish that, while good, wasn’t close to justifying the price tag? It felt more like sticker shock than fine dining.\n\nService was excellent—attentive, knowledgeable, and polished. But great service can’t make up for poor value. The acoustics were also a major issue. The space is loud, with nothing in the design to absorb sound, making conversation at the table frustratingly difficult. Add to that a lax approach to the dress code (one diner was in a wife beater), and the ambiance suffers even more.\n\nBottom line: we had a nice meal, but we won't return. There are too many restaurants—locally and beyond—that deliver on quality, atmosphere, and value without leaving you feeling like you've been taken advantage of."
        },
        {
            "date": "5달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLV3l2WkRib1lPWHdBRRAB",
            "text": "Milos Midtown’da geçirdiğimiz akşam, New York’ta unutulmaz bir fine dining deneyimi sundu. Mekânın modern ve ferah tasarımı, sıcak ve profesyonel servisle birleşince baştan sona kusursuz bir akşam oldu. Taze deniz ürünleri, özellikle de levrek ve ıstakoz, muhteşemdi. Balık tezgahından seçme imkanı, deneyimi daha da özel kılıyor. Tatlıdan servise kadar her detay özenle düşünülmüş. New York’ta kaliteli deniz mahsulü arayanlara gönül rahatlığıyla tavsiye ederim."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdXE3OTdnRRAB",
            "text": "I had an amazing dining experience at Milo’s! The seafood was incredibly fresh and cooked to perfection—every bite was bursting with flavor. The quality and presentation of the dishes were outstanding. On top of that, the service was impeccable—attentive, friendly, and professional. The entire experience exceeded my expectations, and I can’t wait to return. Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMcm8zTGVwN05yWXd3RRAB",
            "text": "Food is delicious, service fantastic. There’s just the level of noise, it’s really difficult to talk normally. That being said, the tomatoes are always the best ever and the variety and quality of the fish, always perfect."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURROGIzU0Z3EAE",
            "text": "This Mediterranean spot had been on my list for a while, and I finally got to visit on International Women’s Day.\nWe arrived early and the place was packed. There was a long wait, even with a reservation. While we waited, we enjoyed cocktails at the bar, explored the fish market's impressive seafood selection, and chose our fish. Our table was finally ready 15 minutes past our reservation, and we were seated downstairs. The upstairs ambiance felt more lively, with high ceilings and Mediterranean-inspired decor, while downstairs was quieter and more intimate.\n\nWe ended up ordering the following:\n-Greek salad: was fresh, especially the juicy tomatoes. However, the menu says it serves two to four people, but realistically, it's perfect for two.\n-Lobster pasta: very good! The lobster was perfectly cooked and beautifully plated with its tail and head. Originally, I planned to get this as my main while my friend was considering the whole salt-baked St. Pierre fish. Our server suggested sharing the pasta since it was $77 per pound and required at least two pounds (a huge portion) —bringing our total to $215.\n-Karydopita (a traditional Greek spiced walnut cake with honey lavender ice cream): the ice cream is only available at lunch, but our server kindly made an exception, which was much appreciated—it really balanced the flavors.\nThe sommelier guided us toward a nice bottle of Greek wine to complement our meal. Also, their complimentary warm bread with Greek olive oil and microgreens was a great touch.\n\nService was friendly, knowledgeable, and patient, answering all of our questions about the menu and offering great suggestions. Our server was extremely attentive and ensured we had everything we needed throughout the meal.\nOverall, the food was fresh and high quality, but we felt it was a bit overpriced. The long wait was frustrating, but the overall experience was enjoyable, and I’d recommend it for a special occasion."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNydktfU0l3EAE",
            "text": "The atmosphere is very nice and open. The service was great. They took us to the booth to pick our own fish. And choose what we want them to be cooked as. The food was really good and we also choose a great chardonnay to go with the seafood. For the dessert, the creamy pastry is really great. I would bring my parents here next time"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuLVBHYXRnRRAB",
            "text": "The dining room has not been updated in 25 years since it opened. The food is very good but not amazing. Picking out your own fish is silly and ends up feeling like a rip off on price. The salt baking takes an hour and can only be done with very expensive larger fish (not worth it, grill is best preparation).  Tomato salad is their best item. Fries are $15 per serving!! The zucchini chips are $30 each!  Everything is a la cart. Desserts are disappointing. Service was not well coordinated and a bit odd personalities. This place is part of a chain with not great store level management. Still was packed on a rainy Sunday night. They have a 3 course pre-theater menu for $65 pp.  Our bill for 5 people was $564 plus $100 tip (my husband is a generous tipper😩). We felt it was overpriced but we still like it and would probably go back because we do like good Greek food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNDVxLVpBEAE",
            "text": "Brunch at Milos in New York is an experience not to be missed! From the moment we arrived, we were welcomed with warm hospitality and impeccable service. The ambiance is elegant yet comfortable, making it the perfect spot for a relaxing brunch.\n\nThe brunch menu is a delightful blend of traditional and innovative dishes, all prepared with the freshest ingredients. The seafood selection is particularly impressive – we enjoyed the sashimi and the tuna, both of which were incredibly fresh and flavorful. The lamb chops were delicious. The Greek yogurt with honey and walnuts was a perfectly sweet ending to our meal.\n\nThe service was great\n\nThe quality and presentation of each dish were impeccable, reflecting the restaurant's dedication to culinary excellence.\n\nOverall, our brunch at Milos was a truly wonderful experience. Highly recommended for anyone looking for a top-tier brunch spot in New York!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZOElXb3dBRRAB",
            "text": "Nice place, good food, servers & vibe. Quieter downstairs. Older non Asian hostess has an attitude so 1 less star."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2cUlhSTN3RRAB",
            "text": "The restaurant was very average and was not worth the price we paid. The food was alright but nothing crazy and not sure I would come back on my own terms. Had the tuna and steak for mains and was pretty basic especially for the price. Overall, medium at best."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncmRpdmxRRRAB",
            "text": "Food is really fresh. Presentation is nice and every dish is really tasty! I like the openness of the ambiance, the place is bright and clean. The staff made the experience really nice. Great for conversations or celebrations 🕊️🫒🇬🇷🏺"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMTVEcWVREAE",
            "text": "Came here with a large group for dinner.  Had reservations but still a long wait with them before we were seated.  The menu has a good amount of options and is heavy on the seafood.  Meat options exist and the steak was ok.  The seafood is fresh. The service was on the slower side and we were one of the later seating so our server left before we were finished eating.  He even split our bill give the party size and did not advise the staff so after we paid we were basically chased for the remainder of the balance.  Overall this was not worth the money and quality of the food was not as expected for the amount we were charged."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWYVNtRkhSVFp3UkZkWExYUm5VR1F4WDNScGFtYxAB",
            "text": "Without a doubt, Milos is the best Greek restaurant in NYC. The fish could not be fresher, the sides and apps are superb, and the wait staff is major league pro."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydmJYS3BBRRAB",
            "text": "It is a restaurant specialized in fish, they bring it 3 times a week from Greece, you can also find incredible cuts of meat and lamb! We tried fish carpaccio, lamb and a rib eye with 21 days of aging, everything was incredible! The service, presentation, and atmosphere were incredible! It is an elegant and special place to share! 100% recommended! I would travel from Miami again just to eat here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUd0xYeHBBRRAB",
            "text": "Came here for lunch with some friends and the food was quite good. Focusing more on seafood, they had a great variety to choose from on their 3 course menu.\n\nAt 48 dollars, it was rather worth it. I quite enjoyed their octopus starter. The octopus was very tender. Worth a stop."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2LTlQdDBnRRAB",
            "text": "A truly fantastic Greek dining experience. The service was extraordinary from the point we walked in until we left.  Our party of six shared a number of appetizers and entrees. Every plate was fantastic. We especially liked the salted Loup de Mer and the Lamb Chops."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOXVldmFBEAE",
            "text": "The food was delicious, I went with some friends and we tried different dishes and they all were great! Service was good and quick as well, kind personnel. I would like the tables to be a little bigger but other than that, I totally recommend it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIeC1mY1RnEAE",
            "text": "Milos is a well-known restaurant in the United States. However, compared to some other places I've visited, I found that their menu lacked variety. The appetizers were the highlight, but the main courses didn't have the same wow factor. The service is excellent, and the atmosphere is classy. One of the best things about this place is its fixed menu for pre- and post-theater dining. The restaurant stays open until 12 a.m., making it a great option for a post-Broadway show dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiNjZ5WFhnEAE",
            "text": "During lunch at Baccarat, we overheard a gentleman, who claimed to be a personal friend of rapper Jay-Z, mention that he was heading to Milos for a meal. Intrigued, we decided to visit Milos for dinner.\n\nOur experience began with Georgios, our captain, who escorted us to the back of the restaurant to showcase their fresh seafood selection. He explained the various flavor profiles and preparation methods for the different fish and curated a tasting menu for us. Although he offered “smaller” portions of some popular dishes, the servings were quite generous.\n\nThe service was decent, especially given how busy they were on a Monday afternoon. My only negative is that a couple of times they brought out the next dish while we were still working on one, making it feel a little rushed. It is advisable to make a reservation for weekends.\n\nI highly recommend the fresh scallop ceviche and the Branzino ceviche. While the octopus was decent, I have yet to find perfect octopus, as it often tends to be too chewy.\n\nThe standout dish was the Milos Special. The paper-thin zucchini and eggplant, fried to perfection, had a great flavor and texture. The ranch-like tzatziki dip complemented the dish well. Although the saganaki seemed out of place, it was tasty on its own.\n\nThe grilled sea bass was light and simply cooked, drizzled with olive oil, making for a pleasant conclusion to the savory portion of the meal. Although it did lack salt, I respect letting the flavour of the fish to shine through.\n\nFor dessert, the Baklava was fresh and not overly sweet, with a nice flaky texture of the phyllo pastry. Paired with a side scoop of vanilla ice cream, it was delightful.\n\nWe are glad we followed the recommendation to dine at Milos. I recommend this restaurant for fresh seafood enthusiasts."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqai11UzdnRRAB",
            "text": "Loved Milos!!!\nThe place is super busy, we came on a Friday night and it was packed! Such a great atmosphere!\nThe service was outstanding, 10/10!!!!\nEverything we ate was amazing, so fresh, very tasty, I loved the fried zucchini tower!!\nI can’t wait to come back to Milos!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdjRqMzlnRRAB",
            "text": "One of the greatest Mediterranean (Greek) restaurants in New York. Highly recommended for their amazing appetizers and main courses. The lamb chops, lobster pasta and fish are a must!"
        }
    ],
    "reviews_count": 79
}