{
    "name": "The Ainsworth Midtown",
    "place_id": "ChIJR280jgdZwokRDqnAEZcHOms",
    "grid": "MN5",
    "address": "45 E 33rd St, New York, NY 10016, USA",
    "rating": 3.9,
    "user_ratings_total": 1331,
    "phone_number": "(212) 518-7598",
    "reviews": [
        {
            "date": "10시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201Uk56SnZlVGxwVG5VeWFUWXhjMTg1U1drMmFGRRAB",
            "text": "Went on a Saturday and college football was on. Atmosphere was great of course. A little loud but expected. The food was good and our server was great. Really nice place"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcmVGQktOWGN4TUhsRFpHVjFjVkZEWlhKVWRVRRAB",
            "text": "As someone who travels for food, I was pleasantly surprised by The Ainsworth in Midtown NYC, especially after seeing a few mixed reviews online. My friends and I visited for brunch, and it was a fantastic experience from start to finish.\nThe menu offers a wide range of brunch options — from creative pancake breakfast tacos to a delicious veggie omelet, McGriddle sandwich (with chicken, turkey bacon, and eggs), and perfectly cooked steak and eggs. Every dish was made with care and flavor. The team was accommodating with any adjustments, and service was truly 10/10.\nIf you’re celebrating a birthday or special occasion, this is the place to feel like royalty. The staff went above and beyond . For a group that doesn’t drink alcohol they made mocktail shots for us to enjoy and keep celebrating — even helping me surprise my friend with a birthday sash and tiara — and the complimentary dessert was yum yum!\nThe DJ kept the energy high with great music, so if you prefer a quieter setting, request a seat up front or upstairs. We loved the lively vibe and had an absolute blast.\nBetween the great service, delicious food, and photo-worthy rooftop ambiance, The Ainsworth Midtown is a must-visit brunch spot. Bonus: there’s a parking garage right next door.\n⭐ Food: 10/10 ⭐ Service: 10/10 ⭐ Ambiance: 9/10"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUU9GVmFORVpsTVVSc2VVMXhUVkowZDJvd2JsRRAB",
            "text": "This place is nothing like they try to push on Instagram. We were u set the impression that we were booking the $45 Bad and Boozy brunch which also means included “shot o’clock”. The food wasn’t too bad but the brownie I had tasted like store brought and was not too enjoyable, the pancake tacos I will say were very good. When we got to Ainsworth we did receive 1 shot around 3:20pm, the waitress was very nice and did check in with us often to see if we were good.\nAfter 3:20 there was no other shots which on their instagram page they mention shots every hour but never stated there was a cut off time or that it was only for a certain time. The bathroom is shared with the hotel and the women’s bathroom was horrible, one of the stall doors would not lock, there was no paper towel to dry your hands and barely any soap left in the soap dispensers. The bathroom was not up-kept or cleaned at all.\nThe dishes had smudge stains on it from the dish washer not cleaning well and the tables as well as walls were stained and had food splatters in them.\nNot once on the website did it mention that they were a big Alabama watcher and that the music would be cut off every time the game is on. Nor did they mention ahead of time that when there were Alabama games playing they don’t do “shot o’clocks”. We had planned this for someone’s birthday and did not get a good experience or the experience they showed on instagram. We came for a party brunch and got an Alabama game day instead. The back of the restaurant looks nice but the front is more business and sportsy. If they were honest about there service and how things fun this might have been a good place to watch sports and grab a few drinks but if you are expecting a party brunch do not believe the hype or their Instagram page. Some of those influencers must have been paid. I refused to go back to the bathroom or even visit this place again."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SeFVVZFpNMjQwTlZNNFVWQmhUbFJtUkd0clQwRRAB",
            "text": "I loved this place . The food was great and the dj was amazing ."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nemEwbzVZV3hWUVZGU01tRTVkMWR4WkhWVlNHYxAB",
            "text": "Really friendly bar staff the rooftop isn't what we expected its quite low with not much view but nice for a happy hour drink"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkaFEybFZVRWxwYzJGU05uSXdkSEJZYzNFeGVuYxAB",
            "text": "⭐ 1 Star Review – The Ainsworth (or “Ain’t Worth It”)\n\nWe arrived on time for our reservation, which we made three weeks in advance, expecting a good experience. Instead, the hostess whispered among themselves and finally seated us — not where we wanted, but by the door.\n\nMeanwhile, there was a room with a big-screen TV showing the Alabama–Tennessee game, full of friendly Alabama fans getting ready for kickoff. We politely asked if we could be seated in that room instead. The hostess told us it was “for groups,” but I had already looked and saw plenty of tables for two available.\n\nIt was clear we were being brushed off. The attitude was basically, “Go ahead and leave, we don’t care.” And that’s exactly how we felt — unwanted and dismissed, despite being paying customers with a reservation.\n\nTo top it off, I had already ordered a drink: two Tito’s and cranberries — $36. I’m not even complaining about the price (though the pour was weak), but about the lack of respect and poor service.\n\nI doubt management will even respond to this — and if you don’t see a reply, that tells you everything you need to know. Management simply doesn’t care."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOaVRYbFBTRm80VkVSa01HOXphRjgxVkhoNFQyYxAB",
            "text": "Had an amazing experience at their rooftop restaurant near the Empire State Building! The staff was incredibly friendly — especially Lizzie, who made our visit even better. The steak was perfectly cooked and tender, and every main course dish was top-notch. Highly recommend this spot for great food, stunning views, and excellent service. Can’t wait to come back soon! Super cool drinks too!!"
        },
        {
            "date": "2주 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CaGJIUlhRMVY0UlhSSFNtdGZVWFpvUkZWRGJHYxAB",
            "text": "Un buonissimo ristorante vicino all'Empire State, hanno tantissimi schermi per vedere le partite. Non abbiamo visto tanti turisti oltre a noi, molti local. Anche se siamo arrivati tardi ci hanno servito e, nonostante un po' di attesa, il cibo era talmente buono che ne è valsa la pena. Cameriere gentilissimo e professionale. Raccomando"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGeVVFWmtOUzAyWDIxNlNsSmxaa05PWkZONVgwRRAB",
            "text": "Brunch isn’t brunch until you have done it BAD & BOOZY at The Ainsworth Midtown. For just $45, you get two full hours of unlimited brunch cocktails + an entrée of your choice yes, unlimited. The food came out quick the service was so smooth. We HAD A TIMEEEEEE!!!! It’s spacious, lots of room to move around and they even have a rooftop so you can enjoy your brunch with a little skyline. Whether it’s your birthday, bachelor or bachelorette party, or just a much needed girls or guys day add it to your list! There is even tons of TVs if you love sports it’s giving brunch for everybody. See my full experience on Instagram/TikTok: @travelnistaonthemove."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKcE1FVkJPVVJxWkZKYWJFOTJVRFExU25aR01YYxAB",
            "text": "I would say this is a cute rooftop, but i wouldn't go out of your way to go here. The indoor/outdoor area on roof is cute and has a pretty bar. If you are in the area then it is fine to stop by. Food and drinks are mediocre."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTlFrVm5hak5wWW1VeE1VbGFOalpLU2xkWlZFRRAB",
            "text": "This was a stop on our friendsgiving trip, and it was we'll worth it. The dishes are different than your typical breakfast platter. Highly recommend the Ainsworth McGriddle and the Pancake Tacos. The portions are very plentiful. Our waitress was very pleasant. The rooftop, although we couldn't dine there because of the impending weather, is a very nice touch to a special outing. We were able to see it and take pics but it was closed. They celebrate EVERYTHING!!! If you order a bottle of champagne, they celebrate it. Have a birthday, they celebrate it with a nice big sign, sparkles, confetti blast, and a very generous dessert. I would definitely come back."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1Sk0wbFVYM1EwY1ZFNGIzVmFkM05QUlRGWGRtYxAB",
            "text": "Cool and fun place"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxS05URjVTamgyYkc5T1lUaDZTSEp0YkZvdGQwRRAB",
            "text": "We had reservations for 11:15 a.m. on the rooftop only to find out it doesn’t even open until noon. The hostess (when she was at her post, which was rare) didn’t bother to share that info ahead of time, so we along with a few other confused guests waited around the bar for about 45 minutes, opening a tab just to kill time.\n\nWhen the rooftop finally opened, there was a line, and seating was pretty chaotic. Whether you had a reservation or not didn’t seem to matter. Luckily, our waitress tried her best to make up for the lack of organization, she was kind, attentive, and doing her absolute best to keep up despite the poor handoff from the front.\n\nNow, the food? Pretty on the plate, bland on the palate. It looked Instagram-ready but tasted like it had been sitting under a heat lamp, lukewarm and flavorless. For a place that banks so hard on presentation, a little seasoning wouldn’t hurt.\n\nAnd let’s talk about the bathrooms, gross only one was working, and it smelled awful. This was barely past 12 p.m., so that’s saying something.\n\nOn the upside, the rooftop itself is aesthetically pleasing, definitely a photogenic spot if you’re chasing TikTok content or want a cute backdrop for brunch selfies. But for a native New Yorker who’s seen better brunches with less fuss? Once was enough."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toeGVsQlFVamRwWldveGIzUkpjMkZTV2xadVNYYxAB",
            "text": "You guys we came here for brunch and it was nearly the worst experience l've ever had. Don't get me wrong the server and staff are great. But I'm sure the server forgot to ring our food in. We've been sitting here for 2 hours and only had 4 plates come out one by one within 15 mins of each other. We finally said something (we were so patient cause wym we sat here for 2 hours waiting) basically at 3 hrs now, the food finally comes out but it was only bc we had to say something AGAIN. Server said they would take off the alcohol. Wym we literally don't even have food and still have bottles of this boozy thing still pretty full. Anyway food was mid on top of that so idk.\nDo what u will with this review, maybe you'll get a better experience than we did oh and my egg Benedict's came out overcooked. Cries"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMGFVcFpiVWN5TmtablZHczJiVnB4UlVkU2RIYxAB",
            "text": "Tried to go here for some dinner and drinks since we were staying at the hotel next door. We made a reservation, walk in and stood at the hostess stand for a couple of minutes. No one addressed us and the bartender just looked at us. The music was crazy loud, so we went up to the terrace bar. We sat down and were told that the upstairs bar was closed (even though the sign outside said it was opened). We told them that nobody helped us downstairs and that the music was incredibly loud, so we left without getting anything."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKb1FXeGpaSFZxUjNFMVgyUXdZMU4yZGpKMGVWRRAB",
            "text": "First time here I'll be back our waitress Faith was the best"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OcGNHTTJSVFkxTkRKVVltTkpUMGRRZEV4RVFrRRAB",
            "text": "The overall environment was just chaotic. The music was so loud during brunch that we could barely have a conversation without yelling across the table. It felt more like a club than a restaurant, which might be fun for some, but definitely not ideal for enjoying a meal or celebrating a birthday. Unfortunately the experience was completely soured due to the terrible service we received from our server, Faith.\n\nFrom the start, things went downhill. It took quite a while just to get water. After placing our drink order, we waited even longer for the drinks to arrive. When she finally came back, Faith told us to “give her a second” because the table behind us had purchased bottle service and ordered Don Julio—as if to say they were more important than us. Strike two.\n\nWe waited over 10 minutes just for her to take our food order, and only after flagging her down. Once the order was in, Faith was nowhere to be found. At one point, we saw her behind the bar vaping and taking selfies instead of checking on us tables.\n\n20 minutes went by, our champagne bucket was empty, and we couldn’t find her. I had to personally walk over to the bartender and ask for another bottle—thankfully, the bartender was helpful. Meanwhile, Faith remained fully focused on the table behind us, where she took shots with them, brought their food, and gave them full attention.\n\nAnother server brought our food, and one of the orders was wrong. It took 25 minutes to get Faith’s attention again just to ask for syrup and let her know about the mistake. The only time she voluntarily returned to our table was during “shots o’clock.”\n\nAn hour passed with no sign of her again. We wanted to check out and honestly could have walked out without her ever noticing. When we finally received the bill, it was more than expected—only for Faith to *proudly* inform us that the gratuity was already included. That explained a lot.\n\nTo top it off, she pressed “no tip” for us on the payment kiosk and canceled the survey before we could fill it out. When someone mentioned how poor the service was, she deflected with excuses, saying we probably “called the wrong person name” and that’s why she ignored our table. Absolutely unprofessional.\n\nThis entire experience felt like we were treated as second-class guests because we didn’t spend as much as another table. It was disappointing, disrespectful, and honestly ruined what was supposed to be a fun birthday celebration. Management needs to seriously reconsider how staff like Faith represent their establishment."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5bFZsRnJiRFl4ZFZGbldEaEljVmx2Vkd4emFuYxAB",
            "text": "If you’re a bama fan , don’t go for the watch parties. The official alum association watch parties are at Ernie’s now. Went for the Georgia game, and couldn’t get a drink for 45 mins because bartenders not paying attention to anyone who wasn’t seated directly at the bar. Sound only playing in the back. Not worth the hastle to go there. Ernie’s is much better and not pretending to be the official bama bar."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCelVuZDVVWGR0V1c0MFNWZFdXRGR4WTJKZlRVRRAB",
            "text": "Loved our brunch date here last week, super cute setup. Got the BRUNCH IN THE SUN on their outdoor rooftop terrace: $55 per person and includes bottomless brunch cocktails and a legit huge entree! Add that wild Waffle board for only $45\n\nGreat spot for a fun brunch date in the autumn sun"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taaVZFOTVVMlpTWkhaNU5qZHBRVUp3U2tSdlYzYxAB",
            "text": "Remy was great and the service was exceptional. I will be coming back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOSGFuaDBaakJEUzBoTE5tOHROalUxWjBwVmRVRRAB",
            "text": "Remy was great\nHad a really good time\nIt was my first time here but just perfect bc army was the best ! Patient, kind and the best ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WlQydzRObEpHVmpsTWVHSlNTRzg0YXpWdFVuYxAB",
            "text": "Everything was amazing, Remy was an amazing bartender. I would definitely recommend this place 100%"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNlFWVklTa1ZoYm05VFZsSm5aRWx3ZEV4ZmVHYxAB",
            "text": "Love this place! Such a great location in the city, the food and drinks are always amazing, and the staff makes you feel right at home. Definitely recommend checking it out!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkaFVVVlhibEZIWkdzMFFYcHhWRWc1YUc1SVMxRRAB",
            "text": "The hangover burger was top tier! Well seasoned and all! Our server Faith was also super sweet and very accommodating our entire time there! And the Dj was on point too! Great vibes all around!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twNE5IUnpPRU5zYmpsMU5scElhRlY0UjBaYWJrRRAB",
            "text": "Had a ball and the bill wasn’t bad either"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbFZrbG5SMFpuZEcxWWFFTlVPRmxMVUZGNlJuYxAB",
            "text": "Watched the Bama game here with a group. REMY IS THE BEST BARTENDER! He cares about the well-being of everyone. COME HERE!!! I LOVE REMY!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUFUyZG9OVzluVlVsWlNsTklORmxJYldkMWExRRAB",
            "text": "Ask for Remy if you go!! Best bartender I’ve ever had! :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVFdtZGZabFJwTVZadFpGaHRPVmxCZDJsSGRYYxAB",
            "text": "The Ainsworth Midtown is easily one of the most beautiful and Instagrammable restaurants in New York City. The space is stunning, the main floor has a lively bar and a huge back room for brunches or private events with DJ setup, and the rooftop lounge is perfect for summer nights with views of the skyline.\n\nThe food was outstanding. I started with the Honey Buffalo Wings, Truffle Bacon Mac & Cheese, and Ahi Tuna Won Tacos, all flavorful and perfectly prepared. For entrées, I had the Bone Marrow Cacio e Pepe, which was rich, creamy, and genius, and the Lamb Chops with truffle mashed potatoes, roasted carrots, and a red wine apple glaze that balanced the dish beautifully.\n\nThe cocktails were just as impressive: the smooth Espresso Martini, fruity Sangria, and the signature Mr. Moore made the experience complete.\n\nOverall, it’s upscale but welcoming, perfect for brunch, dinner, or rooftop drinks. Highly recommend if you’re looking for a stylish Manhattan spot with incredible food and drinks."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkME5pMDNVbXBoZVZNMGRISXpMVVk0U1U5U1QwRRAB",
            "text": "Came here for the love island reunion watch, you’d think for a ticketed event they’d have enough staff. It took nearly an hour to get drinks and then another hour to get our food. Unfortunately it was clear that they were understaffed (only 2 waitresses) with at LEAST 40 covers (but I’m sure way more).\n\nWhen our drink finally came out she said she’d be back with a lime for the corona, it took about 30 mins to get it.\n\nWhen the food finally came out it was room temperature at best. It was tasty overall but not hot which meant it was probably sitting and waiting to be brought out. Once again a staffing issue.\n\nThe food was pretty expensive and to pay $10 per person just for a seat is ridiculous when you’re getting sub-par service. I of course don’t blame the ladies working their butts off but blame management for knowing how many people were coming to the watch party and not appropriately staffing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RMlUxWldjME5WWmtkYU1GVk5XVFp0UTJ0YU5VRRAB",
            "text": "Went there for brunch. We sat at the rooftop bar and it was very lovely. The bartender was fantastic and kind. The food was delicious. I would definitely go back again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kaVowaEtkMjlQU25jNFpteHpUekUyZVhjemJIYxAB",
            "text": "The food and the atmosphere were good. Nothing extraordinary but definitely good food and pretty decor. We seat outside in the outdoor terrace.\nMy problem with this restaurant is that they do not explain the “brunch” menu appropriately. We were left with extra charges that should’ve been included with the $45pp, from the way the menu was described to us. We were also charged a 3.5% Service Charge!?! Automatic gratuity was also added but we expected that.\nThe server did her best I guess 🤷🏽‍♀️ but I felt that on a Sunday at 1p for brunch there wasn’t enough people working. Our server forgot to bring back our refill pitchers twice (at two separate times during our 2 hour sitting). And like I previously mentioned, she was misleading and made it seem like everything on the brunch menu was included in our brunch price.  (Maybe not her fault, maybe this is how the restaurant operates to make more money?)\nAlso, for the “Bad & Bougie Brunch” there was supposed to be a DJ. We heard music it was low and it really didn’t sound like a DJ but rather someone just playing music on their phone and not a good variety of music either.\n\nAnyway, we will not be returning considering\n1. there was hair balls flying around the floor and being blown by the wind on top of some of the furniture the entire time we were eating.\n2. I felt mislead by the server/restaurant and the extra charges.\n\nFeel free to review the receipt mentioned above."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWWNESTFSSFpCTVZSaGNsOU5iV3B2TkhCRFluYxAB",
            "text": "Such an amazing spot! I’ve been here a few times and it’s always a great experience. The Bad & Boozy Brunch was such a vibe, and they even had BOTTOMLESS Mimosas, a DJ, and lots of fun sparklers! We had brunch indoors, which was perfect, and also dinner on the rooftop, which was just as incredible! The food and drinks are delicious, the atmosphere is so fun, and the rooftop views are always unforgettable. The whole team was great, and Macie was amazing! A must-visit for brunch, dinner, and a good time all around! We will for sure be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCeFFVTnhOMTlpWWpBM2RYRjFSMFpGYzNSR1ZrRRAB",
            "text": "The Ainsworth Midtown is definitely a cute spot with its stairs and garden vibe. Honestly, when I first walked in, I didn’t realize it was both a lounge and a rooftop. I was excited to head to the rooftop, but I must have missed the part that it’s first come, first served.\n\nI liked that they gave out free shots, but it was really hot, and the constant confetti popping every couple of minutes got a little annoying, especially for people trying to enjoy the space. The music was a bit loud and you have to yell for the person to be able to hear you. The rooftop itself was smaller than I expected with limited seating. It definitely looks larger in pictures.\n\nOn the plus side, the food was good. The cinnamon bites appetizer was absolutely delicious, and the drinks were solid too. I tried the spritz and really enjoyed it. Overall, it’s a fun spot if you’re prepared for the lounge-style energy, but just know the rooftop is more limited than it seems online."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSWVNWRlFiV3RGUWtKZlgwdHBWamxpWHpoSlJrRRAB",
            "text": "The space was great, especially the finger food during an event. But unfortunately, all the bathrooms on the 2nd fl was all out of service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210cGFrVjRaMFZOY2tkMFNXVjRiVXB0TmxwdGJWRRAB",
            "text": "Our group EmpowerHer Fuision had a brunch at the location. Remy was our waiter and he was and is Phenomenal. I would highly recommend this location for a brunch or to grab a bite. ❤️🩶🩷💙💚🧡"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSS05rZFpiVVZOT1hOdk1IZ3hURWhFUlVJeVYxRRAB",
            "text": "I went to a Birthday Brunch Party on a Saturday this Summer and let me tell you it was HORRIBLE first of all it was extremely HOT no AC they had a bunch of fans spinning around a HOT packed room, they advertise $45 bad & boozy brunch special with a option to upgrade to $55 My Party & I picked the $45 option and the bill came out to $71 per person with a bunch of hidden fees (one was a restaurant fee) what hell is even that?, Anyway the Food was Mid like a 6/10 the drinks was regular 7/10 but that Sweat Box aka Restaurant as a whole was a 0/10 Would not recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21semJsVnhVM1JZTUhvdGNuVlpjVFZITXprek5FRRAB",
            "text": "this restaurant is trying to be too many things at once. they are a sit-down restaurant, but also a sports bar(?) and has a club atmosphere with things like “shot-o-clock”, birthday posters, live DJ and party poppers(super loud and hurts the ear repeatedly). it’s clear that they’re understaffed so i don’t want to be too harsh, but overall had an unpleasant experience. the AC stopped working during 90+ degree weather (our entire table was fanning ourselves with the menus), the food is bad, the drinks are bad, and the music is so loud you can’t really hear anyone that is more than a foot away from you. again, they were understaffed, but there was broken glass and water under our table that they never cleaned, and all the confetti from the poppers were in our food and drinks. i wouldn’t recommend going here. the only thing that saved the experience was how nice and accommodating the staff was."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FNFNVOXNNWG96V2tneFVEa3RXSEowTjNJM05rRRAB",
            "text": "Great place for brunch. Friendly staff. Reasonably priced. Food came out quickly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1WFJGSktMVkJQYmtOblYxZHJOemxEVTNkSFZYYxAB",
            "text": "The food was so ridiculously tasteless id never come back here. 40 for a branding fille with no seasoning on any of it. Not even the potatoes. Not to mention majority of there menu has steak listed, and they were completely OUT."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwalgxZG9ZMG8wY2s0MFIwVTJNR1JYZFVnMWFtYxAB",
            "text": "Remy was an amazing host!! Despite a hiccup in the beginning with our seating...the food was amazing and the service was even better. Remy took care of us and I will definitely be back. Hes a gem!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTGIyZHBjMWhNU1VKbFpHaEhTM0Y1YUZvMFoxRRAB",
            "text": "Had the best time ever. Service was great: drinks delicious. Remy the bartender- so hot and attentive. You MIST COME HERE"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGcllYRlNWRGxwTWtKTk1FWlBUVlZRT1ZCblZtYxAB",
            "text": "Remy was fantastic. He was so kind and gave excellent service. The drinks were great. Favorite happy hour spot!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKWGJVNTBVWEV0TjBJNGJYWTRMVXR4VmpsemNuYxAB",
            "text": "Cute drinks trash food ."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWbVpXNVlSVEZoTFZsSGRsSlJWbTFUZG0xWU1uYxAB",
            "text": "Easily another addition to my favorites, the Ainsworth Midtown offers delicious food, amazing cocktails, exceptional service, and the perfect vibes for any occasion. They have an awesome happy hour offer every day from 4PM to 7PM that features all appetizers and signature cocktails being half-priced. Lizzie was very attentive and knowledgeable about menu items, and it was thanks in part to her insight and suggestions that I was able to choose the perfect dishes and cocktails. Every single item was delicious and well-portioned, and I especially loved the liquid snicker cocktail. They have an amazing bottomless brunch option of $45 or $55 which includes an entrée and bottomless drinks for 2 hours, that I'm dying to try!! They offer both indoor and outdoor terrace dining, and are an absolute must-visit restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjdFltaFBibkIxZGpOMk1WUllha1JLTm1KTmFXYxAB",
            "text": "Remy was a great server he was super attentive, fast service and nice! I got the lavender mule and it was really good, the atmosphere was great!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poaWQzaDFaRWQxWVRkNVh6ZEVObk5ZWkZFNVRsRRAB",
            "text": "I hate writing negative reviews but I have to be truthful . This experience was a lot because I had higher expectations . Beautiful space , decor and aesthetic was pleasing . I'll start there . However, the poor server was so overwhelmed with all the mistakes the kitchen was making and the mishaps happening from the back of house . The food was so underwhelming and they forgot multiple orders . Then they brought out the wrong cake for my cousins' bday . It was a disaster and that was my first and last visit . But as I always say, go for yourself - you might  have a different experience ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KUVoxRlJXRUphYVdoYVp6UXRSMjU2WW13NFkxRRAB",
            "text": "Came for brunch on a Sunday and it was fun! Shock o’clock every hour!! It’s definitely extremely hot inside, they have fans set up in a few areas but it definitely wasn’t enough. Bring your own portable fan if you can! Faith was 10/10. One of the only reasons I’d come back is for her! She was both our waitress and the bar making drinks at the time. She was still extremely attentive and made sure we had everything we needed and was having fun at the same time!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWVWVHbGFTVE55WlZCbWVGUTFjbU5IVTIxRmRFRRAB",
            "text": "Had a great time, Remy was so attentive! 10/10 would recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMFFscDVSa0Z6WWxFM1FqZHhUVmhUY1ZsMFVVRRAB",
            "text": "Had an amazing time with Faith for my sister bday! She fun , real and energetic; if you can request her as your waitress... Faith youre amazing babyy 🤍🤍…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGZmNFWk9TRFZoWlU1RlJUUlhORko1WDJzNGNHYxAB",
            "text": "Faith had the best vibes in the world!! Super friendly and had the best customer service! Our server Taylor was super nice and friendly! I will definitely be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxYWIxQmtObWx1VWxWak4yeElORzFuYTBscVkwRRAB",
            "text": "It's a cool spot. It's a restaurant with loud music with a DJ, which can get you moving a bit. I have no complaints with the food.\n\nThe critique I had was that the service was a little bit slow. I remember my friend wanting dressing on her salad and asking the waiter for it, only to come when we had already finished with our food.\n\nAlso, I wish there were a reservation option for the rooftop. My friends and I specifically came for the rooftop and we were told we have to wait an hour to get a table. If we had known, we probably would've chosen another rooftop.\n\nOverall the place was nice as a regular restaurant. The food was good. I like the coconut drink I had. If you're looking for a restaurant with lively music and a DJ. This spot is great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCcmRpMU1OeTEwWm1ORmNqZGZRVGRHZDJaQ1VuYxAB",
            "text": "I had a late lunch with my daughter and sisters on a Saturday afternoon at the Ainsworth Midtown. The atmosphere of the restaurant was very nice. We were greeted and seated right away. Our waitress was very nice but she appeared to be working the front of the restaurant alone so the service was slow. My sisters and I had the steak and eggs, which was good. My daughter had the French toast sticks, which she liked. The white wine sangria was very light. The music selection was very nice but it was extremely load like we were in a club. We had to yell to speak to one another."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twdlNFSmZVVU5IY1dOMWVsVTFTVjgxWkZKZmNXYxAB",
            "text": "Remy was an amazing bartender and server. He went above and beyond to check on us and made sure our mimosas were definitely bottomless! The food was was great, recommend the pancake tacos."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxdFdEVnpNRFZETTBWcVkyOWpVM2QxTVhsMVUyYxAB",
            "text": "Good food. Great drinks. I had Faith as my bartender during brunch and she was on point, hand delivering the drinks. We had lemon drops and they did not missss. And she’s such a vibe with great energy and customer service. Our server was Karin and she was very attentive and cool. Alex gave my nephew free ice cream and he loved that"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSR01sRkNXRmR0T0VWNldXZ3pZVTl2VUhsSmNYYxAB",
            "text": "We did not enjoy the food, the service, nor the atmosphere. The mac and cheese burger pictured below was especially tasteless and although I ordered it medium, it was tough, grating, and honestly gross. The truffle fries were simultaneously soggy and hard, while the pickle on the side seemed to be the best part of the meal. My table also ordered the chicken sandwich, the breakfast burger, mac and cheese, and fries. Everyone felt similarly about their lackluster and sometimes inedible meals. The waiter and bartender were trying their best, coupled with a side of attitude and ridiculously long wait times. We waited one hour to get our food after ordering and nothing was as promised. The automatic 20% gratuity was very surprising, as we were incredibly disappointed in the quality of the meal. I definitely would not recommend dining here at lunch, but maybe their options are better at dinner? The staff certainly seem to think so."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOdnMtdTNVcUtlTEFnEAE",
            "text": "I went brunch with a friend. We didn't reserve, but the bar upstairs had place so we stayed. Not being from NY, I loved the place. I loved the interior. The food was okay, the ambiance was nice, and the music was not too loud. I'm definitely recommending it."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbHZtSUNnEAE",
            "text": "I was staying right next door to The Ainsworth Midtown while in NYC to sit on a panel about AI at NYU. After a long day of meaningful conversation and insight, this place was exactly what I needed. The Apple Poppy Salad with Blackened Salmon was absolutely delicious. Fresh, vibrant, and filling without being heavy.\n\nThe staff were friendly and attentive, and I had the pleasure of meeting one of the owners, Alfredo Bethune, who was incredibly warm and welcoming. It’s rare to feel that level of hospitality in such a busy city. It really stood out.\n\nWhile waiting for my food, I ordered a Hendrick’s and tonic (my usual) at the bar. The bartenders didn’t hold back. Let’s just say they weren’t shy with the pour, and I wasn’t mad about it.\n\nGreat food. Strong drinks. Outstanding service. The Ainsworth Midtown is definitely going on my list of go-to spots in the city."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKZVp1dkxFamEzNnd3RRAB",
            "text": "This bar is where we play cornhole every Wednesday that’s ran by Volo. We were placed in the back of the bar which was very spacious. We had the entire back bar to ourselves so there was never a wait when trying to get drinks. The bartender was very friendly, outgoing, and attentive, and while playing, we grabbed a few drinks and food. For food I got a classic burger with cheese and shoestring fries which was delicious. My friend got the lemon pepper wings which he said was delicious as well. There’s so many TVs so you can def catch any game there. We were able to watch the Thunder vs Timberwolves game after cornhole. Would recommend if you’re looking for a bar with decent food and lots of TVs."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKTDh1SkxtaXRYcTRnRRAB",
            "text": "Looking for the ultimate NYC weekend vibe? Ainsworth Midtown brings a sophisticated twist to the classic all-American sports bar—think casual-sexy interiors, luxe urban chic vibes, and unbeatable energy.\nKick off your weekend with their new all-inclusive brunch package: for just $55, enjoy a brunch dish of your choice + 2 hours of bottomless brunch cocktails, every Saturday & Sunday from open to 4 PM. Also have DJ spinning chill rooftop brunch vibes.\nWhether it’s a birthday, anniversary, or just a reason to gather, Ainsworth’s got the perfect setup—outdoor dining, stunning rooftop views of Manhattan, and food that hits every time.\nSports, skyline, and sips? Say less."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQYWpfTEczOE5pa1B3EAE",
            "text": "Contrary to some of the reviews, I really enjoyed this place. It's a fantastic sports bar with multiple screens, making it perfect for catching a game. The space is large, ideal for bringing a big group of friends, and the music adds a great vibe to the atmosphere. I ordered the hot honey bone-in wings, which were absolutely delicious, and we paired them with a bucket of beer--both reasonably priced. I'll definitely be coming back here for all the football games! However, I do have to say the bartenders are not really attentive."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sV01rMHlObXRIU2tjNWIyMUxNa3R3YURCaFozYxAB",
            "text": "Kyler was a great server, attentive and made sure our drinks were filled. My friend and I went for the had a boozy brunch. He food and drinks were good but it’s def more of a party environment."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaSmVuVlZPV3BRWlY5aWFsVlJRVWh6UzIxMVVFRRAB",
            "text": "⸻\n\nHad a fantastic time at The Ainsworth Midtown!\nThe food was delicious, the service was attentive and friendly, and the atmosphere was energetic and fun. Everything was well-organized, and the staff made us feel very welcome. Highly recommend this spot for a night out or special gathering!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2eHRMQ0hREAE",
            "text": "Went for lunch today with a large group of coworkers for a holiday gathering. Restaurant is nice and decorated for the holiday which was a plus. Our waitress, was really friendly and helpful.\n\nThe food took a while to come out but I guess it’s because we had a larger party, but we were pretty much the only diners there so not sure how we could’ve really slowed them down. The food taste and quality was just ok, not bad but not great either.  Prices are reasonable for the location."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MHBueUpBEAE",
            "text": "Happened to be in Midtown for the Christmas Festivities! Decided to check out Ainsworth for their weekend Brunch !! We got there super early but it’s was truly amazing the food and service. Staff were very welcoming and super fast. Loved the Beer Garden vibes definitely could watch Sunday Football with the Fellas !!\n\nTheir holiday Espresso Martini was delicious , we started with the Mac and Cheese bites and Chicken and Waffles Slides I believe it was called . Sooooooo good!!! We ended up ordering Steak and eggs , Avocado Toast and Pancakes !! Yeah we ordered like it was our last meal.\n\nDefinitely Must Try If In Midtown. They also have a 90 Minutes Bottomless Brunch!!!\n\nService - 10/10\nAmbiance - 10/10\nParking - Street Good Luck\nReservation- Not Needed (Great for Large Groups)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLVHJrOFBtNUtUakR3EAE",
            "text": "The Ainsworth, attached to the the HIlton middletown is a place I would like to go again for food. We 8 people family went for lunch to this restaurant (Their lunch menu start only after 4 PM, which we found a little weird). Enjoyed the local beer, cocktails and delicious food. we were meeting with one of our friends family coming from California at NY. Great burgers and many other items to enjoy."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOWZYQ0RREAE",
            "text": "The dinining area with the low tables and chairs was off limits. The  DJ wasn’t there during the brunch today 1-25-2025, but they still played good music. We had to sit in the bar area. I wasn’t too thrilled since I hate sitting on bar stool type chairs. The foods’ presentations were  great. The food was good , and came out cold. The bottomless drinks were good. The server was ok, though She took her time to bring my mom and I the things we requested. She rarely smiled when interacting with us. But she wasn’t even the initial server, she took over and we didn’t know they switched shifts. Poor communication on their end.  This  restaurant also takes out the gratuity automatically. They took $10 , not sure if I would have tipped that much on own .  The bathrooms are located inside the hotel lobby , outside of the restaurant."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taclJHcEZjRTV2TjNOMlJXTklkV1pmTVhNeExYYxAB",
            "text": "I have never in my life had Mac and cheese this good.....absolutely unforgettable! But what made the experience truly next-level was Faith. Her warm personality, incredible memory (seriously, how did she remember everything we ordered?!), and genuine care made us feel so welcomed.\nGood food is always a plus, but great service is what makes it truly memorable....and Faith delivered that and more. She's a true asset to the team!\nTHANK YOU, FAITH! The food was amazing, but you made it an experience to remember. 💛 A time was definitely had!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKcE1YRm9NVmxMTUVFM2RFSkdZWEkzVEZOU1NWRRAB",
            "text": "I cannot say enough good things about Remy at Ainsworth. From the moment we sat down, he made us feel welcome, and had incredible recommendations. He made the best cocktails.  You can tell he takes pride in his craft, he even customized drinks based on our preferences without skipping a beat.\n\nBeyond the drinks, Remy’s energy was contagious, he kept the vibe upbeat all night, handled a packed bar with ease, and made everyone feel like they were his top priority. Truly the best bartender I’ve ever encountered. Ainsworth is lucky to have him, and I’ll absolutely be coming back because of him!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wbGVEQlNNMWMyYVU5a1pWRjRaMWhLZWtSWFZFRRAB",
            "text": "Currently at brunch for a 115 reservation . No one came upto our table until 145 with water and no cups to drink out of. We put in our order and asked for cups. 15 mins have gone by and we still have none. Will update review has we continue brunch. Got our bottomless mimosas by 2. Food came out at about 230 still no glasses for the water which was warm at this point. They have no ac everyone was hot using the menu to fan them selves. 20% gratuity was a joke since we only saw our waitress once after she took our order, sShe never brought our utensils we had to ask the bus boy twice. I guess we were supposed to eat with our hands. Food was only ok got home and was still hungry. 0 out of 10 would not recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOeU5tMXJWVGxoTmt4RGJtbE5RM0ZCUzBGeFIxRRAB",
            "text": "Sunday brunch\n\nSteak and eggs were okay, but the brunch burger was amazing. They steak was over cooked, my table ordered medium, medium well, and well done and all of our steaks looked the same. The breakfast potatoes were hard and undercooked. Eggs were just eggs nothing ti say there. Still tasted decent but hard potatoes and steak not cooked to the correct temps was annoying. Also dont go past 3pm for brunch, it will be empty and they start putting chairs up in front of you... felt like we were being rushed to leave with some cleaning staff just watching us\n\nWill go again, we will just go earlier for brunch like 1pm, and not ordered the steak and eggs at all.\n\nAlso the music is fun its cute. we didnt get the free shots as advertised because they were treating the place like they were closing for the day.\n\nServer and hostess were very sweet ladies and efficient!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxdzdDVEFnEAE",
            "text": "Came here for brunch last weekend and it was delicious! The service was great and our server was so helpful and friendly. The hostess also kept coming to check in on us as well. We got the cinnamon french toast sticks was super yummy and perfect for french toast stick lovers. We got steak and eggs as well and this was a perfect way to get our protein in. Steak was cooked exactly how we wanted it to be. The chicken and waffle sliders was GOOD. especially with the maple syrup in it - so delicious. For dessert, we tried their churros which of course is always good - how could you mess up on churros!? it had caramel, chocolate and vanilla sauce. For our drinks, we tried their espresso martini which I thought was too sweet but still very good. My friend got the strawberry basil lemonade - also too sweet but we added more ice and water which helped. Would recommend adjusting the sweetness level if you order their cocktails. The space was big and a vibe. Perfect for group brunch/dinner. They played really good music too. Super close to herald square!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkR01qVTVUak5sY0VsR1QyaFRaVWMwYmtJM0xYYxAB",
            "text": "The food was a solid 4 to 4.5 stars but the service was not great.  Initial order taking was the only time we saw our server until the check came out well after we were done eating.  At least 7 staff members were hanging out at the bar the whole time we were there including the “manager” who I saw have multiple drinks over the course of our meal.  The atmosphere was ok but really loud music ruined that aspect too.  Would not go back which is a shame because the food was generally pretty good and not terribly overpriced for the city."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NGRWY3dSVzR4V1ZCSFkxZFNTRXd0ZFd4Zk9YYxAB",
            "text": "I had the pleasure of being served by Remy!!!, and let me just say—this is what bartending excellence looks like. From the moment I walked in he was warm, attentive, and genuinely welcoming. He strike that perfect balance between friendly and professional, making everyone feel like a regular—even if it’s your first time.\n\nIf you’re lucky enough to land a seat at their bar, do yourself a favor and stay a while. Bartenders like this don’t come around"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSX0thdW5nRRAB",
            "text": "I stayed at The Hilton attached to The Ainsworth so naturally when I found out about their rooftop brunch, I had to check it out. It’s super cute and welcoming. Definitely has the brunch vibe. We were the only ones there when we arrived which was surprising but more people came while we were waiting for food. We did the Bottomless 90 and it was so worth it. The waffle board is adorable AND delicious. I got the cinnamon roll pancakes and my boyfriend got the traditional eggs benedict(not pictured). I took one bite of the pancakes and decided they were not for me. I feel like this one is a hit-or-miss dish and I just did not like it. They were SO nice about it. I ordered the steak and eggs benedict instead and it was amazing!! The service was great as well. Everyone is super nice. Definitely will be back when I’m in town next."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oWk1qRlNaVFp6U3pkS1NITnplalZuUjBRM1RIYxAB",
            "text": "I planned my birthday brunch at the Ainsworth with Sarah via email. She had me pick out 5 entrees the package came with a brunch board and bottomless. I also put a credit card down as a deposit. I emailed her to change the reservation from 12 to 9 and she said no problem. When we arrived for brunch they informed us that we would be ordering off the regular menu since we were no longer a group of 12. I told the sever that I had been emailing to plan the brunch and she told me that they probably assumed I would be told when I got there. They offered to comp a brunch board for us for the confusion. Our original server came up to the table and told us that she had a “VIP guest” upstairs that personally requested her and we would be getting a new server but she was going to charge us half price for the board not comped as she originally said and that she would put it in before they switched. She never put the board in and our board was brought out to us at the end of the 2.5 hour brunch when we had already eaten our entrees. The server tried to take food orders before taking drink orders. On top of all of this the AC was broken and it was very hot inside. Overall a disappointing experience with a real lack of communication from the staff."
        }
    ],
    "reviews_count": 75
}