{
    "name": "La Pecora Bianca Midtown",
    "place_id": "ChIJWZbmVuJYwokRp2ASZt0ZtgU",
    "grid": "MN5",
    "address": "950 2nd Ave, New York, NY 10022, USA",
    "rating": 4.7,
    "user_ratings_total": 3123,
    "phone_number": "(212) 899-9996",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ocVYwUlpRelZIVFhGNk1EQTNabEJ4Ym5GaU1IYxAB",
            "text": "Excellent waiter"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oVGRscFVVV0k0UTFKbWVGOTVkSEEzZWt4VVVsRRAB",
            "text": "Cute restaurant, the food was good but the portions were slightly small than what I expected for that price but good food none the less"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xacmNsOU9OREJyVEROMGNFZFBjRlZ6WkZGVmMxRRAB",
            "text": "Love it love it love it"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sRk5rRnNYMDUwZGtKbWFtRXhXbXhyYjJVMk5sRRAB",
            "text": "Fantastic and attentive server, Alexander, with great food recommendations"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sNlluSm9UVXBuVUhaV1pGWklNbGN4V25SUU0xRRAB",
            "text": "The house-made gluten free pasta is incredible!"
        },
        {
            "date": "수정일: 3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xObFNXbHFaVEJDTFRRNFVsVnBORzlzVVZZelEwRRAB",
            "text": "The customer service and food are amazing. Great atmosphere as well."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoTE1rMXNMV0ZKVUVOc1gxSkNlREExVkZkcVZWRRAB",
            "text": "Really appreciate the tranquility of this restaurant, came in by myself for a late lunch. Super attentive service. Good tasty food. Comfortable cushioned booth. Quiet environment. Affordable pricing"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NNGJWRmxXalJpU0hwM1JtdElSV1p1TkZKVFdGRRAB",
            "text": "Service and rigatoni as well as mushroom pasta and zucchini fries were amazing!\nWill be back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFdFRIb3hiVlpwUlhveFNGcDRiWFZRWDJ4amVIYxAB",
            "text": "Everything was absolutely amazing! The food was delicious — the salad and pasta were excellent. The staff were super attentive and kind. The waiter was fast and very professional, and the hostess was wonderful — he seated us in a quiet and very comfortable spot.\nThey even suggested a pasta for my child and brought it within 5 minutes so he didn’t have to wait.\nTruly outstanding service and great atmosphere — highly recommend!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRNU5GWXlSakl0WjBkVVJsOVFiMlV0VDA5aE9YYxAB",
            "text": "Delicious food and great waiter!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kYVpFOXFVRTh4UzA4NE1uZDBja2xoVEZaS1lWRRAB",
            "text": "Excellent service and food!!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUmNWVmFlbDlaT0ZSdWVWRTJiRFpOVm5WaWQxRRAB",
            "text": "Fantastic food, a little on the noisy side. Most of the wait staff were very professional but the person who poured our first ring of water slopped a fair amount on the table and on my phone. It’s ok to slow down a little …"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoa05EZFRNbU5xV1VsaU1qZE5ZMkZxWkc5bFUyYxAB",
            "text": "Amazing service, amazing great time! We had a great experience! The pasta was great, very great I love it"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WcVZHRmxXV010WDNZelZtSkVTVTk1UWxwT09WRRAB",
            "text": "Never disappoints!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SaE1EWkhXbXR4ZUhwbFNVSlpka3hTT0Zaek4wRRAB",
            "text": "Great service and good food"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUmJrTmxUSGRKU0VoMmMzVTRiMjl2ZWs5ZlNHYxAB",
            "text": "We had a table reserved from Open Table, however we wanted to have a dinner inside and were offered only an outside table because it was reserved through open table instead of Resy. In the end they managed to give us an inside table and we enjoyed our dinner a lot."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oalVuUmZabXBVYlhab2NYbExibTFqWTBwdVZIYxAB",
            "text": "Great neighborhood spot, food is excellent!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sWVVVODVZMk5PTW1kWWJuSkZUazlTUkZoaWIzYxAB",
            "text": "Great service! Thanks"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdDc3UGpRRRAB",
            "text": "My favorite restaurant in NYC!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dGNsVk1WVjl0UWxRNU1XcGtSVGwyZVdFMFpYYxAB",
            "text": "Michele was fantastic!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsSFVraDFia1UzTkMxTmFIZE9lVmhrY1U5SlFXYxAB",
            "text": "Pasta so fresh, shrimp sweet, service so excellent! What a special night for us!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nMlVtdzJVVTVJWkRGamJGUkJNREp6TlRWRlozYxAB",
            "text": "Gas"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMcjcySE5REAE",
            "text": "인생파스타!\n친절하고 맛있는 파스타를 먹고 싶다면 추천드려요:-)\n런치 메뉴로 먹은 호박튀김은 인생 호박요리입니다. 파스타도 정말 맛있었어요!"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0NFkyZ2tnRRAB",
            "text": "정말 최고!!! 환상적인 음식, 분위기.\n다시 가고싶어요."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wdGVEbDRNRmxXWWtsV1ZERkpla0Z5Tkc1cVRtYxAB",
            "text": "I've been to this location twice, and this time I came to try the chicken parmigiana with rigatoni: it was simply perfect. Worth every penny. The waiter was also very attentive and careful, asking if I had any dietary restrictions or allergies. The pasta was cooked perfectly al dente, just like in Italy.\n\nEven though I arrived just 30 minutes before closing, the restaurant was full and busy for a Wednesday.\n\nI'll definitely be back and recommend it!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKcWMwTllVa1l4YldObGNXcDJTRzFpWmxsdlFYYxAB",
            "text": "La Pecora Bianca is my go-to Italian restaurant in the city. I have eaten here countless times over the years, and I love taking family and friends when they visit. Everyone always loves it! Perfect atmosphere, friendly staff, and tasty food, great for giving visitors and locals an enjoyable New York dining experience.\n\nThe food quality is always top-notch (by far my favorite pasta dishes and meatballs in the city), and the prices can't be beat for NYC."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSWGFVcE5NemwxZERScWVFcEZORGM1VUhjeGNIYxAB",
            "text": "1-Amazing service\nJaimie, was the sweetest. She was very attentive of us. I love how she gave us time to catch up while grabbing us some water. Definitely kept our drinks coming. Thank you! 🙏🏼\n\n2-Amazing food\nRecommendations\n-Little Gem Cesar Salad\n-Meatballs\n-Rigatoni\n-Gramigna"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNZkdfNy1obmF2OXJnRRAB",
            "text": "Cute brunch spot! More expensive than i anticipated for such a spot and for such portions. Fancier and more hip locations cost less. But definitely cute. Nice open space. Bright interior. Welcoming and friendly. A good spot for family or friends who want to grab a quick and calm bite. Kid friendly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OTVFuZDZja1puY1RSTGVuRkdiazkyYW0xcldXYxAB",
            "text": "Next up is La Pecora Bianca Midtown, a sunlit brunch spot we discovered on a warm Sunday, where my friend and I met up with a lady we had connected with a couple of weeks prior. The city felt gentle that morning—light spilling through the streets, a calmness beneath the usual hum—and stepping inside, the café reflected that same ease. The interior was charming without effort, and the outdoor seating in particular felt inviting, a quiet pocket to enjoy both food and conversation.\n\nWe started with a flat white, flawlessly crafted, its silky texture and balanced espresso immediately grounding the meal. The coffee set the tone, warming and composed, a perfect companion to the culinary delights that followed.\n\nFor our brunch, we shared:\n•\tLemon Ricotta Pancakes – soft, airy, and bright with citrus, accompanied by a luscious blueberry compote and a dollop of whipped crème fraîche. Each bite was layered, sweet yet balanced, light yet indulgent.\n•\tAvocado Toast – elegantly presented with cherry tomatoes and pickled red onions, creamy and fresh, a classic elevated through subtle seasoning and attention to detail.\n•\tEggs Norwegian – smoked salmon and tomato hollandaise over perfectly cooked eggs, rich and savory without ever feeling heavy.\n\nWhat struck me most was the harmony between food and atmosphere. The space itself felt thoughtfully composed—comfortable, warm, and luminous, with the outdoor area offering a quiet pause from the city’s rhythm. Jordan, our waiter, was attentive, kind, and unobtrusively engaged, making the experience feel personal and welcoming.\n\nLa Pecora Bianca isn’t just brunch—it’s a crafted experience, where the attention to detail in both the plates and the surroundings invites you to linger, savor, and enjoy. It’s one I would return to without hesitation, particularly on mornings when the sunlight is just right and conversation flows easily."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUFozUTJiVkZsUW5CWkxYaEtOMGhyTmtaT2VVRRAB",
            "text": "If you do nothing else order the Tiramisu - it is  phenomenal. The parm is great, whipped ricotta, Toscano salad (lemon vinaigrette), also strong choices. We had a 5:30 res on a Saturday - early so not too crowded for its location. Thoroughly enjoyed"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KaFZqVXlOM1pLUjFaeU1GTnFVMlJ2VmxRemJuYxAB",
            "text": "Had dinner with friends drom work.\nAmbiance very nice, we went there @5pm so still less people.Our choices turned out perfect.We did the pre fix dinner.Our server Alexander was attentive and friendly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKZk55MUZUbVpFUnpaUGF6VlNYM2RNTTI5Wk1rRRAB",
            "text": "We dined at this Italian restaurant as a group of six and opted for the Restaurant Week menu, which was an excellent deal—three courses for $45 which included the Branzino as main. The service was attentive and thoughtful, even though there were moments when it took a little longer to get items, likely because the restaurant was very busy. The food overall tasted good, and I appreciated touches like changing the silverware between courses and promptly refilling beverages. The Nutella cannoli was enjoyable, though I would have liked a stronger Nutella flavor to really stand out. Overall, a great value and a pleasant dining experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPZk1udl9qZ2R2N1RREAE",
            "text": "Amazing food and service! The pasta is homemade and delicious! Also the tiramisu for two is not only cute but delectable!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VQREZqOHVydElhQjd3RRAB",
            "text": "The Pre-Fixe lunch is $30. Pay attention the soup is chilled, I didn’t read the menu correctly and unfortunately did not enjoy a cold soup. The chicken sadly was also dry. Everything tasted so so. Out of the 4 dishes the kale & shrimp salad was the only dish we really liked. Surprised no fresh bread was served, usually an Italian restaurant will have something nice to start with before you order."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKakV2TS1Pd29QbzhnRRAB",
            "text": "We had a great dinner at La Pecora Bianca midtown. The staff was attentive and the food was amazing, though we wished the portion could be larger!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZNVJqTlFXWGhtYzNGMWIxSmtNVGR0TUdaWVNFRRAB",
            "text": "The aesthetics of the restaurant are really warm and cozy. The food is delicious, although I'd say portion sizes are on the smaller end for what you're paying. But still worth it in my opinion for the quality you're getting."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vMmJtUnpPR2g0VWxGM2ExUk1VMGhJV1dJeFNuYxAB",
            "text": "I loved the vibe here the meatballs melt in my mouth.  The pasta was good my husband wasn't a fan of his roasted chicken but it wasn't bad. We'd come here again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taR01HaHNWbTkzWm1oWmNqWkNOelZaYUVNeVNGRRAB",
            "text": "Fresh food. Had branzino - done nicely with olives and spinach. Boneless whereas it could be more authentic with bone-in presentation. Very nice setting though a little dim on the lighting."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkTWRIRmZaRFV5TUc5Rk1WZDFSbFJ6UjFRNFdVRRAB",
            "text": "Highly delicious food. Staff are very friendly, accommodating and professional. The farro salad and gramigna are personal favorites. Get the tiramisu for two (don’t worry, it’s still good after a couple of days in the fridge. Whether you’re two or fewer).\n\nOnly eaten here in-person once, had a great experience but I get takeout frequently. Their food is consistently delicious and the girls at the door are sweethearts. It’s hard to remember names but easy to remember their smiles and friendliness- then the food speaks for itself (and the restaurant).\n\nCheers and thank you to the whole team! 🤌🥂"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVmNuSmFTRjkyVjJwMGJXTnROVU5HU1ZsVlgzYxAB",
            "text": "Our waiter, Jordan was perfection. He made sure to get us in and out in under 45 minutes so we could make it to our show in time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCMmVsWnRPV1psVkV3MFMzRTFWVFprUlU1T04yYxAB",
            "text": "One of the best things about this restaurant was that we were not rushed, which may have been a function of the hour we arrived for lunch. Service was good if  slow once we placed our order. The waiter was very friendly. The menu selections were limited. According to the menu the quality was first rate. I couldn't tell it from the food that I was served. I ordered a pork chop with a sweet red, green and yellow pepper topping that sounded delicious. The chop was overcooked; The dish was so overspiced with black pepper that I could hardly eat it.\nAnd, the door to the restaurant is extraordinarily heavy making entering and exiting from the restaurant difficult."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bU16SW53RRAB",
            "text": "Such an amazing time celebrating a birthday tonight. The hostess Daisy, was so warm and attentive, she made sure we felt welcomed and taken care of. Our server Alex really took care of us making this not only a place for delicious food, but a whole experience. 10/10 would recommend."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuMS1MQkRREAE",
            "text": "The pastas were chewy and delicious and flavorful without being too overpowering. Highly recommend crispy brussel sprouts. The cauliflower appetizer was just mediocre. We asked for bread which was not great and cold. The tiramisu was…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidXByWWxRRRAB",
            "text": "We really like the service here, very professional and friendly. The meatballs and pasta that we got were as good as we expected. The only letdown was the steak, the fries were good and generous but the steak was more medium/welldone (at both ends) rather than the medium rare that we asked for."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVFUxWnhTVzlGWDJOZmJWY3lRMGMyVFRjelZFRRAB",
            "text": "We really appreciated the great atmosphere and the lovely service from Giovainne. Unfortunately, we found the food to be slightly warm. While we did enjoy the meal, we would have loved it even more if it had been served a bit hotter. It’s a bit disappointing, but we’re hopeful our next experience will be perfect!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5cklybHlnRRAB",
            "text": "Came here to celebrate my niece's birthday and I'm so glad that we did. All of the pastas are made in-house and you can definitely tell! Our server Alex was spectacular and had a great knowledge of wine. His personality added to the overall experience we had. Definitely recommend this place 100%"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bE8teXNBRRAB",
            "text": "Ordered the garganelli because I am a big fan of mushrooms. Definitely tastes the strong garlic flavor and a bit on the salty side. Has generous portions. The atmosphere is amazing for get-together but can be crowded during peak hours so best to make reservations."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxZ0t2SEtREAE",
            "text": "Excellent service and food! We didn’t have a booking but they were able to accommodate us. Despite sitting outside, the heater, food and excellent service kept us warm. We had the zucchini fries and linguine puttanesca with lavender spritz, which hit just at the right spot!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nelduVnlXVGRXVEhZMGVFbEtWMGQ1YkVwcmVFRRAB",
            "text": "The place was packed. Motion everywhere. Bus boys and waiters pushing to turn the table over. There was no Perone beer (please). The only real special on the menu was the Chicken Parmesan (sucked). No bread. I didn't pay(probably water charge i bet) but whatever the tab was, it was way too much. Plenty of other Italian restaurants."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vd1gzcEtNV0l4TlU1c1VEUndNa2RHYzBkRGEwRRAB",
            "text": "BEST Aperol Spritz’s!!  Anyone who knows the Aperol Spritz, knows that the proportions HAVE to be perfect for it to taste its best.  They are consistent here every time!!  Food is so great as well :)  Friendly and timely service.  Thank you!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxaWItY1pREAE",
            "text": "My friend and I wanted to have brunch in a cute place, and decided to eat here! The inside is super nice and modern, and there was more than enough seating to go around.\n\nJust a quick tip, you can get a free cocktail when you order an entree for brunch! It’s a solid deal!!\n\nI got the gramigna pasta, and it was so good. Their pastas are all housemade, and you can tell. I’ve never seen a pasta shape like this before! It went well with the lavender spritz, which was super cute and kinda funny looking with the long stem of lavender they speared through it.\n\nMy friend got the eggs benedict, and enjoyed it as well! She cleaned her plate pretty quickly.\n\nWe’ll definitely be back!! Honestly, the free cocktail with each entree deal sealed the deal for me!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cE5yYjl3RRAB",
            "text": "It was so good. Sever was kind and nice. Food taste was two thumbs up. But I felt like the food was coming out in a rush. Generally, I'm satisfied and I'm thinking of visiting here again. :)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFeFRqTlFaR05zTlhCU2NtVnNOalpFYVhsT1dsRRAB",
            "text": "Amazing restaurant after a stroll around the Natural History Museum. Don’t skip dessert!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NElfZmFnEAE",
            "text": "Stumbled upon this place after seeing someone get served, everything about this place is amazing. The Burrata Appetizer was amazing, the Caesar Salad was light but great, the Chicken Parm was very filling. Also, the bar will leave you quite pleased. The servers were very friendly and accomadating, especially Javier. If you ar in NYC, add this place to your list."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prMVFWWkdjV1ZOUkRCV05HdHZkbUp4TTFneGJYYxAB",
            "text": "Thank you so much Jordan! Love all your recommendations!"
        },
        {
            "date": "7달 전",
            "language": "it",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aUlmNm9BRRAB",
            "text": "Un bel ristorante italiano a midtown. Piatti gustosi della tradizione italiana con un tocco bio healthy. Illuminazione e acustica da rivedere. Buona carta dei vini principalmente italiani. Servizio rapido. Prezzi medi."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOMFh6aERjRGc1V21sT2JXdG1iRkpqZFZCTWVVRRAB",
            "text": "I’m not sure if they have a well paid Saucier in the back or if they’re recipe book is just that strong, but every single sauce I tasted when I was here made me feel warm and happy inside. The chicken parm was perfection and the vodka sauce was equal parts creamy and delicious. Everything I ordered got paired with that vodka sauce eventually… Our waiter was excellent and I’m cursing myself forgetting his name. We will be back ASAP!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSUk1IZDFhVWxzWDNOelRuSXllR2R2WDNseVNsRRAB",
            "text": "Happened to have dinner here during restaurant week. The food was good for the price point, but I was not a fan of the ambiance. Personally, I don’t care to spend 90+ minutes dining in the dark (and I do mean dark as the lights were off) and it took a long time to get the check because our server didn’t tell us we could pay using the QR code on the table. I would consider coming back earlier in the day."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5UGFUUnlObXhDVW5oVU1qWlZTSEoyUzJ4amIzYxAB",
            "text": "Extremely noisey and not very authentic Italian food. The family style is nice, but it's not good if you want to speak  with the people you are dining with. Odd types of dishes, for example, mediocre burrata with figs?! An Italian would serve high quality burrata without the figs(....maybe with tomatoes, olives, and/or avocado). Disappointing for an Italian restaurant."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNleDZ5NzVnRRAB",
            "text": "Thoroughly enjoyed the Roasted Cauliflower and a range of Pastas (Bucatini, Rigatoni, and Garganelli). This was our first visit to this location and thr second visit to a La Pecora Bianca. Love the consistency and high quality experience that both locations offer. Highly recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3OE1UZ1FBEAE",
            "text": "a little pricey for the amount of pasta but very yummy. great service waiter was so friendly"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKVFd6X2IyemVmUWRBEAE",
            "text": "La Pecora Bianca never disappoints! The food is absolutely delicious—fresh, flavorful, and beautifully presented. Every dish I've tried feels like a comforting yet elevated experience, from the handmade pastas to the seasonal ingredients. The ambiance is stylish yet relaxed, making it perfect for a date night, a solo dinner with a book, or even a quiet lunch to reset and recharge.\n\nAs someone who values intentional living and little moments of joy, this place feels like a reminder to slow down and savor life—one bite at a time. Highly recommend if you’re looking for a spot that nourishes both the body and soul."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNDVtWDdnRRAB",
            "text": "Wonderful place: excellent service, amazing atmosphere and wonderful food.\nGabriel was very kind and attentive.\nI came here countless times and still choosing it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMaHAyR0p3EAE",
            "text": "I love this spot! Great food, courteous and friendly staff. Very convenient location, perfect for a business lunch and a nice cozy dinner atmosphere. The interior is classy while the prices are reasonable. No need to make a reservation for lunch, but I'd recommend getting one for dinner. The bar area is nice and spacious in case you don't have a reservation and need a drink while you wait for a table. I love the bucatini and burrata and their salads are actually filling. Good wine selection too. They have a nice private dining room for rental with a very professional event coordination team."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSejZIME93EAE",
            "text": "AMAZING! It was our last meal in NYC before catching our flight and me and my gf absolutely were in heaven at how great the food was. Atmosphere was gorgeous, light and uplifting and service was top notch! The biggest win was we didn't know they had a special during weekend brunch that if you purchase an entree you get a complimentary drink. We had the lavender spritz and it was so good. Everything we ordered was great and I have definitely marked this place as a spot I would come back to on my next visit to the City. We had the Farro salad, Lavender spritz, Graminga (OMG, I can't stop thinking of this pasta) and the Tagliatelle with Burrata."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vMFRqTlBPVkJRY0hGb1RGbDNiakEyVFROdU9YYxAB",
            "text": "great atmosphere, great service, the fried calamari and meatballs were excellent. Only thing lacking was the caeser salad; not enough dressing and slightly soggy. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWlZIZHFPRVp0VmpsaFNuSnlTVjkzUTJwMmFXYxAB",
            "text": "Save room for the tiramisu, it is the best I have ever eaten. The zucchini chips and fried artichokes are also outstanding. We shared an entree, the chicken parm with vodka sauce which was delicious. Our server was so nice and took great care of us. It was a perfect night to eat outside. Best evening ever."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2LXEteERnEAE",
            "text": "Such an amazing place ! I really enjoyed so much this place, waitress are so kind and patient, the food, drinks, appetizers and desserts are the best from the best ♥️♥️ I’ll definitely going to make a reservation again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNua29DOGVnEAE",
            "text": "We had a great experience! The food was exceptional, and the service was good. We were a large group, and everyone left happy and satisfied with their orders. Definitely recommend getting the tiramisu—it's a must-try!"
        }
    ],
    "reviews_count": 69
}