{
    "name": "Benoit New York",
    "place_id": "ChIJ397qiflYwokRx2AOUyRXMMo",
    "grid": "MN5",
    "address": "60 W 55th St, New York, NY 10019, USA",
    "rating": 4.4,
    "user_ratings_total": 1138,
    "phone_number": "(646) 943-7373",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVlVXNVpVMFprTkRKM1QwbHpiemxwVDBWQk9VRRAB",
            "text": "Great service and warm atmosphere. Food was delicious."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGc1VVTjBWbm93VjNWU1FqUk5Va3RzTWpVM0xYYxAB",
            "text": "An elegant French bistro by Alain Ducasse. The ambience of the restaurant makes you feel like you're in Paris - it's elegant and not too much over the top. A lot of effort has gone into branding - everything from plates to napkins have Benoit logo on them.\n\nThe a la carte menu is composed of classic french items plus there is a special simpler lunch menu. We opted for the lunch specials that were generally delicious however remarkably varied in size - e.g. the country salad was rather large while the citrusy branzino carpaccio portion was tiny at best. Grilled dorado with beans - classic and tasty; the veal blanquette was hearty and spot on after the carpaccio. Fresh madeleines on the house at the end of the course was a nice surprise."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kRUxXdDBlRlZtVTFCdlJFMW1Wa1ZhWkZwVmIxRRAB",
            "text": "Benoit in Midtown delivers an elevated dining experience that feels timeless and refined. The French bistro classics are prepared with exceptional care, from the tender duck confit to the perfectly seared steak frites and the smooth, delicate crème brûlée. Every dish reflects a level of precision that honors true French technique. The service is warm, polished, and consistent, with a team that anticipates needs and ensures each detail feels intentional. The setting is elegant and welcoming, with mirrored walls, rich textures, and a distinctly Parisian atmosphere that makes every visit feel special. Dining at Benoit is a reminder of how effortlessly New York can blend sophistication and comfort."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pod2VGTkZhVTlUVDFGQ05sSndZWFZQV2xKeE5GRRAB",
            "text": "I wish I could give more stars, but the dinner here was a let-down. I found the restaurant via Reddit, which doesn't typically disappoint. We had a 9:30 pm reservation and a lovely French waiter who started us on the right foot, but the experience went downhill from there. We were told the kitchen was closing within 30 minutes, so we quickly ordered and received chewy, undercooked steaks with extremely dull knives. Comical how challenging it was to cut through the meat. After a shift change, our initial waiter left and the experience worsened. The staff began to congregate around the remaining tables, with one gentleman twiddling his thumbs as he watched guests finish their meals. It made my sister who I was treating to dinner feel awkward and uncomfortable. I understand the fatigue after a long shift, but the restaurant should better manage this by turning over staff according to the number of remaining guests. We finished the meal with a chocolate souffle for dessert, a recommendation from our first waiter, and that was a small saving grace - but ultimately not enough to get us back. If they don't want folks there after 9:30/10, I suggest not taking dinner reservations beyond 8 pm."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiN2N5ODdBRRAB",
            "text": "Revisit\nFood and service. Excellent as always.\nMy trio onion soup, fries, pizza-like tart flamm.\nWine from 9L Salmanazar great. Worth $26.\n\nOnly pet peeve... hommes toilet reeks. In today's world with fabreze and stick diffusers... need attention downstairs\n\nNot as crowded. Great for walk-ins... but perhaps preferring boulangerie or le Boune Soup?\nStill my favorite, better than Jean George's Tin Building.\n\n--------\nHaven't been here in awhile.\nEmails, French Olympic (TV in bar!), why not?\n\nFood great, still much consistently pleasing old-timer. Best French fries (aka frites) in NYC (priced handsomely @ $12). Onion soup not so salty (but may have preferred more crusted cheese). Bread & butter with B for Benoit! Duck was nice. For $60 as 3 course menu we ordered escargot, steak, creme brulee.\n\nAlso ordered hors d'oeuvres trio.. deviled egg, rabbit foie gras pate, rillettes... our favorite deviled egg (aka egg mayo).\n\nService attentive. Perhaps excessively. No harm done diligently clearing, but no need to push for ordering more.... charcuterie, another glass of wine, etc.\n\nIf I compare Benoit with Tin Building. (Lol.. Alain Ducasse vs Jean George).. there are in's and out's. Personal preference is better escargot and less creme brulee.\nNearby Boucerie has different vibe... grander open venue vs cozier ambiance @ B... (I miss Remy!)"
        },
        {
            "date": "수정일: 3주 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jdE5UTklkWE5VYWkxYVpISlZaek5JV1hadE4xRRAB",
            "text": "Um pedacinho da França em Nova York. 🇫🇷✨\n\nNo coração de Manhattan, o restaurante Benoit recria com maestria o espírito do bistrô parisiense de Alain Ducasse um dos chefs mais consagrados do mundo, detentor de mais de 20 estrelas Michelin ao longo da carreira.\n\nEm New York   agraciada pela técnica impecável do  Executive Chef, Alberto Marcolongo and chef Igor Cabral, que entregaram um menu degustação de pura elegância.\n\nEntre as criações, compuseram o menu o delicado tapioca rice com tartare de carne e trufas, o foie gras toast em brioche,  os camarões mi-cuit com caviar e molho de lagosta, o croque trufado de presunto e queijo, a sopa fria de tomate, os clássicos escargots, além do branzino grelhado.\n\nTudo finalizado com a sutileza irresistível de um caramel crème brûlée.\n\nCada prato chegou à mesa como uma verdadeira explosão de sabores, equilibrados, precisos, sem excessos. Do clássico reinventado ao detalhe mais sutil, tudo pareceu desenhado para surpreender o paladar e despertar memórias afetivas.\n\nÉ a prova de que viajar também é explorar culturas pela gastronomia. E aqui, o sabor da França encontrou a energia de Nova York em uma experiência que fica na memória com gostinho de quero mais."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxRWJGcE5hMHBVTURVekxVOXZkRWg2Wm5GNE4yYxAB",
            "text": "Great French cuisine in the upper Manhattan region."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCeFdFUllaV2RUVVcwNVh6QjRPVzlwU1hoZk1YYxAB",
            "text": "Excellent service, perfect salad, burger and frittes!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMWVrOXBZazF0V1hnNE5uWmxlV0pqT1VKUk4zYxAB",
            "text": "Excellent authentic French cuisine wait staff was amazing!!! Great place for pre Broadway dining."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkNWFrWTJWVmRvUnpKc2JrSkZlR2hQYkV0MVptYxAB",
            "text": "Amazing service , awesome food.  Thank you"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kclFXUlBXV3cxUkY5VmQydE5Za3RvVFdGMWRFRRAB",
            "text": "It’s very French in the best possible way.\nThe service is great and the food is incredible.\nThe filet mignon was really tender and flavorful.\nTheir liquor selection is on point.\nMaybe I’ll take a fifth of a star off for the profiteroles that kinda didn’t match the level of the rest somehow but otherwise it was an absolutely outstanding experience that I highly recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWd04wWlRZemxXWWpFd1lVdGZOVTQ1VVY4dGFWRRAB",
            "text": "Excellent French food coupled with that classic European service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTGQzSk5kRmhmYUhsbFltRTRlV0ZYVVhkYVluYxAB",
            "text": "The food was good, but felt somewhat overpriced for the quality of the dishes we got. The duck and snails were the highlights.\n\nWe ordered the Dover Sole, and we watched while three successive waiters tried and failed to debone it. Was a little disappointing for what was one of their more expensive dishes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGSlVWZEpUMTgzYWxjd2NGZEZNMGRzVWsxTlZsRRAB",
            "text": "I’ve been here a few times. The food is mostly good. The chicken is either fantastic or meh, maybe the chefs night off. Tonight the sommelier hustled me off a 2018 St. Emilion to a 2011 for a substantial price jump. Then served me a 2018 instead. When I complained they said “deal with it”. I’m pissed off."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aamFtNURibk4zTFZKU1QwZDVSamQwTUROTlRVRRAB",
            "text": "The food was unfortunately disappointing. I had high hopes since it was an Alain Ducasse restaurant. All of the proteins (escargot, halibut, and veal) needed some love; salt, acidity, or just something. Simply put the food was a bit lacking. Not only that, the service was a little bit questionable. I asked for extra baguette if possible to go with my escargot. It took more than 15min to get my bread and I'm already more than half way done with my escargot. The kicker at the end, we got our check. We were charged $8 for still water. We didn't get like a bottled water like a Saratoga water, we got what seemed like filtered water from a fountain. All I asked was why was I charged. I don't mind paying that extra couple dollars but it just didn't make sense to be charged for filtered water. Instead of informing me of the reasoning, they took back the check and got rid of the charge. The manager (I think) who was handling that situation didn't even say sorry or informed me of what was happening. To me, that quick action of getting rid of the extra charge seemed very sus to me like they have done this to other guests who don't properly look checks.\n\nBut other than that, wine list is pretty good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUGFXSXhlWEJQVEVGa1NIbElWazlITkhKSVQzYxAB",
            "text": "I skipped the bus and walked just to try this place everyone talked about. The staff at Benoit New York treats you like old friends. The meal was good and staff was excellent. Staff members are well-trained on menu items and deliver top service. Keep this place as knowledge for the deserving."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cFpHcEhjbUpQY0dad05tOWlXVlZOY0doYU0zYxAB",
            "text": "had a first date here on april 30th, 2019. we are now married with a child and madly in love here in 2025. thank u benoit"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNMVl6bEliWGgxTUZSdmVreFhObFV6TUVGc01sRRAB",
            "text": "Always love it here! We love the foie gras, escargots, veal sweetbread and chocolate soufflé! One of our favorite spots in the city!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OMGIxbFFaVk5hUnpkSlVsZDRjelpFVjBwR1VFRRAB",
            "text": "Beautiful testaurant, white tablecloths, excellent service and delicipus food !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5QlNpMUVWMHByTTFadFprbEpNRFV4ZVZKaVFrRRAB",
            "text": "The food was delicious!!!!!!!\nWithout a doubt, it’s the best French restaurant in NYC"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sQmR6bGhaakphUkVJNFZFOUJRblE0UkdKeFJHYxAB",
            "text": "Was there last night for Restaurant week with a friend. We were not impressed with the food. It is never good when you leave still feeling hungry...both of us."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oRmVGVmhRazUzYlZRMlZtZE1VekZHWkhCb2JHYxAB",
            "text": "Just the right amount of everything. The team delivered service that stood out. The experience here exceeds imagination. Skilled cooking paired with distinctive menu choices. The good feedback is accurately reflective."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WVVdIVkNiVVJFV2xkbGF6UkZOUzB3VlVWb2FFRRAB",
            "text": "Even better than the first time. Service and atmosphere are great. The food is amazing!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURad091d2FREAE",
            "text": "My dinner at Benoit was excellent in every way! We were celebrating my friend's birthday so I chose French cuisine which we both love. Neither of us had eaten at Benoit and with Ducasse at the helm we could look forward to food excellently prepared and served. We ordered Chilled Gazpacho (spicy yogurt ice cream), Red Tacos (tomato, crab & olive), Hamachi Crudo (peach & coriander), Dover sole à la meunière (grenobloise sauce), Quenelles de brochet (Nantua sauce), Pistachio soufflé (Raspberry sorbet), and Selection of 3 mature cheeses . Our gracious server S. Maciej recommended a Sancerre Flouret to accompany our dinner which was dry, full, fruity and delicious! It was a perfect!\nThe ambiance is warm and comfortable. The service all around excellent but especially our server S. Maciej!  The music selections, all kinds of jazz, were intrusive rather than complimentary. Jazz would be better suited to a cocktail/wine bar rather than a restaurant of distinction.  That's an easy fix. We had a corner table away from the center as I had requested which was an ideal location for conversation and observing the restaurant in motion. They serve two French classic standards that very few French restaurants still have on their menu, i.e., Quenelles and Sweetbreads.  The Quenelles were perfectly delicious and I will return for the Seared veal sweetbread (Swiss chard & black olives)."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SQ1ZrTnJWSGRqU1hsMGQxSnhUbXRqVDNsM1NsRRAB",
            "text": "Reminds me of paris, impeccable service and atmosphere."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kQlpGUTFUa014VlVneVR5MVNOM1ZEYm5KTWNYYxAB",
            "text": "An extremely nice place!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNlYwMVRiR2xzZDNadk5EaEpjRGxRYTE5RU1IYxAB",
            "text": "Delicious French bistro!\nBeautiful decor and great service!\nWorth giving a try."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTFFXNURSbWxXWVUxelJXcHdkamxaWlUxMGVFRRAB",
            "text": "Benoit is a gem in Midtown! The food is consistently outstanding, and the service is among the best of any restaurant in Midtown. The servers care very much about your experience and are efficient and timely."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSFFsWk1TMVk0TWtSRlJFb3RSamgzYnpoMlFWRRAB",
            "text": "Absolutely reminded us of Paris. Chic and elegant. The vibe, the food, the details\n\nThe maitre and the staff were courteous and so professional. The bartender Nicholas was so friendly and knowledgeable with the wines and the menu. His recommendations of the tart Flambé and the lobster spaghetti were spot on for us."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWlIzbG5XR2xCYjNWaVZrTk5kREp6UjJ0b1gyYxAB",
            "text": "I had never eaten here before, and my partner had given me a beautiful Valentine's Day gift.  We were thrilled to spend a romantic evening together and have a nice night out.\n\nUnfortunately, an unforeseen occurrence occurred in which food was accidently spilled on both of us, including my fur coat, which required dry cleaning.  It changed the tone of the evening, as we had to concentrate on cleaning up rather than completely enjoying the experience."
        },
        {
            "date": "4달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNYmRuN3JUd2JEUEpREAE",
            "text": "앤드저스트라이크뎃에서 캐리가 식사했던 식당입니다.\n\n웨이터의 응대, 분위기, 음식 맛 다 훌륭합니다. 테이블 간격도 넉넉하고, 분위기는 조용하고 아늑하며 식당 내부도 깔끔하며 근사합니다.\n\n에피타이져, 빵, 메인요리의 맛과 섬세함 전부 다 최고였습니다. 특히나 생선요리는 소스도 소스지만, 질감이 아주 부드러워서 먹자마자 감탄하였습니다. 다음에도 재방문할 것 입니다."
        },
        {
            "date": "5달 전",
            "language": "pt",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VPQ2J6b1gzMUlEU21RRRAB",
            "text": "Fiz reserva por indicação, mas não chegou nem perto das expectativas. Não voltarei nem recomendo. As mesas praticamente coladas uma na outra, comida razoável, apresentação dos pratos a desejar… de bom, só o atendimento 😔"
        },
        {
            "date": "5달 전",
            "language": "pt",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VOTzctT1ctNGFyZEVnEAE",
            "text": "Não gostei de nenhuma refeição! O local e o atendimento são bons, mas não vale o preço que cobra! NÃO RECOMENDO!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKMy04TVBsdHBHV09BEAE",
            "text": "Nice French bistrot with a real bistrot ambiance. One of the best onion soup outside of France and the sweetbread  were amazing. As a French, I was very pleased and Charles is amazing."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbnQzTG9RRRAB",
            "text": "A modern bistro by the recognized Alain Ducasse offers a piece of France in New York. Traditional and iconic French cuisine specialties as Escargots, Onion Soup, Duck Confit and Steak Frites. Leave room for dessert: the  Apple Tarte Tatin and the Pistachio Soufflee are a must. The wine list offers a great selection of choices. Service is impeccable and the atmosphere is refined. Highly recommended!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPTHFvX2lMb3NqTmZnEAE",
            "text": "Had the worst experience with the hostess, which is a shame because we otherwise loved this place. We live nearby and notice it was fairly empty around 5pm so we walked in for dinner. After some time of her ignoring us, the rude hostess told us she could only give us the center sans tablecloth tables since we had no reservations, despite openings available and the restaurant being almost empty at the time. The food was very good and the service was otherwise great. It’s a shame they’ve got someone so rude at the door."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLLW4wdEN1aThpMUV3EAE",
            "text": "5-Star Review of Benoit New York – A Timeless French Classic, Elevated\n\nBenoit New York delivers a masterclass in brasserie brilliance. From the moment we arrived, the ambiance struck a flawless balance between Parisian charm and Manhattan sophistication. But it was the cuisine that truly left its mark.\n\nThe steak—perfectly seared, richly seasoned, and tender beyond expectation—was easily one of the finest we’ve experienced on either side of the Atlantic. And the duck? A triumph. Crispy skin, impossibly succulent meat, and a sauce so refined it could only come from a kitchen that respects both tradition and innovation.\n\nService was polished yet warm, attentive without intrusion. Benoit doesn’t just serve food—it serves an experience. Whether you’re a Francophile, a foodie, or simply someone who appreciates culinary excellence, this is a table worth seeking out.\n\nAn unforgettable evening. Five stars, unequivocally."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOMko0dWUwLU1DVTJ3RRAB",
            "text": "The steak was fatty. One third was not fit for human consumption. The waiter did not offer to provide a better steak.  He said he told the cook.  I will never go there again"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd3JHdmNnEAE",
            "text": "The food is delicious and well presented ..staff are very attentive and take good care of you."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMmJpWVNBEAE",
            "text": "We had the pre theatre menu which is very limited. My husband had the fish and escargot which he enjoyed. I had the soup which was good but the steak was not nice especially when the waiter said it was prime meat. Would I go back, probably not with all the other choices but service was excellent and we got seated right away. Comfortable environment"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdXBLVGtRRRAB",
            "text": "I like the salads and fish at this restaurant."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveTlfcmF3EAE",
            "text": "Steak tartare was excellent. Great ambiance. Superb cuisine. Phenomenal staff"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdHBHUXdnRRAB",
            "text": "Great food, great atmosphere, and great service. I had the Nantua and for dessert, the pistachio soufflé. Both dishes were great. The soufflé is heavenly."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJczdmeThBRRAB",
            "text": "This was my first time dining here, and it was a lovely surprise from my boyfriend for Valentine’s Day. We were excited to spend a romantic evening together and enjoy a special night out.\n\nUnfortunately, there was an unexpected incident where food was accidentally spilled on both of us, including on my fur coat, which needed to be dry cleaned. It shifted the tone of the evening, as we had to focus on getting cleaned up rather than fully enjoying the experience.\n\nThat said, the staff handled the situation with professionalism and kindness. We were promptly moved to a new table, checked on throughout the night, and management kindly offered to cover the cost of dry cleaning — a gesture we truly appreciated.\n\nWhile we were grateful to have our drinks removed from the bill, we were a bit surprised that no further accommodation was offered, considering the nature of the mishap and the impact it had on what was meant to be a special evening. In similar circumstances, a more generous resolution is often extended.\n\nStill, we genuinely appreciated the team’s attentiveness and care during a difficult moment. We hope this feedback is taken in the spirit of gratitude and as encouragement to continue offering thoughtful hospitality — even when things don’t go exactly as planned."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNHQ2T253RRAB",
            "text": "Wonderful dining experience! Perfect atmosphere, delicious meal, very attentive service."
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJM1BxRlJREAE",
            "text": "Excellente cuisine ! Atmosphère agréable et très française !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOU9YVWFREAE",
            "text": "Came here for lunch.  The atmosphere is wonderful despite being in a dumpy avenue, French expats and tourists dine here as well as the more tasteful of American tourists and locals.\n\nIt was my first time so perhaps I was as cold as the service team. But they were cold in a clinical sort of way, and quite attentive. This isn't the Louis XV but it was fine. The blond woman who waited on me is so poised and first class. So kudos to her.  I ate in the wine bar area despite the beautiful dining room, I think the true experience of a brasserie is dining near a window or outside if you are dining alone even better if you were allowed to smoke (although this is no longer tres chic in France). Later in the year they have such outdoor options for dining but the wonderful wine bar area is stylishly adorned and shows a great selection of liquor and wine.\n\nTHE MEAL: Sommelier was not in for lunch. Not a big surprise. I should have given opportunity to the service staff to recommend but I had been eyeing up the Pierre Peters before I came to the restaurant. For lunch the prix fixe was only $45. So I grabbed this beside the famous Pate en Croute. This came out with a trout tartare on crunchy greens and a I believe a kind of citrus gastrique. With the champagne, this was so harmonious. The Pate en Croute on the other hand is incomparable to that produced for the Parisian Benoit.  It is quite obvious that steps were skipped in making the Pate en Croute as the aspic did not line the entire edge of the pastry and fell apart too easily. It was okay though. The tartare was the most interesting course of the meal and was certainly elevated by Champagne.\n\nMAIN COURSE: Stuffed chicken with salsify and a savory sauce.  The chicken was not perfectly cooked but eating a bite of salsify and a bite of the chicken with the sauce was very good. The by-the-glass here has a nice Pommard pinot noir I would have liked to try with this dish and once again I wish I would have been able to order wine with this meal and let the wait staff make a recommendation but sadly I had business in the city.  Overall, the dish is traditional but the chicken, which should be the feature here, was not well-sourced or cooked in such a way that didn't show its quality if so.  That being said it was better than anything you'll find around Fifth Ave and I just love salsify.\n\nDESSERT: A passion fruit pannacotta showing off the chef's Italian roots. This was quite delicious and memorable. Nouvo cuisine moreso than traditional style and perhaps that is where this chef shines. I missed out on the rum baba but maybe next time. There was a Madeline cookie freshly baked to close things out.\n\nAny restaurant will fetch a series of complaints.  This one is certainly a New York-take on the Parisian Benoit.  I don't get the sense that Alain Ducasse has neglected it though.  All in all, I'd go again in a heartbeat but I think I'd trust the service people more for honest recommendations to avoid some of the more mediocre dishes.\n\nCheers!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJN2EzZGZREAE",
            "text": "The service was, as always, stellar.   And what a wine list"
        },
        {
            "date": "7달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJa1pEcGl3RRAB",
            "text": "Fantástico! Sou fã da gastronomia de Alain Ducasse e já experimentei seus restaurantes em Paris. Uma vez em Nova York, foi ótimo saber que tem uma unidade do Benoit. O ambiente é bem charmoso e realmente parecia que eu estava em Paris. A comida é deliciosa e pedir harmonização com vinhos. Destaco também o atendimento. Boa opção para jantar romântico!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdEpUTXl3RRAB",
            "text": "Service is great, but they have white-washed the dining room, which cheapens the ambiance & atmosphere. It used to feel dark , cavernous &  cozy. Now it has the feel of a cheap 80s cafeteria or diner.  Also the food is waaay oversalted. It seems like they are covering up the bad quality of their ingredients with salt.  If you need low sodium food, be sure to mention it at the beginning, otherwise your blood pressure and thirst receptors will be unhappy. Why do they have to add so much salt, I was genuinely taken aback by the saltiness! Everything from butter, to bread, to vegetables, to mushrooms, to meat was extremely salty, and didn''t taste fresh. For how pricy the place is, I was disappointed that the food tasted like airplane meal and looked even sadder. The  duck breast was overcooked when I asked for reare, too salty and thin - I've had way plumper duck in Chinatown.  The vegetables too salty.  The salad too oily - you could taste the cheap  canola /rapessed oil. . The fries tasted like cotton, instead of crispy.  The beef tartare tasted like vomit.  The  butter tasted not like creamy cultured French butter,  but the dense cheap  plain slab from D'Agostinos. The berad didn't seem fresh.    The only plus point is the service. There are better French restaurants even in this section of midtown. Life is too short for mediocre tasting French food."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaWNTUXZRRRAB",
            "text": "리뷰도 좋고, 레스토랑 윅 메뉴보고 클래식 프랑스 음식을 기대했는데 전혀 기대에 미치지 못함. 다시 가지 않을 것."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURFMC1yRjNnRRAB",
            "text": "가성비 좋은 프랑스 레스토랑~ 다른 프랑스 레스토랑보다 저렴한 편이며 음식도 훌륭했음."
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjc1BpcDNnRRAB",
            "text": "명성에 비하면 아쉬워요"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3d05QeEx3EAE",
            "text": "Excellent lunch experience, was not too full when walking in. Service was efficient throughout. Food is the star here and had the most amazing roast chicken and roast duck mains. The duck was medium rare and the skin had a good crisp to it. The chicken was next level, not dry, flavorful, and also with crispy skin. I ordered some root vegetables as well to accompany, but the beets served with the duck and the fries with the chicken were plenty sufficient. The meal also started with a small cheese puff then and a slice of crusty bread, both quite good. There is an extensive, high quality choice of wines by the glass, so also had a wonderful Chardonnay with lunch. I look forward to returning again!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNFBYNVhnEAE",
            "text": "Benoit New York is a gem among the bougie dining spots near Times Square. From the moment you step in, you’re greeted with an ambiance that’s sophisticated yet warm—perfect for a romantic date night.\n\nThe service truly stands out; the servers are not only fantastic and good-looking but also genuinely pleasant and attentive. They offered great recommendations, and we thoroughly enjoyed every dish we tried. The food, while served in smaller portions typical of upscale restaurants, was absolutely delicious.\n\nIf you’re looking for an elevated dining experience with top-notch service and a cozy yet chic atmosphere, Benoit New York is worth a visit. Highly recommended!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBellqbDJnRRAB",
            "text": "Outstanding! How did my husband & I not know about this fabulous restaurant with amazing food. We tasted their cassoulet at the famous D’Artagnan Cassoulet War (they won for traditional  favorite) and right away decided to book a few days later for my birthday. Culinary excellence in every way."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3aC1XbGRnEAE",
            "text": "A very nice classic French bistro with approachable but elegant presentation. The food was great and they have quite an extensive wine list. The unexpected surprise of dinner has to go to the side of french fries, they were perfectly cooked and really complemented my steak and red wine."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGM2EyazJRRRAB",
            "text": "Perhaps the most authentically French of any restaurant in New York, Benoit was a mostly enjoyable experience. We had the chicken for two which was delicious. The pate to start was also very good. The profiteroles were slightly disappointing as the ice cream was separate from the pastry. The tasteless French bread was a big disappointment, the green beans were very plain.\n\nService in the dining room was particularly good with a pleasant waiter who made excellent recommendations on the wine.\n\nOne minor gripe is they asked to clear our plates three times when we clearly weren’t finished.\n\nVery major gripe though was the use of the loathsome device where you “pick a tip” when you pay your bill.  To have this at a restaurant of this purported quality was frankly insulting.  We got a drink at the bar before and in addition to not being able to transfer the bar bill to the table got the loathsome device there as well.  So we got a double dose of being made to feel cheap if we wanted to tip less than their 18% minimum choice. Alain Ducasse really do you need this?"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmOWIzNk9REAE",
            "text": "What a gem nestled in the heart of midtown. We came here for my husband's birthday and Maciej along with the rest of the staff were incredibly attentive. The food was wonderful, the atmosphere was quiet and intimate and the experience was singular. Thank you for an evening to remember!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKblBhNE13EAE",
            "text": "Have eaten at Benoit at least a dozen times over the years. It's by far the best French Cafe style restaurant in Midtown Manhattan. The food and service have always been amazing, I also love dining in the bar area. If you're looking for a French Bistro type place in Midtown, it doesn't get any better than Benoit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURONV8zSEtnEAE",
            "text": "The French neighborhood local restaurant atmosphere at Benoit is terrific. My skirt steak was cooked perfectly. My dining partner enjoyed the escargot. The sauce accompanying his seafood dish was excellent, prepared exactly as he expected. The service is friendly and efficient, not overbearing.  We really enjoyed our dining experience here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGMlBuNE1nEAE",
            "text": "I had dinner at Benoit, and that was a very enjoyable experience.  I really liked the restaurant's decor as it reminds you of classic French bistros.  The service was top notch, and our server's recommendations were spot-on.  All dishes except for one were nicely presented and perfectly cooked.  That one dish that I'm talking about was Confit Halibut.  Even though it was nicely presented, it was way overcooked.\nDespite that one bad dish, I wouldn't hesitate to visit Benoit again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaOHNMUC13RRAB",
            "text": "Honestly, how can Alain Ducasse disappoint? But, this is beyond just his name. It has a wonderful neighborhood vibe, and great employees that give wonderful service. I shouldn't even have to say, but the food is incredible. Definitely put this on your list, it's some of the best French bistro fare in NYC!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKLWRHTlZnEAE",
            "text": "Benoit is a lovely French restaurant with delicious food.  The staff and service was great the night we were there. We love that they serve delicious bread. They really paid attention to the presentation of our food.  We were very impressed.  I would suggest a reservation to make sure you get a seat."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNac05IcnpRRRAB",
            "text": "It was my first dining experience at Benoit and it was amazing to say the least. The atmosphere was warm and cozy. It was reminiscent of the bistros in Paris and I was beyond happy to dine in such a spot.\n\nIt was my parents wedding anniversary so we went out for a family dinner and ordered some bottles to celebrate. The sommelier Paul was the absolute best and gave us some great recommendations for the night which included the Frederic Savart L'Ouverture - Blanc de Noirs Brut - and the amazing 2018 La Grande Rue by Domaine Nicole Lamarche.\n\nTo start, we ordered the escargot and foie gras. For our mains, we had the roasted duck, skirt steak, and roast chicken. The food was all top notch, but the skirt steak was the shock of the night as it was incredibly tender and well seasoned. We ended off the nigh with the pistachio souffle, but was happily surprised when we were served some complimentary creme brulee and madeleines.\n\nAll in all, great food, great service. Would highly recommend to anyone looking for a French restaurant in Manhattan. Left extremely full and we can't wait to go again when we're back in New York!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXNXRhdzdnRRAB",
            "text": "Great place for a dress down French brunch! I find the test of a good French place is in their butter. Needless to say, the butter is stellar, better than ones I've had from France.\n\nThe experience, while it may seem high street, is just an elevated setting to enjoy home-style french cooking. The Croque Monsieur was excellent, simple, and had quality ingredients.\n\nService was excellent, with compliments to Miguel who wore several hats that day, taking notice of me in spite of working the bar. He clearly was passionate of the restaurant and serious about his drinks/food. The manager was also excellent and talked to me more like a friend, very humble :)\n\nWould come back again for a chill brunch!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhbE9hS1VREAE",
            "text": "We love Benoit. Food is delicious and service is always great! We had Sunday brunch and we took our baby girl as well. Host was so polite to help us with the stroller. Outdoor seating is chic and cute! We always enjoy to come back to Benoit.\n\nNote to the restaurant: Thanks to the hostess that walked 2 blocks to bring me the phone I left at the restaurant! I really appreciate it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNocGNlVTV3RRAB",
            "text": "Benoit New York is a contemporary French bistro by Alain Ducasse. The restaurant retains traditional French bistro elements, such as the signature red velvet banquettes. We were very enjoyed the bread and butter, bread is the key, which is very important for us. One of the best bread we’ve ever had in Manhattan. Our wonderful dinner reminds us of Paris. Benoit New York identity as an authentic Parisian bistro with a New York sensibility undoubtedly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUa3VIenF3RRAB",
            "text": "I wish I remembered to take a picture of the food but everything was delicious. The butter is made in house which reminds me of the Grand Fermage butter. The service was excellent everyone was so knowledgeable about all the dishes. The atmosphere reminded me of a classic french bistro. Cant wait to go again🥰"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3dGZTczBnRRAB",
            "text": "We went there on a Saturday night for an early dinner. The food was perfect from appetizer to dessert. We loved the way the escargots were served.  The size of the servings was just right, the chicken for one person is actually big enough…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPa0tDZmZBEAE",
            "text": "In NYC for the weekend in midtown and wanted to try something French. This is a really solid choice. Our server was very nice and overall service was excellent.\n\nStarted with several apps. Escargot, fois gras, charcuterie.  Really enjoyed all of them!  Charcuterie had a nice array of pate with prosciutto and another sausage plus some really nice baby gerkins. Escargot was really good but the flat out winner was the fois gras...highly recommend!\n\nFor dinner, I had roasted duck which was really well prepared but sadly was a little on the chilly side...no complaints though because it was really tender and tasty. Out table had an array; flank steak, halibut, quenelles.  Everyone really enjoyed their meal.\n\nWe closed out with creme brulee and lava cake.\n\nTon of drinks. Nice selection of speciality cocktails.\n\nHighly recommend!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnaU51SHpRRRAB",
            "text": "Whenever we host an Ortus Club roundtable in New York, Benoit is always our top choice! The exceptional food, ambiance, and service make every experience unforgettable.\n\nFor our recent roundtable with 18 guests, we reserved the Saint Martin Room, creating the perfect setting for both intimacy and networking."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsck9QVUVREAE",
            "text": "Went here for weekend brunch with a very limited menu and an even more limited wine list. Maybe the brunch menu doesn't do this well known restaurant justice, but it was not good. The best bite was the free cheesy puff ball things they gave us at the start and the best dish was the steak n eggs where the steak was under seasoned. We tried to order a bottle from the wine list just to be told that we shouldn't get that one, but we insisted. We were then told the last bottle went to \"the table over there\", but when we looked at \"the table over there\", there was no bottle of wine to be seen."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlczZIWlpREAE",
            "text": "Overall very good food and service. The wine list is impressive. The one thing we found a little annoying was the pace. Took 15 minutes for them to take our order, took them so long to bring the ice bucket for the wine that the bottle was nearly empty when it arrived, took too long to get the bill, etc."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4OW9XMEx3EAE",
            "text": "Service is exceptional. Food is spectacular. Cocktails are delicious. I would highly recommend this place for brunch in the city."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNeWV1VUh3EAE",
            "text": "Visited Benoit to have dinner for my birthday. It was a nice French Bistro with a warm beautiful atmosphere. The menu was well thought out and the food was delicious. However, the service left something to be desired. There were times when we felt invisible especially when the server decided to wait on Caucasians who were seated after my friend and I was. He finally waited on our table when another server heard me sharing my observation with friend. I am not one mention race but it was hard to miss that my friend and I were the only minorities in the restaurant on that day. Since it was my birthday dinner, I decided not to allow the experience to detract from the reason we were there."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwODVUNWFREAE",
            "text": "Deducting two stars because of the stingy nature of this place. The draft beer is served with one inch thick foam and all portions ate extremely small. More like kid’s menu but for adults."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobllHbWVBEAE",
            "text": "AMAZING! I wanted to expose myself to new foods, and learn about French cuisine. The waiter was amazing and answered every question I had in detail, was so friendly, and one of the most attentive people I have met. The duck foie gras was to die for and the beef tartare was so fresh!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtc19QQjV3RRAB",
            "text": "We went here for brunch. I’ll give it 5 stars for service…they are very friendly and attentive.  They offer advice, recommend without being offensive or condescending.  Overall, a very classic French feel restaurant like you are in Paris.\n\nThe escargot is fantastic; not at all overly oily or greasy…they make it just right.  The clams on a half shell-perfectly done with the right vinegar based accompaniment.\n\nThe only thing that was  not bad at all, but just ok, was the foie gras.  Of not for this, I would rate 5 stars.\n\nNext time we will try for dinner.  Looking forward to it."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwbnZTYUV3EAE",
            "text": "excellent table service. they were all very friendly and attentive and aimed to please. front hostess was a bit aloof. no hello or good bye from her. nice table setting and seating. all good quality food but duck was overcooked."
        }
    ],
    "reviews_count": 80
}