{
    "name": "Le Rock",
    "place_id": "ChIJNbTIf5BZwokRjbkuTrLZVB4",
    "grid": "MN5",
    "address": "45 Rockefeller Plaza, New York, NY 10111, USA",
    "rating": 4.3,
    "user_ratings_total": 293,
    "phone_number": "(332) 258-8734",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTVJHMXRNa0pYUTFsV2RtYzNVV2hJWjFwWU5WRRAB",
            "text": "The flavors still linger in my memory days later. Each plate surpassed our expectations. The taste here is remarkable. The staff combines humor, friendliness, and careful service. This place delivers obvious excellence."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tObk9YRlJjVzVsU201WlEwcHNjWEZRWjNoMU5GRRAB",
            "text": "We had a lovely meal here at Le Rock and the food was exceptional the pork chop was one of the best and our server Joseph was so kind and really looked after us, we were celebrating my birthday whilst in NYC and Joseph kindly served us a lovely glass of desert wine and little mini deserts as a kind gesture, we will definitely be back as the atmosphere and dining room were lovely and it’s location at the heart of the Rockefeller Centre was perfect thank you to the staff who were all so kind and welcoming, we can’t wait to be back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201WU4xaHliblV5TlhGRmN6azFOR3d5VGxoSlQwRRAB",
            "text": "Super delicious! Enjoyed the duck ragu pasta, the steak frites and chocolate mousse. It was a fantastic amount / balance of food.\n\nI thought the steak could have been cooked slightly less, it was a bit chewy, and they could have gotten away with fewer fries! (Maybe crispier fries too)\n\nChocolate mousse was rich & 10/10 in my book.\n\nManhattan was smooth. The red wine I had was delightful.\n\nGreat service. A bit weird they didn’t bring all the drinks at once? It made “cheers” a bit awkward since some had water."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GQlFsSnhVMUo0V21KYVl6WnRlVkYxYjJaUWRGRRAB",
            "text": "A surprising catastrophe.  The food was really terrible and in most cases inedible.  The duck bolognese was too salty to eat.  The escargot and French onion soup was literally disgusting.  The steak on the steak frites was acceptable but the frites were limp and soggy and the aioli or mayo that came with them was old and bad.  Service and room were fine.  They did respond to our complaints and gave as a free tower of deserts(meh but whatever) and comped the entire food order.  They were willing to comp the whole thing but we insisted on paying for the drinks and tipping on what would have been the entire bill.  So good for them.  Oh and the start was when they poured a glass of champagne into a white wine glass and when we requested a flute we were told abruptly that they do not have flutes.  That was the opening and we should have left at that moment.  I’ve never eaten at frenchette which is a very popular and well reviewed restaurant by the same owners.  We won’t now.  Le Rock needs a complete reset of their operation or it needs to close. Again they were very gracious in their response to our feedback but frankly this level of bad food in what is marketed as an amazing French restaurant in mid town by the brilliant founders of Frenchette is just not at all acceptable."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sR1NGSkVVa2xLY1ZoWlpYaHBTVmxTYWtveGNFRRAB",
            "text": "Excellent service from Boris. Delicious food. Lovely environment. Very loud at 7.00 & hard to converse."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1WVFuaE1lRUZSYTFSRWVXaDZkRmMxTkU5TE5tYxAB",
            "text": "Very good French food with a spectacular art deco bar"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGSE9XMUhiRkY0WjFodVpERmlhR3RhZFdsc2NIYxAB",
            "text": "My best meal in NYC this trip.\nI highly recommend the agnolotti!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4dlZURkhYelYzTTJOd1pVeDZPR0pWUjBSaVEyYxAB",
            "text": "Best chicken salad of my life. That dressing!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGeFEwdERhMmxuWlVkVlJUSm9jSEF4YkVoVlYxRRAB",
            "text": "We enjoyed the restaurant week lunch. Food was good. Good wine as well. I just understand whey the apricot wasn’t baked in the almond tart. The apricot was not ripe, so that was the only thing that was disappointing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkVk4zTlBTMUZaUldoVFgyaEhlRFpWUVRCdGRXYxAB",
            "text": "Great particularly after the pre-show rush, lovely drinks, surprising food. The bar is small but a nice experience if rushing"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkMFRsZHdNbWN3ZFdkTFprMWtkM2h3YVhablJGRRAB",
            "text": "Stopped in for dinner with co-workers. Service was absolutely amazing. I had the Tuna as my main course and it was so delicious. My peers had steak which they said was also good. Def worth stopping in for dinner and drinks."
        },
        {
            "date": "4달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoZk1qbENXRXBwYkhGMU1qUkhia3h2TVhkWk9YYxAB",
            "text": "Super expérience gustative dans une ambiance des plus cordiale et professionnelle."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wNWNrbDNaaTFVWHpZd1NFWjBYM1kzYjFwS2JGRRAB",
            "text": "inedible mussels, 34$ hamburger not as good as shake shack, tiny portions, forgot the wine cooler, poor service.. deafening acoustics... a tourist trap rip off!! way way overpriced!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKcFVVdE5iQzFMZURaSWVXTXhZVmxOUW5welRXYxAB",
            "text": "One of NYC’s best kept little secrets right smack dab in your face. Excellent service. Sit at the bar if you can’t get a reservation. It’s with it. The bartenders cater to your every request. Tenured mixologists will deliver exactly whatever you crave. The food is not five star, but it’s good. The atmosphere carries the old Manhattan charm. Great to visit pre and post Radio City Music Hall show."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOUk5rVmpOMk5aYjJadlUyUk5Ra2RNTmw5U1VIYxAB",
            "text": "Overpriced, small drinks, very average food .Not worth visiting"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQbTQ4TGVsNmVIakhREAE",
            "text": "First time at Le Rock for lunch. As a local eating at restaurants in the area can be a bit scary as food quality isn’t always there. I will be returning to Le Rock, the food was exceptionally tasty and quality was on par with a downtown restaurant.\n\nHighlights of the meal were the leaks and sardines.\n\nExcited for dinner when I return."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKT011TGF2cU12NHdnRRAB",
            "text": "Ok food, great drinks, warm and comforting atmosphere."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvc3BTbFR3EAE",
            "text": "Good food, great service, and really nice ambiance and atmosphere. It’s not touristy despite the Rock Center location."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcnNYNkt3EAE",
            "text": "Excellent"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbU1XYmd3RRAB",
            "text": "Came in for a pre-show dinner, I was wowed by the service… very hands on and everyone seems to help each other out… we didn’t have to ask for much and everything came out quickly; we were able to make our show in perfect timing. We ordered the Duck Bolognese & Agnolotti (2 pastas) which didn’t stay on the plate for long. Honestly the best thing was the Carrotes Râpées. I enjoy boozy drinks, so I asked for the Yellow Cocktail and the Bijou Blanc. They did what they needed to do, lol. Thank you!"
        },
        {
            "date": "7달 전",
            "language": "de",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcU0tWDZBRRAB",
            "text": "Kleine Karte, sehr gute Qualität, sehr französisch. Aufmerksames Personal, die Atmosphäre eher kühl. Sehr laut, wenn das Restaurant voll ist."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ZzduWFl3EAE",
            "text": "Great food and service. Soufflé was amazing."
        },
        {
            "date": "8달 전",
            "language": "uk",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncHVMUmZ3EAE",
            "text": "Завжди смачно.\nАле травʼяний чай - жесть. Вода вистигла від холодного чавунного чайника, а холодна кружка ще більше цей \"чай\" охолодила.  Отже, чай не заварився. В кружці була ледь тепла кипʼяченна вода.\nПопросили поміняти. Подали заварник з кипʼятком, але смаку і запаху травʼяного чаю все одно майже не було. Або залили ту саму порцію трави, або таки чайна ложка трави на пів літри води це  замало.."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnc3ZISEdnEAE",
            "text": "We went for the Valentine's Day prix fixe dinner. With wine and tip, $300 per person. The service was attentive, but the food was decidedly mediocre. We gave up on the over-salted lobster bisque, and my filet of beef was disappointing--covered in a bland sauce to hide that it had be cooked hours ago and reheated. This was not worth the price, and the city is full of mid-priced French restaurants with much better food."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdjR5QWdBRRAB",
            "text": "Had the winter restaurant week dinner for $60, duck was very tender and tasty, squash soup was delicious, nice ambience and service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBa2JydXBRRRAB",
            "text": "I used here for lunch with a friend for restaurant week. The food is perfect. It is comfortable to stay in, the restroom is clean, service is perfect. I had a duck, it is a little bit salty for me. If the bread comes together, much better. We had a dessert and that was so nice."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMnVENjRRRRAB",
            "text": "One of our favorites for a reason. Elliott and I kicked things off with crab avocado, oysters, and crispy falafel—great balance of flavors. Drinks? Manhattans for Elliott, mezcal Negroni for me, then I did switch to G4 Plata tequila. For mains, the swordfish with fries hit perfectly, while my duck breast paired nicely with a fresh bibb salad. No dessert, just more great cocktails. The vibe was lively as always, and it’s always nice when the staff recognizes you. Le Rock stays solid"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBOE5mZjB3RRAB",
            "text": "I barely poked the duck confit with my fork and it slid right off the bone. Scandalous! The endive salad was so refreshing and perfect. The cranberry spritz was not my favorite (too bitter and watery) but good if you want a light drink. Perfect French bistro lighting and decor. I loved it. Winter Restaurant Week 2025."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcmJyYnB3RRAB",
            "text": "A lovely spot for lunch in the city, with high quality menu, caring staff and the best location possible, right by the Rockefeller Center.\nThe Baba au Muses Vertes was to die for."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmaVkyajh3RRAB",
            "text": "Food was excellent and great view of the Tree!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcUtpQmx3RRAB",
            "text": "I went here in January of 2025, just after the new year. This restaurant has spectacular food in French style. Also, the staff was very attentive and always checked in on us. Finally, the view of the Christmas tree was amazing. If you're nearby, I would highly recommend it."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNm9yTVZREAE",
            "text": "It was cold in the restaurant.  The on bartender  had a chip\nOn her shoulder  & just had an error about her\nSorry she was fr Brooklyn,\nI ate good but220"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2aEx1UnNRRRAB",
            "text": "If I could give this place negative five stars, I would.\n\n“Reputable” is the last word I’d use to describe this scam of a restaurant. It’s a tourist trap, plain and simple, designed to lure in unsuspecting visitors who think they’re dining near a so-called “culinary landmark.” But beware! The only thing you’ll take away from this experience is regret.\n\nOur group of four was served one French toast sliced into four thin strips, a small salad, and a dried-out, overcooked sausage that wouldn’t hold a candle to the cheapest street food vendor. Oh, and let’s not forget the burnt, rock-hard potato hash browns, completely inedible. The sandwiches? Made with stale bread, stuffed carelessly with ham — something any home cook could prepare better, fresher, and more appealing.\n\nThis restaurant is a complete rip-off, preying on people with a hit-and-run philosophy. Once you’ve eaten and realize the quality — or lack thereof — you’ll feel utterly cheated. And don’t bother complaining! You’ll be told no one promised you quality or quantity. “You ate it, the rest is a matter of taste.” That’s their excuse.\n\nSave yourself the disappointment and money. I won’t disclose what we paid because I’m embarrassed we spent so much on such absolute garbage. I can dine happily in both cheap and high-end establishments, but this was beyond bad — an unparalleled disgrace.\n\nAvoid Le Rock at all costs. Shameful and utterly pathetic"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2aUlxeFBBEAE",
            "text": "Food was lousy, portions small,  waiter rude with attitude, way overpriced,but nice view of the tree."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2ek9mNUlBEAE",
            "text": "I bought 11am seatings for the Holiday Brunch on Dec. 7th. And it was such a disappointment. The only enjoyable bits of the event was the entertainment by the 3 artists who sang in between servings.  The menu was varied but most of the items were sub-par for what’s supposed to be a Michelin rated restaurant.  Several items were overcooked (inedible), the breads and pastry hard, and our French toast was burnt. My husband laughingly said ‘as long as the eggs are good, because who messes up eggs?’  Guess what? He didn’t eat the eggs.  I was surprised when the mimosas were not part of a package with a list price of $300 per person. What really was the rub tho was a cup of coffee was also an up-charge.  I ordered this package from Gilt and I reached out and told them in no uncertain terms that they should have done a better job vetting this offer. It was a Total Rip Off at the Gilt price. And an absolute Reaming  for the tourists who paid full price."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzamN2ZlhREAE",
            "text": "Nice place to meet with friends"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcGZyeFdBEAE",
            "text": "I would hang out at the beautiful bar in a great location any time. But I wouldn’t order food. Both of our meals were salty to the point of being inedible. Sent the halibut back and ordered a hamburger with little salt. Got a salty salty burger anyway. I think it must rain salt in the kitchen. At least they took the halibut off the bill, but only after pointing out that we were charged."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMzl1bGdnRRAB",
            "text": "Solid French brasserie option for midtown dining but overpriced for sure. Service is hit or miss , we waited 20 minutes for a martini. We got some oysters, which were the best thing. The bread service was way overpriced for 9$ for a few slices of average baguette. The chicken was very delicious and the duck portion was very small. Finished with the fig cake."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMeXVTcUFREAE",
            "text": "We think LeRock must just have been having a bad day on our first visit in June when service and even the food was mostly disappointing. But yesterday we had a perfect lunch, sitting outside on a warm Fall day. Enjoyed Onion Soup and a very very good escargot with pancetta, garlic butter, and croutons for appetizers. The entree of roast fluke over spinach with roasted potatoes tastes as good as it sounds. But the star was the \"gnocchetti\": tiny gnocchi tossed with peekytoe crab, chili, and corn. A 10 out of 10! Dessert: hard to beat the Profiterole they make here: homemade \"buckwheat and honey ice cream topped with fudge. Service was impeccable: professional, timely, polite, and a team that manager Trey Bliss is rightly proud of."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYeWVybTlRRRAB",
            "text": "My omelette was good, but one should keep in mind that the portion is small here. Make sure to order more if you are hungry."
        },
        {
            "date": "1년 전",
            "language": "pt",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdGVEUGVREAE",
            "text": "Comida e atendimento ótimos. Ambiente barulhento demais. Recomendo um tratamento acústico urgentemente."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYc3MzQXdBRRAB",
            "text": "A friend and I had lunch at Le Rock before seeing a matinee on a Wednesday afternoon. We were seated promptly upon arrival and our waiter took our drink orders right away as well as asking if we had any time restraints. For lunch we shared the shredded carrot salad and a side of sautéed spinach and we each ordered the omelette. My friend and I are both egg lovers and this omelette was cooked PERFECTLY. Really and truly so delicious. Wonderful light lunch in a beautiful dining room with grade A service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudjhmWU53EAE",
            "text": "Don’t typically go for French, but Le Rock really delivered. Warm ambiance and attentive service; delicious and interesting food. A little pricey, but a great option for a fancy-ish meal in Rockefeller Center."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuODZXNEp3EAE",
            "text": "My chicken Basquaise here was really delicious. Loved the vibe too. Great hangout when in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudUttMF9RRRAB",
            "text": "Love the Dover sole cooked in olive oil and bone in for me. Among the best Dover sole I look. I like the fig desert. I like the escargot - tasty bites. I like the caviar. Just it is not ossetra. A little too bitter for me. I like the duck. They didn’t give me birthday cake like other restaurants."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubmZQMTZRRRAB",
            "text": "Great restaurant in Rock Center. The restaurant has gorgeous art deco interiors."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNub2FLenl3RRAB",
            "text": "My friends were visiting from California, and we decided to take them to Le Rock. It turned out to be one of the best dining experiences we’ve ever had. The service was impeccable, and the food was truly extraordinary. We started with a seafood tower that included shrimp, oysters, and live scallops, all incredibly fresh, especially the perfectly tender scallops. Next, we enjoyed French Onion soup, leeks, agnolotti, and bison filet—all cooked to perfection, with flavors that melted in your mouth. For dessert, we indulged in a decadent selection: chocolat noisette soufflé, les mignardises, les coupes glacées, and baba aux muses verte. Every bite was exceptional. The attentive service only elevated the entire experience, making it unforgettable. I can’t recommend Le Rock highly enough!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMmJUS3pRRRAB",
            "text": "Here's a corrected and polished version of your review:\n\n\"I recently visited Le Rock at 45 Rockefeller Plaza, expecting a great experience due to its location and reputation. Unfortunately, the service was abysmal.\n\nInside, the ambiance was beautiful, but the service was beyond disappointing. Our table lacked basic place settings, and upon changing plates, they kept the untensils placing it on a bare table. The waiters and busboys seemed confused, and some struggled with English.When  we asked what was the name of their sister's restaurant in Tribeca which we had lunch years ago. Not she did not know nor could speak english, and she qas a hostess.\n\nThroughout our meal, we encountered several issues:\n\n- Dropping utensils on the floor (twice)\n- Manager presenting the check while we were still enjoying our salad (without dressing)\n- Lack of attention to detail (e.g., handing us a spoon without a plate or napkin)\n- Inconsistent water service\n\nAs someone accustomed to excellent service, I was shocked. If you're going to charge premium prices, train your staff accordingly. Keith McNally's restaurants succeed because they prioritize proper table service, regardless of their staff's background and most patrons that have no idea as well.\n\nLe Rock, take note: serious training is needed to elevate your service.\nEven someone notnused to proper service will not\nWe had lunch at 230pm on a Tuesday not busy at all\n09/17"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdXJqUzNRRRAB",
            "text": "What a disappointment. On my birthday we came here after a recommendation. We were expecting a good service and a better food.\nInstead we found the service to be exceptionally terrible. Some problem with the waiter that was serving us, he was definitely on a very bad mood. We received sardines and puffs. The sardines were good, the cheese puffs were cold and had zero flavour. They offered to change it so we took another sardines. As mains we had the halibut and swordfish, both tasteless raw and very cold!\nThe waiter kept going up and down looking at our plates, and no once came to ask why we were not eating.\nWhat a disaster, happy birthday to me 😂😂😂\nNever again!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdzRMN2pnRRAB",
            "text": "Food were cold by the time it got to our table. A true disappointment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqXzdENXF3RRAB",
            "text": "Great service, I love the place. As a french citizen, I was very surprised by their menu. Pretty risky. There are some meal we don't even find easily in some french restaurant.\n\nThe oysters were good, the halibut too. I would recommend their rhubarb and dessert tower!\n\nTheir sommelier was good and nice.\n\nI would have love to have a classic steak option but I assume they change their menu regularly"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURic2ZYZXp3RRAB",
            "text": "As mentioned in my previous reviews, I've been following the so-called revival effort of Rockefeller Center with some interest. And by follow, I mean eat.\n\nSome places have been great. Others have been eh. NGL, I was genuinely expecting Le Rock to be eh, despite the recent hype. French fare is always so...extra. It's either obnoxiously rich or ridiculously overpriced, and more often than not, it's both.\n\nWell, Le Rock is date night pricey, but not Michelin-starred pricey, and the food is only rich in the sense of bursting with flavor. We. Loved. It.\n\nFor classic pate and carbs, you are well-served with the Cervelle de Canut and Chicken Liver Mousse to start your meal.\n\nI don't think I've ever seen Barbajuans on a French menu outside of France, so major props to Team Le Rock for serving this overlooked appetizer. They were fried to perfection. The Beignets Brandade de Morue were equally perfect, so savory I think I cried a little when the plate was empty.\n\nThe squeamish will avoid the Tablier de Sapeur because it says \"tripe\" on the menu, but they're fools who don't deserve good French food because this is a rare gem in the world of American French dining--a Lyonnaise specialty presented in perfect crispness with perfectly creamy sauce. Similarly, the squeamish (and jaded) will avoid the Escargots Bourguignons, but these were some of the best snails I've had, topped with a wonderful almond flour disc.\n\nThe Rigatoni Duck Bolognaise was rich fowl umami--so good, it should be upgraded to entree size, and so good, it puts most pasta restaurants to shame. The Steak Haché was filling without being overdone. I think the one dud of our meal was the very photogenic Leeks Vinaigrette--by all means, 'gram this dish in all its unwrappable glory, but the end result is kind of anticlimactic and too tart. And I love leeks.\n\nFortunately, dessert made up for that. The much-touted Baba aux Muses Verte is as moist and pillowy as you'd expect, but I'd skip the alcohol drizzle unless you have a problem. However, the Baba was easily surpassed by the fantastic Rhubarb Nougat Glacé aux Pistaches, which was perfectly semi-frozen and bursting with herbal, nutty flavor."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwX2U2ejZ3RRAB",
            "text": "We had lunch here during restaurant week. All portion sizes were small. The 4-course lunch menu for $60 and the bread counted as first course and it’s a bit too hard and cold. It’s crowded and extremely noisy that we could only hear the…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMM2RhRU9nEAE",
            "text": "Booked this on Resy as we were walking over and was surprised by how busy it was; we must have gotten the last table. Some of us ordered their lunch prix fixe for only $39 - an absolute steal for duck confit + an appetiser! 😱 The duck confit was fabulous, but what really tipped the scales was the cherry in the lentils underneath.\n\nWe also had their burger made with aged beef and serviced on a beautiful brioche bun with Gouda. It was perfectly cooked to a medium rare the way I like it. They don’t take requests for doneness so this was perfect.\n\nEasily one of the best value meals we had in NYC, despite it being a French restaurant at Rockefeller Center."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKemEyYkVREAE",
            "text": "Was able to grab a reservation for 6 for dinner. The food is exceptional. Definitely get the soufflé for dessert. Service was also spot on. Our initial reservation was canceled because they had an event, so they gave us a complementary glass of bubbly. My only complaint is the noise level. Although the interior is stunning, this could do with a little noise reduction elements such as curtains or wall pieces. I could only have a conversation with the 2 people sitting next to me as I couldn't hear my friends across from me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMU4yTzFnRRAB",
            "text": "While I’m not vegetarian, I typically order a vegetarian entree at restaurants. So I’m basing my two-star review on the food I ate, and not my companion, who loved her meal.\n\nThe menu had little to offer vegetarians, but we started our meal with the Pumpkin Fritter Amuse Bouche - which was truly an amuse bouche! Typically provided gratis by upscale restaurants, these little guys cost $13 and tasted like something out of the frozen food section at Costco. That’s to say they were fine… the way most things from Costco are fine.\n\nWe then got the baguette with two spreads: radis buerre (radish and butter) and cervelle de canut (a cheese dip). Despite ordering two dips, we were only provided with one baguette, totaling 5 small pieces of bread. I know this was also an amuse, but technically we paid for two baguettes.\n\nFinally, la piece de resistance was my $42 entree, Rice Pilaf with ramps and snap peas. There was approximately 1/2 inch of rice in my dish. It was, at best, a side dish. The flavor was minimal. I would not recommend it to anyone seeking a vegetarian meal at Le Rock, unless, perhaps, it was going to be your second dinner of the evening.\n\nFinally, we ordered two mocktails. My French Cobbler (the pink drink) was delicious but cost $22… just like the alcoholic cocktails. Had I realized the price was the same I probably would have skipped it.\n\nThe ambiance in Le Rock is lovely and the waitstaff was attentive. (Although we were told we were not allowed to order the baguette before placing an order for the rest of our food.) The tables are too close together, so good luck escaping the very comfortable booth seating if there are diners on both sides of you.\n\nThe restaurant was filled with patrons who clearly just left work, which may be their bread and butter. But, if you’re visiting NYC looking for an outstanding meal, I’d look elsewhere. (Especially if you’re a vegetarian!)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoem9HUG1RRRAB",
            "text": "From the minute I walked thru the door, I knew I was in for a wonderful experience.   The staff was amazing , the decor is beautiful and I knew the food would be a treat for my tastebuds. Not being familiar with French cuisine, I left the ordering up to someone who knows!\nWe started with oysters, leeks vinaigrette and some sausage  which (blood sausage) were excellent.  The entree was Steak Hache.\nI've already told friends and family this is a must visit restaurant for an amazing  meal and experience . PS- I didn't sit at the bar,but they do have a small, but nice looking bar as well."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtMklxSnZnRRAB",
            "text": "This is for sure one of my favorite new restaurants in NYC this year! The art deco Inspired interior offers a beautiful setting for diners, the bar area and dining area are well seperated. The menu seems quite expansive but everything we ordered was simply delicious and divine. The leeks, bison, halibut and duck were notably delicious. And the cocktails were well curated and executed. We loved the Chambly Spritz if I remember the name correctly. The service was another highlight,  the maitre d and our waiter were indeed very helpful on our table arrangement as we bumped into another group of friends at the restaurant,  so we could sit together at the big table. The waiters and team were extremely attentive and on point throughout the night! We even got our last orders in few minutes after the kitchen was supposed to be closed as we enjoyed the meals and dining experiences there so much. Love the vibe and people there, it was just perfect! The only thing I would mention is the noise level could be extremely high diring peak dining hours as you can hear the talks bounce around the swanky dining room easily.\n\nCan't wait to go back again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNocElPT0x3EAE",
            "text": "Mixed feelings about this place. The waiter excitingly told us that literally anything we get will be amazing but the dishes were hit or miss. Their little bruschettas with liver mousse and some kind of cod mixture were nice but nothing to write home about. Kohlrabi salad was too sour. I did like escargot and blood sausage with fava beans although the latter was almost too rich with buttery squid chunks and needed some freshness and acidity. The star of the dinner was duck breast with a generous layer of coriander seeds baked into a crispy skin. But at ~$50 for a one person sized dish, I’m not sure it’s worth it. Both cocktails we got were too sweet. Might come back to try more dishes as the place seems to have potential and I loved the vibe and the service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURONXFxMFlnEAE",
            "text": "A great spot for a work dinner. The ambience is lovely , the service is great , and the appetizers hit the spot.\nThe only negative note I have is the soufflé was a bit too runny.\n\nA little plus : we were here for 3 hours and saw 2 different B list celebrities 🫢"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkdzQ2RzhRRRAB",
            "text": "This top-heavy menu can make the meal’s start somewhat chaotic. By the time the main courses rumble to the table, though, it’s clear that Le Rock’s heart lies in the roll-up-your-sleeves, tuck-a-napkin-in-your-collar bistro tradition. There…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcXJDLWdBRRAB",
            "text": "Tasty drinks and food. The fluke fish was delicious (most popular dish) and my favorite was the salted caramel ice cream. The staff was super friendly."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1LU9ITjRnRRAB",
            "text": "I messed up my reservation to Le Rock recently and the team were so helpful in fixing this. They were so accommodating and despite not having my reservation confirmed, they swung into action to ensure my party of two was seated when we arrived despite a particularly busy evening. The great service was further complimented by scrumptious food and dessert! A must try is the barbajuans and for entrees consider the cod fish and the risotto...delightful! The cocktails were delicious and refreshing. We had the French cobbler and Sircoco! Cannot wait to return to this beautiful place!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlMW8tdjNnRRAB",
            "text": "The restaurant is new and stunning. They have a bar that serves the full menu and a spacious dining room. Make sure to get the scallops, pate, escargot, and bison. Service is great and the crowd is fun!"
        },
        {
            "date": "2년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoa2UzRF9nRRAB",
            "text": "\"Le Rock\" is an upscale French restaurant located in Rockefeller Center. Each dish is flawlessly executed, and the service is excellent. The menu features classic French dishes such as French onion soup, as well as buttery and garlicky escargots. However, the real highlight here is the meat dishes. I chose the bison, which was very tender (this was my second time experiencing bison meat). \"Le Rock\" is the perfect spot to have dinner with friends after a stroll through the touristy neighborhood.\n\n“Le Rock” é um restaurante francês sofisticado que fica localizado no Rockefeller Center. Cada prato é executado com precisão e o serviço é excelente. O restaurante oferece pratos franceses clássicos como a sopa de cebola e os escargots amanteigados no alho. Entretanto, o verdadeiro destaque são os carnes. Minha escolha foi o bisão, a carne estava super macia (esta foi a minha segunda vez comendo carne de bisão). Este local é um local perfeito para ter um jantar com os amigos depois de um passeio pelo região que é bastante turística."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNXUyLXlBRRAB",
            "text": "I joined the restaurant week lunch. $45 for 3 courses is a very great deal. Duck confit is a must have. Bread is tasty while the cheese is not free."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNob2VqWnp3RRAB",
            "text": "We ate here on a Thursday night, and arrived just before 7pm to find the restaurant packed.  The space is tightly arranged, with minimal space between tables, and the high ceilings reflect the sound around the room, making it very loud.  We were promptly brought to our table, and our waiter greeted us shortly after.  He talked us through the menu extensively, and offered his suggestions on what the best dishes were to try given it was our first time.\n\nWe each started with a cocktail, which was delivered quickly, and shortly thereafter placed our order.  We decided to go with the razor clams and barbajuans to start, followed by the escargots and sunchokes, and finishing with the bison au poivre.  Within a few minutes of ordering, our razor clams arrived and we began our meal.\n\nThat's about where things really started to fall off.  While we found the food to be good, our server immediately stopped paying any sort of attention to us.  He could be seen wandering around the room, aimlessly floating between the two POS screens in the main dining area and appearing to be entering orders.  If not for the table next to us, who was experiencing the same lack of service and was much more vocal and emphatic in getting our server's attention, we would have waited more than 40 minutes to order our second drinks.  By this point, we had eaten all of our starters/appetizers, and our main course was coming out as our server was finally delivering our glasses of wine.\n\nThis continued on, and we needed to beg (again) for another glass of wine and our check before needing to run out for another commitment that evening.  This was especially curious as our waiter made the point to ask if we had a specific time we needed to be finished with our meal, which we expressed and were impressed that he would ask. Another head scratcher was that he was seemingly unaware that the bison came with a side of fries, having asked if we wanted to add them as an extra.  We declined, and nearly sent them back when they arrived at our table, only to be informed by the busser that they were included with the dish.  The server then came and apologized, stating he was unaware that fries were included. (???????)\n\nOverall, the food was excellent. The cocktails were good (martini a touch overpriced), and the wine list was unique, interesting, and comprehensive. The service started off smoothly and efficiently, only to fall off a cliff.  It was a bizarre series of events that left us feeling disappointed with the overall experience, especially given the price tag."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkcl8yelpREAE",
            "text": "Great spot to have dinner before the theater. Wonderful service, great ambience. It’s definitely pricey but expected for the location.\n\nI would recommend getting the leeks, escargots, and the halibut. The martinis are also wonderful!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1N3B5dnhBRRAB",
            "text": "The food, wine, and service are worthy of 5 Stars, but I gave Le Rock 4 Stars because of the atmosphere. It's loud and chaotic. Too much so. The decor is chic and stylish with dim, romantic lighting, but the noise kills the vibe."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtajZMV093EAE",
            "text": "My guest and I had an amazing time. Being greeted by Kevin King, to being seated, to our waiter. The first ten minutes was an experience. The atmosphere was beautiful.\nWe ordered the Bison Au Poivre  which to describe was another experience if you like steak. A take of a burger with no bread, and pepper corn. The Duck AUX Epices, the description from the waiter was perfect. What she said is what I tasted, duck with honey. Life changing!\nTo end we had dessert, was a great end to a delicious meal.\nHad a great time will return and share with others."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbEp6MVN3EAE",
            "text": "Service was wonderful food was even better. Get the scallops surprisingly my favorite with a nice blood sausage. Duck was perfect and the Rigatoni bolognese mm mmm! Also the profiterole and the cod. Oh and the l’alaska martini I loved"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoOTRES1lBEAE",
            "text": "Excellent food, unique dishes with beautiful flavor combinations however it’s a true shame the restaurant is let down by terrible service. The hosts seated us 20 minutes late without any apology. Allergies are not accommodated. Really let down as the sister restaurant Frenchette has a wonderful team."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcjhhUjV3RRAB",
            "text": "My husband and I had dinner here to celebrate our wedding anniversary, and it was excellent! The atmosphere and decor is upscale, classy, and romantic. Our reservation was at 6pm, and it was fairly quiet then—but the restaurant definitely did get loud as it got later and the dinner crowds came.\n\nThe service was impeccable! They have no shortage of kind and friendly staff, all of which make sure you are well taken care of with drink refills and clearing the table of used dishes (not just “your” waiter, but any that happen to be going by).\n\nWe were very pleased with the food as well. Our favorite dish was the tablier de sapeur appetizer, recommended by our waiter. We could’ve just eaten that for dinner and been fully satisfied! The profiterole was also a stand-out. We were pleasantly surprised by the hearty portion sizes as well.\n\nExcellent way to celebrate our anniversary! Would definitely recommend Le Rock!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxM3VtUVdREAE",
            "text": "Very much enjoyed our visit.  Great ambiance even though tables are a bit tight.  Very pleasant and knowledgeable staff.   Food to come back for.  And, a view of the tree!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlLXZtdENnEAE",
            "text": "Fantastic space, a bison to die for. Also, don’t sleep on the kielbasa.  Thank you to Joël, Carenn, Isabella & Craig for the excellent service.  A new cornerstone of the revamped Rockefeller Center."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNVBxTFpREAE",
            "text": "New favorite French cuisine in NYC. Behind Le Rock is Frenchette a downtown staple. This location is a sophisticated modern approach to authentic French classics. Get the steak, escargot, chicken liver, even the fish. Best deserts were the soufflé and sponge cake with ice cream and peanut butter mousse. The chef and hospitality team crushed it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0eEl5TFl3EAE",
            "text": "The seafood soup and duck confit is prefect.  However other dishes are only to the standard.  It is still a good experience to try it"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1d0wyb2Z3EAE",
            "text": "We had an amazing experience\n\nWe came in on a Tuesday Night with no reservations\n\nThe staff and the hostesses are with high spirits\n\nThe food is phenomenal\n\nI had the duck and my friend had the steak\n\nAnd let say, this is one of the very best duck plates I have ever had\n\nWe had the black forest for desserts\n\nHighly recommend with your loved ones\n\nThe only down side is the place is a little too loud\nDrinks are great too"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwd2RxQk5REAE",
            "text": "Excellent food. Menu was in French, which was slightly inconvenient. Friendly service, great location."
        }
    ],
    "reviews_count": 79
}