{
    "name": "The Reading Room",
    "place_id": "ChIJswKD6X9ZwokRzBuPAc0mo9E",
    "grid": "MN5",
    "address": "16 E 46th St, New York, NY 10017, USA",
    "rating": 4.4,
    "user_ratings_total": 286,
    "phone_number": "(646) 396-2708",
    "reviews": [
        {
            "date": "2일 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MWVXUmtUV1JPY1Y4eVZHUlFWR3hpTjFwUFZsRRAB",
            "text": "Lo mejor fue el servicio y la atencion que nos brindaron, resolvieron nuestras necesidades de la mejor forma, el ambiente del lugar fue relajado y la comida buena… pero esperaba mas. Sin embargo recomendado."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjNWVFaEdWRlpRVVZwT1dtYzNjRVF3V21nNFVuYxAB",
            "text": "Good place for drinks and dinner! The charcuterie and cheese board was a great starter! Tried the duck and was also very good. Only thing to consider is the noise if you want to have a conversation with several people"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NdFZXeEhPV0Z0VEV0b1IxOVhja3cyVWtjMFdtYxAB",
            "text": "Very small restaurant, super cute. Definitely want to get a reservation, I went on a Wednesday night and it was super packed and incredibly loud.\n\nBoth my friend and I enjoyed our food, I had the steak frites and she had the duck. My meat wasn't that tender and had too much of a char taste for me but was cooked properly.\n\nDrinks were great. The key lime pie was huge, and just a little too sweet for me. I prefer more of a tart dessert."
        },
        {
            "date": "1주 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTlYzbDBaek5SVVVKM1drbG1kemhHWkcwMVExRRAB",
            "text": "Locale super consigliato."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sYWIxVlFTRVJYWlVzNFMyaFFiRUpCYkRSRFEzYxAB",
            "text": "Lobster 🦞 spaghetti coffee ☕️ serve was excellent the staff was professional and knowledgeable about their jobs"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJeVpWOTJRamgwUVU1VmFreHZNakJTYXpkS1FtYxAB",
            "text": "Great place for a group brunch. Had brunch with my groomsmen day of my wedding — they were super easy to plan with, the food was good, and i felt cared for on my big day. They even gave me a free espresso martini!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4SVNWWktORkJtTm1OellsQnZiVjh4UTJSamVGRRAB",
            "text": "Certainly a surprise in terms of food.\nThe place itself is harder to find in a hotel and perfect for lunch"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaQlpHMXJlVUZuVDI5emRpMUNaRXhLVUhRd09VRRAB",
            "text": "Some very spooky vibes here. After significant scientific research, I have detected definitive evidence of ghouls. Amazing eggs benedict. Haunted."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMmRXUkpkWGwzUmpCUmJqSndWeTF1U0haWmVtYxAB",
            "text": "Obnoxious and rude front desk. Useless and uninviting."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUFJXbDRURTVsTlRCRWQzTkZNbWROZEVsclZrRRAB",
            "text": "Average.\n\nDinner for 4 people at 9, in NYC. You'd think busy buzzing place. Looks cool in the photos.\n\nIt was empty, we were the only 4 people in listening to the bar bestow his wisdom in the servering staff."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kb1QwSXdZazAyYVRZNE1XbElNREZPY0ZOSmFuYxAB",
            "text": "Best drinks and ambience combination!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dk5IbFVTa2MwUWtSMGJWVnpPVTlzWHkxb2RVRRAB",
            "text": "Crab cakes were very fresh and tasty. Lots of lump meat."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnd00xWTVVMVZaV2tOeldHNXdXbWRJTkZNMlMwRRAB",
            "text": "Very nice place, and so the food we had was great"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201SWMySmFhMlZJU1VJMWVHcEJTVnBUVEZWRFpVRRAB",
            "text": "Cozy spot...a bit hidden, but worth the hunt!  We enjoyed a lovely breakfast there.  Attentive service and ample portions."
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MlExb3lPVWQyWTNGbGJpMW5OMEZKU2xOS2JGRRAB",
            "text": "Как оказалось в Нью-Йорк Йорке завтраки очень маленькие. В этом ресторане понравилось все. Было очень вкусно и ушли не голодные:))"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kdU1IUmxiVUo1TjJwTk5YcHZVM2hpZWxacU4yYxAB",
            "text": "Wanted to say that I’ve just had the worst eggs Benedict in my life but my daughter ordered pancakes and they are even much worst. Don’t know who overrated this place. Hope New York has better places for breakfast…."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RMFJYRjFMVUkxY0VKNGMwWm5WazlFY25veWRtYxAB",
            "text": "Great spot that isn't too far from Grand Central. We tried several seafood dishes and they were all fantastic. Staff were very friendly and the soundtrack was legit."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrdGQySmtYekJEUzB0WFZYQkNORGRIWm1GTGIyYxAB",
            "text": "Food was ok, atmosphere and service were good. Braised short rib was a little tough, but risotto was good. Great spot to grab drinks/bite and be able to talk. Low traffic. Would recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pseFZGcERWRzFqY2s5VmRWVlVlSEZXVWpNMlVIYxAB",
            "text": "We went here before seeing a show at Radio City, the vibes are very cozy and the food is delicious. Staff is wonderful and very attentive. Definitely will be back again soon!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUlRIVXljWEpzVEhVdGRsTnlibTlUY0cxSmIwRRAB",
            "text": "Good food becomes great when served with authentic friendliness. This spot offers easy access and remarkable customer care. Quality dishes served at sensible prices. The entire family agrees on this restaurant's quality. A genuinely exceptional experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSE4zTnJVVWd5YXpaelYwdHplbmR3WjJoUWFFRRAB",
            "text": "Top notch"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMVIzb3hVMGhIZFVRNGMxWjZWMUZNUW5wV2VVRRAB",
            "text": "Founder & Investor lunch. Casual environment and food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzd1dEWmhNVmxZZHpSV2RGWkVMVVpCWWs5dVZHYxAB",
            "text": "Small and quintessential little spot. Will stay again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NMFZtSmZWWFZHVEhWTmVtaFhVQzFDUWtkelYwRRAB",
            "text": "In the unique Gotham Hotel, The Reading Room has read my vibe completely. A quiet happy hour not crowded, comfortable plush seating, with plenty of space a skylight —-in an otherwise darker themed lounge—-to brighten the mood with Sade’s smooth operator playing in the background…it’s a must I stumbled upon whilst next door at Gregory’s Coffee."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSGJHcFpXamt6YVZSaU1sUllRazVqYWtKemVtYxAB",
            "text": "Great bar and restaurant, highly recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ScVUzcDBWalV4ZG5kamVWQlJOR1kwVlhVeGRYYxAB",
            "text": "Excellent menu and food, slow and sloppy service, cool look but can get too loud for good conversation."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSbFpEVlZjbWx1ZEZoVmJHdGFiWEZxYmt4SldHYxAB",
            "text": "Dropped in this restaurant randomly and I was gladly surprised by the quality of the food. Everything we ordered was full of flavor. The oysters are especially super tender and full of umami.\nThe service staff are helpful and very friendly, although not everyone is very knowledgeable about the food or the wine."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSFNtWk9aMjl0VWw5UU56ZDBVSGhTYzFock1XYxAB",
            "text": "A hidden gem inside Gotham Hotel found using Google and it was only 2blocks from our Hilton hotel 👍"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKMFpta3dUVlZZVXpCWWNVVmpaMmxIVTFSRVUzYxAB",
            "text": "The lox and bagels were exactly what I wanted for brunch in NYC. Excellent portion and delicious. Loved the small but lively atmosphere. Servers were very attentive!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201TFVteFJlbkZFZWkxTFpWWnFVM010YUUxUFpFRRAB",
            "text": "I got to this place after walking around 5th av. And looking for something good near by for dinner.\nI had a great dinner on the bar.\nI took the tomatoes and borrata salad and the salmon for main dish\nWas very tasteful"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VQR0ozY25Qa1BXbWdBRRAB",
            "text": "This place was merely ok. I had the eggs Benedict and asked if they could make it vegetarian (sub spinach or tomato for the ham). They seemed super confused by the concept and whether that would be possible. They did end up subbing a tomato. If there was Hollandaise it was so light I couldn't see it. The poached egg was over done so it was more hard boiled on the inside. It lacked flavor overall. The best thing was the potatoes on the side which were really good. The latte was average, nothing particularly special. The staff were very nice, but for the quality and price of the food, I wouldn't eat here again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPdlkyTGFvOEt1T0h3EAE",
            "text": "Not a ton of vegetarian options the heirloom salad I got was really smal for price l but decent. Atmosphere was good and service was great"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNYW8tdEhBNWFMX2ZnEAE",
            "text": "No refills on iced tea?!? And wasn’t made aware."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNV1R4Ty1LcHZ1b2pnRRAB",
            "text": "Best fries ever! And the staff is really friendly"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKU0lwYVBLMXBuZEh3EAE",
            "text": "Cute little spot to grab brunch. Service was solid and food was as expected for breakfast/lunch food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQM2IxYlA2eTZ2MnpBRRAB",
            "text": "The reviews did not lie about the Reading Room. The French toast was delicious. The eggs and the potatoes were also very good. I will definitely go again. The service was great. Attentive waiters and  well planned menu."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNNzYwYkdOaGNPLUNREAE",
            "text": "Great food, very small restaurant, table in the middle is kind of uncomfortable because people walk past by you from all sides. Anyway, the food is great, we had salad, octopus, braised beef and duck."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMSGdpZExIaWN1THpRRRAB",
            "text": "Really enjoyed brunch today. Food and atmosphere were just what we needed."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMYms5dVRFMS1mdlFBEAE",
            "text": "A nice cosy dinner spot for a small group get together. Food was good. Service great."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOT3VoNXVabGFHTHhBRRAB",
            "text": "The food was absolutely delicious. It’s a small intimate atmosphere with reasonable prices. The peri peri chicken is absolutely incredible."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VPV0Vzdk9XZ2VLN0dREAE",
            "text": "While the food was decent, the lackluster service given such a small space and inattentive order taking combined with an inexperienced bar dented the experience irreparably. Buyer beware. The kitchen is less familiar with steaks; perhaps simpler meats like chicken would be more palatable."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQaTF3dVB1MjhXTUpnEAE",
            "text": "Worst food and Service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNGMzeGl3RRAB",
            "text": "The grilled octopus was delicious. The burger was mediocre, with a stale brioche bun and a serious deficit of sauce or flavour. Way too many fries. And the fries were really mid. Service was >30% slower than it should have been - for the price point.\n\nI like the name / theoretical concept but there was nothing book or reading really about this place. I think they could have learned into it more.\n\nNice ambient environment, slightly loud.\n\nWould not go out of my way to come back.\n\nWalked in on a Thursday at 7:30 and got a bar seat."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZak12c05REAE",
            "text": "Had a wonderful meal with old friends.  Something on the menu for everyone.  Had the delicious crab sandwich.  Creative specialty cocktails.  Not too loud which was awesome for conversation."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvX3FmdUFnEAE",
            "text": "Awesome experience. Food and staff exceptional! Steak was cooked perfect and salmon could not of been better!\n\nMake your reservations prior as it is a small place.   A great place to dine with friends or a romantic date."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNXFEMkVREAE",
            "text": "Great food and atmosphere, not too expensive. Try the key lime!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMlBhVVJnEAE",
            "text": "We had the filet and the steak frites—both were absolutely delicious and cooked to perfection. The atmosphere is cozy and romantic, making it a perfect spot for a date night. The staff was incredibly attentive and made sure everything was just right. Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "nl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcjdxZ29RRRAB",
            "text": "Heerlijke oesters en mosselen gegeten. Vriendelijke bediening, goed geïnformeerd ivm glutenvrij dieet."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMC02d0lnEAE",
            "text": "Good food. Great service.  Fabulous atmosphere."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJazVYbnZRRRAB",
            "text": "We had a crab cake , and the Brazilian sea food stew, and drinks and everything was delicious !"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3cFAzUGJBEAE",
            "text": "The crispy eggs Benedict ($20 plus tax) was a novel take on a brunch classic The eggs and Canadian bacon on the English muffin were good, but the accompanying potatoes were bland. The small fruit serving could be more seasonal and fresher.\n\nThe interior, maybe in the attempt to make it cozier, felt rather dimly lit, which would have suited dinner service better. For brunch, I wish it were just a tad brighter."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMUp2SjZRRRAB",
            "text": "My mom and I came here for brunch before seeing a Broadway show! The service was great and ambiance was nice! The food was delicious! Good portion sizes and good prices! We didn’t make a reservation so we ate at the bar but that was fine. I would recommend making a reservation so you’re guaranteed a spot. Would definitely recommend and come back again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWdXVTMDhBRRAB",
            "text": "A tiny but gorgeous restaurant inside the Gotham hotel. Reservation is a must for lunch or dinner. The restaurant is decorated with shelves of books to really create the reading room vibe. Accompanied by a lovely bar.\n\nFrom the menu we loved pretty all the things. Mussels were really good, soaked in citrus juice. Skirt steak was tender and juicy. The G&H burger was solid. At the end we got a complimentary dessert for celebration our occasion at the restaurant. The chocolate mousse cake was so good.\n\nService was superb, constantly being checked on and kept us updated on the upcoming items. The restaurant did take a while to get our entree, understandably so since the restaurant got full right when it opened at noon. So not a recommended place to grab lunch quickly. But am excellent restaurant to chill, dine and have some wonderful conversations in company of lots of books."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRaGZ5aUN3EAE",
            "text": "Peri peri chicken was solid, risotto was delicious. I saw a lot of people get the charcuterie board and burger & fries. Drinks are ok, I got the hot & heavy and it tasted watered down. Staff / service was excellent.\n\nThis is a restaurant located inside a hotel. It gets packed fast since it’s near Grand Central / JPM."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiMUtXaGpBRRAB",
            "text": "The food itself tasted good, but subpar service… slow, completely forgot one of our orders so had to wait another 25mins for a salad? Then my other friend paid for an add-on to his avocado toast yet he wasn’t given it… Also sounded like glasses and plates were being dropped and broken like every 10 minutes.\nThe waiters were kind but I wouldn’t come back. Sad because the food that actually came out correctly was quite nice and the atmosphere was cute."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtZzV6VkZREAE",
            "text": "I'd like to thank the hostess (apologies for forgetting her name) and our server, Angela, for absolutely everything. We had my birthday dinner and it was phenomenal. The service was prompt even though it was very busy. They make a very…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkak9IaEd3EAE",
            "text": "Went to The Reading Room at the Gotham hotel in midtown for breakfast. We got there half an hour before they stop breakfast service. The hostess informed us rather rudely that they were getting the room ready for lunch service & we had 20 minutes to order & finish our meal. When we asked her if we’re not done in 20 minutes, will we get kicked out, she got an attitude & started explaining how things at a restaurant work! We didn’t want to eat at a place whose employees talk to customers as if they’re dumb. I wasn’t going to let her get away with this attitude & let her know. She immediately changed her tone. We ordered  our order- breakfast burrito & eggs & toast ( mediocre for the price) food arrived, we ate quickly & left. An expensive unpleasant  experience."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1NWZlMzNRRRAB",
            "text": "What a treat of a quiet, hidden gem within a hotel! I sat at the bar and had a wonderful evening of delicious food, lovely drinks, and wonderful service. The steak on toast was so tender and excellently cooked with such delicious flavors. That with the beet tar tare was a perfect starter combo for this party of two. We then enjoyed the most perfectly tender and moist peri peri chicken with a ají verde sauce you could bathe in. It is delicious! The ricotta gnocchi are puffs of the softest and airy goodness in your mouth that are packed full of flavor.  We finished with their homemade sorbets and chocolate cake with wHipped peanut butter cream. Yum! The Fireside is a must try of smokey goodness and Shakerato is one of the best espresso martinis in the City. I can’t wait to return and try everything else on their menu. The pictures do NOT do it justice. I would be thrilled to be staying in a hotel with the variety that this menu provided!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUcV91aUpnEAE",
            "text": "Stayed at The Gotham Hotel and used The Reading Room for my breakfast before I headed into the hustle and bustle of New York. The food was amazing and the service was outstanding. Will definitely be returning when I come back to New York later this year"
        },
        {
            "date": "1년 전",
            "language": "ru",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMjdYM0JREAE",
            "text": "Еди на единицу  с натяжкой. Принесли мясо и картошкой. Катошка пережарина в старом масле и пропитано им. Попросил поменять и указал причину. Когда принесли оказалось картошку просто на верх досыпали на старую а старая была от времени уже пересолина , соль впиталась. И вдобавок мясо холодное стало. Официант какой то потерянный был. Менеджер выслушала и быстро всё решила. Меняйте повара и соус подавайте отдельно от мяса. И официан ещё говорил у нас забронированно еште быстрей столик ваш нужен. Самый плохой рестик за выходные в этом городе."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdGRMQzZ3RRAB",
            "text": "Decent spot. Food is ok. Oysters were great. Everything else wasnt worth the price but tasted good. Service is a bit slow."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSamJiZEJREAE",
            "text": "The Reading Room The food was good. Service was ehh… pretty good. It was overall a good experience. The beef carpaccio was good. The crab cake burger was good. I’d say it’s worth trying and see what you think."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWNTdpMDZnRRAB",
            "text": "Delicious burger and exceptional but slightly oily fries. The space isn't too big so reservations are suggested even for lunch. Service was friendly but had to wave a lot to get the servers' attention."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aXN1QWxBRRAB",
            "text": "The most amazing place ever. Has a great chill vibe, beautiful bar, great drinks and the most important.. delicious food! Spicy margaritas were my favorite, cheese and meat board had great selection, bone marrow was so flavorful and was…"
        },
        {
            "date": "2년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtajlHWFp3EAE",
            "text": "This bar feels a little like a modern speak-easy vibe. It is placed behind the hotel reception in é NYC. The interior has a nice ambiance with a lot of modern wood accents. The restaurant is fairly small, but it is comfortable spacious.\n\nEste bar é uma versão moderna dos famosos “speak-easy” nova-iorquino. A entrada fica escondida atrás do saguão de um hotel no centro de Nova York. O interior tem uma decoração rústica com muita madeira, e é bastante agradável. O espaço é pequeno, mas  foi bem aproveitado."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtaGZuejdnRRAB",
            "text": "This place was fantastic! My boyfriend and I made a reservation for 8:00 PM when we arrived the hostess told us that their bigger party was running late so our table wasn’t quite ready which was fine with us, we were in no rush. She had us sit at the bar and we had a drink while we waited. We only waited for our table for about 10 minutes, then we were seated. We ordered the Cesar salad which was delicious, the dressing was homemade. My boyfriend ordered the chicken, and I ordered the braised short ribs. Both were very good. The drinks were also delicious, I will post the picture above. When we got the bill we noticed that our first two drinks weren’t on there, we asked what was the hostess but come to find out also the owner and she said it was on them for making us wait, which I thought was very nice and really not even necessary since we didn’t wait long but very good hospitality. The owner was so friendly, she told us all about their new endeavor and told us a couple of other bars to go to. I would 100% come back, and would give the whole experience a 5 star rating! It was not overly priced, delicious food, great drinks and a nice ambiance!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaktELTRnRRAB",
            "text": "What a lovely surprise! Short ribs and gnocchi were very tasty. Service from Valentina was great.  Playing up the name in decor would elevate the experience."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBbzZxSE13EAE",
            "text": "Went here for dinner and got the duck breast meal. It was amazing and the servers were extremely fast and nice. I look forward to coming back here again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxeTRxTUdnEAE",
            "text": "Loved this place! Stopped here for brunch and had the morrocan chickpea soup, hubby had butternut squash soup, and we shared the beat salad..simple, yet amazing!! Love the ambiance here, too!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGMzl2U2pnRRAB",
            "text": "Nice, relaxing spot on the weekends for locals and visitors and lively during the week after work. Great food and drink selections. If you're there with a group, try everything you can."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmX2VTakZBEAE",
            "text": "Such a quaint place. Awesome experience.. quiet and cozy and the food is made with love and just amazing.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOdW9ELVFnEAE",
            "text": "Wonderful experience! The staff were excellent and offered great recommendations. The bartender was personable and made phenomenal cocktails.\n\nI look forward to trying more food and drinks when I go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiZ3ItM1RREAE",
            "text": "A delightful little spot -- good happy hour bites and drinks.  Appreciated the low key vibe and exceptional service too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzeEtPemVnEAE",
            "text": "I took my girlfriend for brunch at this restaurant, and we had a fantastic experience. She ordered the Eggs Benedict, while I went with the steak and eggs. Both dishes were delicious/perfectly cooked and well presented. The server was incredibly friendly and even offered a few recommendations, which added a nice personal touch to our meal. Overall, it was a great spot for brunch, with excellent food and attentive service. We’ll definitely be coming back. Highly recommend!"
        }
    ],
    "reviews_count": 74
}