{
    "name": "Hutong New York",
    "place_id": "ChIJweMOgwxZwokRm_BlZ1YAiZc",
    "grid": "MN5",
    "address": "Inside Beacon Courtyard, 731 Lexington Ave, New York, NY 10022, USA",
    "rating": 4.2,
    "user_ratings_total": 1190,
    "phone_number": "(212) 758-4800",
    "reviews": [
        {
            "date": "11시간 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCcGVHbFlaSFo1VkZkV2VEVlVUWFJJTnpsNFQxRRAB",
            "text": "Love the interior of this restaurant and the food quality. Their Happy Hour is outstanding. Just went for the prix fixe lunch ($35)pp and ordered the wine pairing. We thought it was $45pp for wine and food but the wine pairing was $45 alone for 2 small glasses. Just feel ripped off after that. This is the reason I downgraded it to 3 stars from 4. Wow. Some nerve to charge more than the food for small servings."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25veVZ6aFZYMkV6UTNWZmIzQnViV05aUzNWWWJFRRAB",
            "text": "Overpriced but solid"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oSlFYRjZXRGgyYUZvdE5uTlFZbEZCWlhwbGFuYxAB",
            "text": "Charles and the rest of the crew were outstanding.  Clients were very happy...enough said."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prNWJGcFRUVnBDUjJGM1YweHpOR1pRZEZaVVMyYxAB",
            "text": "Beautiful place, but the food was really disappointing. You’re mostly paying for the ambiance which is stunning but that’s about it.\n\nWe ordered the scallops (literally one scallop sliced thin with noodles) and the fried prawns appetizer, which wasn’t what we expected. The sea bass was more like a noodle soup with barely any fish, and the beef tenderloin was extremely salty.\n\nWe skipped dessert since nothing impressed us. They also mention DJs and live performances on weekends, but there were none."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRWRtRnBUSFpaUzJaSVRqRk5MVlV4VEdONk1tYxAB",
            "text": "Food is extremely overpriced. Service,vibes etc. I good."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOalQyMHhRV3RQVUhSeU9EbGFRbnBDVjBaWlZIYxAB",
            "text": "Service was not good. Food was ok but their Peking Duck was not bad. Wouldn’t come again though."
        },
        {
            "date": "수정일: 2주 전",
            "language": "zh",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aV09HUkhjMTlUYTFWSmRXTldjbFZEWVY4emNYYxAB",
            "text": "适合非中国人品尝中国美食。灯光很暗，似在酒吧。"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5T1dDMVZMWFk0YnkxQmExUXpWekpJTldkeU1VRRAB",
            "text": "I booked a table in the main dining room ahead of time. Despite that, I was seated in the bar next to a door to the sidewalk through which customers kept coming and going.  It was a cold evening, and each time the door opened - which was often - a rush of cold air flooded in.\n\nThe waiter was awful.  He may have been a bartender who was asked to wait tables, otherwise it is hard to explain how incompetent and inattentive he was.  Terrible service.\n\nThe food was good, but service and atmosphere ruined the evening."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNE9UTlJWMHBTVVRoMU5EaDZaa1F3WTNod1ZXYxAB",
            "text": "For years we tried to find a place that would match up to our favorite restaurant that closed many years ago, Mr. K’s. Hutong gives it a run for its money! We love the spring rolls, dumplings, and mapo tofu!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psblNEUkVWelJ0VDNSWFJIUmlUVzB3V0ZGUGFHYxAB",
            "text": "Arrived with a party of 10 for a birthday celebration. Initially a service was good. After our entrées, we waited 30+ minutes for the dessert. The restaurant was not crowded  After dessert, it was another long wait to get our bill. Evidently because of the size of the group, gratuity was automatically included. The servers decided there was no reason to tend to us anymore, even though our dining experience was not entirely completed. We ordered lunch to go, the order was never put in. It was entered by a server, who had an attitude for THEIR error. Later realized we were overcharged. The brunch menu was ok. The Peking Duck was not well seasoned, therefore not worth it. Due to poor service, would not recommend and definitely would not return."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNlRWaFRZalJKTlVGYVRFNVBTVFJOTUVGQ1RFRRAB",
            "text": "Service was preoccupied and rushed until the end and new waiter much more attentive. Food was good but pricey but the music!! Bad and very very loud lounge music so gave the place an outdated vibe."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JMmNVeG5YMlp1WlhoSlYzWnNlV2Q0WnpsdGVGRRAB",
            "text": "Decent food but very expensive. For the price and ambiance I’d expect excellent service which did not happen. Also sat us near the false entrance so we’d get blown by a gust of cold wind frequently throughout the dinner."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjMlNsbHRlRVJITmt0T2RuaFRkRjh4VlZCYVdWRRAB",
            "text": "Amazing experience. Superb restaurant serving amazing food. Front bar is great too with a full view of the goings on."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGUlRHZEpiVE5WYzFKRU16ZEhSMGhHZUVoNmIzYxAB",
            "text": "The food was really disappointing. The lotus root arrived cold and overly salty. The half Beijing duck was served almost at room temperature. We also ordered mooncakes for the Mid Autumn Festival celebration, but unfortunately, they were the worst mooncakes I’ve ever had—the coating was far too thick, nothing like traditional 冰皮月饼, and the texture was almost like rubber.\n\nWe had told the server we wanted the dishes to come out together, but instead, he just kept sending whatever was ready and even told us “your table won’t fit everything.” On top of that, the orange juice we ordered was forgotten, and we had to remind them after waiting nearly 40 minutes.\n\nOverall, both the food and service need serious improvement. This experience did not live up to the expectations of a so called high end Chinese restaurant."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNmIybEpjVWhHU1dsRlRGbDZWM1UzWHpkRlIzYxAB",
            "text": "The tasting menu was outstanding. One of the best Asian restaurants I’ve ever gone to."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSSlMyNVBRUzE0VEhoUmMwOURObXBmUW5GRldHYxAB",
            "text": "A truly marvelous dining experience—surpassing even O Mandarin.\nConveniently located in the same building as Bloomberg HQ, with valet parking just across the street.\nThe Mapo Tofu, Peking Duck, Prawns, and Crabs were all exquisite, prepared with exceptional finesse and flavor.\nI look forward to returning very soon."
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVaktLNVBBEAE",
            "text": "Update 10/6/25:\n\nBack for mouth numbing tofu! Prices went up but absolutely delicious still. Great tofu and duck. Love the calamari here.\n\nIt's pretty dark inside but the private rooms are excellent.\n\nWhere they could improve is the taro with caviar. Massive dish but only two pieces for $24? No value there.\n\nAlso, the noodles with fresh vegetables had only ONE bean sprout. I would avoid that dish.\n\nIt took a while for cocktails (15-20 minutes each) but quality was still solid.\n\nOverall, good for the tofu, duck, and crab. Avoid the noodles and lotus root at all cost!\n\n// old review from 2019 //\n\nReally courteous staff and extremely upscale. The soft shell crab was a must. The mouth numbing fried chicken was insane.\n\nThe dim sum platter was a pass. Nothing special. The Peking Duck was enormous- enough for a large party in itself.\n\nReally professional staff and a great experience!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZelVsbG5Ua0kwZVdWV2NtOHhUVjlTU3psMmRrRRAB",
            "text": "The food is amazing, cocktails were good, and the atmosphere was great. What puts a huge wrench in the experience was the service. Everybody was nice but it was a struggle to get anyone to come to our table. We sat for almost 30 mins before we could get a single order of cocktails. Basically only had a couple drinks with dinner and skipped desert  because it was too difficult to get a waiter and drink orders took a long time. The place wasn’t that packed and there were empty tables. Seems understaffed perhaps."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUGVpMVhjMWc0V2tsaFNETkdTalI1V0cxWmVYYxAB",
            "text": "The food was both tasty and well presented.\nWhereas the service was disorganized."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214Nk9YY3liWGd4YlRsS2RuRnVWMGhxVUZwR1VGRRAB",
            "text": "We really enjoyed this place for a private dinner including the atmosphere, the private dining rooms, and the service. The food quality was excellent and tasty. The only down side, is that the portion sizes are really quite small. Highly recommend they increase the portion sizes, especially since the price warrants it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paaGNFUnZSelpSZEdORlFsaDRSMDFGV2pad1dYYxAB",
            "text": "Luxe aesthetics, good food and friendly waiters :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sV2JYZE5RbGhSTm1WellWaENjVzFuVTBJMmJuYxAB",
            "text": "Highly recommend Hutong. Went for my anniversary with my wife and was treated so well for our special occasion. The duck and the tiramisu were especially delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oRFR6Tm1hSEJ2ZFdsUVZIWTRVWEp1TnpGQmJYYxAB",
            "text": "WE LOVED THE VIBE  SERVICE ATMOSPHERE 10/10 . WE DID THE TASTING MENU AND FOR THE PRICE WE JUST WISH IT HAD A LITTLE MORE VARIETY AND ANOTHER DESERT OPTION.  OTHER THEN THAT  AMAZING !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kUlVIVnRaV0V0V0RsbFFWZFdObUZGVGkxaWFIYxAB",
            "text": "‘’Loved Hutong! The food was incredible and the service made the night even better.’’"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214Mk1UazBjMDlQVERSaVMzaExlRkprTlZWalprRRAB",
            "text": "Although booked a table had to wait 20 min to be seated to a bar area which wasn't nice. They are too busy service very poor"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTFIyaGFabkZtWHpJeFZUbFRNVkJPY3poaGNHYxAB",
            "text": "We had an absolutely amazing experience at Hutong last night. From the moment we arrived, the atmosphere was warm and welcoming. Our server, Shamim, truly made the evening special his food recommendations were spot on, and the drinks he suggested paired perfectly with our meal. The service was attentive without ever being intrusive, which allowed us to really enjoy our time.\nEvery dish we tried was flavorful and beautifully presented, and the overall flow of the dining experience felt seamless. Shamim’s professionalism and hospitality stood out, and it made a big difference in how enjoyable the night was for us.\nOverall, everything was phenomenal great food, excellent drinks, and top-notch service. We will definitely be coming back and highly recommend Hutong to anyone looking for a memorable dining experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGV1FsWXdUV2RMVkU1bVNEZG5Vak00VlRST1RGRRAB",
            "text": "The ambience is what you pay for .\n\nThe chicken was okay, the noodles was very oily but tasty . The veg fried rice had no flavor.\n\nHowever, the service was excellent. We were constantly checked in and our table never had an trash."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xORVRXdGZMWGxZYUdoRVRqQXpXRzVaZVRCclUxRRAB",
            "text": "Where to begin with this review.\n\nMy friends and I were looking forward to this reservation for a long time! We are from Boston and my friend scoured the internet to find an incredible restaurant to celebrate a milestone birthday at, so we landed on Hutong. She called in advance (weeks in advance) arranging the reservation, the table, and confirming payment logistics mentioning we wanted to be able to pay with multiple cards and they assured us this was totally fine and they would be happy to accommodate us.\n\nThe day of comes of our reservation and we get to the restaurant and already the service is subpar in comparison to other tables around us. We are a big group of primarily young black women, and we're watching our table get bypassed by our server multiple times while watching him accommodate the other tables around us. Even just getting the basics like the full menu for the emperor meal (which was not included at our table for some reason, only the a la carte menu which is priced differently) and getting straws for our drinks was a hassle. I had to ask our server 3 different times for a straw while my drink melted and he actually gave me a bit of attitude and refused to give me straws until he was done taking our orders (but then forgot after he was done taking our orders so I had to ask again.)\n\nHe actually overlooked our birthday girl while taking orders and then disappeared quickly before we could have her put the order in, so we had to try and flag him down and when he came back to the table he was getting distracted during the order and then left right after she put in her main item and she didn't even get to ask for the dim sum she also wanted to get.\n\nThe table we were seated at was also right next to the wine cellar hallway which created a breeze coming in so it was very chilly in that spot.\n\nWhen the food came out not only was it just ok (a bit overpriced for the quality in my opinion) I actually ordered the emperor dinner set and he asked if I wanted my food to come out one at a time and I told him no I would prefer for it to come out altogether as I like to eat a meal as a whole... but he still only brough it out one at a time. It was weird because I was the only one at my table who ordered that so I was the last one finishing my food and everyone was waiting on me because of it.\n\nThey also forgot to bring out my dessert part of the set for some reason so after I finished my last set they started cleaning the table and taking dishes (our server was again nowhere to be found but I'm seeing him service other table) and 20+ min pass and there's still no dessert. I finally have to flag him down AGAIN to ask for it and then he asks ME if I received the dish....? Which obviously I hadn't since he never brought it out and hasn't even visited our table in 20-30min.\n\nOn top of that never once did he come back and ask if we wanted another drink or more water... after our first order the only times we saw him we had to beg him to come over to our table.\n\nEven to get our check we had to ask multiple times. And finally when we got it he says we can't split cards, even though we specifically called in advance and had talked to management that said we could. We try to tell him this and he refuses to help. We finally have to ask for a manager who says we can pay for multiple cards, it's just not typically offered. Which is fine, but we had arranged to be able to do this before and was part of the reason we chose this restaurant?\n\nEven so, the manager was able to accommodate the request, one the server Shamim was unwilling to.\n\nAnd then after all this we had to pay over $110 for gratuity for a server we NEVER saw, had to beg to come over, beg to accommodate us, forgot our dishes and gave us a hard time to pay with our cards.\n\nWe were hoping for a luxury dining experience however Hutong disappointed us. And it was very apparent the treatment we received versus the other counterparts in the restaurant. Would not recommend based off the service, pricing to quality ratio, and overall vibe."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCbVdsbEdha2RPWHpsSGFtSjJNbFJyUmxwRGNFRRAB",
            "text": "I don't know how I have not been here before, but one thing is for sure, I will be back!!  Wonderful experience at Hutong!  Incredible food, excellent service and great atmosphere!  Loved everything about it!  I am STILL dreaming about the calamari flowers! ;)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGblIzZHNTa1psV21jMU5FSlRSWFJrUkU1SGJFRRAB",
            "text": "All waiters and waitresses are in the meeting, nobody serves us, have to go out to the front door to get a waitress to order dessert."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJd1V6RmFabkZsWm1sdlpWWjJZMkpRYVZsc05YYxAB",
            "text": "The cuisine was excellent, with superb flavors. We appreciated the Hutong tiramisu on the house to celebrate my milestone birthday. Thank you for a wonderful evening."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NlFXb3hPREpEWjNCT2IwVnRSMjkwYTI0MGRIYxAB",
            "text": "The restaurant is beautiful! It's like stepping into a 1920's movie. The service was impeccable. Suggestions were made that were excellent and the duck was absolutely delicious. It was a fantastic experience and a great way to celebrate a birthday."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paTlpreFNibTh6UzNWb1ZuSmZRekExUWpCU2JuYxAB",
            "text": "We came here for a bachelor party, and unfortunately the restaurant really struggled to accommodate allergies. I clearly specified multiple times that I cannot eat tree nuts, but my dish still arrived covered in cashews.\n\nIf you have any dietary restrictions, I’d recommend avoiding this restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKaFEzVXpjWEo2TkZVdFRHeE1WMjlyYlU5MU5WRRAB",
            "text": "Just moved back to the city - eat there twice in 10 days. Excellent food and service. If you love Peking duck, it is the best I have had in the city. Reminds me of a dinning experience in Singapore.  The staff is friendly. The Dim Sum was delicious too. very pretty and upscale decor. The Bar is great too after work and separate from the main dining room."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3NGNHUjNaVFZ2U1RsalgxOXdZV0pyYVZCTFRVRRAB",
            "text": "The food at this place was average and uninspiring. It would not survive in Flushing. The food isn't authentic and yes I know it's supposed to be Asian fusion but the execution wasn't great. At least not for me. We went with a party of eight for which the portions were way too small for a party of this size. The dishes are really not suitable for any party of more than 5. It felt to me the owners opened this restaurant for the EB-5 Visas. The service and atmosphere was great however. If you're looking for authentic Chinese food this would not be the place but if you are wanting to experiment with Chinese food but not real hardcore Chinese food this might be the place for you"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjdFoyTndVRlp4VG5GVlNXaDJXa013ZDA4d1JrRRAB",
            "text": "Pecking duck so delicious\nAnd the old fashion cocktail sooooooo good, must try\nFor the dumplings it was bit disappointed"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25walFUTnhkVGgxY0RGcE5FcGhkbk5IZEdaUExWRRAB",
            "text": "Horrible service. Terrible food. Not authentic Chinese food at all. Hot and sour soup tastes like crap. Changed to beef and egg soup and not much better. Peking duck was pretty good but after we all finished eating the meal, the waitress brought out another dish saying it was the second part of the duck dish to our surprise. That was about half and hour after the first part was served. The waitress was not interested in serving us obviously."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdlVETTFOVGR4U25aSk5WbzBUVk5EVkZORFpWRRAB",
            "text": "Dim Sum offerings were remarkably differentiated from the norm. Delicious thin-skinned rolls, very different dumplings. Had a very tasty crab salad. Even the old war horse Ma Po Tofu came up fresh as paint! I had Bao and Soy milk for dessert. Delicious! I enjoyed a beautifully smoky Old Fashioned. Service was super attentive and the space is remarkable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSSVpsZFliMFJhVUVOeU9HWlBkMkpYWlcwMFZIYxAB",
            "text": "Stunning architecture and beautiful venue. The duck was very good but not warm. Other dishes took a very long time to come. Mapo Tofu was excellent. Mala chicken was a giant bowl of peppers in which you hunt for the few pieces of chicken. Overall food was very good but slow, esp for a Monday night.\n\nSadly service quality is not that of a high caliber restaurant - it’s what you would expect at a TGI Fridays. They lack the proper training to deliver a refined experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTlVVaHBhV1Z4U2tVdFl6Tk1WbXAxZVdGc00wRRAB",
            "text": "Ambiance was great and food was okay, but very VERY overpriced. It's simply not worth that much; you'll be able to get food on par elsewhere for half the cost"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZM1JqQXRkelF3U0U4d1RXOXhXR010ZUUxc1RHYxAB",
            "text": "A+ for High end duck experience. Service is very good"
        },
        {
            "date": "1달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MFdscGZVRXBzWkc1dGNFeEdWRUp5TVVNMFdYYxAB",
            "text": "Cena eccezionale! Anatra davvero sublime! Da tornare senza dubbio!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205d1psVlphRmhMV0dSa2IybEdOR1IwT0Rad2NFRRAB",
            "text": "The food isn’t great. But the service was and restaurant is beautiful"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21obWJtWkpYME16YVVSdVptUlRjRXhGV25CSU1FRRAB",
            "text": "Without a doubt the worst restaurant experience I’ve ever had. The hostess was extremely rude. She walked us over to our table and then just walked away without saying a word. We then waited almost 10 min for a waiter to come over with…"
        },
        {
            "date": "1달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbVJHbERNa1Y0TWs1aVMzQXlPVXhoV0ZadWRtYxAB",
            "text": "好好吃，就是量少"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xMldEWjJlamhNUjFobWFWVlBUVWRxWkhKSlpuYxAB",
            "text": "Hutong's Summer Restaurant Week menu looked interesting. Jen and I ate lunch there earlier this week. Jen had the prawn, leek, jade hearts and cilantro salad which she found spicy. I chose the poached chicken and black garlic wontons which was flavorful. Both of us had the Kung Po Prawns with Chef's fried rice. I found that both dishes lacked enough seasoning and I should have asked for the salt cellar. Hutong is a lovely restaurant and having been here several times it was an easy choice for Restaurant Week. Our server was efficient and unobtrusive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxQmJVdDFPV1JWYmtFek0yMVVZbk0xTFVsb2JHYxAB",
            "text": "Attentive service, delicious food, and cool ambiance.\n\nMust order:\n- Pecking Duck. The skin is so crispy and the meat is juicy. You build your own little wrap with a delicious plum sauce accompaniment.\n- Dim Sum. The platter is worth it to try an array of pieces.\n\nMy parents go here every time they’re in town, but took me for the first time tonight and it was fantastic."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsS1owMXFTbXMwZFZSRmFrZGZXbEp2V2tkQlkyYxAB",
            "text": "Came here for restaurant week and the service was great. The food was very mediocre considering the price point and yes that’s even with restaurant week’s $60 dinner prix fixe. I’d recommend coming here for their a la carte menu instead to get the full experience. It does seem as though they cut portions considerably to accommodate restaurant week.\n\nThe quality of their assorted dimsum was quite decadent, very pristine flavors. Their Iberico Kung Po pork? Poorly fried, over saturated sauce, fried rice was bland.\n\nDelicious tiramisu though!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRk1HVk5OMlZPTlVWSWMzZGtWR3BPUVZKMWMxRRAB",
            "text": "Best chinese place to have great food in NYC.  By far. Do not miss it"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKMlNsRllVRnB6YUVOTFFXUmhPVmh1WDBNeGVIYxAB",
            "text": "The service was excellent food also was really good."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXNXBIYVh3EAE",
            "text": "입구의 문이 말을 안듣는지 문지기 아저씨가 엄청 신경을 쓴다. 처음보는 라거와 치킨과 돼지고기 튀김이아주 맛있었다. 나오는 하우스 음악은 그냥 그렇다. 음식 빼곤 중국스럽지 않았다."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWFRGbHNhMnBRTTNkMmVGaG5jM3BMVjFKZlEyYxAB",
            "text": "Absolutely loved my dining experience at Hutong NYC! The restaurant has such a chic and elegant vibe, perfect for a special night out.\n\nThe highlight of the meal was definitely the roast duck 🦆 — perfectly crispy skin, tender and juicy meat, and the flavor was spot on. It’s one of the best Peking ducks I’ve had in New York!\n\nService was attentive without being intrusive, and the overall ambiance made the evening even more enjoyable. Highly recommend making a reservation and not missing out on the duck — it’s truly worth it!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFMGNIVldTMEY0UnpoMFMwRkJOVUV4T0dkUlUxRRAB",
            "text": "Our favourite upscale Chinese restaurant. Hands down best Peking duck in NYC. Everything on the menu is fantastic - definitely check out their dim sum (mushroom bao, wagyu beef mille-feuille, hutong prawn roll, bak kut teh xiaolongbaos 👌🏻). Do save room for their bao and soy milk dessert, as well as the tiramisu served table side. We love this place so much we got married here 😂"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Zd1VGOTBkbmxNUld4Mk1tMTVlVE5mY2kxbGRGRRAB",
            "text": "Hutong NYC has an incredible atmosphere with its blue-and-gold interior and stunning crystal lighting. The dishes are beautifully presented and delicious — the cold noodles, dim sum, and cocktails were outstanding. Service was professional and attentive. Perfect spot for a date night or a classy dinner with friends."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWM2JsaFNjbEpTVlROTlV6aEZNbE5SV21aVllsRRAB",
            "text": "Ambiance (5/5): The entrance is found in the center of the plaza area, not either side street. The entrance walks into a large reception area, a glass hallway with fine wines on display. The inside feels very high class, expensive, high ceilings, and light vibe clubby background music. Volume is soft so we could hear each other.\nService (5/5): We were attended to often and our requests were complied with haste. We never felt rushed.\nWe came to dine during the NYC Restaurant Week 2025. The menu is presented with an ornate traditional artwork cover. I especially liked their house chili oil which we had a second helping of. The dishes have traditional flavors and are also quite spicy relying on spices like Szechuan peppercorn which makes your mouth numb if you haven't had it before.\nThey came out with free steamed dumplings (2 spinach and 2 shrimp). Our group of 9 was given 4 trays! The presentation was beautiful and went well with the table vinegar and homemade chili oil (which we asked for a second helping of!)\nScallop soba noodles (+$10) (5/5): The noodles were seasoned in a spicy and super flavorful sauce. The portion size was large!\nCalamari (4/5): We were warned ahead of time that the dish is served cold. The pieces were chewy and it was covered in a spicy chili oil. I enjoyed the sauce and presentation but it was not like I would continue to eat this dish if more was served to me.\nMala Beef Tenderloin ($+18) (4/5): While the cuts of the beef were really tender, I felt like there was not enough vegetables to substantiate the dish. The sauce was good, spicy but not too spicy. Portions were very reasonable for a main entrée.\nMapo Tofu (4/5): As expected for the dish. For people who can not tolerate spice, the szechuan peppercorn will make your mouth go numb! My friend who ordered this could not eat more than 4 spoonfuls. I took the rest of the dish home and enjoyed it to the fullest.\nChilean Seabass (5/5): Although the presentation of the fish appeared small, the dish was phenonemal. The silky texture cooked to perfection and the sauce was light but there was so much umami to it. Don't sleep on this light but delicious, classic dish.\nSide of Fried Rice (5/5): I was surprised at how much flavor the fried rice had. Usually I feel like they're made bland but I almost finished the whole bowl!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSeFNGQXhiRGRJUzFFMFJWaFBjMEozY21GV05IYxAB",
            "text": "I made a reservation for me and my boyfriend for his birthday dinner. The ambience was nice but very dark -- they only had a tiny light right above our table. My eyes were very blinded and started to hurt 30 mins into the meal. We ordered a variety of dishes. The food was presented very nicely, they tasted okay but a tad salty for our taste. The last dish (I think it was sweet and sour pork) was hard to eat on its own without any carb pairing even though they had rice crispy so I asked one of the waiters a proper way to eat it. His response shocked me as he said to eat with my hands as it was not obvious already. Overall, it was just okay, fancy and overpriced Chinese food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNVDR2YzZ3OHRmYnp3RRAB",
            "text": "This place is incredible. We went to celebrate my friend's birthday. We made a reservation for a private room on the second floor for 9 people. We had our personal waitress who was attentive to us all night. She is from Russia and very sociable. She makes you feel good as a customer. Thank you for everything. The food is incredible, especially the duck, which was served to the table by a chef. I can't wait to return again. Thank you.😊"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLU1FzWmllMF9XZ3FRRRAB",
            "text": "Hutong doesn’t just dabble in the whole “fancy” thing, it saturates itself in it like a well-seasoned broth. The moment you step through the door, you’re not just dining; oh no, you’re entering a realm of high end culinary theatrics that screams “this is where the elite come to eat”. Let’s dive into the food.\n\nFirst up, the fried rice. It’s, well, fried rice, but not the sad, greasy pile of carbs you’ll find at your local takeout joint. No, this rice is seasoned to perfection, each grain popping with flavor like it’s been groomed for greatness. It’s a solid start, making you feel like you’re in good hands. Then, enter the fried soft shell crabs with Szechuan pepper. Now we’re talking. These crabs are crispy and spicy in all the right ways, packing so much flavor it’s almost like they’re trying to make up for all the delicate, understated touches elsewhere on the menu. The Szechuan pepper brings that buzz you didn’t know you were missing, waking up your taste buds like a morning jolt of espresso, and suddenly, Hutong is looking like it might actually live up to its fancy reputation.\n\nNow, let’s talk about the Peking duck. It’s good. I’ll give it that. But let’s be real: I’ve had ducks that were just as good; and sometimes better, for a fraction of the price. But no one’s here for a casual, “oh this is nice” meal. No, the Peking duck comes with a full-blown performance. A fire show, to be exact. Because nothing says “we take duck seriously” like flames. You watch in awe (or maybe mild confusion) as they set things ablaze like it’s a Michelin-starred version of a backyard barbecue. Is it impressive? Sure, if you’re the kind of person who thinks that flaming duck is the pinnacle of fine dining. After the pyrotechnics, the seasoned carver steps in, turning slicing a bird into an art form. It’s like watching a sushi chef, but instead of raw fish, it’s crispy duck skin and tender meat being shaved off the carcass like it’s a Michelangelo statue in progress.\n\nNow, all of this is, of course, very dramatic and undeniably delicious. But here’s the thing: while I’m over here marveling at the flames and the precision slicing, I’m also wondering if the high price tag is for the duck or for the show. And honestly, it’s starting to feel a bit like we are getting charged for the experience of watching an overpriced theatrical performance rather than just having a good meal. It’s fun, no doubt. The food is solid, and the whole experience is definitely memorable, but you might find yourself wondering if the price tag really justifies the spectacle. In the end, Hutong is one of those places where the food is good, the drama is high, and the stakes are high."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxdlVVbzBMVE54YUVKUkxUTXdWVE5uUjA5V2FYYxAB",
            "text": "My partner and I had an incredible dining experience at Hutong in Manhattan. While parking is what you'd expect for the city, the restaurant itself is stunningly huge with distinct bar and dining areas. We splurged on the Wagyu Beef Mille-Feuille and a half Peking Duck, paired with Tsingtao and Gao beers. The food was absolutely delicious—every bite was a flavor sensation. It was definitely a pricey meal, but the quality of the food and the overall experience made it worth every penny. For a special occasion or just a fantastic night out, Hutong is a top-tier choice for modern Chinese cuisine. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGSmFrRmZVRVkwVFdneGMzSlRPRFZ3TmtOWFVsRRAB",
            "text": "Went for the restaurant week menu- a great deal. Elegant, big space that clearly wants to be a showstopper situated across from the Bloomberg offices.\n\nMy personal favorite dishes were the steamed cod (simple, delicate, but perfectly seasoned), sautéed green beans, and calamari flowers. The cheesecake and tiramisu were both excellent. I was particularly fond of how light and airy the cheesecake was. I’ve never had one like it.\n\nA few criticisms- the wait time was slow. It took awhile to have our order taken, and then finally get served. My cocktail took about 30-40 mins to arrive and we didn’t get our first course u til 45m-hr after arrival. The total meal took over 2 hours but didn’t need to. The chicken salad tasted like nothing but raw onions. I was not a fan of the cocktail (“Comfortably Numb”) but that may just be personal preference. It was a beautiful cocktail, just not for my flavor profile- it tasted like mouthwash to me.\n\nWould I go back? Absolutely"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kSVNGOURUa1ZFVEhnd2JtZDRabUZZWHpGUVVGRRAB",
            "text": "I came to Hutong for the NYC Restaurant Week lunch experience and was extremely disappointed. The moment I mentioned I was here for Restaurant Week, the reservationist’s attitude shifted and became noticeably rude and dismissive.\nThe restaurant week lunch menu was $30 with an appetizer, entree, and side dish, but what I received felt like a bare minimum, watered-down version of their regular menu.\nFor the appetizer, I chose the King Prawn, Leek, Jade Hearts & Cilantro Salad, which is normally priced at $33. What I got were two tiny shrimp, split in half to create the illusion of four pieces. The rest of the dish was literally just a pile of leeks. The balance of ingredients was a joke.\nFor the entrée, I selected the Steamed Chilean Sea Bass—listed at $57 on their menu—yet the portion I received was shockingly small, bland, and unimpressive. There was zero flavor. Honestly, my dad could make a better sea bass at home for a fraction of the price.\n\nFor the side, I went with the Chef’s Fried Rice, expecting something special given the name. Instead, it tasted like plain rice tossed with oyster sauce, and not even properly mixed. Some bites were overly flavored while others were completely plain. It was so basic that calling it a “Chef’s” special felt borderline insulting.\n\nThe whole experience felt like a bait-and-switch—as if Restaurant Week diners are seen as second-class customers. Even at $30, it didn’t feel worth it. I can't imagine how much worse it would have felt paying full a la carte prices for such stingy portions and lackluster flavors. I left feeling cheated and unwelcome."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaFltSEtREAE",
            "text": "This is a beautiful upscale Asian restaurant. We went for brunch and chose from the brunch menu, instead of a la carte. There are good vegetarian options. The person I was dining with ordered the duck. He thought it was excellent. The atmosphere is nice. The decor is contemporary and elegant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WlNUaGlhamcwVURsUE1WOWlaMHR4ZDBSdmNFRRAB",
            "text": "Came here with friends for restaurant week, but I ended up ordering from the main menu after being told they were out of Iberico Pork dinner option.\n\nWe shared the Flaming Peking duck, which was delicious. However, there was a significant amount of wait time between each course - we were waiting for our final dish for 30 minutes.\n\nOur waitress was courteous and staff were constantly filling our water. They were aware of the wait issue and comped our desserts, which was nice of them. However for the price range this restaurant falls under, I expected better management and execution."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNdVd5NnVtbzdqTWpBRRAB",
            "text": "I came here for lunch. the food is tasty. Very happy with it. Also we're in a hurry and ask them to make it quick. they deliver our request so we're very happy. Their place is also quite massive, and there's several places and scenery for the dining"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOYUp2N09xMU5UOGJnEAE",
            "text": "Really good atmosphere and dim sum. The tiramisu with Hong Kong milk tea is also interesting. While the food is good, it’s probably a place you go more for the ambiance than for the food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaE1ERWRREAE",
            "text": "This was such a fabulous experience. We were a party of six, which allowed us to sample plenty.  I have zero complaints.  Everything was tasty. The presentation was beautiful.  The space is gorgeous.  The staff was fantastic from hostess to our server."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZeFIwTndiRWg1UWpOaWJUWkNaRFJ3Y0VoNVpFRRAB",
            "text": "This is one upscale Chinese restaurant, right next to Bloomberg Tower.\nThe place is well decorated with modern art, and the staff is very professional.\n\nWe ordered Ma La Chili Prawns, Sanchen Spiced Chicken and Chef’s fried rice.\n\nMa La Chili Prawns and Chef’s Fried Rice is an absolute winner. Prawns were spicy yet not too overwhelming with chili heat. The fried rice was simple yet one of the best ones I have had in a long time.\n\nSanchen Spiced Chicken was also decent, but its mainly a large bowl of sauted chilies with some spice roasted crispy chicken. Its good but only those with high spice tolerance can handle it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psdlRITmpYM1ZrYURoSlJVUlNjSHBUVFhKM1dsRRAB",
            "text": "Even though I walked in circles trying to find the restaurant,  I found the quest to be rewarding.  I ordered off the price fixe menu.  For $60, I had chefs selection of dim sum (soup dumplings),  and appetizer (scallop with noodles), main dish (sea bass), side (chef's fried rice) and dessert (boba flavored tiramisu).  The food was authentic and absolutely flavorful.  Service by Manshat was absolutely impeccable."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLS3B5SmZELTZUYVFREAE",
            "text": "Hutong offers an elegant fine dining experience specializing in Northern Chinese cuisine. I was immediately impressed by their signature cocktail, \"Comfortably Numb.\" The infusion of Szechuan peppercorn and Thai chili added a unique kick that I loved.\n\nFor appetizers, I highly recommend the Hutong prawn rolls--crispy, fried minced shrimp and scallop, perfectly balanced in flavor. The Yu Xiang crispy dumplings, filled with pork and mushroom, were equally delicious.\n\nThe aromatic beef rib in lotus leaf was tender but unfortunately a bit dry, so I'd suggest skipping it. The Dan Dan noodles were tasty, though the peanut butter flavor overpowered the spice--I would have liked a bit more heat.\n\nFor dessert, the bao with soy milk ice cream brought a wave of nostalgia, while the mala chocolate mousse was an intriguing mix of flavors that I ended up enjoying.\n\nOverall, the food presentation was impeccable, adding to the refined experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdFJ6ZGFOVE5TYTBvelUxRlJRVjkyUkhSYWIxRRAB",
            "text": "Hutong had been on my must-visit list for quite some time, so when I saw they were participating in Restaurant Week, I jumped at the chance to finally try it. I specifically reserved a “Restaurant Week table” and was looking forward to the experience.\n\nWe arrived about 10 minutes early and were warmly greeted by the hostess, who kindly asked us to wait by the bar until our table was ready. The bartender was incredibly friendly—he noticed we had just come in from the heat and offered us cold water right away. He made pleasant conversation and made us feel very welcome, which started the evening off on a great note.\n\nOnce seated, our server Euclides brought over the menus. However, they weren’t the Restaurant Week menus we had expected. When he returned, we let him know we were there for the Restaurant Week menu, and that’s when the tone shifted noticeably. His response—“Oh, you ordered that?”—came across as curt and dismissive. At first, I thought maybe I was reading too much into it, but everyone at the table felt the same shift in energy.\n\nWe went ahead and placed our order, choosing the scallops and the beef dish (which came with an additional charge). After receiving our drinks and appetizers, we noticed that the scallop dish hadn’t arrived with the rest of our mains. We waited, thinking it might be just delayed, but eventually had to flag Euclides down to ask about it. He seemed visibly annoyed by the question, which added to the discomfort we were already feeling.\n\nThroughout the meal, he didn’t check in on us, and each time we needed something, we had to actively get his attention. The service felt very disengaged, and unfortunately, the vibe suggested that our choice to participate in the discounted Restaurant Week menu may have influenced how we were treated. Perhaps he assumed we wouldn’t be tipping as much, or maybe he was just having a rough night—everyone has those.\n\nDespite the uneven service, the ambiance was beautiful, and there were still moments of hospitality worth noting, especially at the bar. Because of that, and because I believe in second chances, I’d be willing to return and give Hutong another try—hopefully under different circumstances."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcWY2YVhnEAE",
            "text": "We had the most amazing time at Hutong! The food was absolutely delicious — every dish was full of flavor and beautifully presented. The service was outstanding; the staff was so attentive and made us feel incredibly welcome. The space itself is gorgeous — such a stunning and stylish atmosphere. We were celebrating birthday, and they made it extra special by surprising us with a free dessert. The whole experience was unforgettable from start to end. Highly suggest for a special night out!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYck1lcFBBEAE",
            "text": "This restaurant is an excellent representative of modern Chinese cuisine. Their dishes retain the essence of traditional Chinese food while being adjusted to modern dietary preferences, appealing to a broader audience.\n\nMany of their dishes not only taste great but also have an appealing presentation. The Peking duck, in particular, is one of the best I’ve had in New York, with the perfect balance of richness without being greasy, true to the authentic Beijing style. Additionally, their creative desserts are also impressive.\n\nAside from the food, their service and ambiance are commendable, with an elegant setting and well-spaced seating, making it ideal for conversations. The only downside is that the restroom is a bit far from the dining area, with dim lighting, making it hard to find.\n\nOverall, it's a great Chinese restaurant worth recommending."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQUG5pWWZfZy0zVGZnEAE",
            "text": "The decor is a treat to behold, especially what I refer to as the \"champagne hall of fame.\" I was a bit disappointed with the seabass and noodle dish because it was just \"nice. \" The 2-part duck course was delectable, and the cocktail was the best I've ever had, and I'm not a cocktail person!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCTGRURlhMVVZyUW0xSGNFUnVlbXROZDJad1NrRRAB",
            "text": "Dumpling plate is amazing! Enjoyed dinner, high quality service, was surprised how every dish was presented and described. The delicious taste of every dish worth eating. Recommend this place. Will come back for sure!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MG82VjJRRRAB",
            "text": "Here on a Monday. Made a reservation for 12:30pm and the restaurant was quite empty. Even though there was hardly a wait to get seated, it took over an hour to get my food.\nThe food was good, but didn't quite meet my expectations for the high price point.\nJust some notes:\n-the dim sum was delightful. Prawn rolls were cripsy and the crispy baos had a nice soft texture\n-roast duck had crispy skins but came out rather cooled\n-the kai-lan wasn't very flavorful, but had a nice texture\n-yunnan tea was nice; it gets bitter if you let the tea steep for too long."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSblYzWkVlV0ZCUzFsaGQwZDRlRnBPWnpkWVVtYxAB",
            "text": "5 stars all out\nGreat food\nExcellent service\nPrime location\nMassive place\nMarvelous variety of drinks including a whole wall of champagne\nHad a great team dinner\nFound reservation with ease"
        },
        {
            "date": "5달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYVJ0cVA5bGNqNXF3RRAB",
            "text": "胡同.高档的亚洲餐厅，美丽的空间.亚家餐厅. 用服务员全是老外. 服务态度非常好.. 人生首次品尝$140一只北京烤鸭.但，真是好吃，脆皮润肉，没有一片有硬片👻，鸭2食，鸭骨肉划出鸭肉末和包才一起吃. 饺子非常好吃和美味. 口感很好，价贵有质量保证.特意点了辣力鸡对比一下，胡同的辣子鸡，炸的不是太脆，但是肉有咬劲，没有感觉太多面粉.不麻辣.“开门红”👉桂花鱼片煮面条✌️\n－碗饭$6有点心痛😂开头我估计是$5😂价格贵，走高级路线，随遇而安.."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOUlJYTk1VbmxOTjFJNFdYVjBXa3RhZFhWSlNuYxAB",
            "text": "Amazing service, food and ambiance! The staff were very warm, making sure it was a great experience for me. Will definitely be going back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMVFM0b0dqc3ZTMG5RRRAB",
            "text": "We ordered the flaming duck. The cut was too thick and the chef didn’t care how it was presented. It looks like he wanted to finish it quick so he can get off work… it only requires a bit more patient for $150 duck."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiMjdycFRBEAE",
            "text": "I recently had lunch at Hutong NYC during restaurant week ($30 menu), and it was fantastic! The place has a really cool, upscale vibe that made it perfect for a lunch outing with my colleagues.\n\nWe kicked things off with the hot and sour soup, which had the perfect kick and was super flavorful. The Kung Po chicken was the highlight—tender, tasty, and with just the right amount of heat. We wrapped up with the chef's fried rice, which was spot-on and tied the whole meal together.\n\nThe service was great, making sure we had everything we needed without being overbearing. Overall, Hutong NYC is a top spot for anyone looking to enjoy some delicious Chinese food in a classy setting. Highly recommend it!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBbllueFVBEAE",
            "text": "Modern art deco decor greets you upon entering Hutong, a lovely restaurant with a hall of wine bottles displayed behind lit glass to the right and a sexy dining room with comfortable seating to the left. The menu options were unique, making it difficult to decide. We ordered several items (the lobster dish was a favorite), all of which were Michelin 🌟 quality. The drinks were beautifully made as well. Perfect place for a dinner date or respective business lunch."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdUtTT1l3EAE",
            "text": "A friend and I recently had dinner at hutong and we loved it! Service was slow, but the food more than made up for it. We had the soba noodles and scallops, crispy dumplings, mushroom bao and veggie fried rice. Everything was delicious and look at how cute the mushroom bao were!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNId3AtQzlnRRAB",
            "text": "From appetizer to dessert, all exceeded expectations! We did order the fried dumplings with squid ink, speechless! Too bad most of the servings are usually good for 2, you’d be wanting for more! Also the fried noodles and Chefs fried rice was good too! Some desserts were not available yet by the time we had to order some, one dessert that we wanted, there was a 20minute wait so we had to order another dessert but also good! The ambiance, good for celebrating occasions and special events. Make sure to get your table reservations!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWb2VWUjJSMVpaTUdoUFRtTkhka3hQVVVWdmNYYxAB",
            "text": "Excellent brunch. Definitely get the peking duck add on, it's well worth it"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfcVlEQ0t3EAE",
            "text": "Let’s celebrate Chinese New Year with Hutong New York’s famous award-winning Northern Chinese cuisine. Step inside and snap some pics with their stunning walk-through wine cellar. We had an amazing red mushrooms dumplings and roasted iberico pork from their New Year special menu. We also enjoyed some delicious appetizers and half a Peking duck inside Hutong’s beautiful and cozy dining area. Their attentive staffs brought out each dish with amazing aesthetics making them seem like artwork. Don’t forget to order their famous Treasure Bowl dessert which also comes with a surprise gift! Stop by Hutong New York and celebrate any occasion or simply have a great meal!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdm96R3hRRRAB",
            "text": "The restaurant is beautiful and our group had a great time dining here. We did the brunch free flow and enjoyed an assortment of appetizers including dim sum and added the pecking duck which was also fantastic. The manager was very nice and took great care of our group."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmZ2RxX0RnEAE",
            "text": "Hutong is well-known for its contemporary award-winning Northern Chinese cuisine inside the Beacon Courtyard by the Bloomberg Tower. stunning walk-through wine cellar that makes you want snap a picture. The atmosphere inside Hutong is upscale and cozy. With their warm and friendly staffs, they can make a cold blistering winter warm! We ordered a couple delicious drinks to warm up as well. Hutong has recently launched the Emperor Dinner Set for only $60 per person. Enjoy some dim sum and appetizers before your entree and choice of rice. Then indulge in sweet desserts that you won’t find anywhere else. All dishes are beautifully arranged with flavors you can taste. Stop by and try out their Emperor Dinner Set now!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYLThIQmRBEAE",
            "text": "I recently celebrated my dad’s birthday at Hutong NYC, and it was an unforgettable experience! The food was absolutely phenomenal, with a great variety of dim sum options to choose from. The steamed sea bass was melt-in-your-mouth perfection, and the seared scallops with soba noodles were a hit. The atmosphere was stunning—totally Instagram-worthy.\n\nThe service was beyond exceptional, with Alma, Jeffrey, and Joffrey making the evening feel extra special. As for the drinks, they were incredible! My dad loved his old fashioned, my sister couldn’t stop raving about her lemon drop, my mom had the best dirty martini she’s ever tasted, and I was blown away by the espresso martini.\n\nWe’ll definitely be back—Hutong is a must-visit!"
        }
    ],
    "reviews_count": 88
}