{
    "name": "Patsy's Italian Restaurant",
    "place_id": "ChIJ22yt_PdYwokRFf4cnErij6k",
    "grid": "MN5",
    "address": "236 W 56th St, New York, NY 10019, USA",
    "rating": 4.3,
    "user_ratings_total": 2025,
    "phone_number": "(212) 247-3491",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCNWJIUlBPVGhmVjJkTVV6aFdNRXAwZFhvM1QwRRAB",
            "text": "Visited with my husband, brother and brother’s girlfriend. I mistakenly didn’t make a reservation (I didn’t see where I could) and when we arrived, we were told they’d just need the table in an hour and a half for a reservation which was completely fine because we had a Broadway show anyway. Our server was great - funny, interactive and attentive. The chef came around too (and told us a funny joke about our server lol) - he still looks exactly the same as the pictures in the entrance area! Lol overall, everyone enjoyed their food - chicken parm, manicotti and chicken Alfredo (I think is what my brother got)."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cVIzQlFlRkptWDFoYVprcFZWMFV3UzFCR00yYxAB",
            "text": "My mom asked a question the waiter got upset (what are the portion size she asked) , she asked another question he got upset again, in business customers are aloud to ask questions, food was okay not worth the money. Don’t recommend if you have questions about the food."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKQlJXMTFORk5LWDI0emFXTklWMng2ZEdWRlRFRRAB",
            "text": "The food was very salty especially the salad and artichoke. Chicken Marsala was bland and chicken was not cooked properly."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xM1psQjVRMFUzTFdwd2MyMVRaRkpUUzI1TFVrRRAB",
            "text": "The place was amazing overall. I had the Linguine with red clam sauce with a glass of Pinot Grigio. After I ate a delicious slice of their canolli cake with a double espresso.  😋. FYI No hats allowed in the dinning room"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oSFVERnljVW8xUm01bFdXZERYMmRoVmtrMmVWRRAB",
            "text": "For my first proper dinner in NYC, I chose to book a table at Patsy’s, and from the very beginning, their excellent staff (seriously, in a city full of people really great at hospitality, these guys might take the crown) made us feel right at home.\n\nSince the food was delicious (the flavors, wow), and as the drinks were flowing (kudos for making Old Fashioned the old fashioned way, no pun intended), it was clear to me how this restaurant has kept people returning again and again decade by decade. A true institution for over 80 years, here’s to many more!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxNUxXNVZSMmczU2xCNmRGZFNjMjl2UTBaaGQyYxAB",
            "text": "My wife and I were so excited to eat here. We’re not from New York City so this was way out of our way. Were saw amazing reviews about Patsy’s and decided to go. We waited over 1 hour to receive our food which was only 2 pasta dishes. The table next to us came in 15 minutes after us. They were greeted, ordered drinks, appetizers, food, and desserts all before we got our food. They even left before we saw our food. My wife and I had made plans and had to have our food taken Togo. We only saw our server when he first greeted us. Every other time something came to the table it was brought by someone else. Absolutely horrible experience. One of the worst servers I’ve ever had. If you want an overpriced bowl of spaghetti go anywhere else. (Seriously $16 for a side order of spaghetti with tomato sauce!?!)🥫"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aa1ZYUlhURjl4ZUVNM1FUVjNkbFJ3VG5aUldFRRAB",
            "text": "Legacy staple - always fresh, delicious Roman Italian cuisine.  It’s been around since the early 1940’s because it’s great."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCalptUTNjRGRKWlZoZmRWTnBNRVZrTFZsNWNXYxAB",
            "text": "My go to Pizza spot every time we hit NYC.\nGet the whole Cheese Pizza for pick up… you will be thanking me.\n\nDining in is also pleasant, great service, cozy, affordable AND YES DELICIOUS."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCYVYwcHFkRXBCVERWWk9HdGxVVnBrUnpCUE5VRRAB",
            "text": "Good and classic Italian food. Great hospitality."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRMlR6QmljRXd4WDNZNVpUbGFaVnBKVTBKcU5rRRAB",
            "text": "First timer…delicious food and amazing service. Love it here."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkZmMxQkVSRTV5T1dWaFZtUTFWVjkxVG1Gd2NWRRAB",
            "text": "Visited with longtime friends and our families.\nWe went with two families and five kids, and the staff warmly welcomed us.\nThe atmosphere, the flavor of the dishes, the wine selection, and the service were all exceptional.\nIt truly became a memorable restaurant for us."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSU9GTk1kRGhvVDIxSWREbDRObFpqVW5wWlZuYxAB",
            "text": "Dude it was AMAZING, the food was gold tier. We got lobster linguine, salmon, pesto linguine, buttered noodles, with chocolate cake and a cappuccino. My kids ate great, and there no complaints. The ambience is old NYC Italian, the waiters are all legit Italian guys, everything about it is exceptional. But the OWNER was sssooooooo nice!! He’s the sweetest, nicest, sincerest bro. Just a legit total solid dude. We love it here"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTFlsTmFlalZmUVUxUVJFbGxhR1JXU1dsUlZFRRAB",
            "text": "Do NOT recommend. A big rip off .\nRude  staff !"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOT1JHSlpVVVZSUzAwd09FMVNjRGQ0TUdKU2RVRRAB",
            "text": "Cute place, white linen. Cocktails were very good but at $25, no reason just because you can doesn't mean you should. There were 3 of us, 2 had the house salad which was very good. I had the caesar salad was I thought very good indeed. A companion had the eggplant rollitini which she enjoyed. I had gnocchi with Alfredo sauce. I take that back, I ordered that but it was not edible.  The sauce was this yellow, tasteless, grainey mess of stuff over dense, doughy gnocchi. Unappealing.  Other person also had the dense gnocchi but with meat sauce.  Both dishes were sent back. I did reorder and had spaghetti with marinara sauce and it was very good."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GblRHdERjVU5XUW1aWk5FOTBka3RFVjBWaFNrRRAB",
            "text": "Old school Italian  restaurant.  Service is quick, menu selection is large.  Food varied from pretty good to not bad. It felt like a classic NYC restaurant  from a different time."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOUVNUVlFTekI2TFc1cE0ydDVOMFpEZFhwWmEwRRAB",
            "text": "Let me start with why this is a one star review. As a tour co-leader I took a group of 50 people to this restaurant for dinner. One member of our party was disabled and could not climb the stairs to their second floor dining room. No elevator was available. I asked that this individual be able to eat on the ground floor. They refused to accommodate her saying they were full with reservations. I brought up the fact that there was a table in the bar area where she could eat. The staff member, who appeared to be a manager, said they had a policy that no one could eat in the bar area despite the fact there was a table there. They stood by this policy even though, in this case, it would violate federal law as they would not accommodate a disabled individual. For my point of view this restaurant should be avoided at all costs. The discrimination this restaurant exhibited to the disabled individual in our party is inexcusable. My remaining tour participants said the food was good. At the end of the meal, even though we had made it clear that alcohol purchases were the responsibility of tour participants, she serving staff put all the alcohol purchases on one bill and refused to collect money from tour participants. We have been running tours for years and we have never run into a single restaurant that has done this. My co-leader ended up charging the alcohol to his personal card. That should never have happened either. I cannot recommend Patsy's restaurant in any capacity, and I review a lot of restaurants on Google, most of which get five star reviews. Discrimination of this nature should never be tolerated."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1eloyUjNWbXB5Ym1GaFoyVjFWSFUzZWpGRWEyYxAB",
            "text": "It's so delicious that it's indescribable"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214RU1uQTNhMDl1ZVhvM1kzTnBabU5GTm5Cc09YYxAB",
            "text": "Dear Sal, I met you once an was impressed by your easy kindness and accessibility, and if course your excellent, authentic hospitality. You made me feel as though I mattered. Well, in your absence yesterday, the staff did not disappoint. I was a bit nervous with being with clients and I can be demanding. But everything was smooth, delicious, fresh and your waiter was kind and very funny..He really knows how to see what a customer needs.\n\nThanks to Eliana as well who helped me with my reservation.\n\nAll the best,\n\nLou Maiolino"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psc1dXZFJRM1ZzYVVsUGJtdGtjSEJSU2pGQ1pWRRAB",
            "text": "Patsy’s is the real deal. Not long after arriving we met Chef Sal, third generation owner. He and his staff were so warm and welcoming. The eggplant parmigiana was easily the BEST I’ve ever had. Bring your appetite- the portion sizes are very generous, you will not leave hungry. Thank you Michael Bublé for the recommendation, we loved it as much as you do! Be sure to call ahead and make a reservation- this place was bustling even on a Monday night. ps) Chef Sal even went outside so we could take a selfie with him in front of his iconic sign🙏"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCYVFrSmxUMHhrTUhOdE5XbEtNR1IzYVU1VVZtYxAB",
            "text": "Great food and great people!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SMFowVklkMVZtWVZsVk5Xb3RkM1ZpU0VWdmNHYxAB",
            "text": "the best italian food i’ve had in nyc. the fettuccine had fresh house made noodles, perfectly cooked shrimp, and delicious flavor. the cake with cannoli filling was one of the lightest and yummiest cakes i’ve ever had. and everyone was extremely kind! one of my new favorite restaurants, thanks everyone!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MlVtMW9jSFp1ZDNNM1MzQjFPRTk0YldRM1RFRRAB",
            "text": "We went on the first Monday they opened after  being closed on Mondays during the summer. Meal was amazing. The owner, Sal,checked in with us to see how meal was. My wife being a Frank Sinatra fan due to her late mom's love of the singer, saw they had a large coffee table book along with a recipe book the current owner  put out. We asked about prices and if Sal would sign his book. He enthusiastically said yes. As we were getting ready to leave, I came out of men's room and my wife was sharing with waiter story of her mom's love of Sinatra and an experience of her missing him in Vegas. The waiter then took us upstairs to Franks private room where the owner shared a few stories of the days Sinatra would come in after he performed in Nyc and brought several of his friends ie Sammy Davis and Dean Martin to name a few. The owner was even kind enough to take some pics with us.\nMy wife was in tears after as it seemed like her mom was watching.\nThanks for the amazing night."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGeGRURTFXamhYUkY5elNrRm9SakExZFZseVdYYxAB",
            "text": "There is a girl on cashier zone, who had really bad attitude and rude. She has no idea what she is doing. Charged from my card 3 times same amount and then tried to cancelled it. And said “you can wait howlong it takes” mean cancellation. The foods were avarage. Restrooms were terrible and dirty. Price was expensive. It doesn’t deserve all the compliments."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214R09ITk1URnBxWjBwRFUxWk1jVE5zVXpJMFEyYxAB",
            "text": "Beginning to end Patsy's was a fantastic experience.  The food and service were amazing, and the location was a small oasis of calm in the city.  Would absolutely recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWclpEbG1Ta2wzVVZGdlJISkhaVXRLVVhCblVsRRAB",
            "text": "Great date spot, will be back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psZlpqVlBaRWx3TUVwM1IyeDRSamhFWjFwTmFVRRAB",
            "text": "You know that scene in ratatouille where Ego eats the food and has a flashback to his childhood memories because it's so good?\n\nYeah that happened to me here"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSUlJEaHlTbHBUT1RSMk5UVnpUMW95U0ZWb1JVRRAB",
            "text": "The food the staff were outstanding Was my wife’s birthday entire staff and 3/4 of the restaurants sang happy birthday to her"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUk9GSnFYMGRZZFZNMlpsOXFZV1JRYkRsRE4zYxAB",
            "text": "Food was abysmal! Such a let down. Soggy calamari, mealy veal parm, overcooked fettuccine alfredo... almost inedible. Hate what happened to this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NM2VqTjJaV3hhV1hoMFVWTjBZazVSU201SFJYYxAB",
            "text": "We had THE BEST service, food and drinks. The shrimp scampi was perfection. Adrian was so nice,  professional and helped with choices when a few of us were undecided. He had us laughing the whole meal."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdFVEZHBSRk14U0ZObGRXSk1iRTQ1WkZSWlJIYxAB",
            "text": "I ate there several times the one in Hilton Casino in Atlantic City, New Jersey my meal was comp Every time I ate there"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xTFltZ3hYMHBUYUhoWFNIbENVMmxMWVZKd1VWRRAB",
            "text": "All the hype should’ve ended years ago.  Food no better then any other Italian place.  Couldn’t hold a place if comparing to real Italian food in Italy.  Plus who wants to patronize an establishment that is sueing another place with the same name.  If you’re that good, you don’t need to compete.  Save you money and time and pick any of the hundreds of other Italian places in NYC with a lot of 5 star reviews."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poR2FtMTVPRmhTVUVWU2JYTkZSMWhyUWxrNVRrRRAB",
            "text": "Made reservations for 6 was seated at 7 drinks were good should have been comp because making a reservations for 6 and waiting an 1 is totally unacceptable they didn't even offer an appetizers I was in shock this place has a good reputation  my wife had Veal Rollatini Marsala\nShe said it was absolutely disgusting the veal was old tough I had the eggplant  it was undercooked and the sauce had a sour taste to it absolutely horrible expensive dinner experience"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Fd1QweDZaWFU0YkhWb1ZqQlZZVms0WW5Sd09FRRAB",
            "text": "We had a reservation here on our trip to NYC this summer. Best meatballs we have ever had!! Fettuccine Alfredo was top notch too. If we went back to NYC I would definitely go eat there again. The chef came around and asked how dinner was and after raving about the meatballs he had me take a picture of the recipe from his cookbook. Don’t miss this place!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKR09IcDVRbEV3Y25sSkxWSnJabk5yYUdkdWJHYxAB",
            "text": "Delicious food! Kind staff - really friendly and kind. Sal Sconamiglio himself the owner greeted us and walked to every table. He told us the history of the restaurant and we relished it. The pasta entrees are classic and don’t miss the cannoli cake. I thought I was in cannoli heaven. Light, fresh… going again this Wednesday."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psa2REUnJkRlkzYkhsMVFrbzVRa1pGUW5oS1pGRRAB",
            "text": "My wife and I came to Patsy‘s because we heard the food was legendary. When we arrived immediately, we felt welcomed like we were at home. The waiter Danny was wonderful at his responsibilities and made us feel very important. The owner Sal himself came, sat with us, gave us history of the restaurant And shared with his personal experiences, including with Frank Sinatra. We both ordered fettuccine Alfredo, which for us was the best we’ve ever had. We would recommend this restaurant to anyone and personally take our most beloved family there we hope that this restaurant continues to be an experience for all those who love excellent Italian food!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNMFVIYzFiRTFDY20wNFVHSlNZblZ2U1hkNGFXYxAB",
            "text": "Nice atmosphere but felt rushed by waiter.\n\nAttended a party here and the service could have been better. I don’t remember the waiters name but he didn’t look presentable at all. He was very impatient with us at times. When the time came to pay my bill he got my attention by waiving the billfold in my face reaching over my cousin’s head.\nOther than that the food was good, it was a preselected meal for the party with a good selection of entrees. We were accommodated for those who wanted items off the party menu."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWQmJIZENhekZ2ZFhsWmRHTlRRVUZYVlV4cVZWRRAB",
            "text": "I visited Patsy’s Restaurant in Manhattan last night, expecting a classic Italian experience given its long-standing reputation. Unfortunately, I was very disappointed with the food. I ordered the veal parmigiana and mozzarella in carrozza, and both were frankly unappetizing—bland, greasy, and poorly executed. The coffee was equally underwhelming, far below what one would expect from a traditional Italian establishment.\n\nThat said, the atmosphere was pleasant—and the staff was genuinely friendly.\n\nSadly, the food didn’t live up to the legacy. I would not recommend this restaurant, especially to anyone looking for authentic or high-quality Italian cuisine."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWVIySjJZWGhCWDJWa01FRkVkWFpuTTJoMFVYYxAB",
            "text": "It’s good but portions were huge."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25STVdIRnRaVTFKUVRkMmVXUmpkME5rVDBvNWVsRRAB",
            "text": "Party's is a landmark. As such, they trade on their past glories, For a waiter all known place, the food here is average and inconsistent. In the recent past I have been twice, Both times, an chose the Putanesca,  The first time, it was spot on. The second, most recent, it was over sauced and watery.  My friend had the chicken Contadina and was not thrilled.  But food, especially Italian food is so subjective,  I think Month's is a better choice.\nMy review bas more to do with the management. I had an issue withmy bill.The server accidentally charged me twice for dessert.  At 15 dollars each, this was not a $3 forget about it mistake, but a $30 plus error.  I acknowledge that, as a customer, I should have checked my bill before leaving.  I did, however, see the error at the subway and called right away. They were c!osed.  I called the next day and they told me that manager was not there yet, please call back,. I did and asked for Joe, as instructed. They put me on hold and could not get him. The gentleman asked what it was about and said that I needed to send an email, which I did.  The response (and I attached the scanned receipt) was that they had to send it to the accountant who would be in later in the week. I then received from  the accountant an acknow!extent of error indicating that I would get a refund later by the end of the week.  They did not mention the amount, and I outlined that tax and tip should be included as it was a waiter error. The refund did not include the $6 tip.\n\nIt took more time to deal with this than it did for dinner. Next time, I will goto Arturo's. the food is better and cheaper and if I have an issue, the owners will fix it, buy me a drink, and give me a hug. A real Italian response,  Beware the after dinner annisette at Patsy's. An ample pour but $20."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsc1RqZFViMDFqTm5oMk9EQXlaRTVWU25CU1JYYxAB",
            "text": "Nice Italian, good wine,  good service, Got the Chicken Parm."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMVdFdDFjM0ppYjFod1FWOHRjelJRUVZwZlpYYxAB",
            "text": "Quite simply the best Italian restaurant I've ever been to. If I could give it ten stars I would. Everything  - the food, the atmosphere and the service. Our server Seyo is the best! If you love Italian food, you have to go to Patsy's! I can't say enough good about Patsy's. I highly recommend Patsy's."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2preVFYRmthWEZUYzBSbFRFMXhZbXg1UTBFMFYwRRAB",
            "text": "Best sauce ever - full of italian flavors, simply overwhelming delicious food. Thanks goes also to the attentive, sympathetic service team, building a family style ambiente. Shall we be in the city again, we will come over again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOdE4zZFlSRU5DYUZKUGRIZG1SWGxEYjBoWmRtYxAB",
            "text": "Patsy's is your classic, old school Italian restaurant and a former haunt of Frank Sinatra.\n\nUnlike a lot of old New York, it lives up to it's billing and has maintained it's standards. Not cheap, but absolutely worth it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WbmRWZHNiWEJyU2taQ1lrazFlbkZ5UzBaMU4zYxAB",
            "text": "Old school Italian dining! Service and food are spectacular. Whether you take your time dining or are on a schedule this place is perfect!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210a1JuTkJhVzVTYTNNMWNscERPVkJJTWtOS1UyYxAB",
            "text": "I’ve gone to plenty of Italian restraints, and I can say without hesitation that this was THE BEST place I have been to. The food was outstanding, and the chef came out and asked how the food was, and will give you recipes if you request. Highly recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVU9WOUxVekF4Wm5SbE1GVkdha3RsU25oTVluYxAB",
            "text": "Authentic Italian food. Delicious  😋"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvMk5IRnRTRTlYTnpObFVraHRWMEkwYjJVNVNtYxAB",
            "text": "My new favorite dinner spot! Very classy and service is top notch. Everything was fantastic!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNU5sVkZXVEpZWjBwV2RtOW9WekpsTFRsaU4xRRAB",
            "text": "Simply the best…\nLugar con historia, que no se ha dejado seducir por modas pasajeras. Comida simple pero genuina italiana, ambiente modesto pero cozy, servicio alegre, lugar reconfortante para un alma vieja que busca sentirse cómodo en NYC."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kSWVFaDZYM2x2T1hKNGIyOUVZVmh6VmtaTk9YYxAB",
            "text": "As far as Italian food goes in New York City, Patsy's is a great representation of consistent quality food., The wait staff and the entire crew are always fun to talk to and extremely courteous"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xadk5GbHhURTgyT0dWV1YxUlZMV1UxU2pnek1FRRAB",
            "text": "The waiter screwed up my wife’s order, didn’t even come over to apologize, somebody else came with the right food he  never talked to us again, Took a half an hour for us to pay the check, food was absolutely amazing , The waiter was horrible"
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNZzdYeVBnEAE",
            "text": "75년이나 된 레스토랑이라 세월의 흔적이 느껴집니다. 식전빵 제공되는데 양도많고 깨도 뿌려져있어서 고소하고 맛있어요.\n식사메뉴는 파스타는 보통 29달러 정도 합니다. 미트소스와 토마토소스가 맛있습니다. 양이 많아서 1인이 1.5인분정도에요"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJd1BtZzRnRRAB",
            "text": "First of all, straight in the door was greeted by staff and told them my name and reservation time. Was seated by server and was greeted by the owner Sal, which showed he really does care about how good his restaurant does. Food was out of this world. Both pasta’s my wife and I ordered were fresh. Calamari app was perfect with house made pasta sauce. Had a cannoli to top off the night. Would come again. Thanks Sal I appreciate you and the restaurant being apart of our trip to New York. Will never forget it."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBZ19IdlRBEAE",
            "text": "Unfortunately this experience didn’t even come close to living up to expectations. When we walked in and said the heat was broken in half the restaurant, it should have been a sign. I also wish they told us that the kitchen staff was late to arrive and that it would be a significant wait to get food. We were seated at 11:55 and didn’t get our food (ordered entrees only) until 1:05. There were only a few tables of people in the whole restaurant. We had show tickets for 2pm, that was a 20 minute walk away. We sat there for the majority of the time stressing that we wouldn’t make it because no one was upfront  about the kitchen issue. We had about 10 minutes to eat and then packaged the rest up. The fettuccine Alfredo was watery and had zero flavor. And I do mean zero. The service wasn’t particularly friendly or good and the upstairs here was dingy and dated. This was a swing and a miss for us, which was especially disappointing because we were so looking forward to a lovely, delicious, and relaxing Italian lunch."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbTlldWR3EAE",
            "text": "Great food. Not only tasty but the serve provided exceptional recommendations. Service was top notch h and a team effort. Reservations were recommended and honored and we were greeted by a friendly team who sat us promptly. Atmosphere was fun but not overwhelming. Live music was great but still afforded guests to enjoy conversation. Overall exceptional experience and highly recommend we’ll be back soon."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2Ny1tSF9BRRAB",
            "text": "Friends have told me to go to Patsy's for a long time and I finally went there. It was early, around 4, and they were happyntonseat me without a reservation but I did need to finish around 530. This has happened before at other restaurants so it was not odd or unexpected. The staff was friendly and attentive and they have a full bar (the Whiskey Sour was great). As many others have written, this is an old school Italian place, since 1944. It does have a great atmosphere and many celebrity photos line the walls. The food is wonderful and dull of flavors. The bread is crusty and thick and fresh. It pairs well with the olive oil on the table. I ordered the Tortellini with veal meat sauce.  My Italian mother used to do a veal sauce and this brought back a lot of memories. The other dish ordered was Spaghetti Marina. A tomato sause that was neither too tomato taste or over spiced. Both dishes were very good. And we had a side of the sautéed spinach with garlic. And very good size portions. So much in face, we didn't have room for what looked like wonderful deserts. I guess another visit is in order."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MUlPVG5BRRAB",
            "text": "Patsy’s is a classic Italian restaurant with decent food and nice atmosphere. The service was slightly above average. The draw here is that several celebrities frequent this restaurant. The Italian food is great but for a place that uses fresh pasta I was expecting a bit better. Overall I would definitely return next time I’m in New York and craving pasta."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREN2JuQmx3RRAB",
            "text": "I ordered the Ravioli trio (but replaced the mushroom one, with cheese ravioli) They were all delicious, but the menu says that each one comes with a distinctive sauce, and if they were different, I couldn't tell.  It had a nice atmosphere though. A very cozy, family owned business that's been around forever, and has TONS of history and photos to prove it.  Dessert is an absolute must! My son went crazy over their chocolate mousse cake, and I ate my cannoli cake so fast I didn't even get a chance to snap a picture.  It was AWESOME! I will warn you though- the soda glasses are the tiniest you've ever seen, and at $4.50 a pop they do not provide free refills.  Not a big deal, just something to be aware of.  There is also an upstairs, but we didn't go up there so I can't say what's up there.  Overall, a great place for a good Italian dinner! 👍 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsNjRiUnZBRRAB",
            "text": "One of the finest meals I've ever had in my entire life. To eat such an exquisite meal in such a historic restaurant is absolutely fantastic. They sat us in Frank Sinatra's dining room on the second floor. We had the artichoke hearts and the clams oreganata as appetizers. Then for the entrees we had the trio of ravioli and the steak pizzaiolo. The food goes beyond description. There was a reason why Frank Sinatra and almost every famous Hollywood star has been to this restaurant. I doubt this meal will ever have an equal for the rest of my life. I also can't say enough about the service. The waiter we had who unfortunately I did not get his name was fantastic. Warm and inviting and made you feel like family. Thank you so much for the experience"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxanBHZlRBEAE",
            "text": "This restaurant is famous among celebrities. I found a lot of celebrity pictures hanging on the wall.\n\nThe staff was great and very fast lunch service. Bread olive oil and butter were served first.\n\nI ordered soup of the day and linguine  Pesto. Both tasted good. My wife makes a similar pesto sauce. I like extra pesto sauce, and that's what I got as well. Over all good experience, and i plan to revisit when i am back in town."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MV8tNHFBRRAB",
            "text": "Our first time in NYC and we had to come try this place. The atmosphere is exactly what we expected with friendly smiles from the moment we walked in that continued throughout our meal. The waitstaff was very attentive, and we did not have to wait on anything. The food was absolutely delicious and came out quickly after we ordered. Their dessert menu had a large selection and was also very delicious. Would recommend to anyone looking for authentic Italian food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbTRXYnhnRRAB",
            "text": "Food was good. No pizza at this location. We ordered the special, lasagna, shrimp scampi, and ravioli."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOaWNtUUhBEAE",
            "text": "Classic NYC Italian restaurant with okay food. The dishes were not anything special and it is easy to find better variants at cheaper prices. The service was friendly and was not rushed. They do offer a Pre-Theatre Price-Fix menu. Restaurant definitely was a bit dated and could use a spiffy up."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZdE9iRGNBEAE",
            "text": "Great drinks and well-made pasta. The fettuccine was like silky ribbons. Nice ambience and great location just south of Columbus circle. Easy to get to via subway. Great bar area near the entrance where you get natural lighting if you come before sunset."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WelNUaHFjM0JFTm04MkxXaDZiMk5HYzJ0dVJrRRAB",
            "text": "I am so grateful to have found Patsy's. I value so much old-school dining. The best marinara you could find anywhere, better than my own! The staff knows the food well, and the Chef circulates the dining room, personally visiting every table. There is a dessert CART :) I think the blend of consistency, delicious food, and humility are this classics' highlights. A Chef who visits his guests is top-notch. Delicious food with an experience. Thank you so much."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdHQ2cHFnRRAB",
            "text": "Experience 'this has always been there' Italian institution, frequented by notable characters including Sinatra. The veal parmesan was perfectly prepared. Small, full bar. Great service. Intimate setting. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURid29MZzhBRRAB",
            "text": "The pasta was excellent! The fried mozz was okay. The tiramisu was unique and not in a good way. The lady fingers were soggy beyond recognition and none of the flavors stood out well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsOWF2NVNREAE",
            "text": "Me and a friend went for late lunch !! It was spectacular!! We got eggplant for 2 as an appt and chicken parm w tortellini pasta as mains!! Both were perfectly cooked. I got a glass of super Tuscan.I love red wine. For desserts we got chocolate and carrot cake\nService was really good and fast. Bread was good so we asked for another basket. The owner was really nice and helpful. This is a place where they really care about the people. Deff coming back soon"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJaUo1cnlFemN1R2JREAE",
            "text": "Always a great meal, it wouldn't be a New York trip without going to Patsy's.  Thanks, Sal, and crew for another great meal!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aWV2NFVnEAE",
            "text": "Old time authentic Italian food that has been family owned forever.  We had clams casino, stuffed veal chop, combo ravioli platter, ceaser salad.  Everything was outstanding."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoektQMVdBEAE",
            "text": "My veal was great. My friend got a chicken parm and the sauce was unusually sweet, so she didn’t particularly like it. The tiramisu was basically cream with some ladyfinger filling….not the standard tiramisu. Waitstaff and hostess were not particularly friendly…but the owner did walk around and talk to diners to check in which I appreciated. To be honest, the food here was just ok, but nothing special. That combined with the poor service makes this restaurant not worth the hype or money, especially knowing how many other great Italian options are in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyM29PU3lnRRAB",
            "text": "Had lunch at Patsy's during a trip to New York and it was okay. Nothing to brag home about and I also had a hiccup with the establishment that made my experience a bit uneasy. Here are some takeaways:\n\nEnvironment\nPatsy's is a nice space. We went for lunch so it was pretty empty and not a lot of people dining at the time.  The vibe seems to be high end but casual dining. Great for lunch with friends or a date night with a partner. Keep in mind that there is a no hat policy if you do decide to dine here.\n\nService\nAs I mentioned earlier, there is a strict no-hat policy at this restaurant, which I was unaware of before my visit. Due to a medical condition, I find it more comfortable to wear a hat most of the time. When we asked if I could keep my hat on for health reasons, they initially refused and requested proof of my diagnosis. This felt intrusive and made me uncomfortable. Despite my hesitation, I provided them with some documentation, and they eventually allowed me to keep my hat on.\n\nI want to highlight this to inform others about the no-hat policy and the extent to which you might need to go if you have a similar situation. This experience put a damper on my visit, and because of the strict policy and how I was treated, I doubt I will return.\n\nAside from this incident, our server was friendly, attentive and ensured we had everything we needed.The food and drinks were delivered promptly and overall, the service was great.\n\nFood and drinks\nI had the Fettuccine Alfredo and it was okay. I wouldn't order it again however if I were to ever return I would try other things on the menu to see if I would have a better experience.\n\nOverall\nMy experience at Patsy's wasn't great but just remember no hats and you may have a good time. The food was just okay to me but I would give it another shot if they let me in."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOaExuU29RRRAB",
            "text": "Overall, our experience at Patsy's for lunch was delightful. We were extremely satisfied with our choice of restaurant. The food was delicious, and the portions were generous, ensuring that we left feeling satisfied. We were particularly impressed by the personal touch from Chef Sal, who took the time to visit our table and ensure that everything was to our liking. This level of attentiveness added to our overall enjoyment of the dining experience. We would definitely recommend Patsy's to others and look forward to returning in the future."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMXRfcVB3EAE",
            "text": "This is my favourite place to eat in NYC. It's historical, it has atmosphere and above all that... the food is AMAZING! Love, love, love!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPOFAyem5BRRAB",
            "text": "A Famous Italian restaurant featuring heavenly Italian Food focused on a fine dining experience, with staff expertly attending to every meticulous detail to deliver an experience that fits their reputation as world class Italian. Penne alla vodka easily best I've had with a spiciness that compliments perfectly the rich decedent creamy sauce. Calamari best I've had. Breading perfectly seasoned and squid the consistency and texture you love to experience in upscale Italian. Chicken Parmigiana featuring cutlets breaded with a delicious red sauce that fits perfectly. An amazing experience every single step of the way."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdnZpczVRRRAB",
            "text": "Boshco kept us well serviced and entertained with some good humoured banter. The food was fantastic and tasty. Definitely a place to visit for dinner. Bonus fact, Frank Sinatra used to dine here. There is a room named after him with his reserved table (see pics)."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNGViQmNBEAE",
            "text": "It's been over 20 yrs since the last time my wife and I dined here. This time our daughter was able to join us. The quality of the food, the service and the ambience hasn't changed!  I highly recommend Patsy's if you are in NYC looking for an Italian restaurant, this is the place! The owner and chef, Sal Scognamillo stopped by every table to ensure all had a good experience. That is top notch!"
        }
    ],
    "reviews_count": 76
}