{
    "name": "Ocean Prime",
    "place_id": "ChIJE8UCHflYwokRYNnt69kYmrQ",
    "grid": "MN5",
    "address": "123 W 52nd St, New York, NY 10019, USA",
    "rating": 4.6,
    "user_ratings_total": 2502,
    "phone_number": "(212) 956-1404",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWE1rTnRjMDEyVEdKMU5rOVlSMXBwU0dKQmVtYxAB",
            "text": "Your bill will be higher but your satisfaction will too. Though solid, the dishes weren't the best versions we've tried. This spot has good bones, but better people working there. Staff performance was excellent. I can't wait to try more of their creations."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsMVIyNWxSRXRDVm5wZlJGUjVZVGxMVmpkcWFXYxAB",
            "text": "Absolutely incredible! We went here for an evening celebration, and the entire night was amazing. The service was great, and the food was even better than I imagined. Pretty reasonably priced which we were really surprised!!!!!!  The dishes were  full of flavor so we were not disappointed at all. Outstanding service was a plus so I will certainly recommend visiting. Highly recommend the calamari appetizer, any of the lobster, and the scallops with risotto. So many variety's to choose from on the menu ."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZeU1EUlBjV2xJTTNaWE5HaGxhWHBsZDNGeFZFRRAB",
            "text": "10/10 experience. Even though it's somewhat of a chain it was amazing. The service and food are above and beyond. Highly recommend the snapper-all the fish besides the salmon is fresh caught. Our serve Hunter went above and beyond to make my mom's birthday great. Carrot cake is a must!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KbVJGSkRNM0pZUkZocWNGVk5UR3RrYVVrMFJHYxAB",
            "text": "Excellent quality"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205dGFsUkVYM2RMZG1sUk9WTkJYM0JJYm1Zd1gzYxAB",
            "text": "Fantastic restaurant. We went for a special occasion and our waiter, Thi, went above and beyond. While the food was great, the service was exceptional. She was incredibly accommodating for my dietary restrictions (if you're vegan they have delicious vegan sushi and a nice pasta dish) as well as thoughtful. She made sure it was a special night and one we will not forget."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMGJqYzBkV2hrUzNGSExVZ3RSMXBETW05RmVFRRAB",
            "text": "Such a great meal!\nFood, Atmosphere and staff were top notch.\nThanks Tia for a great experience!!\nGonna be a regular stop when in the city."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcnVENWl3RRAB",
            "text": "October 2025 - Actually, this place is a five. Surf and Turf was not what I was expecting. It was played so beautifully.  The halibut with gnocchi was also very good, also much more elegant and healthy than I was expecting.\n\n2023 - Food, service and cocktail list all good. A little too pricey. A little too healthy. Sitting on the terrace was nice because it was walled in with greenery, making you forget you are in midtown. I would give it a 4.5 if possible"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBNFVIbFpXak5sVFVsNFgxZHBVa3RQWjA4dFExRRAB",
            "text": "Visited with a group of five after work, likely during happy hour. We sat on the patio, and our waitress, Tai (hope I’m spelling that correctly), was fantastic.\n\nEverything was excellent — the service, our steaks, the sides, and the overall ambiance. My ribeye was cooked perfectly to order with a great sear and flavor.\n\nThis was my third time at Ocean Prime (once in Las Vegas and twice here), and every visit has been wonderful. This most recent one was by far the best yet. Highly recommend!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CNlRWTTBUbmRsYkU5SExVVkxTWGhNUmpGUlNuYxAB",
            "text": "Enjoyed the food and atmosphere.  Extra attentive considering it was our anniversary.  $$$ but for special occasions."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKVGFFMDRlVzVQWld3dFFVRXlMVFJXTkVkdFlsRRAB",
            "text": "I usually love Ocean Prime and have always had excellent dining experiences there, which is why I decided to book a private room (the Rockefeller Room) for my birthday celebration. Unfortunately, this particular experience was extremely disappointing.\n\nWhen my guests and I arrived, the private room was uncomfortably hot, and to make matters worse, the TV and audio system were not functioning. This meant we were unable to play music, display visuals, or provide any kind of entertainment for the evening. It was a birthday event, so this significantly impacted the atmosphere and overall enjoyment. The manager had no solution to the TV malfunction such as switching us to another room . What made this worse is that none of these issues were disclosed to me prior to paying the deposit or arriving, which I found very unprofessional and misleading.\n\nThe service also fell far below the standard I’ve come to expect from Ocean Prime. The server originally assigned to our group was extremely rude. His attitude and demeanor made both myself and several guests upset, and his responses to basic questions about the menu were rude. It was disappointing to experience this level of service at such a reputable establishment. The situation became so uncomfortable that one of my guests had to request a new waiter from management.\n\nWhile the food itself was consistent with Ocean Prime’s usual quality, the lack of hospitality, poor communication, and technical issues overshadowed the meal completely. For a private event that required an upfront deposit and premium pricing, I expected much better preparation and customer care.\n\nOverall, this was a very disappointing experience that did not reflect the Ocean Prime standard I’m accustomed to. I would not book a private room again, as the service and amenities did not justify the cost or expectation."
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkMFJVZHRMVWRLY1ZsSFJteFNRM1pQZUdWRWEwRRAB",
            "text": "Todo muy delicioso, lugar muy elegante, pero la gente muy amable y agradables, son bilingües."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VlNsSldTMHBQYlZFM05EaFRZVzF0UmpoS1VHYxAB",
            "text": "Went here for a work dinner and it was absolutely fabulous. Had the scallops with the risotto and both were cooked to perfection. And don’t sleep on the bread basket! That was also a hit. Great service and atmosphere as well. Would recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOemFUWkNlV3RSUzBobU5taFhjVWg0VEZKTlMyYxAB",
            "text": "Best Butter Cake in the City"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPaE1qcDh3RRAB",
            "text": "The crabs cakes!!!!! EXCELLENT. The waiter wasn't too good at his job but the food is what I'm rating my review on!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214VFJYSjBXVWxzYldaRlgwRnBNbFJGV1hkUWFsRRAB",
            "text": "Excellent food and service. Would definitely recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205amREVXpXWFpyYWpaeWFETnpibXBxZWtSUlpsRRAB",
            "text": "Fine dining with excellent options for steak, seafood, and sushi."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMlZGZHpVRlU0U1dSelZHUnViV1ZPT0VwRWJtYxAB",
            "text": "Just went for some drinks with friends they did gives us popcorn it was delicious but the drink were excellent. The atmosphere was good. It's kind of expensive"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwZllXa3dORlZaWTBaRmNVNXlTR0ZqV25aZlIwRRAB",
            "text": "I love fine dining and Ocean Prime is currently one of the best restaurants in the city with a big bill that is worth every morsel. The  steak was soft, tender and buttery and the sides were perfection. The cocktails were also a delightful experience. I had a drink served on dry ice and the presentation was like a magic show!"
        },
        {
            "date": "1달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKMmRUSmhRbkJUY0hKb2RUWlpjVmQ2TjBGNlNIYxAB",
            "text": "Serata con molta gente e molto rumore, a parte quello impe cabile"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21salRrdEJNR1l4U0RCRVp6TlhjSG90WjJSRFRtYxAB",
            "text": "Seharsh gib meh big boi moneh so I luv dis place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVFNFRkhOR2RqWkdod1VuTlZWWFk1YUU5WGNFRRAB",
            "text": "The service and food are exceptional! And don't forget the cocktails 😉  took my friend to celebrate her birthday and everyone made her feel special. Our food was served hot and came over perfectly.  I would definitely recommend visiting here for any occasion.…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWFIwMUdOakpQVUc1cE0wYzRZbDlZYVZnNVZYYxAB",
            "text": "We went here for drinks only.  I know feom the past the food is good but didnt give 5 stars since we didnt have any to rate for this visit. The service was excellent, very attentive and friendly.  We sat outside and because it was late, there was a lot of noise from construction, taking garbage out across the street.  Not the restaurants fault.  They have it decorated nice outside and there is some privacy screens to separate the tables from the sidewalk."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWFZEaFlabmhzZEVOalNVZHdSM2xuTWxkRFZIYxAB",
            "text": "I loved the food, reasonable prices, quiet place and excellent service. The waitress Nathalia is a sweetheart. 😘"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4VWJEbFJhVko2ZUdsWU5IWjBPV3hzZEVnMVpWRRAB",
            "text": "Great place! Awesome good and terrific drinks. Service was excellent. We like to done at the bar, wherever we go. Would do it again here, with no hesitation."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxQk9VeEdkMGhSTWpWb2JrMVFTM1p1Tm01V1oyYxAB",
            "text": "Dined here 2 days ago with a friend and had an absolutely incredible experience. I had worried it might be a bit noisy, but while the place was lively, the booths on the sides provided enough privacy and quiet to have a deep conversation. Gordon is a great server. Such a warm personality, he was so attentive, had great suggestions when asked. The food was incredibly delicious. I will definitely be back. Wonderful, thank you Gordon and thank you Ocean Prime!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aZmRuaHpSMUJ2V0dRdGMxVmpYMGxCVlRFM1JsRRAB",
            "text": "I was determined to have Italian food and was literally on my way to a restaurant I was following on my GPS, but when I passed by Ocean Prime, their bar and the vibe immediately caught my attention. I scanned the QR code, saw the menu and decided to walk in. Totally worth it! I was seated, ordered an Old Fashioned, the Smokey, I believe, the presentation was lovely and it was amazing. I ordered the filet mignon with the black truffle butter which was cooked to perfection. I also had half portions of the mashed potato, mac & cheese, and the asparagus. Everything was just top-tier and amazing! I was actually excited that they offered half portion size since it was just me, and I don’t eat large portions. I would highly recommend this place and I would definitely come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CM1dsOTNZWGh4UTJJNU1VdGlNR3N0V0hsQk5sRRAB",
            "text": "I am writing to formally share my recent experience at Ocean Prime, which left me feeling both unwelcome and discriminated against.\n\nMy friend and I had a reservation for 4:15 PM. When we realized we could not make it at that time, we called ahead and specifically asked if we could adjust to 4:45 PM for happy hour. Upon arrival at 5:12 PM, we proceeded to check in at the host stand. Unfortunately, from the moment we arrived, there were about 5 staff members at the hostess desk, and there were particularly two suited employees I assumed to be managers who stared at us without greeting or acknowledgment. This lack of hospitality, paired with their demeanor, made me feel extremely uncomfortable and singled out.\n\nBefore I could even suggest to my friend that we leave, the hostess informed us that there was no happy hour and that it was only available on Fridays. This was confusing and frustrating since we had called beforehand to confirm, and were not informed of this policy.\n\nThe entire interaction made me feel unwelcome and diminished as a guest. I could not help but wonder if the treatment was based on our appearance, my casual attire and shopping bags, or the fact that my friend had just come from work in scrubs. Regardless, no guest should be made to feel uncomfortable or discriminated against in a hospitality setting, especially at a restaurant of Ocean Prime’s caliber.\n\nI am disappointed by the poor service and lack of courtesy. I hope you take this feedback seriously, as experiences like mine greatly impact your brand’s reputation.\n\nI would appreciate a response and clarity on how concerns like mine are addressed within your organization."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwS2FreDNXVTVGWkdwWVEwdEtOV1ZzTmxrNVZWRRAB",
            "text": "Overall good - not excellent as I would hope for the setting and price. Took ages to take food order but then brought out different courses really quickly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0MWRGRndNRnB1WWpSeGIwUk9PRmRtVmpKVFFXYxAB",
            "text": "They were so good to us. Great staff, great service, best food ever."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4eFoxbFZjbTFHZWxFeVNXUXdjRFUzVFRCRFVHYxAB",
            "text": "Everything was amazing. The chef modified everything for my dairy allergy. I couldn't have asked for a better experienced."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVWVrVlZWVmhWUVdSYU5GTTBPRlpNZUc1NU9HYxAB",
            "text": "FOOD US EXCELLENT!!! BEST FILET MIGNON I HAVE EVER HAD!!!  Table service is ok…bar service questionable.\n\nRating for service stems from one thing…Don’t like when server who takes your order rarely shows up again.\n\nAtmosphere good, not exceptional."
        },
        {
            "date": "2달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJNVZrSkdVRFV3Y1d4TFRuTkNSVUo1ZUZkUWFsRRAB",
            "text": "环境很不错，食物也好吃，海鲜寿司和牛肉都不错，海鲜都很新鲜，不过吃到一半容易腻"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4M1ZYSXlSVXh4UjJ0NWVreFhPV2RuVFVkTFdXYxAB",
            "text": "What a place! Great experience at Ocean prime. The restaurant has a vibe. Elegant, sexy, mysterious. It was fun. From the beginning to the end, impeccable service. The bread basket… omg. All of the breads were delicious. We ordered the eggs, truffles and caviar (if I close my eyes I can remember that exactly time. 😅), it was out of this world. Burrata and Caesar salad were perfects! Salmon and filet mignon… pause… PERFECTION! So so well cooked, week seasoned. Filet mignon was melting in my mouth! And now… the carrot cake… THE BEST CARROT CAKE I ate in my life. And I didn’t like carrot cake before because I never tried one that was really good. And the portion size was perfect. Definitely recommend this restaurant. You have my heart. ❤️ thank you for the great experience!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUmFtRTRUMHRqUjFoS2NXdGlUM1p0VVdKNlYxRRAB",
            "text": "Very mediocre house and Caesar salads were followed by truly amazing filet mignon and snapper.  The filet was extraordinarily good and much better than the average NY steakhouse. The red snapper had an amazing crust on it and the sides for both were delicious. They care a lot about their fish and there were several choices which is great for a steak-focused place.  The carrot cake dessert was amazing and even the ice cream was much better than usual. They have an incredible wine list and service was impeccable. Only complaint was lack of a good zero beer. They had an amazing restaurant week deal or it would have been a bit pricey but still worth it. Atmosphere is very dead and boring if but very classy if you want that."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cVJTMW1ibHAzWVZkU1JsSmZNVnBFWVcxa2QwRRAB",
            "text": "The food was very good. I could taste the high quality of the ingredients. That said, I think it had to be better than just good considering the price."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTmJVSmFWRVJVTkUxT2VVSTRaak5wVDI5VVEyYxAB",
            "text": "Everything was great except the fact that the hostess place us sitting at a table facing the opening of the kitchen; it was noisy and waiters are going in a out of that area. Also we made a 5:30pm reservation and there were plenty of open tables and booths in better areas in the restaurant. Wonder why she didn’t give us those tables; I’m wondering if it’s because we were Asian."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOcFZsUXRVVTlXWkRsZlZsUnpZMUIxUjJScVpHYxAB",
            "text": "I wish there was a 6th star I could add for service, because Ocean Prime was truly one of the best dining experiences I have had in NYC (and my second job is to review restaurants just like this  -  to help management improve in areas they may be lacking)\n\nUpon entering the restaurant, one is immediately impressed with the modern, sleek ambiance of the place -  not completely out of line for a place like Del Frisco or Strip house, but the tables are a bit more spread out and it feels equal parts steakhouse and lounge. The hosts are very pleasant and attentive and give the restaurant a positive vibe when first entering\n\nThe next part, may be the best -  as HUNTER (our server) put the Prime into Ocean Prime. I can definitively says, after 5 years of owning restaurants in NYC, and 4 years of reviewing high end restaurants, that Hunter is the BEST server I have ever had the pleasure of working with. For as fancy an establishment as Ocean Prime is, Hunter added a casual, fun but professional aspect to the evening, he was on point with his recommendations and handled one of my guests (who is notorious for substituting anything and everything he orders) with ease and compassion. The one disappointment of the night, even made this place more special in my book, as one of the fish dishes was severely under-cooked, and when my friend showed it to Hunter, he took a good look at it, fully agreed, and then had the instincts to go to my other guest, who had ordered the same dish, to make sure there were no issues with his. 2 minutes later, the manager appeared, and was super apologetic about the incident, and offered us anything (prob free drinks or dessert), but we had enjoyed the evening so much and were so pleased with Hunter, that we politely thanked her and said we did not have an issue.  The restaurant prepared a NEW dish for my guest, and it was cooked perfectly, and we all agreed that the steaks and seafood were among the best we have had in NYC\n\nIn the end, this restaurant is priced appropriately as a high end steakhouse, so be prepared to pay up to $200 per person with a cocktail or 2, but it delivers on all ends and as a one-off treat or for celebrating a special occasion, I could not be any more positive in my recommendation\n\nThank you Hunter and to all the other great staff at Ocean Prime"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5bUxXUnVaemxhTWtaRVZFdHNNRGRNTUhwbVZIYxAB",
            "text": "For a real foodie who eats out all the time this was THE BEST seafood and steak I have ever had. Top tier 💕 the drink was so smooth but yummy. Can’t wait to go back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4SU5EaHdPR3R4WlcwdE9FOXpjR2d6VEVsTWVGRRAB",
            "text": "Ask for Hunter he's the best ... Food was great and the service was fast and very hospitable"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xveFNqZDJUekYzVW5CdE1FTjZTMjFFUW5wNWFHYxAB",
            "text": "I had an amazing dining experience at Ocean Prime, thanks to our exceptional server, Shaikh! From the moment we were seated, he went above and beyond to make us feel welcomed and taken care of. His energy was warm, professional, and genuinely kind — the kind of service that truly elevates your entire evening.\n\nNot only was Shaikh super attentive without ever being overbearing, but he also surprised me with a custom mocktail that was perfect. He really listened to what I liked and created something refreshing and delicious just for me — such a thoughtful touch.\n\nService like this is rare, and Shaikh absolutely deserves recognition. He’s a true asset to the Ocean Prime team. I’ll definitely be back and will be asking for him again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWFUyVjROalJwVjNaSVRqVjFlbmg0UzNwNk5WRRAB",
            "text": "A short walk to the Iridium and great experiences at the Philly location made this an easy decision. Service was stellar and everything about the meal was on point. Remember to ask for the popcorn if seated in the dining area - we forgot until after the nigiri rolls but better late than never."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMmRFTlNUbEJqTmtoWFN6WnhiV2RDU2sxTFdXYxAB",
            "text": "My good friend and I had the PLEASURE of reconnecting and dining here last night. I'm at a loss for words. Delicious, tantalizing, salacious, inviting, a carnival of taste in your mouth, food porn (yes it applies) does not meet the mark. I had succulent Chilean Sea Bass, Tuna Tartar, and Wedge Salad. It was actually a half head of lettuce! I closed my eyes several times and hummed in silence.\nMy friend had the Waygu Steak, Garlic Mashed Potaoes and a Crab Cake the size of 2lb burger. Her steak melted in your mouth (I tasted it). She said it was amazing (my shellfish allergy kept me at bay. ) We rode on a slow boat to food delirium lead by our server GORDON. He was the antithesis of restaurant etiquette service, and decorum. He made this dinner at Ocean one that we will never forget. He introduced us to Roth wine.\nWe will purchase some for our homes.\nGORDON was warm, friendly and kind to us.\nHe made us feel relaxed and at home. I think he should be the basis for a media campaign representing Ocean. His face and his persona will definitely bring food enthusiasts and curious diners in. THANK YOU GORDON for a wonderful experience. We hope to see you again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMmRGSm9lbVkwWDB4WVpHVXhWbVJ0VG5wNFNWRRAB",
            "text": "We held a 20th Bday party here for my niece.\n\nThe service was excellent, as well as the food.\n\nOVERALL: I HIGHLY RECOMMEND THIS RESTAURANT."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SlZXWlFaVmxJZHpCUU1tUnFNR056T0VndFIwRRAB",
            "text": "Just Amazing"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKQ2NHZGFkM3A2T0VreE56SlpVRGRLU0Rad05uYxAB",
            "text": "The atmosphere was beautiful, and the service was outstanding. Shaikh Was my server, and he was so attentive to all my needs. He recommended different meal options, but the teriyaki salmon was superb. The salmon was so tender it melted in your mouth."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WUVYwSTNUMnhCZWxCUU5pMUdUSGN0U0dOdWJHYxAB",
            "text": "Ocean Prime NYC delivers an exceptional dining experience from start to finish. The vibe was absolutely perfect, especially with window seating at night, which added a touch of elegance and energy to the evening.\n\nThe Old Fashioned was expertly crafted, with rich, balanced flavor and a customized OP ice stamp that added a classy, memorable touch. The bread basket alone was phenomenal, warm, fresh, and hard to stop eating.\n\nThe sushi was truly next level, the best grade of fish I’ve had on the East Coast. Fresh, buttery, and beautifully presented. The lobster tails were divine, perfectly cooked, tender, and seasoned to perfection. The Caesar salad was also a standout, with crisp lettuce and dressing that was evenly and thoughtfully distributed.\n\nHighly recommend Ocean Prime if you're in NYC and looking for a fine dining experience that delivers across the board, ambiance, cocktails, food, and service all hit the mark."
        },
        {
            "date": "3달 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rMlZGZzVVRnBrZDNWWVRIUlZOblJKTW5KVVlXYxAB",
            "text": "餐點精緻，服務週到，用餐環境極佳！"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214TU5rNHRVMVJ1WkZWR1NXZHBPRGhxV2pGV1RuYxAB",
            "text": "Todo es excelente y más el AC"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0TmVHOWtaekZxT0ROZlZWRlhWek0zZFdOSFdsRRAB",
            "text": "We came on Monday for my Daughters 16th birthday dinner. It was beyond delicious! My Daughter got the 6 oz filet and I got the Chilean seabass special. My husband is a Chef and I'm used to good food. This exceeded my expectations. I could have cried the meal was so good. The ceaser salad and bread basket was also delicious. This was our 4th time at Ocean Prime and I can't wait to go back. The filet was cooked perfectly (med rare), the mashed potatoes were hot and buttered perfectly and the dessert was delicious!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRFZXOHpjSGxRYkV4T01GWlRVSEV5VEZsR1kzYxAB",
            "text": "Fantastic service amd meal"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NlBHT1JREAE",
            "text": "셀러드가 너무 맛있는곳"
        },
        {
            "date": "11달 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzN2Z5YkVREAE",
            "text": "다양한 해산물 요리를 즐기기 좋고, 스테이크도 맛있는 집"
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNc2Y2dXB3RRAB",
            "text": "스테이크 아주 괜찮은 레스토랑. 롤 종류는 아직 시도 안해봄. 무조건 예약 권장."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURreVozQ2pRRRAB",
            "text": "비싼만큼 맛있습니다 고급스러운 분위기"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJWHJnTXFpd3NqaDFRRRAB",
            "text": "Expensive for sure. Customer service was excellent. The place is decorated beautifully. I ordered the following.\n\nOcean 55: 8/10\nPoint Judith calamari: 10/10 - spicy sauce. The vegetables and sauce compliments so well.\nTeriyaki salmon: 8.5/10 - pretty good and cooked well.\nSautéed mushrooms: 6/10 - not bad at all.\nMac & cheese: 6/10 - my little one didn’t like it at all. It was decent to me."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLcmtvNHpWcXRhcFRnEAE",
            "text": "From the moment I walked in, till the moment I reached the table everything was absolutely amazing. The ambiance, the food , the service, everything was on point. My Server Natalia gave out her best recommendations on drinks and she recommended the Teriyaki Salmon which was absolutely mind-blowing! I tried the creamed spinach & Mashed potatoes and they were both phenomenal.I will be back soon with a lot more people. I am looking forward to coming back soon. Thank you for such a pleasant meal and excellent Hospitality."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQbmFnb09RN2VIUlJBEAE",
            "text": "Amazing.  The food is delicious. I had the lump crab cake to start. The Dijon mustard was a nice touch. Followed by the salmon with sticky rice.  The butter sauce with the teriyaki was exquisite.  Ended the meal with the butter cake and ice cream. Perfect all the way around.  The waiter was attentive.  The bus boy was not friendly,  but i guess he was there to do a job.  I would recommend this place 10/10"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJem9mb0tREAE",
            "text": "Absolutely incredible! We went here for a friend’s birthday, knowing we couldn’t miss good seafood during our trip to NYC. The service was great, and the food was even better, and very reasonably priced (sort of surprised it was as low as it was for the amount of food we got! They had really great serving sizes). We left full and happy. We couldn’t say enough times how good it was. We even got a free dessert for the birthday boy! Which was a lovely added bonus. I’ll definitely be trying to make room for it whenever I visit NYC again in the future! I highly recommend the calamari appetizer, any of the lobster, and the scallops with risotto. If I’d had room for more, I would have gotten sushi as well. Thank you for a wonderful time!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIZ092eFB3EAE",
            "text": "What a lovely experience. Firstly the staff was amazing the whole evening.  We was there early and they help us find the best table. Everything was amazing and I was there to celebrate a birthday for my boyfriend.  They added confetti on the table and allow him to choose a dessert for free. The food was so good and fresh. The pretzel bread is a must try with the whipped butter. The whole night was fantastic and they were playing good music. Thank you again and will be returning soon💗"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bnRxdlJBEAE",
            "text": "Wow! Had an incredible experience at Ocean Prime during Happy Hour (4:44PM on Dec 13th,  #100023)! Just leaving the receipt information because our server was amazing! She was so personable and offered a lot of advice with the menu - delightful! Highly recommend getting the oysters and chef special sushi roll - very fresh seafood and amazing value. Love the ambiance of sitting in a booth at the bar. Perfect for a quick date or a friends and family gathering - will be back! Bravo!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReDl1d0xREAE",
            "text": "We celebrated my birthday at Ocean Prime last week. My date was running late and the place was packed. I was getting anxious because I didn’t want to loose the table, but the staff were exceptionally gracious, kind, and patient. They seated me almost immediately and brought over sparkling water and a bread basket while I waited. When my date arrived, the staff were seamlessly wonderful and generous. We were told there was no rush and to take our time. We had the New England oysters and the shrimp cocktail as our 1st course - excellent! We had the scallops and the grouper - so delicious and perfectly cooked. We always had fresh, cold still and sparkling water by our side. I had a “nogroni,” the non-alcoholic version of a Negroni, it tasted just like the real deal. I am usually disappointed by mocktails. Not this time. They even gave me a complimentary piece of cake for my bday to take home bc we were so full! Highly recommend Ocean Prime!! Thank you for a wonderful experience!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNDlxeDVnRRAB",
            "text": "The host was pleasant upon arrival. I was seated right away with options given. The food came out in a moderate time frame and each course was delicious 😋  I love the Mocktail option and that they're still served like a cocktail with the bells and whistles. Little things like this matter a lot. Great bar 🍸 We loved our server as well. She was a delight."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJak1xTEhREAE",
            "text": "Really great experience here. Staff were professional and helpful in making selections and giving details of menu choices.  Service was flawless. Food was excellent.  Enjoyed sushi and crab cocktail as appetizers and scallops, haddock and filet as main courses. We were all very pleased and enjoyed our selections immensely.  The au gratin potatoes with jalapeño and brussel sprouts were very good sides. Definitely looking forward to another meal there."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcWNhN0pnEAE",
            "text": "In a modern and sophisticated setting you can enjoy great seafood as well as well prepared steaks, along with delicious sides such as creamed bacon spinach, Brussels sprouts and Black Truffle Mac and Cheese. Service is friendly and professional. An interesting experience!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2di1PNDV3RRAB",
            "text": "I went to Ocean Prime with my husband and friends for my birthday, and we had an awesome time. The ambiance was warm, sophicated, and romantic. The staff was courteous and kind. We enjoyed the food and the drinks were so delicious. I loved the drinks so much got more than one. Overall, it was an awesome experience, and I will definitely be going back next year."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMk9uRW93RRAB",
            "text": "I've been a couple times and the food is good and consistent for a chain. We tried the restaurant week menu and everything was delicious. I loved my blacked fish which was paired perfectly with the corn puree. There was plenty of food and even had to take my dessert home because I was full. Service was nice and attentive."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vMFpVb3hWRGxJTW1GbFVYbE9TRVJVU2s4MGJWRRAB",
            "text": "Great example of you get what you pay for here - yes it’s pricey but the food, drinks and service are first class. In particular I have to mention Roisin behind the bar who took great care of everyone all night.\n\nIt’s a real throwback to the steakhouses of old and the personal service you get in them - it absolutely still exists here which is great to see."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SWlowRk9SWEpLYlhWWU1FcFRlbUZNZHpGV1pVRRAB",
            "text": "Ocean Prime is an upscale steakhouse-style chain restaurant. As a vegetarian, these steak/seafood spots usually leave me disappointed - not the case here!\nTo drink, you must start with the Berries and Bubbles, which is as delicious as it is beautiful.\nTo eat, there are plenty of options for everyone. My favorite item was surprisingly the Veggie Roll - unexpected, because I don’t usually like asparagus. The Brussels Sprouts, Truffle Mac, and Smoked Gouda Tater Tots are must-order sides. I also tried the Goat Cheese Ravioli (appetizer) and this was the only item that was a tad underwhelming.\nDon’t skip dessert: the Carrot Cake, Butter Cake, and Peanut Butter Pie are delish. Honestly on the of best carrot cakes I’ve had!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwOWNXUkVnEAE",
            "text": "Gordon was a fabulous waiter. Went above and beyond to make sure our family was happy and able to share our food! Super kind and funny. Would love to get seated with him again. Made our experience so fun for my birthday dinner."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdGRyQjJBRRAB",
            "text": "Had such a wonderful night at Ocean Prime during restaurant week.  Our server Tai was excellent, approachable, friendly, and let us take our time checking out the menu, finishing our wines before dessert, and even after we finished paying. We also got a very nice couples table that was secluded and away from the rest that we got to have our own quiet time. The music playing brought us back to year 2k.  The French onion soup and OP signature salad were both very flavorful and delicious, and was a perfect size, I shall not forget about the bread for the table- it was so moist and honestly regret devouring too much of it before the main dish arrived.  The snapper was cooked to perfection with a corn cream sauce that paired so well with the soft snapper. The steak was a little dry (and so I suggested to stick with the fish vs meat) but enjoyable.  Lastly the ten layer carrot cake was beautifully decorated and perfect way to end the night.  Highly recommend you come at least once."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncW9YMHRnRRAB",
            "text": "Ask for Shaikh!! My wife and I came to celebrate an early Valentine’s Day and had the best time all thanks to him! Not only was the food delicious but Shaikh’s excellent hospitality made our experience that much better! He paid close attention to our food allergies and gave amazing recommendations as well! You can tell he loves what he does! 10/10 would come back here and will be requesting Shaikh moving forward!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poVVZYb3paakEzVkZkMWFXSmxiMHBUYVZOUWVtYxAB",
            "text": "Sushi prime roll and salad was so good we enjoyed our entrées but forgot to take photos. I highly recommend Ocean prime if you are in The New York area looking to have dinner"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNFAtRVBnEAE",
            "text": "One of the best dining experiences we have had. Salmon and sushi was amazing. Oysters were well appointed, and Melina had great wine pairing suggestions."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTGFqaFRTRmR3WmtwRU1EQTJkRlJGVTFwalVWRRAB",
            "text": "The seafood tower shrimp was frozen at least. I think the crab and lobster too, but not too sure. We ordered two Chilean sea bass but they gave us the striped bass which they said was their “special” fish of the day. It was probably some old fish because you can taste it was old and it was overcooked. Super dry. Steak was cooked fine. Same with lamb chops and scallops.\n\nI think what was annoying was that the waiter Matthew never really came back to check on us after getting our orders. We had to call him back. Also someone at the table was finishing their wine quite quickly, but he never came around to ask if we wanted another bottle or help out.\n\nAlso we were mentioning to him that we did order the sea bass but the striped bass was brought out. He didn’t even try to address the issue as the first moment he had to leave he did which was someone placing a beer order.\n\nI don’t recall Matthew asking us how the food was because we would’ve promptly told him the week old striped bass was overcooked. There’s a reason we didn’t finish it, to the surprise of the waitress when she lifted the plate.\n\nNormally this isn’t egregious enough for a 1 star, but I have to due to the price. In addition, I was paying and taking good family friends who expected a lot , and I was soundly disappointment in both the food and service.\n\nNow normally, I’d bring this up at the restaurant. However, my family friends had just gotten off a 15hr flight from South Africa. In no mood to fight or argue."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEXzQyNWlRRRAB",
            "text": "Had a great time with my coworkers.\nServers are friendly and accommodating.\n\nI’d love to go back here again.\n\nHas one many too drinks because the cocktail was delicious!\nCalamari was also good and enjoyed the peanut butter desert.\nThe steak was okay.\n\nBut, overall it was a great place to mingle eat and drink!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2OE1Ub19RRRAB",
            "text": "I was in NYC for my birthday and my man and I unexpectedly ended up here at Ocean Prime on my birthday. We arrived and was greeted to the best atmosphere. It was so elegant and nice. The bathrooms were even fabulous. They put Birthday confetti on the table for me and that made me feel so special!  Peter was our waiter. He was the best! We had the best service here out of every other place that we went to on our trip. The lobster linguini was absolutely delicious, and my man had the red snapper that was exceptional too. We ordered sautéed mushrooms as a side to share. The recommended drink was really great too!  At the end of dinner, Peter surprised me with a complimentary piece of butter cake that was so delicious! It had a birthday candle lit, happy birthday in chocolate, and it tasted so scrumptious!. I truly enjoyed my experience here! I can’t stop thinking about this place. I’m definitely coming back again on my next visit!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRcWVPNG1RRRAB",
            "text": "Ocean Prime is by far one of my favourite steakhouses, so I often try to make a trip to the US around my birthday to eat there. What I love about Ocean Prime is that you can expect the exact same service and for the food to taste the same regardless of what state you are in! I highly recommend it to anyone who has never tried! Specifically the Strip with the Maytag blue cheese crust!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzck16cXBRRRAB",
            "text": "Absolutely amazing food and service! The outdoor patio is gorgeous and very romantic. We had the waygu filet minion, NY strip, asparagus with hollandaise, bacon creamed spinach, and the french onion soup. Everything was exceptional!! The espresso martini is a must if you like coffee. It's a treat for your mouth 😋🤤"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcy16QkN3EAE",
            "text": "Event perspective\n\nI host an event here every year and they always do such a nice job. we have it in the front enclosed patio area. They have space heaters and I actually got warm, so temp isn't an issue! They helped me arrange the space how I needed it for the event. Food was all delicious and displayed nicely and they walked around a few times with a red and white wine to top peoples glasses off. They checked in with me a few times throughout the event to make sure all was well. Will continue to go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkOUx6ejVRRRAB",
            "text": "Always a great experience here, whether its with friends, family or a business meal! Everything is top notch! Food, service, ambiance and vibe! Besfort is a very kind and welcoming GM! There are 100's of great restaurants/steakhouses in the Midtown Theater District. OP is in my Top 5! I highly recommend a visit while in this part of the City!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNleHR6UUVREAE",
            "text": "I’m so glad I chose This place to celebrate my husband’s birthday. The place is super chic , the food is beyond amazing and I can’t stop bragging about the service. I loved the fact that our waitress sprinkled some birthday glitters on the table to set the mood.\nThe food was cooked to perfection. Very yummy and juicy . For dessert we had the chocolate cake which was just wow….and it was on the house .\nThank you so much for our PRIME celebration.\nDefinitely recommend."
        }
    ],
    "reviews_count": 81
}