{
    "name": "VALERIE",
    "place_id": "ChIJSwCKq09ZwokRi8XLm06owuQ",
    "grid": "MN5",
    "address": "45 W 45th St, New York, NY 10036, USA",
    "rating": 4.4,
    "user_ratings_total": 2065,
    "phone_number": "(212) 302-4545",
    "reviews": [
        {
            "date": "31분 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wYWNFVkhUVVYwV1ZCVmN6WXpXRlZwWlc1ZllsRRAB",
            "text": "Get the roasted half-chicken. It's very moist and smoky and roasted really well. The accoutrements around the chicken help to contrast with the beautiful meat.\n\nAlso get the shrimp bao buns. The contrast between the shrimp and the bao really makes the dish.\n\nThe roasted wild mushrooms were ok, probably not for mushrooms fans.\n\nMake sure to get the tart dessert with ice cream.\n\nThe strozzapreti had a lot of good herbiness and thickness, highly recommend for vegetarians."
        },
        {
            "date": "3시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paM1dtVmFUbGxpU2s1eVRrWXlhMFpsY0VaRGVrRRAB",
            "text": "Our favorite gin bar in NYC. We come here every time we make our way to the city. If you’re a fan of gin cocktails, this is your place!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sa1dXbzBiRmRsTkhOWU0ydGtZM0JPYzJWalRYYxAB",
            "text": "What’s wrong with that doorman at the entrance? He checked my ID, then still had to ask how old I was — even though my age is clearly written on it and I’m already over 21. Why would he question me like that after seeing my ID? Was he implying I’m underage or something? His attitude was honestly disgusting. It felt disrespectful and inappropriate."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnelFsSkxSV040ZUhBeFJYUllRblF6TVZGT2RFRRAB",
            "text": "nice place, very pleasant service, good food, unexpectedly generous portions, loved deserts! Definitely wil go again."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwR2RqbHdMWFZOYm1WWmRFTkRUek40WmxSdUxYYxAB",
            "text": "Honestly great service, cheap happy hour with good drinks and food. The wait staff service was excellent."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQ1NIbERiWEk1V1hCNFpYWjZTMU5LVkVwMFgwRRAB",
            "text": "Excellent cocktails! Nice looking bar!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMFpFeEhWM1ZVVFY5UmNqbHpMVUpPY1ZwSWMyYxAB",
            "text": "Amazing Speakeasy vibe with great food and cocktails.\n\nShared the Baos, Roasted wold mushrooms, Truffle Fries, and the Crab Cake (breaded and fried not molded like I’ve seen in Steakhouses) and everything was perfect.\n\nMy Freezer Door Martini was huge and yet the perfect size, salty and oily. Pretty strong too! My wife had a French 75 variation that I can’t remember but she loved it.\n\nDon’t even have any food pics because it was so good.\n\nHighly recommend."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FMVF5MURjbkZmU1ROdVkycHRiMVowWlRod2IwRRAB",
            "text": "I walked into Valerie for date night with my girlfriend , as we sat on the bar this Bartender by the name “ Mareo “ made some great recommendations with food and drinks , don’t even get me started with his knowledge of spirits and cocktails ! Definitely would return for him ! He made the experience worth it :)"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kweVgzWXlTbnA0Y214aFkwTkdhVVJ6WDJKNWMyYxAB",
            "text": "Valerie is overwhelmingly positive, highlighting fantastic drinks, warm and attentive service from friendly staff, and a great atmosphere. Let’s not forget Mario the bartender is one of one at what he does."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTlIzTmxOMVZzTlRKRVpsWXdPRXB4WTJzME5WRRAB",
            "text": "Was walking by after work and something about the entrance just caught my attention, decided to hop in and was pleasantly surprised by how great of an experience I ended up having. Sat at the bar and got to enjoy several of the personalities behind it, Mario was kind enough to give me a free course on the different styles of gin they carry, made some great recommendations on the cocktail selections like the getaway and Daydreams in Between making me a nice Ramos Ginn Fizz 😂 paired with those bao buns and crab cake it was an excellent experience. Must have gotten there early because by the time I left, the place was jammed. Great overall bar experience that exceeded my expectations, dope vibes tucked away just off time square and a knowledgeable staff. 10/10 Highly recommended, definitely coming back"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUVl6aHZTR2RmT0ZoSlYyOXJMVUZCZDNGWk5tYxAB",
            "text": "The cocktails are top-notch, and the service is truly exceptional. Huge shoutout to Mario behind the bar, a true master of his craft. His attention to detail, creativity, and warm personality make every visit feel special. You can tell he genuinely cares about the experience he's creating. Highly recommend this place!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kc2REWnZTWHAyZWtGUlIzQnNkVlJ0UWpaRVprRRAB",
            "text": "Kenia was amazing!  She was extremely helpful, intelligent, kind, and educational in suggesting the best food and cocktail options at Valerie’s Restaurant. The city view is stunning and the food and service is even better. Thank you, Kenia."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RNVZVSjJUV0ZpZDBKNU16SlBPQzFwWjAxaGJGRRAB",
            "text": "The service at Valerie was outstanding last night, thanks to the bartender, Mario. He was not only highly knowledgeable and professional but also very helpful, making our evening truly enjoyable."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkTVMyTjJOMGRMUlU1NWVEQkpOR2xmVFRsS1NYYxAB",
            "text": "I wanted to give a shout-out to Mario, the bartender at Valerie. His extensive knowledge of the drinks was impressive, and he provided exceptional, professional service all night. We had a great time thanks to him!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MU1tcGpNMHBVTFhOU1oyNW5Na1ZqZFRkUVZtYxAB",
            "text": "I Decided To Come Visit This Restaurant/Bar Valerie Because It Was A Friends Recommendation And He Wasnt Wrong When He Told Me This Place Is Nice And Super Friendly. Im Not Sure If It Was A Manager Or Not But His Name Was Brendan He Was So Kind And Very Helpful With Every Question I Had And Overall Delivered Great Service And Showed Kindness with amazing guest connection skills he got to know me and tried to understand my likes and dislikes to help me with my food ordering. i really do recommend this place to dinner alone or with a group the food was amazing i devoured this plate left no crumbs…can easily say that this is now my favorite number one place."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taMlozQlRiVmR6YWxOMFdHUkNOMTlIV0dsQlVFRRAB",
            "text": "Great atmosphere for lunch. The pollinator vesper was perfectly made. Smash burger is very tasty."
        },
        {
            "date": "3주 전",
            "language": "pl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rNE5taHFia00wYm1WTWJWOWFNV2RHTkVWTU1WRRAB",
            "text": "Fajny klimat, sprawna obsługa, dobre drinki."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbVlsTmhSR05rWXpSRFRWQXlTUzFKUkRoNVMwRRAB",
            "text": "The gorgeous atmosphere of this place is what drew me in the beginning, but the service is what will bring me back. Our server, Lucy, was everything you could want in a bartender, attentive, knowledgeable, but also fun personality. Will be back!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsNlVsZG1NMnBPVWxWbU1sVkJSMjV0YWs1VlFuYxAB",
            "text": "Really great Service, we were seated at the bar since there were no placed available but the bar tender was really helpful and served us with a lot of drinks.\n\nThe only thing is that the non-alcoholic drinks were almost as expensive as the ones with and I don't think that's appropriate."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTmRrVlRUVUZoVmtsQ01UQm9kR2xhYVhsa1JFRRAB",
            "text": "great midtown spot for drinks & vibes. lucy the bartender is the best!"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WeldWWlVPRzlTWm5WM2FISjNiMWxYWkVsQmFYYxAB",
            "text": "Dimos de casualidad con este local un poco buscando algún sitio menos frecuentado por turistas y un poco hartos de sentirnos como hormigas yendo a los mismos sitios. Volvería sin dudarlo y lo recomendaré siempre al 100%. Un local con ambiente para tomarte algo o cenar. El personal de 10, súper atentos y amables. Tuvimos la suerte de que nos atendiese Juan, un chico colombiano con el que hablamos un ratito y nos recomendó a la perfección. No tardaron nada en sacarnos la comida. Muy buen ambiente con muchísima gente local, cosa que nos gustó mucho. Un sitio cuidado y bonito. Buenas cantidades por plato y precio ajustado a New York"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvME9IUlVaelZIZWpGcGQzWllaRTlyVWs5dmRXYxAB",
            "text": "Great place before a show!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201UVNqSTBUV0pLZG14Qk5FWnhjakkwUjNrd1RHYxAB",
            "text": "Love lucy💗she is the reason that I came to this bar 💕💕"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paS1RIZG5iR2xPU25acVJubGhObGxuVnpONExVRRAB",
            "text": "Came in for Negroni Week and Lucy made me her ‘La Bella Vita’ so good! amazing vibe, and she’s just super fun to talk to. Definitely coming back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FeGQxVmFiSEU1T0dOblJFWllTRVJoYkV0ZmNWRRAB",
            "text": "Pretty cool cocktail bar in midtown with an extensive list of cocktails and some great bites to go with. The interior was very nice."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWk1HOTBUMHRTVjFKWWQyMXVSMkpLZEdGRU0xRRAB",
            "text": "We used their back room for a small wedding reception  The food was amazing. The cocktails were equally as impressive."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0MmJVRTJlVUpIVGt4elJGWmpVbE5SYjBwNVNuYxAB",
            "text": "Valerie is always a great time!\nBrendan the GM is always there and he is  super attentive!\nJay the bartender is the best! Ask him to surprise you with any kind of spirit and he NEVER disappoints.....\n\nTheir espresso martini is the best in the city!!!\n\nThey also have Lolita right next door and Madame  George (speakeasy) downstairs .\nAll phenomenal......"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wb1RUZFRSME5JYVdoRmJsSkpiRjlMZUhSWldGRRAB",
            "text": "I had such a great time at Valerie Bar! The vibe is classy yet relaxed, perfect for both date night and catching up with friends. Their cocktails are well-balanced and beautifully presented, and the staff is attentive without being intrusive. The decor and music create a warm, vintage New York atmosphere. I’ll definitely come back for another evening here soon! 🍸✨"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paTFQwWXpTVXhSYVdWUE9GVnVkV1ZhY0d0dVRWRRAB",
            "text": "I stopped by Valerie in Times Square without much expectation, just to enjoy their happy hour while waiting to meet my friends and I was pleasantly surprised! The first impression was amazing: the vibe is elegant yet cozy, and I instantly loved it. The service was great, and I chose to sit at the bar, which is huge and beautiful. I can imagine how lively it gets at night! The cocktail menu has lots of great options, and we ordered a few happy hour drinks, some frozen cocktails, and small tapas everything tasted great. I’ll definitely come back next time to try a full meal here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCSWJHdDBUREZPZFdseGFUTjFhVGx6VW01d2JtYxAB",
            "text": "Went to Valerie for a birthday celebration with my partner. The service was outstanding, they even brought us a birthday desert with a candle. Food was delicious and the cocktail list was phenomenal. Staff is super knowledgeable we left with a feeling that we spend our evening in Michelin star restaurant.\nSpecial shout out to manager Brendan for giving us a tour in their speakeasy Madame George.\nWill definitely come back!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GbldsRkhUSFUzVkd4d1ZtUTNRVVZrTldKRWRHYxAB",
            "text": "Went in with a group of coworkers while on a work trip, and unfortunately the bartender was extremely rude. When one of us asked for a White Russian, he dismissively told us to “read the menu” since it wasn’t listed. We then asked if he could make a simple vodka soda, and he smirked before saying, “Obviously we’re a bar” even though that also wasn’t listed on the menu. Because of his hostility, we only stayed for one round. Super disappointing & he missed out on what could’ve been an easy, generous tab and tip from a well behaved group of ppl."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWWFWOXBhV2hrYzJNMlJrRmFaMWs0UlVoNGEyYxAB",
            "text": "Vlad  the Bartender literally made my experience at the Valeri an AMAZING one ! Not only did he help me create a drink I would love he took the time to figure out my favorite type of drink and delivered perfection 💛 also order the Crab cake it delicious 🤤 will absolutely come back to see the bar staff again !!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWeGVubHZVSGx3YVY5b2EyaEVNV1JOV1d0SE5HYxAB",
            "text": "Great drinks and happy hour. $1 oysters"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWk1XTlpSWHA0VlY5VVptdDRlSEUyYUZwV2JuYxAB",
            "text": "If you’re looking for a good martini this is a great spot, they knew how to make all of the lesser know variations."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJMGIyZHBTazB4Y21WUFlrTTRibFpWYmxScWVtYxAB",
            "text": "Very nice decor. Drinks are all unique and strong. Food is very good too."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWbVkxOTJkVUpLUm5ZNFJFRlNNMHgwYzFWdmFHYxAB",
            "text": "I really enjoyed the atmosphere and the interior of this bar. The staff were very polite and attentive, working quickly so we never had to wait long. And of course, the menu was amazing — everything was delicious!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205bFNUTnRXR05HZWtGUFNqZHdZa3MyVGpOcmEwRRAB",
            "text": "I had 2 delicious drinks, but both were a bit too sweet. Some of the happy hour oysters were too small. otherwise its a nice place and the service was welcoming."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvMWFETkZkekZoZEZORkxYbFZSMHhSUm5WVGJYYxAB",
            "text": "Had an amazing time here. Bartenders were surely knowledgeable with the spirits and had amazing recommendations. I had 2 signature cocktails and was able to try a classic whiskey sour. All the drinks were amazing, perfectly made."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSVFXZDFSM1p4YVVaRVZGOTFOMGhpYW1kQk4xRRAB",
            "text": "A really scammy place where they are happy to slap on all sorts of junk fees and charges to really secretly inflate the bill. Look closely at the menu and you'll see what I mean. On top of all that, they expect a tip on top of the junk fees. Don't waste your time here. Super expensive and I do not appreciate being nickel and dimed."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjemJqSnZZV3hOTTFGYVV6UkZSVlZTVlZGdmRHYxAB",
            "text": "Great atmosphere and beverage selection. Pizza is a great app."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201dGJHZDBPRlZ4WlVObU9Xd3plVlF5U0VSMFVVRRAB",
            "text": "This was a fantastic place with a fantastic staff! Our server was Chris and he was marvelous! We had a birthday party and he took excellent care of us, going above and beyond. The entire staff made this such a memorable experience! 💛"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWFVEUnpaVGhKWDFVNVpWaHJSMFpOUTB4NFRsRRAB",
            "text": "Probably one of the best tuna tartares. Definitely going to the top of my list!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKeVQyVlVXSGR4U1daRFFtODFSV0pMVjA1VWJuYxAB",
            "text": "Excellent service, and salad with grilled salmon was perfect for lunch... Place is cozy and classy."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkMk1tOVdaMEZUWkd4elZVWXhSRGxOVkUwdGVFRRAB",
            "text": "Valerie is a stylish Midtown gem with a vibrant, art deco-inspired atmosphere that feels both upscale and welcoming. The cocktail menu is extensive and creative—especially the gin & tonic (or my fav is the gin gimlet), which was nicely garnished. The food is interesting: I have heard that the pork belly and black truffle pasta are very good, however i did not eat there. Service was relatively attentive and friendly, even during busy hours. Great happy hour deals and a lively ambiance make this a perfect spot for a night out with friends or casual Happy hour. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vMFRXbDJVek10TW01TVNrUkhSeTFsYm5wV1EyYxAB",
            "text": "Vibe is cool, service not so much. Took forever to place first drink order at the bar, then was ignored the rest of the evening.  Our first order of drinks were delicious and we were looking forward to trying more. But after about 30 minutes of trying to get the bartenders attention,  and him taking the orders of the patrons right next to us, we gave up."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210a2NsQkZha1ZsY0dFeldXMUVabFEyUkZwR2NsRRAB",
            "text": "First time coming here, was surprised by my friend because i would always talk about it. It was a great restaurant and loved the atmosphere and vibe. Would definitely come back with my girls. And I love...love the name. 🙂"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4SlkzZGxSazF5Y2xOalpEQmxWeTF3UTBOZk9YYxAB",
            "text": "Food and staff were great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WQ1YyczVXVk14V1dwak5tZHJNblZ0VGxjeFIzYxAB",
            "text": "Drinks were decent but not overly special. Service was decent but we had to ask for our orders a number of times. I liked the bar vibe but it was really freaking cold in the seating area in the back. I could see other patrons trying to cover up.\n\nI think it’s worth the visit if you’re in the area? Sure. It’s always bustling and if it’s full you can go to the Madame George next door (which you should visit anyway if you’re there!). Would I\ngo out of my way to visit again? Probably not."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201S1JFMWhSa3RxUWtOc1VVZGpjbE00TkhwaFNIYxAB",
            "text": "Valerie is a great spot for after-work drinks — nice atmosphere and perfect for an after-office hangout."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWFZ6UlJZVlZVZVc5R01UaEtTbFZhTm5wclFtYxAB",
            "text": "Perfect date night / girls night. Came on a Wednesday and the vibes were 👌\nOctopus appetizer is so refreshing and yum.\nGreat large menu and kitchen was open late."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlNzdHWG9RRRAB",
            "text": "I gotta say this might not be a fair review because I visited only one time and all I had here was just one cocktail, no foods at all.\n\nBut the gin and tonic was really dissappointing because the taste was bland rather than refreshing.\n\nAnd the place was way too loud so it was very difficult to have some conversation. Such loud noise was something I really wanted to avoid so I just picked wrong place. Most likely I won’t revisit as the first impression was not positive.\n\n진앤토닉은 실망스러웠고 대화를 나누기엔 너무 시끄러워서.. 어쩌다 일행이 가자! 하는걸 거부하지는 않겠지만 굳이 제가 일부러 다시 가고 싶다는 생각을 할껏 같지는 않아요."
        },
        {
            "date": "2달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4aGVrRXlSRGhpVEZkRGFGQlNSWFY2WmtwUGQzYxAB",
            "text": "좋은곳이었아..ㅋㅋ"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTVRUaEdaa2xMU21oYVZ6UklaR051WDFkTlpGRRAB",
            "text": "The most attentive staff for such a popular bar. This is a popular Gin bar that I enjoyed. Their delicious gin cocktails made me add this spirit to my collection. I’m more of a vodka and tequila. Now I’m adding gin lol. The bar is beautifully designed with the upscale, modern, and relaxing vibe. The wine, cocktail menu is simple but they’ll make whatever you ask them. All the staff were super friendly, and knowledgeable of their products. Loved the music they playing on the sound system. I enjoyed my drink even more. I seriously don’t have anything negative to say. I will be returning when we’re back in NYC."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJZlM1YmJCcUtuOWV3EAE",
            "text": "Had brunch this past Sunday with my friends for my bridal brunch and I was blown away by how great the food was, how attentive the staff was and how absolutely gorgeous this restaurant is!! Ethan was our server and he was serving drinks , food and a great personality!!! He was seriously adorable He even offered to take a bunch of photos for us, suggested good photo ops and great dessert options. and was overall such a great vibe.  He really made our dining experience spectacular. We will definitely be coming back.  I had the shrimp and grits which was excellent, buttery and shrimp cooked to perfection. My friends tried the omelettes and pork belle egg Benedict which were also delicious. (Photo top left is Greek omelette, top right if pork belly egg Benedict, bottom left is salmon belly, bottom right is shrimp and grits) DEFINITELY COME HERE."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbGEweFFTMnRZTkROMlltMVFTREZtUkUxUlNuYxAB",
            "text": "Undeniable Gatsby vibe but not over the top. Good recommendations. The cocktail program could stand alone successfully. Great execution on culinary menu as well. Pause for the veggies."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN1ozalJnEAE",
            "text": "We had the perfect girls’ night at Valerie before going to see Gatsby on Broadway, and it couldn’t have been a better choice. The vintage, art deco vibe with velvet touches and soft lighting made it feel like we had already stepped into the world of Gatsby.\n\nWe started with some cocktails, their cocktail menu is amazing!!!  And then shared the crab cake, grilled octopus, and short ribs. Every dish was full of bold, delicious flavors, beautifully presented, and so satisfying. Honestly, it was some of the best food I’ve had in New York.\n\nThe service was friendly and attentive without being rushed, and the whole atmosphere made it the perfect spot to kick off a special night. I would definitely recommend Valerie for a stylish and relaxed dinner before a show, or just a fun night out in the city!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVWNtbHVlazF4TTA1WlZWbDVWSEJ0YVhOaVdYYxAB",
            "text": "A Truly Unforgettable Dining Experience at Valerie 👏🏻 ! The food was, in a word, spectacular. I had the spring risotto, and every bite was a masterpiece of flavor and texture. My partner's New York steak and fries was equally impressive. As for deserts do yourself a favor and order the warm vanilla ice cream with pistachios and fig shortbread  !\nAlso, I want to give a huge shout-out to our server Victoria. She was an absolute delight ! She was attentive throughout the entire meal, anticipating our needs before we even had to ask, she recommended to pair the risotto with some grilled salmon and elevated the entire dish 🔥. It's rare to find service that is both so professional and so genuinely friendly.\nVictoria’s excellent service, combined with the phenomenal food and beautiful setting, made our dinner an experience we will cherish for a long time. We've already decided that Valerie will be our new go-to spot for special occasions. Thank you, Victoria, for making our night so memorable !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMVNYQXhkRXRhWmpFd2QyUkRMVXhZWWt3M1ptYxAB",
            "text": "Valerie is a true gem in the heart of Midtown Manhattan. From the moment you step inside, the atmosphere strikes a perfect balance between upscale and approachable. The Art Deco-inspired interior is both stylish and inviting, making it a great spot for anything from after-work drinks to a date night or weekend brunch.\n\nThe cocktails are exceptional—creative, beautifully presented, and crafted with top-shelf ingredients. Whether you’re into classics or want to try something unique, the bar staff knows their stuff. The food menu also impresses, with dishes that are thoughtfully prepared and surprisingly refined for a bar setting. The truffle fries and short rib sliders were standouts.\n\nWhat really sets Valerie apart, though, is the service. The staff is consistently attentive, professional, and warm without being overbearing. It’s clear they care about the guest experience.\n\nIf you’re looking for a stylish but unpretentious spot with great food, drinks, and ambiance in NYC, Valerie is absolutely worth a visit."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMFRtOWpVSHB5VVdZNE1XdGhhMjVQV21WQ05tYxAB",
            "text": "Popped in for jazz brunch while in town for the US open. The band was incredible, the service was amazing, and the gin & tonic was best in class.\nIt did not disappoint!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLekRncmZmLTVqSVVBEAE",
            "text": "Came for happy hour.  Left quite happy.  Had a few rounds of the gin and tonic which was delicious w fresh fruit. Muy a la espanola as well as a few rounds of oysters. All were really good.  The space is very cute as well. I would sit at the bar for sure.  The main entryway is super cute and chic."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNk92emdBRRAB",
            "text": "I’ve wanted to come here forever it did NOT dissapoint. ETHAN was more than helpful w my drink decisions so nice & the food was PERFECT AMAZING DELICIOUS. It’s beautiful perfect table . I had a reservation for 3 . Was 20 min late called & no problem !!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveXVDSEx3EAE",
            "text": "Very tasty food and lovely vibes.\nNew york strip steak was very good portion and the meat was so tender. Also the French seafood stew (KING SALMON BOUILLABAISSE) was absolute gem.\n\nThe wine is quite expensive compared to quality (1 pinot noir bottle 60 dollars) but overall it's recommended if you want to have a cute date night."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ac1gxSjZVR1pJTWxCTE9YTlRka1ZMWm1KQ1pFRRAB",
            "text": "I loved this place! I was visiting from out of town and met up here with an old friend who lives in town; he said this is one of his fav spots!! We each got two drinks and our waitress was very communicative about drinks; I ordered a kiwi G&T and on my second one, they’d ran out of the normal tonic they use and wanted to make sure I was okay with that. I appreciated her checking on a small detail like that!\n\nWe also ordered truffle fries (the portion was huge!!) and a flatbread pizza"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbHV6MTJBRRAB",
            "text": "Classic and beautiful decor. We arrived for an early dinner post-Broadway matinee on a Wednesday and took advantage of the $1 oysters for happy hour. The cocktail was delicious and the wine was a very good value. We also had the avocado hummus and squash blossoms as appetizers. The burger was fantastic. Excellent food and service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBa2Z2ZEZnEAE",
            "text": "Very chic and really beautiful bar. We went here for a few more drinks after dinner at Strip House. Considering we just tried our luck for a table, they were able to give us a good corner one. Dark mood lighting, this would be perfect for a date night. Fantastic selection of drinks but especially for gin-lovers, which some of my friends are. Would love to come back again soon, perhaps after a Broadway show. :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNac19YcURREAE",
            "text": "The atmosphere here is great. Came around 6pm, it was busy with after work folks getting a drink & socializing. And in the back were people having dinner. The place is beautiful & nice decor. The food was good, there wasn’t one thing I tried from my table that I did not like. Literally very pleased with the dishes & portions. I had a very light but tasty rose & the service was fine. Don’t really have any complaints. I look forward to coming here for after work drinks next time."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNi03di1BRRAB",
            "text": "Love the dark and sexy vibe of this place.  The cocktails were great, and the brunch was tasty. Our food arrived promptly and tasty fresh. The burger was a little hard to eat but worth the mess. We will be back when we return to New York!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RdE4zSTNUMUJwVm5GRk9XeGhVV0pOU1RSNGFtYxAB",
            "text": "Incredible spot for $1 oyster happy hour! They were massive and super tasty. Space is beautiful as well, would totally come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiLWNfYXF3RRAB",
            "text": "Popped into this place because the menu looked good. It is old new york club design inside. Absolutely beautiful. They have live music on Sundays. It was lively and loud inside but a good happy loud. Everything we ate was delicious. The servers did not rush you. Would definitely go again when in the area."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxb2NrdGxUR3MyWjBOa2EyNVVUVzR5TldoQlkwRRAB",
            "text": "Popped into Valerie on a work trip with a couple of colleagues, our concierge recommended it for cocktails and a decent happy hour. And to be fair, it delivered—great drinks menu with some fun and creative options and oysters were on special, so naturally we did the only sensible thing and ordered 18. No regrets there.\n\nThe space itself is stylish and perfect for after-work drinks or a weekend crowd. But the acoustics are absolutely shocking. Once the place filled up and happy hour hit its stride, it was full-on club-level volume. We ended up shouting across the table but did find it a little quieter upstairs.  Not ideal when you’re trying to have any kind of conversation that doesn’t involve yelling your drink order.\n\nSo, great spot for a drink and a dozen oysters—just don’t come expecting to chat about business when it’s busy."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xNGJVeFVRUzFuWHpaalFsbFhSWEJNVDJac2NWRRAB",
            "text": "Received this recommendation from our hotel concierge Celia, 10/10. It’s a VIBE. Food, cocktails, atmosphere and service impeccable. Highly recommended"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMXVTaDJ3RRAB",
            "text": "Anna, the manager, saved my marriage!\n\nMy husband and I went for brunch and picked this place because of the live music on Sunday. When we got to this beautiful restaurant, we were offered an amazing table in a corner room. My husband and I gasped in fright; we were hoping for the live music so we wouldn’t have to talk to each other! It was our 6th anniversary weekend and we’re pretty tapped out of things to say. The kind staff understood and offered to call us when seats at the bar became available. Thanks to the team, my marriage survived another day.\n\nAll kidding aside, the service was wonderful and the food was delicious. We each ordered a Benedict and enjoyed our generous portion greatly. The choice of gin was overwhelming, but Bri (bartender) was very helpful.  It was a great experience and I highly recommend this!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxaVpqRmtRV2g1VUVsVVltUkJiV1ZxVlRsWmNtYxAB",
            "text": "I loved it! Only been in the city for about 2 years, but it was my favorite meal. We had Saturday brunch. Our server was great, I had the best biscuit baked by someone other than my mom, and both our meals were delicious. I had one (or maybe more…mind your business) mimosa, and my wife had a gin and tonic. Both were great. It was classy without being pretentious, and really amazing overall."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2ak42QlpBEAE",
            "text": "Had a great dinner here before a show! We had bao buns and split the crispy striped bass, both of which were delicious. Our server Ashleigh was really sweet and attentive. They even brought me out a chocolate tarte for my birthday 😊"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLdThzOFNrdGFpbTNBRRAB",
            "text": "Amazing food and service. The ravioli and short rib were incredible. Very nice atmosphere and for an upscale place the price is really not bad."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsdlVtNTZOWEJ0YTBWUlkwWk1ZUzFOV1ZWMGRWRRAB",
            "text": "Had lunch at the bar with a colleague and it was a great experience. Service was friendly and attentive from the start. I had the Valerie Burger, which was cooked perfectly and packed with flavor—absolutely incredible. My colleague went with the Smash Burger and said it was delicious. Between the great food and the excellent bar service, Valerie is definitely a spot I’d recommend for lunch in the city."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNExYcmNBEAE",
            "text": "What a fantastic Bar!\nGreat food, very lovely staff and some of the best cocktails I’ve ever had!\nAbsolutely loved it and highly recommend to everyone!"
        },
        {
            "date": "9달 전",
            "language": "vi",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfcE5DZURREAE",
            "text": "Cocktail ngon nha , công nhận. Tui uống 3 li desperado, jet lag and Pisqo gì gì quên tên rồi, nặng đô ngon. Tui kêu Jameson với soda thì thấy nó pha nhạt ko bằng chỗ khác. Chắc bữa sau kêu cocktail thôi đừng kêu mấy loại on the rock . Quán này đông nha, may tui tới sớm quầy bar còn vắng. Nhớ đặt bàn nha."
        }
    ],
    "reviews_count": 78
}