{
    "name": "Kellari Taverna",
    "place_id": "ChIJDcyu2_9YwokRN2jyzlJQBWc",
    "grid": "MN5",
    "address": "19 W 44th St, New York, NY 10036, USA",
    "rating": 4.4,
    "user_ratings_total": 1421,
    "phone_number": "(212) 221-0144",
    "reviews": [
        {
            "date": "1주 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNemFVZDNjVUZJYjI1SVJHMDRjbkJGV2tSRWFWRRAB",
            "text": "Un bon restaurant decouvert par hasard. Nous avons dîné par manque de place au bar et nous sommes ravis d'avoir pu profiter de l'ambiance new-yorkaise et de la gentillesse de Nikolas qui s'est occupé de nous."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMk1uZEVZV1UxTVdKMlNURXdhMjF2WWxCWVJrRRAB",
            "text": "very good restaurant.. Excelent food and drinks!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OWmRURllSWFJ0YlMxdllUYzVRbTFwY1ZCaWJGRRAB",
            "text": "Nic the bartender was so hospitable and guided us through their fabulous dinner menu, we sat at the bar for happy hour and Nic was pleasant and  attentive the whole time. Thank you so much for the genuine hospitality.  We will definitely a be back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xweVNXcEtNRTV0WVVoeGJXRkRZbEZEUVdSc1puYxAB",
            "text": "New York is goals when it comes to food. You want to try all the things that you don’t have access to. And obviously leave enough space for a slice of pizza. I found Kallari Tavern as I was exploring locations close to our Broadway show. It was a 10 minute walk and easy to make a reservation on Open Table. They also had a special theater menu with 3 courses. We made a regular reservation and arrived on time. The outside is very inviting with a lovely outdoor seated area and the interior as you walk in is very welcoming. A friendly face greeted us at the door and was prompt to seat us. It feels like we were in mini Greece with the decorations in the restaurant. Our friends arrived. We ordered a Greek Prosecco for the table. It was fresh, crisp and delightful. For our meal, we had a variety at the table. We got a few appetizers with the dip spread with tzatziki, cava and tyroslameti. The eggplant and mashed potato option seemed to be the additional options we considered. The tzatziki and the tyrsolsameti were amazing. The pita was soft, warm and pleasant with the dips. Our friend got the theater menu and had the calamari as an appetizer. For entrees we had a variety of things at the table. I had a the Greek salad which was amazing. It has all the colors of the rainbow, blocks of feta and a wonderful dressing. One friend got the sides of potatoes and asparagus which were satisfying. We had fried calamari at the table. And the friend doing the theater menu has lamb chops. The food was incredible, flavorful and tasty. It didn’t require additions. For dessert- since we had a birthday at the table we ordered pistachio ice cream which came out promptly. However, they also brought out a dish of Bakalava which was a nice surprise. It was soaked in the honey, had a lovely phyllo dough. The ice cream to go with it added a nice cooling effect. The meal was incredible. The ambiance amazing. Our server, Lefteris, who was kind and answered all questions ensured we made it out to our show in time. He brought us a night cap of a sweet wine to help us celebrate our friends birthday. This was hands down the best sit down dining experience in New York. Going to be on my list in New York because of this experience."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0cFltbHFTVTlmV0d0MVFUSnZTR2R3T0Mxc1ptYxAB",
            "text": "The best greek restaurant in America, highly recommended, the singers are amazing! The best greek music!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFdGIzSXliWGhGY0dZM2RHeEhjelJ6TFZNNFdrRRAB",
            "text": "Quick attentive service / delicious veg/ excellent Prosecco / lots of fun in a bustling but peaceful comfy setting- lots of booths -and for NYC the bourbon selection is quite decent"
        },
        {
            "date": "1달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSlEwVmllVmxzVGtaS1FtVjFNbXhZY0dkRldYYxAB",
            "text": "Отличная Греческая кухня,море продукты т.д"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kTVdtMDRiVTFVVFhsb2RHOTNSM2REWnpCQlQxRRAB",
            "text": "Amazing service by Angel!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFeU1qWmhVMnRGVURCQlYwNVdNWHBsUVVwNVkwRRAB",
            "text": "Staff answered our questions kindly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KT05HbEZWV1ZaYkRkUVRVNUZZV1JSVVZCU1pGRRAB",
            "text": "We came here to dinner before a Broadway show. I’m always nervous about restaurants in the Theater District, but I was proven wrong. The food was delicious, the service was excellent, and the atmosphere was comfortable and perfect!\n\nOur waiter, Leftéris, guided us through the menu, gave great recommendations, timed the food perfectly, and made my mother’s birthday celebration very special.\n\nI’m marking this as a place to return to in the future!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMExXUkxiRGRuZVdoRlgwRkhYMHBJYTJWUE5uYxAB",
            "text": "The restaurant is beautiful. I was celebrating my birthday with a friend. This is a great restaurant to take a special someone or a an old friend. I saw a group of 10 for a ladies night out. The ambiance is lovely! The music playing was smooth jazz. I highly recommend this place...I know you will love it! We ordered calamari and octopus for appetizers. I had the Greek Salad with grilled chicken and my friend had fresh fish grilled whole! Head and tail included. Don't leave without trying the Baklava...so delish, and the presentation is fabulous, includes fresh figs, blackberries, and vanilla ice cream. My friend is a New Yorker. She said she is definitely planning to return. I went back before my flight to buy 2 orders of that delicious Baklava! 😋"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aV09XZEdXRXBGWjFwUWRWOTRkbDlWZDFveGQxRRAB",
            "text": "Delicious food and a great atmosphere overall. I like the authenticity of the restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aa2VHbG1Xa3huVEZBMVNXTXpia1ZtYkRCaFVrRRAB",
            "text": "Food and service was outstanding. Leonidas was an excellent waiter and Victor was a welcoming host! Cinola liquor drinks were delicious"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMFEzRk1UV1ZzTUhKM2JITm5NVUZvY2xJNFlVRRAB",
            "text": "One of the best Greek restaurants in NYC!"
        },
        {
            "date": "2달 전",
            "language": "el",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMlMybEdNVGh0Y1RCMFZtZE1XbEJvTFhJMFQxRRAB",
            "text": "Wonderful flavor of Greece in NYC! ευχαριστώ"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4eVZtNVRXRzlFWWxKSFNFSjBkRzkzTkdkRE1FRRAB",
            "text": "AMAZING ⭐⭐⭐ Very welcoming, friendly staff, delicious food, beautiful ambience; all around great! Thank you for a wonderful dining experience!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xONlFVNUtZbE5FUXkxcVZGOTBXamRCZDA0elgzYxAB",
            "text": "Nice food but definitely overpriced. Oysters were tasteless."
        },
        {
            "date": "2달 전",
            "language": "iw",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKb1gwcGZUUzF4VGxjeFVERm5TbGx0UjA4eVlrRRAB",
            "text": "מעולה"
        },
        {
            "date": "2달 전",
            "language": "el",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdlUybFNkVE4yYTJ3elgwSkdka3AyVDJOQlQzYxAB",
            "text": "Φάγαμε ένα βράδυ του Αυγούστου του 2021 με την οικογένειά μου και φίλους μας! Εξαιρετική εμπειρία τόσο του φαγητού όσο και του χώρου!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205blVtbDJPRkYyZGxoS1drVnVRbkkyV0UxSE1XYxAB",
            "text": "Professional all the way. It is a very expensive restaurant. However, you get what you pay for. Delicious good quality food and drinks, plus exceptional service.\n\nThey have a fresh, good-quality fish selection.\n\nThe ambiance and decor reeked of class and taste."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SUWJXUk9kbEJrVFRGSmVVZFZiRE5DUWpoaWFGRRAB",
            "text": "There for a work event for 9 people. They accommodated an unexpected guest. The entrees were very good as were all the appetizers. It did take a couple attempts to get extra serving spoons for the apps."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4OWFHcTdnRRAB",
            "text": "I enjoyed the charcoal grilled calamari appetizer with red pepper and hummus (pictured), as well as the baklava dessert with honey (pictured) served on the side. I disliked the \"east and west coast oysters,\" which I thought were virtually tasteless, a 100% disappointment. On another visit there I tried their meze (pikilia) trio. The three included (1) yogurt/cucumber combination, (2) an eggplant meze, (3) a garlic and almond combination meze. I enjoyed all three (pictured below). On another visit there I had their sardine appetizer which I enjoyed. I had a potato fennel soup there one time that was excellent."
        },
        {
            "date": "2달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5aWVISnBNVWxYYzNKR2EyeDFNVVk1ZERGMlNGRRAB",
            "text": "Tolle Lokation, perfekte Bedienungen und super Essen 😋"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKTVZIRkdUa1YzUzB3eVltcFFVbVZGV0RCRE9GRRAB",
            "text": "Really good midtown lunch option"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkcFRubENZV05vT1RFM2JGSm5YMUkwTlc5bVlsRRAB",
            "text": "Great restaurant. Excellent vibe. Food awesome. Service great. Can’t wait yo come back."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFdE9HMWtNR1ZpTjNkU2JXaE9NMVF5TlZCWlptYxAB",
            "text": "Last night in New York...from New Zealand..service food and atmosphere perfect...attention to detail and complimentary extras..a bonus.😋"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWV2FtUmFlVzR4Tmtkb09WWmhWa3BZVTNCVE4wRRAB",
            "text": "Oasis in the City."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGeGNEUnJZVFpXY2prNExYSXRRMGMzWkY5dmExRRAB",
            "text": "Great selection and fixed lunch menu was a great deal. Don’t let the whole fish scare you, there are great options for all palates. My chicken kabobs were large and juicy. We had a wobbly table and one of the staff refilling our waters noticed and had it resolved immediately."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkS1JHdHJabEZGVEdacVUzWTJWek4wYW5oelRXYxAB",
            "text": "Light lunch with good food and quick service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4NlZrUkRSVmxPT1RJdE1WZHNOM05VWVVWclRYYxAB",
            "text": "Awesome service from Alesea B.!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wc1ZHbE1aM3BzTkhkdFMwVTVSMWhmYnpGaU1uYxAB",
            "text": "Excellent restaurant! Exceptional service! Highly recommend."
        },
        {
            "date": "수정일: 3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1X291MlR3EAE",
            "text": "Excelente como siempre. Fastuosos los linguini con verdura y la langosta con fideos negros.\nPárrafo aparte de postre el BAKLAWA.\nMuy bien atendido por parte del personal"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsZmVraHFabTFqTlRCa2FUUXlOMkZrYTFCYWIzYxAB",
            "text": "Amazing experience at Kellari Taverna!!! The food was absolutely delicious! Very attentive, friendly, and professional servers and managers made us feel so welcomed. We will definitely visit again."
        },
        {
            "date": "3달 전",
            "language": "nl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wd1FuazBja1ZzVjJWYVltWXRZV3RvT0VWMFlWRRAB",
            "text": "Heel lekker, aardig personeel."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZelRrdGhXVUZpTlc5dmVpMHpPV3BKUjJFMmNFRRAB",
            "text": "Had a lovely pre-theatre dinner here with a calming ambiance and delicious fresh seafood. The staff was friendly and attentive at all times. Will definitely be coming back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RUxVVjNXVTFpYlRsbWVuZG5kMUJaVXpCblMzYxAB",
            "text": "Nicholas at the bar is amazing!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGUmFEaFRWbTlQYVVwaVNscGZSakI1UzNwblZWRRAB",
            "text": "The prix fixe theater menu was lovely! Sea bass with asparagus and Fava bean puree. And baklava, and kale salad. All delicious! Lovely energy and decor!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTGFFZEdVRkZETkRoVmRtSktiRlp6UldSU1NrRRAB",
            "text": "Great service. Amazing lamb chops. ! Excellent place"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNmFHZEVZVloyV1hnelEyVkpWVTkxYTJrelpsRRAB",
            "text": "Great place for greek eats. Atmosphere and service at 10/10. Will be back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWU1RVdEVlbUl3VVVkUmFHeFNhblI0U0VoQ2FVRRAB",
            "text": "We went here before the show….. actually running behind.  Informed the waiter that we are on a short timeline.  Had no impact on his professionalism, food quality…. Even had a time for desert.  A very nice meal before our broadway show.  Thank you"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOMFQyNVBNRXBSWTI1aVkxcDVZbmRXVWt4Nk4yYxAB",
            "text": "The grilled octopus was excellent! Also ordered grilled calamari, grilled lamb, and branzino."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSlNrWlhPSEk1VGpGTmVWUm9ha0pmYVdWMGFGRRAB",
            "text": "The food was exceptional, though the choice of vegetarian dishes was a bit limited the quality and taste was exceptional.\nThe Spanakopita, home made bread, hummus and olives were an excellent set of entrees. The Wild Mushroom Kritharoto was exceptional, perfectly balanced and not too creamy or rich. The Brocollini side (perfectly steamed broccoli with garlic and spicy feta) was amazing. The Spinach Linguine was exceptional as well.\nThe staff is very efficient and courteous."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKUEJ2YUhBd3N2MjZnRRAB",
            "text": "This was my family’s second time at this restaurant - my family member had recommended this place after having a business dinner here Great for large groups or a romantic date, the restaurant layout accommodates any size party and each table seating feels private.  Excellent quality of food and service.  Our waiter was top notch, attentive and cared about giving us a great experience.  We started with octopus, Greek salad, and zucchini chips.  Appetizers were hefty portions, bright and flavorful.  Grilled whole fish is not something you can find everywhere, which is part of the reason we came back. We evened off the main course with roasted chicken, potatoes, mushrooms, and broccolini.  Everything was absolutely delicious.  The waiter recommended a fantastic wine, drinks and dessert."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJZW9sdjJfX2RqajJBRRAB",
            "text": "Mer with a couple of other guys for  business lunch on a Thursday.  The fixed price menu is very good and includes a starter, entree and dessert.  It was a  bit loud for a business meeting, but we could still hear each other.  Service was good and non-intrusive."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJeWo2SWVrOC03dW5RRRAB",
            "text": "Great ambience and service, and is open till 11pm which is one of the main reasons I went here. Homemade bread with hummus and olives was served as a complimentary starter, and a plate of possible homemade cookies served as a dessert/ goodbye compliments. Ordered the Tiri Psito and Wild Mushroom Kritharoto (vegetarian dishes). Mushroom Kritharoto was very flavorful with a strong taste of enoki mushrooms, the sauce didn’t feel too rich and greasy."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLT1d6SldXa00yM3pBRRAB",
            "text": "What a lovely little gem. Went for brunch on Sunday afternoon before a show. We had the pre fix menu. Spanakopita was excellent. Eggs Benedict, salmon, burger, and French toast. Everything was delicious. Lemon tart was refreshing and light. Very enjoyable. We weren’t rushed and had plenty of time before the show. Highly recommended."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLbUc5OTNUb3UzZXVRRRAB",
            "text": "The fruit was mad good.\nThe recommendation of the lady server was good for the fish for one person."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJdmh6dGV6Mzh6SGR3EAE",
            "text": "Dinner was wonderful. In and out in time for theater. Tasty food. Great service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQZm4xY2V6eVltdUV3EAE",
            "text": "Did early dinner before show. Enjoyed. Staff were great."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQeVdzX2pwemE2UHFRRRAB",
            "text": "Favorite Greek restaurant. Disappointed when the one in DC closed."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2eklHWWRBEAE",
            "text": "Came here for lunch on a weekday and the place was packed! Don't be fooled by the exterior - it gives the impression of being a small place but the entire restaurant is massive and has a great vibe.\n\nEven though we had a reservation, the table was ready only 20 minutes after the scheduled time.\n\nOrdered a prix fixe lunch and the food was great - had the soup of the day to start with, followed by the Grilled Solomos (salmon) and the Sokolata Kormos for dessert. The dessert was exceptional in taste and flavor - i just couldn't stop at one bite!\n\nAll in all, while I loved the experience, though I'll skip the peak business lunch rush and go at a quieter time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNib2NMQ2VBEAE",
            "text": "My husband and I had the most incredible dining experience at Kellari Taverna in New York today. From the moment we walked in, George, the host, and Silvia, our server, made us feel like VIPs. Their exceptional hospitality truly enhanced our meal.\n\nWe started with delightful appetizers that set the tone for the evening. For the main course, I enjoyed a delicious lobster and linguine dish, while my husband savored a perfectly cooked scallop and linguine dish. Both were cooked to perfection and bursting with flavor.\n\nThe meal concluded with the most amazing desserts (see photos). Each bite was a perfect end to a memorable dining experience.\n\nThank you, George and Silvia, for making our visit special. We will definitely be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveGJ2YUZ3EAE",
            "text": "Had a good value pre theatre three course dinner and an additional tzatziki. Sat by the bar. Very friendly bar tender who handled my order."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzamRQYTZnRRAB",
            "text": "The engagement dinner was great. We were squished in a tiny room all the way in the back that was more suitable for 10-15 guests versus 21. The service staff were attentive and listened to guest’s requests. They were out of lobster pasta and that was announced early on. Everyone was more than pleased with their entrees. The zucchini chips were amazing! All the bread served dinner was warm and fresh. No one complained about their Salmon, Sea Bass, chicken, or pasta dishes. The portions were fair sized and filling. The cocktails were exquisite! I’d revisit them again. Parking is complicated and that’s normal for TSQ. Try the desert sampler. We were pleasantly surprised but some of the options."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiOC03OTBBRRAB",
            "text": "The hostess was so elegant and stylish, and really set the bar very high for the whole experience. Nattily-dressed waiters, attentive service (our glass was never empty,) delicious fresh and tender food, great flavors, beautiful table settings and bold decor."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbWJ1TXRnRRAB",
            "text": "This place is quite loud for being an upscale restaurant. But the food, service was amazing. Ordered the spanakopita, wild mushroom orzo dish. Both were such good vegetarian options. My friend ordered salmon which she loved as well. But such a nice, chill place. But only negative thing is its way too loud. Definitely cant go on a date or a business lunch/dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdnZHam1BRRAB",
            "text": "I enjoyed my 1st time visit at this beautiful restaurant. The food was excellent very decent portions including excellent service.\n\n*just a reminder for the staff ; not to forget to refill our glass of water more often. Thank you .\n\nThe washroom very clean ✅\n\nI strongly recommend this restaurant.\n\nThank you to my waiter; A 1 (Excellent) service  Louis fernadez 😊👌"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNjVTUS1RRRAB",
            "text": "Great place to grab dinner before a Broadway show. Food was delicious and service was great. Lamb chops 🤤"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJNDdIc2ZREAE",
            "text": "The restaurant decor in the main dining room was nice as was the bar. However they asked us if we wanted to sit in the dining room in the back saying it would be a lot quieter. We agreed to be seated back there but the setting wasn’t nearly…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdHNIMGhBRRAB",
            "text": "It's a nice small restaurant not far from the hotel we stayed it. We were looking for a good sea food place and found this. I was glad that at this place, they also were offering fish that's fresh caught. We have ordered several appetizers and several hot dishes. We left from there full and satisfied. We liked all the fishes except the salmon felt a little dry. Service in general was good, but our hot meals got delivered a bit too late. Those are minor things, and I won't reduce my rating because of it, because overall, we were happy with everything."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBcXVpSW9BRRAB",
            "text": "Delicious mediterranean food— the greek salad is fantastic and you can tell the ingredients are fresh. Staff are the friendliest in the city and will make you feel very welcome and at home. The fish is also great"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NEtlT1JnEAE",
            "text": "Food was great. Ordered the crab cake appetizer. The dish was light and delectable. Cooked perfectly. The side salad was crispy and fresh. It was well seasoned with a vinaigrette. The chicken skewers were cooked perfectly. It was juicy and flavorful. The tzatziki sauce was tangy and delicious. The service was great. Attentive waiters and staff. The decor inside is beautiful. Very pleasant vibe and a great lunch or dinner spot. Clean restaurant and fairly priced. I would recommend this spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWNHBqR2VnEAE",
            "text": "I along with two colleagues had a very disappointing dinner at Kellari Taverna on West 44th in New York City.\nThe restaurant has a very appealing décor and atmosphere and there was a nice welcome at the door. Service at our table was very attentive but unfortunately that’s where the positive part of this review ends. We ordered some grilled calamari to share the table and it arrived in some undefined sauce without serving spoons. The calamari was bland and tasteless and a little chewy, which to be objective should be expected. It certainly didn’t taste grilled as there was no char taste.\nI ordered the solomos as the main course, which was crusted salmon over a bed of spinach and kale with fingerling potatoes. The crusted salmon arrived looking burnt and overcooked while the fingerling potatoes were completely undercooked. I also ordered a side of rapini was which was served on a bed of some strange orange, lumpy sauce. Suffice it to say, I ate the salmon filet, without the crust, spinach, rapini all of which were inedible.\nThis was a very disappointing meal, and I will not be back. In a city with so many excellent restaurants, our dinner was a very disappointing experience."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2eEluZ1pBEAE",
            "text": "This place was nicely decorated for the holiday,  beautiful olive trees. The food was exceptional! Staff was welcoming and attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMM2UyU3FRRRAB",
            "text": "Really enjoyed the food and service here. We came here at 5pm, this is our first time and will come back again. We ordered pre-theater 3 courses menu, all high quality and good portions, yummy!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRMGRLaW5nRRAB",
            "text": "It was extremely racist! From the moment I sat down, no one paid any attention to me. Despite it being a quiet time, I was seated in an uncomfortable corner. During the first 10 minutes, the waiter for the table next to me came three times, but no one even offered me water. I wonder if this service is racially discriminatory or just disdainful of single guests."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1eDVpTFZBEAE",
            "text": "I checked out NYC website to make sure this place offers a Sunday Brunch/Lunch for Restaurant Week Menu and also called the restaurant to confirm.\n\nI made a reservation on Sunday at 11:30 am. Woman welcomed us and all of sudden the phone rang and she picked up. She lowered her voice and talking to this person on the phone, instructed to do something and she repeated \" what? Give them a different menu slip? Where is it?\" In front her, there were actual menu and  \"Restaurant Week Menu\"  but she gave us regular menu and other \"dinner menu\"instead. And that dinner menu set cost  over $65++ per person compares to $30 per person for Restaurant Week Menu.\n\nI asked our waiter if there are any restaurant week menu and he said \"No, not on the weekends!\" So I told him, \"Oh, I actually came to try out Restaurant Week Menu, and I saw on the NYC website shows that your restaurant is  participating for Sunday Brunch/Lunch. He says \"No, not on the Sunday\"\n\nWell, I didn't want to make a big deal, so I ordered a regular meal.\n\n5 minutes later, I noticed that this hostess, same woman were giving out Regular Menu book and \"Restaurant Week \" Menu to other customers. So I asked this woman,  if there was a  different menu for Restaurant Week? She says \" oh did I give you a dinner menu?\"\nI specifically asked our waiter if there's any Restaurant Week menu and he clearly said, No.\n\nI lived in this area for more than 10 years. She might have thought that we were a tourist and tried to sell expensive menus. I felt discriminated based on our appearance,  race,  or whatever it was. Terrible experience."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQycHRDcnJBRRAB",
            "text": "We used come here regularly - of course as I remember that, google tells me it has been 9 years.... Great Happy Hour at the bar.  Love being able to order small plates, it allows being able to taste a wide variety of dishes.  Tonight the Sardines, Shrimp in Tomato, Lamb/Pork Sausage, and Truffle Fries."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLUzlfS3F5d3Z5TEVREAE",
            "text": "Excellent food and service!  Feels like you’re dining in Santorini!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHM182Nk9BEAE",
            "text": "Amazing greek place. The restaurant is beautiful! Huge wine selection and lots of vegetarian options. We had the zucchini and eggplant chips and zucchini croquettes they were delicious !!! For main course we had the steak which was huge and the fish of the day (not the best i had tbh).\n\nIn general everything was great, great service as well!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGdkw3NzNnRRAB",
            "text": "We dined here on a weeknight after a late arrival to our hotel. This restaurant was recommended by the hotel check-in staff. We were not disappointed! The restaurant was very busy but the staff were able to seat us within minutes. We received attentive service from server Jon. He helped us select a delicious bottle of white wine from Greece which we paired with the grilled octopus appetizer and two seafood/pasta entrees. My wife had the squid ink pasta with scallops and I had the daily special (branzino/lavraki with lemon/wine/butter linguine). The food was delicious and the price point was reasonable. Great dining experience for sure!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbTh1dkZBEAE",
            "text": "Food, ambiance, and service are tops at this amazing Greek spot on W 44th St. A perfect pre or post theatre choice for delicious lavraki, spreads, greek salad, and veggies. Always a wonderful crowd. Angel waited on us and is a perfect server!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPaGRLTzlBRRAB",
            "text": "The restaurant is beautiful and the staff is so friendly and polite. The food was good generally but I loved the sweet potato fries. They were mouth watering. I had the Mediterranean sea bass and my husband got chicken. Both were good. The mojito however I wouldn’t recommend it to anyone."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdnNmZlJREAE",
            "text": "The environment was great and the food was good. There was a heavy seafood focus to the point where they had fish on ice on display when you walk in. We sat in the back at a beautiful wood-slab table that our group of 12 could all fit at…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyaUl2RDBnRRAB",
            "text": "Came for dinner on a Saturday night before the theater.  Dinner was excellent.  The restaurant smelled amazing as we walked in. Our server was attentive with out being bothersome. Would definitely come back next time I travel to NYC."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoaTlUWDFRRRAB",
            "text": "Beautifully decorated and spacious restaurant serving Greek food. I had the lobster ravioli and was disappointed. It was not tasty and the ravioli quite chewy. My friend's seafood dish looked really good and he loved it. I'll give this restaurant another try."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoMWJDUzJRRRAB",
            "text": "Had a wonderful dinner at Kellari Taverna on out first night in NYC. The oysters we started with were excellent. I had the whole Dover Sole, which was perfectly prepared.  Severs were personable and attentive."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCaVpQVWZnEAE",
            "text": "Amazing food and service; great wine recommendations! We had the tuna tartare and grilled holumi with the farm to table salad, and for mains the vegan moussaka was amazing and the lamb chops perfect."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2ellUZC1BRRAB",
            "text": "Service was decent and food took a little long. We were put by a table in a corner, but food was amazing. Very nice and creative, food was something else!"
        }
    ],
    "reviews_count": 79
}