{
    "name": "AperiBar",
    "place_id": "ChIJZTInQIhZwokR8GBPDoHJMok",
    "grid": "MN5",
    "address": "LUMA Hotel Times Square, 120 W 41st St, New York, NY 10036, USA",
    "rating": 4.8,
    "user_ratings_total": 922,
    "phone_number": "(212) 730-8900",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwV01IWnljRFZuVlhsWlRHSkxTMmhVYmpaRVJGRRAB",
            "text": "Cole greeted us with such warmth and charm, and gave us terrific advice. A lovely spot."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4NGRtUmlhRGxrVms1UlprWnZRbWRWU2toUmExRRAB",
            "text": "We just ate off of the anitpasta menu while we had some drinks and everything was amazing (food + cocktails). Wait staff was super profesional, attentive, and kind."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsalJEZE5aV1ZvTlVaUlRYZFBNREpQZEdGTFNrRRAB",
            "text": "Sat there for over 20 minutes gave us 2 tiny pieces of focaccia no one ever came over to wait on us after that. Staff stood around chatting while we sat there. Never asked us for our drink order etc. so disappointed got up and left. Very weird situation. Have no idea why they ignored us. Walked over to Bryant Park and had a wonderful experience at the Bryant Park Grill."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SbVIwTnFTemxCVDNCdVpIWnhOV3d3VTNCalMxRRAB",
            "text": "My wife and I stopped into this bar for\nThe very first time and want to highly compliment Cole for his warm service and for the great Caesar salad and Bolognese! Nice little stop off with great happy hour\nPrices just off Bryant Park"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUldVZHlZak0xZUZReVpXNXpUM0J6WTBaeFdsRRAB",
            "text": "We had a lovely dinner - the service and food was exceptional.  We can't wait to go back next time we are in NYC.  Highly recommend a visit"
        },
        {
            "date": "2주 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VNVIxUlVNazlKYm1sMVZIbGZUelJ1YkdwdmVrRRAB",
            "text": "Excellent dîner dans ce restaurant à NYC. Les gnocchis à la betterave et l’escalope milanaise nous ont ravis les papilles. Très bonne adresse pour les français a NY, ambiance romantique. Tres bon rapport qualité prix.  Petit bémol : service un peu long."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214UFZFVmpNbXhxUWpWRVYwUmZkbWg0VEdGWUxVRRAB",
            "text": "Omar, Yan and Carlos are the best! We had such a fun time. We stopped in on a whim and we are so glad we did!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsSVYyVnVXbHBRYlRsdmFsQmxkVTlsVFROd1VHYxAB",
            "text": "Great place to grab a glass of amazing wine and pair it with great eats. Service was excellent with Timothy giving us background on wine and suggestions to pair with. Dessert was a highlight. Perfect adult gelato with beautiful ingredients in glasses. Great start to the evening."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWRU5tYzVOVjgwUm5SemVGUmhXVmRXUnpkVFgwRRAB",
            "text": "Food was amazing and the bartender Jan had the drinks just right! Will definitely come again"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aZlgyd3lNekZ6V0d0b1lXMVRiMVpLTmtsNldHYxAB",
            "text": "I had the best martini espresso I’ve tried this far in NYC!\nJan, our bartender, took great care of us and even recommended some of his local favorite spots!\nI can’t wait to come back!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4clVEa3lRemgxVEhKRlRFWnNPV3BGYld0VFRsRRAB",
            "text": "One of the best restaurant un nyc not a huge menu but all is very good"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0WlUxZGtWbTFaYkdKRGMzaE5kVzE1UlRKMllVRRAB",
            "text": "We popped in from Time Square - and this place, honestly…it felt like we were cheating :)\n\nA rare New York paradox: authentic Italian food that didn’t require a Broadway budget. Do yourself a favor and order the Skillet Pollo —> when the waiter brought it to me, he affirmed the selection, saying “prepare to be amazed!”\n\nIt wasn’t shy, a double stack of chicken on a throne of creamy farro that couldn’t prevent my friends from reaching across the table. The dish practically demanded to be shared! The bacon cameo caught me by surprise, sitting delightfully atop the chicken breast, initially fooling me as a thin slice of tomato.\n\nThe portions weren’t short on the protein, and the drinks were poured generously! We didn’t sit at a traditional table (like most customers) but Katie turned the bar into a living room…and the tall boys into recliners. We had paid our bill and prepared for departure, but the friendly ambiance compelled us to stay a bit longer and have a final round thanks to Katie’s hospitality.\n\nFor a city that never sleeps, this crew won’t sleep on hospitality. My phone died and they set up a charger on the outlet so that I could navigate my way home, and they assured us that our comfort and convenience was their expectation and nightly rhythm.\n\nA round trip flight to the homeland is expensive and a visit to cinque terra ain’t cheap — so treat yourself to “La Dolce Vida” in high definition —-> it’ll be an Italian detour without the airfare. A meal here can help you embrace a trip to the Big Apple without feeling like a tourist :)\n\nBuon appetito!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GV1RsTTBRV1I1Um1oU1Ewc3hkMlV3UTNod1RtYxAB",
            "text": "Katie was a great host. Super kind, easy to talk to and overall, a dope person! If you’re looking to have a great, relaxing, and fun night, Katie’s your girl. Let her know JosayQuavo sent you"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdlMyNDFjRVV6Y2tjdFZtbHpOSFZrU0VSeVUyYxAB",
            "text": "Fantastic! The kale/butternut squash salad is amazing. Super friendly staff. Killer chef. Couldn’t have love it more!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWM2JFVk9iM3A2UmxWUFkyRmlTRTU2YVRBeVEyYxAB",
            "text": "Wonderful service, great food, stylish moktailes👍👍👍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KeFUwMWlkbWRhTkVSWmVHMUhTMDVsVkRKNWRuYxAB",
            "text": "Tourist trap"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SdVlYQmZORkZSVjNkRmJXSnJXbmROV2tWMlRGRRAB",
            "text": "Had the worst Negroni of my life for 19$"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkME0xRnpabU5FYlZvMFFXSnhNVkJZVG5sRmFuYxAB",
            "text": "Went here for a quick dinner after the movies and it was so good! The food was delicious, and our server, Lesley, gave spot on recommendations. Phenomenal service and amazing food definitely coming back again! The margarita pizza and arincini are must haves here!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aVlJqZEtVM2hFV2xWcVkxUTJha3c1T0RaaE1XYxAB",
            "text": "Melt in your mouth goodness"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201TGVFUjRhSEoyWHpBNVNGWm1jR1ZGYWxWM09XYxAB",
            "text": "Perfect pre-theatre spot. Great share plates and good vibes."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4M2MzcHpWMkUxVVRWNWRUWmZZbk5NUTI1aGRtYxAB",
            "text": "The food was amazing, but the service was subpar. Aside from giving our initial order, the server rushed by our table without stopping. We had to flag her down to get another drink after she rushed by our table multiple times without making eye contact. We were going to order dessert, but she took so long that we just flagged her down again and asked for the bill. Wonderful food but a somewhat disappointing experience overall."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21seU1VNUhZbTVtZUZFMFpXVTBWMFk1ZFRWRmFrRRAB",
            "text": "Honestly came for drinks and some food at the bar. Sat at the bar. Then was told to move by a manager as well as with the bartender when it’s first come first serve. I was already sitting down for 10 minutes. White girl brunette , had a plaid shirt which was the manager told me to sit in the “lounge” bartender then came up to me said a round was on him because of what happened. Then they said they had a table opened in the main dining room. But then I was only able to get a happy hour cocktail. It was just so\nConfusing. Coming from someone who goes to restaurants frequently this is one of my only reviews that I left that I felt very singled out while on our anniversary. It was incredibly disappointing seeing as I’m always over here and this was a bar I was excited to go to."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZeWVHbHZWekpOZUVORFRuWlBibUZYTUhkeFRGRRAB",
            "text": "A place with excellent Italian food and delicious cocktails, and of course a great atmosphere. High-level service. Highly recommended."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aa05qaGhSRk5YZUZWcVdFZDVhMFZhTFRKbFltYxAB",
            "text": "Cool atmosphere with delicious food. Mario was super attentive and helpful!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aalFXNXRWbWhKVm0xeVREVjBSMkkyVTBkaGFuYxAB",
            "text": "Pretty tasty! Highly recommend the heritage chicken skillet."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sR1VYSmlXa3hGY2tKblVtOTROMjlxVkdsTGRFRRAB",
            "text": "The food was great. Chicken, pizza, and meet balls for starters were all delicious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCbGR6QjFNMGhmZFZKNVlqQlhVV2RoYkRsbFIzYxAB",
            "text": "Honestly, I don’t know how it got such a high rating. The food is very med it felt meh."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oT2VuQmxRelJqVFV0MFduUmFNMmRMUjJZemNrRRAB",
            "text": "Cute place and easy for a pre theater dinner. Our server was fantastic. The food was so / so. They have a nice happy hour and excellent espresso martini so I’m more likely to return to the bar for a drink than I am for dinner!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSblZsazNVbFJDWkdwV2RVaFJTRUp5U21WYU1VRRAB",
            "text": "Great service , very friendly stuff"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205TFFqWnZSVUZLTkdaQ05UZERPREJ0T1RkVFlVRRAB",
            "text": "Great atmosphere with great food. Close to Times Square but yet with a chill vibe. Food and drinks are awesome."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxNVNVSkJTSFJLU0dsMWNIbDJjRWh5WTBkdlNIYxAB",
            "text": "Delicious cocktails, perfectly cooked pasta, and exceptional service, all right in the heart of Times Square. Incredible quality at such a reasonable price. A true hidden gem!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psbWMyaFBNVGRUWmw5Qk5WaFRjVE5QVFZCaGVXYxAB",
            "text": "An amazing classic Italian restaurant tucked away in the streets of New York we had a wonderful meal and the staff were incredibly friendly"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psQlRXdFRWRTlyUjBsMVNEVmZVelJTUXpObVpGRRAB",
            "text": "I walk by this place every day on the way home.  Finally, the super cool vibe got the best of me and I stopped in.  I’m SO glad I did.  The food — SPECTACULAR, and I keep coming back to try new dishes.  The staff is warm and engaging — especially Jahn and Omar at the bar — who are both so attentive and made me feel at home. Great lobby music doesn’t hurt.  This is one of my new favorite places!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUVpuVTJOVlZxWW10VVVHOVpRMkY1VlZoeGNtYxAB",
            "text": "Best bartenders in town! Jan and Omar were amazing! Also, the manager Sadie was so helpful and great! Plus, they have very nice breakfast options, Ron, the supervisor is so attractive and fun to talk to!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWc2VITkhWeTFhTFMxWE4ybDVYM1V3WVRsSmJrRRAB",
            "text": "Had a wonderful dinner at AperiBar this past Thursday with friends! We tried the Restaurant Week menu along with shishito peppers, and everything was incredibly fresh and delicious. We also enjoyed a nice selection of wine. The service was…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taWWJqWk9UalZhVjBnM2VtcHhXWE5OVlVGS1ZuYxAB",
            "text": "We had a great experience at this restaurant! The pizza was delicious — crisp crust, fresh toppings, and full of flavor. The pasta was also very good, cooked just right with rich, satisfying sauces. The Branzino was perfectly prepared and beautifully presented. We enjoyed a great selection of wine and well-crafted cocktails. The staff was friendly and attentive, and the prices were very reasonable for the quality. Definitely worth a visit!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWbVZXMXZNM1JRYUVGTGR5MW9OaTFLYzFwdFZGRRAB",
            "text": "We had calamari, mussels, shrimp, etc. all very good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWc1QybEdha1JIY1VSQmJXeHpNMk5JUkZGRmMyYxAB",
            "text": "We had a great time! Food and drinks were good but Omar our bartender was outstanding"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbmVrdFRRbVJTVldwWFFXSTNhMGRvWWxSWlExRRAB",
            "text": "Surprisingly good food (esp the menu calls entrees “primo” which means first course in Italian 😅)! Very fresh, well cooked seafood and nice ambience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NVlsOHdiM3BDYW10RFkzQnFXVzVKYkhVMk4yYxAB",
            "text": "I used to love this place, but Sunday changed my impression of this restaurant. The person at the bar knew we were there for a 5 PM dinner (we arrived 10 minutes early), and he said he would let us know when the restaurant opened. However, they made us wait 30 minutes without any updates.\n\nThe biggest issue with this restaurant is that they don’t have a receptionist, and the servers don’t seem to care whether you have a reservation or not. I love the food here, but this experience really disappointed me."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twdldHZzVYMFY0V0c0NWF6azViWEpHZWt4TGVsRRAB",
            "text": "April 2025\nI wanted a special place in NYC for a special dinner for a special (50th!) anniversary for my husband and me. When I discovered AperiBar, I knew I hit the jackpot. I saw that it was a restaurant by Charlie Palmer so that confirmed it. It's a small restaurant in the Luma Hotel (with a separate bar in the front). The food is thoughtfully prepared and so delicious. We would go back again and would recommend this to anyone looking for a nice date night.\n\nWe noticed that a number of restaurant guests were there for a pre-theater dinner so you could say, this inviting place hits on all points. Our waiter? He was sublime too. Ahmed. Thanks for taking us through a very non-rushed meal for our anniversary.\n\nFood, Cocktails, Service: Perfection!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoUFJHcHpXV1l6Ykd4Q1kzTnRhRzFUYkhoVVdXYxAB",
            "text": "We started our evening early with Omar at the bar, and thoroughly enjoyed his company, the drinks, and the respite from the heat.\n\nFor dinner, our party of four shared a Caesar Salad, which was good if not remarkable, and the Bistecca Florentina and Pollo Alla Parmigana, each of which was fabulous.\n\nService took a bit, however, and we needed to remind our server of an upcoming 7pm curtain. (It was a 5:15pm reservation, leaving us PLENTY of time before the show.) We sent our leftovers to be wrapped, and sadly, came home to two lonely slices of leftover steak *without* the beautiful porterhouse bone, which hadn't been touched. That's a big bummer for me, and has never happened with a bone-in cut before.\n\nSo, the food was great and the bar service was great, but our dining room service left a bit to be desired.  We will be happy to try again, however, and hope to believe the struggling server was an anomaly."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psdk9HZGpWRU10UkVSNlRsRndTSHBUTm1oM1RWRRAB",
            "text": "The pollo Arrossto was amazing the favors were superb along with the meatballs crispy on the outside and juicy on the inside. The ambience was beautiful, small but specially curated for their own vibe. The staff is amazing and attentive, shout out to bartender Omar for the wonderful service! His recommendations on food were a hit! 5 stars all around."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205c2VWTTFlRUp6VmtseGJsVkhZM2h6WjBJeVYxRRAB",
            "text": "Cute. Good food and drinks."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4M1NWQkdkSEJWU0RobVYxRnpVbTlmTTFsemMwRRAB",
            "text": "cute small place to spend time after work with some Aperol spritz"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSeGNteHpkV2d4VDBoSFltUk1OVnBtVEdsUFgyYxAB",
            "text": "Fabulous drinks and dinner.  Omar was awesome!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205dWFHeGhXRVZCYjBZelRETklNMUJVYVVoNlRHYxAB",
            "text": "We made a stop after a show. Great service from Timothy. Perfect size and ambiance. We ordered small bites to share. Good food beautifully presented."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kVk9GWk9SRmx5U0RBeFRDMVRjbDlKVFZwRGFrRRAB",
            "text": "Omar is so friendly & food is great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taUk9VNXRTRk5PVFRWQmVVUjFjamxDYVdjeVJsRRAB",
            "text": "Had a fantastic evening with my family. We really appreciated the non alcoholic options"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sd2FVZDJSR3BUWWxCblIycHZkWEJOZFRabmVuYxAB",
            "text": "This bar was pretty good!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3anYyZ0RnEAE",
            "text": "Met family after a broadway show. They accommodated 10 adults and 2 young children. We were tucked away in the back which was like having a semi private room. I was able to hear everyone which was so pleasant.\nOur server was awesome. He was attentive and answered our questions about quantity and recommendations.\nI didn’t try all the dishes but it seemed most enjoyed their meal. I LOVED the Cesar salad with actual anchovies. Well balanced and fresh. Unfortunately the steak I ordered was too salty and slightly overcooked for me. I asked for medium rare and it was medium. I could have sent it back but didn’t because it was fine for others. I tend to be sensitive to salt. I’m sure if I said anything they would have made it right.\nI would go back. My party also shared they would go back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3el9fcHlnRRAB",
            "text": "Came to this place after work on my way home. I was pleasantly surprised by unique and stylish interior, such a nice and friendly stuff with wonderful atmosphere.\nA few minutes being there, I immediately noticed that more and more people were coming in and quickly filled the entire restaurant, both at the bar and at the tables.\nI ordered: Filet mignon with home made gnocchi under truffle sauce; Tuna tomahawk with carrot pure n grilled asparagus; Black ink pasta with crab meat; dessert was such a delicious and amazing Panna cotta with strawberries and chocolate crumble.\nThis restaurant is a real pearl of New York, would definitely recommend and come back again to try new recipes 😋"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLanpySXVxN29XZTZ3RRAB",
            "text": "Great place for after work drinks. Charming patio seating; very pretty interior as well. Food was good and staff was friendly."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdHZlckxnEAE",
            "text": "Popped in for a bite to eat before going to a show at Radio City Music Hall and it was excellent! Atmosphere is good, food is excellent and service was great. Prices are reasonable. Recommend."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnX3VxdlBnEAE",
            "text": "First Rate!   That’s not easy to get in NYC.  From the moment you walk in, it’s a soothing experience.  Staff super friendly.  And they know the menu.  Meatball and cheese ball appetizers were bomb.   I had the recommended “pollo” entree which was incredibly delicious (and I’m not a chicken guy).  Definitely coming back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPaVlyWUNHeHBEVXFBRRAB",
            "text": "Great place for after the Broadway show. Amazing selection of wine. My artichokes appetizer and squid ink pasta both were outstanding. Noticable difference in the manner of service with ANYTHING that I have seen in New York. Extremely pleasant young man with shameless hair (forgot to ask what product he is using)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOF92dVF3EAE",
            "text": "Amazing Italian place! Food was delicious and Cole’s hospitality and recommendations top of the line! Ordered the Spring Chicken and Rigatoni Bolognesse, and ended with Cioccolata Torta + Chocolate Gelato (a great convo for the chocolate lovers!)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURycGFYcDBBRRAB",
            "text": "The whole staff team were amazing including the restaurant team (thanks Katie and Ahmed!). The beds were comfy, room extremely quiet and elevators super fast! We went back to the restaurant to eat 3 times because the food was so good. The concierge team were always friendly. We loved the coffee shop (Maman) right next door and my kids frequented the manga store nearby. Perfectly central location. Loved our stay!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMb2VhVU9nEAE",
            "text": "This place is AMAZING! I came in after a long day with a group of friends and we really weren’t expecting anything special but boy were we surprised. Katie, Jan, and Saba made our experience so pleasant and fun. I usually don’t write reviews but the vibe this crew brought to our table really changed our entire night. The drinks were delicious and the food was really high end considering how fast it came to our table. It’s apparent that they really care. Love this place <3"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIek5YcFJnEAE",
            "text": "Everything was great!y party of five were seated in a nice cozy corner near the wine. Our server was friendly and offered amazing advice on dishes and sides. My pasta was to die for! We enjoyed everything about AperiBar!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbHJtTHd3RRAB",
            "text": "This cozy place made me forget about the chill outside! Dim lights, and quirky decor made the place pleasantly homey. The staff were very attentive. The bruschetta had mushrooms and was so fresh and creamy! The purple tulip was bright, colorful, and tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxNkxpQ2RBEAE",
            "text": "Great experience! Saba was amazing.  She suggested an appetizer and I loved it. I was traveling solo and she made me feel right at home. Saba seriously deserves a promotion! To top things off the pizza was wonderful. Great ambience with fast service. Highly recommended. I’ll be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbHN5ZDV3RRAB",
            "text": "What a great place! Situated in the Luma Hotel in Times Square, it has a modern sophisticated look.  It just recently began serving lunch so it wasn't that crowded (although it was a Wednesday) but I expect as word gets out it will so definitely make a reservation. The lunch menu was fairly limited but has enough of a variety for everyone. We started out with a paloma cocktail which was excellent.  We had the funghi pizza as and appetizer which was delicious.  The focaccia sandwiches are also excellent. Their focaccia is made right there.  For dessert we had vanilla gelato with saffron honey which was outstanding.  There is fixed price option which is a good deal although we didn't opt for it. The service was great - our server, Katie was fantastic and the rest of the staff were very friendly and attentive."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdkp5cFZBEAE",
            "text": "I was skeptical of AperiBar as the “hotel restaurant” when I was staying at LUMA. I really enjoyed my meal, including the bolognese pasta with a lovely Chianti and the Zafferano for dessert. The atmosphere was comfortable, not too loud,…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiXzVHUUd3EAE",
            "text": "I really enjoyed this restaurant! It was the perfect place to go after enjoying a matinee on Broadway. There’s a very hip bar scene in front and a nice quieter table top restaurant in the back. I ordered three appetizers and they were delicious. The staff was very friendly and  though a little weighed down because of some big parties, they were attentive to my needs. I felt lucky to have found this little gem."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUc2Z6REpnEAE",
            "text": "Food is ok, I guess the expectation was high. Service is super slow, took almost 45 mins for our order to arrive. Vibe is chic. It’s is small place though.\nWe ordered Arancini which is Antipasti but arrived after half of our main course was finished. For mains we ordered Pollo Arrosto and Creste de gallo al limone which is chef recommended, but only lemony flavor was dominating."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ei12TThBRRAB",
            "text": "We had a wonderful pre theatre dinner at AperiBar tonight. Service was exceptional and signature dessert from chef is to die for! Will definitely come back for that strawberry panna cotta :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bTZtSl9BRRAB",
            "text": "Had a great time! The cocktails were expertly crafted and the appetizers were delicious. The staff were friendly and attentive, and I really enjoyed the vibe of the bar—inviting and stylish. A fantastic spot for a relaxed evening out"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIZ0lUaFNBEAE",
            "text": "Today in Manhattan I was craving a great NYC Pizza, just a block from Bryant Park on W 41st I noticed AperiBar NYC in the lobby of LUMA Hotel Times Square and I'm beyond happy I stopped in.\n\nUpon entering I smelled their fresh cuisine and especially fresh pizza being made inside. Then when learning this chic Italianesque Restaurant & Cocktail Bar is one of the many successful nationwide Restaurants owned by American Chef Charlie Palmer including the Famous Charlie Palmer Steak IV also in Times Square I had a feeling a delightful Pizza would be presented.\n\nI went with their Fennel Pork Sausage, Tomato, Onion and Fresh Mozzarella Pizza accomponied with a unique glass pourer filled with Mike's Hot Honey. I was recomended to drizzle some on the crust and I'm happy I listened. Watch my great drizzle application! People who know Pizza should be able to see the amazing Crust and quality ingredients.  Let me assure you the taste was heavenly.\n\nI also was very impressed with their custom specialty cocktails and had a \"I Need That\" Gin, Rosemary, Cucumber, Lime.\n\nI cannot wait to go back and enjoy their cuisine and was advised their fish is beyond fresh, imported from the Seas of Greece!\n\nAperiBar in Midtown/Times Square Manhattan has been Strongly Recommended by Johnny C The Pizza Guy! Katie was also amazing and being from NJ was an added plus! Also, if your taking the bus to or from Port Authority it's an 8 minute walk on 41st."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQMHYtcklnEAE",
            "text": "Our server, Sava, truly went above and beyond to make our dining experience exceptional. Her attentiveness, friendly demeanor, and genuine care made us feel so welcomed and well taken care of. On top of that, the food was absolutely delicious—every dish was prepared to perfection. It was a memorable meal, thanks to both the incredible service and the outstanding flavors."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUd291MkdnEAE",
            "text": "This meal - service, ambiance, and price - was my best in 4 days in NYC. At 15% of the price it rivaled a Michelin star meal across Manhattan. Will be back. Every. Single. Time. Thanks @Katie and Team."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWbVlqZ3dBRRAB",
            "text": "Best experience here for my engagement dinner. The staff and Charlie were so amazing and thoughtful. Our server Saba went above and beyond and this was our most memorable experience in NYC. Would highly recommend it! The food is insane and sooooo good and the service was impeccable. They made our night."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6aXBTRVpnEAE",
            "text": "After expending a very busy day on the very crowded and noisy Manhattan, I have in AperiBar a peaceful, sophisticated and lovely experience dinning. Thanks to the chef Vasiliki Vourliotaki  for not only taking us into a delightful culinary experience but also into an intelectual one, I had learn about different taste and sensations of tuna depending not only on the receipt, but the cut, the type, the age and more. Also special thanks to our waitress Kenzie, who gave us a very pleasant time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1dHFucXl3RRAB",
            "text": "Great atmosphere, you can really enjoy eating here. Excellent service and very delicious food! Loved the 4 cheese pizza and citron espress cocktail! Will definitely come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqd3JENVRBEAE",
            "text": "I recently had the pleasure of dining at AperiBar, and I must say, it was an absolute delight from start to finish. The atmosphere was inviting, the food was exceptional, and the service was top-notch. What truly stood out were the amazing ladies, Yana and Sadie, who ensured that every aspect of our dining experience was nothing short of perfect. Additionally, the hostess, Saba, greeted us with a warm smile and ensured we were well taken care of throughout our visit. I can't recommend this place enough – it's a must-visit for anyone looking for a fantastic dining experience!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVlprUmpkVU53VERWNlNtOHpUblUxVUZKWGNHYxAB",
            "text": "My mom and I stopped by here at the end of a day trip to the city. It was such a nice laid back vibe and a great break so close to time square. Omar was our bartender and was amazing! He was super friendly and great to talk to."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcFA2ZEdBEAE",
            "text": "Booked for a group of 15, we decided to bring our work team here to celebrate us being all together in NYC.\n\nI was positively surprised by the attentive and kind staff, the quality and variety of the food and, finally, the flavours: my favorite are the pizza Margherita,  the pasta with burrata and the torta tenerina. As an Italian myself, I felt home.\n\nIt was so good that we made boxes to take away the leftovers.\nWe agreed on a specific menu beforehand, so once we arrived, the staff was ready to serve us with starters and drinks.\nLove the atmosphere and the view on the kitchen.\n\nI would return and I recommend this place to everyone."
        }
    ],
    "reviews_count": 77
}