{
    "name": "The Flatiron Room Murray Hill",
    "place_id": "ChIJHweSsgBZwokRloB86aLgrzE",
    "grid": "MN6",
    "address": "9 E 37th St, New York, NY 10016, USA",
    "rating": 4.5,
    "user_ratings_total": 1183,
    "phone_number": "(212) 725-3866",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ablkyZ3dkM2hvTWxSbmNucHlPVUUxTXpkblgyYxAB",
            "text": "Somehow we ended up with a rez here on a Sunday night after reading a list online. As out of towners staying in a nearby hotel, it looked promising.\n\nProbably should have left when we arrived as the vibe was off. In retrospect it was quite telling.\n\nOk so *Maybe* if we had a cocktail, this would have been a different story. The drink menu looked promising. We sat near a wall of glowing alcohol lockers for different patrons.\n\nHere's the run down of our dining experience:\n\nParker house rolls - not fresh, not homemade, not even a good excuse for eating bread. Skip!\n\nSushi roll - this is a restaurant that serves sushi,  but not a sushi restaurant. The rice was squashed together in a thick mat-- like a grocery store roll. The fish and roll itself was not cold, which I found off-putting.\n\n\"The risotto you'll dream about\" - misleading name. Not the meal I envisioned or something I would look forward to again. Surprised to see the arbrorio rice surrounded by a pool of cream sauce. You mixed it in yourself. One bright spot- the variety of mushrooms.\n\nThrilla in Manila - fettuccine in a bowl with a fistful of herbs, a few mussels, and Thai coconut sauce on the side. Presentation, flavor and components were off. My partner was not happy with his meal.\n\nService was fine. Many water refills. We arrived at 7:30 and moments later the 3 piece jazz band took an extended break."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tScFNGUnVaMVZ5ZDJ0Nk5WTm9OSFZFYmw5UVJtYxAB",
            "text": "Really incredible food, atmosphere, live music and service!! Will absolutely return."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sa1RGUTRkVFZDZW1FMVpHNW9RbmhhV1dGaVJXYxAB",
            "text": "Food was great, service was great, and the vibe was great (live music). The only reason it's not 5 star is the music was so loud we couldn't have any conversation at our table. It's a sit-down restaurant, so when the trumpet/sax started going, all conversation stopped. Don't get me wrong, they were really good, but it did detract a little from the experience. The loungue-style singer when we first got there was the perfect volume."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Zd01UZzVWWE00Y0hvMFV6RmhNSFZOVUVOTWRHYxAB",
            "text": "Great spot. How did you guys get the immersive view filmed?"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RFRraENRalpLVFdWcWJVRnZiMUYyVjI5RE5rRRAB",
            "text": "Great atmosphere and friendly service. Cozy with good live entertainment."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205UWVFbEpSSEZyZUVkWmRrRkZaVFo2YmtaVFRGRRAB",
            "text": "Nice place with good live music, our team enjoyed this place!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21weFVWRkxlbFZvVm1SelUwUk5WRk5NUVc1Q0xWRRAB",
            "text": "I was here for a work event in October 2025 and overall it was a good experience. The restaurant had been commandeered and there was probably 50 or 60 people in our group - there was plenty of space and it was comfortable to mingle and interact before dinner.\n\nThe meal was a bit odd - everyone had selected appetizer and entrees in advance but what was brought to the table was more like sharable plates, which in the case of our table did not align with what we'd pre-ordered. E.g. at a table of four, three of us ordered Option 1 and one person ordered Option 2 but they just brought 2 of each and it looked like we were meant to share. And the server didn't really explain about this. Overall it was not a big deal, just a bit confusing and then felt like some of us went a little hungry.\n\nDessert was amazing. Very delicious.\n\nI gather from the other pictures and reviews it is quite a different experience when the restaurant is open normally to the public."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvNWJuQkJjRjlQWjJ0ZlIyVkVWQzFoTkdWaUxXYxAB",
            "text": "Lively jazz entertainment with wall after wall after wall of drink varieties! Make a list, try it all. It was an absolutely memorable evening."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SbVF6bHZRelV5YlRGd1VIaDZjVTR5UlVObVQzYxAB",
            "text": "I had such a great experience at this restaurant! The food was amazing – especially the steak, which was cooked perfectly and full of flavor. The drinks were just as impressive, and paired really well with the meal. On top of that, the live music created such a fun and lively atmosphere. Overall, it’s the perfect spot for a night out with delicious food, great drinks, and entertainment all in one place. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxeFpYaFlVV3RwU2tZNFZGcHdYMHhJWVVOQ1IxRRAB",
            "text": "Great drinks, food is OK, atmosphere is A*\n\nBe ready to spend $$$ though."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONVltOUZUMmhvUW1WUU0yUllkRWxsWkZoalEwRRAB",
            "text": "Everything was amazing; customer service was fantastic, food and drinks menu was excellent and the atmosphere and entertainment, wonderful. Will definitely recommend and return there."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NU1UTmplVk5WVTBkMVN6UjFXVVpUV21KdVZHYxAB",
            "text": "La música espectacular! El sushi delicioso"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJdGQzQmlkM2hHY1ZWdWFITldabU5hUjFwS1pWRRAB",
            "text": "Service and ambiance was great, strongly recommend for good live jazz entertainment, great old fashions, and short rib. If I go back I’d request the booths, they are nice back from the stage and good view."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWVNuaEhiemRVTVZoMmNIVXpZUzF3YUhaM05WRRAB",
            "text": "Had a great time with a smash burger, California cab, and a blues duo with a guitar and harmonica (on a Wednesday night!). Will definitely have to be back. Perfect place after a day full of meetings."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVk5rZG9NMHQwTm1kVlF6UkZXWGhDYTNKdFUyYxAB",
            "text": "My husband and I went to The Flatiron Room Murray Hill for our anniversary, and let me start with the good: the live entertainment—Mariella Price and Eric Zolan were phenomenal. They had the whole room charmed with jazz/pop covers, solid sets, and audience requests. Honestly, they were the heartbeat of the night.\n\nNow for the food and cocktails…terrible. I ordered the chef’s tasting menu thinking, “This must be the showcase of the chef’s pride and joy.” Instead, it felt like Tuesday-night leftovers dressed up for company.\n•\tAmuse bouche: The coddled egg was rubbery and overcooked, overshadowing the trout roe.\n•\tThe beet tart was pretty on the plate, but sweet beets atop a sweet pastry—no contrast, no spark.\n•\tThe sushi was fine, but just that—fine. Fresh fish, zero magic. Temaki duo, no mucho.\n•\tThe main course chicken tasted and looked like it came out of an Ikea food court. Don’t let the name fool you GOCHUJANG CHICKEN ROULADE - Bland, soulless, no chef’s kiss in sight. I’ve had microwave dinners more exotic and tasty.\n•\tDessert, the panna cotta, tasted like it had been sitting in a hospital cafeteria fridge. Sticky, tough strawberry layer, flat panna cotta. Definitely not the delicate sweet ending I was hoping for.\n\nMy husband ordered the NY strip steak which was cooked just right, however the chimichurri was overpowered with oregano which overwhelmed the steak.\n\nCocktails were pretty to look at, but style over substance. The smoking old fashioned was all bitters, no balance. Smoke & mirrors.\n\nCredit where it’s due: Shells and bone were 🔥the escargot and bone marrow were rich, savory, and hit the mark.\n\nAfterward, we wandered to the NoMad location—where the staff was warm and inviting, and honestly the food coming out there looked like it had much more love and creativity than what we were served in Murray Hill.\n\nBottom line: The music was the soul of Murray Hill. But the food and cocktails? Let’s just say they didn’t sing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wS1NqTTVRVmsxVnpWRFpUVnVUbVpmV1RZMUxXYxAB",
            "text": "Just went for cocktails. Great bartender, HUGE whiskey selection."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KclRHTTJjR2M0VW1kTk0zbzBRbFpEYURaRWRWRRAB",
            "text": "Disappointing. Huge let down. Look at how many reviews give this place a low rating. There is something to that. Don’t be mislead by the name “Flatiron Room,” they may put fancy garnishes on their plates and cocktails - but the food is terrible and poorly executed. The cocktails novice at best. Rude and disrespectful staff.\n\nNYC is rich with places with passionate chefs and mixologists - Don’t waste your time and tastebuds here - go up a couple of blocks to The Raines Law Room instead, or hit the roof at 66 Park, or head over to NoMad.\n\nConsider yourselves warned."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWeGQzWXdheTFsUmxOVmVtWlBjMEZ2YjJveWMwRRAB",
            "text": "Just went here with my husband for a drink and both of our drinks were terrible. I'm sorry but for 23 dollars a drink they should hire a bartender who knows what they are doing. Please stay away from this place if you are in the mood for a good drink!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaN3NPcDVBRRAB",
            "text": "I wandered in after a long hard work day and this place really fit the bill. I have a couple old fashioned recipes I make at home and I age my own spirits to make them. I'm frequently let down ordering them out but not here. The selection of whiskeys is mind blowing. Whatever your budget is, you're going to find something you like if you're into whiskey.\n\nThe food was not an afterthought either. I always order more rare than I actually want because most places overcook. The chef here is on their game and cooked it exactly how I ordered. This place may become a tradition of mine when I visit the city."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOcWNuRjRiVWxNUTBWNVExVndYelp4WDFWck0zYxAB",
            "text": "Go for the great Drinks (Caviar Martini), live music."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vM1VGSjVXVFJaT0VwNmFrbEdVM042Ym14dGJVRRAB",
            "text": "Everyone I encountered (servers, bartenders, hostess) was great. They made me feel so welcome! Food was delicious. Live music was excellent. Truly a 5-star experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGbGJGaFRUVTVhTFhOc2VqRnljbUZLU2pWeU4yYxAB",
            "text": "Amazing atmosphere the music is fantastic and the food is just as good. Great for date night or if u love music."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKb05XZG5kbWxZYWxkak5Yb3laM2h3U0RreVVHYxAB",
            "text": "We came for the restaurant week, the food was regular, nothing impressive and portions were tiny (my main dish on the picture) . The drinks were tiny too with bunch of ice in them. Music was boring. Service was great. The seating is very scattered and half of the seats are facing back towards the stage, not convenient"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TlRsbG1lVTVrU0d0cFgwaERVRTFMTnpCSlkxRRAB",
            "text": "The service there is top; you can find all the rare whisky here; highly recommended"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWS05WVlJlVXhEZEUxVU1XVnNObWxzV2xWdFMyYxAB",
            "text": "The overall presentation was divine.  A very warm and courteous welcome.  The staff were lovely and kind.  The food was quite good.  Happy hour drinks were reasonably priced.  The live musicians were delightful.  All in all, 4.3 out of 5."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGWVkydG5ZbE5FVmtRMk4yc3dkMmg2YWxZM01tYxAB",
            "text": "Very highly recommended…….\nEverything was excellent\nTonight’s band (Moses Patrou Duo) (7/27) was amazing….my new “happy place” off Times Square\nPlease go….."
        },
        {
            "date": "3달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200NVlUWkRNM2d0V2xaQllUSm5aV3BJUzJoQk0xRRAB",
            "text": "On a choisi ce restaurant à la base pour la musique; la nourriture y était très bonne.\nl'accueil a été chaleureuse; notre serveur était très poli.\nLa carte des rhum et whisky est juste incroyable; avis aux amateurs, il est impossible de réussir à choisir."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoeVRWaGhlWGgzV0RGME1HTkdWRlUzVDBNd1pIYxAB",
            "text": "High-end, discrete, cocktail bar, with  speakeasy feel. Live jazz band Friday night, amazing cocktails. Private room available, but main room layout affords privacy."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSb2NsbFZNRmRFTkVKcGMyRmplbVpJUmpKRE1sRRAB",
            "text": "I work around the corner and take friends and family any time I can.  Iconic venue that takes you back in time to roaring 20s."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUFZUSjNja04wYkhsdWVHRlhOVE15YjFSaE4zYxAB",
            "text": "The Jazz Trio was absolutely delightful!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KMVJsaGxSblF6YVhKcFNWZFRlVzV1WVVoWWRVRRAB",
            "text": "Loved our experience! Sat at the bar, Michael the bartender was so helpful in walking us through the cocktails. He made  specialty drink for my wife and he recommended a whisky flight for me, which I loved. The music wasn’t our favorite but the drinks and experience were spectacular!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dFpYQnZlRFZtTUVSeWF6ZENSMjVrUjFaM1JWRRAB",
            "text": "I had a great time at the flatiron room! We sat at the bar, and our bartender Michael was extremely knowledgeable about whiskeys and he helped us pair some wonderful Bourbons with our dinner. The food wasn’t the best I’ve had but the service from Michael and drinks were spectacular!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKVFprbHRiSGhqVTNweGJqUXhMVzgwZUhOeVZrRRAB",
            "text": "The service was beyond amazing , we ordered a few big dishes to share , our waitress was so nice , she moved the empty table next to us to give us much bigger room for the food , and she even brought two glasses of champagne free of charge for our deserve, the food was amazing also , we have been to so many nice restaurants in NYC but the flatiron room truly stands out for its food, service and overall atmosphere . Will definitely come back very soon again ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTWRIQkliMHhmUVhkS2REaEhUa2t5VEcxSk4xRRAB",
            "text": "I had the pleasure of being attended by Marlon. This was my first time with a friend, The service, atmosphere, and music was very calming and I enjoyed my experience here. The bartender recommended ideal husband. It was a great recommendation. Food was great too."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GUlJVTnJSbmhxU1ZaV1VYcE1PRWhJYzNadWExRRAB",
            "text": "Class. Live mystic in wednesdays a great touch. Pizza martini was my favorite!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwbk0yUndRblpqTFd0dFkxVk5iVWRhV1dSM1JFRRAB",
            "text": "Excellent high class restaurant and special bar featuring top notch live music in an elegant,  romantic setting.  Fantastic experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rM2VUa3lkMDQyUldsNlVUaHhOekp5YVZCUU1FRRAB",
            "text": "Very wide selection of whiskey; they serve very good food too; the service is amazing there, especially Greg, impressed us a lot for his expertise on whiskey"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGTFQyUnNTUzFmYkhac1MxSlFaVlo0ZUZBeFNWRRAB",
            "text": "We had a wonderful time at The Flatiron Room – Murray Hill. Due to a scheduling conflict Saturday night, I called after hours, not expecting a response — let alone a personal invitation to return from their General Manager, Vasyl. That kind of hospitality set the tone for what turned out to be a fantastic experience.\n\nTheir drink menu is massive, and the food we ordered was brilliant. Our server, Erin, was incredibly attentive and even suggested some alternatives to our original drink choices — which turned out to be phenomenal!\n\nI fully expect to return the next time we’re in NYC!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsUlIybEtRbFpwZUdGbE5ETk1PRU40YTFaa1ozYxAB",
            "text": "I was invited over for my birthday celebration with a free dessert. Erin with the assistance of Zaisha made my experience so memorable and exclusive that I am truly grateful for all the kind gestures offered by the restaurant and will definitely revisit more often for more amazing date nights! Also, please try the chocolate cake with a molten dome! Love the presentation!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sdFdGRTJZMUJ6Tm1Od1owTXRhSFoyUm5oaU9FRRAB",
            "text": "Honestly one of the top 5 meals and bar experiences of our lives, and we've eaten at some of the best 3* Michelin restaurants so very very happy to return and highly recommend the flatiron room!! Delightful staff across the board, thanks so much for a wonderful evening."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMTHI3TkNOcXRYc3BBRRAB",
            "text": "We had such a great time at The Flatiron Room! The Chef’s Tasting Menu was amazing, every dish was so tasty and well done. The chef even came to our table, which was really nice and made the night feel special. The servers were super attentive and made sure we had everything we needed. The drinks were also great so refreshing and delicious! We also really enjoyed the live jazz music.  Highly recommend this place!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMbjc2N2JkMVlqUVZ3EAE",
            "text": "We had a wonderful evening at The Flat iron room celebrating my husband's birthday. We were sat right in front of the band and thoroughly enjoyed their performance. We chose to start with cocktails and a charcuterie board. The charcuterie board blew us away, it had a great variety of cheese, meat veggies and fruit. Service was well paced and we never felt rushed. It was impressive how the servers were able to get to everyone without disturbing others around while the show was going on. We had some sushi, the chicken roulade and risotto for main course - each dish proved to be divine. The portions were perfectly sized, we were full leaving but not \"over full\". We are looking forward to our next trip to the Flat iron room."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQR040Sk90MnJ6SGlnRRAB",
            "text": "The gochujang chicken roulade was way above my expectation!\nThrilla in Manila and Nigiri Combo was just okay-ish.\nGreat atmosphere with nice music :)"
        },
        {
            "date": "5달 전",
            "language": "pt",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VMbTl5TV9RdjZHY01nEAE",
            "text": "Eu tive uma experiência muito desagradável nesse final de semana.\nNos acomodaram em uma mesa na qual não era nem para existir este assento.\nNão faz nenhum sentido, uma mesa sem nenhuma visibilidade do show e nem do restaurante. A mesa é praticamente o canto do castigo. Uma falta de respeito absurda, considerando pagamos pelo couvert com prazer de assistir a uma apresentação, eu não me incomodaria se pudesse ver pelo menos parcialmente. (Haviam mesas disponíveis e mesmo falando com a host ela insistiu que sentassemos nesse local por 30min ate que a primeira parte do show terminasse)\nO atendimento do garçon foi impecável, tomamos um drink e me senti desconfortável, desrespeitada e preferi ir embora.\nInfelizmente."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJNnBrdXJxX3BQRERBEAE",
            "text": "Touted as one of the best whiskey bars in the world, and I'd bet that's right. I had a flight of 6 whiskeys from around the world and a 7th that was just insane. The food was GREAT (best escargot ever). Non stop live entertainment. Excellent for a romantic dinner or night out with the men. Cheers!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJNkl6dl83LXVuak9nEAE",
            "text": "The jazz musical performers were excellent, the decor and vibe are sultry and warm, and the staff were quick and attentive. Couldn't recommend more!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQckMxZkxPNGI3MHlBRRAB",
            "text": "Amazing experience and delicious food !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOWGJoSVBwa29TVktnEAE",
            "text": "The best bourbon place with great jazz music!  The food is great and the drinks even better!  You must get the Dome for desert!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNdWVmT0FREAE",
            "text": "Magnificent place,awesome Jazz,awesome staff,amazing drinks.\n\nREVIEW UPDATE MARCH**** 30 2023\n\nI went lastnite hoping for the same experience I had when I first visited this place ,My “Hostess “ was super nice ,helpful,educated and kind ,we had reservations at the bar because everything was booked we arrived 30 minutes earlier our “Reservation” was for (8 :00 PM )and he was kind enough to sit us on the “Left Entrance Booth” and told us that there was a chance we would need to share the table we were fine with it .\n\nMy “waiter”arrived promptly also very nice professional,educated ,handsome ,blond ,tall he delivers the service as he should and we were expecting although “The Dressing” was not never sent for my salad , he kindly gave me options for it brought it ,just to let you know the “Cup”for my dressing was chipped on the side! (That’s an issue for health and sanitation) and checked if we neither further assistance we tried to change tables because we wanted to see the “Stage” but then decided to stay in the same spot we then orderer another bottle of wine ! I noticed there was this man with a “Blazer And Tie” (Blue Stripes And Yellow strips)I believe he was a “Manager or Supervisor “ looking at us sitting at our table in a very “NASTY WAY” and going around and looking again ,again ,again ! We had our table with food still ,we then ordered a “Cheese Board” because my partner didn’t want to keep eating his “Raviolis” and like I mention another bottle of “Wine” I keep seeing this man coming again again harassing me ,my partner and my table with his “NASTY LOOK”and going over to my “Waitress” and asking him about my table ! There was nobody waiting the place was pretty much already with availability due to the fact the brought a band that was playing “Blues” country and some other stuff ! Which is not really why I went there I went there for the “Jazz” and people were just leaving because they didn’t like the music at all!there was a couple (Caucasians Females) next to us when we got there they were having dinner ,they didn’t have any bottle of wine just a glass who pretty much was empty from the entire time till I left ! We arrived at (7:30 PM and Left at 10:30 PM)nobody was asking them anything or offering anything else besides “Tap Water” of course I’m (LATIN And MY PARTNER IS KOREAN) what a coincidence!\n\nI was there and he never looked at them the way he was looking at us! He never asked them or anybody about them! The problem was with us ! I felt so bad and harass that I didn’t finish my wine and we decided to leave.\n\nWhen we come outside I sit at the couch and my partner is trying to take a picture of me in the “Couch” the same guy once again starts looking at me with this “NASTY LOOK” he goes and talks to the “Hostess” ,I felt so uncomfortable that I decided to stop and just leave I was aggravated! The “Hostess” asks about our night and I tell him what happened with the guy he was actually talking to he says : “ Oh Honey do not let anyone ruin your night” I told him nobody would but he did enough for me to feel uncomfortable to the point that we decided to leave ! The “Hostess” was rushing me “Good Night” and I soon as I go out I see the guy coming back at him and whispering what just happened , I had no idea this place would be hiring a (SUPERVISOR/MANAGER) who is a “RACIST” but thanks now I know and everyone else will too!.\n\nI also added my “Super Happy Pictures” while having a great time! 🙄"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPcmM4SWVsb3MtQ0xREAE",
            "text": "Sitio agradable, muy bonito, cena correcta, música en vivo de calidad a un volumen muy adecuado para disfrutar de la cena y de la música a la vez."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZOE9hWWhnRRAB",
            "text": "음식, 칵테일 맛있고 가격도 괜찮은 편입니다. 시간 맞춰 간다면 라이브 공연 들으면서 천천히 브런치 즐길 수 있는 장소."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NHJYV0V3EAE",
            "text": "두군데 있어요 헷갈리지마세요"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZN3ZTN2FnEAE",
            "text": "What a fab find in NYC! Great food,service and live music-Moses R&B band were amazing-we have downloaded his album  to vibe to when we return to London.\nThe place is very cool with a great  atmosphere and ambience.\nWe had the chefs tasting menu which was excellent.We were over from UK celebrating our anniversary-loved our evening and they bought us a complimentary glass of fizz.\nHighly recommended if you are looking for special night out with live music .Thank you to all the team ."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOWVqbFdREAE",
            "text": "We had an amazing time indulging in the Chef’s Tasting Menu at @flatironroom! For just $95 per person, you get a carefully curated menu crafted by a Michelin-Starred chef, paired with an incredible live music experience. 🎷✨\nWhether you’re planning a  date night or just looking for a great spot to dine and unwind, this place is a must-visit! It is a fun and exciting spot. The ambiance, the flavors, and the music come together for a truly memorable night. 🎶🍷\n\nChef’s Tasting Menu $95 pp\n🥚Amuse - Bouche : coddled egg, trout roe, milk bread, dill served with vegetables tart\n🍣 Sushi Course : Temaki duo\n🍰 Palate Cleanser : Chef’s selection\n🥩 Main Course: Choices of Chicken Rolade, US Prime NY Strip 8oz, Thrilla Manila, Agedashi Tofu\n🍰 Desserts : assorted dessert bite platter"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnaG8tUXBRRRAB",
            "text": "Old School American Restaurant with Live Music. Their Whiskey collection is impressive and cocktails were well-balanced and tasty with non-alcoholic options. Food is typical of an upscale NYC restaurant.  The Beet Salad is phenomenal. The desserts were really good recommend the house ice cream and Chocolate Cake. The service is very attentive and quick. Food came out on time and perfect temperature even though our party was eating at different speeds. The Music created a beautiful ambiance and some Jazz numbers perfect for Valentines day. Overall a great experience for date night."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRaTdDM2JnEAE",
            "text": "Three visits a week, and somehow, it’s still not enough.\n\nThe jazz? Smoother than my best pick-up line.\nThe cocktails? So good they should come with a warning label.\nAnd the ambiance? Let’s just say time stops existing the moment you walk in.\n\nEvery detail here exudes unique charm,\nEvery sip, every bite, every note of music feels like a cozy embrace from an old friend who always knows exactly what you need.\n\nMy friends are obsessed, and honestly… I think one of them is secretly planning to move in here…\n\nAt this rate, I wouldn’t be surprised if The Flatiron Room gave me my own hand-carved table with my name on it—or at least a VIP punch card🤭\nSee you again (probably tomorrow)👋"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQbmRqbjd3RRAB",
            "text": "My experience here was one of the highlights of my NYC visit! I enjoyed a Thanksgiving dinner with my mom and sister, and it was truly unforgettable. We had a five-course fixed menu, and every dish was thoughtfully crafted and absolutely delicious. The staff went above and beyond to ensure we had an amazing time – they were attentive, kind, and always cheerful. The drinks were exceptional, and the live band added a perfect touch, creating a warm and inviting atmosphere. I highly recommend this place!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmZ1BUMFhBEAE",
            "text": "I came to Flat Iron Room in Murray Hill with high expectations, but unfortunately, it didn’t live up to the hype. The space was surprisingly small, and the menu was very limited.\n\nWe decided to try the tomahawk steak, but it turned out to be a huge disappointment—around 70% of it was just fat. For the price they charge, I expected a spectacular cut of meat, but this was unacceptable. Even worse, the steak cost $200, and it didn’t remotely justify the quality.\n\nOn a positive note, the $18 fries were actually good, but let’s be real—when the main course fails this hard, good fries don’t make up for it. The aesthetic of the restaurant is nice, but the cramped space and disappointing food overshadowed that.\n\nMain course: 1 star. Do better."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuczVUYnpBRRAB",
            "text": "I eat out a lot, and I truly think this is hands down the best dining experiences I have ever had in my life! From the moment you walk in, the restaurant has a breath taking ambiance and has an amazing vibe to it. Beautiful place to just sit back and relax and take pictures.\n\nOur server who went by Mo, was beyond excellent, he was very funny, attentive and well informed on the menu and stayed very professional. His service truly made our night so much better and it was very appreciated. Thank you Mo!!\n\nThe food was beyond amazing!!! I got the sautéed mushrooms and the Angus strip. The steak was so tender it basically melted in my mouth, and it was just the right amount for one person. Truly beyond amazing and tasty food. The hosts were also kind enough to take our bags from us and charge our phones.\n\nAmazing staff, amazing food and amazing ambiance. 10/10 would recommend!!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfZ19iS3FnRRAB",
            "text": "I cannot recommend Flatiron Room enough. The moment you walk inside you are greeted with the with a smile from the hostess/coat check. Walking to the table we couldn’t stop looking at the the amazing ambiance. The whole room has a vibe that makes you want to get comfortable, relax, have an amazing cocktail and enjoy the amazing talent. The music isn’t annoyingly loud so you can actually have a conversation. Our waiter Mo was absolutely wonderful. He walked us through the drink menu and food options. His recommendations were spot on. Thank you for a memorable night, Flatiron!!!! See you next time, Nashville"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MU0yUktBEAE",
            "text": "Everything was great but the music really made this an exceptional experience. We were just in town for a short visit but I would go back again and again if I lived closer!  We had the shrimp and pasta, a few cocktails, the rolls, the octopus and broccoli and a few other dishes I can't remember but we all enjoyed our food. The sphere dessert was delicious and fun as well."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMGFIMF93RRAB",
            "text": "Amazing ambience, especially given the fact you can probably walk-in for live jazz/blues at dinner. Rare in this part of the city. Ordered the truffle fries, charcuterie board and wine. Expansive spirits menu, over 20 pages long! Fries were average, but the meats were good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwOU1lY3ZnRRAB",
            "text": "Upscale restaurant with a great live stage in the middle for jazz performers. This place is one you’ll remember by the professional yet comfortable atmosphere.\n\nWent here during the 2023 NYC restaurant week and did their select 3 courses and drink pairing. Overall was a great experience and would suggest this as a good place for celebrating something fancy.\n\nThe food was unique, nothing earth shattering delicious but consistent and good. The drinks definitely come with presentation and are quite delicious as well.\n\nThey offer a massive amount of liquors, mainly whiskey, but a lot of unique items you may have difficulty finding other places or even by yourself.\n\nCome here for an experience and enjoy the live music. Keep an eye on how much you order though as the prices do get pretty heavy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3NkpTbGl3RRAB",
            "text": "I recently had the pleasure of dining at The Flatiron Room in Murray Hill, and it was an absolutely delightful experience. From the moment we walked in, I was captivated by the warm, inviting atmosphere and the attention to detail in every aspect of the decor.\n\nThe service was impeccable—attentive without being intrusive, and the staff were knowledgeable about the menu and the extensive selection of spirits. The live jazz music added a wonderful touch, creating a sophisticated yet relaxed ambiance that made the evening truly special.\n\nThe food was exquisite, with each dish thoughtfully prepared and beautifully presented. The flavors were rich and perfectly balanced, making every bite a joy.\n\nOverall, The Flatiron Room offers a unique and memorable dining experience that I would highly recommend to anyone looking for an elegant night out in Murray Hill. We will definitely be returning soon!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneHRLR25BRRAB",
            "text": "Valentine's dinner out in New York is traditionally a tough one to secure a reservation and to have executed well. However, The Flatiron Room @ Murray Hill has a leg up on most due to the decor, low golden lighting, magnificent fireplace and, our night, terrific jazz trio playing so many familiar tunes from the 40s (and reminiscent of so many film scenes). The cocktail menu was creative, elegant and delivered on the promise of a superior drink that was visually stunning (\"Garden of Eden\" in particular).\n\nI'd preordered the seafood tower for 2 and the \"chocolate sphere\" (which was excellent) but otherwise our selections were from the Valentines pre fixe menu. The peekytoe crab cake was crispy and delicious. My wife had the yellowtail crudo which she found delightful. She followed that with pan seared Chilean sea bass that also impressed her. I had a medium rare NY strip steak with a small roasted squash filled with very smooth mashed potatoes...but, unfortunately, everything on my plate was room temperature when it arrived. Nothing like room temperature potatoes to bring back memories of a lunch line. The steak was cooked properly but I found it a bit chewy with a copious amount of unrendered fat. The chocolate sphere was dramatic & delicious with a touch of raspberry with the thin chocolate cake and ice cream revealed beneath the dome melted with molten chocolate before your eyes. Great presentation matched by the flavor. The raspberry sorbet was yummy too.\n\nOverall I think The Flatiron Room succeeded on a night when most serve disappointment. I'd recommend a visit."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNl95WmhRRRAB",
            "text": "We had such a great time! Everyone we interacted with was kind and helpful, and on top of everything. The food and drinks were really fantastic. The mushrooms in particular were phenomenal! The music—Peter & The Master Keys—were great as well. So talented. Overall a great atmosphere and perfect place for a night out."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbDkzZjd3RRAB",
            "text": "The Flatiron Room is an absolute gem! From start to finish, my experience was nothing short of amazing. The food, service, and ambiance all exceeded expectations. The live jazz performance that night added a magical touch, with talented musicians creating an unforgettable atmosphere.\n\nThe food was outstanding! We started with the Oysters East/West Coast, served with a perfect mignonette and lemon — fresh, briny, and a great way to kick off the meal. The Bourbon BBQ Meatballs were tender and packed with flavor, with the smoky bourbon sauce taking them to the next level.\n\nFor mains, the Spinach Tonnarelli was divine, with colossal shrimp in a light garlic, white wine, and lemon sauce that brought out the freshness of the ingredients. The Burgundy Braised Beef Short Rib was melt-in-your-mouth tender, paired beautifully with the carrot purée, broccolini, and a rich burgundy wine demi-glace.\n\nThe service was impeccable — attentive and knowledgeable, making the entire experience seamless and enjoyable. The ambiance, with its warm lighting and the sounds of live jazz, made it the perfect place for a special night out.\n\nI will absolutely be back and wholeheartedly recommend The Flatiron Room to anyone looking for excellent food, stellar service, and an unforgettable dining experience."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRd1p1c1R3EAE",
            "text": "Live music while having dinner is always a nice way to spend an evening. Food was great. Waiter was awesome, only downside was the host which is a pity as it’s everyone’s first impression of the restaurant."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBczhhMFdnEAE",
            "text": "This charming restaurant was the highlight of our long weekend in NYC. We selected it after seeing reviews, exploring the menu, and seeing that they have live music nightly. We were delighted to see on the entertainment calendar that Brian Newman was playing and made a reservation immediately.\n\nWe started with the charcuterie board and cocktails. The Blackberry Gimlet was delectable! We also had the Chicken Roulade and Flatiron Smash Burger before finishing with The Flatiron Room Sphere. Wow! What a great place for locals and those wanting to feel like a New Yorker!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKLXBPOXVnRRAB",
            "text": "We went here last November for one of my friend’s birthday dinner. It was about 10 of us and we picked out a pre-fix menu so all the food was family style. The crab cakes were delicious, the burrata salad as well. The gnocchi with mushrooms were over cooked so they weren’t the clouds of fluffiness that I expected. The steak was delicious though and all the desserts were amazing. Especially the ones that looked like acorns. The ambiance was so nice we were seated right next to the stage so we had a great view of the jazz band. The interior design was contemporary and they had a vast collection of whiskey. I want to go back to have a drink at the bar and enjoy the live music."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1a3ZpLVRnEAE",
            "text": "Fantastic atmosphere in this restaurant! They have a huge array of drinks available if you just want a drink, or a fabulous, small menu (fresh food) to choose from. The staff are wonderful and very attentive! There were a few jazz artists playing which gave the place a great ambience when we were there. The saxophonist also played Happy Birthday to me, how wonderful is that! I hope the pictures speak for themselves but the food was delicious as well! Highly recommended!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4bU8zcWFnEAE",
            "text": "Celebrating my husband’s new position with friends here. We made reservations the night before, and they do have you put down a credit card and charge $25 per person for cancel or no show. All our friends made it here on time. We were seated right in front of the stage, and the dinner was lovely. The staff were friendly and professional. The menu said their food was for sharing - not sure about that because we finished everything at no time and kept ordering more and more. Best of tonight - the octopus. We had tried this dish in French and Greek restaurants, and here we found the best. So tender, char, but not rubbery at all. I love the salad on the side. We ordered the most expensive steak on the menu for medium rare. The piece we got was a little too fatty for me, but my husband loved the charred fat. Truffle fries and asparagus are really good, but we expected a little bigger portion - more veggies please. Now, for dessert. I saw the videos online, and finally get to try the signature “Flatiron room sphere.” Warm and chill, sweet and sour, it’s life! Then, we couldn’t help but ordered the chocolate cake. It’s like the opera cake. The shine is beautiful. And the layers. OMG. Almost forgot to mention the drink - they are serious about drinks. Look at their drink menu. My husband ordered “smoking old fashion.” It was bourbon and smoked with cherry wood. The artists for tonight were great. They picked classic songs and gently interacted with audiences with music. The whole night, we did not feel rushed at all. From 7pm to 10pm, time just flew. We all had such a good time. Worth every penny we spent. Strongly recommend!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbHZtYzNRRRAB",
            "text": "i ordered their 1/2 dozen oysters, house cut truffle fries, bourbon bbq meatballs (beef blend of brisket, short rib, and strip steak with smoky bbq bourbon sauce), burgundy braised beef short rib (parsnip purée, brussels sprout, rainbow carrot, burgundy wine demi-glace), jumbo lump crab cake (beet & walnut purée, swiss chard, grilled lemon), bourbon barrel aged coffee gelato, and sticky toffee pudding. i can’t overstate how good every single dish was (even their sides were carefully crafted and masterfully seasoned and cooked to perfection). their fries were to die for and i highly recommend getting them as a side if you’re a fry lover (came out very hot, crispy, and richly flavorful— perfect amount of truffle flavor). their beef short rib was perhaps the most tender beef short rib i’ve had (the sauce paired perfectly with the rich, robust beef flavor). even their desserts were absolutely delectable. i highly recommend getting a reservation here and checking them out— you won’t be disappointed! (i also got their bourbon barrel aged coffee and it is so good) (also the lighting was dark so these photos do not do their dishes justice)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbXBiY0tREAE",
            "text": "The Flatiron Room is hands down 5 Stars across the board. The vibe is jazzy NYC cabaret, with decor and attention to detail to match. This was my second time and it did not disappoint. For a special evening out with family & friends, first date, date night or special occasion…THIS is the spot. The service is spot on, warm hospitality from the host team and servers that will not steer you wrong. Food was absolutely delicious and the craft cocktails……let’s just say I wish I could’ve tried them all. If you like whiskey, you will not find such an extensive, in depth array  and vast selection. Check out the headliner entertainment when you go. And if you want outdoor seating, the private rooms are finely appointed. A star in Murray Hill!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbUt5b0RBEAE",
            "text": "Upscale restaurant for a lovely jazz dinner.\nThe food was 8/10, nothing out this world but consistent and good. The drinks definitely come with presentation and are amazing.\nCome here for an amazing experience food and live music.\n-I’d recommend the Mac and cheese to start it was a. 10/10"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbzlPRjlBRRAB",
            "text": "We had an incredible evening at The Flatiron Room Murray Hill. Great atmosphere, elegant decor.\nThe food, drinks and service were all exceptional and love the live music!\nHighly recommend for a perfect night out!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1MHFYUmlRRRAB",
            "text": "Great experience! Food was great service was fantastic, really good. The music us also a nice touch, a little too loud for my liking but I am sensitive so it will probably be fine for most people. Incredible whiskey selection alongside other alcohols. I do recommend this place if you are in the area and want to have a special meal with someone. Unfortunately they do not have hot chocolates, but that's a minor detail."
        },
        {
            "date": "8달 전",
            "language": "nl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnM2RibGxnRRAB",
            "text": "Wat hebben wij hier genoten, eten was meer dan prima, cocktails prijzig maar top.\nEn de sfeer en ambiance mede door de live muziek zijn voortreffelijk."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1MGRleXlBRRAB",
            "text": "This is such a nice jazz bar in midtown, like the name it says it’s fine and rare to find in the city. It’s very New York style with jazz live music everyday and you don’t have to buy ticket to get in. We came in for a drink only so we sat on the bar you do not need a reservation for that, but if you prefer to dine in reservation is highly recommended.\nThere are massive selection of whisky and some craft cocktails not just whisky cocktails. I ordered couple of the cocktails from the menu they are all really good. But if you have any particular whisky you want, you probably can find it here. The bar seats are first come first serve, but they also have some stools around the whole area you can sit as well. The drinks are little pricy but the place is very classic and good vibe. The jazz performance is excellent. Not too loud so you can still hear each other talk."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxZ19menlnRRAB",
            "text": "Always 100% with food, service, atmosphere. We love jazz, we have had the same waiter for the 9 years we've been going I believe, it's incredible. Use to be called fine and rare, but merged during Covid. So lucky that some of our favorite people stayed and the menu is still on point. 10/10 always guys- you are the best."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1ZzVmM21BRRAB",
            "text": "Was able to make a reservation a few days prior for a weekend date night. They had live music playing early. The sevice was fantastic.  I really enjoyed our waitress.  The band was lively and really set the mood. The good was fantastic and the drinks were even better. Everything was smooth and lovely. The host was charming and friendly. Service was prompt. Would absolutely come back. And absolutely recommend.  Made this a stand out night."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiOFk3SVJ3EAE",
            "text": "Outstanding! Is the only word I have to describe this place. From the moment you walk in you’re greeted with a smile as you pass all other workers they’re all smiling which says a lot about the place. The atmosphere takes you to a movie scene as you hear the singer perform. Between the triumph and the smoked old fashioned ufffft which to get they’re just unique in their own way. Get em both!\n\nThe food was superb and incredibly delicious; we got the octopus and crab cakes as well as a charcuterie board which did not disappoint at all. To compliment the whole evening there was 2 performances through the night a singer and some jazz music and both groups made the whole night unforgettable. You need to come and check out The FlatIron Room!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGaGNLOUFnEAE",
            "text": "Came in on a Friday to celebrate a belated birthday. There was plenty of street parking in the evening, my table was readily available and the hostesses was warm & friendly. I ordered a beet salad and scallop entree with a glass of rose. For dessert I had the Flat Iron Room Sphere which was amazing and delicious. Dessert was my favorite along with live music. . Highly recommend coming here for a date or night out."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKMzZXYVBnEAE",
            "text": "An ABSOLUTELY STUNNING restaurant. The staff are professional & kind, food/drink’s were top notch, and overall the ambiance was a perfect setting. We ordered cocktails, small plates, large plates, and of course the known dessert sphere.\n\nAnother note to mention, I ordered the espresso martini (which is a fav cocktail of mine) & it wasn’t to my liking. However, our server noticed it wasn’t touched, and I already had intentions of paying but he decided to remove the item from our bill (SUPER SHOCKED). I appreciate that kind gesture.\n\nLastly, how can I forget the live music, they had talented musicians & you could tell are passionate about they’re craft…just like the restaurant is on the culinary side.\n\nBottom line is I WILL RETURN!!!!!!!!\n\nThanks so much for the experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwNVpUUFpBEAE",
            "text": "Good food. Really small portions more like tapas. I ordered the octopus, raviolis and cheese, and cold cuts board. Good variety of licor, and we really enjoyed the live music."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6X0pxOVlBEAE",
            "text": "We recently had the pleasure of dining at flatiron room and I must say that it was a truly exceptional experience. From the moment we stepped inside,we was greeted with a warm and inviting ambiance that set the stage for an unforgettable culinary journey. Host even wished a happy birthday to our party.\n\nThe restaurant's decor was modern and elegant, with a perfect balance of sophistication and comfort. The soft lighting and tasteful artwork created a relaxed atmosphere, making it the ideal setting for a memorable dining experience.\nFood was amazing, truffle fries were great. Music was a great addition to our experience. Overall this place is a gem and will definitely return."
        }
    ],
    "reviews_count": 86
}