{
    "name": "Serafina Madison 38th (Midtown)",
    "place_id": "ChIJ8TP4iZlZwokRITFJkalDwsc",
    "grid": "MN6",
    "address": "241 Madison Ave, New York, NY 10016, USA",
    "rating": 4.1,
    "user_ratings_total": 480,
    "phone_number": "(646) 779-7667",
    "reviews": [
        {
            "date": "16시간 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSFN6SmlWMHczY2pJNFZrbFplazFWVWtOVVoyYxAB",
            "text": "Restaurante italiano famoso de Madinson con la 38. Buenos productos con precios ajustados (en la comida). El agua como en la mayoría de los restaurantes es gratis.La bebida muy cara. Ejemplo. Copa de vino 15$.  Nosotros pedimos Pizza y estaban riquísimas. La atención del personal espectacular. Sitio recomendable para comer y seguir conociendo la ciudad."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25veGRGQlhMV3RKZDBZMVVqUkZPVlZMVDBweFlsRRAB",
            "text": "We went on a weeknight and did not need a reservation but there were plenty of other people eating here. The food was fine, nothing remarkable but acceptably prepared and in generous portions that can be shared/eaten family style. The display of the chicken Milanese is really nice and super thinly pounded. I appreciated the endive slices. The pizza was okay, not the best in NYC as some chef on an instagram reel said, because the Di Fabio pizza has American levels of cheese and sauce leaving the center kind of soggy. The service of the restaurant was remarkable, efficient (seating, ordering, receiving food, paying) without feeling rushed, free from errors, and attentive+pleasant but not pushy. I think this restaurant is the perfect non-controversial spot for a seamless meal for small groups to catch up in a nice environment."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUGVHVXdjV1l5TWxGVGRHZEhWbFJFVG10b1lVRRAB",
            "text": "Great food and decent price! Gluten free pasta was pretty good too, will come back"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RNFIwUklRakF3Y0daWVlscHlaVWxzTUZkSlFuYxAB",
            "text": "Excellent service from the entire team! Everyone was super kind and attentive. Definitely worth visiting — breakfast was great and service was a solid 10/10."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OYVlWTTRTbmRKYVRObFprZGFVR0pGVTNWclZGRRAB",
            "text": "Do not eat here. This restaurant is for Trump lovers and will kick you out if you don’t agree. My friend and I were having a private conversation at the bar and were asked to leave for no apparent reason. When I inquired about this and tried to get a better understanding of why we were being thrown out, they had no justifiable or explanation. Do not eat here unless you are a Trump lover. Seriously"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TFpHRllXazl2YWxSd01VeDBhSFU0UW1walowRRAB",
            "text": "I had a completely delicious spaghetti squash which would have been vegan except that I put some parmesan on it.it was chock full of other veggies and had a zesty tomato sauce My husband had pasta with cream sauce and shrimp and said it was delicious. The atmosphere was very nice; sophisticated but not overly stuffy. Wine was good and coffee and dessert which we split was tasty. We split a cake made with a buts of thin stacked crepes and a pistachio cream."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3ek9FRklYMnhwVVVobVFWZFZWRkkwVFRjM2NYYxAB",
            "text": "Remarkably disappointing. No one really in charge. Service is chaos. I ordered two coffees before I had to give up. Paid $45 for an omelette that was poorly prepared essentially. There's no excuse for not being capable of making a cappuccino. It's uncomplicated. This was just in every way second rate through and through."
        },
        {
            "date": "1주 전",
            "language": "bs",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CZlgwMWxkV1kxWkVseWNXMXJSbWhrTjJrd01GRRAB",
            "text": "Predivan restoran za sve vrste posetilaca."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3dGVWUXdhekJtZGsxa01HNDRUbk5CWkRoT2RHYxAB",
            "text": "Excellent Italian restaurant., went there twice during my stay in New York.  Suggest booking"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTU1tUnFkVGREZFVWcVQxTkdTV0pDTVZSa2IwRRAB",
            "text": "We were a party of four and everyone was pleased. Atmosphere was very comfortable, service was great and the food was amazing."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwak1uRk5aVU00TTJGZlEwdFhNM0puZVZSc2JHYxAB",
            "text": "Breakfast was a bust, in typical NYC tourist trap fashion. Waffle to order was premade, cold and hard and covered unexpectedly in bad whip cream and cheap drizzle chocolate sauce. French toast made to order was similarly cold and old. Coffee from the serving large bin was lukewarm at best and made from low grade coffee. Service was fine and atmosphere is fine."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdk5HdFZOSGcyWmxkNWJIWnhObWh0TWtabmRsRRAB",
            "text": "Great food and ambiance. Had a bit of a mishap where the person bringing our check mistakenly closed out the wrong table and we ended up paying someone else's bill, so that was a bit of inconvenience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNlVWVnVRbTVFYVhsdFprUnBlRXBYZEVNeGJrRRAB",
            "text": "Solid menu  good quality"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSblFYbE5Ta05wV25kVll6RTFVRlJpY1dVd01YYxAB",
            "text": "First time at this location. I expected better. There for weekday lunch.  It crowded. Prices were about as expected. Service was ok. Food was uninspired. One person in our party ordered a vegetarian pizza that ended up with greasy Italian sausage on it. I don't think we will be back. Better restaurants in the area."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4UFVGaFNObXB2YmpRdFFWbHlNbll6UzBkQlRrRRAB",
            "text": "The place is really nice and food is great. I had dinner and breakfast several times as I was a guest in the hotel nearby. However, the service at breakfast has margins for improvement: do the waitress take orders or not? Sometimes they do, sometimes not. Should I go to the bar to ask for a coffe? I ended up doing it, and while I was waiting for my coffe there was a cappuccino ready to be delivered to the table but no waitress came, it became cold in the meantime.. if I had receive a cold cappuccino I wouldn’t be happy. The guy at the coffe machine then moved to the welcoming part.. i think you should make sure that the person making the coffees sticks to it and follows a precise first in- first out service mechanism. By the way, the pasta al ragu was super great!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOdFRUSnVRMDR4YVZSQ1pIUlVTMXA1T0V4TVdrRRAB",
            "text": "Love the bruschetta. It was very fresh"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGaWNGSkZPVmRIUlhGTFQwTTFjazVwWm0xb1ZrRRAB",
            "text": "The customer service was amazing. Waiting staff was attentive kind and courteous.\n\nThe decor was also well done. Expressive but not overpowered.\n\nThe food was great… very flavorful but the portions were too small for the prices.\n\nThe Lemon drop and tiramisu were some of the best I’ve had in a long time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xMlptVTFVbmRaVW05dlRFZHdhak0zVFhONFltYxAB",
            "text": "Great location and convenient for my office\nHad a wonderful time with my colleague\nHad the bruschetta, 7oz. Filet mignon, chocolate mousse\nOnly nit pick is that I was given a dated desserts menu while my colleague luckily got the latest one, maybe because of age😊"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKMFoweFRkbTVEZGpOTVRWbFRVek5rTlRWTWFGRRAB",
            "text": "Such amazing food!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGc1JEZG1lbGhzVHpodlVscEZVVVJoVjJoYU9VRRAB",
            "text": "Had a lovely meal her, it was so tasty. The servers were very nice and got our drinks and food very quickly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOV1RYcE9WbGR0TFZkcExXc3dTMUpwTVhsSlVHYxAB",
            "text": "Called in on one busy evening without a reservation and we were pleasantly surprised that we were able to get a table after a very short wait.  Lovely interior and vibrant atmosphere. Tasty Italian food and great service. Would recommend the ravioli, lasagne, cheesecake and tiramisu. A holiday highlight."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSMFNsTkdVblp1WDJndFFsQTVNVkJMWkRsRlZHYxAB",
            "text": "Had a great chicken milanese, that was  thin and as large as the dinner plate."
        },
        {
            "date": "2달 전",
            "language": "pl",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twalIza3RjMlF6WW5KRVQwWlVYMWh6WWpkamRGRRAB",
            "text": "Podczas 9 dni pobytu w NY często korzystalismy z restauracji Serafina, która znajdowała się w naszym hotelu. W miarę smaczne jedzenie , polecam śniadania a z dań z menu sałatkę z owoców morza oraz carpaccio z karczochow z krewetkami oraz pizzę , bruschetta niesmaczna-wielkości mini krakersów, niestety kilku dań dnia polecanych w karcie nie było , duży minus za napoje , bezalkoholowe w szkle cała szklanka lodu śladowe ilości samego napoju, koktajl serafina z szampanem piłam 3 razy , za każdym razem zupełnie inny smak , pierwszy był super wyrazisty, orzeźwiający i normalnych rozmiarów, drugim razem wyczuwalny mocno alkohol wysokoprocentowy i mniejszą pojemność , za trzecim razem malutka lampka a smak bardzo słodki , okropny… nie przypominający w niczym koktajlu który piłam za pierwszym razem …aperol dobrze przyrządzony .\nJeśli chodzi o obsługę to bardzo mili  młodzi kelnerzy jeden w okularach oraz obsługujący nas na zewnątrz młody szczupły w krótkich włosach , pozostali nieco starsi nieprzyjemni i bardzo nerwowi… mocna klimatyzacja od rana do wieczora, zła akustyka lokalu sprawia ze wieczorem ciężko usiedzieć przy kolacji , bardzo głośno ."
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SdGFIUkdVSFJzTjNBeU1XSTRRMlI2TmpNeUxYYxAB",
            "text": "Il nostro angolo italiano a New York, imperdibile! Alfredo ci ha dato quel qualcosa in più per farci sentire come a casa!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MktyMzl3RRAB",
            "text": "We had a date night and wanted to sit outside (within the green house if you will). It could be noisy and cold but they have a sliding door that you can open and close. Since the buses were rather loud, we closed the door. It’s so nice and quiet. We’re sitting at the far north end having the area to ourselves. Our waiter Ricardo was very friendly and attentive. The water filler and the one who brought our food were also friendly. Service was quick and professional. We ordered bruschetta and calamari for starter. It’s an Italian American resto, so adjust your expectations. The portion for the bruschetta was a bit small for the price, the that of the calamari was very generous. So we’re good there. For the main course we had one of the pasta with asterisk and chicken parmigiana (came with penne), with a side of spinach. All were good, especially the spinach. The garlic was so yum. The portion was good and we were full. So no room for dessert. Would definitely recommend this place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSU5GTm9kMnhXU1RaYVlYSXdObEowU1RsRlYzYxAB",
            "text": "Got delivery. Terrible tasting food that was barely seasoned and tasted plasticky (likely due to hot food being thrown into plastic takeout containers too soon)."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMFRIUjBVbk5MVldwRGJVdFRPRmROZGtaRlFWRRAB",
            "text": "Casual convenient. A little noisy and the smell of the smoke"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJM1YyWjVPV0ZsTUV0bllrSjROek5YVDNGMVNYYxAB",
            "text": "Elizabeth has Excellent customer service and always greets with a smile.\nPleasant place to eat and excellent service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JNFRVMW1ZMlpOVlhOblZYcG9jVnBUZWxkS1dIYxAB",
            "text": "the orange haired waitress is terrible\n\n(just standing in the way doing nothing, didnt give us the menu, wanted to give us back our used cuttlery after she took it as we asked for new cuttlery, basically told a guy who wanted to order a coffee to get it himself…)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwMlZGVlhaMTl5YTFJM2FHaFNTVFpNWXpCZmFIYxAB",
            "text": "Great overall experience. Service was friendly, food was really good and the terrace is really nice. We had the bresaola, penne allá vodka with burrata and the burger. Everything was really good I would highlight the pasta, delicious."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WaUxXa3Rabk5uZFZkZlJFMWFhMHBaZERKS2VtYxAB",
            "text": "Wondering why this place\nhas only 4.1 stars. Food was above expectations, my carbonara was according to italian recipe, service was good. I can recommend this place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnemF6VmxiMmd6WjJWSVgyUjNUVEpGVjNrMU1rRRAB",
            "text": "food is okay, service is embarassingly bad. asking for the menu seemed to have been a too hard job for the staff. otherwise they also dont really care about their customers"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGT00zWm1OakJ3YVZGTVNHWkdiMUJFYURkRWJsRRAB",
            "text": "Absolutely awful. The pasta was genuinely gross tasted old, like it had been sitting around and then reheated in a microwave. The sauce looked and tasted just as bad, like it came out of a can. I had to add salt just to choke it down. The entire dish was flavorless and stale. There were FLIES flying around the restaurant, which says everything about the cleanliness. this is NOT good italian food this is canned food."
        },
        {
            "date": "3달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbWQwaFdWSHBsWVROdFMzQktUbXBJY2pSZlJXYxAB",
            "text": "Da italiana posso confermare che si mangia benissimo! Spaghetti aglio ed olio al dente e ottimi. Come la pizza e tagliere di salumi. Servizio impeccabile e attento alle esigenze della clientela.\nOasi se cerchi cucina italiana!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQk0wMXlVMFpWVGpsUVkyNXZkelpZYkVNdFdYYxAB",
            "text": "All food is perfect👍👍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSWFEWjZkVEJXV0ZKa1pHeHRUMlk0UlVWR2FVRRAB",
            "text": "Great Food!  Excellent Service!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkNllVRkpYMWw2V1VoSVVHNDBWMk5yWlZweE5YYxAB",
            "text": "Really good food. The best Cacio e Pepe I’ve ever had. But staff seem disinterested, uninviting and frankly, appear rude. Really lets this place down."
        },
        {
            "date": "3달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUFVYRlJaV0ZvWjFCM2VHVnllbHBwVTFweVdHYxAB",
            "text": "Colazione super, i pancake sono buonissimi. Tutti molto gentili."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVFZFUjJXbTU0UkdwUVJrMW5RMm94WkZkM1UyYxAB",
            "text": "My family and I just got back from a wonderful dinner at Serafina Madison 38th street location. I have celiac and they had one of the best gluten free pastas I've had in a long time. Highly recommend.. The staff was great too!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxZlRXa3hiVWg2Vmt4U2R6ZHZXbVpWVm5GeFZWRRAB",
            "text": "Great food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21neFpUWmtRVGxvZGs1RmEwbHRPRUpxYkhSbVZVRRAB",
            "text": "- Came to grab some lunch this afternoon, sat the bar. Lovely restaurant with great ambiance and the food was amazing. Ertis was great, respectful, friendly and knowledgeable. Will definitely be back"
        },
        {
            "date": "3달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kbU5rVjJTbTlCYjBWa1dFeGxiRXh3YW1SMlpYYxAB",
            "text": "Personale molto preparato e sorridente ..dolci spettacolari ..torneremo sicuramente"
        },
        {
            "date": "3달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SmFYSlZaRGxhT0VKM2JsOVFiRmxFUm5OT1FtYxAB",
            "text": "Tutto perfetto!! Dolci super"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kU04zWTBObk4yZDBaYVIyaFVXV1p6WHpkaGVFRRAB",
            "text": "The food was delicious. The waiter is not up to pair with the restaurant., Rude with a bad attitude."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4elJIZHFSMmhCVG10U1dVeDVRVVpCVFVvNWFuYxAB",
            "text": "I usually like to go to Serafina to other locations.\nMy experience in this one was terrible.\nI was seated outside. They forgot about me and my main course. Being seated outside, I had to call the phone inside to remind them about my existence.\nWhen the waiter finally came outside, after that I was waiting for so long, I told him I wanted to move inside. I moved inside at the bar, waiting for my pasta, and instead to bring my sparkling water at the bar with me, he discharged it.\nOnce at the bar, when finally my pasta arrived, it was neither so good.\nThey told me that the manager has been alerted of all the problems. And despite of that, they made me pay everything in full.\nI don’t mind to pay for a good service and good food. But in this case…. Don’t manage or work in a restaurant if you are not able to provide a good service."
        },
        {
            "date": "3달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWWMwaHpORUpMT0ZSa1RHdHNVbmwzYmxSUFZWRRAB",
            "text": "Almoçar no Serafina é sempre uma experiência deliciosa. Massas frescas e saborosas harmonizam perfeitamente com vinhos selecionados, tornando cada refeição um convite a momentos leves, saborosos e cheios de boas conversas."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjMlREbDBUMFF4WTFjMlVIZE5VbUUwTVdWT1ZVRRAB",
            "text": "Great location, nice service, very large menu..quality was very good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xclNGcHJXRWRSWlVOSE5IWTVTbEpXVFhveE0yYxAB",
            "text": "Fabulous 👌.  Amazing food and great service. We are regulars here and LOVE this place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CcloyNXdhVGRvUVVSTE5tOHpjbGR2U1ZwWFRHYxAB",
            "text": "This location has lots of potential. The customer service was great! Our server Ellie was so accommodating and kind. Truffle fries were outstanding and the calamari was fried to perfection. The vodka penne was just ok. The texture of the noodles was excellent but I added grilled shrimp that was bland and not worth $10. Very small and no more than 5 small shrimp. Some were even cut in half. I recommend getting clarification before adding a protein. I would return to try other dishes."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxS0xWZEZORVJyV0dGU1RIbDFUVkpMZFVvMmFWRRAB",
            "text": "We had a couple of pizzas , pasta and eggplant.\n\nLoved it and would go back again for the amazing pizzas."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJZUt6Xy1idjhXMWZREAE",
            "text": "Great atmosphere with outdoor heated seating.  It was raining and it was a nice place to dine in this enclosed outdoor space.\n\nThe food was excellent.  My eggplant was very good.  Service was fast and friendly.\n\nI would definitely dine here again."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNk1qbndRRRAB",
            "text": "I recently dined at Serafina, and overall, it was a great experience. The atmosphere is warm and inviting, and the service was friendly and attentive. For the main course, I had the pasta, which was cooked perfectly and full of flavor. The garlic bread, which they kindly gave us an extra order of, was tasty and crispy, though unfortunately, I did find a small hair in one of the pieces. It was a minor issue, but it’s worth noting. That said, the staff handled it professionally and made sure we were taken care of. I'd definitely return for the food and ambiance, and I’d recommend it to anyone looking for a solid meal in a cozy setting."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ajdQay1RRRAB",
            "text": "10/10 Flavour was incredible.\nCarlos, our server, was very friendly and knowledgeable about the menu options.\nDinner: Lobster ravioli and spinach ravioli\nDesert: Tiramisu and Pistachio tart"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbDlxZWtBRRAB",
            "text": "We really had a good experience at this place.The pasta was delicious and the chardonay excellent. The waiter was kind. We recommend it and will be back."
        },
        {
            "date": "7달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRLWJTRFd3EAE",
            "text": "Muito legal, comida gostosa, atendimento bom, decoração bonita, comida italiana, todas massas, talharim, fetuccine, carnes e peixes, pedi uma lassnha ao forno deliciosa, os vinhis servidos levam a marca Sera Vino, envados sob encomenda, boas sobremesas, gistei do tiramissú; fica anexo ao NH Hotel servindo para café da manhã. Vale ir."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2NnU3eFFREAE",
            "text": "This serafina is a beautiful and much more spacious location than the other ones. We went on a cold winter day and although we didnt get a table inside, the outdoor patio was nicely closed off and properly heated so we were very comfortable. The pizza was delicious and so was the pasta. Over all a good experience!.."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMaThEU213RRAB",
            "text": "All the food was delicious!! And the dishes were huge! Consider that before ordering. Some details that I didn't like:\n- The restroom smelled pee, and it was dirty. I probably had bad luck, but still, I think the restaurant can improve this point, considering the price and having only one restroom!\n- Be careful with the tips, in the menu they say that they recommend the 20% tip for parties of 6 or more. We were 3, and at the end, they charged us a 20% tip, and then, over that price, they asked us to put a tip of 3%, 5%, or 7%. You can think,… Oh, it's not much, but it's over the first 20%, so if you select one of those options, you will pay close to 38% of the tip.\nI would give the place a second opportunity. I really liked the food! The service was great, super kind, great atmosphere."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNGIyZ1R3EAE",
            "text": "I was dreading finding a place to eat dinner as a solo traveler on Valentine’s Day, but Serafina turned out to be the perfect spot. From the moment I sat at the bar, Nas made me feel completely at home— he was attentive and an absolute pro behind the bar. The manager, Seth, also went out of his way to make me feel welcome and ensure I had a great experience. The food was incredible, the drinks were perfectly crafted, and the atmosphere was lively without feeling overwhelming. What could have been an awkward night ended up being one of the best dining experiences I’ve had in a long time. Highly recommend—especially if you’re looking for genuine hospitality! Thank you, I’ll definitely be back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfXzdTd19RRRAB",
            "text": "First time here, wasn’t planned to eat here, happened to walk past. We got lucky they had a table for 2 available.  For sure would recommend reservations.\n\nBy far one of our new fav places to eat at.  My husband lived in Italy for 3 years and my family is Italian.   Our first bite into our food instantly brought him back to Italy and me it reminded me of my dad’s sauce.    Every bite was just heaven.\n\nThe atmosphere was just perfect.  Whoever designed this place really knew what they were doing.  Comfortable, cozy, relaxing,\n\nWe also got drinks and those too were perfect.  We can’t wait to go back."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNnFQWm13RRAB",
            "text": "Nos encantó desde el servicio tan excelente, el trato muy servicial y amable por parte del personal, la ubicación es perfecta muy cerca al Madison Square Garden y Bryan Park, la decoración es bellísima y la comida de alta calidad, la pasta suave y cremosa y con un sabor exquisito, regresaremos, recomendable 💯"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGMFlLT3N3RRAB",
            "text": "\"Lovely Spot, But the Pasta Missed the Mark\"\n\nMy visit to Serafina on 38th and Madison promised an noon of ambiance and convenience, nestled as it is in the hustle and bustle of Midtown. It's not every day you find a restaurant that tickles your fancy with its service and setting while letting you pop in quickly thanks to its prime location.\n\nStepping into Serafina, I was instantly taken by the stunning interior—a cozy yet elegant tribute to the charm of Italy. The warmth of the decor paralleled the staff’s service, attentive and with a genuine smile that made us feel right at home👌 On a chill noon in the city, I was looking forward to a comforting plate of pasta to round off the inviting experience.\n\nBut then came the food. It's with a heavy heart I must pen that both pasta dishes we ordered were a letdown 🥲 Italian cuisine, a rich tapestry of flavors, textures, and aromas, is something I've always held in high regard, so my expectations danced on the higher rungs of hope. However, there was an undeniable disconnect between the allure of the surroundings and the main event itself. The flavors did not embrace the gusto of Italy; rather, they stumbled, leaving us with a discomfort hard to overlook, and regrettably, unfinished plates.\n\nIt truly is a shame when the heart of the restaurant—the culinary experience—doesn't sing in harmony with other aspects of dining that were note-perfect. I appreciate the efforts of the staff and the thought put into the lovely space, but until the recipes are revisited and the pastas pay proper homage to Italian zest, my stars remain a middling three.\n\nIn food as in life, balance is key, and I hope Serafina finds its footing to match the taste with its service and beauty. Here’s to hoping for a better bite next time! 🍝"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmeGQ2b0ZnEAE",
            "text": "This review only gets 2 stars solely for the manager and the excellent hostess.\nMy boyfriend and I made a reservation at this location for 4:15 PM on a Monday--we got there at 3:45 hoping to be sat early, and the manager was nothing but kind about getting us sat right away. We were one of 3 tables in our section, with the rest of the resturant being relatively empty except for the bar.\nOur FIRST waiter came over and could barely make eye contact with us, constantly fixing his hair and did not introduce himself. He took our wine and appetizer order, and that was the last time we saw him--we were not waited on for another 30 minutes. At this point, we were one of 5-6 tables. I ended up going to the hostess and explaining no one had come back to even check on us, let alone ask if we wanted dinner/more to drink. She was very sweet and the manager also was apologetic, and gave us a free appetizer.\nOur second server again did not introduce themself, and only came over once throughout the rest of our meal. We skipped out on dessert and asked for the check twice before it came out, only for it to be wrong. They had charged us for an additional appetizer and a more expensive bottle of wine--yes, it was changed and we paid the correct amount, but frustrating with the experience that we had.\nPictured are the bruschetta and burrata with prosciutto, as the gnocci di mama, the spicy penne alla vodka, and the ravioli alla salvia. The penne was undercooked and crunchy, but otherwise, the food was not bad.\nCute place with a more intimate vibe.\nWe will not be back, but thank you again to the manager and hostess who tried to make our experience a bit better. For $200+ in the city, you are better off finding another italian place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1dGQ3bXRBRRAB",
            "text": "Friendly staff😊, attentive service🫡, tasty food😋, elegant atmosphere✨!!!!\n\nMr. Camilo S. was polite and very pleasant.  So is the young lady who seated us.  Thank you very much for the third table you gave us.  She’s quite customer oriented🤗and very patient😘!\n\nOur glasses were refilled without us asking.  Our food was served in no time.\nOur Salmon with avocado salad was delicious.  The lobster ravioli was also good.  The bruschetta was a bit pricey.  Everyone’s friendliness and attentiveness was delightful😀."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqd0pUbE9BEAE",
            "text": "Had lunch there during a very cold and rainy week day. The restaurant was almost empty, but quite refined and classy, especially the bar. Service was a touch long but the hot pizza was very welcome. One typical New York restaurant. I liked it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5MzZQSFZnEAE",
            "text": "From the Fridays brunch menu. Everything was very good, the eggs perfect and the burger seasoned and cooked exactly rare as requested. One small issue was that I asked for extra gorgonzola but got none. Still an excellent burger. Nice place and will return"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMaW9PNmxnRRAB",
            "text": "I absolutely adored this place. From the moment I walked in, the ambiance was inviting and charming. Pedro, in particular, was exceptional, turning what was meant to be a quick stop into a truly memorable experience. His attentiveness and expertise made all the difference.\n\nI can't recommend their Sauvignon Blanc highly enough; it's a must-try for any wine enthusiast. The flavors were exquisite, leaving a lasting impression. I will undoubtedly return to indulge in it again.\n\nMoreover, the coffee was phenomenal! Rich, aromatic, and perfectly brewed, it was the ideal complement to the overall delightful experience. This place has certainly earned a special spot in my heart, and I look forward to many more visits."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5dko3VGF3EAE",
            "text": "I really enjoyed this particular Serafina Restaurant.  Not all Serafinas are the same!  This place had an electric atmosphere, with friendly and accommodating service.  The food is top notch.  I had the Chicken Milanese which was enormous, moist, and delicious.  The fresh arugula and tomatoes gave the meal a nice, overall zest.  Prices were reasonable for Manhattan.  Highly recommend."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRb09iTzJ3RRAB",
            "text": "I highly recommend this place to anyone ordering takeout or dining in. The pasta is absolutely delicious, and after a long day at work, these dishes perfectly satisfied my craving. I’ll definitely be dining this again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSLUliQldREAE",
            "text": "Came in on Thursday for a late lunch and tonight for dinner.  Sat at the bar.  Seth is absolute best!  The servers definitely brought their A-Game.\nFull on V.I.P. treatment....  My office is right around the corner so I will definitely be back.  ❤️  the ambiance here...\nStarted with the Spinach Goat Cheese salad and Prosciutto & Burrata.  Very good & very fresh.  Had a glass of wine and ordered the Farfalle al Limoncello pasta.\nGreat atmosphere!  Great meal! ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNREI2TXpncjZXZElREAE",
            "text": "Wow, wow, wow. This is the post to recommend your friends and colleagues. The kitchen at this place does wonders to the food. It’s not crowded during the day and the food is amazing. I’ve went here 3 days in a row without even thinking about going somewhere else. I enjoy food and this place knows how to deliver. Bravo!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3aHFyNEpnEAE",
            "text": "Lovely meal. Simple food. Portions felt respective to the pricing. Only thing of bother really was the service. I think I got checked on every maybe 5 minutes I was there. Several different people. I just wanted to sit and enjoy a lunch to myself. Do I need water. Do I need this, do I need that. And then language barriers came into play as well and it really was rather bothersome towards the end I think they got the message. But wasn't the best vibes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNua09QMkJnEAE",
            "text": "We had dinner on Friday night. We ordered a starter, gnocchi and salad. The dishes were simply delicious and the dessert - perfect!! We will definitely return to the restaurant next time we visit the city."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxalBDQzFBRRAB",
            "text": "We were greeted by a lovely hostess who sat us at an available table on the patio. Very cool setting.\n\nOur waiter showed up relatively quickly and I asked if he could recommend the lasagna. His answer… “…it’s made with 100% pure beef…” That was it.\n\nWe ordered a glass of wine for her, lasagna for me and the eggplant Parmesan for her.\n\nThe food showed up quite speedily and although the portions are on the minuscule side I cannot find any fault with it. Both dishes and the subsequent tiramisu desert that we shared were delicious.\n\nWhat I can find fault with is:\n\nDon’t make me ask for bread. 🥖 and when you deliver it perhaps let it be at least room temp and not cold 🥶, and warm up your dang butter. This is bush league.\n\nDon’t make me have to sit there for 15 minutes post desert waiting for my bill.\n\nPerhaps pretend that you actually care about your diners.\n\nDo better."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQQ0R0WVNwMDlUNXJ3RRAB",
            "text": "Great service and tasty Italian food"
        },
        {
            "date": "1년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdzg2VDRRRRAB",
            "text": "Comida: deliciosa e muito bem confecionada. Pasta al dente.\n\nServiço: empregados atenciosos.\n\nAtmosfera: muito bonito o restaurante no interior e comer na esplanada é igualmente agradável mesmo em tempo frio pois tem aquecimento."
        },
        {
            "date": "1년 전",
            "language": "tr",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyMDRuMUtBEAE",
            "text": "Steak taş gibi sertti. Spagetti maalesef tattığım en kötü spagettiydi diyebilirim . Servis ve çalışanlar çok ilgili. Klima inanılmaz sert çalışıyordu. İstanbul Serafina ile kıyas dahi yapılamaz."
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOODVIUFZnEAE",
            "text": "Es war ein schöner Abend. Zum Geburtstag unserer Tochter gab es noch ein Geburtstags Ständchen mit Kerze auf dem dessert.  Sehr aufmerksam! Top"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0aW9tVnZnRRAB",
            "text": "The best Italian restaurant in town. The chicken milanese and its salad sauce was very delicious. We had margaritha pizza and spaghetti. The food was fresh and the ambiance was good. My daughter liked the renovated restroom too. Good for a drink or with children."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMM2c4N2pQOFl5RnB3RRAB",
            "text": "Ricardo and the runners were absolutely spectacular. The professionalism was undeniable. He knew the menu, guided us through all the courses and timely placed our meals with precision between each course. I hope you have several Ricardo’s across the franchise he understands customer service and dining with elegance. Thanks."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbllleEJnEAE",
            "text": "Serafina Midtown is a disgrace — the food made me violently ill, the service was nonexistent, and the staff couldn’t have cared less.\n\nI found this restaurant through inKind. I came between lunch and dinner, ordered the bufala mozzarella pizza, an apple juice for my son, and an amaretto sour. After a few bites of the pizza, I ended up with diarrhea and vomiting in their bathroom — with my young son witnessing the entire thing.\n\nNeither the apple juice nor the amaretto sour ever arrived. I had to flag down in the hostess myself just to complain. The waiter finally showed up to bring the check and rattled off some irrelevant excuse about being “between services,” as if that absolves them of basic competency. If you’re open, you’re responsible — period.\n\nHe tried to spin it like a favor by “removing” the drinks I never received, which only added insult to injury.\n\nI didn’t even bother taking the disgusting pizza home. We only ate two slices, that too, the dough was raw and not cooked throughout for pizza. When we walked out, the staff didn’t so much as acknowledge us. No apology. No goodbye. Nothing.\n\nI did not tip.\nThis was by far the worst restaurant experience I’ve ever had, and it speaks volumes about how little Serafina Midtown respects its customers."
        }
    ],
    "reviews_count": 80
}