{
    "name": "Nonna Dora's 2nd Avenue",
    "place_id": "ChIJfcwK4I9ZwokRB91xJVHrA4s",
    "grid": "MN6",
    "address": "606 2nd Ave, New York, NY 10016, USA",
    "rating": 4.4,
    "user_ratings_total": 448,
    "phone_number": "(917) 261-6544",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWdFMyUmhSRE4zVFhrek9GODFjVnAxZFhNeFdWRRAB",
            "text": "Food is so overpriced I don’t understand who they’re paying to have these high reviews be front and center - they should have 3 stars at most.…"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoVVNuQjBTR3RzUkd0T09DMDJOV05xTlVNMkxWRRAB",
            "text": "Nonna Dora’s completely blew us away! The homemade pastas were pure perfection — the lasagna was rich and cozy, the bolognese had that slow-cooked magic you dream about, and the meatballs were hands-down the best I’ve ever had. Add in amazing wine and genuinely friendly and professional service, and it’s the kind of meal that makes you instantly start planning your next visit!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201VU5XTXpkMnRPVURCbmVWUkhlRFJyZFdoU01uYxAB",
            "text": "I've been both to this location and the new one downtown -- both have been amazing every time. I've brought family, friends, and been on dates here many many times. Would recommend to anyone!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsRlFXRTJTVkY0VFhSdmVqUm5VVzVVZUhsd1FWRRAB",
            "text": "Have been attempting to go for a while since hearing about it. Finally went today, the food was great although expected to see nona rolling the pasta, we were told they’ve moved. That wasn’t a let down as Brit who works there was beyond facilitating. Get the bolognese, perfectly cooked. Def going back.."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21odlVXdGpOVGxrTTJSaFdtSlpVRlpuUWxwb2EwRRAB",
            "text": "This was an incredible meal. We sat at the bar and Britt took such great care of us. We got the ragu, carbonara, and pistachio pesto ravioli. All of them were excellent and it was hard to pick a favorite, but the ravioli may technically have to win. We've been saving this place for a special occasion and we're so glad we did -- the staff went above and beyond to make us feel celebrated. We'll definitely be back soon!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUlEyNHRXVUpQUjNkcFFsaG1WMEpGV25aVFpIYxAB",
            "text": "Best pasta in nyc!! Real authentic Italian food!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210bGNreGhSVEZXVkVaT2RGRndaRWRVZGt4VExYYxAB",
            "text": "Food was ordinary and extremely overpriced. Could be due location, could be something else. In any case, I recommend skipping and saving the money and eat elsewhere."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dllXbGhjRmRTY3pkeVpreHFlbVZtU2pSalQzYxAB",
            "text": "My husband and I hosted a welcome event at Nonna Dora’s prior to our son’s wedding.The buffet included a variety of appetizers, entrees and desserts. Despite construction outside, the restaurant was set up beautifully. The waitstaff and bartenders were fantastic. Platters of food were replenished and drinks were served quickly, despite being slammed as everyone seemed to arrive at once. The food was delicious and our guests had a wonderful time. Thank you for making the evening so memorable!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGR09YZzRaa0ZxZFZabU0yWkZTbEJ6VUZZNVNGRRAB",
            "text": "Frankly, phenomenal"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWGMzTjZjVFpXTUZaV2NtbG9URVZDVkZkTlFtYxAB",
            "text": "Very good meal, just not at mind blowing as the time we dined there"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMGFrRlJMVlZqWW5kdE5rWTJUMW8xT0dOblVsRRAB",
            "text": "Only for pasta. But really good pasta.  And you can get a reservation unlike the famous two pasta places in Brooklyn. Also the portions are not undersized like you sometimes see in fine pasta places."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKb1dHdHlNaTFVWVZsTlZtdERRVWt0WmpjMVQyYxAB",
            "text": "I was looking forward to experience fresh Italian food, and sadly it wasn’t as close to what I have eaten in Italy.   We ordered some bread to go along with our Burratta, and it was hard and really impossible to eat.   The explanation we received was that they had changed the size of the bread, and it was possibly overcooked.    I had the Ravioli per Olivia (it was ok), and Bolognesa (my nephew ordered and he liked it).\n\nEveryone was very accommodating!  Perhaps, you may want to avoid going in too late (our reservation was at 8:30p) during the weekdays."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUb01MWkRnEAE",
            "text": "Just do yourself a favour and don't go to this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOc1psRnNZMTgzYkdWb1drRkdUMUZEWWxOTmMxRRAB",
            "text": "I was very disappointed that the restaurant did not offer classical Italian dishes like fettucine alfredo, penne ala vodka and pizza. we tried the ravioli in the pistachio pesto which was pretty good ,the gnocci and the pasta in plain butter for the kids but the portions were incredibly small and over priced I was charged 36 dollars for the pasta in butter. in my opinion not worth the hype at all we enjoyed ourselves in the restaurants in little Italy a great deal more and paid a fraction of the price."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjdGNGZzVlRXN5TUd4V1pWOU9kalpLUzNFNFFuYxAB",
            "text": "Just some great food, simple dishes that let the ingredients do the talking. Linguine and clams, so good. It was all good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsaE4zbGhRVGh0YVZSU2VUaDVZakZuZFdNeWVWRRAB",
            "text": "Wonderful food, great service, reasonable prices.  Would definitely dine here again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WbFlXc3hTRXRxUVY5b1MxY3hSR2ROYW1OU1UwRRAB",
            "text": "I walked into this beautiful restaurant literally by accident. I sat at the bar and the bartender (Britney) explained that if we sat at the bar we would have to order food, luckily for her i love italian food, hahaha! When i say i had the best customer experience ever!! Ive been in NYC for years and its always a hit or miss, I just want to say this was a HIT!! Britney not only greeted us with so much love and respect BUT made us feel SOO comfortable immediately! I can not wait to go back and have the dine in experience that we had. The food was delicious and fresh, the cocktails for 10/10 and the customer service that Brit gave us was super top notch! Looking forward to our next visit! Thanks Brit."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201aVlrTXdPSFpxTW5VMlprMUhWMVp0VEY5T2FGRRAB",
            "text": "The service is wonderful and I would recommend coming here if you want to feel taken care of.  The pasta is okay, but for 20+ per pasta dish, I was hoping for more pasta or a higher quality."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kR2NUSkVWME5xY1c4MGF6Qk1aVXhCWTNGSVozYxAB",
            "text": "Great food, friendly staff, warm atmosphere, and a lovely night!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2todVQxRm5aVE5zWlRCaU9IZDBNbGxEWVROTk4wRRAB",
            "text": "What a great experience and truly a beautiful story of family history and cuisine. Anyone leaving a bad review of this place and any other small mom and pop shop should be ashamed. You put food on a such pedestal you forget the humanity and the people making it for you. Shame to anyone not giving this place 5 stars"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CMmNIZGlUWHBEZDBGTWRYaHlaVkJSUVRCZlUzYxAB",
            "text": "The food, drinks, and service were excellent! Highly recommend trying the Orecchiette."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSWVlYRnRiMjVMUlVFdFZrWnBVRFV0UkRCNVpuYxAB",
            "text": "This was such an overpriced disappointment.\n\nWe did the pasta tasting menu for $75 and $85 for gluten free. Normally a tasting menu seems a bit special, you’re paying more to relax with your meal and try a few different options. But here they put a small portion of two different pastas on one ugly, long plate.\n\nThe homemade pasta were very nice, even if the gluten free were undercooked, but the sauces were terrible. None tasted as if they were made from scratch, which would have been impossible with the speed we were served. All the sauces were very watery, and the tasting menu lacked a good variety. I had to douse the last sauce with Parmesan cheese it had such a soapy liske taste. I’d say maybe we had a full portion of their pasta, maybe a bit more, but for 2.5X the price.\n\nThe servers tried on two occasions to take my plate while I was still eating to serve the next course. A five course tasting menu in under an hour is crazy.\n\nPlus, the place had a terrible atmosphere. There was a windowed room servicing station area that was messy. Directly behind me in one corner was a huge area covered in garbage bags.\n\nThis is an absolute skip."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210MlMxSnBVVlp6TjFneFRYTk9kaTFJZEVkWFFWRRAB",
            "text": "Very overpriced considering the quality of the pasta. I had pasta with scallops and lobster sauce; was no where in the between what I was expected. Scallops and pasta were overcooked. Very disappointing."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxaWRHVlhia0ZmWm10eGRUUmxSVFpXTFhWT01sRRAB",
            "text": "AVOID - it was probably the worst Italian food I have eaten in many years. This was a huge letdown and a wasted meal in NYC. For the cost and the quality, I would have rather picked up some fast food and called it a night.\n\nThe rigatoni carbonara just plain bad, to the point where I didn’t want it replaced or a different dish.The meatballs were dry. The panzerottis were flavourless. You would have a hard time convincing me that the sauces weren't out of a jar.\n\nWe love Italian and love pasta but this meal just entirely missed the mark and I highly recommend against it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKbkxWcFNWMHR2Y2xKVGVFbFJlRzB0VG1GVlFXYxAB",
            "text": "We were so excited based on the menu and reviews but were left disappointed- didn’t even finish two dishes we were so underwhelmed."
        },
        {
            "date": "2달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zMVkwTlliRkZOWWtKcGJteGhRek13TjFJMFEyYxAB",
            "text": "Чисто, уютно, вкусно! Обслуживание замечательное! Спасибо ❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjNFUyaGpMVVZWU25WMmEzWk9OV0k1TkVsdE9XYxAB",
            "text": "So glad I finally got to make here. What a treat! Nonna Dora still makes the pasta with her team every day and Astrid and her staff serve it up delicious every night! Fresh, al dente, delicious preparations. I had to fly solo this time as our original plan to dine with family and friends got scuttled earlier this summer. Overwhelmed by all the options and the fear that I couldn't make a dent in two regular size bowls of pasta, I went with the restaurant week menu. Eggplant parm to start and Straw and Hay with tomatoes and burrata and fettucine with mushrooms and truffle. Finished with a tiramisu. I'm stuffed. Nonna Dora would be proud.\n\nRun by family who made me feel like family. I'll definitely be back and will let my food snob friends know how great it is. I'll return with my husband so we can dig deeper into the menu and try all the amazing pastas on here. Thanks, Astrid and team!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBeGVQZjd3RRAB",
            "text": "It was ok. But I had high expectations and I was a bit disappointed. The homemade amaro was pretty bad. The food/pasta was ok, so the vibe. We share multiple dishes. Nothing was bad but nothing was spectacular. I was a bit disappointed by the boar ragù, as I know how good it could be in Italy. I am not sure if I would go back, especially for the price"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMFltdGhXalYxYTNGNlFUaEJTRWRoY0ZaalYxRRAB",
            "text": "Food amazing, and awesome dessert. Thanks to Francisco for taking care of us and guide us… Excellent Service!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kaFpWVlJVMVJWTkZWVGRqRnRielJyZVhCb2VtYxAB",
            "text": "Service was great. Food was really delicious. We’ve had a three course meal, which was superb. Service was nice and very attentive. Really recommended for pasta lovers. Will definitely come back."
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOcExVUmlhVUppVlZGNVJreFNXVFpEYVZFMmJXYxAB",
            "text": "Fantastico!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjeVVGQmpWRU5HVUV4cllXWnhOWEI1Um1WS1lrRRAB",
            "text": "This was first time dining at Nonna Dora's. Holy smokes! Where to even begin...The bread, delish, the eggplant appetizer, delish, the beet salad, delish, the pappardelle with wild boar ragu, delish, and the frozen chocolate mousse-delish. I can't wait to return! Special thank you to Brit, our fabulous server! Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oNFgzUlRhR1V5Vld0V1JuVlVla3BqTWtwMFJFRRAB",
            "text": "Great spot! Excellent service and food. All homemade pastas and great wine. Highly recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdWNGQlZjRWhJTFZoVldqWkhZbEp4Y0U4NGRuYxAB",
            "text": "If you’re thinking of dining here, do yourself a favor and hope George isn’t working. Hands down one of the rudest, most condescending people I’ve ever encountered in hospitality—and I use that word loosely, because there was nothing hospitable about him. From the moment we walked in, his attitude was dismissive, cold, and flat-out disrespectful.\n\nThere’s no excuse for that kind of behavior in any setting, let alone one where you’re supposedly welcoming guests. George made the entire experience uncomfortable and honestly ruined the night before it even began.\n\nThere are so many amazing restaurants in the neighborhood with friendly staff, support them instead."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5clZYRm9URVZoUzNsbmNXaGZkekZUYkZsRmRIYxAB",
            "text": "Creative menu with something for everyone"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KNVUwSXhiSHB5YTBsZlFUQlVlUzExVVhoUlNtYxAB",
            "text": "The most delicious pasta I’ve had in New York City\nEveryone should run to this restaurant"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKeGJsRkZRVXhWUmxGRGFYaHNhMVkyWTBnNFYyYxAB",
            "text": "Host made it seem the place was super busy and said if we didn’t have reservations we couldn’t be sat. Thankfully we seated, no one else’s came in the next 2 hours so am unsure what she meant by super busy or booked. The Waiter then recommend a dish that unfortunately I did not like whatsoever and it had a bitter taste. Definitely not worth the price that all the food is worth. Wasted a good chunk of money to not finish my food and have a stomachache after."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWek1HbFVXWFJFWTBwMmVEVlVWRFZzU1dWZlRGRRAB",
            "text": "Pasta was hard and one of the dishes with scallops tasted very fishy"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oS1VVOXRMUzEzTlhwNGQzaHFSRkoyZDNkbVlsRRAB",
            "text": "can't say anything about the food, but will not be coming back here to try. i came here on friday night with a friend to celebrate her birthday, but we chose to do walk-ins instead of reservations since there weren't any open reservations and didn't mind waiting. a middle-aged man greeted me once i walked in, and when i asked if we could have a table for 2, he ask if we had reservations, to which I said no. he then rudely scoffed in disgust saying there's no seats. i asked if we could wait, and he scoffed again saying no because they're full for the night.\n\ni totally understand not having any available tables in the moment or for the rest of the night, but given there is nothing about this place or nowhere on their website that says they're reservations *only*, there are thousands of different ways he could have told us they weren't accepting walk-ins the rest of the night in a kind, polite manner. this guy needs serious retraining in hospitality and service delivery, and if he's the owner, then you really should find another business to run than one that's supposed to be founded on hospitality."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjNFUzWm1ZbU16ZG1ONGJGZHFTMFJXTTFCQmNHYxAB",
            "text": "Very bad experience. Ordered the rabbit ragu pasta. Tasted terrible and had rabbit bones in it. When I complained about the rabbit bone they told me it is normal and hard to remove the bones. They refused to take it off the bill."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xRU0ybExOSE5VYVd0a1YxWnpjbWRFY1UxRk5sRRAB",
            "text": "Lived their 5 course meal! So tasty.\nThe service was fabulous."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toU0xXdFBVRWhMVG5aaVRWZFZSa05hWldnMFkyYxAB",
            "text": "Clams were fantastic, as was the lasagna.  Just excellent Italian fare."
        },
        {
            "date": "3달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWVldGWkZZMG8yVjBOMFZuaHFTbEIwV1VsRk5tYxAB",
            "text": "Cuisine très bonne. Service impeccable et accueil très chaleureux. Je recommande vivement. Spécial merci au gérant du restaurant très sympathique."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONmN6aHFUamxzTTNCNVUyNHdiVkZWYzNJd1MzYxAB",
            "text": "Best gluten free pasta I have ever had, one of my favorite gluten free pasta Italian experiences in the US. the atmosphere was great, the staff was so friendly and went around to every table to interact with everyone. A water never went empty and our table was constantly attended to. No complaints, I would come back here in a heartbeat and would recommend it to anyone gluten free or not gluten free."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkQ1NHbEZRVmhUUWtvdFkwWk9Wek5UZGtaUFZFRRAB",
            "text": "The food and atmosphere were great . But unfortunately we had a racist server Mr A who completely spoilt our dinner . He started off dinner calling us a table full of brown ppl and ended by telling us our community never tips well after he was not satisfied with a $50 tip. We won’t be returning"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ad2NXSm1SR2hVZEdsTmNuVmlTekJNV0ZNdFRtYxAB",
            "text": "This is by bar on my top 3 favorite Italian restaurants of ALL time.\n\nFor starters, the staff was amazing. She was quick, professional, personable, and took her time to patiently explain the menu. We were so lucky she even brought us the fried calzones to try and they were amazing! That dough was so fluffy and crispy, I could have eaten six (they’re very small).\n\nMy favorite part was watching the girls behind the clear glass hand making all the mess cool different color pastas and variations. The precision that went into perfectly crafty each and every one of them was amazing. The fact that they took so much time and care into crafting each one alone is a reason to support and pay for the quality of this pasta.\n\nWe ordered the arugula salad, meatballs, lasagna, and bolognese. These meatballs omg, the best over heard had. Unlike the spongy like taste in many, these had the perfect texture and flavored covered in super fresh tomato sauce. The lasagna was delicious. Huge portion, I barely ate half. The winner was the amazing fresh sauce poured over. It tasted like the tomatoes were picked from the garden the day off and handled with care directly into the plate. The noodles on the bolognese melted in your mouth. Everything was perfectly seasoned, piping hot, and made with great quality and ingredients. Don’t sleep on that complimentary bread either! It was a combination of soft and tender bread with a crunchy coat with tomatoes embedded in it. The tomatoes were sooo fresh and so delicious, no dipping sauces or oil was needed. They were perfect.\n\nWe took the bus on broadway at just 6 stops and walks one block to our destination. Very easy to find. I am so glad we decided to try this place and can’t wait to go again. This place is truly amazing and deserves every single start. I didn’t get to meet non a Dora who I hear is there mostly every day hand making her pastas at the table.\n\nI would recommend this place over and over again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSVlYWm9XbVpMYWw5aFNFOW5jR1ZFVldZeWFFRRAB",
            "text": "Nonna's was wonderful! Not to be confused with the place that the movie \"Nonna's\" with Vince Vaghne is based off of. Our family went to Nonna Dora's for dinner and had a great experience.\nThe service, food, and atmosphere was top notch and exactly what we were looking for in our last New York night before heading home.\n\nThe meatball appetizer, burrata appetizer, and beat salad were all tasty. You can tell the pasta entrees are made with handmade pasta, as every single one was unique and delicious.\n\nNonna Dora's has a heartfelt story about how the restaurant was started. It was truly a wonderul experience. We really enjoyed it. Thank you for everything!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZeFVITldObFU1YjJkQ1NFWkVRMUZyYWpKNmNIYxAB",
            "text": "Celebrated my wife and I’s 6 year wedding anniversary and this place is FANTASTIC!!!! Luka was amazing! Very attentive, well knowledgeable, an all around great person to visit at Nonna Dora’s. YOU HAVE TO COME HERE!!!!!!!!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMGVWRjBXRkZMV1VkNlNVODFVVFo2VDJ4dWNXYxAB",
            "text": "Came here on a Friday night on a whim and was so happy we got spots up at the dining bar. The ambience was wonderful and the service even better! The hosts were warm and inviting and our server was so great - even throwing in some extra desserts for us. We had a variety of things that were all terrific - fried calamari (French fries of the sea!) and panzerotti were some app highlights. I went with the vegetarian tasting menu and my favorites from that menu were the paglia e fieno and tagliatelle with mushrooms. The portion sizes for the tasting menu were manageable and not overly filling. Dessert with the tasting menus included nutella panzerotti but we also tried the panna cotta from the dessert menu. There were honestly so many more pasta options and dessert options to try that I will definitely be coming back to get some more! A true gem in the middle of Kips Bay."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNFNXbExPRkZRTm5CSGNVUmtNMGs1Ym5oSVJYYxAB",
            "text": "Service a major plus.\n\nGet a bottle and enjoy three courses - will not disappoint."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VQaXRyTmpnLTlLaUpREAE",
            "text": "The food is decent, but somewhat overpriced.  The service was prompt and attentive.  You will need to select from their 3- or 5-course tasting menu.\n\nThe portions are quite small — especially if you’re ordering salads for appetizers.  The flavors are somewhat underwhelming.\n\nFor our dinner, we ordered meatballs and seafood salad for appetizers; squid linguine with clams and shrimp mezzelune for the main course; and panna cotta for dessert.\n\nThe meatballs were my least favorite dish.  The ground beef was quite dry, bland — and just boring. The mince needed cumin, garlic, and onions, IMO.  The marinara sauce was extremely underwhelming.  It tasted like generic canned marinara sauce. It certainly didn’t taste like an Italian grandma’s slowly simmered Sunday sauce — or something that any self-respecting Nonna would permit to be served at the table.  I sorely regret not getting the eggplant appetizer — which looked amazing.\n\nThe shiitake mushrooms on top of the shrimp ravioli were sad and flavorless.  They lacked the delicious, umani flavor characteristic of shiitakes.  I’m guessing they used frozen mushrooms — and didn’t sauté them properly.  I say this as someone who regularly cooks with fresh shiitakes — and who once made the tragic mistake of using frozen.  As a moderately proficient home cook, I could have easily prepared something better — so maybe I’m more critical than the average reviewer.  Still, this is shameful quality for any decent restaurant.  It’s a very small detail — but it’s what makes a meal special and exciting.\n\nThe restaurant itself is located in a very modest space, on the first floor of an apartment building.  It’s easy to miss. The ambiance felt like something in a fast-casual chain restaurant — rather than in an Italian grandmother’s kitchen.  Everything felt industrial and impersonal — and somehow unloved.  Ironically, it’s right next door to a Chipotle.\n\nOn the positive side, our waitress was friendly and helpful.  The restaurant was clean and quiet.  The pasta was quite good.  It’s made-from-scratch — and there were lots of gluten-free options.  It was bouncy, chewy, and flavorful — and everything that you would expect from a Nonna’s homemade pasta.\n\nOverall, the food wasn’t bad.  The shrimp mezzelune and the panna cotta were my favorite dishes.  The ravioli pasta and shrimp filling were very good.  The fruit compote and vanilla custard were absolutely delightful — although the serving was tragically minuscule. (I considered getting seconds.)\n\nIt’s probably best to come during lunch — when you can personally observe Nonna Dora making the pasta.  Perhaps the quality of the food is better during lunch, when Nonna is carefully watching — and standing at the ready with her rolling pin.\n\nIt’s 3/5 stars for me — it’s definitely not bad — but not anything special either.  Instead of Nonna, it looks like Cousin Vinny was perhaps doing the cooking that evening.\n\nThe quality of the food probably depends upon who’s cooking — and whether Nonna is watching."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPTDRwdHZiX3BQcHRBRRAB",
            "text": "Amazing food and very warm service! Definitely worth the trip! Even though we don’t get to see the Nonna make the pasta, we definitely felt the warmth!! Very homey vibes and soul satisfying food. Went for the orecchiette, stayed for the rigatoni carbonara❤️ amazing!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNX24yYUtEaXFyU1dnEAE",
            "text": "Came to Nonna Dora for dinner and had the 3-course dinner. Great service all around. I had the cavatelli with broccoli rabe and almonds— it needed more flavor. My friend got the rabbit ragu, which was much better. My fav was my chocolate mousse dessert, which was super rich and creamy. Overall, some hits and misses, and honestly, it felt a bit overpriced."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBanNhcXRnRRAB",
            "text": "One of the best dining experiences I’ve ever had. Special occasion in New York City and found it through the reviews of local New Yorkers and never looked back! The pasta is heavenly and all the dining staff were so nice and accommodating. Also great vegetarian options.\n\nHighly recommended 10/10."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMF9uaExBEAE",
            "text": "Had the best pasta here! Definitely coming back to try more. The desserts like semifreddo, tiramisu and panzerotti dolci were amazing—highly recommend trying them.\nWe sat at the bar and the bartender (wish I caught her name) gave us the best service, always checking in to make sure we had a great experience. Loved it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdmFuajdRRRAB",
            "text": "Nonna Dora’s is the real deal. The pasta is all homemade and the ingredients are fresh. Every pasta dish we had was delicate in that nothing felt heavy (not too much butter, not too much cheese). Absolutely spectacular. Service was also fantastic. It’s a small space, most of the seating is high top tables and a long bar. Will absolutely be coming back"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZc3BqR1N3EAE",
            "text": "Very good experience! Yummy food and great service. Attentive to our experience in sending the dishes ordered. Missed taking a  picture of the meatballs as a starter - best dish!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqeGQtOUd3EAE",
            "text": "May 2025 update.\n\nFood and service remain excellent. The new menu eliminating ala carte is the only downside. Three courses is a lot of food, and a 2 course, offering appetizer plus pasta main, or pasta main plus dessert would be attractive as an option. The pasta main course is pretty big, and very enjoyable, but combined with appetizer and dessert, makes for a very filling dinner. We actually had the dessert as a take away this evening.\n\nA great place for wonderful pasta dishes. Pasta made fresh every day, and an exceedingly good dinner menu. Wait service is excellent, very attentive and knowledgeable on both the food and the wine.\nReservations hard to get, so plan ahead."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmai1yRWRnEAE",
            "text": "Nonna Dora’s is like stumbling into your Italian grandmother’s kitchen—if your nonna happened to be making pasta by hand in the heart of New York City. This tiny spot may be small in size, but its charm is huge. With a compact kitchen and a laser focus on their specialty (pasta!), it’s clear this place knows how to do one thing exceptionally well. Trust me, simplicity never tasted so good.\n\nThe Experience\nI snagged a seat at the bar, and despite the place being packed, the service was quick and personal. The space is tight, with only a handful of tables, but it adds to its cozy, intimate vibe. Watching Nonna herself handcrafting pasta right in front of me was a highlight—it’s authenticity at its finest.\n\nThe food:\nI started with some crispy calamari, tender meatballs, and a refreshing octopus salad that balanced bright, citrusy flavors with perfectly cooked octopus. Then came the star dishes: a bowl of Ceci e Tria, where the contrast between the boiled pasta and crispy fried bits was a delightful surprise, and the Orecchiette, which was rich and perfectly cooked. I finished with a light and tangy berries cheesecake that wrapped up the meal beautifully.\n\nNonna Dora’s is the perfect spot for a pasta pilgrimage. Spot-on flavors and texture contrasts, and you’ve got a recipe for a unique meal. If you’re a carb lover like me, this place is a must-visit. Just don’t expect to linger too long—it’s all about the pasta here, baby!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmN09lT29BRRAB",
            "text": "Nonna. Dora. You’ve done it again. (We’ve only been there once). That was DELECTABLE. The food was incredibly delicious. Not only was there a million pasta options to choose from (all sounding AMAZING), but our server (Ahmed) kept refilling our table with some of the most delicious focaccia bread I’ve tasted. FOR FREE. Outstanding service. Also, my sister and I wanted to share two different types of pasta, and the chefs went out of their way to split the pasta into separate bowls themselves meaning we did not need to fight for our halves of the food and make a mess of the table or have too many extra plates taking up space (hence why the portions look smaller in the pics) . Genius. Ahmed was chatty and vibrant and made our night enjoyable. Give that man a raise Nonna D!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcmZpalN3EAE",
            "text": "Went on Thursday night with my cousin during our visit to NY.  From the moment we walked in, the attention and treatment were stellar.   Sat at special table (Nicola's table)  and loved it!  Asked for recommendations and popular dishes, although truly everything on the menu sounds (and surely IS) scrumptious.\nVery fresh and delicious pasta paured with a fantastic wine list and cocktails.\nTo start our prefixe we went with: burrata, panzerotti, and meatballs.\nAll fresh and light. Incredible flavors for our begining.\nMain courses were : the gnocchi (pillowy, fluffy, tender, creamy, evenly coated in pesto)  and pappardelle with wild boar ragu (rich beautifully cocked, tender meat, seasoned to perfection and the pasta eas beautifully aldente)\nA classic tiramisu and afogato were our endulgence to the sweet tooth but couldnt help trying the panzerotti dolci (filled with nutella)\nFinished our meal and night with espressos and limoncello as well as the promise to come back earlier next time to spend some time with Nona.  Loved our time there and had fantastic conversation and laughs with Nicola all through our meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzN0lETDRRRRAB",
            "text": "Really delicious! Fresh, handmade pasta, quick and efficient service and kind waiters who speak Italian. You can’t miss. The perfect date night spot with a lovely range of wines and creative cocktails. We were in and out in an hour, so definitely not a place for a slower or more romantic evening. They are not pretentious, stuffy or formal so if low-key, laidback date nights are your thing… this is perfect. Request a high top or a seat at the bar for more of a buzz, preferred for me over their lower tables."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuanVpZUJ3EAE",
            "text": "Thought the atmosphere and service was good but the food was lacking. For the price, we didn’t think it was worth it since there are many better options in the area.\n\nThe Resy reservation system was confusing since there are three different options and no descriptions. Booked a table which I thought was a table and got sat at the bar. But I thought the bar was pretty cool if you feel like chatting or enjoy sitting at the bar.\n\nFood was disappointing though since I had high hopes.\n- meatballs were on the dry and chewy side. I prefer meatballs where they are soft and easily breakable but these were harder to break and not amazing.\n- boar ragu felt like it was missing something. It was okay but lacked a primary flavor. Lots of meat which I thought was good value\n- lasagna was good but the center was cold… unfortunate since it was our favorite but cold inside"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MGVTVzh3RRAB",
            "text": "Best restaurant in New York City, and some of the best Italian dishes I’ve ever had, coming from someone who lived in Italy! I take everyone I know here, and it’s always my first recommendation to anyone visiting New York. Staff is wonderful."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRb29fM0t3EAE",
            "text": "Had dinner on a Sunday night at 7:30pm. Didn’t realize you had to pick either a 3 course or 5 course meal (no a la carte option), but ended up working out. Decided to do the 3 course meal that was $54 (appetizer, entree, and dessert). We ordered the burrata and fried calamari, orecchiette in rabbit ragù and tagliatelle with mushrooms, in a salsa tartufata then ended it with tiramisu. We thought everything was delicious, especially the orecchiette pasta (flavorful and the pasta was cooked perfectly). The focaccia bread were a bit stale though. The service was great and very attentive, and the food came out promptly. I also like how they give you still and sparkling water without asking to choose one. The space is a bit small, esp the two seater tables at the front right in front of the window (would’ve been better sitting at the bar). Overall, it was a great dining experience and the food was excellent!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dlBTMHFBRRAB",
            "text": "Nonna Dora’s is such a terrific restaurant!  The pasta is delicious and the service is excellent as well.\n\nPlus, I love how they have an extensive Negroni menu.  I had two of them and both were great.  Plus, they were a really good value as they used high end ingredients and were a very good size.\n\nThe next time I’m in New York, I’ll be back!!!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURadnF6UWpnRRAB",
            "text": "Truly excellent pasta. I was worried that it would be just another hyped Italian restaurant, but the food, especially the pasta, was delightful. The cappeletti were flavorful, juicy, and melting in my mouth. The anchovies on bread were simple yet buttery sweetness. The chocolate semifreddo was also really good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoOFByU1NnEAE",
            "text": "This might be my favorite Italian spot in the city! The food is incredible! The pasta is very fresh! The dessert is phenomenal- I recommend the cheesecake (and I am not even a cheesecake fan)! The service was the best part! They are kind and it truly feels like a mom and pop Italian spot!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSaDlLUGhRRRAB",
            "text": "Honestly saying, I would give just one star to this place. But I realized that there is one star behind the scene - nonna Dora.\n\nI wanted to run away as we stepped in. The owner told us \"make sure that you will leave soon, this table is booked later\". We were confused, we sat down. And from the very first minute of service we felt rushed.  We also mentioned in our reservation, that it was a birthday celebration, but this info was not important to them as \"here is a check, even you didn't ask for it\" (repeated twice!)\n\nI wouldn't say that ambiance was wow, maybe if only you are sitting at the bar.\n\nWe tried 4 pastas: malloredus, orecchiette, garganelli and burn wheat pasta. Wheat pasta was bland, with raw green peas for whatever reason. When we complained they just said, \"well, you know better\", and nothing happened after - the pasta was still in a check, which was presented as soon as the last drop of wine was gone, even though we were still eating desserts.\n\nOrecchiette were great, but nothing mentioned it would be spicy , and my friend who ordered it, doesn't eat spicy. We had appetizers, panzerotti, fave e cicoria and calamari.\nOur verdict: nonna Dora makes a good job, but someone in the kitchen ruins it, so in the end of the day the hype about this place is absolutely ridiculous.\n\nWe couldn't enjoy anything, the food, wine (by the way we wanted to order more but the check was already on the table) or conversation. We decided to pay and go some place nice to celebrate and to be treated like guests, not like a wallet bringing them money and tips!\n\nIt took us one hour to eat and \"celebrate\" bday. Horrible, horrible service!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodDc3VWZnEAE",
            "text": "Came here after hearing about it online.  It was absolutely delicious.  I had a negroni, which was balanced and not too sweet.  We got the panzerotti (baby calzones) to start.  The dough was fluffy and crispy on the outside, but soft on the inside, and not too greasy.  The mozzarella filling was so fresh and tasty, and the tomatoes were flavorful and well seasoned.\n\nWe had the malloreddus and the tagliatelle.  The malloreddus was fantastic.  Tender homemade pasta in a saffron flavored sauce went perfectly with the sausage and tomato base.  The tagliatelle was fresh and delicious, and everything looked amazing.  Highly recommend this place.\n\nAlso got the tiramisu, which was pretty good, but not at the same level of the pasta."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodl9QNXZRRRAB",
            "text": "Great casual pasta house on 2nd Avenue.\nWe were greeted by a friendly hostess and promptly seated, and our waiter was friendly and attentive during our entire experience.\nA great variety of wines and pastas, all our dishes were nicely executed, very flavorful, and of course delicious!\nThe Polpette (meatballs) was the standout for me.\nWe also ordered the Calamari Fries, Pappardelle Del Ristoro and the special which was crab meat tossed in pasta.\nDefinitely recommend for a great Italian meal in Murray Hill area.\n\n2nd visit Spring 2024: As excellent as ever!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1bS1LNGVBEAE",
            "text": "I LOVED this new spot. Hands down the best Lasagna I’ve had in the city! It’s a small spot with a beautiful interior. We really enjoyed the service and professionalism of the waiting staff. The Lasagna had perfectly cooked noodles, an incredible béchamel, and a delectable meat sauce. I will be back! Feels like a family joint through and through."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLM3o4clNUOU9XM2d3RRAB",
            "text": "verall, very good food with large selection of pasta choices. For the price point, a tad expensive but the quality is there for sure."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobC1LSzBRRRAB",
            "text": "We had pasta tasting and one more pasta after some antipasto. All the dishes were great and pasta’s’ texture were great.\nORECCHIETTE IN RABBIT RAGÚ was really good and we liked CAVATELLI WITH BROCCOLI…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPNHY3MjNnRRAB",
            "text": "Great little pasta restaurant though to be honest I wanted to love this place more than I did - who wouldn’t be touched by an 86 year old grandma hand rolling pastas. And the pasta itself is amazing and the service friendly. It’s just that…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyMjRPNHBnRRAB",
            "text": "Incredible handmade pasta, but don't be fooled by the low number of reviews into thinking that this is a \"hidden\" gem - we went at 830pm on a Wednesday and it was packed! We managed to snag the last 2 countertop seats. They save a few seats for walk ins but you can also reserve online (do so in advance!)\n\nFOOD - we loved everything we ordered, cleaned our plates. There are a LOT of pasta and appetizer options and I can't wait to try more! We got:\n- Buratta: solid app, tasty cheese, what more could you ask for\n- Focaccia: DELICIOUS FREE BREAD. Need I say more\n- Mini calzones: fun little pockets of fresh mozzarella cheese and a bit of tomato sauce. Could've used more sauce but tasty nonetheless\n- Rabbit ragu orecchiete: perfectly al dente, great ragu. Not too salty and very flavorful (which for me can be an issue sometimes at Italian restaurants)\n- Shrimp & mushroom stuffed mezzalune: incredible, the star of the show. Would recommend pairing with another more acidic pasta for variety, but the flavors were delicious and the sauce perfectly creamy\n- Berry panna cotta: small but mighty! If you love panna cottas (or generally creamy pudding-like desserts with berry jam) you'll love this.\n- Honorable mention - also got a tasty cocktail - they have some yummy tropical drinks. Forgot the name of the one we got.\n\nPRICE - most pastas were around $28/plate, with seafood ones (like a lobster pasta) being a bit higher. Appetizers around $12-15 and dessert at $10. I would say mid-upper range for Italian but the portions were solid (no huge plates with 3 raviolis here) and all the pastas are handmade.\n\nVIBES - surprisingly very modern decor - cozy but not the traditional grandmas kitchen/hole-in-the-wall vibes I expected. Place was also a bit larger than we assumed from reviews, although not exactly roomy. Mostly countertop seating next to other people although we did see a large table for bigger parties. Would recommend a reservation if your group has more than 1-3 people. Great for dates or just dining by yourself! Self date!\n\nSERVICE - We had a super lovely waitress, I didn't catch her name but she was great. Food came perfectly timed, very friendly and great recommendations. We did encounter a few gruff older Italian employees (authentic I suppose?) but it didn't take away from the experience, was just a bit odd. For example the host at the front didn't say a word to me, it felt like I was having a conversation with myself. I asked how long the wait was since the place looked packed and he just nodded his head towards the last two empty seats, I asked if we could just seat ourselves / take those and assumed his noncommittal shrug-nod meant yes. Lol.\n\nAnyway, overall one of my new favorite pasta spots in the city!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtdGNPUjd3RRAB",
            "text": "Loved every moment of this experience.\n\nThe service is fantastic and the food is exceptional.\n\nOn a random evening we were walking past and there were seats available. So my husband and I took the opportunity to dine.\n\nAside from being very well executed food, I must admit to being very impressed by the bar. To this point, it's also one of the most extensive Negroni Menus I've seen.\n\nSolid spot for cocktails also."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbEphNXVRRRAB",
            "text": "Great service (first place I've seen providing both still and sparkling water on the table, plus super good focaccia), the pasta tasting menu is a great deal to experience different styles. If you are a Negroni fan, you will not get disappointed! I will have to come back to try their tiramisù 😏"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtOWZPNEVREAE",
            "text": "Generally liked this place. The baked eggplant was my favorite thing there, must get. Had the orecchiette, lasagna, tarantella, calamari, burrata. Would skip the taronella w lobster; just tasted like pool water. The orecchiette was decent,…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dWVqdHVnRRAB",
            "text": "Had an absolutely fantastic time at Nonna Dora’s. Started with some delicious cocktails and the calamari and anchovies. Then went into the vegetarian tasting menu (ravioli, straw and hay, and truffle mushroom pasta) and the meat tasting menu (broccoli rabe, rabbit ragu, and duck confit). The broccoli rabe dish needed some more salt so we got some cheese to help. Overall, it was a VERY filling meal for $56. Was not expecting to get three meals with it. Also, the service was great. Would love to come back for more food!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURKcGVzeRAB",
            "text": "I came here with my little guy for lunch recently, and we enjoyed a relaxed, delicious meal. Upon entering, we encountered Nonna Dora herself quietly shaping pasta by hand.  The bar has an impressive array of amaro on display, which reflects the depth of the bar program itself. Besides 10 varieties of Negronis, the cocktail list features a robust selection of classics and Caribbean-influenced drinks, as well as ample selections of wines by the glass. Quite honestly, the optionality is far beyond anything you’d expect from a casual pasta bar. I enjoyed the Negroni Satsumato, which came pre-mixed in a single serving bottle. The kitchen was kind enough to make a simple butter and cheese pasta for my 2 year old (but at $24. I wish I would have just ordered him something off the menu that would end up being the same price). I went with the ravioli, which was delicious and flavorful. The food quality is great, but skews on the pricey side. Definitely worth a stop for both quality and depth of pasta and beverage choices."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbWRTdHB3RRAB",
            "text": "Nonna Dora’s is very unassuming restaurant, nestled between a healthcare clinic and a chipotle, but the food is excellent.\n\nThe complimentary bread with roasted tomatoes to start of the meal sets the tone, and they offer a great pre fixed meal option (appetizer, any main, and dessert) for $55 a person.\n\nThe Negronis are delicious. The lasagna was by far our favorite. My fiancé didn’t love her wild boar ragu, but overall we were very satisfied. We will definitely be back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncTdYdDJnRRAB",
            "text": "Had the Rucola, Tagliatelle and Torta Di Ricotta. Everything was delicious! Best pasta I've ever had. The staff was great, had a great experience."
        }
    ],
    "reviews_count": 83
}