{
    "name": "Sunflower Gramercy",
    "place_id": "ChIJs1F-yH5ZwokRYHDSSp_-SGk",
    "grid": "MN6",
    "address": "335 3rd Ave, New York, NY 10010, USA",
    "rating": 4.3,
    "user_ratings_total": 491,
    "phone_number": "(917) 262-0804",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xacmVEWjFRak5rWlVNMlRrbG5RMmhuYmtsR2VXYxAB",
            "text": "Decent food but always super cramped!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WVU5YZGhaMVZhVVZwWU4zbFBUWGhyT1hkUlQwRRAB",
            "text": "The food is really good here . My children and I enjoyed our selves. The staff is great"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOV1QwOXZXVEZMUVRZNFF6QkVhRmhHVkVreWIxRRAB",
            "text": "Must visit!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cc1V6SkdTbkpLZVRodlVGZDFaMFYzZURCVlEyYxAB",
            "text": "Came into today for an early lunch and sat outside with some friends, the breakbowl was amazing and service was quick and friendly. Will definitely return!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWaGRraGlUREJvWjJ0UVZtODBlVjlpUlVObWEyYxAB",
            "text": "I just left the Sunflower Gramercy and was turned away with my service dog (for tactile dysfunction.) I wanted to sit at an available table outside and I offered to show my dogs papers. The two women working there told\nMe that the table was reserved for one of them (an employee.) There were two available tables inside but I was told the employees get first choice of where they want to sit and eat their lunch. I’ve never been more figured or appalled by this customer service I received. I was told the manager’s name is Ross Kap and that he would approve of this."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CMU5HVkhVWFZ5WlVSblMzbDNSbGhJZUVFd01FRRAB",
            "text": "Nice place for coffee and food with outdoor seating and a big choice on the members. It wasn't the cleanest, the table was dusty and my water jogging came with stains on it but otherwise food was nice and people were lovely."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xodVVHRTFRVGg2VG5kV2NXNXNPRXR3YTJ4UE5IYxAB",
            "text": "Quite bland."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wc1dYSnJXVFpyVWxkWVRtOVdkMmhLVUdKRVgwRRAB",
            "text": "The food was soooo good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toMGJESkxNbmx3Um1aNVlXWjNMVU54TVU1dVprRRAB",
            "text": "Good place for breakfast"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WVlJWYzNXSHA1UTBoSFEwaE5lWFZGTVdzeFRYYxAB",
            "text": "Myself and family wanted to have a special breakfast for my daughter in laws birthday…as we enter the venue the person at the door did anything but welcome us in the restaurant I. Fact she had an attitude and in top they didn’t have a high chair for my granddaughter\nWhen they finally agreed to sit us it was on top of a steel basement door\nAt that point we decided it wasn’t worth the effort to ruin our morning\nWe then went to another restaurant and enjoyed our breakfast"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204NFpXbDZZbUl3UmtWTldtRkxZMlZ4YUdRNFYwRRAB",
            "text": "I arrived with a 3 year old and two other people. The hostest was so rude and dismissive. I asked nicely if rhey had a high chair and was told \"(eyeroll) ...no) . Glad we left, not here you start your Sunday morning"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OME0zaEJiVWRtVGpKd1RrTlNUbmhKZEROWVQyYxAB",
            "text": "What you can say: they Made a diabetes patient willing to risk everything to eat the French toast!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNlZFeG1OVmx1Y3pkMVdtVXhiVTlhYmxweFpsRRAB",
            "text": "Stopped in for breakfast, pancakes with mascarpone and fruit were delicious. Scrambled eggs also. Strong recommend. Thanks to all staff"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZNFFtSTJZMkozZVZkQ2RXUTRRemxhWjJwV01uYxAB",
            "text": "I recently visited this restaurant with a group of friends for brunch. Since they only take walk-ins, the hostess initially told us there would be a 40-minute wait for a table, but surprisingly, we were seated within 10 minutes.\n\nUnfortunately, the experience quickly went downhill. We were seated inside, right under an AC vent that was leaking water. It was uncomfortable, and we were anxious the drops might fall into our food(We later switched to a different table). On top of that, the staff carried themselves with a dismissive attitude, which made us feel unwelcome.\n\nTo make matters worse, one of the main brunch dishes we ordered was never served. When we asked about it, the server insisted it was never ordered, even though it was the first item we had mentioned.\n\nAs for the food, it was very underwhelming. The truffle fries were soggy and overcooked, the tall-stack pancakes tasted bland—more like plain white bread than fluffy pancakes—and the sourdough that came with the pesto pasta was burnt. The brunch dish itself was so disappointing that we barely touched it.\n\nOverall, the combination of poor service, careless attitude, and below-average food made this a very negative experience. We ended up leaving no tip due to the service and cannot recommend this restaurant to others."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Zd1pXUXpTa1JSVFRobVlrOUZURlZTTWxCRWNsRRAB",
            "text": "Good food, bad service.\nI just bring my family to this restaurant everything regarding food is great; flavor & presentation.\nHowever seems like they don't like kids; they gave us bad service, long faces, presure to eat and pay.\nSeems like they did us a favor...but the kids also consume a breakfast and a drink each..."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNlozTkVXbXAyT0ZkS1F6TmtSRkJTVlZsc1ZHYxAB",
            "text": "I recently visited this restaurant and had a stressful experience when it came time to pay. Our original server went on break, and the new server didn’t close out our table. After waiting over 25 minutes for the check, I finally went inside to ask for it, something I normally never do.\n\nThe first bill I was given was wrong. When they brought out a second one, I was already feeling anxious and ended up paying again without double-checking the total. This second charge was much higher, and I couldn’t tell if it was a mistake or just miscommunication.\n\nI went back inside to fix it, but it didn’t feel like my concern was really acknowledged. I asked for a manager or supervisor and was told no one was available. While they did eventually correct the bill, I felt rushed through the process and left unsettled.\n\nWe did part on what felt like good terms, but I still haven’t been refunded for the incorrect charge, and there are multiple pending charges on my account. I’m hoping one of them drops off soon.\n\nI’m sharing this in the hope it helps improve communication and service, especially when mistakes happen it makes a big difference to the guest experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRVQxcEZNblpKY1RKcE16WjNjMGR5Tmw5cVdFRRAB",
            "text": "Colourful little spot, perfect for brunch and pancakes. They had vegan pancakes available and plenty veggie options !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SQ2VWTk5Vekk0YkVSWlpqUjJZVzVrYW5waFJtYxAB",
            "text": "Talk about a delicious breakfast with good portion and a nice ambiance. A small breakfast spot but Big variety of food with reasonable prices. 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeVdWSnNWemhtWjA1SVFVSTJWa3d4ZGs1NlRYYxAB",
            "text": "Love the food and service. I usually come here after work. I tried the smoked salmon and it’s informally not worth getting anymore. All other food is worth it!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwNk9HaFJVRzF0T1VseU4wZE1SVGRxVTJSellXYxAB",
            "text": "I was so involved with my lunch partner…, I forgot to take pictures.., however, I want to point out that I had the BEST tuna sandwich ever!!!  It has a pesto sauce and avocado 🥑… if was incredible!!! They should sell this in jars !! Ha\nThe service could be a little bit better .., I had to get up twice for someone to come over … but that’s okay !!\n\nWe also enjoyed a nice rose … so overall .., a great experience!!!\n\nGo and enjoy !!! Life is too short to eat bad tuna 🍣 haha"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTVZ6Qm5RMmg2ZWtwSGFsbzFRVXRSU2treFNXYxAB",
            "text": "Nice Breakfast place !!!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSbFYyTjZjRmt0U1VOaWRVZFRXVEp3Y1hGMmQwRRAB",
            "text": "Un lugar que vendría siempre a tomar desayuno un un simple cafe 100% recomendado su comida super delicioso"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkUGVVdHlXbXM1WDNnM2EwVjVUbkJIYlVaV0xYYxAB",
            "text": "Omelette was excellent.  The sides were awful (potatoes, avocado) - mushy and badly over-salted.  For a place with gourmet pretensions - & prices - serving only grape jelly was an insult."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5U1VESXdMVXR1VkRSTlFsQlFkM2hNWWxsTWQzYxAB",
            "text": "This Place Is A MUST!!! My “Baby Doll” Wifee, Our Daughter IG @msssavannahj And I REALLY REALLY GIVE THIS SPOT 10 STARS!!!\nThe Young Service, Hostess, Waitress ROCK!!!\nYup, We Had A Delicious BREAKFAST!!!\nTHANKS YA’ll\nLove FROM CALI!!! A MUST!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prelNqQm1TVFZ3V2pCTE1HTklVSGRMTUV4cE9GRRAB",
            "text": "Terrible service, the waitress only did the bare minimum of asking us what we wanted and then setting down the food for us, no check ins on how the food was.\n\nThe food was okay at best even if it looked good, I got the beyond burger with fries and about 1/4 of the burger was burnt to the char. The fries were soggy to an extent and I tried a little of my friend’s dish, and the caramelized sugar on the banana was also burnt and bitter.\n\nOverall the environment of the workers and place did not feel welcoming at all and felt a little judgy, perhaps maybe because we were more casually dressed but that shouldn’t be a reason for it at all? Also I understand waitlists but only having 5 minutes to go back to the restaurant feels like a rush. Personally not a place i would eat at again, not worth it.\n\nThe positive thing I can say about this place is that the place looks nice."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTlRERlhiWGxHZFdkR1RGOWxlbWs0WlhsemVtYxAB",
            "text": "My mother and I had a wonderful breakfast on the patio. The French toast portion was the perfect size to split and beautifully presented."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ca1VuSTNSMUIyZGtkQ2RXbDZSSHB6WVhjd0xWRRAB",
            "text": "Had the best birthday here! Amazing atmosphere, the food was delicious and came out fast, and all of the servers were super sweet and helpful, especially the blond! Can’t wait to come back :)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nd0xWUnhhamhsUkU1eVluaFFaR1pZUkVoM1dFRRAB",
            "text": "I come here all the time the food is so good, kind of a weird vibe earlier in the week there was a new guy behind the bar it felt uncomfortable but will always come back to see Eliana she’s so sweet and plays the best music"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21walJHaEJVRXRzTFhWcU5URlVhbTVsWjJwUWNGRRAB",
            "text": "I just moved in the area and was excited to try this place out however I was disappointed with my visit. The service was slow and the staff today seemed uninterested. Coffee was lukewarm and not worth the price. Hope they improve"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wb1NrVTBUV3hWWlRJeVpFOVFTV3BYV0VKbVdWRRAB",
            "text": "Seemed like an ideal spot for breakfast or lunch but the waitress and man behind the bar wasn't super friendly since we had walked in, made us feel very uncomfortable and awkward"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcE5UWTViWFpvTkhacE1FMUxWRlZrUVZCblRHYxAB",
            "text": "Friendliest, most beautiful staff ever. Delicious food and coffee. I would definitely recommend💕"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSlJXMU5ha3hrU0dwRlpFUlZPRGxyVFdJM2FYYxAB",
            "text": "I visited Sunflower Gramercy 1week ago on a Saturday around 11 a.m. with a party of three, and it was truly one of the worst dining experiences I’ve ever had.\n\nOur server (Kara) was rude and completely unprofessional. When I asked for straws, she tossed them directly on the table with no wrapping or napkin, it felt unsanitary and careless. When my friend and I asked for extra caramel in our iced lattes, she rolled her eyes and never even put in the request. We had to ask someone else because there was no caramel at all.\n\nI ordered the Nutella pancakes and was shocked when Kara reached into my food without saying a word, no explanation, no warning, just touched my pancakes and walked away. It was invasive, unsanitary, and totally unacceptable.\n\nWe didn’t receive water refills, napkins, or a single check-in during the entire meal and this was during a heat wave. We even asked the manager for water, and still nothing came.\n\nThe manager, Kenzie, was at least kind enough to listen at the end and comp the pancakes and drinks, which I appreciated. But overall, the service was unacceptable and I left feeling disappointed and uncomfortable.\n\nI even took the time to email the owner directly before posting this review, hoping for a response — but I never heard back. That lack of follow-up only confirmed how little care is given to the guest experience.\n\nI wouldn’t recommend this place unless serious changes are made to staff training and hospitality"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCSmVuSXlhSFF5WkdOMllXaGZNekIyU21ONlQyYxAB",
            "text": "Delicious breakfast and great coffee. They had some unique breakfast options which were super. I had the Baruch, which had so many different delicious items and went together so well. Perfectly prepared eggs and toast. My wife had the Mediterranean avo toast with poached eggs and loved it. Cobbled it all up."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMRDJnYkNIMVlfc0l3EAE",
            "text": "Busy Sunday but we got seated pretty quickly off the waitlist. Great service and beautiful, tasty food.  Highly recommended!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VMcUt1YVA3bUptRTlRRRAB",
            "text": "For lunch ordered for delivery Bao Buns and the chicken was tough and didn’t get any sauce with my fries."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJdVUydVNJcVlhTEtREAE",
            "text": "Sooooooo good! They know how to season some food! I’m working in the area for a few weeks & this place quickly captured my heart. I’ve been twice already. My photos are from 2 different days.\n\nAmazing food , friendly service (wish they were a bit more attentive to outside guests) , & a phenomenal playlist to set the mood. This place has amazing vibes & even better food. I will be back over and over again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPakUtdld4NzRYbnlnRRAB",
            "text": "Nice coffee with quick service and a rich menu. The place has a plenty of space indoor and outdoor.\nThe coffee was OK, and the food delicious."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJS3p0X3J2M29uOUN3EAE",
            "text": "Such a nice little spot with outdoor seating and great food. Pancakes were really good and came with a nice amount of fruit. The steak and eggs was cooked to order- medium was right on the spot and the meat was very flavorful. The break’bowl was hearty with decent amounts of bacon, and all the flavors blended together so well, really tasty. My chai latte fell a little off the mark but everything else was so good it didnt matter. Price points were very reasonable for the serving sizes and service was attentive and timely."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOLTU4NWJld19IU1FnEAE",
            "text": "Second time having great food with great company (Wife). The first time, I had steak and eggs, and my wife had a breakfast burrito.. they have this sourdough bread!! Espectacular!! the service, great, food, location.. and the mimosa fot the wife... excelent."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKVDlfZUdzc0tEX1p3EAE",
            "text": "HOW TO GET IN: this place is very busy so I would recommend allocating yourself some wait time but you will eventually get seated. We waited about 30 min. The food was very good and I liked the iced tea. The service is a little hectic/ chaotic inside but still a good experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMU3BtLUgxbzZqSjlRRRAB",
            "text": "Fantastic breakfast destination. Interesting menu, a generous cup of great coffee and good food, well presented!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZa2RmOVB3EAE",
            "text": "Table was ready, but seventh member of the party was not there so the waitstaff forced us to wait outside in the pouring rain:\n\nWe were really looking forward to dining here, but unfortunately, the service left a lot to be desired. After putting our name on the waitlist at noon and waiting an hour and our table to be ready, the staff refused to seat us because one member of our seven-person party hadn't arrived yet. I explained the subway was stuck but they’re on the way, and they said that was fine, we could stand and wait but we couldn’t be seated until everyone arrived. After 1 minute of us quietly waiting, as out of the way as possible, they told us we had to stand outside. Well, it was pouring rain. Because we were in the way, and it was raining, I asked if we could just sit down (at our 7 person table that had been ready during this entire interaction). Again, they said no it’s their policy everyone has to be there and they are watched and get in trouble if they break policy. I said I completely understand, but can an exception be made as it was pouring outside. I was then met with hostility with 3 waitstaff coming up to me saying we had to wait outside in the rain. I asked why this rule is in place, as all rules have reasons and they were clueless. I’m not sure if the owners of the restaurant are so horrible to their waitstaff that the waitstaff feels they can’t accommodate paying customers, but it was unnecessarily rigid and unwelcoming, especially considering the circumstances. A little flexibility or courtesy would’ve gone a long way. Instead, we left and went to a different restaurant and I have no intention of ever coming back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcExMdjJRRRAB",
            "text": "The best breakfast spot! Eliana made me a nice latte with oat milk - little maple syrup and cinnamon. I was in love. With the coffee,\nWith her, with the place! The burrito / unreal see below. Such a nice place. I’m ready to embrace the day now!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMF82T2NBEAE",
            "text": "Unfortunately absolutely bad. The food is super artificial and greasy. Money thrown away."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvLWFhY3BBRRAB",
            "text": "This restaurant is a 10/10. We didn't ask for a reservation, and there were plenty of tables available. The service was quick and friendly. They had good music at a good volume, allowing you to have a pleasant conversation. The food was delicious and fresh. This is the kind of restaurant you'll want to return to, not only for the taste of the food, but also for the excellent service. The prices seem reasonable to me."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvZ2ItQXdnRRAB",
            "text": "I LOVE this place. I go here at least twice a week & I always ask for Nicol! Honestly one of the best servers there.. she takes her time to know her clientele, she has phenomenal customer service, and makes you feel just at home. Food is absolutely amazing and so is the atmosphere. If you decide to dine here make sure you ask for Nicol !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvZ2RtLUxBEAE",
            "text": "Food was so yummy! Service was super friendly and quick thanks the Nicole! Outdoor dining is so cute, overall love this place will come back"
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdUxfbDBnRRAB",
            "text": "Service rapide, c’était bon.\nPetit restaurant cosy."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNGNqbUZnEAE",
            "text": "Love the staff, the variety of brunch options, and the café drinks, especially the espresso and matcha. One time, my kale was a bit too salty, but when I mentioned it to my server, she quickly replaced it with no hassle and was incredibly kind about it. Great service and great food!"
        },
        {
            "date": "7달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMXE3ZkJREAE",
            "text": "La cuisine était excellente ! L'ambiance était aussi très sympa. Je recommande."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKazlUTnBBRRAB",
            "text": "메뉴들이 대체로 맛있고 양 많은 편. 고구마튀김 사이드로 쉐어해서 먹기 좋아요! 라떼도 맛있음. 직원들 친절함. 테이블 간격이 조금 비좁은 것 빼고 무난하게 가게 좋은 브런치가게!!"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtel9uTlRnEAE",
            "text": "생전 처음먹어보덩 야채와 달달함의 끝판왕 이였던 치킨와플~ 오묘하게 너무 맛잇엇던 깔끔한곳"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1bDgtVHNnRRAB",
            "text": "화장실깨끗 미국서 드문경우 가격 괜찮음"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMklxekJ3EAE",
            "text": "I've had this place bookmarked for a while and finally got the chance to visit on a weekday morning. Arrived before noon on a Tuesday, and it was surprisingly busy. I ordered an Americano and avocado toast with an added poached egg.\n\nThe interior is mostly white with pops of yellow, giving it a bright, cheerful vibe. The food hit the spot - healthy and not overly seasoned, just how I like it. While the service was average, I appreciated the generous portions of veggies compared to other places.\n\nOverall, it was a nice experience. If you're into fresh, health-conscious food in a sunny atmosphere, this place is worth checking out!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdjRqVU53EAE",
            "text": "Went there for an impromptu brunch. The staff was friendly and the food was good with great portions. The steak was more on the medium rare side than medium but it was tasty. The vodka pasta sauce was a really good choice for a vegetarian. Overall good experience."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfM1B6OEZnEAE",
            "text": "This food almost made me run in the street and celebrate. This omelette that I put together was delicious, fresh and beautiful. I wanted to eat all the food on my fiance and her friends plate as well. I'm definitely coming back. Thank you!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2ckpLZUZBEAE",
            "text": "The food was amazing! Make sure to come at a good time because it gets packed fast. Their whole menu looks amazing, I will definitely be back! Payment is also very easy because you pay at your table and you can split the bill many ways."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkaHFYQVFnEAE",
            "text": "The avocado toast was lovely, colorful and tasty. I think the avocado toast itself was good, but the colorful and tasty veggies definitely elevated it to greatness.\n\nThe matcha latte was good, albeit not special. However, it was a very generous portion.\n\nSo overall I give 5 ⭐ for food.\n\nThis was a 10am Sunday brunch, and it was full inside, so I chose to sit in the enclosed outdoor space. By the time I left probably 30 minutes later, 2-3 more outdoor tables filled. It seems a popular enough spot that people did not mind the chilly weather 😄"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmLWREVEp3EAE",
            "text": "Came for brunch with a friend, and loved it! The music/playlist was bumping, the decor is super cute. The food and drinks are beautifully put together. Pictures of people's food is what drew me here, the yummy food is worth coming back for. Of course being a brunch spot in this area, the prices are a bit high, that would be my only critique."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdU1EXzJ3RRAB",
            "text": "I recently had the pleasure of dining at Sunflower Gramercy restaurant in New York City and I have to say it was truly an amazing experience. From the moment I entered, I was greeted with a warm and friendly smile from the hostess and the restaurant's ambiance was simply beautiful.\n\nNow, let’s talk about the food! Everything we ordered was absolutely delicious, beautifully plated, and made with fresh ingredients with just the right amount of seasoning. We ordered a glass of fresh orange juice that was recommended by our waiter and it was a perfect match with our meal.\n\nThe service at Sunflower Gramercy was impeccable, our waiter was very knowledgeable about the menu and made excellent recommendations based on our preferences. He was attentive to our needs without being intrusive and made our experience truly enjoyable.\n\nI would highly recommend Sunflower Gramercy to anyone looking for an excellent dining experience in New York City. With its beautiful ambiance, amazing food, and exceptional service, it's definitely worth a visit. I can’t wait to go back and try more of their amazing dishes! I give this restaurant a well-deserved 5-star rating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNHNLTzhBRRAB",
            "text": "Brunch was sooooo good. Like. So good. The pancakes were really yummy. Sometimes I think about them randomly in the middle of the day. You should get a mix of sweet and savory dishes so you can try multiple things."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNId0wyRll3EAE",
            "text": "Lilian was a Blessingggg!!!! I came here today to Sunflower Gramercy for the first time. The vibes were great when getting sat down. The food came out and was amazing as well. I ordered the Rise and Shine and had the sunflower spritz. However, mother nature had other plans in mind. A wasp flew in the area we sat and Lilian our waitress went above and beyond and relocated the wasp for us to continue to eat comfortably. I will definitely be coming back again. The food the atmosphere was great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqdU9HaDJ3RRAB",
            "text": "I've eaten here a few times now but wanted to be sure about my experience before reviewing. To many in the area this place is a known brunch spot. Both times I've been it did not disappoint. This time I had the crispy chicken sandwich which was very good the chicken we extending well beyond the perimeter of the bun and the cutlet was very crispy not unlike a katsu. The fries were fine but nothing impressive however. We also had the chicken and waffles which did not disappoint either. They do not take reservations if you get here on a weekend expect to wait."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNE5qc1J3EAE",
            "text": "Ambience was great! Service was friendly and fast! We only had to wait about 10 minutes to get seated! And the food was amazing! Coffee and pancakes 🥞 were delicious and tasty 😋 salmon toast was incredible, with capers and fresh tomatoes 🍅 and cucumbers 🥒! you can’t go wrong with this place!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRM3BDQUlnEAE",
            "text": "NUTELLA CHERRY PANCAKE 🥞 so soft and fluffy. I’m so obsessed with Nutella 🌰 just bring my brunch in NYC to the NEXT LEVEL.\n\nCalling all STEAK & EGG lovers 🍳 always my top choose.  will be surprise by juicy & tender steak, the egg cooked to perfection, the sourdough toasted with crispy exterior."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKd0p2dk93EAE",
            "text": "Must visit. We ordered the chicken and waffles, 3 egg omelette and the duck Benedict. Everything was good not one complaint. Also they aren't weak on the champagne for the $40 pitcher.  Must try if you're in NYC"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaaVo3M0dnEAE",
            "text": "This is cute spot. Ambiance was great. Very bright. Unfortunately, the food was not as good. My steak and eggs were good, but there was a lot of grease on the dish. The brussel sprouts were very oily as well; we were not able to finish it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyNTVEZm9BRRAB",
            "text": "Food 10/10\nA solid brunch place, really enjoyed their Eggs Benny. Fun twist with duck bacon and coming on a slice of toast vs. two english muffins. I really enjoyed the chutney (?) sauce that came with the dish. The sweet potato fries are also very good, and the portions were all very reasonable. My friends got the Steak & Eggs as well as the Brek’wich sandwich. If you’re in the area, definitely worth checking out.\n\nAtmosphere 7/10\nSeating is a little tight and the space was very casual. Good for just a typical brunch meal.\n\nService 8/10\nGood service, nothing to complain about."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbTdfaTdBRRAB",
            "text": "This place is absolutely amazing!! Such a cute café vibe but bustling with energy and the food comes out extremely quick with friendly service\nFrom the moment you walk in, you already know you were going to have the most delicious brunch ever !! Everything is beautifully plated and has so much flavor.\nNot to mention, they have a million delicious options to choose from versus a lot of other places that just have basic brunch options. Definitely recommend this place 10 out of 10."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXOG9UeUhBEAE",
            "text": "I’ve got to say the Lattes were amazing! I ordered myself the steak and eggs and honestly the peppers and tomatoes were the best! The presentation was amazing! The only downside was the outdoor seating, and the day we went was snowing and…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUc2FiZEpREAE",
            "text": "Unbelievably good. They use seasonal fruit and it added so much to the already delicious French toast and pancakes. Amazing coffee too, and very friendly service. Strongly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSLUtHNENREAE",
            "text": "I have been to this place at least 20 times, and I have to say- I never leave disappointed. It's one of my favorite breakfast/brunch places in NYC. The food is so fresh!! The presentation is always gorgeous, they are food allergy friendly, accept substitutions and the staff is always very friendly. I never get sick of this place. The portions are honestly huge and big enough for 2 people. We usually order 2 plates for 3 people and its the perfect amount."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkbXVXeGNREAE",
            "text": "Such a lovely experience! Sat on the exterior side. The menu is through an QR CODE I love the simplicity of it. The menu is not overwhelming. They attended to me immediately, so no long wait time. The food itself is flavorful. I appreciated that the food wasn't too salty. Everything was just right. The portion was also worth it for the price. I loved the Matcha Latte. The drinks tasted good as well. Absolutely loved it here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPemJfRWVnEAE",
            "text": "Cute little cafe! I came around 10am so no wait although around prime brunch time there can be. Love the indoor outdoor breeze. Super convenient near me. The Belgian waffle was very sweet, a bit too sweet for me as I could taste the granulated sugar. Mascarpone was nice and light; in my opinion did not need the syrup at all.\nThe matcha w almond milk was perfect, not sweet at all. The smoke salmon toast was perfect and bite sized. The fries were a bit soggy so don’t recommend. All in all, good little brunch place that I will probably be ordering from often enough."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkZ2ZpeHp3RRAB",
            "text": "Brunch here was ahhhmazing! The food was not only plated so beautifully, but every single bite was scrumptious. The mimosas were hitting the spot, so ofc we had to order another pitcher. Parmesan truffle fries is a MUST! Every dish we ordered was y u m. Gotta go back to try the rest of the menu!! Service was great and outdoor seating was warm despite how cold it was outside. Definitely check this place out 🌻"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoMWZ5QlVnEAE",
            "text": "This restaurant is so beautiful and cozy. I started with the granola bowl couldn't have the granola because I'm allergic to tree nuts but the seasonal fruits yogurt with honey was deliciou. I also got chicken and waffles with Mike's hot honey oh my God I must say so good. The customer service the food everything was at 10 out of 10 Definitely check this place out and I know for sure I'll be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCMmF6cWNBEAE",
            "text": "Found this spot while in NY as everywhere was packed for brunch. This is the place my friend and I could get a table so we said why not. I’m honestly happy we did because the food turned out to be so good for such a small restaurant. It is very cute inside. All though we felt squished at our table, everything did fit and we thoroughly enjoyed the food. I had the steak and eggs and the steak was cooked to perfection. It was so good. My friend had the Break’wish and she also enjoyed her food. Will definitely be back when in NY."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkd01UV0t3EAE",
            "text": "The kitchen is holding this place up! Great food, good sizes and taste. The costumer service is a ONE star. I understand young talent is cheaper but majority of times they really don’t care about costumer service or even the costumer at all. But since the crowd is young I can understand. The staff desperately needs an older Manager that can put some order to the mess, specially in peak hours.\n\nSo expect good food and bad costumer service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWajZhTUp3EAE",
            "text": "Brightening up my day at sunflower nyc , a cute spot serving up breakfast classics in the heart of Gramercy.\n\nThe cafe is very pretty with yellow scents throughout , They have vegan option and Instagram worthy food. The food come with beautifully plated, especially the Belgian Waffle .\n\nWe ordered 3 egg omelette with spinach, tomato and beyond sausage was so delicious and The Steak and egg was so good .\nDon’t miss the Chai latte & strawberry mint lemonade 😍. But the service not friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbjhUZWdBRRAB",
            "text": "Beautiful spot! Just checked out the new location in EV.\n\nDecor is lovely and the food is great! Loved the Nutella pancakes & French toast - both a huge size and beautifully presented"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdzl5QmxBRRAB",
            "text": "This is my not so hidden gem of the area. I always take my friends here when they’re in town. Not only is everything delicious, but it’s also a great value. The breakfast items are amazing, but so are their pastas. My only gripe is that they aren’t open past 5 for dinner."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxOXFQbWlBRRAB",
            "text": "Just stopped by the other day for brunch and their menu improved significantly. The wait can be long, but it’s worth it because the other options within walking distance are, well, less than delicious.\n\nThree things that take take the cake for me here: beautiful attention paid to plating… soft scrambled eggs are soft… coffee is smooth and with no sour notes.\n\n@sunflower improvement idea: spike the fried chicken tenders with two wooden skewers to help the servers out. The plates were too heavy and the extra motion when setting the plate down caused the tenders to bounce off the plate and onto the table/ground."
        }
    ],
    "reviews_count": 82
}