{
    "name": "Zuma New York",
    "place_id": "ChIJjxZ92gBZwokRBs-63wLcBp8",
    "grid": "MN6",
    "address": "261 Madison Ave, New York, NY 10016, USA",
    "rating": 4.3,
    "user_ratings_total": 1936,
    "phone_number": "(212) 544-9862",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjelduSmtiMmRDVkdGUmNuUkxkVkV0YkZBME5VRRAB",
            "text": "My fav place!!!!! The drinks are amazing, the food is always delicious, and the atmosphere is great especially on weekends when they have a DJ."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5bWRreFhXVkphUzJoTWVHVkVkR2xTV0cxcGEzYxAB",
            "text": "Top cuisine"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZdE0yVjRYMDB5WkVOVFduaDNXVzFhVjFGWGEyYxAB",
            "text": "genuinely the worst upscale asian restaurant on the east coast- food was bland and overpriced, and the hospitality was disgusting. definitely spend your money elsewhere."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNWIxbDNSRE5aWldkSVprbHdiVmRyVkdZelFsRRAB",
            "text": "This is one of the best restaurant experiences we've had in New York. The food is all fantastic but it is matched by excellent service, as well. We had a group of 7, including kids, and we all had a very enjoyable experience. The dishes are all meant to be shared and we were able to try a variety of offerings. One of my favorites was the Wagyu beef dumplings. The strip steak was also delicious and very tender (see photo). I highly recommend dinner here and we'd love to visit again."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUlpDMHpjRzlsVnkxTlNsbElYMHBSZDJ0Sk4wRRAB",
            "text": "Lively music, bold flavors, and sleek interiors. The black cod and spicy beef tenderloin are standouts. Perfect for a night that feels both elegant and fun."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREei03TUh3EAE",
            "text": "I’ve been to Zuma dozen times.  Always enjoyed.  Boy has it dropped off.  Had the worst service of my life and management couldn’t care less.  Absolutely atrocious.\n\nI would avoid until they turnover their manager and that server."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCQ2FYTXdjbk5ZZEhKbE1YbzBiR2RFZG1walEwRRAB",
            "text": "Overall great spot. Second time there, first time was for a work event in the banquet space which is absolutely stunning room to have dinner in. We did the premium omakase ($250/pp) and my only criticism is that the first several courses came out way too fast so took a point off for that, it almost felt like we were being rushed, multiple courses on the table at the same time which I didn’t appreciate however, later on, they definitely slowed it down. Food was incredible, DJ vibe was fun the music wasn’t too loud. Menu highlights were the tuna tartare, scallops, lobster, wagyu steak, sea bass (raw and cooked), wagyu dumplings. Presentation was fun throughout, cocktails were on point (Fig Manhattan and vida tequila drinks). More regal and authentic than Tao (which is for sure also a solid pot). Dessert was a fun combination of fresh fruits, but also had ice cream and lava cake which was outstanding. The espresso martini was on point and the branded chocolate flake on top was a nice touch. Would go again to try their regular menu."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOeVZERnNaRTluT0dOWGF6aHhkRzl5YjBkM1VGRRAB",
            "text": "We were warmly greeted and served by a very friendly waiter, which made for a pleasant first impression. However, despite many empty tables in the luxurious front and lower areas of the restaurant, we were seated at a tall and rather uncomfortable high table, squeezed between other guests. To make matters worse, there was a staff door right next to us, with employees frequently passing through and calling out “corner!” as they navigated the space — which was quite distracting.\n\nThe food itself was generally good and nicely presented, yet the prices felt noticeably high for what was offered. Overall, while the service was kind and the cuisine solid, the experience did not quite justify the premium pricing."
        },
        {
            "date": "1주 전",
            "language": "fr",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4MWJFMWxSVzUxUmxweFowbE5lblpEVW5kNGJWRRAB",
            "text": "Les plats sont excellents, surtout le thon mariné en entrée et le black cod, vraiment exceptionnels. En revanche, le service est beaucoup trop expéditif : les plats s’enchaînent sans rythme, comme si on devait vite libérer la table.\n\nDommage aussi pour l’emplacement, nous n’avons pas eu une très bonne table.\nMalgré tout, la cuisine reste remarquable — à tester pour la qualité des plats plus que pour l’expérience globale."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205bVVIVnhNVWxGVDFnMFMyeGhPRk5pUTBGMWJVRRAB",
            "text": "Amazing food and atmosphere. Highly recommended for sushi."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toMVRteGFWa1pHZG5oM1MzTkxXV05XTlhaR1NuYxAB",
            "text": "I hadn’t dined here since it reopened many moons ago — and now I remember why. While a few dishes had good flavor, the experience was overshadowed by the service. We spent most of the evening looking for our waiter, who was nowhere to be found. Beautiful setting, but service this inattentive makes it hard to want to return."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUlMwWm5NeTFpU2tGd2VYSkJkbmx3ZDE5clYwRRAB",
            "text": "Zuma Midtown never disappoints. The venue is stunning, with a vibrant, upscale atmosphere that perfectly complements the high-end dining experience.\nThe food was amazing, as always — every dish beautifully crafted and full of flavor.\nPrices are definitely on the higher side, but that’s expected at Zuma and worth it for the overall quality. A go-to spot for a special night out.\nWe really loved the desert with a wonderful support msg for breast cancer."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sV1ZEVkdSbk5NZVRRd1duTmxhbWhtV1hwTGMzYxAB",
            "text": "One of my favorite places in NYC"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NelgzaEdNMWxrTkY5dk0xb3hlVFV3WmpkcFNtYxAB",
            "text": "Too noisy"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkelRVaE9NMmR2ZDBOeVQxVnJYMWRRVFhGZldIYxAB",
            "text": "Extremely disapoointed by the terrible service we received at this Zuma location. Having dined in Zuma restaurants all across the world (Porto Cervo, London, Rome, and more), this experience was extremely jarring. We were first seated next to an obnoxiously loud DJ, then when asked to be moved, we were moved to the sushi counter. Mind you, there was absolutely no one else at the sushi counter and many empty tables. There were several open tables that they refused to seat us at and claimed they were all reserved. Checked their reservations and tables were open for hours on end. Absolutely disappointed and will NOT be returning and will be informing our friends and family about our experiences. Truly was excited for a great meal, just to be utterly let down."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201UlZrOXpTRGx6YkVzeFJFVlpRVGxGUTJadGMzYxAB",
            "text": "Food at Zuma is always good BUT this was the worse service I ever had! Half of my order got forgotten, had to ask multiple people since we didn’t have a server.\nThe music was super loud (friday evening) and almost felt like a trashy club. Love Zuma, but definitely not the new york one !"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkRWVVdzNOelpyY0dJMGNsTjFlRXROY0ZwNlkwRRAB",
            "text": "bad food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZNGNUbDBOMHRVWVhwM1RqSlpkVkoyUm1zNFlYYxAB",
            "text": "Been wanting to recommend this place for a while. The team offered efficient service while maintaining polite and helpful behavior. The flavors here are perfectly balanced. Our experience was carefully crafted from the moment we entered. Try their menu – you'll find favorites."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RWFrUkxhazlWZG5ZNE1ub3hSRk5vVTJWU2FtYxAB",
            "text": "Fantástica noche la cena estuvo espectacular,\nMuchísimas Gracias Eric y todo su equipo por hacernos sentir como en casa, Súper atentos el local como le comenté nos encantó. la atención exquisita. La comida buenísima estaba en sintonía con el servicio recibido.\nVolveremos sin duda en la próxima vista New York y te irá espectacularmente bien en México. Solo darte las gracias Eric."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoeGMzTkpXREJZZG1Oa2NYZExSVGREYlVGcU1VRRAB",
            "text": "Amazing place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVM1NERjNVMWxTTWw4MFZHeGlhemhKTkhCNVJGRRAB",
            "text": "Food quality was on par with other Zuma locations, but everything else fell far below expectations. The music was so loud it made conversation nearly impossible, and the dining area was uncomfortably cold—we actually had to keep our jackets on throughout the meal. The service felt chaotic; staff seemed disorganized, and our waiter was clearly rushed, leaving us with the impression of being hurried along rather than properly served. For a restaurant in this price range, that’s simply unacceptable. Having just been to Zuma Rome, which was a flawless 10/10, this experience was a complete letdown and a waste of time and money."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OUVZ6UmFkM2xpTVY5R1pWTldjRjlEU3pJeVdYYxAB",
            "text": "One of the worst services in NYC. Definitely the worst we’ve received in any of the Zuma restaurants.\nWe were there on Sept 23, a party of six. Ordered 6 orders of each of the 12 nigiris that they have, plus some wagyu, shrimp etc. Got only 2 orders of 6. We asked for it again and the waiter said he thought it would be too much so he put only 2 orders and not 6. Ok… I guess he doesn’t want his tip. So we asked for the third time and when asked why he didn’t bring us the 6 orders he said “because I care about my clients.” Meanwhile they were serving Champaign as if it were water just to run up the bill and the food was not coming. Even after speaking to the manager and they changed the waiter we STILL didn’t get our orders. I guess they must have been out of fish that night. Unbelievable. $2,700 check, but only for a third of the food we ordered."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVFIweDVUMjQ1T0VSblZVNTJURE0yYkhVMlNtYxAB",
            "text": "Amazing restaurant for bigger groups. Beautiful interior and high quality food. A bit pricey but ok for what it is."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWGFVcDBiemhhYkdnd2JVZzFOMk5JYUVack9GRRAB",
            "text": "Outstanding food, vibes for days, stylish decor. Sashmi, sea bass, lobster all great!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toSk4waEJYMkZUZUhCNmFURmZkUzB6UW5nMExWRRAB",
            "text": "Had dinner upstairs at ZUMA and tried the Signature Omakase — unforgettable. Each course was beautifully crafted and delicious. Service was flawless, and our server Victoria made the whole evening extra special with her attentiveness and professionalism."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFeVdpMUlaamhIWkdsbloycEZkM0pWUTJ0bmRsRRAB",
            "text": "My husband and I travel to NYC often now that our son moved there. Visiting Zuma is always the highlight of our visit! From start to finish was impeccable! We were welcomed with smiling faces and a phenomenal atmosphere. Service was strong. Carol took great care of us! Highly recommended visiting Zuma if you are in NYC. It will not disappoint! Fresh seafood, sushi and Waygu steak were all to die for! Thank you, Eryck, Tysen, and Carol for making our experience so special! Highly recommended visiting!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUFExUnlWVWRNVFY5QlduQm5kVGRhWWtWbFJXYxAB",
            "text": "We ordered lobster and maki, and it was mediocre. The atmosphere was good and the service was excellent."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5R2JGaHpaazUzVnpCUVQwMWlPRjluU1hOUGMzYxAB",
            "text": "The service is okay.\nThe raspberry martini was good. The cucumber cooler was good, but the glass was huge lol."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5UGVteFJUa05PWWxSUWRtWlhOV2hKUnpCVE5WRRAB",
            "text": "Amazing food and presentation"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CeGIyUTVORkZZVTAxbk1sWnNOamRYUTJSb1NsRRAB",
            "text": "If there a star below one I would have provided too.  Why book a reservation at 2:30 and advise that at 3 kitchen closes.  The waiter was so so rude in addition came by twice with a bill.   I took my clients out and they asked for another…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jNWJIZzFSSGhoUWtwRU9WUkxhMFkwZVZSM09XYxAB",
            "text": "If you are planning to reserve a private room or attend with a large party, DON’T! They will cancel your reservation with little notice regardless of if you have paid a deposit and signed a contract. They will only offer you a weak apology. This is a very unprofessional and disorganized establishment."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCaGJ6STVRbE5xV1VGUWFFWlNjSGd4ZDJKVVVGRRAB",
            "text": "Awful customer service. Cancelled a planned birthday party because they just decided that they will not open on Sundays.\n\nThe right thing to do would have been to no longer accept new parties and then change the schedule when all planned events have taken place.\n\nDo not go here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SS2F6WlNVbWhYUm05WWEyTjViQzFwWjA1VGRrRRAB",
            "text": "Today I visited this place for the first time, and I absolutely loved it! The food was delicious!! We received amazing service from Pavlo, and the manager Ron even sent us a dessert platter on the house. Thank you so much! I’ll definitely be back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FMVZGRlFTM0ZMUjJ4aFl6RlVSbEZ2WW14alIzYxAB",
            "text": "Zuma in New York best of the best !\nBetter than other states in USA absolutely .\n\nThere are many items on the menu that are not available in other countries, I love tofu salad, the lobster is very tasty, this is a plus. In general, the service situation is at the highest level. And the most important thing is that you can reserve a table the same day, and there are no problems."
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUlV6TjBUMHB4UTJwRWFXNTFhRk4yWjAxZlZuYxAB",
            "text": "La cena da Zuma New York è un’esperienza da vivere assolutamente! Ambiente e atmosfera accoglienti, cibo di ottima qualità e servizio impeccabile. Un ringraziamento speciale va a Marco, il sommelier, che ci ha seguito durante tutta la cena con la sua cordialità e professionalità.\nCi torneremo sicuramente!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5UU9WOW9Oa2hvTVc5Q1MxbFhWVUZQTTFGTlkzYxAB",
            "text": "Every dish we had was amazing although you definitely pay the price. VERY strict DRESS CODE enforcement. No shorts or even athletic pants allowed. The seafood to the dessert were all highlights. Friendly service without any rush."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WRU5XVm1lbEJOU0dSM1dVbG1hbEV3TTA5R1VsRRAB",
            "text": "Disgusting experience, owners are entitled snobs. Act like they don’t need your business but your buisness is exactly whats keeping them afloat. Manage was rude in a tacky suit. TAKE YOUR BUSINESS ELSEWHERE"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCd1JETjJWbkZyU2poVE1YUmpMVEZUU2xoa2IzYxAB",
            "text": "I had an absolutely fantastic experience at Zuma! The food was incredible, beautifully presented, and full of flavor. The service was attentive, friendly, and professional without being overbearing. The atmosphere is stylish and inviting, making it perfect for both special occasions and casual dining.\n\nEverything from start to finish felt seamless and well thought out. I highly recommend Zuma to anyone looking for a top-notch dining experience—you won’t be disappointed!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gd2NFSk5URkIyYzFwVVVuVlZNbmRoVjNCMmJYYxAB",
            "text": "Good food. Average service."
        },
        {
            "date": "2달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwSmVFdHFaSFV6VUdOTVNuVmhWRWcyYlRCeFZsRRAB",
            "text": "Pyszne jakościowe jedzenie, koktajle oraz bardzo miła obsługa. Polecam."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkTU5YaFRPVU4xYUZKSVdVWk1VV3RtZW5odVIwRRAB",
            "text": "I was familiar with Zuma in Madrid, and the one in Madison didn't disappoint. Same quality ingredients, a very pleasant atmosphere, and also part of New York's restaurant week!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twTGRtMDVjbGd4TjNkME1FOXVYMlo0VFRKeGFtYxAB",
            "text": "I had high expectations for Zuma New York. I chose it specifically to celebrate my wife’s birthday, expecting a flawless dining experience. Unfortunately, it turned into the most disappointing restaurant visit I’ve ever had in NYC.\n\nFirst, we booked a table for 3 plus 1 baby and requested a highchair, which was confirmed over the phone. Yet, when we arrived, the seating wasn’t prepared, and we had to switch tables.\n\nWe placed our order, but soon after, we received a dish we didn’t order – beef with shishito pepper and smoked chili soy. The waiter’s response? “No worries, that’s fine.” Some of the food was decent, but this careless service set the tone for the evening.\n\nWe also ordered a bottle of water and later realized they brought us a second one without asking. At dessert, we requested the Zuma deluxe dessert platter but somehow it was entered as “2” on the order. I didn’t question it at the time because I trusted I was at one of the best restaurants in NYC and wanted to enjoy the night.\n\nI even tipped generously, thinking I was compensating for the dish they mistakenly brought us, only to realize they had already “compensated” themselves with the extra bottle of water and an additional dessert.\n\nThe final blow? The next morning, both my wife and I woke up with severe stomach pain.\n\nZuma New York did not just fail to deliver the luxury experience they promise – they ruined what was supposed to be a special night. This was, without question, our worst dining experience in NYC."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1VVdFZHBibGM1TVhKa2RTMHhPVlpZY1daR1JVRRAB",
            "text": "This is my third time giving this location a chance, and it's the worst. I've had great experiences at Zuma in Europe and Vegas, but the NYC location fails on every level. The service is awful; main courses come out one at a time, and side orders arrive after everything else. They claim it's due to multiple kitchens, but that's not an excuse. The crowd is terrible, and even with a reservation, you wait too long. It's disappointing that they collect feedback but don’t act on it. I won’t be back."
        },
        {
            "date": "2달 전",
            "language": "ar",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SZloyODVVbDgzZVdzeWRuZE5TMFYwTUdkMFRFRRAB",
            "text": "مقارنه بفرع الرياض و روما يعتبر سيئ الستيك جانا بارد"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Oc1RuUllTR3hYTkdneFRVTlBVVmRUTFZGYVozYxAB",
            "text": "Food was amazing but the service wasn’t as expected for an expensive restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paQ1pVOHRWWGxqWm5KTlVDMVBjakk1UmpCQmIxRRAB",
            "text": "It was great. I tried the restaurant week dinner menu, it has a decent amount of options to choose from."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WRlZGcE1WV0ZVU1dGclVVSXpiM2R6V2tKbGJIYxAB",
            "text": "The service here was excellent, and the food was divine!\nThe skewers were fantastic, and there is no earthly reason for a roasted potato to be THAT good, yet Zuma makes it so.\nMy compliments to the entire staff--my wife and I were extremely impressed."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUGVUUk9kWFE0VTJNM1kyaFRVME5yY25NNWFWRRAB",
            "text": "This review is solely about the food. I went here years ago and the food was okay back then. But recently, it was legitly bad. I know quality fish and this place was below average the fish wasn’t fresh and tiny. The dessert was not at all moving. Very odd for yet again a higher priced restaurant. Did all the food in nyc just go downhill at the same time because I kid you not if it weren’t for the ambience the place has nothing going for it. Below average didn’t even finish my food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0ZmRYcEJXa3BWWTFOTGVXdGlaVkEyUTJSYU5uYxAB",
            "text": "Great serive and delicious food 😋"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0WWNFWm5WSFJwZEZGMFdsbG9aWE01ZEZnM1MyYxAB",
            "text": "all i got to say is that this is the best place !!"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvNVpiLVdnEAE",
            "text": "실내 인테리어나 분위기는 괜찮으나, 스시맛은 한국에 비해 많이 떨어짐 가격은 일인당 100불이상  잡아야함."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvOHFHSGh3RRAB",
            "text": "가격대비 별로입니다"
        },
        {
            "date": "수정일: 8년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNncGQycDV3RRAB",
            "text": "훌륭한..."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZMU0xSk5UV2RyYzNZMVdtMURaemRoV2xoSlVGRRAB",
            "text": "Went to Zuma for our anniversary and had the best experience. The ambience was beautiful, the food was incredible, and the service was top-tier. They even surprised us with a complimentary dessert, such a sweet touch we didn’t expect. A must-visit for any special occasion!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4QlYxRlpPR0k1UTA1VllWUXRkVFExTWtVM09HYxAB",
            "text": "I've been to many Zuma locations around the world and this place is no different.  The staff and vibe are number 1!  The quality of food is amazing and from the moment you walk in the teams at Zuma make you feel fantastic!  Love New York Zuma !!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNYnV1ck9UcWZpR0xnEAE",
            "text": "I’ve been to the Miami location a couple of times, but this was my first time visiting the one in New York.\n\nI had my pre-birthday dinner here with a small group of close friends, and overall, both the food and the service were great. The atmosphere is elegant yet modern, and the bar area is lovely.\n\nI’d love to come back—maybe just with my partner—to experience that side of the place more fully."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5U04yaERWVlJLUnpWdWEybERSVXBwTW5sZk5IYxAB",
            "text": "PHENOMENAL! STUNNING! BREATHTAKING!\nThis is where my partner and I celebrated our 2yr anniversary and I can't fangirl enough about this place, it was absolutely magical. Definitely we had to save up for a fancy place like this, around $400 for us in total for the signature menu but it was worth every penny to celebrate such a special moment. The staff made it such a memorable night to remember!\nThank you so much for the excellent service, we hope to save up for it again some time in the future! 💕"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNzlETVRREAE",
            "text": "Zuma is a full vibe from the moment you walk in. The ambiance is sleek, dark, and upscale with a modern zen feel.\n\nService was top-notch—our waiter Pasha was amazing: attentive, personable, and knew the menu inside out. And Tyson, the manager, is one of the best, sharpest, and coolest I’ve ever come across. He’s young, making a name for himself in the industry, and you get the sense he might be a restaurateur one day, I go out often, and his presence stood out.\n\nThe Lychee Martinis were smooth & perfectly balanced.\nWe had Yellowtail Roll, Tuna Tataki, and signature rolls topped with caviar— all were fresh, flavorful, and beautifully presented.\n\nThe Dessert Platter was a showstopper—gorgeous presentation with fresh fruit, sorbet, and Zuma’s iconic chocolate lava cake.\n\n*️⃣: sit on the upstairs balcony area for the best vibe and view. And if you’re with a larger party, the private rooms are definitely the move.\n\nIt’s a splurge, but 100% worth it for the quality, service, and overall experience. Ideal for celebrations or a standout night out."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJRGk2NUQ0M2JuV3pRRRAB",
            "text": "Zuma Restaurant — looks amazing, but the experience was disappointing.\nYou can fix bad food. You can’t fix bad service.\n\nWe came to Zuma to celebrate my birthday, hoping for a great night — beautiful place, good food, nice atmosphere. It started well… until we got to our table.\nOr better to say, our “seat”: by the counter, with our backs to the main dining room and facing the sushi bar. (Check the photos)\nInstead of soft background music, we heard kitchen chatter and clattering of utensils. Instead of warm, cozy light — harsh bright work lights shining right in our faces.\nFor $500+ for two people, this was not the kind of experience we expected.\n\nWe tried three times to improve the situation — even suggested maybe a small table lamp to make it nicer.\nBut the best the manager could do was send us two glasses of prosecco. (Spoiler: it didn’t help- A little advice to management: before giving a complimentary drink, it's great\nto check  the bill and offer something your guests actually like. It’s a small thing, but it shows care — especially in a restaurant like this. Otherwise it felt like just a formal gesture rather than real care)\n\nAnd the “cherry on top” was the dessert. We asked them to mark it with a candle or a simple “Happy Birthday” message. Do you think they did it? Of course not. Seems like at Zuma, hospitality stops at serving the food.\n\nNow, to be fair — the food itself was excellent. The quality and taste really deserve 5 stars. But in New York, there are many other restaurants with the same price level where the service matches the food, and you feel like a welcomed guest, not just someone filling a seat.\n\nWe tried to enjoy the evening anyway, but if it wasn’t my birthday, I think we would have just left — like some other couples did when they got the same bad seating.\n\nSo my advice: if you want to celebrate something special at Zuma, think twice. Beautiful design can’t hide bad service. Your special night can easily be spoiled."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VPT3ItSkdRcmN5MmlnRRAB",
            "text": "The salad was quite good and set our expectations high at the start of the meal. The gyoza were also nicely done — flavorful and well-prepared. However, the following dishes didn’t quite live up to that promising start — they felt a bit uninspired and didn’t leave much of a mark. For a restaurant featured in the Michelin Guide, we were hoping for something more memorable. Thankfully, the dessert helped end the evening on a better note and brought the overall experience back to “pleasant enough.”\n\nWe had made a same-day reservation and were initially seated at the bar, with the staff explaining that tables are typically booked a month in advance. That level of hype felt a bit puzzling, especially considering the overall experience. To be fair, we’re not particularly demanding when it comes to food — but this just didn’t feel like it lived up to the reputation.\n\nThe interior is stylish and inviting, the service was polite and attentive, and the pricing is what you’d expect for New York City — not cheap, but not outrageous either."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbV82QkF3EAE",
            "text": "Food was good I loved the hamachi crudo, shishito peppers, and miso black cod.  The sushi special of the day was sooo bomb it had truffle I think . Vibe was super chic, service was great. Hará at the bar was kind and beautiful she recommended me a really yummy cocktail I can’t remember the name of it lol . Will def be back"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdmRlOVlREAE",
            "text": "I had a wonderful dinner at Zuma New York. The food was delicious and the presentation was great. The stuff were friendly and attentive, making us feel welcome from the moment we walked in. The atmosphere was cozy and perfect for a relaxed evening highly recommend and will definitely be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJSDQzdHFJcGRqTjVnRRAB",
            "text": "I’ve been to different zumas around the world and Zuma NYC is one of my favorites, the environment is amazing, the food, service, stuff, everything together makes a big difference from other places and it’s a pleasure going there, having delicious dinner and go up to have your cocktails with the most incredible environment for cocktails bar, good music, good cocktails, good people. You’ll definitely love it."
        },
        {
            "date": "3달 전",
            "language": "pt",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SVWFpMUhUMVJvU1RGdVdXeE1YMWRQV1ZOVVVWRRAB",
            "text": "Um restaurante belíssimo, ambiente grande com pé direito duplo, decoração bonita pratos ótimos, servidos de uma maneira aleatoriamente, o seja, o que está pronto chega primeiro, e com isso todos comem de tudo."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvZ2ZPTzd3RRAB",
            "text": "We came with my husband celebrate our anniversary.Amazing welcoming ,delicious food,fantastic service.Omakase from the chef was outstanding,variety of cold and hot starters,sushi and sashimi platter,main dishes and beautiful dessert.Ambience was great and nice selection of cocktails.Big thank to the staff for making our night so special!Highly recommend."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbEt6a0VBEAE",
            "text": "The food was ok but slightly overpriced. Atmosphere was nice. Upstairs lounge is very loud so we moved downstairs. Service was extremely slow. My wife ordered wagu beef 🥩 medium well but it came well so she asked to return it for medium. The manager refused because he said we ate too much of it. I explained that’s because we were sharing so she had my salmon while I had her beef, so she didn’t try it until I ate my half. He still refused to correct the order & suggested that I order and pay for a second one. The fact of the matter was they did overcook it so that’s their fault and they shouldn’t try to charge us for a second order properly cooked. Also it took one hour for the corn to arrive which is nuts"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMVFA5TFBieTZEeG1nRRAB",
            "text": "Zuma in New York City is an absolute gem for Asian fusion cuisine. From the moment you walk in, the stunning interior sets the tone—modern, elegant, and full of energy. The atmosphere is vibrant yet refined, making it perfect for both casual dinners and special occasions.\n\nThe food? Outstanding. Every dish is thoughtfully prepared, beautifully presented, and bursting with flavor. From sushi to robata grill items, each bite showcases high-quality ingredients and expert execution.\n\nIf you're visiting Manhattan, Zuma is a must-visit. It’s more than just a meal—it’s a full experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3eGVsUkhPR2RYVVdRNWVVaHRjemxOYWpRd1MwRRAB",
            "text": "Absolutely unacceptable experience. Kelly the manager is absolutely HORRIBLE.\nI made a reservation and was told there was space available, so I drove over an hour to get here. Only to be told upon arrival that the only seating option available was at the bar — which I specifically would never have agreed to. What’s the point of taking a reservation if you’re not going to honor it?\n\nThis place clearly doesn’t value people’s time or business. Completely unprofessional and misleading. I will not be returning, and I wouldn’t recommend this restaurant to anyone who expects basic respect and reliability."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1VE1HaERXWGROVEMxaVZsOHdaRGQyZG05a1psRRAB",
            "text": "The waiters were really helpful and the dim lights in the whole restaurant made the atmosphere and vibe really nice, however i found the sushi quite boring, For the wagyu gyozas i wish you’d get a better portion size for what u pay."
        },
        {
            "date": "9달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfM3F6RzJnRRAB",
            "text": "Abbiamo cenato da Zuma alla vigilia di Natale. Bellissimo locale e servizio veramente perfetto con personale molto efficiente e gentile. Prezzi molto alti , ma cibo davvero eccellente. I dolci ci hanno stupito. Consiglio il menu omakase."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdmRmREJREAE",
            "text": "5 Stars\nZuma NYC delivers an unforgettable dining experience from start to finish. The atmosphere strikes the perfect balance between energy and sophistication, making it ideal for any occasion. Every plate that came to the table was a work of art — fresh, vibrant, and full of flavor. The service was seamless, with staff who were attentive, knowledgeable, and made the evening feel special without being overbearing. From the moment we arrived until the last bite, everything was flawless. Zuma truly lives up to its reputation as one of New York’s finest. Highly recommened!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbUlLNUpREAE",
            "text": "Great service. Good cocktails. The food is excellent. The portions of sushi are a little small, but good."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBNGZ2NG1RRRAB",
            "text": "Had an incredible dining experience at Zuma New York! From the moment we walked in, the staff was absolutely amazing—attentive, friendly, and on point with every detail. The food was outstanding, with bold flavors and high-quality ingredients in every dish. Each bite was a perfect balance of taste and presentation. The atmosphere was just as impressive, with a chic and energetic vibe that made the evening even more enjoyable. Whether you’re looking for a special night out or just a fantastic meal, Zuma is a must-visit. Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNVEptdkdJbEp2NVdREAE",
            "text": "El restaurante es muy elegante y tiene unos lavabos preciosos… pero la comida es pasable porque encontramos platos como por ejemplo el pollo que lo vimos demasiado salado…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdzllUUN3EAE",
            "text": "Amazing experience!\nMy friend and I had dinner at ZUMA New York yesterday and enjoyed the Seasonal Omakase menu. Every dish was beautifully presented and absolutely delicious — a true journey of flavors! The quality of the ingredients and the creativity of the chef were outstanding. On top of that, the service was impeccable — very attentive, friendly, and professional. Thank you for a wonderful evening! We will definitely come back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0RWRUUTJURE5RT1c5ck5IWnFVVGN3TnpkU09YYxAB",
            "text": "It is outstanding experience to eat there the food is excellent the place is inspiring. Recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkMmFDaGRnEAE",
            "text": "This was one of the most amazing dining experiences I have ever had. There was not one dish we ordered that didn't taste good. The sushi was beyond fresh. The steaks were top notch . Excellent service and ambiance. I can't wait to return . I've never been happier after a meal."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3b2VMNTNnRRAB",
            "text": "All in all, decent. Price per person is closer to 200$. The food is good, but not „wow”. I did like the black cod as a dish. The sashimi was fresh. The chicken skewer - was tender but lacked a bit of flavour. The atmosphere is very nice, with the house music in the background making for an ibiza-style feeling."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2d1p2NC1nRRAB",
            "text": "I went to this restaurant for my bestie birthday. We started at the bar because we arrived earlier than our reservation. Cocktails were amazing . I got lychee and rose petal martini & she got Japanese margarita. For food we got sushi, skirt steak, rib eye , mashed potato, mushrooms , rock shrimp tempura and fried calamari , the food is good quality , fresh and delicious."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMYmZ0cUd0LTd6YXFnRRAB",
            "text": "This is my go-to place all the time! My bartender, Juan, made my experience even more memorable with his friendly vibe.\n\nAnd let’s not forget the food—it’s always 11 out of 10!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VObXN6LUM4bjRtek1REAE",
            "text": "I like this place. So beautiful and delicious food. Good service. I like give them 5 star good recommendations"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMX0xDZS1nRRAB",
            "text": "What an amazing restaurant! I loved everything about it the decor, food, service, etc. the vibe of the restaurant is so sexy and glamorous. We ordered the rock shrimp, skirt steak, fatty tuna roll and everything was delicious. The waitress was so patient and kind. We didn’t feel rushed during our dining experience. The dessert was my favorite part ofcourse we had to have the iconic Zuma chocolate lava cake and it was the best. If you’re celebrating something special or going for date night this is the perfect spot."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNNjFrSlNWMXBldFBBEAE",
            "text": "If you're planning to order any entrée, the black cod is a must-try. The miso sauce is rich, creamy, and perfectly balanced with a subtle hint of wasabi that elevates the dish.\n\nThe ambiance at Zuma is stunning--perfect for a romantic date night or a fun girls' night out! It's certainly on the pricier side, but absolutely worth every penny."
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3d3AzTjJBRRAB",
            "text": "Esperienza splendida (come in tutti gli altri ristoranti privati in giro per il mondo). Qualità davvero alta. Servizio non impeccabile . Aria condizionata un po' troppo alta (anche per gli standard di new York).\nPrezzo allineato a new York e alla qualità ."
        }
    ],
    "reviews_count": 84
}