{
    "name": "Hole In The Wall - Murray Hill",
    "place_id": "ChIJoecSE4VZwokRPZG_RdDVXNs",
    "grid": "MN6",
    "address": "445 E 35th St, New York, NY 10016, USA",
    "rating": 4.7,
    "user_ratings_total": 1787,
    "phone_number": "(646) 858-0401",
    "reviews": [
        {
            "date": "12시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poMlUxTjRkRlZVZGpCeFJDMDRlbUpmY0ZSRmJuYxAB",
            "text": "Alison @ Hole in the Wall was so very kind, courteous, and friendly.  She was very accommodating to the needs of Aspen are beloved doggy.  And the brakkie roll and bloody mary’s were great too!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoa1gxUmpTRjlJYjBOQmQwUkhXa1E1VUc4eVVsRRAB",
            "text": "Excellent experience here. I always enjoy the food and the service. I live in the copper and this is very convenient that it’s located in the east tower."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxdVUybDBVVXBhWlhobmNWWTJZM1JIVUZwbE0xRRAB",
            "text": "We pass this place all the time and always say how cute it looks but never been.  BIG STUPID MISTAKE.  The food was fabulous, staff is a delight, prices are extremely reasonable, especially for the quality of food, service and atmosphere.  The melody of flavors of my bagel was DELICIOUS!   This is going to become a regular for us.  Just super angry at myself for not having gone earlier as we wasted so much time and MISSED OUT BIG TIME!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSFZGUm5NRFJ1U2xaWVVtRllhSGt3YWw5clYwRRAB",
            "text": "Wonderful place! Food and service outstanding!"
        },
        {
            "date": "수정일: 5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kbmRXTmpMVUpWTldKU09YRjJhR295WVhOa1QzYxAB",
            "text": "I was wondering if I stopped by or not, but I realized the decision was right!\nThe food, beer(happy hour!), and the service, everything was good and I am ready to go through the final working day of this week!"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWV1JGSnpNelp4UTFsa2NYbHNSR3hmT0V3elIxRRAB",
            "text": "Delicious food made with fresh ingredients at reasonable prices. What more could you ask for in NYC?"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5bVgxaHpSRlJWWmt0NlVsRmtORVV4T1VVM1ZXYxAB",
            "text": "Jack was great. Very nice. Food was also amazing!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCbVVFeElPRlpCVDJOVFZGbzRZVXRvVm5seVYxRRAB",
            "text": "Good food and service"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214dU4yb3diVzVaZFhWWldFUkJjVko0WjNwT1ZtYxAB",
            "text": "From the service to the food it was a wonderful experience and an excellent way to pass the time while waiting for the ferry across."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMGFGUlhlbVYxYkVwTVFrVnNhREJFTWtJMlExRRAB",
            "text": "Wifey and I got the OG burger , my son got the kids meal .Kids meal came in first as specified by us and cut into pieces ...thank you for that !!! No other places where we have been cut the chicken for my son .Little things that people do,makes everything better .Burgers were good. Both serves and unfortunately I can't remember their names but they were awesome ! Next time when I am in the neighborhood I will definitely come by again !"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOUVUybERUM0p2ZGtWNVVHMWxhRlU0Wmpsb2MzYxAB",
            "text": "Hole In The Wall – Murray Hill is a trendy and welcoming restaurant known for its delicious brunch, flavorful dishes, and laid-back atmosphere. The menu offers a mix of comfort food and modern favorites, all made with fresh ingredients. With friendly service and great coffee or cocktails, it’s a perfect spot for casual dining or weekend brunch with friends."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNSy14TjNubDlYNkJREAE",
            "text": "So welcoming, including my pooch!"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKbFFrUkxXa1k1UkVkVFEyeGpTVTFEWTFOelRGRRAB",
            "text": "Cool place. Good food; great service."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psV1JuSmFhWHAyVkZSdmFrdE5WVTFSUzJOQ1MxRRAB",
            "text": "Nice place with a view of the ferry landing and East River. Eclectic menu - I had the kim chi scrambled eggs. Cool vibe."
        },
        {
            "date": "수정일: 2주 전",
            "language": "co",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJYjV5NTdHODV1RVBREAE",
            "text": "Bucatini ftw"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214bFVuSktXV2xRVFZKMVh6ZzFiemcwVWtjNFMwRRAB",
            "text": "Must visit breakfast place next to east river"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201emJFTm9hamRmZW5FM2RtWjVWRlE1YkVjMldrRRAB",
            "text": "I stopped in around 4:15pm Monday 10/20.  I was actually coming from a funeral.  The bartender in an orange shirt acted like he was completely aggravated to have to wait on me.  He was so rude I decided to leave and spend my money elsewhere."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dFJtRjBSRWx6TW1JMlp6TTVXbkZGUWxOM05IYxAB",
            "text": "Everything was great.  Loved it!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KS1oxaGlTSEJqYzBkTWJFRlpPVmQwTTFVNVdsRRAB",
            "text": "The restaurant has a great atmosphere and view. We came here for breakfast. Overall, even though we enjoyed the food, there are a few points to complain about.\n\nTo start with, charging $8 for side salmon and $9 for still water is nothing but madness. There is a huge disparity between the prices of the products on their menu. Also, our coffee arrived after we had our food, which was not a good thing for breakfast."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGbmEweDRkamMyUlVjeGVuazRRa3hmU2pjMWVrRRAB",
            "text": "Delicious meal. Great friendly service."
        },
        {
            "date": "수정일: 11달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQza2I3ZE5BEAE",
            "text": "젤 좋아하는 호주식 브런치 식당!!\n음식이 자주 바뀌긴 하지만\n맛있고 커피도 맛있어요\n무엇보다 분위기가..✨✨"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4b29xWHVBRRAB",
            "text": "음식은 맛있고 서비스는 좋습니다."
        },
        {
            "date": "1달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkbGQwOWlUMjVFWms4emQxQXdVVkZsVFRSQ2NGRRAB",
            "text": "Il locale si trova vicino alla fermata del  Ferry \"East 34 Street\" dalla quale si arriva a Roosevelt Island e Hunters Point. Servizio attento e cordiale, cibo di ottima qualità preparato con attenzione e cura. Abbiamo fatto il brunch con  avocado toast e brekkie roll. Menzione speciale per l'avocado toast, buonissimo. Ottimo rapporto qualità prezzo."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kTE5qWXRhelpKZUhNMlYzaG9WVnAyUm14ZlFrRRAB",
            "text": "I had the most amazing steak & eggs 2 weeks ago so I was excited to order it again. Both times were take out. Both times same exact order. The first time, it was tender and perfectly cooked. I even microwaved it 2-3 days later because I couldn’t finish it, and it was still tender. This time, the steak was way over cooked. I ordered it to be cooked medium and this was in no way medium. There’s not a single speck of pink coloring at all. Pretty disappointed but it’s still good value at $21 I guess."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKWFpqUk9UakJKUkhaUVVtNVVXR05mYlZWNVNHYxAB",
            "text": "Beautiful spot right with tall windows all around to let in the brightness. The pulled pork benedict was pretty good. It's a very convenient spot, just right by the ferry and also close to the apartment buildings nearby."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOSVZYQjVhbWhZVTNrMmEyTnJXbk5CWXkxWk4zYxAB",
            "text": "I like to come to this spot at least once when I visit NYC and having tried the Pulled Pork Benedict and Kimchi Scramble before, loved both, I asked for the server’s recommendation and went with the Wild Mushroom Toast with added bacon. It was an interesting plate, in a good way. The chimichurri ricotta was a nice spread, there were plenty of mushrooms, but I found the herbed parmesan and maybe the garlic a bit too strong. I did enjoy it because it was different from my usual order, but I would rate the Benny (be hungry) and Scramble higher.\nLooking forwards to next time I have the opportunity to visit, and maybe I’ll try something new or go back to my usuals."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWb1dUVkpPRTlLUTNaamFpMTNlVVJsYWxONU1FRRAB",
            "text": "the food was so good and they make the best iced vanilla latte with oatmilk. The place is also so aesthetically pleasing with the natural lighting. Plus Allison our waitress made our brunch experienece complete package. She is pretty too! Love this place."
        },
        {
            "date": "3달 전",
            "language": "fr",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210M2FHcDJjeTFFVW5SUWRITk1ZekZFU0d4Uk9HYxAB",
            "text": "Très bonne adresse! Salades, burgers, sandwichs, brunch ou dîner. Très bonne limonade macha. Service rapide et professionnel. Je recommande le spot. Bravo à tous. Bonne continuation."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4NGIya3plRk5SVlRORE0yZDZOVWQ2Vmt4SVRtYxAB",
            "text": "This spot has become a favorite of mine and I make a stop every time I am in the city visiting! Today was the burger and the best sweet potato fries I have ever had! Such great service and how lucky was I to get Jordy again! Definitely a place to check out!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuN2VDWk9REAE",
            "text": "Great ambience,  amazing food. It infuses asian/japanese flavors in the American dishes. My favorite is Smoked Salmon Toast. It has poached egg, microgreens, cream cheese with Wasabi. Other good dish is Kimchi Scramble. It has scrambled eggs, kimchi, chilli oil, feta cheese, chives. In their dinner menu, whipped ricotta and truffle Parmesan fries are good. Note these sides are huge. 1 whipped ricotta is best shared between 2 people. Fries can be shared between 3 people. We had Australian spritz. It has bitters, oranges, peaches, and bubbles."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSaFdVUlRhVXMyYjA1a1R5MXBVM1pUTUhvNWVrRRAB",
            "text": "Allie was so incredibly lovely and gave exceptional service! I walk by here regularly and had been meaning to drop by at some point—after today, I’ll definitely be back."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGQ1ZERkdSbTVRVlhoMU5FMVBhSE5RUlc5NWNVRRAB",
            "text": "The restaurant placement is perfect,  you can see the water from the large windows. We'll lit with natural light. Food was fresh and delicious, and the service was nice and attentive. Would definitely recommend for a lovely brunch date."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbzh6RjhBRRAB",
            "text": "Best brunch I’ve had in a longgggg time! Seated quickly and food arrived quickly. Plus can we take a moment to talk about these fries??? 🤤 as a baseline you kind of expect fries to be good most places but not to surprise you. These though?? SO GOOD. They were seasoned with tajín which somehow made the fries taste…refreshing?? Idk how to explain it, you just have to try them!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdWRXRHBRRRAB",
            "text": "We ordered the Spicy Shrimp Vodka Rigatoni and the Lemon Broccolini Orecchiette with grilled chicken (+$7). The food took a while to arrive and got cold very quickly, but the taste was good. I personally preferred the shrimp dish, as the lemon one was a bit too sour and acidic for my liking.\n\nAs for the atmosphere, I loved it! The vibe was great, and the nice view made it perfect for a date or a long catch-up with friends. The ambiance alone is enough to make me want to return next time!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGQlQwTnZSM1JLVlRkWmEwWjZkMHd3V0hsbk9HYxAB",
            "text": "Best way to celebrate our anniversary! The food, drinks, and vibes were amazing, and Jake made the experience unforgettable so personable and relatable."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUVZqRm5NbVJrYzFSdFRXRkpiM0Z6VUVwaGRuYxAB",
            "text": "Good food and great service. It was great to justify having a burger in the morning because it was in a great-tasting bagel 😀. Everything was delicious 😋"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxS2JsWTFOMmQ0VjFBMFMycEVkbGg0Y3pGaGQyYxAB",
            "text": "What a treat! Late September, sunny day, view of the water. Friendly, fun, and helpful front-of-house team, and the Salmon toast was perfection."
        },
        {
            "date": "5달 전",
            "language": "ja",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdWZXOXFRRRAB",
            "text": "価格はマンハッタン価格だが、雰囲気よく、また店員さんの感じもよいのでリピートしたいお店。打ち合わせとかに最適。朝も結構空いててよい。お店も広くて快適。\n\n今回はコーヒーだけでしたが、次回はご飯ものも食べたい。"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZZ29uRVZBEAE",
            "text": "Very chill environment, would definitely come back, photo is while seated at the bar. Bartender with austrailan accent made phenomenal espresso martinis. Picture is of the after mentioned drink, but alas it is all gone. Check it out"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZb3N1T1dBEAE",
            "text": "The staff was super kind and made sure everything was perfect! Great service and positive attitudes! I would come back and bring all of my friends for happy hour between my clients again :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNObnZPOVVnEAE",
            "text": "Wanted to give it a straight 5 but couldn't.\nWhat a pleasant surprise to have come across this place just blocks away from my home. Trulky the type of place I like on a weekend or evening.  Love the glass walls and organic feel to it. Staff were excellent & attentive.  The drinks were exceptional but maybe needed a tiny be more alcohol. The food was really good & tasty. Yet my pork toast was on the cold side, which was a shame because the flavors were great. The pork just needed to be warm and crispy. Also, there were no dessert options on the brunch menu. Please add something.  Waffles do not cut it. Other than that, I will definitely be coming back to try the rest of the brunch menu, and for sure, it's the dinner menu as well."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNGZTc2d3RRAB",
            "text": "Had a great experience at Hole in the Wall in Murray Hill. The Big Cheezy was perfectly crispy and buttery. The hot chocolate was rich and creamy, making it the perfect treat. Friendly service and a cozy vibe. Definitely coming back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcEx2Y0lnEAE",
            "text": "Second time here. First time was just before the pandemic hit us hard, so I'm glad to see they're still open. Although the weather grayed out the awesome views of the East River, heliport, and water ferry pier, the fishbowl style facade allows for people and traffic watching all day. I personally prefer the banquette seating in the rear left side because of the cushions on the bench (flat butt syndrome is real). 😬😂\n\nYou can't go wrong with anything on their limited menu. There's something for everyone. Food was served hot, fresh, and delicious. Service was attentive and the place is spotless. #LocalGem #theresthatfoodie #GoodEats"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyMWJlZF9nRRAB",
            "text": "I enjoyed having brunch there, the menu options were great - had a mushroom toast but the mushrooms were cold (otherwise it was delicious); the bacon was so-so. That being said - I loved the place and the staff."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNTczdVlBEAE",
            "text": "Sat outdoors next to the FDR to enjoyed stuffed waffles and a chai late. This is truly a hole on the wall... didn't expect it. Cute and in the cut, with chairs outside and a nice inside decor."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0ZmJrRnZOVm8yUjJaVlpTMVNRbVJaTldsbVpGRRAB",
            "text": "Found this place spontaneously and the ambiance was 10/10. The best vanilla latte + avocado toast I’ve ever had!"
        },
        {
            "date": "2달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwRVpuQkhUVkl3VG5BNWFreHdibk10WjBSaVowRRAB",
            "text": "J’y suis allée pour un brunch : tout était très bon, bien présenté et le service rapide. La serveuse était très gentille et efficace. ́a cuisine est délicieuse.  En plus, l’ambiance est très sympa, avec une vue sur East river. Il y a une terrasse sur le côté qui est aussi très sympa. Réservation conseillée,  bcp de monde après 12h pour le brunch."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZeVNWaHZVR2xGWkRsTWIzWnRNMUpLY2treFlWRRAB",
            "text": "Really horrible service and mid-tasting food. Waited 25 minutes to be seated/order when the place was half-empty. Staff wandered around aimlessly w no urgency while I waited to put in a drink order. Tater tots with sweet chili were less flavorful than those at Trader Joe’s Put in my information to get the free cocktail as advertised on the menu, when it didn’t apply I asked for help and they told me they would figure it out for me. They did something on their machine and then came back and read me the exact same total like they had fixed the issue. When I said I was trying to get the free cocktail they said there was nothing they could do about that, my free cocktail wouldn’t load for another 24 hours. Guess I won’t be getting it because I am not coming back here"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnM05EUkNRa3BCVld0cVZEVmFPVXBCVlZORE9WRRAB",
            "text": "One of my favorite brunch spots in the city! The vibe is upbeat and stylish, with great views and a laid-back feel. The pulled pork benedict and Brekkie Roll are amazing, and the espresso martinis are a hit. Friendly staff and consistently great food. Perfect for weekend brunch or casual drinks. It is right next to the ferry so it was easy for us to get from there to Long Island City"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRNVpreHhTSGg2VldoSWNrVlhlazVLYlc1b2FWRRAB",
            "text": "We had family at Langone Kimmel and ate here almost every day for weeks. The team took immaculate care of us, treated our kids with kindness and respect, and the food & drink were phenomenal. Special shoutout to the espressonic special, field recordings orange wine, and the entire happy hour menu."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjNWIyWldabk0yTUhGUFYyZzVZVUUzZG1SM05GRRAB",
            "text": "Every bite of their food left me wanting more. We were pleased with the value received. The service quality matched the food's innovation. Recognizing customer preferences shows professionalism. You'll leave thoroughly satisfied."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prMGNHeEVYMGt5VkRCeVdUTkNVMmRtV0RNMGExRRAB",
            "text": "Let’s start with positives: food was delicious and fresh, could have been warmer and beautiful seating outside and atmosphere\nService was almost non-existent, we got a table outside and once we sat down after 20min of waiting we got up and tracked down a waiter. The food was brought without drinks which again we had to track a waiter and then track a waiter again to bring a bill.\nBecause of lack of service attention- food was not enjoyed to the fullest. This place needs a manager because staff is not organized and lacks training."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPM3l2dDdoelk2aDF3RRAB",
            "text": "Waffles - flavors worked well. Sauce a little sweet so do mix it well with the waffles.\n\nOG burger - best fries I’ve had in Manhattan. Patty is decent, with generous amount of cheese.\n\nSteak & eggs - steak is very tender and flavorful. Worked great with the arugula topping, salty pesto sauce and two sunny side up eggs.\n\nOverall, quite happy that the restaurant nailed both sweet and savory dishes.\n\nThe hostess was a little cold and unsmiling but the rest of the waitstaff were okay. Paying is fuss-free via QR code.\n\nPretty crowded during a weekend lunch. Love the ambience with high full glass windows. Price point is expected for midtown."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2eVp1alZ3EAE",
            "text": "The atmosphere and the food were amazing!   We had a really nice server and the vibes of the music were perfect.  We will definitely come back soon and often"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NDdDM0pREAE",
            "text": "Loved the Parmesan Truffle Fries! Salmon was fresh and flavorful. Excellent food for a great price!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZeGF6VzZnRRAB",
            "text": "My boyfriend and I frequently visit this place and we love it! We’ve always enjoyed the atmosphere and the food. We decided to come for lunch today, and I had a personal opinion about my dish and wanted to make a change but unfortunately, we didn’t get the best response from our server.\n\nThankfully, Ally came to assist us, and her great service and attitude left us very satisfied. She was incredibly kind and attentive, and she understood the change I wanted to make to my dish. She genuinely cared about giving us the best service and hospitality possible."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyelBXUEFREAE",
            "text": "Fantastic spot overlooking the water! I had the avocado toast,  mushroom toast and an expresso martini, all of which were delicious! The venue is immaculately clean with wonderful energy! The staff was also so sweet and attentive. My server Jordy saw to all my needs and I had the pleasure of quickly chatting with the manager, I believe her name was Kaitlyn, who was delightful! I cannot recommend enough!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzOFBXak9REAE",
            "text": "Came for lunch as a group w a baby and pup. Service was incredibly friendly and the food was fantastic (cute and delicious). It came out quickly and everyone loved their meals! Also very appreciative of how understanding they were when I accidentally broke one of their glasses 🤦🏻‍♀️ Highly recommend!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2NDYydUR3EAE",
            "text": "Absolutely a hole in the wall actually a building*. Totally love the concept of this restaurant. The ambiance to the service totally worth it. From just simply stopping by for coffee or having a full dinner , I definitely love the location in Murray Hill. Food was really good , must try  the Impossible Sausage and Roasted Cauliflower.\n\nAmbiance- 10/10\nService- 10/10\nWiFi - yes\nParking - Street\nReservation- Not Needed"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWFJYcFZlRzR3TVY5aGRGaEVWbU0xVVhSRFlVRRAB",
            "text": "Fabulous food & great staff.\nWould highly recommend 🌟"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMlpsaHJkMlUwWm5aa1VFMU9iWFJ2TWxCbFVWRRAB",
            "text": "Love, love, loved this place. Really interesting spin on breakfast food. I had the kimchi egg scramble, which was excellent. Very cool vibe. Rest of the menu looks terrific. Very excited to come back."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVVJuQlRlbWRPUnpabFVIZEtNMjkyZEZoM1ozYxAB",
            "text": "Ourdoor seating is getting rare but I'm glad they're still offering.  Good service. W"
        },
        {
            "date": "1년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuczVXUDZnRRAB",
            "text": "Ambiente agradável, atendimento excelente, atencioso e rápido. Os colaboradores que nos atenderam foram muito simpáticos. A comida é boa, mas poderia ter mais opções para o brunch. O valor dos pratos condiz com o que é servido e tem a facilidade de pagar pelo qr code direto na mesa. Recomendo."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkd2FWUnRVelZVYlZoZk9VNUdaRVJXVjJaWE9XYxAB",
            "text": "We did enjoy a lot, Delicious food and cocktails!!\nNice for brunch, just for sip, or a coffee!\nThe place is bright and well decorated, they also have a nice terrasse!\n4 stars for « ambiance » be cause it’s a bit noisy.\nVery recommended!"
        }
    ],
    "reviews_count": 64
}