{
    "name": "Pranakhon",
    "place_id": "ChIJeWk_ncJZwokR1QHfApa0dQo",
    "grid": "MN6",
    "address": "88 University Pl, New York, NY 10003, USA",
    "rating": 4.7,
    "user_ratings_total": 2650,
    "phone_number": "(212) 786-6789",
    "reviews": [
        {
            "date": "9시간 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OVGJHaE5aM1ZRWTJKZlRsa3lVVU56ZGtwd1RIYxAB",
            "text": "Service made me feel very rushed."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGalIxZDFRVmhYV1RGRlozVnlSR1ZCY3poSU1tYxAB",
            "text": "Pad Thai ( generous amount and big prawns ), taste good . Massaman curry taste really good too . One of the best Thai resto in NY."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jd2FtZE5USGQ0TFVaV1UwZEpZelpwUm00MlQyYxAB",
            "text": "Ordered 3 dishes. Pad Thai, Red Curry, and stir fried Pork. It was my first time trying Thai food in New York. It was pretty average, really nothing special. No major critique though."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRlR6RkhPVFV6T1hkUlYwTmxSV3BtYVdkT1YwRRAB",
            "text": "We came here today as a group of eight after finishing our midterms, hoping to relax and have a nice meal together. However, our experience was extremely disappointing.\n\nWhen we arrived, the staff greeted us with a cold attitude and told us that if we wanted to sit together, there was a minimum spending requirement of $85 per person, which felt unreasonable and almost like pressure to overpay — possibly even to give extra tips. When we politely declined, we were seated far away on the first floor.\n\nLater, when we tried to communicate again with the hostess, she responded rudely, saying, “You just sit there, okay?” in a very disrespectful tone. We honestly don’t understand what we did wrong — was it because we looked like students with backpacks, or because we didn’t accept her “suggestion” to overtip? Maybe she was just upset that she couldn’t get her filler appointment funded today. Either way, it was unprofessional and left us feeling humiliated.\n\nWe will definitely not be coming back, and I wouldn’t recommend this place to any of my friends."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twb1RYaGxNblJFTFdKc1YxQlpVa1pUUVVzNWFFRRAB",
            "text": "Pranakhon is one of my favourite Thai restaurants in the city. The atmosphere is always very lively, and they have such a wide variety of authentic dishes that I'm always very impressed by.\n\nI often order one of their rice dishes, and they are all so delicious. My favourite is the kaprow moo sub, which comes at a very (authentic) level of spiciness; I also liked the pad krapow and khao moo dang -- pork is always so juicy and tender (crispy pork belly so flavourful).\n\nThe mee kati was a pleasant surprise when I tried it -- I liked how the flavour of the fresh mangos paired with the tamarind flavour of the noodles / sauce. It was a bit heavy, and some of the noodles started to clump together.\n\nFor a less spicy option, I really enjoyed the preaw wan. The sweet and sour flavour was a refreshing contrast from the richer flavours of other dishes like the curries, and I liked the eclectic mix of pineapples, tomatoes, nuts, onions, etc. Made for a very interesting overall dish.\n\nWhile the menu is a little pricey, the lunch special is quite worth it if you're able to come for a weekday lunch. I am a big fan of the Pranakhon salad (which comes as a side for the lunch combo) -- the mango ginger dressing is so delicious and the shredded mango is always SO fresh.\n\nAlways very keen to come back to try something else off their menu. They can get a bit busy at peak times, so definitely try to make a reservation in advance."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psMGJqbHNjek5rWHpWRk5tSTFXV2x0YUdOTGFXYxAB",
            "text": "Long line of people ... Patty, recepcion, made sure we had a wine a fun while waiting... a 10 for her !\nOur night waither: Gain an efficient, warm young lady that had the quality to make you feel at home...\nThe food ... superb !"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSFZYSTJSamRLVkRaVlEySlhlSFJ2T1hSeWQwRRAB",
            "text": "Went there today for dinner without a reservation, but the host was so nice! Even during their busy hour they still managed to find us a table. We came here for the crispy pork and it’s totally worth the hype! Everything was tasty even the drinks\n\nOur server - Fern was super kind and gave us the best service. Everything was 10/10🤩 we’ll definitely come back here!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cak1ubDJUbXcxWjFWUWN6QkhabUpPTFhwdlZtYxAB",
            "text": "This restaurant justifies the search for quality options. You'll notice something different here. The team was wonderful! This place delivered beyond expectations. Delicious dishes and considerate service."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xadU0yVTVibmszTVdsNFNXeG1XVXBFVEZoSWRGRRAB",
            "text": "Thom thom thom!!!! Go thom!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCbWFHdHBSazFyTjFSSllqazVhRlpJVGxkMVVYYxAB",
            "text": "Great food! Thom P was our server and he did amazing! Lively atmosphere but not too loud"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUE4yWkVWbVJUWmtGT2F6RTNaV0ZxZFdsalpXYxAB",
            "text": "THOM! THOM! THOM! THOM! Thom was a rockstar. Food was soooooo yum."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MFVUWktORWxQVEVKMVRXcGtTVlExTkRGV1VHYxAB",
            "text": "thom p. rocked my socks off! go thom p.! so yummy"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkblEyeEtXSE5KZG1KaVdFUlpiRUZLUlhONVJIYxAB",
            "text": "Amazing food and service. thank you so much to our server Thom!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psdlpqRTFkbEIzYUVnMVdVNVhaMDQ1TTE5VVNFRRAB",
            "text": "Amazing food, lively atmosphere, great service. Dirty plates were switched out automatically.\n\nI was impressed that the steamed whole branzino was de-boned.\n\nRecommend all the dishes we got: Gai Manow battered chicken, Pak Boong Moo Krob morning glory, soft shell crab papaya salad, Pla Neung Manow steamed whole branzino, Khao Soi Haeng, and Coconut pudding."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210R1YwVTFVV3BSYVhoelMyaDVkVFJoY0RWMlJtYxAB",
            "text": "The flavor and presentation of the food 1000/10, the ambiance and interior design 1000/10, the service 1000/10. Best Pad Thai I’ve eaten with the most beautiful presentation, I couldn’t recommend this place more."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210cWF6SmpWa2w1YzNWWlgydFpWRkExTmpobU1IYxAB",
            "text": "Amazing"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMlpGQlpPR1pyUXpneldIbFdSM0p5UmxGNU9HYxAB",
            "text": "The taste is very good, highly recommended"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WWldUZ3pVRU5xWDJGVk1sUXdVazV3VG1aMFowRRAB",
            "text": "Excellent food recommendations.  But the hostess was a bit unfriendly."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214MmNGaFpiemRuTkVwSk5XNHllbWhaYldOWmRFRRAB",
            "text": "Honestly, truly, I wanted to give this restaurant a try because of the reviews but I couldn’t. When I got there they closed due to lunch, I guess they were preparing for switching to the dinner menu. So I got the time restaurant around 3.30 pm. The host and manager told me that I needed to come back at 4:30 pm and they said it kind of rude especially the manager.  I was a little thrown off because it showed online that they were open so whatever because I was in the area I was willing to wait an 1 and a half. We came back at 5:00 pm because we wanted to give them time to get ready being that they were just coming out of a break. When we got there the same host shared that we only had less than an hour to eat because they were hosting a private party. I was infuriated not only because was I looking forward to this place but now I had less than an hour to eat and enjoy my meal. I’m not sure if it was because of my skin color but something seemed off. The same host who was there when I came in the first time never shared that there would be a private event so therefore the likeliness of me enjoying my meal inside the restaurant would be slime. So I wasted my time and guess what I will not be back."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSWFUxcHdMV2xEVjJ4VlgyYzJjVTVxV21kSU5uYxAB",
            "text": "massamam short ribs werent as good as i expected, too sweet lacking in kick"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwbVltbFdjaTFYTmpGMlRTMTZUMU51WmtJM1ZVRRAB",
            "text": "Great spot. New Yorks pretty cool. Went here with my cousin. Super cool spot. The food was great. Flavors were there. Thai wasn’t super traditional but pretty good and was more hip if you know what I’m saying. I’m not saying I’m a pro Thai food eater but it seemed like they put a cool new spin on the food. The dessert was really good. It was this mango and ice cream dish. Also this steak dish was pretty solid. Noodles were great, rice had good flavors. Beli rated it a 8.7 and I would agree and say high 8s. Overall great place and even greater people."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GMWJtdHdSazgzTTBsMWVVZFZaa1ZRY1VaS1UxRRAB",
            "text": "Absolutely incredible experience. Be prepared for a bit of a crowd/line when you walk in, but once you’re seated you can take a deep breath and just take the atmosphere in. The food is absolutely incredible (best pad Thai of my life…"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOamNIVXdSbVoyZWt0R2VISk5jRWh5VlVFMlowRRAB",
            "text": "best Thai food in nyc! Tom was amazing!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwakxXOWxOMEl6VFZoNmFFMVBXRWRmWTFSRU4zYxAB",
            "text": "Thom was great and had a lot of recommendations for me and my friend as it was our first time here. The service was really good and he checked up on us frequently. Highly recommend!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pabGEycG5iVTVUUTBwUU5TMVZZa0pKVjNWWFNsRRAB",
            "text": "Thom was the man"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zMGFrOTJlakJIVmxFelVGbHZVelpZWVZwNlNVRRAB",
            "text": "Had one of their seasonal specials which was supposed to be very spicy but was only mildly so. It did taste good and satisfied me for dinner. Service is friendly and attentive."
        },
        {
            "date": "2주 전",
            "language": "th",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OUWVHdDZWMnhuZFVob1dHVm5iVXRyWVZOTVRuYxAB",
            "text": "ขอบคุณสำหรับอาหารดีๆ และอีกแรงบันดาลใจในการเดินทางสายนี้ FC จาก Toronto ค่ะ"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SU1VsVjZkalJCUVVONWRIcE9kalJSYXpsM2IzYxAB",
            "text": "I didn’t eat here but feel the need to leave a review because the hostess graciously cancelled my Open Table res free of charge. Otherwise would’ve had to pay 30pp. Good service that makes me want to come here next time!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wTFgxTlpUekJHYm5rM1RXRlZTR1ZhVEZGek1XYxAB",
            "text": "Excellent Thai food without all the hustle of other high end Thai Restaurants The food was excellent.. great value for the money"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOa1IyWk9aMGN5YTBRMWNGQlpVVjlxWHpKbFoxRRAB",
            "text": "Really encourage to make reservations because they are definitely bustling even after 8pm. Really great start with the steam scallops, a must try, waves of flavor. The Khao Moo dang really money worth and delicious. The specialty Mussaman is just plain incredible."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213M05WRmZRbFYzTnpaRk1rYzJlbk5qZUVoVGNHYxAB",
            "text": "Amazing food and service! The decor is really nice, my favorite Thai Restaurant in NYC!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjMlRqQXpRMjk2ZUhOVlMzaG9ZVEF0WkZGR01sRRAB",
            "text": "Pranakhon delivers a dining experience that captures the heart of Thai cuisine balance, vibrancy, and tradition. We visited to celebrate a birthday, and while there was a $15 cake charge for bringing in our own dessert, the overall experience was memorable for both the quality of the food and the attentiveness of the service.\n\nWe began with Klui Goong, crisp shrimp rolls filled with minced shrimp, ground pork, and cilantro, paired with a plum sauce. The combination of pork and seafood reflects the long history of Thai-Chinese culinary exchange, where contrasting proteins are brought together to build savory complexity. The rolls were light and crunchy, and the sauce added the sweet-sour brightness that makes this dish a favorite in Thai street stalls and banquet tables alike. The Gai Manow, crispy battered chicken breast on a bed of fried shredded Chinese broccoli with lime mayonnaise cream dressing, offered richness cut with citrus. The lime-forward cream dressing gave the dish a refreshing lift, while the fried broccoli provided textural contrast a modern, playful interpretation of Thai balance.\n\nFor entrées, I ordered the Khao Soi Haeng, a dry version of the Northern Thai classic Khao Soi. Originating in Chiang Mai with Burmese and Yunnanese influences, the dish is often known as a curry noodle soup, but here the noodles were served dry, tossed with crispy fried noodles, grilled beef, pickled mustard greens, shallots, red onion, scallion, and cilantro. The beef was smoky and tender, the pickled mustard greens tangy and sharp an essential counterpart to the chili heat and the crispy noodles added crunch. This was a vibrant dish that spoke to the layered flavors of Northern Thailand’s history as a crossroads of spice and trade.\n\nMy companion chose the Khao Na Ped, a quarter roasted duck plated over a bed of rice with yu choy, Chinese broccoli, pickled ginger, and a deep brown gravy. Duck has long been associated with prosperity and celebration in Thai-Chinese households, and this dish stayed true to that tradition. The duck was tender and flavorful, while the dark gravy brought umami richness. Most importantly, the rice beneath absorbed the sauce, transforming it from a simple base to an integral part of the dish, carrying the savory depth in every bite. The pickled ginger added balance, cutting through the richness and refreshing the palate.\n\nOur shared dishes highlighted central Thai comfort food at its best. Kang Dang Moo, a chicken red curry, was creamy with coconut milk and fragrant with basil leaves, long hot chili, string beans, and wax gourd. Red curry paste, made with dried chilies, garlic, lemongrass, galangal, and shrimp paste, gave it heat and complexity. Served with rice, it was hearty, aromatic, and classic. Moo Grob Prik Khing, crispy pork belly stir-fried with prik khing chili paste, string beans, and kaffir lime leaves, showcased a curry style distinct for its lack of coconut milk, allowing the full intensity of the chili paste to shine. The crisp pork belly paired beautifully with the lime’s citrus fragrance, with rice once again essential for balance. Ped Ruan, sautéed crispy duck with chili, garlic, scallion, cilantro, and kaffir lime leaves in a chili-lime sauce, reflected Bangkok’s street food traditions. It was fiery, sour, and aromatic, with the sauce clinging to the duck in a way that made each bite bold and lively.\n\nWhat impressed most was Pranakhon’s ability to showcase Thailand’s culinary geography in a single meal.\n\nThough the cake surcharge was a minor blemish, the evening as a whole was excellent. Pranakhon succeeds in presenting Thai cuisine with authenticity, cultural depth, and refinement. It is a restaurant that honors tradition while offering dishes that feel celebratory and contemporary, making it well worth visiting both for special occasions and for anyone looking to experience the rich culinary history of Thailand."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOdExXaDROVGxKVFc4eFIwTTNUVjlaUjNKUlNYYxAB",
            "text": "Crab fried rice was great, reservations are recommended."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jdGNWbFJOVEo0TWxodFRtTk5kbWM0TURoMldrRRAB",
            "text": "I thought the food was just ok. The green curry wasn't the best I have had, and the chicken was quite dry... I didn't even finish the small bowl of curry. Maybe I ordered the wrong thing 🤷🏻‍♀️ Based on the reviews and this being a NYC popular restaurant, I was hoping to be blown away..."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTVZucDFaMDgwTFU1TVExTktZMkZSVWxkVFRHYxAB",
            "text": "Genuinely one of my favorite Thai restaurants in the city. It also seemmingly is one of the few Thai restaurants that offers Rad Na as a dish.\n\nEverything is flavorful and the lunch special is extraordinary value!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205MlNEazRaRTFJTkhWVVExQkpZMlJLVjA1ZlFWRRAB",
            "text": "The kitchen creates excellence. The restaurant stays organized. Every element delivers. Worth experiencing. They go beyond what's expected here. The staff displays kindness, warmth, hospitality, and professionalism. The costs reflect the food standards delivered. The whole experience was noteworthy & I plan to return!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdmRVVnRTVmRXWm5WYWRVTXRhbVptY0c1SlJuYxAB",
            "text": "Entrees are good portion sizes! Not the best Thai food I've ever had, but not the worst. I would rate the food itself 6/10. Giving the restaurant 4 stars for the cool atmosphere and kinda service. They were out of mango sticky rice which is not ideal."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUFZERmFiVXh0ZDBsVlgyWnBiR1o2WW1KMFZXYxAB",
            "text": "the service oke- food oke"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwNmFqQk5ZalJHUkVkRE5sTjRUa1ZTUkZJMUxWRRAB",
            "text": "Love!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKeGNsaFVNbmw2ZDNwalNUVjJOWFpYZFU5ZmExRRAB",
            "text": "Categorically bad service – read the low reviews and you'll see the same themes over and over.\n\nMy party arrived 10 minutes ahead of scheduled and was seated 20 minutes after the reservation time, and that was *only after* I asked why parties showing up after us were being seated first.\n\nWhile being walked to our seats, we were told that we had 90 minutes to eat. Unclear when that 90 minutes started considering the late seating, but completely tone deaf thing to say before we sat down anyway.\n\nSimilar to other reviews, our dishes came out immediately. We were finished with our starters and mains within 25 minutes, and the amount of hovering we were getting was borderline out of control.\n\nI haven't had such a negative experience in a while. Save your money. The food was average by NY standards (i.e., There are many other Thai restaurants to patronize). Spare yourself the secondhand embarrassment over how the poor service cheapens the entire place."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaeWVsSklVMFUyY21sckxXeHpiVEJMZEV4cmQyYxAB",
            "text": "Not too busy for a weekday lunch. Prices and portions are reasonable. Service is quick and cheerful. Decor is bright and uniquely Thai.\n\nChicken wings - not the best I’ve had but the meat is moist and tender.\n\nCrab fried rice - decent amount of crab meat chunks. Fried rice tastes slightly above average. Not too oily.\n\nMama more fire - flavors are superb. Has instant noodles in it. Half boiled egg is a great touch.\n\nThai iced tea - best Thai iced tea in town."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214a1ZtRkJVWEE0UTNGaVZGUTJiVzQ0YVZwcFlrRRAB",
            "text": "Amazing Thai food, one of the best in NYC, and a standout for authentic Thai food, with fast and friendly service.  I've been here like 5 times, and every time it's been consistently great.  Only thing missing this time was the mango sticky rice, but only because mangoes are out of season, but the other desserts were all yummy too!  Will def come back again!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paSlVsWkdjRlptVjJaSk5ubHJka3gxWlhacFIwRRAB",
            "text": "I came tonight to have dinner with my family, the service was amazing, everyone is super sweet, special shoutout to our server Tom!!! :-D\nHe took some pics and gave amazing service, the food was phenomenal, overall amazing experience, would 100% recommend!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxaVVYVTVZbmxLUTFwMVQyODJaV0kzTjNWWlMzYxAB",
            "text": "Tom is amazing as our waiter and he did a great job. The food was so so yummy here!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGaVFqRlBUbVZHTTNwUU9GcENWRVp2VjBaM1JYYxAB",
            "text": "Come here all the time and it never disappoints. Food and staff are always amazing!  Highly recommend!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BdE5GcENObkZLTkdocmJHTTBNMlF4VmtaS1kxRRAB",
            "text": "Excellent food and amazing service from Gab!  Thank you!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVk1tb3hlR1ZaU21GR0xVUnlka2xYWVRCcWNWRRAB",
            "text": "Well deserved Michelin star!\n\nMy partner walked in and we were seated right when I arrived as they only sit full parties. The drunken noodles were the tastiest. A bit sad they were out of the tea slushy. Very aesthetic. I'm guessing due to the high demand, they let you know that you have an 1 hour and 30 minutes time window to enjoy your meal."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1aWMweFNhRWRGYkZCbFVuTkdjRzB6ZEhVeGJVRRAB",
            "text": "ranakhon is fantastic! The food is fresh, flavorful, and full of authentic Thai taste. The vibe is warm and stylish, perfect for a relaxed meal or a night out with friends. The staff are super friendly and attentive, making the whole experience easy and enjoyable. Definitely one of the best Thai spots around!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTGRreDBabnBaWHpWcVRGazNWemRaYzJSb2QzYxAB",
            "text": "Yum! Had heard other reviews on Pranakhon's food: they were right! It was EXCELLENT!  Our group of five ordered plenty and shared: we all were well-fed!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CdmFqUkdMVzF3Y1d4SVZHZHlkM0JuVVdOV2NVRRAB",
            "text": "Food is phenomenal. BEAU is my server, she s attentive and make sure we have a great time here. Definitely gonna bring friends here again^^"
        },
        {
            "date": "2달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5MGVYTnFMVFpvZEdwTFEyOXBZeTF6ZEc4MmFGRRAB",
            "text": "똠양꿍은 쏘쏘 구용 (근데 라면사리 있어서 좋았어요)\n소프트 크랩 커리는 꼭 시키세용~~ 게가 넘 부드러워서 다 씹어먹었어요"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoMDlHbEt3EAE",
            "text": "다 맛있었지만, 커리 팬케잌 너무 맛있었구요. 그리고 디저트도 너무 맛있었어요. 👍🏼👍🏼👍🏼"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGemFxRU1nEAE",
            "text": "월요일 저녁 시간에 친구와 방문했습니다. chilli p의 친절한 서빙으로 즐거운 저녁 식사를 할 수 있었습니다!"
        },
        {
            "date": "9달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBd1pLTkRBEAE",
            "text": "8Av 42nd St에 일주일 있으면서 2번 왔는데 뉴욕에서 먹은 음식중에 가장 맛있었습니다. 카오팟은 정말 놀라운 맛 !!"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcHJDRjN3RRAB",
            "text": "팟타이 개존맛. 생각보다 엄청 크고 분위기도 좋은 식당임. 대신 점원들이 엄청 성가시게 굴어요. 빨리 먹고 나가라는 압박 느껴져서 불편했어요."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205dU5pMDNWRzFoWmtRdGJtOTJSemt5Wm1WNlNHYxAB",
            "text": "My group of 3 walked in with no reservation and it was a 45 minute wait. Delicious food. The curry appetizer was perfectly crunchy and the soft shell crab was phenomenal. Dishes can be spicy. Servers were attentive and helpful. The ambiance is vibrant and a little retro, adding to the aesthetics."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnNVIwVjBMWGw2YzFSRGNEUjRiSFp6YldKYVkwRRAB",
            "text": "I really enjoyed the street food theme of this place and I thought the waiters’ crossing guard uniforms were a nice touch. I highly recommend the curry pancakes and shrimp roll appetizers. The shrimp rolls were perfectly crispy and the pancakes were a blend of sweet and savory flavors. They were served with two light, refreshing sauces.\n\nI got the Bamee moo deng which was delicious. The pork was nice and tender and the gravy sauce was perfect. However it was served with a soup I thought was rather bland."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOUVZrdFVYMWRvUXpkRU9IWkNaMjAxWmtoMFMxRRAB",
            "text": "As a Thai person, I wanted to say that this is the best Thai restaurant in the states so far for me. Very authentic!!!! The Mama mor fire with cripsy pork belly, seafood and the soup was spicy and perfectly seasoning. The Krapow crispy pork belly was amazing. Also, dried Kow Soi with steak was great. We fot really good service. I loke their uniform. I really recommend to reserve the table beacause it was so packed!!! The decorations were so amazing, remind me a lot about Thailand."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSbWNtaElVbk5mTFVGRFRuQmhNbVpaYUhSS1dGRRAB",
            "text": "Got there right at 11:30, place was quickly filled with customers. The server was wonderful! Decided to try the somtum and for mild spicy, surprisingly it was really appealing to my taste buds (I like it flavorful and not bland). The mango salad was good. The Kee Mao was on par."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNaS0wZk9tdnJ5OExBEAE",
            "text": "This place is amazing! It was the best Thai food we've ever had. I can't even describe how great the food was. From the amazing appetizers to the desert, we loved the food and the atmosphere. I know I already said it, but everything was so good!! It's a fantastic place to come for authentic Thai street food.\n\nThe service was above and beyond. They served us quickly, kept our drinks filled, and worked hard to make sure anything we needed was provided and that everything was perfect. Just check it out, you won't be sorry."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxMlVXNU1iVEZvWm14U1MyYzFjalJDWW5wWE5XYxAB",
            "text": "A wonderful experience. The decor and ambiance really makes the experience complete & satisfying  The service from the front of house to the table was so inviting. I had the pad Thai and Krapow Moo Sub and it was simply deletable. Every bit was packed with flavor. Just the right amount of balance of spice. I will definitely be coming back for another meal."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201UllsRTJiR3REZFZwWE9HNTNUM05XVDA1bWRuYxAB",
            "text": "Food is delicious but if you are not accustomed to spice be prepared. We ordered 2 appetizers and 2 mains. All four dishes were flavourful and unique. The prices are moderate to high. The atmosphere is boisterous and lively. The servers were friendly and prompt. Reservations highly recommended. I will be back to try more dishes."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSFJVSXphVWhFTmtaaGRsQllXRVIyV0hWRWNGRRAB",
            "text": "Great food! Cool decor. Pricey for what you get, but still some of the best Thai food you can get. They don't serve panang curry. Very crowded, even on a Wednesday night. Very loud, hard to hear. Reservations recommended. 3 separate all gender restrooms. Server was a bit short with us and hard to understand."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOUwzX3RBRRAB",
            "text": "Delicious Thai food with authentic flavors. The restaurant has a fun theme, and the staff uniforms match the vibe. The menu offers lots of options and different protein combinations. I got the crispy duck with a flavorful sauce—so good! My friend's dish was also excellent, and everyone at the table loved their food. Great service, friendly staff, and a welcoming atmosphere. Highly recommend for a tasty Thai experience!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wM2JrVjNUMmhsV1hoblpWUXdaVTFaUjBKVFpuYxAB",
            "text": "Have known this place because of Lisa from Blackpink, finally made my visit. The staffs are super sweet and friendly, had given to us the great recommendations.\n\nWe ordered\n🥩Nuer Yang - grilled marinated Wagyu beef, cut as strip very easy to eat, paired with Jaew sauce - sour sweet and a hint of spicy, which is mouthwatering\n\n🐟Pla Nung Manow - steamed Bronzino with chili lime garlic sauce, the fish meat cooked so tender and soft, it melt in your mouth. Although it marks as mild spicy, but we don't think it is spicy at all (my friend can't eat spicy food), highly recommend you order this dish\n\n🍲 Tofu Jian - a nice stew, with soft tofu, celery, mushroom. If you are looking for some vegetables but tired of salad, this will be a good choice and won't go wrong with other dishes\n\n🍮Coconut Pudding - it looks so cute, and tastes delicious as well."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poRWVuVllhMjR5WnpJekxWVjZlbTB6UlZBNVNrRRAB",
            "text": "Food was simply delicious, and even the spicy food wasn’t hard to eat. Drinks were also smooth. We arrived without reservations and got seated outside immediately. Staff are very nice and professional. Highly recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGNVRXWkxZVmRyYVU5aFdXbE5iR3B1UTFRMGRHYxAB",
            "text": "Came here for a family style Thai dinner. Everything we got was incredible!! Fried taro was an unexpected standout app. The minced pork & fried pork belly were also great apps. For entrees we got the braised ribs massaman, crab fried rice, pad Thai, soft shell crab curry & pork noodles and we ate every last bite! My favorite was the soft shell crab curry, I was scooping up the left over curry the flavor was out of this world. For dessert we got the mango sticky rice & I-Tim sundae and both were delicious. The mango was so tender and delicious with the warm, sweet sticky rice. The itim sundae was delicious flavors and textures. Will be coming back to try more on the menu & have more for their seasonal specials. The portions were great for sharing for 6 so we could get a lot and have enough to try a lot and still feel very satisfied."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUGR6bGlTbXBQY0V3MFIxQkplVkU1TWxKa1pIYxAB",
            "text": "Even though this establishment is on the pricey end, the food quality was so good that I felt like it was worth it, especially with the dishes that my friend and I ordered. Every item we had was a hit, and I look forward to returning here to try more items the next time I visit.\n\nTo start off, the crab fried rice had so much real crab that the flavor was dominated by it, which was a great thing. The fried rice itself already had sufficient flavor, and with the crab meat added, it was extremely tasty. The tom yum soup wasn't too creamy and wasn't too spicy, either, finding the perfect balance between sweetness, spiciness, and sourness. The ingredients in it such as lemongrass, prawns, and more, all worked together to provide flavor. Honestly, the fact that I kept throwing away ingredient parts like lemongrass shells was an indicator of how authentic the dish was. The pad thai had a classic good taste with peanuts, chive, bean sprouts, and tamarind, and it wasn't overly sweet like how a lot of Thai restaurants in the United States are, meaning that they put enough tamarind and not too much palm sugar in their pad thai, which was amazing.\n\nOnce again, even though this place was on the pricier side, I thought it was worth it. Nowadays, I am no longer interested in exploring fancy food constantly, and I know this doesn't necessarily count as fancy, but it was still relatively fancier than Thai street food. But this one was very worth it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSNFQxaE1VbG94TW5WSVEyNTVURU5hTkVkZlRtYxAB",
            "text": "Wow, a new favorite among the best of NYC Thai restaurants!  The Branzino was excellent 👌 and the Pad Thai was quite nice as well.  We started with a delicious vegetarian dumpling appetizer 😋, that was delicious!  The atmosphere has a feel of the streets of Thailand.  The service is friendly, fun and very attentive.  Five stars all around."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poV2VHSnJWM0pITVhOalNXdzJRbTlDVEcxNFdVRRAB",
            "text": "⸻\n\nI’m Thai, and I can honestly say Pranakhon is one of the best Thai restaurants in New York. The flavors are authentic, vibrant, and full of life. The Khao is absolutely outstanding fresh, colorful, and bursting with flavor. Every dish I tried was so good, and it truly felt like a taste of home. Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQNzNqNnVxbXZxTFp3EAE",
            "text": "Really great spot for Thai food in the city! we enjoyed everything we tried. The Thai iced tea slushie is delicious so definitely give that a try. The staff was super friendly, the service was great and quick! Restaurant had a very nice and lively ambience - very enjoyable experience!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jNGEweDNSRzFmVkRsVGFHTTVPV001TVZablMwRRAB",
            "text": "Went there yesterday for lunch. I loved all the dishes I ordered! On top of it my waitress (her named “Beaw” who went above and beyond to make sure I was well taken care of. This is my 4th times in 2 years and always my number one to go for Thai food in the city as a Thai."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SRU1DMDRiRlo1UWt0TGMzRjRRVUpHVVhsdlYxRRAB",
            "text": "Rating: 7/10\nDate Last Visited: 8/25/2025\n\nWe ordered the Pad Thai ($26), Crab Fried Rice ($32), Green Curry ($26), Pak Boong Moo Krob ($24), Curry Pancake ($18), and Chicken Wings ($16). The standouts were the pad thai, curry pancake, and pan boong moo krob (crispy pork belly). The pad thai tasted fresh and light, unlike the average pad thai. The curry pancake was crispy and had the right amount of curry taste. The other dishes were all good too. My only concern are the prices - the entrees are all $5-10 more than other Thai places, but I don’t think the taste justifies the price increases. The appetizers are extremely expensive and not worth it in my opinion. Overall, the food here is really good, but the price is just too high."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CRFQwZDFWV1F6V1RKVFRYbFdSVzFyUzFOUVYzYxAB",
            "text": "This was some of the best service and food I have ever had. The servers are very knowledgeable and my server (I forget her name but she wore jersey number 1) was outstanding. She recommended a traditional thai dish (Krapow moo sub) and it was phenomenal. The service is also some of the best ive ever had around the world. I walked in with a can from the asian market across the street and I had placed it under my chair because I felt bad having it on the table. My server asked to take it and put it in a proper cup and she came back with the remainder of my drink in a mug. This is the type of service that makes you feel at home at a restaurant. I felt like I was getting home cooked meals and family-like service. I highly recommend. I am Thai food connoisseur and have eaten Thai food all around the country, world, and even in Thailand and this place has amazing food. Definitely recommend the mango sticky rice aswell."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVWVHTlpOMUJ5WDNSWlMwcEJRV0ZGWVRsMGIzYxAB",
            "text": "Pranakhon has a very authentic feel to an alley way in Bangkok. The food was delicious. Best pad Thai I have ever had and my wife had the Bamee Moo Dang which was also extremely delicious. Our waiter Natch was excellent as well and very attentive. We will be back the next time we are in New York."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cVp6UnlPVXRwVURFMk5ISkhVbWRITFRBd2VYYxAB",
            "text": "Even though we had to wait like 30 mins for a table outside, the food was absolutely delicious! Everything was well seasoned and tasted very fresh. My fav were the shrimp rolls"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5WWVHOWlWMFppZEhBNVlsVnFhVEkzTFRaUWQzYxAB",
            "text": "The restaurant has a wonderful atmosphere, the food is authentically Thai, and the staff  (Baimon and Nat) are lovely and attentive. The service was warm, friendly, and made us feel right at home."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcFQzRlJZWEUwV1VOUlUydzVSRE14T1VFNE1WRRAB",
            "text": "Hands down the best Thai restaurant I’ve been to in Manhattan. Perfect balance of flavors—not too sweet or sour like many others. Ingredients were fresh and plentiful. The interior had a cool street-style vibe, and the staff were super friendly and professional. Everything was just on point.\nLoved the thoughtful touch of covering the branzino’s eyes — such great attention to detail!\n\n#somtum #tomyumshrimp #pakboongmookrob #khaosolhaeng #planungmanow #crabfriedrice #thaiicedtea"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMlExOWpOalpIVFRkM01FTnNVR3QyZDAwNVMyYxAB",
            "text": "We went there on a Sunday for lunch, and the overall experience was good. The food we ordered (Pranakhon Pad Thai, Krapow Moo Sub and Chicken Preaw Wan) tasted great, and the portion sizes were generous. The decor was nice as well.\n\nThe only small complaint I have is that it took quite some time for the food to arrive. We were in a hurry and had to wait almost 30 minutes before the dishes were served. We didn’t expect it to take that long, especially since the restaurant wasn’t overly crowded (there were still a couple of empty tables).\n\nThat said, once the food was served and we told the waiter we were in a hurry, they were very prompt in bringing the check. The staff were courteous throughout, they greeted us warmly, explained the dishes we were unsure about, asked about food allergies, and informed us when the food was ready.\n\nI think if we hadn’t been in a rush, we would have enjoyed the meal even more."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTVduVjRkMWhUWjFSd1VTMXdaV1JGWWtWQ01tYxAB",
            "text": "I could say this is the best Thai restaurant for me in NYC.  The quality of food, the decoration details, the atmosphere here are representingThai street food perfectly. We enjoyed it so much.  My favorite dish here is Pad Thai. You must try."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcVFYVmZkR1JUVEc5d09YSlFjMk5QVG5veU4xRRAB",
            "text": "An amazing place to try Thai street style food!! There are classic dishes available too.\n\nFood here had higher heat than the rest of the thai restaurants in nyc!!\n\nLoved their usuals - massaman curry & fried rice ❤️ also their golden pomelo was a delightful surprise - a true flavor bomb!!\n\nPranakhon is my new nyc fav!! Will be back to try more!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xeE5EVjZkR0ZhUWxselgzQk5RM2d5U0VKT1RXYxAB",
            "text": "Amazing Thai restaurant in NYC! We loved everything we tried but be careful with the cocktail selection. They are very unique, you like them or you hate them. The service was exceptional and prices were affordable!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aZk9IaE9jbUpIU1d0TVEzUnlkSEEyVEV0eVQzYxAB",
            "text": "Delicious food, friendly and attentive staff, and fun and vibrant ambience. We had green curry with shrimp, noodles with  crispy and BBQ pork, and curry pancakes for appetizer. Everything was so yummy and the curry had a nice heat to it which I love! We will be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZd2VHa3dia0Z5YTNCQ2RtRlVVV3N3TTFGVGFYYxAB",
            "text": "One word: WOW. Easily the best Thai food I've had in NYC. The Bamee Moo Dang is a must-try, absolutely packed with flavor. Despite the place being packed, our food came out quickly, and the service was genuinely warm and attentive. Can't wait to come back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKXzAzdGpQaU55SjJ3RRAB",
            "text": "Absolutely delicious Thai food with 100% authentic Bangkok flavors! Loved the street-style vibes and warm Thai hospitality. Highly recommend this spot to anyone looking for a truly authentic Thai dining experience."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcktuN05REAE",
            "text": "I recently visited Pranakhon, a charming Thai spot, and was thoroughly impressed. The atmosphere was cozy, with warm lighting and friendly service. The menu offered a great variety of traditional dishes, and the flavors were vibrant and authentic. I highly recommend the Pad Thai, which had the perfect balance of sweet, salty, and tangy. The green curry was also a standout—creamy, rich, and just the right amount of spice. Overall, it’s a great place for anyone craving delicious Thai food in a relaxed setting."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SNFltVkNYMmhOTXpOM1owOWlUMjQxUTAxUk4xRRAB",
            "text": "Great atmosphere, friendly staffs and fast service!\nBut the food was a little shortcoming for me. The spices were quite overwhelming that I couldn’t finish the food. The portions were also large and good.\n\nOh and I was shocked by seeing 30% tip option recommended haha.."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaGVXY2tnRRAB",
            "text": "Very cute place, decor brings me back to Thailand. Portion to price is fair flavor quite  good on the short rib curry, krapaw moo, ice tea & ice coffee. Didn’t like the pad Thai too soggy & taste is somewhat different from most Thai restaurants. The temperature on all dishes were lukewarm at best which was a disappointment."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMdmNpcEQxdHY3S0R3EAE",
            "text": "Love the food and how creative the interior design is.. Im in Thai, get sll the creatuve ide.not sure if foreginers eould. Food there is definitely authentic. We like all the food, Som Tam (papaya salad) wasn't that great. The rest is good, including the freindly service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveV9Ub0tnEAE",
            "text": "This place is so well reviewed unsure it matters at this point but they deserve it. Sensational Thailand accurate food and even the ambiance. The Kor Moo Yang appetizer is so good I’m getting as my meal next time.\n\nEven have extra wiring all over and all.. just like Thailand. 😂 Super fast service and lots of tables and bar seating. They will squeeze you in if you don’t have a reservation."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paelJXNXpSbVZaWTAweFNEWlpaRUphVTFWc1JYYxAB",
            "text": "I really liked this place. We came at opening time and got seated right away. The atmosphere was nice and the smell reminded me of Thailand.\nI ordered shrimp Pad Thai (not spicy).\nEverything was fresh and tasty.\nIt was a bit too cold inside because of the strong AC, and the staff checked on us a little too often, but overall I had a great experience.\nI’ve already recommended it to friends and will come back again.\nThank you, great job!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdlUzSXpTWFo0UXkwMlUyRXRaMWxmUVdkMlpVRRAB",
            "text": "NYC doesn't disappoint when it comes to Thai food, but Pranakhon was exceptional. This one is getting added to my list of favorites. I had the fried Bronzino with papaya salad, it was perfect."
        }
    ],
    "reviews_count": 92
}