{
    "name": "Sinigual",
    "place_id": "ChIJfzIvuANZwokRqytv5KEVvyM",
    "grid": "MN6",
    "address": "640 3rd Ave, Manhattan, NY 10017, USA",
    "rating": 4.4,
    "user_ratings_total": 2802,
    "phone_number": "(212) 286-0250",
    "reviews": [
        {
            "date": "4시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wMmVuTnhhRVl3TXkxZmFrdG9iRWc0VGpGWmJIYxAB",
            "text": "Great happy hour, loved the taco platter. Our waiter William was great, very welcoming service. Will definitely come back."
        },
        {
            "date": "9시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taTExVSXdjMDlIZUdsbVEyWlFiV3h1UldKTFZHYxAB",
            "text": "If I could rate this place higher I would. Food, amazing. Ambiance, amazing. Service, amazing. Our server, Karla, so attentive and made my experience worth while. My new favorite restaurant in NY!!"
        },
        {
            "date": "12시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poaFQwOW5VRzVPUWkxa1JYVmFTMk0yZWxaSmRIYxAB",
            "text": "Had such an amazing time here! Our server, Karla, had great energy and amazing service. She was very attentive and on top of everything. The tacos were great as well. Overall, i had an amazing experience at this restaurant."
        },
        {
            "date": "수정일: 2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjdGFXbFNVVkF3ZGt4SU1uUnZSbTl6T0hWV2FYYxAB",
            "text": "Love this place! The food is sooo good here! The restaurant is pretty! The service was pretty good from one person lol But yea mostly everything on the menu was good in my opinion"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pacVRHWm1kVU5wZDBjek4xQXhNV1pvVVZneVdXYxAB",
            "text": "Tacos Vampiros were decent. Corn cake was pretty good."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psU2VUaDRYMFpuT0d4SFRVcGpaR1JHVEVkTVVXYxAB",
            "text": "The atmosphere here keeps me lingering longer than planned. Workers here deliver dependable assistance. The food quality here regularly amazes me. This spot has become a regular destination. This spot meets a wide range of needs."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201VVpuSnZhSFpuZUZwR2R6ZFNSVE5QTTNaMk1YYxAB",
            "text": "Great Mexican spot, Edwin our server recommended me and my friends the sampler as an appetizer and it hit the spot!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ONmIxSlVlVGQwWlhKMFltbHZRbFZ6TTNWblJWRRAB",
            "text": "Great service from Edwin, Love the shrimp diabla & the guacamole."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210MFUyMUZXVE5VUmpremIxTldiM0J0WVVkak5WRRAB",
            "text": "I came here yesterday with my boyfriend, hostess were very sweet to us & our server Edwin made our experience great. Love the Mezcalero & the watermelon margarita. Will be coming here more often"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWalRuTnFOaTFhTXpaMlIwRXRia0U0ZUdwR05VRRAB",
            "text": "Had a great experience! Was here the other day and Edwin our server made a nice spicy guacamole & the superema fajitas were so good! Amazing service."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xabE5rY3hWR1owU0hSek0xaHNiekYxVVMwMVlVRRAB",
            "text": "I came for lunch today and it was the best experience. I didn’t even know there was a dish called carnitas yucatan and Edwin, our server, recommended it to us and it was the most amazing thing I ever tasted. His attention to our table and recommendations made our experience exceptional. 10/10 I would come again and so should you."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xS1NuUjJaR2xOWVROUlJsOVFSV1p4UmtWVVJrRRAB",
            "text": "Great service from Edwin today, love the watermelon drinks!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xreGVrVmhNVmd4Y0dKVFFtbERXVkIwYUdSdU5YYxAB",
            "text": "We made a reservation ahead of time and arrived before the dinner rush, the restaurant was completely empty. The hostess refused to accommodate our 22 month old, insisting we sit in a booth (even though the place was empty) and then telling us we couldn’t use a high chair there. When we suggested sitting at a table with chairs, she instead placed us in the last booth by the kitchen, right next to swinging doors and in poor lighting, our daughter was coloring in the dark.\n\nWhen we asked to move to a nearby table, the hostess again said she couldn’t accommodate us. Thankfully, the manager stepped in, was incredibly kind, and immediately found us a table where we could use a high chair. From that point on, every staff member we interacted with was gracious and friendly. Food was as you’d expect for a casual Mexican restaurant.\n\nI’m still not sure why the hostess went so far out of her way to be rude and unaccommodating, but the rest of the team handled things well."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xac1RIQlRZVmxRYkRrelVHVm9lVVkxUlZoWWVsRRAB",
            "text": "I came here a couple days ago and Im obsessed w their honey butter and tortillas! Valcy took care of me well. The fresh watermelon marg was refreshing. Would come back!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CeFFqQmZhR05DUlZZME5IbDBaa2M0WDNsMmVIYxAB",
            "text": "The black dimound Edwin recommended me today for lunch was amazing!!!! The fajitas were amazing!"
        },
        {
            "date": "2주 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WaWFVRm9TVkJDTUhaUlNrSTJXbkpWTldkSU9WRRAB",
            "text": "Guter Mexikaner. Highlight ist die direkt am Tisch frisch zubereitete Guacamole."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tReVRrSkpiSEJuZW5sR1NscDFPSFJDZWtwRVJtYxAB",
            "text": "Great service from Edwin! Love the Margaritas."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCRlVXbHZjRGhIUTNWZmFsTkpTbEpaZFhob2FWRRAB",
            "text": "Food and drinks were amazing, staff was friendly and knowledgable about the food and menu. The place was clean and very inviting, however it was far too warm in the place (though they might not have had any control over that) would definitely eat here again!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RdFIzTnFNRUZvV1VOa1FsbHROVEJPZEd4dk9XYxAB",
            "text": "Fantastic food, huge portions…\nVery nice, polite service with good recommendations."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5TlducHhhWGhzUjJrMFlYaHVkalp6TVRSUGFsRRAB",
            "text": "Edwin is such an amazing person, recommended me and my family the sampler platter and the fajita superemaa!!! Thank you Edwin great food!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKak9GcFlhSEJTVG05ZlQyUlpMV05XYkY5TWRGRRAB",
            "text": "I visited sinigual last night and Edwin our server was fantastic. Definitely come and stop by great food and amazing drink."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJeFdta3hNM2hSVG05cFdtUnBORzlQVGxSVVZIYxAB",
            "text": "Such great service from Edwin, the black dimound he recommended was so spot on & the shrimp fajitas was so amazing. Thank you Edwin for making our experience amazing!"
        },
        {
            "date": "수정일: 3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaHAzM0NBEAE",
            "text": "He vuelto después de tiempo y nuevamente, y la comida no decepciona muy rico el servicio impecable las bebidas muy buenas y precio accesible"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kTGVIWkxjamwyUkhoNFNVNUhOVE5MTm5GM0xXYxAB",
            "text": "Asistí con mi familia y la comida muy buena, las bebidas estupendas y el servicio excelente. 100% recomendable"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGS2FTMXdVbXBxVDNVM09HVnVOVGhuU1ZGT2FsRRAB",
            "text": "La comida super delicious. Los frijoles me recordo a mi abuelita. Las fajitas de carnes amazing!!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KdE5sOTZiVGx2VWs5c1ltcGtOV2x0WmpWTE0zYxAB",
            "text": "Delicious great atmosphere"
        },
        {
            "date": "3주 전",
            "language": "ig",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psSVVGQlJaVlJvYkU5ZmIySm5jRTFoV0VoU1gxRRAB",
            "text": "CHISOM"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOMFQxQjRZbVIxZFVORGNucDJlRTVNVWxSWlFtYxAB",
            "text": "Came on a Tuesday night with my family, Edwin our server recommended us the create your own combinations & it was amazing. Great service from Edwin & great cocktail can’t wait to visit again soon!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paeVV6aHNSRlJwTVY4eGRVeE9ibWhWVmw5a2MyYxAB",
            "text": "Went for Happy Hour... Service was good, server attentive, but Happy Hour food offerings very lack luster: tacos carnitas and fish tacos  bland and bottom sides of tacos very soggy. Although the cheese quesadilla portion was  ample, again, very bland tasting. Additionally, margaritas, refreshing, but tasted like a mocktail---could not detect any tequila."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toRGRGY3paVE5YYzAxaWFIYzJRM0E0WmsxeVZuYxAB",
            "text": "Good service! The food was really good but it lacked salt. The shrimps were perfect, not overcooked, not undercooked. I loved that as soon as I sat down the waiter brought me delicious nachos with a hot sauce on the house! I will definitely come back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taeU56QktOblZmU0RWR1RFcHhVbXcyZVVKcVJsRRAB",
            "text": "If you like Mexican food, this is the place."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGWmIwdG9SbkZpUmxSd1ptZElRVlp6UjFJemRIYxAB",
            "text": "Very nice place great food a bit rushed by waiter though..thanks"
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcWFfN25RRRAB",
            "text": "Richard was an incredible server ! Food is delicious!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pScE5FMXFSWGhwYzJ4MlIzUnNURGh1VDFkUFYyYxAB",
            "text": "Friendliest staff we had in NYC for a week"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVE5FODNlbEZxZUhCQ1dHMXdOa3BrUjBoWWFWRRAB",
            "text": "Ordered the tacos which came out cold. We sent the food back claiming that the plate was actually warmer than the chicken and steak. The manager became obnoxious and wouldn’t leave us alone while my husband and I were busy frantically trying to find another restaurant to go and eat at. He was so rude it was it was really uncomfortable. Couldn’t wait to leave."
        },
        {
            "date": "수정일: 1달 전",
            "language": "ja",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwelJXbDZjVVV6U1hOQlgzcENNemhOZW14alZsRRAB",
            "text": "ワカモレを、パクチー抜きしてもらえた。目の前でつくってくれておいしい！スパイシーでも辛くない？"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201bVpXWnpUMWxYUVU1UldFcG1NR1JuYm5OM01FRRAB",
            "text": "My friend and I went to Sinigual Mexican Cuisine restaurant on Saturday, 9/27/25. It was the second time and the food was as good as the first time. I had the Chicken Taco Vampiros and my friend had the Sampler Platter. I also had the Deep Fried Ice Cream that is heavenly delicious. The food is fresh and extremely tasty. The portions are worth the price. Nicole and Luigi were our servers. They were friendly and helpful with our questions about items on the menu. I read a review that said the service was slow. The food is well worth the wait. Sinigual is also a beautifully designed and comfortable space. We recommend Sinigual to everyone."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20weVRURXRXWEJSTkdoWExYTmFNVlExTlV4ZlNGRRAB",
            "text": "I really love the guacomole here! Freshly made on the spot and taste sooo delicious.\n\nI came here during lunch time and although the place was packed, but we still got the seats fro us. The ambiance of the place is lovely and I love the interior design that they have here. It gives you a fun and vibrant vibe, perfect place to enjoy delicious Mexican food with friends and family.\n\nI love the nachos, tacos, quesadilas and the yuca fries!  They have more food and drinks in their menu as well.\n\nIt's easily reached as well from our office, an easy 10 minutes walk. Staff are friendly and helpful, most of them are also cheerful.\n\nIt's close to Grand Central and many shops around the area."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUGIyUXdWVGhEVGw5eWNEZzNhMUV6V0RWMWFrRRAB",
            "text": "This place was fantastic. Charming atmosphere, good food, and fantastic service. The table side guacamole was very good, but I'd say the tableside preparation while cool, is a bit unnecessary. Overall a good experience, if a little pricey."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKcGNtZGpjMTg0YUdST1kyaGZOMnd5VkhGVmEyYxAB",
            "text": "Excellent great experience nice service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMVJuTm1SVEIyU2tKWmNXeHVlR3g2ZVd0TlNGRRAB",
            "text": "Been there yesterday evening for drinks and dinner, booking at the same day was easy and customer experience was definitely great. All staff was friendly and cheerful.\n\nWe had the guacamole at the table prepared by Miguel, which was nice and friendly all the time taking care of us.\n\nThe grilled beef fajitas were just cooked perfectly and tasted delicious. Beef tacos also great with the side dishes.\n\nDefinitely will come back here. Thanks guys"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPemxfOEx6bnNES2dnRRAB",
            "text": "The honey butter and salsa on tortilla is wonderful as are the guacamole and chips. Of course, the entrees are really good too."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBdFNqQndOak5XZFc1RGNIWlVaRmhpYVhsM1RuYxAB",
            "text": "Great food\nGreat customer service\nLoved it ***"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVlVIQldSVVpNY1V0ZmIyZEpSR3RMYVY5aVZVRRAB",
            "text": "We had a great time coming in for Lunch to celebrate two of our friends birthdays, food was great and Isabell was amazing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCNWJYcFJNREJUUkRkYU4wSm9aMmwyZGtwM1oxRRAB",
            "text": "Great Mexican fusion restaurant, they have great cocktails and the fajitas are excellent. Usually is a very crowded place but midweek seem to be the time to visit."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201S2RDMXNUakF3WWxWcWNtRlpSRmw0Ukd0SVNXYxAB",
            "text": "Sinigual is a fantastic, family-friendly spot that goes the extra mile. I was so impressed that they offer a free dish for kids, which makes dining out with the family a breeze. Watching them make the guacamole fresh right at our table was a fun experience, and they even had coloring paper to keep the kids entertained. It's a great place for delicious food and a relaxed, welcoming atmosphere."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOd1JXOHpNeTFETnkxUVkwNTFhbVJEU1RORFkyYxAB",
            "text": "I randomly found this place while walking around the neighborhood. Without a reservation, I was seated right away. The waiter David was very polite and professional. As a angeleno, I found the paloma really refreshing and authentic. The food was also amazing!! Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTWIzSlVjVzk0TlVoQlMwTjJOR3RhY2paaGJIYxAB",
            "text": "Ashley was managing all the tables and asking if we needed anything else. And David was our server he is such a good guy, patient and careful with all details. If you plan to have fun, getting recommendations about food, drinks and desserts this is the perfect place to go. But keep in mind that most of the food is spicy a little bit. Nice and quiet. Good for friends meeting. The price looks reasonable and the quantity looked fair to me. Outstanding service.  I really recommend this place to anyone. (I went on my birthday and they make me this detail, a quiet happy birthday song 🎶 perfect how I like)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twTWFYWTFXblV0Wm1aa1dWQk1aMGRuWkhRNVVsRRAB",
            "text": "Been coming here for years and never disappoints. Ask for Luigi the waiter. He is top notch!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvMFZISm9TWGRtZW05eFdHaFVjRmcyTlZCTk4wRRAB",
            "text": "Excellent attention.  The waiter, William Téllez, was very professional and attentive.  It made us feel at home."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJdGZQR0xBEAE",
            "text": "가격대비 양도 많고 푸짐했음. 여자2명이 메인으로 스테이크, 쉬림프 샐러드 먹었는데 스테이크는 좀 많이 짰으나 샐러드랑 먹으니 괜찮았음. 샐러드는 아보카도를 즉시 으깨서 섞어주는게 인상깊었음"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCMDUycTRBRRAB",
            "text": "타코, 파히타, 엔칠라다 맛있어요~"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JeUxYVkxhVkp3TFhwc01GUmFRM1ZtVEVGTk1IYxAB",
            "text": "I came here for a free event. So, yes my review my be a bit bias and take it with a grain of salt. We were served Hors d'oeuvre through out the night with free drinks as well. Tortillas tasted homemade and held well. And I can honestly say I enjoyed each little taco served. Grilled Chicken was not dry and had flavor. Steak was amazing. And the fish flaky and well prepared. Flan was creamy and perfectly sweet. Churros were crunchy on the outside and fluffy on the inside with a The right amount of cinnomon and sugar. And the ambionce was cozy and clean. The fact that they took a night to have this event says a lot. A restaurant that takes time to promote themselves with free food and doesn't miss has my apporval"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQcWwtS2lpM182Qkh3EAE",
            "text": "Tuve una experiencia excelente en el restaurante. La comida fue espectacular, cada plato lleno de sabor y muy bien presentado. Quiero destacar especialmente la atención del mesero Santiago, quien fue muy amable, atento y nos hizo sentir como en casa durante toda la visita. Sin duda recomiendo este lugar para quienes buscan buena comida y un servicio impecable. ¡Volveré pronto."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aWmJYSjZla3N4V2s1UFlUWlJYM0JKTW5GcmVrRRAB",
            "text": "I loved dining at Sinigual ❤️ The vibes were perfect for date night.. but they also have a huge space for larger parties if you’re coming with a crowd. The food was delicious, it smells amazing inside always. I highly recommend trying the cucumber jalapeño margarita. It is unbelievably refreshing and not strong."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poZlltNVJMVTFIYlhsR1UzZ3pPVmxSTTIxTk1FRRAB",
            "text": "The food was very tasty here. Fresh and crisp!  The only small complaint I would have is that the device was not great. We had to chase the server down a few times for simple things like asking to order appetizers or even more drinks. Those things are usually a given."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcWRUYlhBEAE",
            "text": "Tried the dinner during restaurant week. Service was hit lacking due to a big private party. Food was tasty but not exceptional. Drink had good spice thought wasn’t mentioned in the menu. Table side guacamole was very fresh and flavors. Plenty of food for 3 course we went with full stomach and Togo bag for the next day lunch."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTUR3eFlBOBAB",
            "text": "We stopped in here for Happy Hour and will def be back for a proper meal. The sampler platter was very, very good and the chipotle-tamarind ribs were a home run for the entire table. I’d honestly go back just to have those again. They were so juicy and fell right off the bone. The people who had the sangria were impressed."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3LTgtRE13EAE",
            "text": "This was my 2nd time at Sinigual and I had an amazing experience.\nI went during lunchtime on a Monday and I was accommodated without issues.\nThe server Miguel was awesome explaining the entire menu and genuinely checking in our table.\n\nHere’s what we ordered:\n\nAppetizers:\n🍛 Sampler Platter: it comes with taquitos, quesadillas, steak nachos, bbq ribs and delicious sauces\n🥗 Tableside Grilled fajita salad (added steak): they make it right in front of you. It’s SO good\n\nEntrees:\n🌮 Grilled chicken & fish tacos\n🥩 Filet mignon enchiladas & grilled shrimp\n\nDessert:\n🫐 Berry tostada\n\nDrinks:\n🍹 Cadillac\n🍹 Watermelon Margarita\n\nExceptional food, everything is made in house with authentic imported ingredients. The tortillas were warm & fresh.\nThe sampler platter is perfect to try 4 different items and the flavors are incredible. Large portions comparing to the average restaurants. Drinks were well balanced, bartender knows what he’s doing 🔥\n\nChef Juan stopped by and explained the menu, the ingredients and their hard work to keep the authenticity of their dishes.\n\nThe staff were sweet and everyone made the experience super special!! I’m obsessed with Sinigual and can’t wait to dine here again."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4cU1FRnVNMWd5VWpNNFFsZE1iV0ZsUlc1WGRVRRAB",
            "text": "Lugar, comida y atención 10/10 , si quieres un lugar tranquilo , ameno , con una gastronomía deliciosa y excelente atención , esta es mi recomendación, nos atendió un señor con un corazón de servicio al cliente increíble( el señor William). Dentro de mis recomendados en comida mexicana."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLbjRrOG4wcmRHYkNnEAE",
            "text": "Very cozy and warm restaurant. The fresh tableside guacamole was tasty! The Black Diamond margarita was delicious and unique to us. The carnita tacos were my fav. My husband loved his filet mignon enchiladas with shrimp. Our server David B was great!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfM3JxUzJRRRAB",
            "text": "Sinigual provided the perfect setting for a casual yet memorable business dinner. The atmosphere, though a bit on the louder side, had a vibrant energy that made it feel lively and engaging. The size of the table worked to our advantage, as it allowed for easy conversation despite the buzz of the restaurant. The modern Mexican décor added a touch of sophistication without feeling too formal—ideal for a relaxed but professional setting.\n\nThe food was outstanding. We started with fresh, flavorful guacamole made right at our table, which was a fun and interactive touch. The tacos, packed with tender meats and vibrant salsas, were a standout. For the main course, I had the fajita steak, which was perfectly cooked with a smoky chipotle sauce that added just the right amount of heat.\n\nService was attentive without being overbearing, and the cocktails—especially the signature margarita—were a refreshing complement to the meal. Though the noise level could be a bit high at times, the table's proximity helped keep conversation flowing smoothly.\n\nOverall, Sinigual strikes a perfect balance between casual dining and a polished atmosphere, making it an excellent choice for a business dinner that doesn’t feel stuffy. I’ll definitely return for another enjoyable experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiak55MmZ3EAE",
            "text": "Decent place. The vibes and drinks are nice. Food is average. Got the chicken breast with fajita..which was simple but not worth $26.\nThe combo platter containing 4 items for $29 is worth the price, good quantity and options. The enchiladas was good. Tacos were decent."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfcmNDaXZnRRAB",
            "text": "My friend and I went to grab drinks and dinner! Mocktail and martini were so good, the food was truly top notch. I’m big on presentation, and they definitely did that justice. Delicious, will definitely be going back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUc3VIOFF3EAE",
            "text": "Last weekend, my mom, my sister, and I took a trip to NYC. We looked up restaurants to eat at and my sister suggested this one because the menu and reviews looked good.\n\nWe were very happy to have chosen this place. The drinks and food were so delicious and authentic! The staff were very attentive and friendly - one of the best services I've witnessed. The environment was welcoming as well. Our dinner was so delicious, that we went for brunch the next day! Both waiters for our meals were friendly, helpful, and all around awesome - thank you to Christian and Isabel for your wonderful service (as well as the rest of the team).\n\nI highly recommend this place for authentic, delicious Mexican food and great staff/atmosphere!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taaWEybHpaWGxYWlhaVlFtUnlWbWQxZG1aMGVsRRAB",
            "text": "Dined here 3 times over two weeks. All meals were fantastic. Sangria is excellent. Willingness to adjust for allergies is excellent.\n\nOne of the three times was a party of 17 and the restaurant and servers accommodated us with no problem and we had an awesome time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GMkxYSXdaRkUzZUdoVlFYcHdaelprZVhWcGVFRRAB",
            "text": "This place is one of the best restaurants I've been to, period. The service was incredible, the waiters were attentive, and the food was delicious and quick to come out at that. We were even able to be immediately seated even with no reservation, which I feel is unheard of in the city. The atmosphere was classy and perfect for date nights. Overall, incredible place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6dDY2anRBRRAB",
            "text": "My wife and I stumble upon this during their happy hour. And we were blown away by the generous portion as well as the quality of the food they serve on the happy hour menu. And drinks are literally half price. We will definitely come back for a real meal next time we visit and NY."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURicnRfWENnEAE",
            "text": "Really cute spot, lots of groups were eating out so the restaurant is definitely accommodating. The food comes in huge portions so you definitely won’t leave hungry. The fried ice cream dish had good ice cream but the batter wasn’t that great. Loved the chicken tostado though"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5a3BmeGJBEAE",
            "text": "The restaurant offers a spacious and inviting atmosphere, complemented by a well-stocked full bar. The drinks are expertly crafted and not watered down, with the jalapeño and cucumber margarita standing out as a flavorful highlight.\n\nThe Fire Roasted Tomato Soup was exceptional, boasting rich, spicy flavors. The “Pick Any 3” option provided great variety, featuring tacos with beef, chicken, shrimp, and other choices, all accompanied by rice and beans. The tableside guacamole, while impressively fresh, fell short on flavor and had a slightly dry texture.\n\nWhile the prices are on the higher side, this is to be expected given the Midtown location. The abundance of space, including outdoor seating, adds to the appeal. Overall, the combination of quality drinks, a spacious setting, and solid menu options makes it worth returning."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbzZXUHNRRRAB",
            "text": "My friend and I had an amazing time at Restaurant Week. The food was exceptional, and the modern interior decor added to the overall experience. We thoroughly enjoyed our dining adventure."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYM1BIaEZ3EAE",
            "text": "We were looking for restaurant that stays open past 10 PM in Midtown. Sinigual looked as perfect spot.  The restaurant has a vibrant and inviting design, which set a nice tone for our evening. Our server was genuinely friendly and attentive, adding a personal touch to our experience.\n\nHowever, the cocktails left much to be desired; they lacked the punch and flavor I expected. As for the food, it was quite average—nothing particularly memorable. While we were satisfied with our meal overall, the competition among the numerous fantastic restaurants in the city is fierce."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdXNlQVJ3EAE",
            "text": "Food and drinks came out super quick, plate sizes were big and their free chips with salsa are good  - the service was great, Amanda was super attentive. Only things to improve is that the restaurant is too bright and kinda lacks mexican identity!"
        },
        {
            "date": "11달 전",
            "language": "ja",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaDUteU1BEAE",
            "text": "雰囲気が良く、お客さんで賑わっているメキシカンレストランです。カップのChicken Tortilla Soupとメインでエンチラーダが食べたくてChef’s SpecialのFilet Mignon Enchiladas & Grilled Shripを注文しました。エンチラーダは少し思ったものと異なり、残念ならが自身の口には少し合いませんでした。スープの方はアボカドも入っていて美味でした。　（2024年10月）"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MU9lZm5nRRAB",
            "text": "I accidentally walked in during happy hour.\nI have to say...I was blown away.\nSinigual gave us the real deal.\nAwesome service.\nAwesome vibe.\nFood portion is so.. generous.\nEverything is beyond yummy.\nI never be this happy during happy hour.\nHighly recommend it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5VmRtWndhamsxTlc1elJ6RXlUMFJyYW01MkxXYxAB",
            "text": "One of our favorite restaurants we go very frequently and every time we have a great meal.  The fresh Tortillas and Guacamole made fresh at the table is delicious.  The flavor in the roasted corn tomato soup out of this world and everything is always delicious"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcTZEY3BBRRAB",
            "text": "Sinigual was a nice place with great service and food. Would highly recommend the chicken & shrimp fajitas. The tacos were great too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsczhqandnRRAB",
            "text": "Solid place. Enjoyed the food and drinks. Service was good. Only feedback is drinks taste great just need a full shot of tequila in them. Fajitas seasoned so good, but too dry/overcooked. I would still go back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcWJYUzFnRRAB",
            "text": "Sinigual is, in my opinion, one of the best Mexican restaurants in Manhattan! The flavors are authentic, the dishes are generous and beautifully presented, and the atmosphere is warm and welcoming. Whether you’re enjoying their fresh guacamole, delicious tacos… every bite is a true delight.\n\nThat said, the service could use some improvement. A quicker and more organized approach would make the experience truly flawless. Despite this, I highly recommend this restaurant for an unforgettable Mexican dining experience!"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOV8ySGFnEAE",
            "text": "Comimos en familia 13/4/25 mi plato fue salmón. Soy celíaca y pude comer bien.\nLa comida delicioso y abundante.\nRecomiendo"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVGJrRkVPWEIzTjAxTVQwUmxjbVV5WW5WTE5YYxAB",
            "text": "If there’s a zero star I would give it to this place I’m very disappointed because this was my favourite restaurant I always go there with my friends but this my first time I ordered for delivery\nFood arrives cold and it taste like 🤮not fresh and I think they whatever is left over lazy people and the guacamole looks dark it looks like from yesterday I’m not coming back for this horrible place wasting money and time"
        }
    ],
    "reviews_count": 81
}