{
    "name": "Sarge’s Delicatessen & Diner",
    "place_id": "ChIJR_f8ggZZwokRdfXSsyN0IGU",
    "grid": "MN6",
    "address": "548 3rd Ave, New York, NY 10016, USA",
    "rating": 4.3,
    "user_ratings_total": 3621,
    "phone_number": "(212) 679-0442",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOU1lrNVpSMVpSV2xBelgxUmpaa1F0T1hGclZIYxAB",
            "text": "Love this place. Saw it on YouTube, it’s very famous in New York as Sarge’s has the best pastrami sandwiches and it didn’t disappoint, best pastrami I’ve had. Service was fast, food was generous and extremely delicious and the staff is very polite and friendly, I’ll come back next time I’m in New York City, thanks"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJNVFXTjZlRmRUZWt4NFJFczBURWRaUVdwYVRHYxAB",
            "text": "This place is a classic for corned beef & pastrami deli sandwiches.\n\nI had the sandwich which came with pickles and the slaw which was great. The sandwich itself was huge. I wanted to do a split with a soup but the two meat option didn't allow for that. The sandwich itself was decent but I didn't feel or taste a lot of flavor from either meat. It was both very tender but there didn't seem to be much from that or the spread that came with the rye bread.\n\nThe staff was able to get my order within a reasonable time when I arrived, but it took some time to get my food but also it took some time to get my water refill. There was many staff around and not as many people or tables filled at all. So I thought that was a bit odd. The decor looks very vintage and classic leather seats."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkMmVIUlNabFpUVlhKc1pFNXJhVWRRY2xWa1NuYxAB",
            "text": "The cheesecake was rich, thick, and slightly crumbly, with a hint of citrus. I quite enjoyed it. I want to try the food next."
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGMGFXZEpjWEJ2WlRSelZXcG5SbmxYUlU5TVZIYxAB",
            "text": "La comida es para compartir, riquísimo el Pasáramos, las papas y el cole slaw...muy amables los mozos y camareros"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oVVRsWXdSMEpNV0drd1UyeG1lVGxIU25kd1gzYxAB",
            "text": "This is our first family trip to New York and we wanted to go to a classic deli. We decided to go to Sarge’s as we were in uptown. This was amazing. I got the pastrami sandwich but asked to have half a pastrami sandwich and half a corned beef sandwich to have a taste of both. The lady was very accommodating and was able to get this done for me. The pastrami beef was very generous, as was the corn beef. The pastrami beef was not too salty and was very tender. The corned beef was also very good and seasoned well so that you could taste the beef and also could differentiate between the corned beef and pastrami. The turkey sandwich that my wife got also had very generous meat slices. Also, complementary, the coleslaw and pickles came. The pickles were both the fresh pickles that were lightly Brined and the more heavily brined classic pickles. The coleslaw was a moderately sweet slaw with only a slight amount of mayonnaise. In the sandwich, was a very nice crunchy component to the sandwich. I have never been to Katz’s deli so I couldn't tell you whether this was better or the same as Katz’s, but I can tell you that I will definitely come back here as I did not have to wait for a table, and the service was excellent."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SU1ZYbFFiMngxUWxWcGFqWktjREJITjNsZlZtYxAB",
            "text": "Great Taste and very friendly stuff!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xob1dGbEpWR2RFVld3MFpXeGxNMWxxUjFoYWNtYxAB",
            "text": "Huge portion sizes, varied classic deli favorites. The half and half sandwich was pretty interesting."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjM2EybFNSVTR6U20xemNHOHRYM2xIZUdkMU4wRRAB",
            "text": "CHECK your to go order before you leave the restaurant.  The super friendly 40 yo guy at The counter will give you a receipt to pay before you get the food. Check your order before you leave. My matzah ball w noodle soup had no noodles. Russian dressing on the side: not in the bag.  The turkey is good. So is the Cole slaw. The service on the other hand….."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCYU1qZzRXbEpMVlhKbmNXOVNVWE16YjJ0cE4zYxAB",
            "text": "$30 for a pastrami on rye at Sarge’s.\nUsed to be worth it when it was half the price. Now it’s a rip-off. They’re skimping on the meat, smaller piece of rye bread, and jacking up the price, and it took 15 minutes to make. No coleslaw, no sides, just a couple sad pickles. For that price you can get two great sandwiches at any near by bodega. Go to Katz’s or 2nd Ave Deli instead, they still know how to do it right."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxZlNtMHhOVWRsTUZKeVozSjVabUpUVUdWcU1HYxAB",
            "text": "Very friendly place we went there as was recommended on YouTube it was sooooo worthed. Massive portions, very busy until 3pm."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsU00xOXNNbEJrWVVrM1pXWnRSRXBDVkdOWFNXYxAB",
            "text": "Servers stay in constant motion attending to the packed dining room. The level of service is spotless. So delicious and the servings are massive. My top choice. The atmosphere avoids stuffiness completely. I absolutely enjoyed dining here and will return soon!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201elRtMHRTM3BVTTE4dGNsTk9aSGQ0VTNoUlUxRRAB",
            "text": "Great place. Excellent food. Very friendly and courteous staff. Highly recommended."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTVh6bDRNRTFzVjFsSFFrUnJRbkY0V2t4aFNXYxAB",
            "text": "the food is delicious, above the expectations"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsc1JtTmxaMWRxTmw5bFVUSnROVkJKYkZWMFZHYxAB",
            "text": "I had a vegan unreal sandwich. It’s just rolled up bad quality vegan ham. Unreal how bad and lazy it is. Vegans stay away at all costs!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNMGNtbFFSa1ZuV2tWbWRFTXdiMkphWjJsbWRFRRAB",
            "text": "Pastrami sandwich was plentiful,  split pea soup was delicious"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFNVlUZFVjWGx2TldNeWVta3RWekpZY0V4VlYzYxAB",
            "text": "A must visit to the legendary Sarge’s whilst in New York. The place is quite small and looks dated, probably to keep the feel. Outstanding service, unbeatable. The  pastrami on rye was soft and tender, however, it was a little bland, seasoning needed. I have never tried Matzo ball soup and was so keen after seeing all the reviews. Probably just me, but it’s like soft corn bread in chicken soup. Nothing wrong with it, but I’m not going to rave about it ! Great Colombian coffee, the pickles, I have had way better tbh. I’m glad I’ve been, I will try Katz next."
        },
        {
            "date": "4주 전",
            "language": "iw",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5UmJ6ZzNORm93U0c1WFJsUTRZMGxXUVRkMkxVRRAB",
            "text": "האוכל היה לא טוב. בעיקר הסלט עם הבשר שהתחיל להרקיב וירקות עצובים. אכזבה גדולה אחרי כל התשבחות. הסלמי היה מעולה אבל הסלט הרג את הארוחה."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210aVFUUlhRMFZaTW1sdlpsWm9XSEpWVGtkdGVrRRAB",
            "text": "I was sat at a table that seem to be the extension of The wait staffs booth the table was used to fill condiment bottles and anything else the waitress wanted to just place there only my little corner where I sat was clean I wasn't placed at a regular table or in a booth I really didn't like that The corned beef corn rye was very good with coleslaw but I did not like the fact that I was sat at this particular table that was used for everything I ordered a double corned beef $30 and I found that when you pile meat in the middle and cut the sandwich It's hardly any meat around the edges so it just looks as though you have a big sandwich and you actually don't not sure if I would go back if I did it would be for something else"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWTU1uVTRkRWMzWVU1M1RHUldjV3RrTmkxNGQyYxAB",
            "text": "I've been eating here for 40 years and the quality of the food and service has been consistently excellent!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUGRuTnROVTFtVTNOa1VuaDVXVkE1ZG1sbFgzYxAB",
            "text": "Walking into Sarge’s I knew the food would be genuinely delicious. The restaurant immediately gave the old school, original deli impression.\n\nThe french onion soup was the best I’ve tried. I am not a fan of pastrami on rye as a dish, but I could easily tell this was probably as good as the dish can get. The pastrami was tender and perfectly seasoned.\n\nDefinitely recommend dining here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ReE1tYzNabnBMT1Rad2VtZEljbk5HYUZkMFkxRRAB",
            "text": "Food is outstanding!! Peanut butter pie is so tasty and unique! Matza ball soup was perfection,\nThank you for making our night!"
        },
        {
            "date": "1달 전",
            "language": "it",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSGFtVkdXRTE2ZEhKS1NYUXlka1ZFZFVsTmRGRRAB",
            "text": "Locale un pò vissuto servizio velocissimo."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kblpWOUVTemxYVjIxeU1HSmZYMDk1Y0RodmVtYxAB",
            "text": "Food great but the service and employees are the worst of the worst. Really kills the whole experience. Order out if you can and make sure the person responds to you in your language and listens. they get orders wrong all the time. Thank you Lloyd B"
        },
        {
            "date": "1달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMlVITTRkVlV0U0hVd09YSjZTa05MWm0wM1dWRRAB",
            "text": "Bon gros pastrami."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FMFRVRTNibTlNU2xsNFRuQlFZVjl1ZGxwUGNuYxAB",
            "text": "One of, if not,  the best pastrami sandwich I’ve ever had.  Really good and worth the trip.  I strongly suggest trying it"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sc01WZE1SMmhoYkRFNWVsaE9iSFZOZEVKbmRrRRAB",
            "text": "Nice pastrami sandwich."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cFNIVkZaelZSWmpGeE9FdFZRVVpETFZrd1VGRRAB",
            "text": "This is perfect nyc experience when you want to slow down a little, and check out a piece of what made NYC so iconic."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCeGFYZE1SREZST1haM1lUUjBRVUU0VTNCUFlWRRAB",
            "text": "This place is underrated! I’ve never had to wait long and the complimentary Cole slaw and pickles that come before your order are some of the best I’ve had. I always get the Hudson and share it with some fries."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KWU5rUjRjVUpEWVVjMVZUbHhTWG96ZDBOMGRHYxAB",
            "text": "10/10, best of nyc in my opinion"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOeGJrUnpOMDAwYldab1R6TXRaRTV3WmxkR1EzYxAB",
            "text": "I don’t mean to disc Katz deli, it is really great. But it is so impossible to try to get in there. We needed to find an alternative. Sarge is definitely fit the bill. Food was fantastic. Service was great and friendly. Prices were right in line with what I expected. We didn’t have to wait we got seated. We got fed. We got comfortable. Awesome pastrami. What a great day. Thanks guys"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSRVdtRlBZVEZKUmw5Q1l6bFpibk41VFdaalFXYxAB",
            "text": "Best Pastrami I've ever had! Great place & staff"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210TldIcE1iRzlsUkRCSFgzZFVWMll6VVhoemRGRRAB",
            "text": "Great menu selection, many different sandwiches and salad bowls, pastrami on rye was delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCSWRGbHJaR2xGWDJkWUxXa3dRblo2V1ROdGQwRRAB",
            "text": "Horribly rude. I arrived to pick up an order I placed via Uber Eats and it was not yet ready. I stated I’d wait for it and was told to just sit at a table. Strange to not have a designated waiting area—even a couple of chairs—but fine. I sat at a table as directed and a waitress was rude to me and said “Next time let us know”, despite my noting that it was her colleague at the register who had directed me as such! The waitress proceeded to audibly chastise her colleague about it and then said colleague was awkward and rude when she brought my order. Frankly after those interactions I am torn about whether to trust that my food hasn’t been coughed or spit on. It’s NYC. There are plenty of other options. It is not worth it to me to go back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUU1uRndUbmt6V2pJM2RXcFhOSGx6ZFVKemNIYxAB",
            "text": "Pastrami was so big, I only ate half of it. But it was delicious. They serve it with pickles and coleslaw, really liked them. Would definately come back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkYVZHZDJWMGRwWkd0blNIbEVSek50U0d4NVgzYxAB",
            "text": "Ordered in so I don't know about the atmosphere, but food was delicious (as usual) and also as usual the portions were huge.  Delivered quicker than expected."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twdGFXeDNNWE5UVG5sRldtRklUMmRqWkZKSVMxRRAB",
            "text": "I saw God when I had their pastrami sandwich"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VMk1WRndZbGRPUldwblIwcHhUVXBaZVhWd2NuYxAB",
            "text": "Best classic deli. Star-biz headshots on the walls; chicken soup and blintzes; pastrami and corned beef."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tscmR6bFRSVFpKWkVaVE1qQmhVRnBzUW1kV01FRRAB",
            "text": "Tried the pastrami and corned beef combo. It wasn't bad, although nothing too memorable either. Overall, it's a decent neighborhood spot."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxdlNVTTJPWHBmTFRoR2RsRXpaMnRFUnpFeGRIYxAB",
            "text": "Happened on this as I walked past.\nAnd I'm glad I did.   I had the open brisket with gravy and fries to go.\n\nThere was enough to feed 2.   And the beef was fall apart tender.  The fries are well done.\n\nLemonade was nice and sweet."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aelFteFdWMWxoZDJOVmQxTmtVRzB5T0d0VE1HYxAB",
            "text": "As an alternative to Katz this is a great deli/diner with lots of old skool feel and plenty of heart.....the burger and Pastrami Rubén were huge and tasty...decor felt a little tired and service was eficiant but lacking energy."
        },
        {
            "date": "1달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201VFRsSjZhRVJKV0ZGV04wZ3lZM0Z3YWt4bmRFRRAB",
            "text": "Pochi turisti, zero Instagram ma tanto tanto gusto..."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4cWNHaFhaR2xJTW1rd2NUUlFhR2xOU1ZWdGNrRRAB",
            "text": "Super delicious sandwich."
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWmFHMHdUVFZLTUZkd1pYWmtkMTg0TlhObFgwRRAB",
            "text": "Nulla di che,prezzi troppo alti e locale un po' sporco...pastrami passabile"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4NE16WkVZVTR0VWxwYU5WOXNPVE5YYjNwcVJsRRAB",
            "text": "The food was excellent, especially the pastrami, but the service added an unfair charge for a large group even though our party was smaller than the minimum stated in the menu."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2podGVsZ3pWRmcyT0dkTGVuaENiazlqY0RCTlIxRRAB",
            "text": "After being multiple times at Katz's, I wanted to try the so called 'best kept secret in NYC'. Opposed to Katz's, you'll be seated and order with the waitress like in a diner. What I find kinda weird in Katz is to have to watch the butcher prepare your meal, have a small talk and tip him. So I was kinda happy to have a completely different experience at Sarge's. Here, you order at your table and wait for your food. Great. However, this only works well if staff is friendly. They tried but 70% of the staff were looking at you as if you weren't welcomed. Given that I've been there at a calm weekday during lunch time, I wondered how they will perform on weekends? Space is very limited and is only about 10% of Katz's. It's just like the size at the seating area next to the restrooms at Katz's. That's how small Sarge's is. Now we talk the food... mediocre. I had the pastrami sandwich like all the so called influencer said would be better than Katz's. I know, everyone's taste is different. But I found the pastrami in Sarge's at this day and time inferior compared to Katz's. And I get it, it can be the meat they had this day or whatever. But at the time testing Sarge's, I didn't like the pastrami. And I would say the pastrami at this day has been worse than the worsest pastrami I had ever had at Katz's. For this... no thank you Barr and all the other NYC tourist influencer. In my opinion you are wrong. Sarge's isn't better than Katz. When Katz has a bad day it's on par with Sarge's. But most often times, Katz's is better. Combined with the not so nice staff experience at Sarge's, I cannot recommend Sarge's over Katz. If you don't want to go to Katz, Sarge is an okayish mediocre alternative. Food is good. But most likely not the best pastrami experience you can get"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTFgwbFRYek5GY1ZndFMxcFNRVVZhV0ZONFRIYxAB",
            "text": "Authentic New York deli without the tourist hype\n\nWe originally planned to visit Katz’s, but locals suggested Sarge’s instead—and it was a great choice. The food quality was excellent, with generous portions and authentic flavors, but without the overwhelming tourist vibe and social media frenzy of Katz. The atmosphere was more peaceful and relaxed, making it a enjoyable deli experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toUGQwRnZNRTUzYmtob00zaHNaVVoyVFdNNE1FRRAB",
            "text": "Overhyped and very ordinary.\n\nMaybe we just visited on a day where the waitress was angry, and meat was being rationed, but our sandwiches had about half of the meat you see posted by all of the social media influencers, and what meat was there was dry and lacked much flavour.\n\nQuite possibly if I'd been carrying a GoPro pointed at my face and been asking people to \"Like and Subscribe\" I might have got a decent sandwich and less aggressive service from a waitress that seemed like she hated both me and her life.\n\nLooking at the photos in the other reviews, and the glowing 5 star ratings, I feel like I've been straight-up scammed. Wasn't expecting this from Sarges. Super disappointing for something I've looked forward to for so long."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwbFQzSklVRkZXWldaSlVqSmZNRkpzVlVKU01YYxAB",
            "text": "Quite of a mediocre experience all together. The pastrami sandwich is waaaayyy overhyped. It's not worth it, especially considering the price, you aren't getting anything... service was straight up hostile. The atmosphere was congested and stuffy with a lot of hysteria from the staff."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsbVozRklRV05vT1cxMlZGQm9NWFJMY1cxVlRYYxAB",
            "text": "I’ve never had a cold cut sandwich quite like this before. The amount of corned beef and pastrami was a bit overwhelming for us, even for someone like me who usually enjoys meat heavy dishes. But for a cold cut, it wasn’t really my preference. If you’re into cold cut sandwiches piled high like this, you definitely won’t be disappointed as this place does deliver in both quality and quantity.\n\nMy wife and I split one sandwich easily, and it was more than enough to fill us up. The flavor made it so much easier to enjoy and was the sole reason that helped me finish that generous portion of beef. All in all, it’s a solid deal if you’re planning to share."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kT1MyNXRjamwzTlVNemJsbGZaVFUxV0c4eWEwRRAB",
            "text": "Always on time and the food is always excellent."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbzkyVWRREAE",
            "text": "직원이 친절하고 분위기는 너무 좋았여요\n맛조볼 맛있고 샌드위치는 맛있긴한데 한국인에게는 조금 과합니다. 한번 먹어보긴엔 좋아요"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMTRfVEhBEAE",
            "text": "파스트라미 샌드위치를 먹으러왔는데 한국인에게는 많이 짭니다. Matzo ball soup는 소고기무국 같은 맛이 나서 해장하기에 좋네요.\n처음 오신거면 샌드위치 반+수프 옵션을 골라서 주문하시면 좋을 거 같아요."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvamItM0RBEAE",
            "text": "Slow cooked brisket thinly sliced with fried onion & beef stake tomatoe라는 메뉴는 엄청난 고기의 양이 샌드위치 안에 들어있음-"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JNU1URnlTSFEzTURScFlUTTJUR1JZWVc0dGJuYxAB",
            "text": "This was my preferred restaurant experience during our 8-day trip to New York with my family this summer. We loved everything about this Deli, it was everything I was expecting. I had the pastrami sandwich (go for a half one with soup, that will be more than enough already) and it was incredible. The staff was very helpful and kind."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGa1NGRnVZbGxtUW0xcGR5MXNOa1pHVldnNE1VRRAB",
            "text": "Amazing pastrami, friendly service, and great vibes. Meat was tender, light, easy to eat. Didn’t need cheese or sauerkraut, but great with a touch of mustard or coleslaw. Fries were a bit heavy in the oil. Apple strudel to go was good but cold and might be better heated. Very busy place but got quickly seated for party of 2 on Sunday around noon.\n\nAmong the better diners I’ve been to. Definitely will be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkMU5rVkxSa05XYlhkRVNXdE1SMEl0T0dGalkxRRAB",
            "text": "The food here was terrific. I was visiting New York over 4th of July holiday and we had dinner here and it was fantastic. You couldn't get more authentic deli than this one! I definitely eat here again! I had the soup and sandwich The soup was vegetable and the sandwich was ham and Swiss on rye. They also gave me a dish of pickles with coleslaw fantastic I would definitely eat here again."
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGaFZuSXpSRXBUUmxBeFFrZFZObHBvVG1STVZYYxAB",
            "text": "Bel locale rimasto ancora con io fascino dei diner di una volta. Posto silenzioso e frequentato più da locali che da turisti. Ottimo pastrami. Da provare assolutamente se a NY. Molto buoni anche i dolci."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VLTF9yczdjeXZqZUlBEAE",
            "text": "I came to Sarge’s looking for a more local alternative to the overly hyped Katz’s (which I’m not a fan of), hoping for something a bit more low-key and authentic. The atmosphere definitely delivered—classic New York deli vibes, loud and full of energy, with tons of character and history lining the walls. That part felt genuine and fun.\n\nThe food, though, was a letdown. The pastrami itself was great—tender, flavorful, what you’d hope for—but everything else felt phoned in. Bland sides, forgettable sandwiches, and overall pretty generic for the price.\n\nService was unfortunately the worst part. Rushed, inattentive, and just flat-out unfriendly. Plates were practically tossed onto the table, requests for drink refills or minor changes were ignored, and a couple side items we ordered never even showed up.\n\nMaybe it was just a bad day at the store but not somewhere I’d go out of my way to revisit. Good spot, great pastrami—but not much else."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0UlRtNDVjRXQwUVhKMVlrOUdlWE5uVUVsS1puYxAB",
            "text": "Pastrami was super tender and not dry at all. Huge portion. It was perfection!\n\nInside has ample seating and provides the diner vibes. It has a little bar as well. service can be a tad slow but understandable.\n\nWe will be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rNVIzSlVSbUZGTVdwSlpuaEpRamhDWDNobk5XYxAB",
            "text": "This place is amazing! Been coming here for 20 years, ever since I got a tip about it from a guy in a dive bar nearby. Portions are huge. Meat practically melts in your mouth. Perfectly spiced corned beef and the pastrami is killer. Classic diner atmosphere. If you’re looking for a fine dining experience, this isn’t it. And it doesn’t try to be. It’s amazing food, made right, in a cramped space. And it’s worth your time and money to eat here."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNQzQ2WlBoaGZLdFlnEAE",
            "text": "I visited this place as you “must do” pastrami when in NYC. I was not impressed by the experience. The waitresses had the “oh no another day here to survive” look on their face and were serving in a robotic fashion. The pastrami is a significant portion. I would say it tasted fairly good but nothing mind blowing. I like meat but the whole concept of 95% meat 5% bread is somehow strange and half way through the sandwitch I started to feel I dont want to eat meat for 2 days. The pickles were not bad but we have better at home. Overall if you do not feel you really desire a huge portion of pure meat of nice but not outstanding taste I would say dont feel FOMO if you dont eat pastrami in NYC or at least not here."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnNVVtaDZaVVJ5T0ZCVVpGTm5PVlZXZFdzelZrRRAB",
            "text": "Visited this evening after mulling over whether I should go to Katz. Touring the area from down South and while I've heard many other tourists suggesting Katz, a local working in Saks on Fifth convinced me that this was the place to go. A brisk, 35-minute walk, and I was seated. We ordered the Pastrami and Corned Beef sandwich, a brisket sandwich, fries, and two fountain drinks (coke and lemonade). Vee took our order and made recommendations... she did not disappoint! My pastrami and corned beef sandwich was flavorful, tender, and nearly perfect. The accompaniment of pickles and slaw were equally nice. The fries were hot and greaseless; and absolute delight. Unknowingly, the star of the show, however, was the brisket sandwich with a side of gravy: EXCEPTIONAL! Tender. Moist. Seasoned to perfection and the gravy was the perfect enhancement; you can't act for a better pairing!\n\nVee was kind enough to bring me a sampling of sliced brisket and gravy (my spouse consumed hers before I got a chance to try hers). Vee did so unsolicited; such outstanding customer service! I NOW have a new favorite without a doubt: the brisket. I also now have a new favorite deli in Sarge's. If ever you're in the area, I urge you to visit this traditional, cozy eatery with quality meats and authentic customer service. You will not be disappointed!\n\nThank you, Vee, for the wonderful experience and for introducing us to the wonderment that is brisket and gravy and Sarge's!\n\nHaven't eaten the oreo cheesecake yet, but I plan to soon and will update this review afterward."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sb1MwaFRTR2w2TkMxdVRqbHJhV0Z3YmxKNVExRRAB",
            "text": "Honestly, the entire experience was great. I had the pastrami and corned beef sandwich and a slice of cheesecake to go. The sandwich was bountiful and filling, but I guess I expected more spice from the sliced pastrami? It was tender but lacked that punch of flavor I was hoping for. The cheesecake was amazing though."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdklydnNRRRAB",
            "text": "Went here for the first time a few weeks back. Just forgot to write a review. The best jewish deli ever. Been to katz, 4th street here in philly. The pastrami was so tasty and cut thinner which i loved.  Matzo ball soup was out control. My wife also got a 3 meat platter.  Good pickles that arrive on the table. Higly highly recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oVmRDMUhUUzFhVG0xQlNsUXpTRU5qTm5aeWFYYxAB",
            "text": "Sandwich is very good but nothing as special as all the YouTube creators recommend when they talk about NYC BEST PLACES TO GO.\nAnd the service is AWFUL, waiters are very unfriendly, they vary between ignoring you and being rude, they keep talking my to each other like they’re not working.\nThe place itself is ugly and people who were there also.\nDefinitely NOT A PLACE TO\nGO IN NYC"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaVpxN3NBRRAB",
            "text": "It was so nice and I loved it food was great best ever fries. I recommend to come here really good for family's and dates. Overall it is amazing! I loved my waitress she was so kind and friendly.\nFrom FLORENCE age 9 UK"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTlZUVkVWazlLVDNKNmNtSjRhMWxSWldKb2NVRRAB",
            "text": "Get the pastrami and the 3rd avenue. So good. I don't know why somebody said bad service. We had great service and nice staff all around. I didn't need to add mustard to anything it tastes amazing with or without."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5ZlpISnRlV2x5UnpSMFEwUkpjR2xFVkRocVNrRRAB",
            "text": "Been wanting to come here for a while. Finally made it and it didn’t let down. Great diner setting with absolutely perfect sandwiches. Pastrami to die for!! And top notch, attentive service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKajkyY190cmR6R2ZREAE",
            "text": "This is one of the best pastramis in NYC, you will not be disappointed (however it is still #2 behind Katz for me) it is definitely more of a cozy experience than Katz where you have a waiter and it is way less busy. If you are looking to try a NYC pastrami without the pain of a line definitely come here. Authentic stuff much respect"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURndnIzRmZBEAE",
            "text": "I’ve been to New York many times and this is my favorite deli by far. Unbelievable freshness. You must get this pastrami, no matter what. Also, the cheesecake is super legit as well. Forget every other deli. They have nothing on this one. Also, as a bonus, they have awesome skin on snapping type of hotdogs. Those are legit too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiaWNfUlRREAE",
            "text": "Obviously this place is world famous so we were very excited to go. Honestly it was a bit mixed. Beautiful cured and roasted meats, all delicious but the service was very slow. Portions are huge. A sandwich is more than enough for two. Desserts looked amazing but we were stuffed after lunch. Small inside so not easy to get in and out from the tables. Definitely worth the experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21adVVGOHpYMUJMUjE5WWRXWm1NWGRUVGs1NVEyYxAB",
            "text": "A very generous portion of fries (they were probably spectacular at the deli but they were cooked by the time we got back to the hotel. I will eat them at the deli next time.\nThe star of our meal was the Reuben (corned beef). The was huge and the meat was fabulous. Worth every penny!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCS2F6aFZkblV4YkMxTlJFTkpNa3BYUTFaTlRtYxAB",
            "text": "What a terrible disappointment! 80$ later and I’m going to have to get lunch somewhere else. My husband had the Pastrami sandwich on a very white kinda rye bread and found it dry and without flavor. I had the supposedly cheese Blintze and side  potato pancake. The potato pancake was not anything like a homemade potato pancake from a Real NY Jewish Deli. It wasn’t grated potatoes but blended up like baby food and fried deep like hockey puck. The Blintze was filled with cinnamon flavored fake whipped cream with a hint of cream cheese? I’m a NY Jew who even worked at several REAL Jewish Delis in NYC back in the 70’s and they would have NEVER tried to pass off this food as anything close to anything authentic Deli Food. Beware of this place. Save your money and go to Katz’s !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOejNqN2FwMk9PUXBnRRAB",
            "text": "I was so eager to try the pastrami sandwich from one of the recommended delis. Fortunately sarges is well located, the interior decor has an old fashioned charm. The portions were huge, I couldn't finish my soup as I knew my sandwich was on its way. The beef was so tender and went really well with the pickle. The soup was very clean tasting and I imagined great on a cold day but the star was the pastrami."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNak05LXF0NHBPbkdBEAE",
            "text": "I found out about this place from a NYC YouTuber I follow Jon Barr @Here.Be.Barr. It definitely doesn't disappoint. It was so good and I could only eat half of The Hudson \"Born December 12th, 2018\". It's a corned beef and pastrami Reuben sandwich."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaXRlcHhBRRAB",
            "text": "Food is great and has a good price, but thats it. Regular deli experience, full, not so clean and mediocre service. We had to wait In line for 30min to be sat."
        },
        {
            "date": "5달 전",
            "language": "it",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJTGtxSlBncXJ5c1RREAE",
            "text": "Il locale è super vintage, ricorda i vecchi film , ambiente caldo e accogliente.\nAbbiamo provato il pastrami, buono ma ci aspettavamo molto di più.( i social gonfiano troppo, si sa).\nServizio buono, un po sbrigativo, un po come tutta new york. Un pastrami + patatine e due cocacole 48$. Ma siamo a New York, ci sta. Nel complesso buono!🫶"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnOVBQSmdRRRAB",
            "text": "Just a great old school Jewish deli in Midtown serving delicious food. They put out a solid pastrami on rye. It is thinly sliced and I prefer a bit thicker cut. But they do pack it high and it’s juicy and full of flavor so not complaining too much. They also do a great Matzah ball soup, which was perfect for a cold day."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmaDZqYXh3RRAB",
            "text": "I’ve been to here several times over the years, and it never disappoints. If you’re looking for that classic New York deli vibe, this is the place to go. The portions are very large and food is consistently amazing. Sarge’s is a must-visit spot for an authentic NYC deli experience."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzLWZPWk9BEAE",
            "text": "My father and I visited this delicatessen for lunch on a Saturday, and it did not disappoint! As expected, we started with pickles and coleslaw, a classic touch. For the main course, I ordered the open-faced roast beef with fries, while my dad chose Sarge’s favorite pastrami with potato pancakes and applesauce.\n\nThe roast beef was cooked to perfection, tender and flavorful, and the sliced rye bread underneath added a delightful touch with its caraway seeds, which elevated the whole dish. My dad couldn’t stop raving about the potato pancakes, calling them the best he’s ever had.\n\nIf you’re on the east side and looking for a quick, delicious bite, I highly recommend giving this spot a try!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kdFpVWXRlVGx5TVZKQlRFeHljbXRKWms5aVltYxAB",
            "text": "Delicious Hudson sandwich that came with pastrami and corned beef with sauerkraut, Swiss cheese on rye.\nWe asked for extra Russian sauce.\nWe asked for one sandwich and split it between us, and that was more than enough!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSU2NGTjFWV3hWTTFoRU5GWTFSMVp2UzBkWFIzYxAB",
            "text": "Old school charm deli. Pastrami, matzo ball soup, patty melt, fries, borscht, and pickles were all very delicious"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VORC00cVhGN1pfeEZnEAE",
            "text": "It was my first in life pastrami experience, and boy o boy, it was crazy good! This place is legendary, we had to choose between Sarge and Katz, but we choosed Sarge. Ha! Worth it! This food was outstanding!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBc2R2MUN3EAE",
            "text": "Sarge's is one of those places that popped up during your research for NYC.\n\nI went for the pastrami sandwich..it was okay, but it probably didn't live up to the hype..\n\nI was straight and seated without issue.\nService was timely. The beer is upsettingly warm.\n\nIf you're looking for the best pastrami sandwich,.keep looking, this isn't it..\n\nIf you want to try a pastrami sandwich in a hearty NYC setting, then try this place. Just don't think it's going to be the best.."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bmFtVVBnEAE",
            "text": "The Half Sandwich and Soup combo was a great way for someone who was just trying this restaurant for the first time. There was definitely a 70s vibe inside especially with the soft rock playing in the background.\n\nThe pastrami was thinly cut and the bottle of mustard was available on the table. The matzo ball soup was more like broth but was tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3c1ByQ1NREAE",
            "text": "Their food was really good. The pastrami sandwich was definitely one of the better ones I've tried. The matzo ball soup was also really good. Unfortunately, the cheesecake was not to my liking. Very dry. I would recommend the other dishes, though."
        }
    ],
    "reviews_count": 86
}