{
    "name": "Hill and Bay",
    "place_id": "ChIJfW8ATQ9ZwokRgiHnfUc2PxA",
    "grid": "MN6",
    "address": "581 2nd Ave, New York, NY 10016, USA",
    "rating": 4.3,
    "user_ratings_total": 695,
    "phone_number": "(212) 245-5554",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdk1sbHhXblp3VmxJMWFXTk9MVXN0WkRjeGEzYxAB",
            "text": "No BBQ sauce after Asian-Style sticky wings.  Ate me 12."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WcllUZHFRWGRGTFZRMVdrUm1aamhCYjNsaE4wRRAB",
            "text": "Great service and amazing food."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKSGRUQnBZemN4VUV4MFRsQkhja1JIVTBSVmQxRRAB",
            "text": "Ate here two nights in a row because the wings and burgers were worth the trip back. Great food and very friendly staff."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ab05rczNhWFpyVFZFMWJFZG1Ta0ZYWkhaNGJIYxAB",
            "text": "This place was worth hoping for! The workers were exceptionally welcoming, and were eager to respond to every question. The taste combinations here are unique. It sits in a good place with a welcoming team. We'll make this place a regular stop."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWQlYycElNbWgwYTBOVFREZ3lSMHRZTVRrNVMwRRAB",
            "text": "Has become my go-to brunch spot in Kips Bay. Good food and smoothies, and not that busy."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCZk9UaEZhMjE0YVZaS1kwMDNaSGQ1TFVsS1dHYxAB",
            "text": "This place represents the apex of the dining experience. The dish showed understanding of complementary flavors. Their team combined warm approaches with kind service. This establishment gives visitors what they want. This place offers complete joy."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SQ1lsWm5hVFZPYzNoa2NWa3hibDgzZWxKMWIxRRAB",
            "text": "Love this NYC restaurant every time I head into the city for NYU Epilepsy doctor appointments. Cool atmosphere.  The comfort food feeling takes some anxiety out of a doctor visit."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGeFJqQldYMnhDU3pKR1NURXpZMmd5VlRKQ2MwRRAB",
            "text": "8/13/25 AC broken. Too humid and warm to eat. Normally pretty good place."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKMzdpNmt3RRAB",
            "text": "Great local spot! Service is always fast and super friendly, and the food is delicious and always fresh. We love to come here before/after a movie at AMC Kips Bay since it's right across the street! We'll sometimes pull a double header and go to the movies in the AM, hit Hill and Bay for lunch, and go back to AMC for a late afternoon movie. The buffalo chicken salad is incredible and so are the tacos!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KNFdYVmlaMnhxV1hGNVpGZFZaVVJHYmt0cVNWRRAB",
            "text": "Hill and Bay has such attentive staff, great food, and amazing coffee.  Highly recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CV2RFcGpUMDgxTVVSUmFFSnZVbUZ2YzBJdE5sRRAB",
            "text": "Great Staff!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KYVNVNTRZMmRmYmxaM01tOXpla1pXVDFsTGIzYxAB",
            "text": "Burger is ehhh\n\nBut the happy hour is really good. Drinks are cheap and pretty good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTWRESTJXRlZWVURJMk9YTklXVmszZG5SWVdWRRAB",
            "text": "The staff here is incredible! And the happy hour specials are crazy good, especially for this neighborhood."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMZm9ycXpGcFotbXB3RRAB",
            "text": "One of my go to spots In the neighborhood.  Perfect spot to hit for lunch before a movie.  Absolutely love their wraps the chipotle chicken wrap might be my favorite in the city. The French onion soup is also quite good as is the Mac and cheese.  So far there hasn’t been anything I wouldn’t recommend.  I do wish they had a slightly better beer list but the ones they do have give you plenty of options.   As I mentioned it’s a great place to go before a movie and every week they have a new movie themed cocktail."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VMeWkwZlBYMmFtUm1BRRAB",
            "text": "They need Gordon Ramsay for some Kitchen Nightmares remodeling in here. Service is SO slow (they don't check on you or refill drinks), food is simply not good (we got chicken and mahi mahi - under-seasoned, overcooked), there are flies everywhere. The mahi mahi was so bad we ordered a burger instead and it took so long we ended up leaving. One redeeming factor is the manager is really nice."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPM1gtWWVLOGVqbElBEAE",
            "text": "Here is the happy hour menu, thank me later."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VQSEFnYkhpcGFxWTFBRRAB",
            "text": "Food was fine. Decent selection to satisfy my picky son. Bacon was good but had a more smokey flavor than I was expecting. Toast and biscuits were hard."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNcUJ0Y092a2V2TGtRRRAB",
            "text": "So looking forward to my meal. Chicken mash and kale. I had it months ago and it was phenomenal. Like a homemade meal. Rather quick and great flavor. Whiskey mules too.\nToday I went looking forward to it; empty house and it took me 30mins to get my meal which came out dry. Looks like the chucked an extra piece of chicken on it because I’m certain they forgot about it and the waiter had to expedite it. For $60 not at all worth it. That’s not including tip bc tip comes for good service and good food. I had no guilt not including that for this meal. Hesitant to go back which is unfortunate. I’ll just have to make my own gravy. Everything else it typical, hard to mess up but alas.\n\nUpdate: as you can see they responded… I never complained about drink prices. I asked if a whiskey mule was on the drink special and then we discussed the good price for Wednesday specials.\nSo their passive aggressive response is crazy.\nI had a watch on my wrist and it took 32 minutes for a plate of chicken and mashed potatoes? Make it make sense. “Made fresh” and came out dry. Again, make it make sense.\nLast time I visited my meal came out much quicker.\nI will no longer suggest this place as I have in the past. Nor will be going back.\n\nThought it was a good find. I was wrong."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcUlUNXZBRRAB",
            "text": "Absolutely fantastic! Went for lunch (excellent for quality and value) and stayed for a couple more beers :)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MHFUdUR3EAE",
            "text": "Absolutely the best burger in town.. great service and good vibe. Nothing more to say. Just love love it. Will definitely visit again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dWJfalFREAE",
            "text": "Friendly and bright. Clean too."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3c3AyYld3EAE",
            "text": "Small place in Kips Bay neighborhood. Occasionally stop for lunch at the bar on the weekend. Love the Loaded Tots"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdjZYMDRnRRAB",
            "text": "I never saw my son so happy because he finally found a place  where they made a well-done stake to perfection. The service was very good. I want to thank Jhon, the bartender, for being  excellent cordial and for making that delicious drink blazing apples. I'll gladly be there soon"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRblB5TXRRRRAB",
            "text": "I’ve visited twice after going to the movies and the food is great, the bartender was friendly and attentive. Great place to grab a beer or cocktail and there is a wide variety of things on the menu. I need to try their brunch next."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURndG9UbE5BEAE",
            "text": "How is it $6 for 1/2 an avocado😭😭😭😭 is this common sense…"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwaHZQY29RRRAB",
            "text": "As always, phenomenal food and perfect service. The food was hot, tasty, and quick. The cocktails were made to perfection. I'm never disappointed when I leave. Of course, I will be back again!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBam9TbEtREAE",
            "text": "Guacamole was watery 2 times. Mahi Mahi tacos were near tasteless.\nI would not return."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbXJEZnFBRRAB",
            "text": "Wow. I took my gf (girlfriend) to this spot on an impulse, and we liked it so much, we returned the night after! The atmosphere is cozy, the drinks are cheap and the sweet potato fries are Delicious (and yes, that’s a capital D!) Like Dorothy said, “Toto, I don’t think we’re in Kansas anymore!” -The Wizard of Oz, 1939"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfd09yb2JREAE",
            "text": "The pork sausage and eggs over easy were simple and delicious, but the pancakes were some of the best I’ve had in a long while."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmM3BMV2hRRRAB",
            "text": "We had a great time and hill and bay! Service was friendly and swift. Restaurant was clean and so nicely decorated for the holidays! Lots of great deals/happy hour - I highly recommend the hangover helper breakfast sandwhich!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmN0xxNXh3RRAB",
            "text": "The best in town!!! Anytime I want to take family and friends and coworkers to eat somewhere that not only the service is AMAZING but also the food is SPECTACULAR I take them to Hill & Bay!!! Truly, one of my favorite spots in the city!!! ❤️❤️❤️❤️❤️"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2Z2RLdnpRRRAB",
            "text": "The food is decent but the bartender is very cruel and evil. He should be fired and replaced with someone else. His lack of knowledge regarding how to handle or accommodate people with disabilities is extremely disappointing."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MnFhOU13EAE",
            "text": "Really nice neighborhood place. Good service, good food, and a great location!\nTried the Asian wings (they make them kind of well done, which I like), and had an apple cider/whiskey (which I really recommend if it's chilly outside).\nGreat spot! Check 'em out!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MklyR3V3RRAB",
            "text": "The tots, oh the tots. Bestill my beating tots. The “hangover helper” egg brioche was sensational too, but honestly the tots won (and then replaced) my heart."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQd2J2akF3EAE",
            "text": "This place has a very laid back atmosphere in the middle of a bustling city and friendly staff.\n\nI ordered the grilled house burger that was juicy and flavorful, paired with crispy sweet potato fries. I love sweet potato fries and I loved the crispy outside but soft inside and they weren't burnt. Just enough crunch.\n\nWe capped off our meal with a dulce de leche warm brownie it's topped with ice cream—an absolute must-try! The service was attentive, and the prices were reasonable for the generous portions."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQdXYzaWZREAE",
            "text": "Terrific local bar and restaurant. Their bacon cheeseburger is amazing. The bartender, John, knows the names of all the patrons. Real easy fit for a drink or dinner before seeing a movie at AMC Kips Bay theater.  The only downside is that cook has not changed the menu in years."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNU1lTnRnRRAB",
            "text": "Where do i start,  first and foremost i work in this area so my co workers and i are always at the spots for lunch. This place we’ve came a handful of times and always leave disappointed. Hospitality is horrible, staff don’t greet u upon arriving, never smiling, and act as if you’re disturbing them. Such a unwelcoming staff as a whole. Act as if they don’t want you asking questions about the menu, the lady staff is the worst of them all. Some items on the menu is okay taste wise, some can use more seasoning. Wings is bomb. Wont be returning to this restaurant due to staff on duty."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdTZhc3FnRRAB",
            "text": "Did not feel welcomed and treated fairly as other people were"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMmZXN2p3RRAB",
            "text": "I love Hill and Bay. Good food. Nice local restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYaV9mMVdBEAE",
            "text": "Great service, good food and coffee."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYby1EaWRREAE",
            "text": "Great place to grab dinner and a drink. Good food, good portions, and cheap drinks. Rotating nightly special menu.\n\nThe place is a little small but they have some additional seating in the back. Service is quick and friendly.\n\nGrill burger was delicious, nice big solid burger. Side of fries was excellently crisp though a little unseasoned. Salmon salad had a nice piece of salmon which tasted good but the rest of the salad was a little plain.\n\nDrink prices are great though. Happy Hour beer and cocktails are about $4-$6 and drink specials are $5-$7. Other cocktails are a little more but most of what you would want is available pretty cheap."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaE9uM2dBRRAB",
            "text": "Delicious burgers, soup. Very pleasant environment, lots of light. Very nice people."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYMXI3NVdnEAE",
            "text": "Overpriced and flavorless. Dingy spot lights keep flickering."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcDkza19RRRAB",
            "text": "Two weeks ago, my co-worker took my client, who is also my friend to Hill and Bay, and one of the waitresses was rude to him. I think it's inappropriate ."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbUtPS3hnRRAB",
            "text": "Food is okay but the bartender has an attitude.\n\nI go theres on the weekends with a client and he was publicly yelled at by bartender.  I don’t recommend as it is not friendly and adaptable to those with impairments or elderly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMkx2THdnRRAB",
            "text": "The bartender was screaming and yelling at this elderly man because he asked a question about the restaurant.  I do not recommend this place simply because of the bartender and his attitude towards people."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuLVpyb1VREAE",
            "text": "Ordered a burger medium and after taking a bite, I realized it was RAW! They didn’t even refund my whole order, just the burger. Will never be going back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIc29fUG5BRRAB",
            "text": "Upstairs bathroom did not flush well"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cUpPMWVBEAE",
            "text": "The food is fantastic and service is great!! My wife and I both highly recommend it and can’t wait to go back!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiZ2FXNGZBEAE",
            "text": "Tuna melt looked and tasted like cat food."
        },
        {
            "date": "수정일: 7년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnbUpTdzRRRRAB",
            "text": "브런치는 저렴하고 맛있음. 음료는 물 탄줄 알았음...물 드세요"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6aXFMVDlRRRAB",
            "text": "Visited this restaurant several weeks ago with some friends and I cannot stop thinking about the amazing salad I ordered. The other dishes looked and smelled delicious too! Cool vibe, felt very comfortable as soon as we walked in. Looking forward to my next time dining here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsenFYeTdRRRAB",
            "text": "We had a good time at Hill and Bay during a recent holiday gathering in the back room.  The staff service was excellent.  We ordered the eggplant Parmesan and the burger.  The burger was one of the best I’ve had.  It was cooked perfectly, great meat with a Smokey flavor and excellent sauce.  The eggplant Parmesan was not good - it was dry, hard and almost like eating veal. Besides the eggplant everything was well setup, organized and perfect."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURELWRQa0RnEAE",
            "text": "Cute bar/cafe atmosphere in the city.  Old movie posters on the wall and exposed brick give the space character.  Our server was super friendly and knowledgeable about the menu.  We did not have a wait at all but that may have been because it was Easter Sunday.  I had the eggs Benedict and my only complaint was that the hollandaise was bland.  The cucumber ginger juice blend I had was delicious.  Others in my party enjoyed their food.  The French onion soup was good, the waffles and chicken were also."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyb2R5RklBEAE",
            "text": "I came across this place thanks to google maps. I’m so surprised I didn’t have to tell the waiter how I want my burger cooked! Well done and burnt just how I love it. Gotten also the tacos. I thought it was beef but it was fish. It had wonderful flavors but I don’t eat fish. To wash down, I had the Pineapple Express…."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdGNqZmhnRRAB",
            "text": "Hill and Bay has such an easy going vibe to it. We had the Salmon Burger & Hill and Bay Classic with a side of sweet potato fries! They were delish! The classic was probably the juiciest burger I’ve ever had, I probably should have taken a picture of the aftermath. We will be back again for sure!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5b0lES0dREAE",
            "text": "Looking for a quick and casual wind down after weekday? Great dishes, drinks, and atmosphere without breaking the bank. Prime Kips Bay/Murray Hill location to catch up with your Midtown folks.\n\nThank god for indoor dining, but outdoor dining seems well heated.\n\nDon’t think you’ll beat the drinks prices anywhere, unless you start shaking up cocktails in your flex 2 bedrooms. Burger was well seasoned and cooked to medium rare. Personally would have liked the buns toasted more. My pescatarian friend spoke well of the fish tacos.\n\nTheir house bourbon/whiskey was a brand I did not recognize, and personally a bit higher sugar ratio on the old fashioned - but still a great drink nonetheless.\n\nIncredibly friendly staff, though seemed very busy and multitasking."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqMG9DZ3VRRRAB",
            "text": "Reasonably priced draft beer, great specials, and a relaxed atmosphere will keep us coming back here.\n\nThe wings are saucy, crispy, juicy, and flavorful and only $1 per wing on Wednesday evenings!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbGRUMmx3RRAB",
            "text": "My photo isn’t the most appealing but I can easily say that this wrap was top 5. I’ve been coming here for a while now. Easily the best happy hour deal in the Kips Bay/Murray Hill area and it’s not even close. They have the standard happy hour deal and each day add a new twist to the choice you get. They serve every meal of the day. My friend got the skirt steak salad and a whole steak came with it. Highly recommend here for a good meal or to have more of an intimate happy hour drink vs the other spots in the area"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNleXNPMEZnEAE",
            "text": "Came here just for a quick bite and wanted something relatively fast but filling. The service was really fast but the food came out great!! Would definitely come back. The Mac and cheese was seasoned really well along with the French fries"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtbnZHN3R3RRAB",
            "text": "Quick, fresh, filling Buffalo Chicken sandwich.  A little messy but good!   The shoestring fries were perfect, and I am fairly selective about my sides.   Kind, polite service staff.   Would absolutely return."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMzlLbjZBRRAB",
            "text": "We thought we'd give this place a go since it's quite close to us. Not a huge menu but we enjoyed most everything we had.\n\nThe burgers are huge slabs of meat and surprisingly managed to keep a cylindrical shape after cooking. Very tasty as was the fried chicken starter.\n\nThr ice cream cookie was okay, but literally was one large cookie with 2 scoops of ice cream and some whipped cream.\n\nDefinitely go back for the burgers alone.\n\nSeemed to be full of a lot of tourists for some reason, but the place was reasonably quiet and service was fine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsX3JYSENREAE",
            "text": "Such a cute and cozy place, great for brunch. Perfect level of busy to get a table. Prices and portions are also extremely fair. Would definitely come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkN0pfb09nEAE",
            "text": "Hill and Bay has become an integral part of my morning routine, thanks to its convenient walk-through window for coffee enthusiasts like me. This spot has elevated my coffee experience, and I can't help but appreciate the fantastic service, especially from the energetic and friendly barista, Jose.\n\nThe walk-through window is a major plus for those on the go, providing a quick and efficient way to start the day with a freshly brewed cup of coffee. The convenience of this service is a game-changer for busy mornings, and Hill and Bay have nailed it with their seamless operation.\n\nJose, the barista, deserves a special mention for his exceptional customer service. His positive energy and friendly demeanor make each visit a delightful experience. It's evident that he takes pride in his work, creating a welcoming atmosphere that sets Hill and Bay apart.\n\nWhile I haven't had the chance to dine in yet, the consistently excellent service during my coffee stops has piqued my interest, and I look forward to trying out their menu soon. If the morning service is any indication, I'm confident that the dining experience at Hill and Bay will be nothing short of exceptional.\n\nIn conclusion, Hill and Bay has become more than just a coffee stop for me; it's a place where exceptional service and great energy converge to create a positive start to my day. I highly recommend stopping by for a cup of coffee and, like me, you might find yourself eager to explore their dining options in the near future."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhb3VfREN3EAE",
            "text": "Went for restaurant week, my bf and I both got a burger and shoestring fries and a cookie sundae and brownie sundae. Burger was sooooo good, fries were nice and crispy. Only thing was the sundae had a weird thing on top of the ice cream,…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkME1DSldREAE",
            "text": "The happy hour was great! I got a tasty beer flight and a delicious cocktail for a wonderful price. The food seemed a bit pricy for the quality but I still enjoyed the avocado toast and loaded tater tots. Super nice staff!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwa3J5bHpBRRAB",
            "text": "I love Hill and Bay! It is such convenient, quality food. Their French toast is the best and the Bellinis are really good. Was definitely my hangover and brunch spot for the summer. I also really loved their smoothies and tater tots. 10/10"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3aU1TQzl3RRAB",
            "text": "Great brunch spot; strong coffee and decent options for a hangover cure. There are some old movie posters used decoratively, which seems odd at first, but actually works really well.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5cUl1dWdBRRAB",
            "text": "Nice location and very nice happy hour, however the food was subpar in taste, although it looked good. The taste was bland and slightly disappointing."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJZ1kyUXZRRRAB",
            "text": "A great place to go in Murray Hill. Nice service and good food. We went on a Sunday, so there were some delicious brunch options. Loved the scrambled eggs with spinach and mushrooms. Also enjoyed the Salmon Soy Salad."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkcjd2WnRBRRAB",
            "text": "My experience ordering food from Hill and Bay was incredibly disappointing. Despite ordering pancakes with berries, eggs and turkey sausage, and orange juice, not a single item was correct. Instead of turkey sausage, I received pork sausage, which I'm allergic to. To make matters worse, I was served half a cup of \"peace\" juice instead of the orange juice I requested. Even the pancakes were plain, lacking the promised berries. Overall, I'm extremely disappointed with the accuracy and attention to detail of my order, and I won't be returning to this place again."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRMU9yVDZnRRAB",
            "text": "*Tater Tot Review Included*\nThis place had its plain tater tots perfectly crisped (very delightful), which went well with the HB Bennies. The food didn’t seem to have any particular…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2bXJHOFh3EAE",
            "text": "Pretty decent food and nice staff. The fried chicken came with a ton of chicken. The shoestring fries are good. Staff was friendly."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtbXNQMjRRRRAB",
            "text": "Not the worst place to go for a bite, but not the best. We decided to dine outdoors and I got the loaded tots, which are seen in the photo for this review. My partner got the Buffalo Chicken Sandwich. Note, burgers and sandwiches do not come with fries, so be prepared to spend about $20 for burgers and fries that are fairly run of the mill.\n\nThis is one of those places that are cool to come to if you're already in the Kips Bay / Midtown East area, but I wouldn't travel out of my way for it. Definitely a neighbourhood spot.\n\nStaff is great and respectful, but the food is pretty mundane. With a cocktail, the meal averages 26 - 32 per person before tax and tips."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNldThHcVZ3EAE",
            "text": "I had the scrambler with bmt.  The scramble egg is way too salty for my taste. I think the salt may be came from the turkey sausage. Avoid this dish if you don’t like salty food"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrN3NYTmdnRRAB",
            "text": "Went with a few friends on a Tuesday evening. Ordered buffalo wings, meatballs, signature burger, and the shoestring fries (both sweet potato and classic). It seemed that they forgot the appetizers because after about 25 minutes of being…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxdG9yUmxRRRAB",
            "text": "Great time. Visited this establishment on the 4th of July. Excellent food, was to sit outside under the tent. Our server Lidia, was very attentive and hospitable. Highly recommend if you get the chance. BBQ Turkey Burger, brussel sprouts, cauliflower, sweet potato fries were off the charts."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPNmNEdkhREAE",
            "text": "There was a strong smell of fermented beer, I don’t know exactly but the bar smell was very strong. A big cleaning will be necessary. Food was good. Cocktail wasn’t good."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxbFl1TkJBEAE",
            "text": "Been here a few times, food and drinks are always good! Service is fast and attentive. There’s a back area to sit if the front is full! They also have to-go coffee window! It’s a gem to have this in Murray Hill area!"
        }
    ],
    "reviews_count": 79
}