{
    "name": "Bubo",
    "place_id": "ChIJE5h5cQZZwokR-Gi2BfLvPvg",
    "grid": "MN6",
    "address": "515 3rd Ave, New York, NY 10016, USA",
    "rating": 4.6,
    "user_ratings_total": 321,
    "phone_number": "(212) 532-3300",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSmFuRmxaSGxpYVZKSGEzaGthMWRVWWtWTlJrRRAB",
            "text": "Cozy neighborhood bar with tons of space to gather and socialize. Great place to host  events too!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tob2JXSlZTbEpzZERsQmFGRkxiSEpKZHpGeFZHYxAB",
            "text": "We hosted a joint birthday party at Bubo, and it couldn’t have been better! The private back bar area was perfect. Tons of seating, stylish, comfortable, and a total hit with everyone. Our two bartenders were so fun, attentive, and kept the…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUlNHeFpOMG8yU1hsV1duVkpUM2hoUzA1SkxVRRAB",
            "text": "I like the vibes here! I had a lychee martini and a dirty martini. Both were great. It’s definitely a date night spot. I did not have the food but I will say it looked good!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twaVNuZHRiVzVVVFRSRk1VeEdXR0ZVTlVodk9VRRAB",
            "text": "Another outstanding experience here, I should stop trying to find new places and stay with what works best!\nSpeedy perfect service, relaxed atmosphere, ( nice and cool too), and excellent food-\n\nComplex and refreshing ceviche, silky tuna tartare with avocado ( nice touch with some crunch on the side for texture), and perfectly cooked lamb chops ( and didn’t even realize fries came with). Versatile wines by the glass to pair with and it all adds up to another winning night, thanks Bubo you know I’ll be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toV1FsVnFNVmx5Y25scGFVaEpTVVpMY1hjdGNYYxAB",
            "text": "Where to begin, this place is incredible on many levels sure date night pretty clutch, alone many good drinks and eats cant go wrong, staff is all time, shout out Kiera!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aWGN6aGplak0zWjBScVgyOUNVRFpWYlc1T1NuYxAB",
            "text": "Visited here on my vacation to NY, the atmosphere and music here was 10/10, drinks were tasty and strong. Would definitely come back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTVVXaFpkWEZKY2xCRWJWaEdNRTFIU0hWMGVXYxAB",
            "text": "I was really disappointed with my experience at this restaurant. The service was lacking, and the bartender was quite unpersonable. The server was great, and it helped at the end, but it didn't make up for the overall experience. The cocktails were good, but unfortunately, the food was a different story. I ordered the risotto, and to my dismay, the rice was crunchy when I got it. I recently moved into the area and was looking for a neighborhood bar, but this will not be one of them. I expected much better, and I won’t be returning."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMQ0N3OXJwNXVpQWlBRRAB",
            "text": "Visiting NYC and ended up walking into Bubo, immediately felt welcome and the cocktails were incredible. Great vibes, great drinks but the bartender Izzy was the highlight of our visit. 10/10 will be back whenever I visit NYC."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKUFhwY2lwMlpPOVFREAE",
            "text": "Stopped by here a couple weeks ago for a quick drink and kaylene was my bartender. She suggested I have a whiskey business it was absolutely delicious. Vibes and service was amazing i would definitely recommend to anybody whov"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxenBlX3d3RRAB",
            "text": "Tonight\nLamb Chops-excellent"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNRzAySTZnN2FMUnJBRRAB",
            "text": "Great cocktails. Good good. Excellent service. And nice ambience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOYW9rb0NjajlXUFBREAE",
            "text": "Great place. Only got small bites and it was early, but we loved the cocktails and the team were really nice. We will definitely be back. Great spot for the Summer! Thank you"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZOHN5UkNnEAE",
            "text": "The vibe, music, drinks and food were a 10/10 love coming to bubo always consistently amazing service and atmosphere."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJd3NtMDhRRRAB",
            "text": "The servers were sweet and attentive. The food was amazing and fast."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3a1BLdVlnEAE",
            "text": "Server belle was amazing - had a great experience"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNFotVEZnEAE",
            "text": "Came with a friend to get drinks, they were so good! The place was super cute and a great place to catch up. Just wish they had a larger happy hour menu, it was very limited."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbHJQanBnRRAB",
            "text": "Online hours say open until 1am. We arrived at 9:55pm and they said it was already last call and we could not order a drink."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnOVpHMjlBRRAB",
            "text": "Didn’t try the food but the drinks were great, great atmosphere and service was good as well - very attentive and friendly. Would come back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMHBDZTB3RRAB",
            "text": "Bubo came to the rescue on Valentine's day after a terrible experience on a so called rooftop (Highwater) that looks more like a disorganized closet with no views and no atmosphere were we had 2 terrible drinks and left when our food never made it to the table.\nBubo instead was great!\nBelle our waitress was sweet, professional and courteous.\nMy gf and I shared a great burger and a mushroom flatbread, both delicious. I was watching the bartender and I saw that she knew how to mix drinks, as she was very meticulous in measuring ingredients, so I ordered a \"J'adore\" that was just delicious.\nThis is a restaurant that I will keep in mind as it turned our night all around."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMWV2c1JBEAE",
            "text": "Excellent food. I ordered the burger and fries and was great! Will order again."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmbGFlYnFRRRAB",
            "text": "Truly an amazing little gem of a spot that might be easy to miss except if you know about it. Space is intimate and welcoming with a fab front bar and a great back bar. Great for date night or seeing friends. Def has a lively and seductive vibe to it. The food was delish. The cocktails and esp the espresso martini was amazing."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNlp2SzlRRRAB",
            "text": "Really enjoyable place, with surprisingly excellent food, good vi es, attentive service, and generous/ creative drinks. For a family of four, cost $250 with tip, which is (sadly) very reasonable for Manhattan!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzLWRDV0x3EAE",
            "text": "Best brunch deal in the city probably. $21 for two alcoholic drinks, coffee, a main and dessert. Plus it's really good with great service and atmosphere. Awesome place!"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNN29lcFpBEAE",
            "text": "Still one of my favorites!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMy1tTWl3RRAB",
            "text": "I stopped at this restaurant randomly while exploring the city. It had good reviews so I decided to give it a shot. Unfortunately, my experience was not entirely positive. It was a small restaurant but they were pretty busy. I only saw one waitress for the entire restaurant, including the outside seating. Another employee came up and spoke to the waitress while she was trying to work. I got the impression it may have been the manager. She continued to work and I could tell she got visibly annoyed as he kept talking and she was trying to work. I ordered the Birria Tacos and they were good, not great. I did appreciate they were served with three sauces. The green sauce was definitely my favorite. The other two were a bit underdeveloped.\n\nThe worst part of the experience was the end. I received the tacos but was not acknowledge after that. I finished and wait for the check. The waitress was busy but the other employee that had stopped her from working was standing around. 15 minutes after finishing my meal I was still waiting for my check. I got out my credit card hoping that would speed up the process. Another 5 minutes + later the employee that was standing around noticed and pulled the waitress aside and made eye contact with me. She came over directly after and took the card. I don’t know if the other employee was 100% manager but if you have an employee just standing around then there is definitely some cross training needed."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzamNudGtnRRAB",
            "text": "Bubo has done it again. This breathtaking speakeasy with a twist of Mediterranean fare is by far the most attractive venue in Midtown East if not in Manhattan.  The vibe, the food and most importantly the service and the people involved in the care and the detail built into the experience is why I come here almost everyday and every night! The best of the best only here. Their most recent addition to the menu is seen in the pics here. Peruvian with a slice of Japanese fare."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbk0zMktBEAE",
            "text": "Juliana and Belle were incredible! Will be back soon. Consistently delicious drinks, prompt service, and a great vibe. My go to spot in midtown"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIaThLMV9nRRAB",
            "text": "The food was incredibly flavorful, with every dish tasting fresh and thoughtfully prepared. The drinks were equally impressive—balanced, creative, and perfectly paired with the meal. The cozy, family-like atmosphere made the experience even more special, with friendly service and a warm, inviting ambiance. Andreas is so kind and welcoming. I wish I took pictures before the food prior to the demolishment :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIaTZibUVnEAE",
            "text": "Bubo excels in both service and culinary creativity. If you're looking for a spot where you can enjoy fantastic food in a welcoming environment, make sure to try their watermelon salad—you won't be disappointed!"
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIOU1IX3B3RRAB",
            "text": "Sehr freundliche Kellnerinnen, das Wasser wurde immer sofort nachgeschenkt, die Cocktail waren sehr gut und auch das Essen, das schokomousse mit harter Schokoladenschale und innen Schokomousse mit Vollmilch- und weiße Schokolade  war eins der besten die ich je gegessen habe"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cnF5YlBBEAE",
            "text": "Only half of the wait staff is friendly. Some will glare at you or answer your questions rudely, or be short with you. I had to flag the bartender down for 10 minutes to even get the drink menu and order even though there was only 1 couple at the bar with drinks.\n\nTheir drink menu is great but not all bartenders even know their signature cocktails so every order will taste different and inconsistent.\n\nThey should train their staff to be a lot friendlier and provide a better service. Otherwise, I love how much room there is (even outdoor seating), and the noise level/ambience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3aXN2MElBEAE",
            "text": "Stylish cocktail bar and restaurant in Murray Hill.\n\nMy partner and I have stopped in a few times for drinks and oysters. Service is friendly, cocktails are exceptional, and the oysters are fresh. The food menu is also large, if you are feeling hungry.\n\nThere is plenty of seating at the bar or tables if you arrive earlier (before 8pm)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiN2JQV2dBRRAB",
            "text": "Great food and drinks. Tends to be a bit loud."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiOWJyWld3EAE",
            "text": "Been in NYC for 3 months now, and I can say that Bubo has the best service, the nicest staff and the most delicious food. Authentic, delicious and an amazing atmosphere. 100% recommended to all!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaWJlQ19RRRAB",
            "text": "I went to Bubo last Tuesday to catch up with a couple of friends I have not seen in some time.  The vibes and the food were both excellent (the halloumi and Pita sandwiches were amazing) and we all agreed it was the perfect place to meet up.  I very much look forward to going back in the near future."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUNTZTOXR3RRAB",
            "text": "Really fun spot in Midtown.\n\nLexi and Mia are so nice and make their own cocktails for us."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUN3V5a25RRRAB",
            "text": "Excellent accueil, très bon cocktail très bonne cuisine. Je recommande à 100 % pour passer une bonne soirée dans un bar sur New York."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREdS1hYjFBRRAB",
            "text": "Awesome cocktail bar with an intimate atmosphere and phenomenal staff. The cocktails we had were delicious and the prices weren't too bad for pours of whiskey which I respect and appreciate. Would come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREdk5qckZREAE",
            "text": "Bubo is a super low key chill place with great drinks & great food! Customer service is on point for sure"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdmZpZ0h3EAE",
            "text": "Quick and efficient service.  Great drinks.  Highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MTY2RjZRRRAB",
            "text": "Really cute cocktail bar but the food is not good."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxd3NyeWVnEAE",
            "text": "Ambiente muy agradable, buena música, no esperamos para entrar. Buena variedad de bedidas"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWci1EQ3JRRRAB",
            "text": "Nice lively spot with a great atmosphere and friendly social setting for drinks and savory bites"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsNDkybi1BRRAB",
            "text": "Highly recommend Bubo for your next dinner option or happy hour! The food is delicious and offers much more variety than your typical bars. The ambiance was warm and cozy and a great spot for a date night or hanging out with some friends. It’s located near a great area with the subway close by which makes commuting that much easier. Would love to come try their brunch next!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNW9uUThnRRAB",
            "text": "Food cold, waitress colder"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1M3F2X3RBRRAB",
            "text": "Nice place where you can have a beer."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaOG9pLXFRRRAB",
            "text": "My husband and I came in on a rainy day and was pleasantly surprised at how excellent this brunch was! John our server provided excellent service and recommendations. I ended up booking their private space for an event! Highly recommend!! Great food, great atmosphere and an absolutely stunning bar."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMzlmWFJnEAE",
            "text": "Bubo, the cocktail bar, delivered an unforgettable evening! Their cocktails were nothing short of amazing – creative, expertly crafted, and bursting with unique flavors. We had a blast, and the lively atmosphere at Bubo made it an all-around fantastic experience. Cheers to a memorable night!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabDlQZXlBRRAB",
            "text": "Great menu, awesome atmosphere, great food (dinner), and they have Athletic Brewing NA Beer on draft"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaeDRYNXh3RRAB",
            "text": "Had dinner there yesterday and we both fell in love with this place. It's beautiful and clean and has a cozy vibe to it, the staff was very friendly and helpful and the food was fantastic. We ordered a bunch tapas and fish tacos and loved everything, but the octopus was definitely the star of the dinner! Can't wait to come back with my coworkers!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NHZ6VEl3EAE",
            "text": "Their brunch was delicious and they have a really nice set for $24 on weekends. It included two drinks, a beverage, main, AND dessert!!! Really great price for the amount and quality of food. The service was also amazing-John was our server…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwZ0lqbGFnEAE",
            "text": "Highly recommend the brunch, great value and experience. The inside and cute and clean - opposite of lots of brunch places which are crowded and grimy. Bathroom is also clean!\n\nService was great as well. Our waitress was very friendly and everything was timed well, not too fast or slow. She was also very nice to our 4 year old.\n\nThe burger and mimosas were delicious. We were so full and remembered we still had dessert coming - so portions were very generous."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dXItXzVBRRAB",
            "text": "Excellent food, classy vibes, good drinks. The halloumi on toast was surprising delicious, as was the grilled octopus and cauliflower. Is was super empty when we were there at 5pm on a Sunday 🤷🏻‍♀️ Nice outdoor seating too (long picnic tables)…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyaUxDaVJBEAE",
            "text": "A wonderful little place that is off the beaten path. .  Or is it???   Can there be an off the beaten path in NYC???  Amazing French onion soup...  like the people who work here are from France???   A great outdoor seating section and the…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyZ09qLXd3RRAB",
            "text": "Everything was amazing- from the service, to the ambiance, to the food to the drinks!\n\nLexie was an amazing hostess. She was attentive, sweet and fast!\n\nThe octopus was so tender. The wagyu burger melted in my mouth (even though I ordered it well done), my partner’s salmon was cooked perfectly.\n\nThe wines (happy hour) were tasty and aromatic.\n\nOur experience exceeded our expectations and we’ll be back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxZ3A3UXpRRRAB",
            "text": "Review for Brunch - comfortable and welcoming environment. They had outdoor seating with some cover - to allow in the sun without it burning on you. They were quite busy but we got in without a long wait (<10m). We got the 'Farmers Market…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtaGJUZkx3EAE",
            "text": "Bubo is my favorite place to eat and have a drink in Murray Hill. It has a great neighborhood crowd but is also worth a cab ride from Times Square for anyone visiting that wants to get out of the crowd.\n\nThe service is great! We always get a dozen oysters and the roasted shishito peppers. We have tried other things on the menu as well. The lamb and veal meatballs are a staple as well.\n\nBubo is very clean and is tasteful adorned and designed."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3Nk9uQ0ZnEAE",
            "text": "If you are looking for a nice dinner spot with great food and drinks - this is the place!! We used to live across the street and been here several times before choosing their private room for our birthday party. And it was perfect!! Thank…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2NHRIcW1RRRAB",
            "text": "Lovely place on 3rs Avenue among a sea of other bars. Service was friendly. Cocktails were great. Food was very good. Enjoyed their happy hour menu especially with the oysters deal"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdkpEWWl3RRAB",
            "text": "Had a spontaneous brunch here the past weekend and was really impressed. Food, drinks and service were amazing and the brunch prefix was a great deal."
        },
        {
            "date": "2년 전",
            "language": "ja",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSeWEyX3FnRRAB",
            "text": "とにかくお店の雰囲気とスタッフの愛想が非常に良かったです。\n今回は大人数で飲み放題のパーティーで行きましたが、是非次回はプライベートで行きたいです。\nトイレが沢山あり非常に綺麗でした。"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKcmNLSU53EAE",
            "text": "Best brunch at the best price…!!\nDelicious omelett and fried chicken waffles + crème brulé for the price of the 2 mimosas you get with these.\n!!!\n24$, coffee included too.\nWorth travelling across town! John gave us excellent service as well.\n5 stars all the way!!!\nJust get there NOW! Lol"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKanBQMVVBEAE",
            "text": "I liked the atmosphere and most of the dishes, I recommend the fried calamari, the oysters, the eggplant and the mushroom flatbread."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwaDVxYkNREAE",
            "text": "Great place for someone looking for good food and drinks in a fancy, affordable and relax venue. Easy to have conversations without yelling at each other which is a plus for me. The doctor is gorgeous very classy."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxdFBPUGNREAE",
            "text": "Soft and pleasant ambiance. Lamb meatballs were nicely tender and juicy. The flatbread may have come hot but cooled very quickly. Beet salad was OK.\n\nHeard the happy hour and brunch menu could be something we should try."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4OTRHWGhBRRAB",
            "text": "We come to a Bubo for John. He is the best waiter in Murray Hill. The brunch menu is out of this world. There is a $24 pre fix menu that comes with TWO mimosas, a meal, a coffee, AND DESSERT. Couldn’t recommend it enough 💓…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJcXNucnlRRRAB",
            "text": "Happy hour from 4p-6:30p includes a few beers and wines. It does not include cocktails. They also have tasty $1 oysters, sweet and not too briny, at the bar during this time frame. Outside the restaurant there is a sign advertising $1…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4aGEyRFJnEAE",
            "text": "The food was amazing and the service was even better. They also have a fix for $24 that includes a main, a beverage, two drinks, and a desert on the weekends."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHLWNqdGF3EAE",
            "text": "Good for brunch, although they don’t offer the lunch menu when they offer brunch.\nThe salmon tartare was simply delicious."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpZ296VW1nRRAB",
            "text": "If you’re looking for a brunch - with both a trendy vibe and a quality meal.. BUBO in Murray Hill is your place. Let’s be honest, most NYC brunches don’t have the best meals. Bubo offers an unbelievable deal..consisting of 2 mimosas PER…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2Z1ltdkVREAE",
            "text": "Fun late night bar for causal drinks with friends. Not super crazy. Gives you that chill vibe if that’s what you’re in the mood for. Love coming here after going out to unwind. Good outdoor seating and friendly staff."
        }
    ],
    "reviews_count": 71
}