{
    "name": "Tipsy Shanghai 蘇杭餐厅",
    "place_id": "ChIJ7UNgV8tZwokRM1hF8E977xA",
    "grid": "MN6",
    "address": "594 3rd Ave, New York, NY 10016, USA",
    "rating": 4.5,
    "user_ratings_total": 893,
    "phone_number": "(212) 466-6488",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaTldrMDNNazQ0TWkxMmQyRkNZWGhKUVVSVVVYYxAB",
            "text": "i’ve been here twice and they’ve delivered both times! super authentic and flavorful!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVVVFVnplakJTZVVWcWVrZExPRzlFZFdGNE0yYxAB",
            "text": "Nasty lady runs this place.  Dined in and was treated to bad attitude.  Did not want to provide plates - asked us to use the tiny dishes that came with small soup bowls.  Took an order for veggie steam buns but twice brought out dumplings.  45 minutes later I was told it would be “10 more minutes.”  Something is wrong w this place."
        },
        {
            "date": "1주 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oaFZVcEtaWGxwVVVSVWRFRlNNVjkzUWxRNFVGRRAB",
            "text": "Una bellissima sorpresa! Appena arrivata al mio hotel avevo una gran fame e dietro l’angolo ho trovato questo posto delizioso.\n\nDopo un lungo viaggio avevo proprio voglia di una zuppa ed ho trovato un posto veramente autentico!\n\nDa tornare e se siete in zona… da andare!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GQ00zcGZVbGhvTmpsSlJXOTVlRjgyVTB0cVdWRRAB",
            "text": "Ordered the shrimp dumplings, bean curd bamboo pork roll, and stir fried green vegetables with bean curd skin. All were amazing and would definitely come back!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RFVFTlJTRlprYW01aVZ6bHRVMVJ5YjJveU5tYxAB",
            "text": "At 10:30pm we wanted to enjoy one last meal before leaving NYC the next day. We Uber-ed Fried Vegetable Dumplings, Hot & Sour Soup, White Rice and Wuxi Pork Ribs. This rounded out our meals during our NYC trip. The ribs were fall off the bone delicious. Hot & Sour soup was the right amount of spice heat flavor. Dumplings were very nice and the char on one side was perfectly filled. What we ordered was too much for just two people. Would definitely revisit."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aaGJYQjBWSFpNYUUxUVUyVmxaR1pvZWpKVVJsRRAB",
            "text": "The staff delivers food made with obvious care while showing obvious care themselves. The staff showed excellent service while maintaining truly nice attitudes. The kitchen delivers consistently while servers remain approachable. The meals feature unique combinations that surprise positively. My comments are now complete."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWVIwcE9Ua3d5V1VOMkxWcHBhbmR4YTBGa2JIYxAB",
            "text": "This restaurant consistently delivers on its promises. I found the experience fulfilling. The quality of meats and vegetables is good with large portions. This exemplifies the correct approach to customers. This place provides perfect pleasure."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4YVgzWlZVV2hMYzBSUmMyUkNjMEpQUzJ4UFpIYxAB",
            "text": "What a pleasant experience I had at this terrific restaurant. The food melted perfectly while I tried to extend the moment. A tidy setting that still feels welcoming. I found the service quality truly outstanding. This place should be your immediate choice!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201bVMzWkpZa0ZYTm5nNWNHSjFaakZLUTNSQlJYYxAB",
            "text": "Soup pork dumpling and shredded pork in garlic sauce were amazing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMldFMWtia1Y0VEc5WVpYcGxSbFF4VDB4TVIwRRAB",
            "text": "great affordable spot for some amazing Chinese food! highly recommend the pan fried xiao long baos, the bottom was crispy and the inside juicy! The pork ribs were really good too!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKZlIwMDNVMEpDVTNsWk0wc3dia3BGVjBSRFprRRAB",
            "text": "Good value overall—clean space, affordable dishes, and tasty. Recommended: tender and flavorful Wuxi ribs, fragrant braised pork (the 2nd picture), and a hidden-menu Jiangnan tossed noodle with great texture."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sT2RYa3pjMHc0Tkdkek5rUjVVblpLVG5wSFpuYxAB",
            "text": "One of the worst dining experiences I have ever had, rude staff, under cooked food, I ordered white wine, served a different bottle than I ordered and given a bowl of ice to keep it chilled.  Please please avoid.  Bizarre that this…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNeWRrdzNhMlZpVWtGTmR6UjFabWx0Tms1UE1FRRAB",
            "text": "Great beef noodle soup and soup dumplings"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxS1pYZFJia0ZQY1ZZd2JtdFFRVkJtYzFoblRsRRAB",
            "text": "If you’re in Midtown and craving real comfort food, I’d definitely recommend Tipsy Shanghai. It’s cozy, flavorful, and feels a little special without being over the top. Perfect spot when you want dishes that are soothing but still memorable.\n\nWhat we ordered:\n•\tSteamed crab & pork soup dumpling (my favorite)\n•\tGolden black phoenix bun (one of my other favorites!)\n•\tBraised beef noodle soup\n•\tFamous lionhead\n•\tFried green beans with minced pork\n•\tMapo tofu"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ST2VqY3RUbkZEYzBOUk1XRlVibkpXYTFKclMzYxAB",
            "text": "the food was so good. we started with the wonton soup, the broth was so delicious. then we ordered xiao long bao, lotus leaf wrapped rice, pork buns, and custard buns. the chicken soup dumplings were my favorite. everything was great and we really enjoyed our visit! we left full and ready to walk around. thank you :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKMmQyUXdla3hWUmpjeWVuSmxSV2d6ZWxWSlpWRRAB",
            "text": "Great Peking spicy noodles!!! So good!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205R09VNHRMVVp0VkhoeWRITm5kMjB6TVRGdE4wRRAB",
            "text": "amazing food right off grand central"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxUllsUjFVRVoyYkRONU5GcDVhVFIyY1dOWmQyYxAB",
            "text": "Amazing food, authentic atmosphere, kind staff. Would reccomend 100%."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNd09XcFVSRTlZVWpBelp6Qk5ObnBrUVdjeVpHYxAB",
            "text": "Got take out twice, one order of kung pao which was insipid, tasted old. second order was general tso's chicken which was also flavorless and half broccoli. ordered the b1g1 general tso's on the uber eats app and received only one order. truly the worst chinese food i've ever had"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tObVpteDFTR3g0VkhvNVRWTm5jMmxNU2xOM1EyYxAB",
            "text": "I liked the food. Even familiar dishes were quite different in what I presume to be Shanghai style. There fish soup was a sleepy hit for me. The tofu skins were too salty on the other hand. The Xiao long bao were dense, but flavorful, so I looked them."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xveloyNHRTa0ZwUjNGUVEyMTNZMVJvVjE5TFpXYxAB",
            "text": "Random find. Very good quality, authentic, and our waitress was very kind."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSVmNrWkNXRXRUT0Y5Vk0weDZTMFp2U1UxMmIzYxAB",
            "text": "Super attentive staff, incredible noodle soups, and flavorful xiaolongbao!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOUU1rMVJZakY0V25OYWJHVjNkRVUzYzNKdmNIYxAB",
            "text": "Amazing food and service. xiaolongbao very flavorful. Tried 3 different noodle soups, also amazing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGM1ZuTmlaMWhtUzAxTGJHb3RWVkY2Y1VrdGQwRRAB",
            "text": "We ordered shrimp dumplings, pork bao buns, orange crispy beef, and wonton soup. Wonton soup was the best, I’m already looking to having it again! Perfect for a cold or rainy day! Next favorite was the bao buns, followed by the shrimp dumplings, and then the crispy orange beef. Food was all delicious and so fresh!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMVNscHhYek5KZFVZMVNsRmZSV2xEVkY4eFgyYxAB",
            "text": "The restaurant is so cute inside! Small and unassuming, but the food was realllly good, and also quite affordable too. Great dim sum options, friendly staff, everything was flavorful, this was such a good meal 😋"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoV1UyTTBPRlo2ZUZab1JEUXhZVkY0VW5KTmNXYxAB",
            "text": "Really good dishes! The set meals are great for saving money and still allow you to try the dishes :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toMlZVTnRMVUpITkVGbk1USmFVM1ZhVVVaa1FXYxAB",
            "text": "I wish this place was a good as it reviewed. I don't mind paying same prices as downtown Chinatown for less portion but the food has to be good. Its just average.."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oWFJHeG9OVGRZT0VwdlJVUlBUWHBwU2paV1gwRRAB",
            "text": "The place is cute, but the food is very disappointing and bland. I won't go back."
        },
        {
            "date": "수정일: 2달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sbVNGSnhZMHBsWDNvNFUzbGtRbXBFVEdKUVYzYxAB",
            "text": "第二次来了。环境很好的餐厅🍴餐品不错👌很地道的中国口味，服务也不错😌"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zdE4yOTZPREJSTFU5WE1FWldZMnhQVFZaUVVYYxAB",
            "text": "The food is outstanding and the service is excellent! The decoration and environment are beautiful. I had such a lovely time visiting the Tipsy Shanghai and am eagerly planning my next visit."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxc1ZGOXFka05FWDI5d05HMW9jVXhOUWpobWMzYxAB",
            "text": "The restaurant has a beautiful Suzhou-Hangzhou style décor, which really gave me high hopes for authentic flavors. I ordered the zhajiang noodles since the menu photo showed thick, chewy noodles that looked just like handmade ones. But when it came, it was nothing like that—just plain noodles, thin and mushy. Super disappointing! It doesn’t make sense to put so much effort into creating an authentic Chinese look while serving food that doesn’t match. At the very least, the dish should look like the picture on the menu. Feels like style over substance, which makes the whole experience frustrating and misleading."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1RFEydzFXSFV4ZVZaclMycFVRM3BDVGxkalkyYxAB",
            "text": "The staff are very rude and unhappy. I wanted to place a to-go order and they treated me really badly,  not just me, I think they treat all their customers that way. So don’t let unhappy and rude waiters ruin your dinner."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3eVJFNURZVEp5Vms1b2MyNWtabkZYUzBSUFlWRRAB",
            "text": "My most recent visit was worth 0 stars.\n\n1PM, prime lunch time, they basically had nothing in the kitchen from their menu. How can a Shanghai restaurant not have soup dumplings. I picked a noodle soup dish and 10 minutes late they come back and tell me they don't have it either.\n\nWaitress was incredibly rude and dismissive. My group should have just got up and left when everything we picked was out of stock.\n\nThe food that we did order was also abysmal. Noodles flavorless. Pan fried dumplings too salty.\n\nThis is my 2nd time here, but also my last time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNlREQndWSFpyYnpCelJWVlJUa1F4Y1dGWVdtYxAB",
            "text": "More diners discover this spot each week. Two people enjoyed this together. The restaurant uses quality ingredients, good seasoning, fair prices, and pleasant staff. Staff members push this restaurant to excellence. This place makes mouth-watering food!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1a2JWRkdXSGc1VWxsT1IyNTNPVkJUYzNsNk5WRRAB",
            "text": "This place balances form and function. Each person found their selection delicious. Each team person performs remarkably well. Good-looking venue with people who make you feel genuinely welcome. Regardless of wait times, this spot deserves a visit."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5eU5qTkxXbmMyUWkxeVh6WlJTWGxDWVVnMFpuYxAB",
            "text": "The kitchen team here has serious skills. The staff creates a relaxed atmosphere. This spot delivers steady satisfaction. All food here is excellent. The service was attentive and the food was amazing! I'll be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwblREWkNhVEp3UW1ORmVIcDRielIyWnpGU1JGRRAB",
            "text": "Food is delicious & service is excellent. Although we wish the restaurant could be bigger, its interior design is nice and cozy. The cost are good and reasonable nowadays in Manhattan, not like most restaurants inflated prices as they will more than the inflation truely brought! Come to try it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSYU4xTTJUMDlzTFRseVVWWnpiek5DY3pCTWFIYxAB",
            "text": "Great food and service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNllsRkxkRGRuWlhFMmRuUkROa2Q0VUdkS1VGRRAB",
            "text": "Beautiful place and good food and great service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMFF6RllhVWhvTVVsaVZqUnVlbE5HVW1zMldWRRAB",
            "text": "Beautiful place with great food and wonderful customer service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUVR6WnlhRGxGWkZsTWFsUkJiRWw0Y0ZKU2JFRRAB",
            "text": "Great restaurant"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJMFNqZDZRMnBvTkdkV2FuQjJZMEZ0YWs4eWMwRRAB",
            "text": "Delicious food, beautiful atmosphere, big portions, and super authentic flavors!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCU2VUWkJlbmRsY21sMGFqVlBWMk5aYkRaQ1pGRRAB",
            "text": "This is a 100 year old restaurant and we were looking forward to the food and ordered a few traditional dishes"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25acU5rUndWRnAwVUhoMGVrNXpVM2RDYUhKTU1HYxAB",
            "text": "Visited Tipsy Shanghai this week, a charming Jiangnan-style spot on 3rd Avenue. The red screens and green chairs give it a nostalgic, courtyard-like vibe.\n\nHighlights included juicy Wuxi soup dumplings, crispy-bottomed pan-fried buns, fragrant green tea sesame balls, and tender sweet-and-sour fish. The Shanghai salted pork rice was perfectly seasoned, and the Wuxi ribs were rich yet balanced. Loved the fragrant osmanthus eight-treasure rice for dessert—nutty, sweet, and not too heavy.\n\nDishes are delicately seasoned, making it a great choice for those who prefer lighter flavors. The retro décor adds to the charm—definitely worth a visit if you’re craving a gentle taste of Jiangnan."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KamNWZEtiVXBzTmpBNVYwRnFOMnB2YWt0blNGRRAB",
            "text": "Food is great and well priced. Staff are friendly. This isn't high end food but they nail their level. Highly recommend if you are in the area and aren't sure what to eat."
        },
        {
            "date": "3달 전",
            "language": "zh-Hant",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxU09ITXplRnBMVGpSYVJ5MVFaM1I2TjNvNVVWRRAB",
            "text": "圖片跟上來食物完全長不一樣"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xscVFXdElTVnB4V2pscVIwVjVhVGxoVDFsUlJFRRAB",
            "text": "Great food and great service!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xabFIzZFBaRWc1UnkwM1NUSndNR3BEWW1OWGIyYxAB",
            "text": "I liked the XLB, would recommend! The pork ribs were good too!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poVExWQnVSRFZwVEhObFRIQkxRMDB6YlZkQmQxRRAB",
            "text": "Taste like real Suzhou cuisine!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOMFFsaHhNSE5HV0hGVmNXeHZTRU5TTkhKSVRWRRAB",
            "text": "Food was very good. Atmosphere was very pleasant"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3OTVmZGtBRRAB",
            "text": "가격대 적당하고, 친절하고 깨끗해요. Beef noodle 먹었는데 맛있어요!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMU1qaHRkV1ptT1V4Zk4xUnhlVUZwU2padVYxRRAB",
            "text": "Really great home style Shanghainese food. Lots of healthy options like shredded tofu (like tofu in noodle shape) and vegetables in broth. The wine chicken is delicious and has a lot of meat. The shepherds purse fish filets were really savory. All in all the food was great. A little disappointed in the shengjianbao 生煎包 but it’s okay, the healthy options are harder to find elsewhere.\n\nPrice is great for the portion sizes. Service was polite and prompt. The restaurant is fairly quiet, clean, and has some pretty decor with vases and decorative plates on display. Definitely a place I’d come back to for some healthy Chinese."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJd09xbGxBRRAB",
            "text": "We just had an absolutely incredible dinner experience at this amazing spot! Rita was simply outstanding! Her professionalism and expertise were unmatched, making our dining experience unforgettable. The service was truly top-notch! And let’s talk about the food—it was absolutely delicious! The restaurant was spotless and impeccably organized. We can't wait to return and explore the rest of the menu! What a fantastic evening!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvLVo2Q2FnEAE",
            "text": "A cute little spot with amazing food. The pork XLB were juicy with a light, savory flavor. Shredded Pork and Salted Vegetable Soup had a delicate flavor that really showcased the vegetables. For dessert I highly recommend the creamy coconut red bean soup."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKSE1XSk1ZM1pPWlUxd00zaHNkMHRCVWpReVgxRRAB",
            "text": "Best Shanghai food in Manhattan! Try the fish with cabbage and chili, the orange beef, green beans, and the sesame balls! Amazing!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQV1dpTFBUNmZuenVnRRAB",
            "text": "Horrible, absolute worst dining experience ever. Served completely raw shrimp within spring rolls, pictured below. Completely irresponsible management that was unconcerned and did not care about this. Our waiters were struggling to get in contact with their managers when this happened and had no idea how to handle the situation. The managers refused to acknowledge us and never showed face. Instead of acknowledging what happened, on multiple occasions after we informed them of the raw shrimp, our waiters walked away from us without saying a single word. We had to flag them down multiple times. We never received full acknowledgment of what had happened or an apology. Ultimately, our meal, which we barely consumed after this raw shrimp fiasco, was comped as a means to get rid of us without having to say sorry or acknowledge the issue of food safety.\n\nWhen we went home, both of us threw up as a direct result of having accidentally consumed some of this raw shrimp before realizing the rawness and we were sick for the entire night. Nobody should ever eat here as there is no guarantee this won’t happen again since neither the chefs nor management cares at all about food safety."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPTHRfdnFkcjdpVm1RRRAB",
            "text": "We popped in about 40 min before closing and were not disappointed. Service was top notch, warm, and friendly. The food was some of the best we had ever had and highly recommend the crab and pork soup dumplings. The only regret we have is not discovering this place sooner during our vacation."
        },
        {
            "date": "10달 전",
            "language": "ja",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bF9EZTBnRRAB",
            "text": "近くのスーパーをよく利用していて、気になってディナーに入ってみました。どの料理もとても美味しくて、ボリュームもあります。おすすめはスーランタンスープです。寒い時期は身体が温まります。海老春巻、湯葉春巻、焼売、酸辣湯スープ、豚肉と野菜の炒め物、小籠包を頼みました。3人で70ドルはとても安いです。\nまた家族で行きたいです。\n\nI often go to the nearby supermarket, and after shopping, Istopped by here with my family for dinner. All the dishes are delicious and filling. My recommendation is the hot and sour soup. It's a little spicy, but it warms you up in the cold season. We ordered shrimp spring rolls, yuba spring rolls, shumai, hot and sour soup, Xiaolongbao and stir-fried pork and vegetables. It was $70 for three people. It's very cheap. We'll go again."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRX3RHeTZ3RRAB",
            "text": "Very tasty and affordable Chinese food! At many places you have to pay $20 for just an entree, but here for the lunch special you can get a serving of dumplings, noodles, a meat dish, and a drink for under $20. Service was great and the decorations felt relevant and tasteful! The pan fried xiaolongbao was delicious."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLX1EyNV93eVlhVTdRRRAB",
            "text": "The best braised beef noodle in the city. Menu and price is perfectly composed. It is worth every dollar."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJSDhfOXE3MVpMRzhBRRAB",
            "text": "Very enjoyable Chinese place in the heart of Murray Hill! I’ve passed by this restaurant many times, but this was the first time I actually tried it. We ordered the green beans, boiled fish, and lion’s head all of which were delicious! I especially liked the lion’s head which had this sweet and savory sauce that went very well with the meat. They had a good selection of Shanghainese food. Sadly they were out of the Xiao Long Bao, but that will just give me more reason to come back and try more of their dishes!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvLWQ3MHVBRRAB",
            "text": "My husband and I stumbled into this restaurant for a late lunch when we were checking out nearby apartments during our NYC visit. This was absolutely amazing! I haven't had Shanghainese food for many years, and it was a real treat to have such delicious dishes. We got the lion head meatballs, shredded pork and salted vegetable noodle soup, and pork soup dumplings. The meatballs were flavorful and incredibly tender, but my favorite thing was the noodles, which took me right back to my childhood. The staff was also absolutely lovely! Prices were very reasonable-- much lower than I expected for NY.\n\nI'll definitely be back to try some of the other dishes -- there were so many I wanted that I didn't have stomach room for :)\n\n(I was so hungry I forgot to take many pictures 😅)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNYVQ5di1sdXRuT1pnEAE",
            "text": "Great Place. Very kind and accommodating staff. Exceptional food with great value for money."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRdFVUUlJhR2M0V0hkbmNrZGtPSEpEVVZGWVExRRAB",
            "text": "The food is decent. But the size they give when you order is ridiculous if not robbery. They charged me $9 for this size White fungus soup."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNybWJEa0xREAE",
            "text": "This feels like a rerun because I could swear I reviewed one of TS' other locations years ago, but I can't find any record of it and my cobwebby brain can't remember anything either. So here we go again. Ain't senility grand?\n\nWe ordered a ton as a group of 7, sharing everything family-style. Each person ended up owing $38 all included, which is practically free in these inflationary times. Gotta love that.\n\nThe good:\n\n- Osmanthus Salted Duck: Lip-smackingly umami\n\n- Shrimp Shumai: Classic and solid\n\n- Xiaolong Bao: Also classic and solid\n\n- Spring Noodles: Not as laden with veggies as I would've liked, but appropriately savory\n\n- Peking Style Minced Pork Noodles: Not my cup of tea, but well made\n\n- Wuxi Pork Ribs: Their signature dish and with good reason. Probably the best dish of our batch\n\n- Boiled Fish with Pickled Cabbage and Chili: Generously overfilled with tender fish, but the broth was a bit too oily\n\n- Salted Egg Custard Bun: Who doesn't love this for dessert?\n\n- Creamy Custard Bun: More custard deliciousness, just not as runny\n\nThe eh:\n\n- Cold Bamboo Shoots: Not tossed with chili oil like I like, so no bueno for me\n\n- Tofu Tossed with Preserved Egg: Why was this sweet? Why? Eggs should never be sweet!\n\n- Pumpkin Cake: Thought this would have runny, yolky custard too, but it was filled with red bean paste instead. Which isn't bad...just not as fun\n\nThe space is gorg, and the staff were pretty attentive, even giving us some complimentary items when they messed up an order."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyOXF6aW5RRRAB",
            "text": "I walked in for dinner with no reservation. It’s a small cozy place with a lot of items on their menu. The food was ok and the service was good.\n\nThere was a dead baby roach steamed with the shrimp dumpling. If there are baby roaches this probably isn’t a good sign... It was a bit difficult to finish eating the other dishes after seeing a dead bug. You can see it in the photo. They were kind and apologetic enough to remove the dish and a drink from the bill and they gave me a 20% discount. I really appreciate that though."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNId0l6T0dnEAE",
            "text": "A cute tiny little spot with AMAZING soup dumplings - I got the crab & pork and they might have been the best soup dumplings I have ever had. I also had the braised beef soup wich was yummy, perfect for a cool day! The service is quick & the staff is super friendly - I can't wait to come back to try more things!!!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBZ096WDlBRRAB",
            "text": "It is a small but cozy place with plenty of Chinese decorations. Although the menu has more dimsum than entrée dishes, it still offers varieties from soup, appetizers, entrées. to desserts. The servers are attentive to your needs. The dishes are very good at NYC. Anyway, it's a good place to have a Shanghai cuisine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0aElmNjhBRRAB",
            "text": "This is the 3rd time my family and I have been here. And we have loved it. All the dishes we have tried have been delicious. Amy, who attended to us, was also spot on with her recommendations. The Osmanthus Salted Duck, Stewed Sliced Fish in Wine Sauce, and Drunken Chicken Suzhou Style deserve special mention. So too their dim sum dishes and White Fungus Soup with Lotus Seeds. All in all, a great dining experience for us. Will definitely be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuOHI3eDNBRRAB",
            "text": "Loved this and felt it was a pretty authentic experience.  More of a dim sum, noodles, and soup based menu.  Really friendly and prompt service.   For folks looking for that American Chinese food experience this may not be for you.  Had the lunch special and felt it was a good value for money.  Quaint physical environment, and they turn over tables pretty quickly."
        },
        {
            "date": "1년 전",
            "language": "zh",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUeS1pWEhnEAE",
            "text": "一上来的四喜烤麸就惊艳了，生煎包也非常棒，糖醋排骨也不错，肉质更软一些会更好。炸酱面超级好吃，我会觉得甜了一点，小朋友评价非常地道。宫爆鸡丁不辣香味道比较正，火气不够旺。酸辣鱼不太推荐。南瓜饼和芝麻球非常好。"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bTdUd1NBEAE",
            "text": "The menu reminds me of Shanghai. We lived there for a few years and the specialty dishes like xiaolongbao, sweet sour carp, sweet sour ribs, stewed fish…were known dishes. The crab/pork xiaolongbao was better than Dim Sum Palace. The stir fried spinach with garlic was great. The stewed fish soup was okay and xiaoyuan dessert soup with osmanthus flower was not good. The atmosphere is fun and colorful and the service pretty friendly for walk-in diners with no reservations."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSa3N2TzFBRRAB",
            "text": "Never had traditional Chinese like this before, and now a customer for life!\nAfter always walking past Tipsy Shanghai I finally decided to give it a try and do not regret anything.\nThe decor is simple and intimate. The food is outstanding. The service is outstanding.\nHighly recommend the braised beef noodle soup, very flavorful and the meat was so tender. The crab dumplings were actually to die for. The garlic broccoli was a light side and the spring rolls were crispy and delicious.\nCannot wait to come back and try other delicious dishes!"
        },
        {
            "date": "10달 전",
            "language": "ja",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNXRpMmRREAE",
            "text": "Googleマップに良い評価をつけるとフリーのスイーツを提供する、と書かれたものがテーブルの上に置かれていましたので、このお店のレビューの高さはあまり信頼に足るものではないと思いました。\n\n味はそこまで悪く無いと思いましたが、サービスの品質があまり良くないように感じましたので、この評価とします。"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRamJqSS13RRAB",
            "text": "Unfortunately, the food here is far from satisfactory. The Pork & Pickle Noodle doesn’t have much pickle taste or pork(just lot of marinated fat); the sichuan double cooked pork is supposed to be salty and spicy, but instead they served something that resembles Thai style Sweet and sour pork- and it barely has any meat; huge chucks of undercooked fat was everywhere. The steam fried buns taste like something I bought from freezers from supermarket. I’m extremely disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyckt2Yjh3RRAB",
            "text": "My daughter found Tipsy accidentally, and we were pleasantly surprised! Amy and Irene made our 4th of July dining experience outstanding The food is authentic, fresh and delicious! The service is excellent. And the atmosphere is warm and inviting. I highly recommend Tipsy Shanghai on 3rd Ave! ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3LTZhSkxREAE",
            "text": "Such a pretty restaurant and the food is amazing! Tons to choose from and everything we got was delish. The cashew kung pao chicken is a must, so is the garlic broccoli"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6MHRXNmJBEAE",
            "text": "Great list of Shanghainese food. The ambience is great with red dividers that make it look like you are in little Shanghai. The tables are cozy and the place is decorated with lots of beautiful pottery. It’s a nice place to come w friends and family and to enjoy February flavorful food and dessert. The dessert spread is impressive compared to other Chinese restaurants bc most places don’t offer so many Chinese dessert dishes. You can get sesame seed balls (3) here for $6.95. The pork Wuxi ribs were tender and had great flavor. All food items were very rich in flavor and had tons of the sauce so if you want to take the sauce, leftovers home, you can make your own food with them. The flavoring is kind of salty so if you’re trying to avoid salt, then you could take half your dish home and add some stuff to it because there will be a lot of sauce left over which is nice bc you can eat more of the flavor at home. They also add sugar to the food so if this is the cuisine you enjoy, come here! It’s on 3rd avenue and 39th street very close to the UN building. Irene was our hostess and she was very sweet and attentive. if you write a review, you will get a free dessert."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcW91ZWdBRRAB",
            "text": "Authentic Chinese Food from Suzhou and Hangzhou, especially the Kunshan Aozao Noodles. I will definitely recommend this restaurant to everybody enjoys sweet food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqOFkteERBEAE",
            "text": "We ordered two soup dumpling (xiaolong bao) one shengjian bao, and eel stir fry. One serving of soup dumpling was not throughly cooked and meat was still raw. The owner apologized and made us another serving and took off this serving off the check, which was nice of her. The soup dumpling’s meat filling and size was the same as the shengjian bao, which was not authentic. The eel stir fry was a big disappointment. It was the most expensive dish on the menu, but it was mostly onion, I literally had to ‘hunt’ for the eel. The small eel is very similar to the sliced onion, as the color is also similar. The dish had less than 5 percent eel in it. Also on the check it became $29.99 while the menu listed it as $26.99. Very disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqM0k3eGV3EAE",
            "text": "This place has convenience and authenticity going for it. Unfortunately though the food was all fairly mediocre. Went with dim sum and the pan fried dumplings lacked the crispy undersides that come from slowly frying in a pan and makes them so delicious. The  xiaolongbao were also average with wrappers too thick and lacking in soup. It was ok for a convenient late night bite but not a place I’d travel out of my way for to satisfy my Chinese food cravings."
        }
    ],
    "reviews_count": 81
}