{
    "name": "Aunt Bernie's Bar and Jardin",
    "place_id": "ChIJQUyO-6VZwokRt-kEP9UFBX8",
    "grid": "MN6",
    "address": "513 3rd Ave, New York, NY 10016, USA",
    "rating": 4.5,
    "user_ratings_total": 134,
    "phone_number": "(212) 779-1800",
    "reviews": [
        {
            "date": "수정일: 9시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaVlLMHBnRRAB",
            "text": "Wow! This place is the best! I’m from San Diego & these are the best tacos I’ve had in NY PERIOD! I’ve been to a million places and these are the best: don’t even get me started on the Rhode Island Oysters. BOMB. Staff are insanely friendly & kind. Obsessed with this place!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21abE5YVkZjMUY0Um05VFNGWlllamxSVVRSQlJIYxAB",
            "text": "I had a very disappointing experience with Aunt Bernie’s. After dining here, I was shocked to see a 67% tip charged to my card something I definitely did not authorize. When I reached out to the restaurant, their response was dismissive and unhelpful."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRdFJtOHlabnBxTjFWVE5rSkRjbVkyT0c1elYxRRAB",
            "text": "Turned away because they were too busy despite 6 empty tables."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWSFNIaEpTWFJ6YmxsWU5qUlNiR0pUU1dabVMxRRAB",
            "text": "The pasta was dry and not worth it"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwc1NIVkRXRkJKY0ZGYVMyUlFRVVJVZVd3elNWRRAB",
            "text": "Anniversary dinner with hubby absolutely amazing. The cocktail were very refreshing and well balanced 👌🌷❤️.spritzers 👍👍"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGWmVFZDNOVXh2TWpKNFgwaFVaSEp5VW5SalFVRRAB",
            "text": "This is surely an up and comer.  The food was excellent.  Diverse choices.  We shared 4 plates (steak taco, flatbread, chicken kabobs, and gruyere cheeseburger).  All were great. The staff was amazing- friendly and attentive.  Prices are reasonable. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210d1NraDNaemhRTUVneGMzTjBNWGhtWVhKb01YYxAB",
            "text": "Beautiful bar and restaurant, top notch staff; shout out Kaylene and Nicole, cocktail program is on point, and the burger is wicked tasty highly recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkS1VETTRTSFZMVW5sMVNsSk1aRGxxY1hsdWEwRRAB",
            "text": "Aunt Bernie’s is the “new kid on the block” but I had the most incredible experience! Nestled in the heart of Kips Bay, there is a wide variety of cuisine to choose from.. burgers, pasta, Greek, amazing alcoholic beverages, desserts and more! On top of that, the management and staff are on their “A” game. Food came out promptly and everything was cooked to order. Will definitely return!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONVFVOXNXRGhSY21OMmVFRlhTRFF0TW5wNlQxRRAB",
            "text": "Sister bar/restaurant of my favorite venue in midtown, Bubo — Aunt Bernie’s is a delicacy you cannot ignore in the heart of Murray Hill. Serving dinner and open brunch hours on the weekends, this spot has a stunning back space and a big screen you can watch sports, movies, and host fun events and parties. Outdoor seating is now open as well. Just had this amazing mezcal Bloody Maria hand crafted and served by their one and only Lindsey, she’s the best! Come in and say hello!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21saVVVcHhPRUZ2YkROWlQwNVVTMFoyVDFKaVRsRRAB",
            "text": "Highly recommend this spot. Aunt Bernie’s is my new go to spot for happy hour in Murray Hill. Enjoyed the fresh oysters, cocktail options and the great vibe. Cozy, stylish, and super friendly staff. Will definitely be back soon!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTFpXaHVkekJQYmxvemMwdHJaR0V0TWtKaFdFRRAB",
            "text": "We came to Aunt Bernie’s with a group of 15 co workers and it was the perfect spot to have a large group happy hour. We sat in the back room with gorgeous long tables and amazing decor. The owner is a lovely man who sent us free trays of fries for being first time customers. Our waitress also allowed us all to start individual checks which was extremely appreciated. Highly recommend ! Also the fries are home made !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KbFJGYzBRbTk2TmtZeFIxTlRNelpyYmpWcVkxRRAB",
            "text": "My friend told  me about this spot and I’m honestly so glad he did. The place had such a chill and welcoming vibe, it just felt good to be there. I got the carbonara, and wow… it was stellar. Super creamy, full of flavor, and the pasta was cooked perfectly. I also ordered the truffle fries and they were to die for, you could tell they were even homemade! Everyone working there was super friendly too. Overall, it was just a really good time, and I’m 100% coming back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKM1dUSTNVMEo2YmpaeFUyWnFSbm93V2pNellWRRAB",
            "text": "I stumbled upon this spot while exploring the city and decided to stop for a bite. I ordered a burger, and it was absolutely delicious, juicy and full of flavor. The burger came with some homemade fries that were crispy and delightful. On top of this, the atmosphere was fantastic, and the people were incredibly friendly. I had such a great time here and will definitely be coming back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psVmRXMHlSVzFxTXpnM2VVaG9iSFJ4ZEdRNFNIYxAB",
            "text": "Happy Hour at Aunt Bernie’s: rosé and white wine flights & snacks (Serrano ham & manchengo croquettes + deviled eggs).\n\nTheir summer cocktail is a delicious blood orange Paloma.\n\nHappy Hour is 4-6:30pm and by 6 it was packed!\n\nGreat service too!"
        },
        {
            "date": "5달 전",
            "language": "ja",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOX0JfUFBDOFBQZU5REAE",
            "text": "バランスよいい店。\n値段も高くなく、スタッフも過度にフレンドリーでなく、程よく感じがいい。\nハッピーアワーはお得だし、ビールも美味しい。\n音楽の音量とか雰囲気とかもよく、長居しやすい雰囲気がある。\nリピートしたい。\nステーキのメキシカンのやつ、写真忘れたけど美味しかった。\nセビッチェも美味しかった。少し酸っぱみ強いが、酸っぱいもの好きなので好み。"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPYjd5UEd5bTVxMVNREAE",
            "text": "Lovely atmosphere and impressive spirits selection. Delicious cocktails and bar food. Staff is super friendly and professional. Always great experience!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOaU4xdjYteDREMHJRRRAB",
            "text": "I hosted a 50th Birthday party here for my wife and it was absolutely perfect. Coordination and booking was a breeze.  Staff was wonderful and very helpful.  The space is perfect.  DJ was able to plug in very easily. We had ~100 ppl and there was room for more. At least a few dozen people mentioned how lovely the space was during the event and people were asking how I found it.  I'd definitely recommend hosting a party here!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJemEyeWdRRRAB",
            "text": "Paige was really good and drink were amazing!!! 10/10 high recommend coming here for drink and vibe !!  Ask for her when u come !!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbHBYM0tREAE",
            "text": "Loved the ceviche, oysters and French onion soup,and grilled octopus. As someone with a mediterranean background I always appreciate a well done octopus dish. The staff was very helpful in helping find a nice wine to pair with the meal. Special shoutout to Paige for her cheerfulness and putting up with my turning the page jokes. She was a  great sport and added to the overall great atmosphere ."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3a015ZXhnRRAB",
            "text": "Manager sucks. He was mean to our waitress in front of us. Our waitress was amazing!!!!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRN05hdjJBRRAB",
            "text": "My husband and I always enjoy going to Aunt Bernie’s. The service and the drinks are on point. I have chatted with a few of the bartenders and you can tell that they take pride in creating handcrafted cocktails. I recently had an espresso martini and it was absolutely delicious. This is a place that I will continue to return to when I am looking for a great cocktail."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfaVpfUVN3EAE",
            "text": "Great bar, great vibes. Julianna is the best!! Appreciate her more than she knows!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2aUpieDB3RRAB",
            "text": "We had our annual holiday party at Aunt Bernie’s and it was fantastic. The back room is gorgeous and decorated in a subtle yet classy manner. The server, Kaelyn was wonderful. She was attentive, available, and friendly.  The bar tenders, Chris and Nicole, were great with preparing drinks that were delicious and even made mocktails that were so good.  We also ordered bites for people to eat and everyone agreed the food was very good. They are great with accommodating allergies. Overall, working with Aunt Bernie’s made our party a huge success and I would highly recommend them!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQcnYzTTJRRRAB",
            "text": "Charged $12 for a club soda with bitters. Insanity. Will never come here again."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzczdqdlBBEAE",
            "text": "I want to preface by saying our server was running around all night so it may have been understaffed, she was clearly hustling, but we sat there for 10 minutes before someone took our order. From the under cooked shrimp in the saganaki, to the ice cold steak that was served w soggy bread and inconsistent cook, some parts were rare( others well done). The octopus was like rubber, nothing like what you’d expect seeing grilled octopus on a menu. The truffle fries never made it into our order. the lamb lollipops were the only decent bite, perfectly cooked tbh but not well seasoned. The chutney was just not it. Left pretty disappointed, a lil hungry and kind of nauseous lol. Vibey spot tho- go for DRINKS only."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNmVqWWV3EAE",
            "text": "My friend & I were immediately  greeted by the hostess & bartender with friendly smiles. The ambiance as you walk in is very inviting.  The food was delicious! I must comment on the cheese plate & swordfish skewer I ordered from small bites on the menu. The honeycomb, bread selections and cheeses were accompanied by fruit & nuts. The jam was amazing! I asked the owner about it and he said it was frome Greece. I loved it! The swordfish was perfectly seasoned with bite-sized morsels & sides of carrots & asparagus.\nI would definitely enjoy coming back to try more delights. If your looking for good eats & service this us the place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNmJDM2tRRRAB",
            "text": "This place was referred to me by a relative and what a hit it is! Great location, totally upscale and elegant. We shared some small plates that had big delicious tastes. Cheese plate, crab cakes and swordfish skewers. Great wines and mixed drinks. Staff and the owner are very warm and hospitable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUM2JhRjNRRRAB",
            "text": "Fun vibe and excellent oysters!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUdnJHU2Z3EAE",
            "text": "Visited on Tuesday and my servers name was Page. Absolutely incredible service and she had great recommendations. Great experience, server made it better, drinks were FANTASTIC\n\nDefinitely coming back! Side note: love the extra mile she went for my dog!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqaWRYSkRBEAE",
            "text": "Tequila Palermo was great! And I hate tequila :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREaFlLNFlBEAE",
            "text": "The wine flights are amazing. Great bartender"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREa2ZmZDhBRRAB",
            "text": "Without a doubt, this is one of my favorite bars in the area. I’ve been a local for a decent amount of time in the neighborhood and discovered this place after having been next door a few times. The atmosphere is elite, bartenders/servers/hosts are legendary (shouts out to Chris & Paige the OG duo), and the food/snacks are tasty (highly recommend a white wine flight with those oysters and maybe even the croquettes). I originally came here for the wine flight happy hour deal (chef’s kiss) and have been coming back ever since due to the immaculate atmosphere and fun bartender/server energy. I rarely see bar staff so seamlessly create such a cool vibe that I crave to be a part of. The music is stellar and usually curated by the bar staff as well. The manager Jeff is also a really knowledgeable, interesting dude who is to thank for getting me into the whiskey game way back when. Can’t say I’ve ever truly met the owner in all of my time there but maybe he’s a cool guy too? The next trip to Bernie’s can never come soon enough!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENnB2UU1REAE",
            "text": "It’s really good place , and ong soap… you need to see bathroom and try soap there 🔥🔥🔥"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkdnVicDlRRRAB",
            "text": "Horrible, horrible, beyond horrible! If there’s one thing right about this place that is: there are really better bars then this one! Asian guy Chris with long hair is beyond rude. Avoid this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkcU5ITkxnEAE",
            "text": "Great happy hour everyday till 6:30 and good collection of wine! Food was also bomb. Highly recommend 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROLWZhRnJBRRAB",
            "text": "Asian bartender stop serving me drinks for no reason... Even though I was buying drinks for my coworkers and giving him tips for every order... He refused to serve me drinks... I asked him why he can't serve me drinks and he said he is not obliged to tell me... Also my other coworker asked him for drinks and he said there's more bars down the streets... Clearly he didn't like us white and latin folks... He should be fire.. Definitely not going back to that place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROOWF5WDFBRRAB",
            "text": "Well after coming with 8 to 12 coworkers (for a farewell) let me tell you how they have a bartender that obviously does not like to work on Tuesdays.  Not only was this asian bartending man rude and just sat back while crossing his arms and staring at us, he would suck his teeth and roll his eyes when we asked for a drink. So i guess the tips and the money was not enough for him. No one was acting crazy, we were literally in a work event and he told us at the end of the night \"you know there are other bars in the streets\". I have never in my life heard a bartender tell me that. Maybe we had too much of a diverse color in our group but that is no way to speak to costumers... paying costumers at that. So if anyone is looking for a cute place with a nasty/racist bartender this is the place for you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURONE51X2dBRRAB",
            "text": "picked up a \"steak a la plancha\" and fries...\nthe bartender was too busy talking to other patrons...5 minutes later came to take my order and he looked upset since he was interrupted from his conversation.\nate the sandwich at home and suffice to say...i stopped eating the sandwich (the meat was rubbery?)...i decided to go back to my fridge and continue eating my 2 day old deli sub which was wayyyy better than this steak a la plancha."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOMk5DOWhRRRAB",
            "text": "Great spot! And they have a really good oyster happy hour!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWOHBqc2VnEAE",
            "text": "Great service and staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsNTV2UEVBEAE",
            "text": "Great apps and cocktails"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGaV9pZGJ3EAE",
            "text": "Friendly wait staff and nice laid back atmosphere. A very welcoming establishment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNXBXeTdnRRAB",
            "text": "This is a nice bar in the area and they have a good happy hour. The oysters were quite fresh. We were happier I would say the downfall is they only offer wine flights instead of glasses of wine so you’re kind of forced to try three wines you might not like which actually have Boss. They have some nice outdoor seating and some indoor city. I did not get to check out the garden part. We also tried another appetizer, which just was not great. I think that the appetizers on their happy hour is not our favorite. We didn’t eat dinner here but I would try it in the future potentially. I just wish they had a better robust happy hour menu.plus the atmosphere was just OK. It was really quiet. We were like the only people there, which is not the most exciting thing for New York but I would definitely try to get maybe when it’s a little busier."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGdWJuWnRnRRAB",
            "text": "The only place to get Zucchini croquettes - the best in town! Lovely team, specialty cocktails and great Happy Hour. My “go-to” spot in the area"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1ejZQa3RnRRAB",
            "text": "The food was delicious, the drinks were good and the staff was friendly. I’ll definitely have to go back one day."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1Z3NTd1lBEAE",
            "text": "Great drinks great food and good atmosphere! Service was also very nice."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURadmFIZXNBRRAB",
            "text": "Great food. The service is amazing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMk51eHN3RRAB",
            "text": "Beautiful place and wonderful experience.  Comfortable atmosphere and excellent service"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabGRUUGZREAE",
            "text": "Very nice Happy Hour Specials.  Love the Red Full Bodied wine flight.  Had a dozen of the Raw Oysters, Escargot, Pork Belly, Baked Brie and Beat Salad.  It was a nice variety of of dishes and everything was sooo delish!  It can get really noisy when it's busy but it's worth it.  We've been here about 3 times and had the same waitress, adorable, petite brunette and extremely attentive and most importantly friendly even amidst the hustle and bustle of all the Happy Hour Revelers!  Always a smile on her face and equally welcoming.   This is our new favorite Happy Hour place! Cheers and Enjoy!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabElmODZBRRAB",
            "text": "The best dirty martini in Manhattan"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwclkyOXlBRRAB",
            "text": "What a treat for Friday night! The food was so yummy. I highly recommend the salmon, shrimp tacos and the croquette jamón. Also I liked more the chicken empanadas than the steak. Both delicious! They have a diverse wine selection. I drunk the Chardonnay all night and it was perfect! My friend had cocktails and it was good too. The ambience is so cute and restrooms are really clean."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSaXBHeXVBRRAB",
            "text": "Excellent happy hour! Various wine flights for $13 (normally $18), dozen oysters for $15 (normally $36), and various apps on discount.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwel9XSVR3EAE",
            "text": "Aunt Bernies is a very fun & lively place. We chose to sit outside in their beautiful outdoor dining area, which had lots of space for big groups.\n\nFood was great and reasonably priced. The menu had a nice selection of tapas, which made it easy to pick out a few things for the table to share.  The drink menu was also interesting, and not filled with typical big name brands, but more of the unique choices, you can tell they put great effort in choosing each item.  I was in the mood for a refreshing crisp beer and the server recommended a really good beer from Spain.  I noticed the table next to me were enjoying wine flights.\n\nI did peak inside, great atmosphere, beautiful bar with dim lighting and very fun vibe. The interior seems great for the evening and theres a beautiful indoor garden room in the back for parties and private events.\n\nI have to say that I’m very impressed with the Aunt Bernies team, they are for sure elevating Murray Hill area!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1LU9mTGFnEAE",
            "text": "This place is absolutely underrated! Amazing food and cocktails, and great ambiance as well. Oysters are always fresh too! I recommend the Almost Famous cocktail and their happy hour does $13 wine flights which is unheard of in the city :) 5 stars!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocEt6RkF3EAE",
            "text": "I was recommended to go to Aunt Bernie's by a friend and 'oh boy' was it a delightful time! Everything we ordered was excellent and the staff was very polite and attentive. I was with my significant other and we both wanted light snacks and…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdXFyYzBnRRAB",
            "text": "I've been wanting to come to Aunt Bernie's since it first opened up and I finally had a chance to stop by. So happy I did! My usual to go drink especially in this type of weather is an Aperol spritz so I ordered an Aperol Spritz and it was very tasty,  refreshing and just well made. For food, I wanted to try something different so I decided to get the Tarte Flambee Flatbread. I am not a huge fan of bacon so at first, I was a little unsure but when my food came, that savory smell really increased my appetite.The flatbread was so tasty and rich in flavor I didn't want to stop eating it. Also, something that really caught my attention was the atmosphere and ambiance of the place as well as the interior design of the bar itself, the back room is set up very nicely. The service was great, staff was very attentive, friendly and just amazing. I can not wait to come back soon and try more items from the menu! Overall, if you're in the city and looking for an enjoyable place, Aunt Bernie's is your go to place! I highly recommend this place and I recommend the Tarte Flambee Flatbread. You will not regret it!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSaDdTQU9REAE",
            "text": "A nice neighborhood bar, casual yet chic.\nI visited for Happy Hour. Good happy hour deals, especially oysters. A good variety of tasty drinks and nice wine, definitely worth a visit for drinks and snacks."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKZ2JMY05REAE",
            "text": "Always enjoy dining at Aunt Bernie's. Easy neighborhood spot for me to sit outside with my dog, enjoy good food, cocktails and wine."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcEpHUWZREAE",
            "text": "Amazing all around experience.  Great food.  Service. Ambiance AND bathroom.  Very reasonably priced happy hour.  My new go to"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKeXIzMS1BRRAB",
            "text": "Baked brie was incredible here! Most of the dishes we got were good, but sadly the patatas bravas were quite bad. Otherwise the outdoor seating was nice and the interior looked cozy."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPal9lQXpnRRAB",
            "text": "I came to this restaurant with a group of friends. The place overall is great, bartender’s, waiters and waitresses are outstanding individuals. The food was perfection but the food was a little slow. Overall we had an amazing experience and will definitely come back again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPal9lc0x3EAE",
            "text": "This place is great! I went here to get a Cheeseburger and it was really good. I have never tasted such great food in NYC. The prices are a bit high but it’s 100% worth it! I will for sure bring some of my other friends here. If you wanna come here for a date or something I 110% recommend it!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyczg3ZFhBEAE",
            "text": "Great atmosphere with Hand-Crafted Cocktails that match the amazing dècor. This place has a HUGE variety of alcohol and will have what you are looking for. Perfect spot to enjoy drinks and food!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSaUlhTXhnRRAB",
            "text": "What a find! Quality across the board ( extensive spirits selection and incredibly well thought out menu), professional yet personal service, and there is space for a group?! Unheard of in Manhattan, we were 8 people and I was almost having a panic attack imagining how impossible it was going to be to have an impromptu get together and luckily we came upon this place. It was busy but they made room for us and we had a blast. I don't really write reviews but felt absolutely compelled to because this place saved the day and was just excellent in every way ( wine pairings with oysters and assorted small plates, outstanding) and its also fairly priced, easily the best addition to the neighborhood and so worth the trip for a group/party. Thank you and will be back soon!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtMU9hYW5RRRAB",
            "text": "I can’t emphasize enough how pleasantly surprised I was by this new establishment. Considering my friend and I work nearby, we are very familiar with the neighborhood. We happened to stop by on a whim. The decor, the drinks, the…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdnRPX3pnRRAB",
            "text": "Amazing food and service in a cute ambiance!\nWe have ordered portobello mushrooms, is was fantastic. The lamb is unbelievable  taste good\nGreat cocktails and huge options of wine🍷 it’s Impossible not to have fun!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1bnFuczdBRRAB",
            "text": "I’m really hoping more people start to hear about this place. The blood orange Paloma was delish. The escargot needed a drop more garlic but was still super tasty. The burger was perfectly seasoned and SO juicy. Can’t wait to go back again…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURScTVTWGxnRRAB",
            "text": "Aunt Bernie’s seemed like a quirky name for a restaurant and was somewhat leery, but after 11 miles of walking up and down Manhattan (with a nice stop at the Dead Rabbit on a cold windy day for an Irish Coffee), this was the place to stop as the knees could not do anymore.\n\nThe bartender Chris (for the ladies, he has the looks and smile of a K-drama star and who knows, that might be in his future) let us know as soon as we walked in that happy hour was closing in 15 minutes (4-6:30pm). Appreciated!\n\nAs a group of 4 after a long, long walk, we ordered everything on the HH menu – and it is a pretty darn good menu (including pork belly, oysters ($15 for a dozen), salads, calamari, baked brie, etc..) and the wines are outstanding – they come in a flight of 3, with 4 different flights (dry white, full bodied white, light red, full bodied red) for $13.\n\nOverall, it was one of the best Happy Hours that I have been to. Stopped by the next day for another dozen oysters.\nI don’t live in NYC so won’t be a regular any time soon. But it will clearly be on my go-to list when I am in town. And, again, Chris was a super bartender."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSLWJlbnF3RRAB",
            "text": "I love the atmosphere! We had a couple of drinks together with some food and it was just perfect!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1X0pTN09BEAE",
            "text": "Such a cute new spot! The back seating area is like an airy Parisian garden (but enclosed). They have very well priced wine flights during happy hour and the cocktails are amazing too. Food wise, must orders include the croque monsieur, the bone marrow and the baked Brie in puff pastry"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldnZQdlBBEAE",
            "text": "Best happy hour I've had in the area in a long time! The $13 wine flights (with several types of flights to choose from) are a nice departure from typical HH options in the city.\n\nI can't stop thinking about the HH oysters -which were super fresh and came with a variety of sauces and garnishes- and the truffle parmesean fries were just perfect. The escargot could have been a little more garlicky and oily but was still yummy and fresh. Our server Chris was great and very attentive too.\n\nWe sat outside and the setup was great, but the interior is also super cute- and even the bathrooms are luxe with amazing hand soap and towels! Would definitely plan a dinner with friends here in the future!\n\nOverall, what a refreshing HH experience in Murray Hill. Can't wait to come back again!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdEotVkpREAE",
            "text": "Favorite happy hour I’ve been to in awhile,  The rose flight paired with the happy hour $1.25 oysters are high quality and make for a great catchup with friends, family or coworkers.  Highly recommend coming to this bar, especially for happy hour."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtd2JYLWJREAE",
            "text": "Stunning layout, full premium cocktail and bourbon selection. A delicious selection of food and desserts is available. It's a pleasant place to unwind after work with friends. Highly recommended. It had me at Blanton's, which is my kind of drink."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyOC1iUjF3RRAB",
            "text": "From the service to the food this is one of the best restaurants I have been to in a long time! The atmosphere was superb! You can't go wrong with anything on the menu but I highly recommend ordering the Steak au Poivre. I will definitely be back at Aunt Bernie's Bar and Jardin soon."
        }
    ],
    "reviews_count": 74
}