{
    "name": "Friend Of A Farmer",
    "place_id": "ChIJb85ryKFZwokRaCJqC07E0G0",
    "grid": "MN6",
    "address": "77 Irving Pl Ground Floor, New York, NY 10003, USA",
    "rating": 4.4,
    "user_ratings_total": 1806,
    "phone_number": "(212) 477-2188",
    "reviews": [
        {
            "date": "16시간 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0cmQzVnNNWGR1ZWkxblptNTFUMnhzYjJOYVYyYxAB",
            "text": "Went for dinner last night at the Gramercy location and, unfortunately, was disappointed in the service. It took around 30 minutes before anyone came over to greet us, offer water, or take our drink order - not what I’d expect from a restaurant with this reputation and price point.\n\nThe food, as always, was excellent - we had the pot pie, mushroom pasta, and duck, all of which were fantastic. I’ve dined here before and have had great service, so this felt like an off night. It was especially a shame as we had a friend visiting from out of town, and we’d been talking up Friend of a Farmer all week for his last night in NYC.\n\nOne small note - we accidentally ordered the Beet Tartare thinking it was Beef Tartare (easy mistake!). Our server mentioned this happens often, so it might be worth clarifying on the menu or when taking orders.\n\nOverall, I’ll definitely give it another try since the food is consistently great - just hoping the service returns to its usual standard next time."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBM2J6QkxRV1JyTjJOamNsODNaalJZWkZSSVlWRRAB",
            "text": "Recently went and it was a very pleasant experience. The meal started off with a complimentary cornbread with apple sauce which was excellent. The burger was top tier and so was the chicken. The servers were attentive but I did feel a little rushed to get through the meal quickly. There is outdoor seating with space heaters to keep you warm. Overall I would return."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSWFXSlpRWEUyYURGUUxWTmxUMkV3ZGxGWmRIYxAB",
            "text": "Stopped by on a slower weekday late morning. We ordered 1 order of chicken and waffles a fruit cup and waited over 40 min! While we waited we managed to drink about half of our very bitter, low flavor cappuccinos and later found out... had ordered a $9 bottle of water!\n\nAssumed the chicken and waffles would be sweet with syrup, however surprisingly these were covered in gravy... didnt know because it was a special and only described as chicken n waffles by the server... no detail or attention to order by the server...\n\nNo Thanks!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WR0xVMVJUamh1VDBvMmR6ZE5kR3c1Y1ZkU1IwRRAB",
            "text": "Excellent services, the food was very good, definitely coming back 😋"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcmVreGtSWE5IUzBWQ2RUQnFPVVp4Y0VKbVZsRRAB",
            "text": "really nice food and a great atmosphere really good for people watching with so many incredibly fit elite New Yorkers who are probably members of the 0.1% good to see them in their natural habitat"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMFJYTklWV2RyVUhaMExUUk9MVll4YUVVMFpVRRAB",
            "text": "Cozy atmosphere, friendly staff and pumpkin walnut pancakes full of light fall flavor. The pumpkin flavor wasn't overpowering the dish. It was a nice and light. I love nuts so I was glad to see all three pancakes had a generous amount of crunch. The syrup gave it a nice sweet touch without being too sweet.  Loved the ambience and the staff were all very friendly as they checked to ensure all was well. I will be going back soon!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nNGFGQjJiMUZ0UVdOemQwZFVaMXAwT1RWRWNGRRAB",
            "text": "This place is well worth the wait. The food here is great. I love that they do first come first served for brunch on the weekends and the service is excellent as well."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sc1NFMXZiSFYzY1hZelRFcGpabFZqYWxOamIxRRAB",
            "text": "Friend of a Farmer is a lovely American farm to table restaurant with a few locations in Manhattan. The Gramercy location has a super cozy and dim lit ambiance that I love. The dinner menu isn't very expansive- there's only about 10 entree options and most of them are quite meat-y and heavy. I got the Terry Alan chicken which was unique and delicious. The chicken was stuffed with shredded apples and cheese, and I loved the combination. It came with an amazing citrus raisin sauce, mashed, potatoes, and lemon bread. The side of fries was perfect. I would return to try their chicken pot pie and have drinks at happy hour, but again there aren't that many options to choose from."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTlZqbHpSV1Z0WVV4elh6RklaRW95VTFFMlIxRRAB",
            "text": "Went to a Saturday brunch celebrating my birthday for a whole week, the complementary cornbread is great! Sitting   Outside is just great, their outdoor seating is one of best in uws"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNlJrTnZTVTV2T0hnNU9GZERaRmRJTjJoMVVGRRAB",
            "text": "Had a great time at Friend of a Farmer! We went around 6pm and were seated right away. The atmosphere is very nice and the staff is attentive. I got the lemon buccatini and it was perfect!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201aVZVSkJUMlJPYUhadWJUZzFkRWRvTFRoNU5HYxAB",
            "text": "First of all, amazing service and super friendly staff. Their cornbread was to die for and so were the pancakes and sourdough with eggs and bacon. Chill neighborhood and quiet spot"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWlpEYzFka1oyZVVoTVVXZGlOMDFEVjNKdVMzYxAB",
            "text": "Love this spot... a staple for me every time I visit New York for breakfast. Feels like you're walking into grandma's cottage and food is great like a warm hug"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abFp6SXhia0l5YjA1M1VtTnFlR3hvT1ZabmNYYxAB",
            "text": "To experience the feeling of dining in a farmhouse in New York City, is to experience dining at Friend of a Farmer in Gramercy Park. This place exudes coziness and warmth that fills your soul, meanwhile the delicious food fills your stomach. Great food that will leave you full and great drinks that will make you drool. I recommend making a reservation, but if you’re just in the neighborhood pop in and the kind staff works with you to secure a table. Visit with your friends and know you are all supporting locally and a family owned business!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cGJtOHRabHBCU0dka1ZsWnpRMUJMVVU5bVlWRRAB",
            "text": "In town for just a couple hours on a business trip. My buddy and I were hungry for breakfast and stopped in here. It’s a very simple diner, but had great reviews.\n\nThe food was really good and the pancakes were remarkable. The reason for two stars dropped was our waitress was pretty rude. Never smiled. Wouldn’t talk to us and looked like she hated being in there.\n\nOverall, the food was great with the service just sucked."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BNFprTnRlVW80TlhaVFFrNU9iMVYwYkhJMk1rRRAB",
            "text": "Blueberry pancakes were phenomenal. Krystina was great"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoa2VqTkVjMVp2VERWRlpYaEthV2RUY1hZemFuYxAB",
            "text": "Sitio super auténtico, cero turistico y la comida está riquísima"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NMFRHcEVVamhxYzE4dGIzWkNSalpMYUdoWVVFRRAB",
            "text": "My breakfast sandwich was delicious! Our server was very attentive and had the best vibes. The atmosphere inside is very old school and cute. Would definitely eat here again"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwblRGZG1OamhoZUc1ZkxWZFhOWEZKZWxkd1NYYxAB",
            "text": "The coffee and breakfast are some of the best I've had, anywhere.  Little error where our food sat too long and I had to ask why people sat after us had their food first. Otherwise, wait staff was excellent"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOZmFYTnVia1JqTUV0WmQzQjRkMU01VnpGWldYYxAB",
            "text": "Such a cute location! Love the chicken pot pie!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205cWJrYzVlRXh5VmpoM01XSmlNbUZEY1d4c1pIYxAB",
            "text": "This spot is true to it’s name, serving what I like to call a farmer’s breakfast fit with meats, eggs, potatoes, and some kind of delectable carb on the side.  I ordered the Boomer’s special which came with scrambled eggs, meat of choice, pancakes or waffles, plus home fries.  I opted for crispy bacon and the blue berry pancakes. When I say that everything was cooked to perfection, I certainly mean it.  Eggs were seasoned and tasted buttery, bacon was crisp as requested, even the blueberries in the pancakes were sweet and tender.  This was well worth the $27 platter price considering this city has lower quality brunch plates for a few dollars less.  I will note that extras, such as a side of the home-fries are an extra $9 for a little cup, but I suppose their profit margin is with drinks and these little side options.  My partner got the chicken pot pie and it was solid, but a little on the salty side and a little overly sweet with too much rosemary in the filling.  Probably wouldn’t order that again, but in general, this place seems like a well oiled machine.  Service was smooth and precise, not overly personal or warm, but we got water and food in a timely manner, and they checked on us at least once.  Decor is what some may consider shabby chic charming, but it was a little half-hazard and needed some editing on the second floor, namely with too many baskets crammed into the rafters, gathering some dust."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TFYwSlRZM2RyZFhOT01uQlRVVk5XWjJzMVEzYxAB",
            "text": "Charming spot for breakfast!  We had eggs Benedict which was delicious and the French press coffee was perfect!   The cornbread with apple is truly phenomenal!  Loved this place!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwT2FuQmpkVVoyYlc5cFpGcEpNMjFETURSMk4wRRAB",
            "text": "Great breakfast"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWUxYTndkREEyVFdOcU5FeGpabTFJY0dRMGFYYxAB",
            "text": "Vegan pot pie delicious but strange to be served with no sides no sides so would recommend a smaller pie but with vegetables on the side such as broccoli and carrots or mashed potato.\nService - one of our parties food came later than the rest.\nOther than that, lovely place. Would recommend and would come again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taTlRUQnVZWEJ5UXpodVNHUTFSMDVzTVVGVlMxRRAB",
            "text": "Staff do their absolute best to accommodate patrons. Gramercy area can be challenging at times when the weather is great and lots of people visiting. Superb service!\nPumpkin pancakes are my favorite."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdWJWVlROR0p5U0VsUVptZHRiMGRLV0daaVNuYxAB",
            "text": "Not ADA compliant."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RmMwaGlVR1pVWTNoM1ZsTmFNR3cxTWtFeGRYYxAB",
            "text": "Nice food and decoration. The person attending our table was not the nicest"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GT1RUWlNlRzV0VDFaWFVqTnlPRU00ZDIxV1IwRRAB",
            "text": "10/10 brunch spot. Great breakfast and lunch menu. Food is clearly fresh and perfectly prepared. My favorite is the wait staff. Attentive, courteous, and knowledgeable."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205blltOWtWWGxFYUVONVFuTm5NSE13TURGUFkwRRAB",
            "text": "Didn’t enjoy any part of this place, food is ok at best, service sucks."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aR1oycHVlV3RSV0ZsUlYzSTBhWGcxWDB0V2VIYxAB",
            "text": "Olenka was our server yesterday at dinner and she was incredible, a real rockstar. It was like she had a sixth sense for when we needed something. And she’s funny! Definitely coming back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kdmNFWXlRV05DTVROaVRuUmhOV1JNY1daaFRYYxAB",
            "text": "My best restaurant experience in NYC! My fiancée and I got dinner there last night, we had super fast service, our waiter was the sweetest, super engaging, and truly seemed to love his job! We even got a complimentary cornbread... which was amazing. We sat outside, our food came quick, drinks were delicious. The atmosphere was so fricken cute. 10/10 would recommend you take a date night here or stop in and relax on your adventures.. you'll be very well taken care of! Bathroom was super clean too!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twNFpucHNlbW90YkdscFJYQXlUMmRMZDNSS2VGRRAB",
            "text": "Shoutout to LOUIE H. who was our warm host and a friendly personality. He made astute recommendations and walked us through the menu. He was also extremely kind and ensured we had a wonderful time. The food was good as well, lovely environment, and we will be back!\nThe Barn Burger was yummy (thought cooked a bit more than a conventional “ medium” when we received it - so do confirm your preference with them), Summer Salad fresh and well seasoned, and the skillet cookie was a nice treat."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZNGFrMHdXamd0WTA5eVNsZzVlRGd4WjB4RmEzYxAB",
            "text": "Classic brunch spot with great food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzeVltdFNWak0wY2toVlpWcG1OSFJoVUZrdGNXYxAB",
            "text": "Nice place to get good cup of coffee and relax,"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSFRHdGlOR3RVVG1VeFNVZGFiM1pMTkU1V2NGRRAB",
            "text": "Miller, our server, is a gem :) Such great service. Definitely get the Shepard pie its life changing"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdU9IQldTMWxEYTFjeGNuUkNOMGN5ZDA1Qk1sRRAB",
            "text": "Cute interior and lovely vibes like its name. Food we ordered was delicious, could tell that they used good quality products. Service was extremely wonderful. Our waitress was friendly and warm, she was as well very attentive."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0clR6SkdRV2N3TWpsVU1YUjJkVjlIWVRoaE4xRRAB",
            "text": "Pancakes were really good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210eU0ySTNkSGN4YUZnNVVHOWZWblpzWDIxSFFsRRAB",
            "text": "Mima was absolutely wonderful – super friendly, fast, and made us feel right at home. The breakfast was delicious, and the rest of the staff was just as kind and professional. Truly a great start to the day!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKekxVZ3liVUZ0T1dneUxUSTBSMFowWXpjNVNHYxAB",
            "text": "By far one of my favorite places in NYC. Fresh food and unique selection. The staff is the best shout out to waiter Louise who has made our day! Always glad to bring new friends here. They become obsessed"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Odk1uVlNiRlpHZDBoaVdqVmxPRFZoTnpoRGIyYxAB",
            "text": "Mima is the best waitress in the NYC and the food was amazing! Thank you Mima🙏🏻"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGd1NEWlRVV28xUlRGV056bDZTamRUWTJGR1EzYxAB",
            "text": "Absolutely delicious. I had the arugula salad with chicken. It was very fresh with perfectly balanced flavors. We also had the blueberry lemonade. Delicious!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKV2RsTXphVTl1U21veVZqbFhjVlJZTldkRldWRRAB",
            "text": "This restaurant is overrated. Their apple pancakes were mid and overpriced. They were still good but not amazing. Where's the cornbread waffles I have heard so much about on the menu?"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSeWJHaDJaMEpoU204d05WcFllbUpGV2xkWU1IYxAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\n\nSuch a cute spot! The whole place is so pretty even upstairs feels like a little farmhouse escape in the city. The service was great too. We asked our server for some suggestions and she nailed it. We shared the pancake with lemon zest and it was really good. I got the country grain bowl salad with chicken and it was super tasty and full of flavor. Satisfying!!\n\nI’ll for sure be back and I totally recommend checking this place out. It’s a real gem!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKQ0tyS3lQbnFXTXVRRRAB",
            "text": "Outstanding brunch!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBNWJHRkNZa0pCZGtaQlYxOUdaMmxyWDFwdmNsRRAB",
            "text": "5 stars ⭐️⭐️⭐️⭐️⭐️\nFriend of a Farmer delivers something rare: a dining experience that feels both effortlessly elegant and deeply comforting. The space exudes warmth—soft lighting, rustic touches, and a calm energy that sets the tone before the first sip of wine.\n\nAnd then there’s Mitchell, our server—polished, intuitive, and remarkably composed. He didn’t just take care of us; he elevated the entire evening. His recommendations were thoughtful, his timing impeccable, and his presence quietly confident. Service like that doesn’t just happen—it’s an art.\n\nAs for the food: generous, honest, and beautifully done. The salmon, short rib absolutely hit the spot, the chicken deeply flavorful, was pure comfort, executed with finesse. Each dish had a quiet confidence, much like the service.\n\nThere are meals you enjoy, and then there are ones you remember. This was the latter."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdU4wZ3hUa1ZZZVU5amJITkxNMkpIV0VaWFZuYxAB",
            "text": "My favorite place on earth! I always come here to eat dinner the past 7 years. I decided to eat at the bar. That flight, did not disappoint!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLREItNkdueHZLekJnEAE",
            "text": "Have had FOAF on my list for many years and finally decided to give them a try.\nLuckily we didnt have to wait long for a table for 2 on a Saturday around 1245pm.\n\nHost was very welcoming, server was nice but forgot about our table for bit- we noticed that each table around us got a free order of cornbread as they waited, we never did.\n\nFood:\n-I ordered the boomer special with bacon and lemon pancakes. All were prepared nicely, crispy bacon and lemon pancakes although slightly wet were tasty! I did enjoy the potatoes but they were bordering mushy. Also the syrup that came with dish wasn't a typical maple syrup, it was quite nice but didnt have a chance to ask server as she was often MIA. Food arrived very quickly.\n\nDrinks:\nI ordered a latte but received a lukewarm cappuccino lol- I take my coffee seriously, so this was a bummer.\nHugo Spritz, was nice but tons of ice and light pour- less than one would expect at the brunch pricepoints.\n\nOverall, had a nice, enjoyable meal and even though there was a lack off attention from our server compared to others around us/other servers we witnessed,  would be open to give them another try (potentially their UPW location)."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwRFRuZE5hbTAyZUVvdGJtcFdRMEpEWDE5TWMxRRAB",
            "text": "Good food in a unique spot. Loved the interior design of this spot. We sat upstairs where it felt like an old farmhouse. The food was delicious with great flavor. The Terry Alan Chicken was familiar (pan fried chicken, mash, and cheese) but unique (apples and lemon bread) and overall great."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VOTHFwTENjLS15a29RRRAB",
            "text": "Location, location, location is what allows this restaurant to survive as its the perfect block with medium to low quality food and drink. The cocktails are horrendous, our table of 9 got every cocktail the menu offered and they were all unpalatable. Food was mid; appetizers were fine, salmon and bass were completely bland, the duck was overcooked, and the pot pie was very good (they have a nice pastry recipe). We ordered all the desserts, they were small and mediocre. Our waitress was nice, the staff was all very kind and accommodating. The place is very cute decor. Our bill came to roughly $100/pp."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VNRzZoT3Y1a3FxY19BRRAB",
            "text": "Food was not good"
        },
        {
            "date": "6달 전",
            "language": "ko",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcGFlRlhnEAE",
            "text": "It was the worst, we waited an hour for our food. The person who ordered 30 minutes after us got their food way before we did. The first time we asked, they said the chicken pie was ready, then when we ask them again, they said it wasn't. If you don't speak English, just don't go.\n\n최악이었습니다. 음식이 누락됐는지 주문 후에 1시간을 기다리고 우리가 주문 후 30분이 지나서야 주문한 사람이 더 먼저 음식을 받았어요. 처음 물어보니 치킨 팟파이가 준비 됐다고 하더니 또 와서는 준비 안됐다고 하고. 치킨을 직접 잡아서 오나요? 영어 못하는 사람들은 그냥 가지마세요."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1cElEWnhRRRAB",
            "text": "뉴욕에서 정말 유명한 브런치집중 하나\n클래식한 뉴욕브런치 드실수 있어요\n메뉴 정말 다 맛있고 유명하다보니 늘 사람많은곳입니다 그래도 서비스좋았구요 러스틱한 분위기에 깨알같이 2층 자리도 있습니다\n여기서는 오믈렛 꼭 드셔보시길!"
        },
        {
            "date": "수정일: 6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNrc3ZpaVdREAE",
            "text": "커피가 너무 맛있고 아쉽게 계란을 넣은 요리는 먹지 못했지만 프렌치토스트 너무 맛있었어요"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NTdDVDBnRRAB",
            "text": "Charming farmhouse vibes at this quaint restaurant with a menu that is mostly brunch options with some lunch plates. Chicken pot pie was very good, and I nibbled some of my friend’s pancakes which were also delicious. Service seemed a bit inattentive but overall decent. Great option for lunch!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNZUJfcXFQdnFLOGNREAE",
            "text": "Simply fantastic! The food was incredibly fresh, the service - exceptionally friendly and the atmosphere as beautiful as the interior. Highly recommended!\nI had the spring salad and absolutely loved it"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQdWtqc1RIdl82dG1BRRAB",
            "text": "Lovely experience eating here, service was great and loved the complimentary cornbread with apple chutney. Their farm fresh fried chicken was delicious, definitely recommend eating here!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNGV6aWlnRRAB",
            "text": "One of our best breakfast experiences in NYC! The food was incredible, especially the apple pancakes. The eggs benedict with salmon was so fresh and delicious, and the pot pie was cozy and rich. We loved the ambiance and service as well. It feels like you’re transported to a little grandma’s country kitchen in the midwest! I would love to come back here."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJazdtMlp3EAE",
            "text": "such an amazing experience. the kindest brunch staff, especially Braeson and Owen. The food was amazing, props to the chef on the cornbread. such a warm welcoming atmosphere! highly recommend for anyone looking for brunch or visiting the city"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnanB6aUxBEAE",
            "text": "What a fun brunch spot! Cozy decor and delicious menu options! I got apple pancakes with house-made apple compote, and my husband got the breakfast wrap. Both tasted great and service was quick. We were able to walk in at 11am on a Sunday without a reservation, which was also a big plus. Would return again!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcGNYMTJRRRAB",
            "text": "Good brunch experience, especially considering we didn’t have a reservation and there was a crowd waiting outside. We were a group of three, left our name, and were seated after about 35 minutes. The food was good, service was efficient—maybe a bit rushed for my taste, but understandable given the constant line."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMNUtPY1B3EAE",
            "text": "❤️ Overview:\nMy friend and I went here for dinner and overall it was a wonderful experience. Our server was very nice, the atmosphere was cute and rustic, and the food was yummy! My friend ordered the chicken pot pie and it was so yummy. If I were to go back, I would get that next time. We both love pot pie, but the short rib caught my eye, even though it was a bit pricy. It was yummy though!\n\n❤️What was ordered:\nFOOD: short rib, chicken pot pie, and fries. We also got cornbread with a compote on the house.\n\nDRINKS: Spicy peach margarita (special cocktail that day)\n\n❤️Stand outs:\nChicken pot pie\n\n❤️Would I come back/recommend:\nYes - I would recommend\nYes - I would come back"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNU51VnJBRRAB",
            "text": "Market omelet was very tasty, healthy, and made with farm fresh ingredients. The pumpkin pancakes were perfect. Portions were great & service was good. 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUMWJMWWRREAE",
            "text": "We had such a great experience coming here to celebrate Mothers Day the weekend after. When we walked in around 1pm for brunch, one of the servers bumped into my mom accidentally and unfortunately spilt some of the coffee on her skirt. We didn’t think much of it since it was busy and these things do happen. The host told us they couldn’t seat us unless the whole party was there and we were just waiting for my sister to arrive. So we decided to wait outside in front of the next door establishment. We were there for a total of 3 min when the the server who initially bumped into my mom with the coffee( Bryson) came looking for her with a cup of seltzer and napkin saying, “ I thought you left! I was looking for you! I didnt want you to leave unhappy. Let’s get this taken care of for you. “ he literally bent down and grabbed the first layer of my moms chiffon skirt and started to take the coffee stain off with the seltzer. My mom and I were both simply amazed by the consideration and prompt attention after the small accident. That quickly elevated our experience already. Then my sister arrived shortly after and we were seated to the covered front entrance in the left corner. We had the sweetest server, I don’t think I ever got her name but she was amazing. She recommended the burger, the chicken club and the breakfast option where you get scrambled eggs, choice of flavor pancakes, a meat option and hash browns. We ordered all of her recommendations and they all exceeded our expectations. She also brought us complimentary warmed corn bread with house made apple jam. Delish! 10/10 def coming back for more!!! My mom said it was one of her favorite Mothers Day brunch experiences. Thank you Friend of a Farmer. ❤️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJZ01QWFBnEAE",
            "text": "The staff + service was lovely, the food was divine, and the atmosphere was superb.\n\nHighly recommended for those looking for a cozy + quiet restaurant with delicious food on a quiet but amazing street! The outside is unassuming but you are wow’d at the ambience as you walk in!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcnBpRWhBRRAB",
            "text": "A fantastic experience! Fresh, seasonal food, passionate and knowledgeable staff members who put their hearts into their work all in a beautiful old English setting. We also appreciated the menu options that were a mix of traditional meat dishes but also many vegetarian dishes too! Thoroughly impressed and will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzN05YOUpREAE",
            "text": "I was truly impressed with the brunch menu selection at \"Friend of the Farmer\"—there were so many tempting options that it made choosing quite a challenge! I went with the boomers (blueberry pancakes), and it was absolutely delicious. The atmosphere is something special,  and the service was impeccable. Overall, it’s a fantastic spot for brunch. I absolutely love it!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dUxfMzVnRRAB",
            "text": "We had the Terry Ann chicken and toasted squash crostini, which I felt were exemplars of down-to-earth, quality culinary innovation. I really enjoyed the touch of stuffed Granny Smith in the Terry Ann chicken, which gave the breast an extra juiciness that’s often lacking in chicken breast dishes. Fantastic freshness with the squash on the crostini, too, which was evidence of true farm-to-table ingredients. The dessert, which was a pumpkin bread ice cream sandwich, took a while to arrive but otherwise was quite nice and homey. I would have given the experience a total 5/5 had it not been for the rather dim environs, and the tables felt a bit squeezy too. But all in all, great food, unassuming vibes and cosy atmosphere - highly recommended!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSb1lqVjZnRRAB",
            "text": "Still as great as 20 years ago. Fabulous food and great wine selection. I especially enjoyed a Pinot Gris from the Fingerlakes region of the state of New York. My salmon with Brussels sprouts was good too. There was also a delicious free cornbread appetizer with apple sauce. Attentive service and overall wholesome atmosphere. Great brunch options even on weekdays, such as Eggs Benedict with smoked salmon and French Toast. And nice outdoor seating on Irving Place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1NGNLNGV3EAE",
            "text": "I don’t know why I waited so long to try this restaurant. I loved everything about it from the decor to the food to the service.  They start with cornbread with an apple chutney which was great. We started with butternut squash crostini, don’t see it on the online menu.  It was delicious. I didn’t even know I was eating squash, the honey balanced the cheese and the squash sat on top.  The short rib entree was tender flavorful and comforting. One of the best I have had. I don’t eat duck but the person who got it also thought it was one of the best he has had and he has had many subpar duck dinners. We so appreciated our server’s recommendations. I was leaning towards the chicken pot pie and he said it was delicious but will never leave the menu so if we planned to return we might want to try something that could rotate off the menu, great advice.   Tried the special cocktail, was something with cherry juice and was a little too sweet for me but wine selection was nice.  If you want an eclectic cozy meal with great food I recommend this restaurant."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPc2N2TVNBEAE",
            "text": "Great spot for brunch. Everything baked there is delicious, they bring a little cornbread type dish as a complimentary appetizer and the bread is so sweet it tastes like cake. The whole wheat bread on the chicken sandwich was the best thing…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNheXZIUlJnEAE",
            "text": "My friend highly recommended us that Friend of A Farmer serves one of the best pancakes and corn bread in Manhattan.\n\nWeekend brunch reservation is not acceptable and there is always a long line by the entrance during brunch time, so we would suggest to come early to beat the crowd or make dinner reservations.\n\nAfter being seated, the staff served their signature corn bread in a skillet and it was surprisingly delicious and puffy. For entrees, we had their Chicken Pot Pie, Country Omelette and 2 Boomer Special with Pancakes.\n\nOur favorite was their pancakes and it was super fluffy and perfect with butter & jelly. The omelette was also decent with plenty of ingredients but the Chicken Pot Pie was just okay."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlN1pEQlFREAE",
            "text": "Had reservations for 6 pm and was seated promptly at 6. Atmosphere is dimly lit and quiet - great for date night and conversations. The drink my boyfriend got (Key to the park) was pretty weak and just tasted like apple cider but the food was great. He got the shepherd's pie and I got the vegan pot pie. Both were delicious and tasted home cooked. We also enjoyed the vegetable soup appetizer. Our server was great, friendly and attentive. Would like to return if there's a new vegan option added to the menu to try!\n\nUpdate June 2023 we tried the brunch this time and it was decent. I got the vegan scramble, personally too eggy for me, I like a tofu scramble better. I thought it was going to be like a chickpea potato mash kind of thing but it's actually like eggs. Otherwise it was good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6ME9TbEVBEAE",
            "text": "Came with my mom because we was coming out an appointment and neither one had had breakfast and as we was walking home we came across this place..... and if was a GREAT choose!! The food was filling and yummy,  drinks where really good let's just say \"is 5 o'clock somewhere\".  It was a nice mother and daughter breakfast.  The service very attentive BUT not on top of you.   When we came in they was nice with a smile even if they was busy still they gave us a nice greeting."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQbHJLRTZBRRAB",
            "text": "I have never left a negative review on Google but this shepherds pie was horrible. One of the most expensive item on the menu- $29, and it’s with no flavor, full of mashed potato, very little ground beef (and it’s super dry.) It’s lacking the definition of the top layer and the filling. Really just like eating a whole plate of unflavored mashed potato. Think twice if you are thinking about trying their shepherds pie. I would not recommend."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dVBqMklBEAE",
            "text": "Servicio excelente,buenas porciones. Buena presentación el lugar es cozy. Los benedictos estaban perfectos, no me encantaron mis papás un poco blandas para mi paladar. Los pancakes estaban deliciosos la mezcla perfecta. También probamos las mimosas muy buenas. Es un buen lugar para brunch."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBaTdMSmZBEAE",
            "text": "Really good brunch! There’s usually a queue but totally worth it. The layout is incredibly cozy and fascinating. The interiors makes you feel at home, the staff are very friendly, and more importantly the menu looks great. The food is cooked in a timely manner and presented beautifully. I would say the menu is different from the typical brunch menu. And that the French toast is very different to what you’d expect. It feels like a dessert. While I thoroughly enjoyed the menu, there wasn’t a single dish that had all the items I wanted. But the kitchen staff were nice and modified their dishes and served all the extras I had requested on the side (salmon and avocado). Lastly, if you don’t mind sitting at the bar, the corner area right by the fireplace is incredibly cosy on a winters day so I’d stay there"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubjhMVWtRRRAB",
            "text": "This place was on my list to try for a while. The idea of farm to table hearty food was very appealing and I was hoping it was going to be great. Unfortunately, it wasn't amazing. It wasn't bad either. Just ok. The chicken pot pie was nice, but it didn't have much chicken in it, and was mostly vegetables. The barn burger had great potential. I could tell the quality of the meat. However it didn't have any seasoning at all, hence it was pretty much tasteless. I'm sure many of the brunch dishes will be good, just not these two. All in all I was dissapointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyeDlETTFnRRAB",
            "text": "I went here once in ~2021 and liked it, but the place has seemingly deteriorated in quality since. The wait was slightly long but it was a Saturday afternoon, I expected that, not a problem. The host in the floral button down and the glasses was really lovely, he deserves all the praise!\n\nWe sat on the upper floor and I got the kale Caesar with fries, my friends just got fruit bowls and fries/home fries. It took about 30 minutes which feels like a long time for a simple order, but wouldn’t be the end of the world if the food was good. But the Caesar dressing was thin, almost watery, and the croutons were too small and too few. And then I found a hair in my salad— didn’t want to make a fuss so I didn’t say anything, but gross! The fries were good but I was still hungry afterwards. $19 for a poor salad is disappointing, and a $10 extra charge for adding chicken on top of it is absurd.\n\nOverpriced and disappointing. Maybe the breakfast is better."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNteW9uam5BRRAB",
            "text": "Visited this charming restaurant on Thanksgiving day. Enjoyed a delicious 4 course meal. Corn chowder, veg casserole, turkey with all the trimmings, and apple pie and ice cream. All the food arrived piping hot, and we devoured each course - so tasty. Service was very good, restaurant was extremely busy but we never felt rushed. Set in a quiet street about 5min walk from Union Square. Would definitely return next time we are in New York"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLa016M3B3RRAB",
            "text": "The outdoor dining experience here was excellent.  The staff could not have been more friendly and efficient. The outdoor setup was so well decorated and the environment was warm and inviting.  It was pouring rain yet we were warm, dry and…"
        }
    ],
    "reviews_count": 79
}