{
    "name": "Fumo Kips Bay",
    "place_id": "ChIJR0DxVQhZwokRY4vlDg_TZMI",
    "grid": "MN6",
    "address": "415 3rd Ave, New York, NY 10016, USA",
    "rating": 4.4,
    "user_ratings_total": 309,
    "phone_number": "(347) 332-6866",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OeFdHbFdPRk5mY1d0VU0xWmxaMGR6TVc1c1kxRRAB",
            "text": "Tonight we were there for dinner First I asked the waiter Mario to please not bring the entrees until after we finished the apps We were half way thru the apps & the entrees were served They never refilled our water glasses or asked if we wanted more wine or drinks The food was mediocre Our waiter Never came around to ask us if we we’re enjoying everything They dropped off the check & didnt come over to collect the money even after the manager told us that they needed the table My wife got up & walked over to the group of waiters to give them the money ps all this was going on while we were still drinking coffee This place is not organized or managed properly"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CT1pHYzFkMGhVTmpCMU4xUktWa0ZQUVdVMmJrRRAB",
            "text": "attentive and considerate service. swung by for a quick lunch with a friend.\n\nwe were seated immediately and offered a bread refill 🥖! we started with calamari; i ordered the penne vodka with meatballs and my friend ordered the parm hero paining with meatballs.\n\nwe'll be back there for lunch 🤩"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GMWJtczNRaTEyUVZkc1YxaDBkV2RoYzJ0RFRtYxAB",
            "text": "On a Monday night, the restaurant was packed with the food was nice. I got the calamari and the sausage rigatoni and the Amelia cocktail. However the lighting was very very dim and only a tea light on the table to illuminate your table and you were kind of eating in the dark. I would recommend to visit during the day where the light would be natural, but the food was very tasty and the server was very attentive."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoaldqQm9PV1pRT0hoSldUZzVOa05DTTIxNVZGRRAB",
            "text": "Very rude manager. They added meat to my food even though I didn’t order it, and when I pointed it out, the manager handled the situation very rudely."
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SWmNUZ3hibkpYWlc1VU1HSmpjRm96VjFWQlJrRRAB",
            "text": "La mejor  comida  exelente"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oa1YxRnpNakF0VkZKaU1FNDRhVEJyWTFocWJFRRAB",
            "text": "It’s good. Simple"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kdmVubFZZMEl6WTJkRmR6UkhUMlJsTmpKSFdsRRAB",
            "text": "Great lunch spot and served our larger table quickly during lunch rush"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKc1dXa3hkVWxKUXpkSU4wWk1YMGw1Vm5kUFVuYxAB",
            "text": "excellent food, atmosphere, and service! the $12 pasta is unbeatable. all the pasta dishes we've had were amazing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210eGEwWlVNbkpCUlVwRGEyTllUVTVLTkZkeE5uYxAB",
            "text": "Great place. Just found the wait time to be insane for what was ordered so I observed that pasta and salad came out quick. Anything else will be more than the usual 30 minutes so not great place for lunch. Otherwise, it is."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wTlNHeHBVV05mZEZKd1ZqSjFSekJETTFsWmJYYxAB",
            "text": "Very happy that I turn my face out of the phone and find a sing that says “Pasta $12.00”. My food was full of flavor and ingredients. Very generous portions, great Italian beer. Highly recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwS1NsbDFSbnByWDA1VVVGWkdiRTgwVTI1WVFuYxAB",
            "text": "Service and food wasn’t good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taNE9GOWZZVTF3TUhoRVVtTjJWbTlaU1MxZlRIYxAB",
            "text": "The best penne vodka with chicken 🥹…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWk5tbzNVVEU0VFc5Uk1tTkxhR2xuVlVoeVlXYxAB",
            "text": "Classic Italian well priced and easy"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paYU5rSjBaRll4V1ZCQlducGtZalpyVUVWdmMwRRAB",
            "text": "Very good pizza, pasta, and tiramisu. Service was friendly and space was nicely decorated. Overall, lovely experience."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsYWMxbExMVU14UW1aQ2JrRkVkemx6ZFVac2NrRRAB",
            "text": "Excelente servicio de parte de Leo y Frank, fue mi primera vez degustando la comida de este lugar y sin duda regresaré mas veces, pedí que me hablaran en español y fueron muy amables en poder hablarme en español\nExcelente servicio... 👌"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxUlVXbHJMWFZhTm5kMFh6UTNaMll5TlVKQ1JsRRAB",
            "text": "As much as I like a dimmed and cozy place, I found this place too dark. I loved the food, but I can't tell you what I was eating.\nThe service was excellent.\nThe pasta sauce and fried calamari sauce was excellent.\nWe also had a gluten free pizza which is much appreciated, but it was more on a very well done side.\nU would go back on my next trip to NYC."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sU05HOVFabGR2ZGs1RGRIcFVkV2xUVmtsNFMwRRAB",
            "text": "Large portions for great value pricing - spicy calamari was actually pretty good and the meatball pasta was nice too. Outdoor seating is a vibe."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wT2FFeDRWRXBvUjB4eFdrcFZaR2RoU2tKSmFXYxAB",
            "text": "Delicious pizza and tiramisu. Pizza sauce had a good natural tomato flavor and had a nice balanced profile. The crust was a thin and crispy with a perfect doughiness to it, giving a perfect bite every time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5YVZsVlNWRWRYT1MxZlYwaE9iME5aY2taQlRtYxAB",
            "text": "Great neighborhood spot. Meatballs and grilled chicken parm were excellent."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWclEwMUJORVZaY0ZCeWJYSnZiVXB1YUVWWlptYxAB",
            "text": "I genuinely enjoyed my dining experience here. The intimate, rustic atmosphere is beautiful and very charming, without being pretentious. It’s a very welcoming space. They were also playing great music that everyone loved. Staff here is amazing. Not only are they kind and attentive, but you can tell they actually like working there, get along well and are like a family. I even saw a few of them sitting together during their break and eating. It’s always a good sign when you see restaurant employees eating food from the restaurant itself. My cocktails were yummy, especially the Carolina. My steak was flavorful, as was my spicy calamari. I’ll definitely return if I’m in the area, or give one of their other locations a try. I highly recommend, especially because of the overall vibe of the people here. Best hospitality and workmanship I’ve seen, not to mention solid food and tasty drinks."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWVdtbEtUR2cxUTFGMGIwMUpjVWRLZEZwbVNsRRAB",
            "text": "Zero stars if I could. The food was HORRIBLE!!!! They served me spoiled chicken  in my chicken carbonara dish, as if it had been rotting for weeks. Only one of the workers were sincere about it. The manager dismissed me and wanted to argue with me said I don’t know how to cook and “every restaurant does it this way”. Save money and eat somewhere else."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVVptSllSVkZzUWxsR04zWmhaWEZ1UVRjNWJWRRAB",
            "text": "Great lunch and drinks specials !!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeU9VMDVRVkZLVEZWSWNFNUNlbkpHWVY5UE9WRRAB",
            "text": "WORST penne vodka I ever ate. This restaurant brings shame to Italian food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wb1NFZFVRalZtZUV4aGRHcG1MVWRJU1RGUlNXYxAB",
            "text": "Extremely poor dining experience at this establishment. The hostess and staff were some of the least unprofessional restaurant staff I've ever encountered. Management and staff alike need to be overhauled. Do NOT waste your money supporting this business, especially if you are a person of color."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wb1NGbE9WVFYyUjFVMlZucHVXREpGVkMxaFlXYxAB",
            "text": "The food was great, but I left feeling uncomfortable. As a Black/Asian woman, I was seated in a hidden back corner of the exterior of the restaurant, despite several open tables available at the front. Upon arrival, my server looked me up and down with a mean/judgemental demeanor. I was dressed nicely in business casual attire coming from church. I didn’t think much of it at first, but when I finished my meal and walked out, I noticed that every other customer--who appeared to be non-POC--was seated in the front section.\n\nMy server, a white male with round glasses, was friendly and attentive initially, but I waited 15-20 minutes just to receive the check, which felt unusually long compared to the pace of service around me.\n\nThis experience left me with the unsettling impression that I was treated differently, and it overshadowed what would have otherwise been a great meal."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WNk1XZHFTVzV5Y0RCbFRrdHlOM2cwVlRaclJFRRAB",
            "text": "Awesome $12 pasta deal on Sundays after 4pm (as of 7/2025)!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FeGJqQXROMVEyVkhod1VVWnVTREJDVVVKdlUyYxAB",
            "text": "Just passed by the restaurant and decided to dine in. Best decision we made. The food is delicious , portion is great and will definitely come back. Love it. 😍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205bWRtNUZkRXczWWtaaFZIaG1jbEkzWVRkVldIYxAB",
            "text": "Amazing pasta!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCclVYWmhNRVZzV1dGWmRtRm9PVmMxWHpONVgwRRAB",
            "text": "Came here for a reunion with a large group of people (12). Reserved in advance and the staff were very friendly and nice throughout the reservation process and in person. We ordered a range of food. Pictured is the Penne Funghi with added chicken and the Seared Salmon on a salad. The portions are fairly large and it was delicious. Will definitely be going again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOd2FWOXJOMlpVWmpreWNVbG5iakpQWWxkUlNYYxAB",
            "text": "We brought a group of 15 (was supposed to be 12).  The food exceeded my expectations  in terms of quantity and quality.  The staff and management was gracious and flexible.  Thanks for a great evening!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21weVVXa3dVRUowYkhWcVN5MVNlbXRyUW01YVYxRRAB",
            "text": "my favorite place! has great deals and amazing pasta. rené was our server and he was amazing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkcE9YaFdMWFJHU21kQmVtTTBhMFpMZDBaMmRGRRAB",
            "text": "We went during a particularly busy night on a Friday. The dinner was amazing. We had pasta and vodka sauce pizza- which both exceptional. We also ordered the avocado salad and mocktails which were amazing too. Would definitely go back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnNFJUaGhOV1pyWDFWWFYzUlRlVGRvWlZWcVduYxAB",
            "text": "Visited new york for my first time. Tried several restaurants but this was my favorite! The food was great, portions were good, service was quick and to top it off it was my birthday and they went over and beyond to make it special!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5U2RIUklUMmhPWm5ocmMybDJUM2xmVTAxamMxRRAB",
            "text": "Pasta night was delicious! Could eat there everyday!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210YWRrbzJabXRLYTJGb2RVdDBhR1kwWmxodlIyYxAB",
            "text": "Absolutely horrible food and service. I went there last week for a date night first of all when the waiter poured water he spilled it all over the table, it’s ok working in this industry is tough and I always respected waiters and waitresses. They bring the food and it’s absolutely awful, cold fish and dry pasta that was left in boiling water for a day. The worst part is I haven’t finished my plate and this short guy comes to get my plate and spills my full glass of wine that I ordered all over my clothes. He leaves with no apology, or an apology from the manager. The least I expected was a I’m sorry but this totally ruined my whole night planned. Oh the worst part, besides not only charging us full price, they charged us double for the wine I barely had a sip of. I had to him correct the extra wine they added. I would absolutely avoid this place and go somewhere else so you can get the service you pay for."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGeFYwTlNTMUJsWVcxNloxazVjWFZIV1cxSU5GRRAB",
            "text": "The lunch deal is great but wow the food is bland as hell like Italian food is garbage"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJV0MtN3lKNjZHeG1BRRAB",
            "text": "Lots of gluten free options, penne alla vodka and flatbread were delicious! Chocolate mousse cake was really good too. Loved the ambiance and music"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VObWMxWV9wdWJ1STFnRRAB",
            "text": "I had the most lovely dinner at Fumo. The food is authentic and delicious, the staff is friendly and knowledgeable, the atmosphere is the perfect combination of “vibey” and classic clean modern Italian. Would come back with a date or a group!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOVG93ZV91eGEzcHpnRRAB",
            "text": "Delicious Margherita Pizza! Perfect spot for a date night."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQbnA5N0NYN3FfbHlRRRAB",
            "text": "I came in on a Monday around 3pm, It was quiet and calm with a few people dining in. Waiters are so attentive and attractive might I add. I ordered wine but I didn’t like it and the manager took it back with no hassle! This location unlike the other locations has a happy hour for drinks from 4pm-7pm which was cool! I ordered the Spaghetti Vongole which is my favorite for only $12 because I arrived before 4pm, the noodles were perfect and made with a generous amount of sauce which is a plus for me! I came to this location last year on a date actually and sat at the bar but I’ll defiantly be returning for some quiet, chill alone time - I love FUMO‼️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKYjVtZVBmbnBldzFnRRAB",
            "text": "Pretty good! HIGHLY recommend the pesto pasta. Just a regular solid spot imo, nothing rlly stood out. Service felt rushed, not the worst. Vibes were good :)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGQk0wMTFRWFZpY0RKeVdVaDVPSGs1VlVzNFJsRRAB",
            "text": "Blasting Rap music at an 8PM dinner service. The waiter… wouldn’t know him, since he was only at our table to take our order after 20 minutes of sitting there. I’ve had a better chicken parm at the Olive Garden. Overpriced and overrated. Wouldn’t recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLVGYxdktrdXJiYXlRRRAB",
            "text": "Joel B was a fantastic server! Had a great time having lunch here at the bar. The latte was so good & cute too, and the food was delicious :)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMemFzWXlYaWFIYmdRRRAB",
            "text": "Bololgnese,,, perfecr"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPLWF6dWpPallqQU5BEAE",
            "text": "Food was really excellent! Service was good and we had a lovely night here!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPV2FrSkx4c2N2cXBRRRAB",
            "text": "Stopped in w/a friend to grab a bite at the bar before seeing a movie. Had a few apps (spicy calamari, truffle fries, salad) and the fumo spritz (happy hour) and it was all very delicious. Our bartender was great and I would definitely return."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNGNDU2N3EAE",
            "text": "Really great service, drinks, and food. The waiter was attentive and very nice. The food was delicious as well. Will definitely be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNXJ2VjRnRRAB",
            "text": "Great Food...small place so staff all over the place."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZak9ETEdBEAE",
            "text": "Stumbled in on a Thursday night where they do half off all wine bottles and was so fantastic! Sat at the bar on a perfect night with the all the windows open. Bartender Sawyer was so great and food was delicious"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvajRlSFh3EAE",
            "text": "Such poor service in our neighborhood; tried twice to get in. First time no reservation and staff just plain rude. Had reservations over the weekend and they just couldn't accommodate us, showed little concern and wasted time thinking…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQNE1yWlJ3EAE",
            "text": "I recently dined at Fumo, an Italian restaurant in Kips Bay, and overall, I had a fantastic experience! The ambiance was inviting and cozy, making it a wonderful place to enjoy a meal. The service was exceptional—attentive and friendly, which really enhanced the dining experience.\n\nAs for the food, the flavors were delightful! I particularly enjoyed the pasta, which was not only delicious but also incredibly affordable, making it a great option for anyone looking to enjoy authentic Italian cuisine without breaking the bank. My only minor complaint was that the clams were a little undercooked, but that didn't overshadow my enjoyment of the overall meal.\n\nI left feeling satisfied and excited to return for another visit. If you're in the area, I highly recommend checking out Fumo for a lovely dining experience!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMThTaVVnEAE",
            "text": "I highly recommend this restaurant. It's even better if you show up on a Sunday or Monday after 4pm and get their 12 dollar pasta. It's a really great deal and tastes amazing.\n\nThey give you free bread. We ordered garlic bread as well and it did not disappoint. I would definitely come back here again."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbGJTUnBBRRAB",
            "text": "I’ve passed by Fumo countless times and had been wanting to try it for years—finally, I made it in and it did not disappoint! Their $12 pasta deal on Sundays and Mondays is a steal. The pasta is packed with flavor, the portions are generous, and you really get your money’s worth. Plus, they still serve bread (which seems rare these days at Italian restaurants), and it’s the perfect touch to go with the meal. Definitely worth the wait, and I’ll be back for sure!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRb1pLWkdBEAE",
            "text": "I had an amazing lunch today; the food was incredibly delicious, the restaurant had an elegant ambiance, and the staff were both handsome and very polite. What's more, their lunch special was only $12, which is really friendly pricing. However, I didn't leave a tip because I wasn't sure how to do it at the time. I only figured it out after I left, and I feel quite embarrassed about it. I plan to go back there to eat in a few days, please be nice to me, ahahaha🥹"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibFllRTRnRRAB",
            "text": "Had a very mixed experience here. Personally, we experienced non-stop issued but in the end our meal was comped which I thought was fair. So it’s hard for me to give an opinion. I plan to come back and update later on but below was my experience.\n\nHad family friends visiting so I booked this restaurant for Friday at 7pm. It was raining heavy so we were hoping for an indoor table. We arrive and the host says there are not tables indoor available and we would have to wait for the people at our table to leave which would be an additional 10 minutes or more. Our other option was to sit outside. We asked if we would be completely covered and not get wet and they said yes it would be completely dry. We sit outside and within minutes we are practically soaked. So I ask if we can be moved inside to the table they reserved us. They told me that they already gave the table to someone else and it would take hours for a new one. So we already started off on a bad foot. Luckily, the rain started to lighten and wasn’t that bad. But it was terrible at first since rain was blowing all over and dripping on our backs since there is a gap between the cover and the wall.\n\nWe order and a while later they come out and tell us they don’t have pizza anymore due to the storm so those who ordered pizza need to reorder.  So we reorder different things. The new things we ordered came out 10 min before the rest of the dishes so it was not optimal. When out dishes finally came out, mine was missing the chicken that I ordered so I had to wait even longer for that.\n\nIn the end, the food was good and meal was comped. I do plan to come back and hopefully have a better experience"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfeXBIdXd3RRAB",
            "text": "Amazing food and great portion size for the price. We got the vongole and funghi pasta and they were both very very good! We got the $12 lunch special!\n\nAmbiance was very good and the restaurant was very clean and spacious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5ZzZ5aDN3RRAB",
            "text": "Top notch experience from our greeting at the door by Ashten, to leaving after a scrumptious meal. The decor is new, lovely and relaxing. Sautéed calamari was a particular favorite, mushroom pasta and burger as well. We look forward to trying more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNia3B1M0l3EAE",
            "text": "wowa delicious pasta! I ordered the spaghetti carbonara.\n\nThey have a lunch menu during weekdays 11am to 4pm with all pastas priced at $12. Portions are *extremely* filling (barely finished) and their interior vibe is nice too, though they have outdoor seating.\n\nApparently they give out toast along with the pasta, but we didn’t get any for some reason. Nearby tables left and right of us both received toast. Neither did we get the cheese grind onto our pasta.\nEntire restaurant had one server overworked(?), but he was nice regardless.\n\nDon’t know if pasta is supposed to be this oily too, but I can’t lie it was yummy overall."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqM05YYnRRRRAB",
            "text": "So good that we had to go back for seconds! On our first go we had the PENNE FUNGHI (Wild mushrooms, marsala cream, truffle oil) and the BAKED ZITI (Herbed ricotta, mozzarella, Pomodoro). Extra parmiggiano, per favore! For our second turn we had RIGATONI ALFREDO and SPAGHETTI CARBONARA (Smoked bacon, onions, peas, cream). Everything tasted absolutely delicious and the service was spectacular. Would go back any time I'm in NYC!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqM01iLU1REAE",
            "text": "Simply beautiful welcoming, always full of happy customers, delicious focaccia, wonderful spinach salad, very well designed wine list. Unbelievably priced. You Must try this place is Super delicious. Definitely a place to go back.\n100% a place that you have to try. Wait till the nicer weather, there will be seating out side. Wait I forgot about the baked clams! Absolutely fantastic!! You won’t believe the quality and taste of this food! If you close your eyes for a minute you think you are in Italy. You feel hugged, comfortable, happy! By your self, with your significant other or bunch of friends Fumo Kips Bay will always deliver."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bWItcHF3RRAB",
            "text": "Surprisingly impressed with this spot. The location is prime, and I’ve now ate outside twice. The food is very good and the menu has a lot of options from salads to burgers to italian classics. The servers always seem scattered; if they bring one thing they forget the other."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5eklUWXFnRRAB",
            "text": "$13 Pasta is a steal!!!! Service was really great, recommended the dishes which we ended up loving!! Penne with vodka with fried chicken was delicious. Baked ziti was hearty and very heavy!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2czl6elNBEAE",
            "text": "Amazing food, and a more amazing service.\n\nEverything was on point, the servers were super nice and attentive, even the owners were there getting customers.\n\nThe food was insanely good and very reasonably priced, we went during lunch hours and had the $12 pasta (Rigatoni Bolognese, Penne Funghi) and they didn't disappoint, the portions were huge, it was loaded with meat and it sure was delicious🤌\n\nIt's also very close to almost all attractions and in a very central area of Manhattan.\n\nIt's a pit stop for me every time I visit now. 🫶"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibTdpa0RREAE",
            "text": "Great pasta happy hour deal on Sundays and Monday - good food and good portions! Tristan, our waiter, was also super friendly and made it a great time. Def will go again to try different pasta & the penne vodka was a personal favorite"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIbDZidld3EAE",
            "text": "My friend and I went for the first time and it was a good experience. Our server was Elijah and he recommended our pastas and it was delicious. I would recommend and come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbDdXd1JBEAE",
            "text": "The experiences I had in this restaurant got worse each time. The first time I ordered from them was sometime last year, over-the-phone takeout. The woman taking my order wasn’t paying attention to the simple order I placed for myself - one person - and I had to repeat it. The second time, I ordered takeout in person with the hostess and things were OK. The third time, I went in person to order takeout and the same hostess was ditzy and assumed I wanted to order the same thing as last time when she should’ve asked. You can’t assume a customer’s going to order the same thing every time. The fourth time was Friday, 10/18/2024, when I went to the restaurant to show them a picture of what I wanted - fried chicken breast over penne pasta with pasta sauce - and I got the nonsense in the picture below, instead. They charged me over $30 for this small plate where it looks like whoever made it doesn’t know how to cook. It had too much garlic, not enough pasta or sauce and the small portion of chicken was chewy. I was disgusted. I threw it away and was hungry for the rest of my shift. The perception was this restaurant cares more about customers dining in than those ordering out. I’m appalled at how much service and quality has gone downhill in NYC and needless to say, I won’t be returning to this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkNHJQS3lBRRAB",
            "text": "I had the spaghetti lobster fra diavolo. It was the first time I had this kind of spicy pasta/spaghetti -- wasn't expecting it (my fault for not googling the dish before ordering 🤣). I'm able to handle spicy foods just fine -- and I think overall this dish was good -- but I think the strong spices slightly overwhelmed the lobster meat. I suspect I would not have given a 5 ⭐ anyway, but likely it would have been a 4.5 if it had been slightly less spicy.\n\nAtmosphere was nice. It was 6:30 pm on a Saturday. The place was lively -- I think most tables were occupied. I was at the bar. By the time I finished, the bar was also getting full."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWN0tHbW9BRRAB",
            "text": "Ordered two pastas, the pesto (with rigatoni instead of spaguetti) and the penne vodka with chicken, which was sooo good, in my opinion. Both pastas were served extremely fast. The pesto tasted too much of parsley and nothing else. The service was great!\n\nPedimos la pasta pesto con cambio a rigatoni en lugar de espagueti y el penne vodkacon pollo, el cual estaba delicioso. Ambas pastas fueron servidas extremadamente rapido. El pesto sabia mucho más a perejil que cualquier otro ingrediente en el pesto. El servicio en la barra fue increible!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUc2FqSmZnEAE",
            "text": "It’s one of those places you didn’t know how great the food would be until you go in and try it. Spaghetti carbonara was 10/10 for me. The service was kind of slow. Overall, it’s a good place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkcnJYVmdBRRAB",
            "text": "This is a great intimate Italian spot in Kips Bay.\n\nFood: They have a lot of great options on the menu. We shared the rice balls and they were delicious. They came out fresh and hot and were well seasoned. I got the penne vodka and added mushrooms to it. It was really good. Felt like a home cooked meal. The mushrooms were perfectly cooked and the pasta had a good amount of sauce.\n\nPrice: Everything was very reasonably priced especially for the portion size.\n\nAtmosphere: The restaurant was dark and intimate. Feels like it would be a nice date spot.\n\nSide note: Fumo is on Seated. If you don't have Seated, I'd recommend you try it out as it gives you money back for going to certain restaurants. If you use my code, you'll get $10.\n\nInstagram: @TheShahLALand"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibXJPemNnEAE",
            "text": "If you don’t go to Fumo, you might get FOMO! The food was reasonably priced with HUGE/LARGE portions!!! It is very packed and busy on a Thursday night, however my wife and I did not have to wait for seats. How lucky can one be!? The only time I felt luckier was when I met my wonderful wife! The only not good thing is their bread is cold. Nobody likes cold/frigid bread. Not warm bread is not it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bnUzVEl3EAE",
            "text": "Had the brunch burger and it was delicious! Nice to see places that still ask how you want them done. Don’t even have a picture because I ate it so fast. Service was excellent and Leo the bartender was so nice. Will be coming here again!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6dG9MOHl3RRAB",
            "text": "Saw this place on TikTok about their $12 pasta lunch special and decided to suggest it to my coworkers for lunch. I got the rigatoni bolognese and it was amazing! For $12 you really get a nice portion and I love that the meat sauce was VERY meaty. I had that and the bread that they give and I was full. I also got a ginger ale which was $3.50 so in total I paid about $23 including tax and tip. Very good deal if you’re looking for affordable lunch spots! Would definitely come back and try their pizza."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURicTRYTWVBEAE",
            "text": "Elijah was our waiter and he was fantastic! The food was so good and the happy hour specials were great. I got penna alla vodka and I'm a big penne alla vodka fan and this measured up to the best of the best. 10/10 recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqX2IzdWN3EAE",
            "text": "Absolutely LOVE Fumo !! Specifically this location as well. The staff are always on their A game and super sweet and welcoming. The happy hour is the best and the pasta itself is always delicious. I highly recommend this place when you can have both good eats and also good service ! It’s a small place yet a very good one."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUa3Ryek13EAE",
            "text": "ambiance and aesthetics are great. good location. drinks are okay. i got the chicken blt. i ate half the blt as served, and then deconstructed it for the second half because i’m watching carbs. the chicken is a bit salty on its own but i guess it makes sense in its full sandwich form. drinks shown are the Mule and the Amelia"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyc29fX1JBEAE",
            "text": "Really great pasta deal here. I had the spaghetti carbonara and it was flavorful and Al dente. $12 bucks and the portion was good. (Lunch only)."
        }
    ],
    "reviews_count": 77
}