{
    "name": "Leonetta",
    "place_id": "ChIJ9yGlMQBZwokRoPZF09LClXc",
    "grid": "MN6",
    "address": "181 Lexington Ave, New York, NY 10016, USA",
    "rating": 4.5,
    "user_ratings_total": 206,
    "phone_number": "(646) 448-4288",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMmEwd3lVWFpJVFhWTFJqaHZXVW90VTFabFUzYxAB",
            "text": "Disappointing experience. Food was on the whole nearly inedible saved only by the attentive service."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBeE4xaGxNV1JPVGtoS1dYTjBiVU5pUlZaWlUxRRAB",
            "text": "Food here is outrageous, best meal we have had in NYC visiting for 5 days. Service also fantastic."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkV1gwRkNjRVpzTURWMWRFVXRaMWhwUVRFdFVrRRAB",
            "text": "I was at this popular Mediterranean restaurant a couple of months ago with one of my usual groups. The space inside is very nice, with good lighting, and the service was also good. I was there early, as it's near my workplace, and I started with a cocktail from their large bar. I went with the Kiss The Ring from their \"negroni style\" section for $19, which had Harelston green blended scotch, amaretto Lazzaroni, Heirloom pineapple amaro, toasted almond bitters, and salt. The drink was well-balanced, being bitter but not too much, with a touch of sweetness and a very slight bite from the scotch. I think it would work better with a peatier or stronger scotch, but said drink worked well overall.\n\nOnce the group arrived, we ordered a bunch of dishes to share. The first dish that arrived was our sole appetizer and one of my favorites, which was the Stuffed Pita \"Spanakopita\" with spinach, leeks, feta, and sesame seeds. There is a choice between a $10 small one and a $16 large one, and we went with the latter, and honestly, even if you were in a smaller group, I would recommend the larger size. The inside had a good vegetal flavor from the spinach and leeks, while the pita was warm and soft. I guess the only complaint I could make is that it was perhaps a bit salty, but that's partially expected for a spanakopita.\n\nWe also got two pasta dishes, and they were very different from each other, not just by price but also by richness. I had a slight preference for the Mezzi Rigatoni, which was the cheaper option at $28 with braised lamb ragout, green olives, chickpeas, pistachio crumbs, and feta cheese. The pasta was pretty solid with some pieces of tender lamb within said ragu, with the olives and feta adding a unique saltiness (almost too much so,) while the pistachios added a fun crunch. This was an interesting dish, reminding me closest in terms of Italian pastas to a couple of dishes at the close by Norma Gastronomia Siciliana, though I preferred their pasta texture.\n\nThe Black Truffle Mafaldine, for $45 with wild mushrooms, mascarpone, and parmesan, was our other pasta dish. The price point honestly makes sense, as this is big enough to share for two or three people due to its richness. This pasta had a better texture, being more al dente, though it was a bit more one-note in terms of flavor and texture. If you're looking for a heavy black truffle-focused pasta, this is a good option, but it's not my personal preference.\n\nLast was the alright Pork Shank Shawarma for $62 with pita bread, house pickles, and 6th Ave white and red sauce. The pork shank was massive and was almost a bit too crispy, making it a bit hard to break into. I appreciated the za'atar on the bread as the little bit of sourness from said spice mix helped with the rich pork. Their take on white and red sauce was pretty standard, with the former being a light tzatziki and the latter being mildly sour with a bit of heat. Again, this would be good for sharing, which makes the price much more reasonable, but I didn't personally love this dish either for similar reasons as the mafaldine.\n\nOur only other small plate was an added side, which was the Baharat Roasted Mushrooms for $16 with sour cherries and cipollini onions. The dish was small, even as sides go, with the dish having a surprising amount of sweetness for there being sour cherries, which was presumably from the baharat spice blend. This was unique at least, but I wouldn't order it again.\n\nThe food here was interesting. We started on a very high note, though I would say that the rest of the dishes weren't as strong as our appetizer. The food is unique enough, though, that I would probably recommend it even if I personally didn't like certain dishes as much/would go back and try things that aren't their pasta."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SbGRHUnlTME52VFdwWlJGQnJkbUZXYjBOVmExRRAB",
            "text": "A fantastic dinner with top notch service. The space is beautiful. Cannot wait to go back again!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWalZEUk1ZMEZCYzNocExXbE5aVkJDTmxKV05rRRAB",
            "text": "The food here is really mediocre. They try too hard to make it different and it just messes up the essence of the dishes.\n\nTables are crammed right next to each other so you have absolutely no privacy. You can hear all the other tables conversations, which makes it very awkward.\n\nPrices for deserts are absurdly high. $16 for a small bowl of pudding is absurd."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWWVVZDNlVXh0WW5FMlQzVjNRMmhDY1RkRk1uYxAB",
            "text": "Not only is the restaurant beautiful, but the service was truly the best I’ve ever had in a New York restaurant, Rose was the best and the most knowledgeable about all the plates on the menu. The food was delicious and would definitely come again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KMFMycDFka05UVEVjMVNUTjFhR3BzUm5oSGJVRRAB",
            "text": "This people steal from you… I went three days ago and a man with a beard… kind in his thirties… was our waiter. We sat down at the terrace kind of situation and basically at the end of the meal (which was not great at all) he charged me everything in my card even tho we told him that we were paying in different tabs. He told us that he void my payment but was not true at all… he charged me again and charged my friend as well. Now I have two transactions of this place and never was refunded like he said. Don’t go to this place. Food is bad and the service mediocre. Hate it hate it! Never coming back. Trash."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oeVZrVnJlV2RKT1RZNVRIWkViMU5vTmtWRGRsRRAB",
            "text": "10 out of 10 would recommend, we had a fairly large group and the staff was very helpful in trying to get us all seated at a table that everyone was happy with. The service was excellent, and the lamb and mushroom kebab was delicious. Full disclosure, the cake pictured in this review was brought in from outside, Another really nice thing they will do is slice a cake for you."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4VloyeFJTWEJoWWpOdmFHeEpiRWhLZVVoQlNsRRAB",
            "text": "Food is really good and fresh. Tuna tartare, lamb, cod all really testy. Music just creates a nice vibe!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xreE56QmtZWFZTVVRZM1JUVldiR05vU0hBMGRYYxAB",
            "text": "Nice place. The good was good. I wish it wasn't so freezing cold inside. Also, only one red wine for happy hour. But overall liked the place and planning to come back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5Q2JuZFNkRVZ2VmpGUVltbGhWRUUxVkZGblZYYxAB",
            "text": "Erica made the best Belvedere straight up martini in NYC! Great service from her! Five stars!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204MFVVSlZia05DUW1SalZUSlNjREk0YW1FMWJXYxAB",
            "text": "Gorgeous food and gorgeous atmosphere; an easy restaurant to add to your regular spots in Murray Hill. Set your expectations to take your time at this place as the service is more relaxed. They have some private spaces that are available for group events, which seemed like a no-brainer if you're throwing an engagement party or celebrating a birthday/anniversary."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201WGFFOTVha2M0VEc5NGEyc3pNalJKZVRFeFdrRRAB",
            "text": "One of the best meals we’ve had in a long time! Every dish was bursting with freshness and creativity, with flavors that felt both unique and perfectly balanced. The Beetroot Tzatziki and Black Garlic Hummus were so vibrant and different, the stuffed pita “spanakopita” was such a clever twist on a classic, and the burrata with truffle honey and cracked pepper was absolutely heavenly. The Little Gem Caesar was crisp and bright, the Black Truffle Mafaldine was rich and luxurious, and the baked stuffed shells were pure comfort done with finesse. Even the charred broccolini had incredible depth of flavor.\n\nThe cocktails were just as impressive—playful, inventive, and delicious. The Italian Disco especially stood out, both for its flavor and creativity.\n\nOn top of the amazing food, the service was warm, attentive, and made the whole experience feel special. The atmosphere is stylish and inviting, the kind of place you want to linger. Truly outstanding all around—we’ll be back again soon!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201R1ZXSmhhek54YUhjNVJXSm1UbGxpWmpORmVWRRAB",
            "text": "Enjoyed our dinner here. Black garlic hummus was delicious and spanakopita in pita form was different. Lamb pasta and Limone pasta for mains. Olive oil cake was really good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SelFTMTNTVTFuWVc1UmQyeEllbkp6YldwS2IyYxAB",
            "text": "We dined at Leoneta tonight with my girlfriend and had a fantastic experience. The atmosphere was really nice and welcoming. The host was very friendly and had a great smile, and our server Natalya was excellent. The food was delicious, and we also really enjoyed the bar downstairs. Highly recommend it!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSbk1UVnNWelUzVDJZM01tNTRlVEl0YVZCRVRuYxAB",
            "text": "A great place to enjoy a quite dinner or a celebration...The waitress was friendly and attentive Food was delicious and our wine was paired perfectly"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnemQxaG9MVUY2Y1VsdmFXdEJkM2RRZDA5U1ZuYxAB",
            "text": "Hummus was good, service was okay but dont ever order pasta. It was the worst dish ever."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4bVYybExPR1Z1UTFsNU5VdGtabEpVZFdsMlRYYxAB",
            "text": "Ben was the best server!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCa05uVkpOek5NYVZOb1lpMHpUM1p2VFhCYVFsRRAB",
            "text": "I was very impressed with everything from the flavorful cod to the fresh Greek salad to the attentive service to Ditmars, the charming Maitre d’ who welcomed us so warmly that we felt like we were old friends. Leonetta is a great addition, both to the neighborhood and to the city."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOamJraGljWGxIUjFwMlowNTZZMFpRV1ZGTGRFRRAB",
            "text": "I don’t have anything negative to say about my culinary experience at Leonetta. The service was wonderful, and they helped us pick out some of the standout dishes on the menu. The cocktails were very refreshing, and if you like a summer spritz menu, this is the place for you. We ordered the black truffle and mushroom flatbread, which was pretty basic to be honest, but didn’t lack flavor. I would advise you to skip that one, and order the black garlic hummus with the pita bread. Oh my… it was so creamy and so garlicky with every bite. The pita bread (which came with it) was warm and incredibly doughy and soft.  Each mouthful, with the hummus, was heavenly. Another popular dish for us that night was the pasta al limone. Between the lemon and fava bean pesto, I was blown away because every mouthful was incredibly zesty and creamy. I loved my time here and will definitely be back and bring friends and family. The space was also visually stunning, so if you’re trying to impress a date or even celebrate someone’s bday or anniversary this is the place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkUVFucHpURk5vVTIxaFMyeFhVMk5OWjJzMGVuYxAB",
            "text": "food was fine, nothing very interesting. service was incredibly slow, almost shockingly slow. the first time I came here (few months ago), they weren’t able to seat our party yet because they were running behind (we had a reservations) and we ended up waiting for 45 minutes until we decided to just leave. looks like they still haven’t turned around the slow service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200M1F6RkZVRjk1VTFoSVJqTkxWRTVwYmpOSVptYxAB",
            "text": "Excellent food and service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjeGJpMW1SMWRTZDA1TVNYcHNRM1JyTlhCWlVFRRAB",
            "text": "Arrived around 3:15 on a Sunday, ordered from the Brunch menu and walked in not knowing what to expect and was very pleased. In addition to the dining room there's a lounge downstairs that competes with any speakeasy you've been to. Staff was very attentive and were knowledgeable about the menu. Loved it and would definitely come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xneGRXSjFWWE51YlhkYVdsVnVaVGRoVGtaa1lWRRAB",
            "text": "Delicious Lamb Burger!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnMllWWnRNM3B4VERSUVUyUllkbVppT0RkeVpWRRAB",
            "text": "Leonetta is absolutely outstanding! The food is amazing, every dish is bursting with flavor, perfectly prepared, and clearly made with love and skill especially the hummus.\nYou can tell there’s real passion in the kitchen. On top of that, Ditmar’s hospitality takes the experience to another level. He makes you feel so welcome, like you’re a cherished guest rather than just a customer. The warmth and care he shows create such a wonderful atmosphere. Leonetta has truly mastered the art of pairing exceptional food with genuine, heartfelt service. Can’t wait to come back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xodVZXZzVNVGt3WWxsU2VIaDJXREV0ZWpSclkyYxAB",
            "text": "Beautiful restaurant great drinks and food.  Downstairs Bar is very nice."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GQ1dFbEhRMHhxVFVkU2RUQTNiMnRTTlZKamRWRRAB",
            "text": "A friend picked this spot for dinner, and wow — it’s gorgeous! The interior is beautifully designed and the staff was super attentive from the moment we walked in.\n\nWe sampled a few dishes, and the standout for me was hands down the black garlic hummus. So flavorful, with actual chickpeas mixed in and warm, pillowy pita on the side — 10/10. We also tried the black truffle pasta, which was just okay. It looked great but didn’t really deliver on the truffle flavor, though it was still decent overall.\n\nWhat really sets this place apart is the downstairs lounge — total vibe. Next time, I’d skip the full dinner and head straight there for drinks and that hummus. The service was great, the atmosphere was on point, and while the food was a bit hit or miss, it’s still a spot I’d recommend if you’re looking for a cute place to grab cocktails and light bites."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JNVpHNXZSWG80ZURST1lubHNha2hNVUZCaGJtYxAB",
            "text": "Went for an event in their downstairs space. They hosted well and the food and drinks were good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrNFJGbHBjWEIyZWxwb1dXczFaMVJrYWtGdWFGRRAB",
            "text": "Amazing food, great menu and terrific service. Also delicious mocktails and cocktails !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVFIydG1hRWRGT1hkZlh6bHdlRWRzT1hCNFZtYxAB",
            "text": "Unexpected great food and open atmosphere. Lovely vibe. Loved the open windows."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTFdqVnNZWEJtU0RaeGJVNXNMVWRSZG1wdFExRRAB",
            "text": "This place was surpsiningly good - it’s where Jimmy used to be and they really upgraded the interior of the restaurant so it feels completely new, modern, and spacious. Appetizers were yummy. The entrees were just alright - they need better variety/sides with the dishes (they were all very simple). I would come back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUFZsZFFWVVJyUTNGaWJrZHFhMkZWWVZkSmJHYxAB",
            "text": "We have dined here 3 times and it has been fantastic every time.  The food is creative, very flavorful and excellent quality."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210b2MyZFNUMUZyY2tKNVNUY3pWRUp3WlVJeFUxRRAB",
            "text": "The food and ambiance was great but the service was very mediocre tbh"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SbVJuUkxSVzR6TWxkdWVtMTVTbUZxUmpKYVIyYxAB",
            "text": "Everything was amazing! All the staff were excellent, food was delicious and the vibe of the restaurant is so cute! Will defs be back. The lemony pasta was a fave of the whole table."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201b2NFdEVUV1ozV0ZwcFVHWkNaV3hqUTAxTVVHYxAB",
            "text": "Fantastic food drinks and experience. Definitely would go back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kRGMwRkdaRVphVVRCTWFXRldhMlF6WTJkT1ZYYxAB",
            "text": "Such a cute place! Loved the boho vibes, food was yummy (though pricey) but definitely fun experience. Try the black garlic hummus for sure and the steak!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoeVFsSkZZMDB3YVRkM2JsQktUVlJFWm5OQlYyYxAB",
            "text": "We reserved through OpenTable so no wait. Service was good, as was the food. The only problem was the the level of music which irritated my wife as it was a bit loud and pounding. For people that aren't sound sensitive and can tolerate music, it's a great choice."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oZlFVTTJXbVpoWkVsTU4zWmpjQzFSUzFwUmMwRRAB",
            "text": "Had a great dinner last night. Food service and everything was top notch."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2todVNXTjZVbU5EUTNaUFVtUk9RM0oxUzFWS2NFRRAB",
            "text": "Came here with a group of 3 people for dinner during a weeknight. It is definitely overpriced for Mediterranean food. The atmosphere is very pretty but the music is too loud and hard to talk over. I had made a reservation for 8:15 PM and we were not seated until 8:35 PM. When we placed our order with the waiter, they asked you to have it ready all at once. We had made a joke asking if he would remember everything and he did end up forgetting the spanakopita that we had ordered and was looking forward to the most. The food came out very slowly and was not worth staying the extra time to wait for the missing dish. The food was good but nothing to rave about, great to go once, but would not recommend or go back to."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xWFlWOHliM0pHTTA0ME0zTTFPVk4yYlVOaWEzYxAB",
            "text": "Liked the atmosphere and friendly service.  Food boiled down to the good, the bad and the ugly. I won’t keep you in suspense.  I opted for the “house cut” $62 pork shank, expecting it to be the highlight of the meal.  It sits large on the plate, a bulbous hunk of meat that has been deep fried to a crisp on the outside, presumably with the intent of sealing in the juices to deliver a moist, tender and delicious interior.  Instead it seemed to have been forgotten in the deep frier for a couple hours (or days).  One could as easily have consumed a vintage leather adidas tennis shoe that had been left too close to a campfire.  Just to be sure, I took the sad thing home in a to go box, thinking some mustard might make it edible in a salty jerky sort of way. But no such luck.  In all seriousness, this rivaled the worst meat experiences I have ever had.  Hopefully it was just an off night for the chef.   As for the good: the Black garlic hummus was awesome.  Too rich for some of my group, but there’s no accounting for bad taste.  Spanakopita, pastas (orecchiette and saffron rigatoni), and grilled fish (dorade) all nice.  The retro “steak frites” were more like halved baked potatoes than french fries, and did not find any takers at the table (but to be fair, we had over-ordered and were filling up on pasta). The charred broccolini was served in large, thick stalks (sprinkled with cheese) which I enjoyed, but my female companions, while generally lovers of broccolini, found too indelicate to dive into.\n\nOverall, I definitely found things to enjoy here but could not help feeling I had been shanked."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzeUxVcHBkWEV0UTFCR1pVVnNXVFo1VUVwT2NsRRAB",
            "text": "I highly recommend Leonetta Restaurant! We were greeted by the lovely Hostess and enjoyed the Happy Hour with a refreshing Cardoon Spritz recommended by Gregg, the Bartender!! Dinner was superb and excellent service was given by our Server, Asher. We started with the Watermelon & Feta Salad & Spanakopita Hummus. The Mezzi Rigatoni was delicious and ended our meal with the Olive Oil Cake!!  I look forward to returning to Leonetta on my next visit to NYC."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFd1gwbHhNMFZ4WkV4d1dXUkdUREJKWm1ocVoyYxAB",
            "text": "Best hummus I've had in years"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vdGQyeDROVTVqTTFOYWNsaHlTMU15YUdWc01rRRAB",
            "text": "Great restaurant and the food was sooo goood"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4elVEbHdaV3RNYzFaalNIZzFNbWd6UmxaaFJYYxAB",
            "text": "Black garlic hummus is enough for you to try this spot!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvNFFsUlRjekZmWW1KZmF6ZzJkRGQwWkRReVRGRRAB",
            "text": "The black garlic hummus is exceptional!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kMk5FcElVbmhDWkRNellqRmpMV0Z2Tkc5NmVXYxAB",
            "text": "Rose (like the wine) was the best server ever, food/drinks/ambiance were all incredible"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201aWJrOWxTbmRXTld4d09FaGFaVUkwYkhWbGVVRRAB",
            "text": "Such a beautiful restaurant and vibe, but the customer service off the bat from the host to being seated was HORRIBLE. Sat outside at an off hour with barely any guests there on one of the hottest days in nyc with no water brought to the table for about 15 minutes. Where they didn’t come back to take our order for another 10, which then we  Proceeded to miss their happy hour due to their poor service and response time even being not busy. After finally getting our alc beverages the drinks were off colored and the waitress dropped them off and ran away as we called her saying we were ready to order as she didn’t even turn back and ignored us. Finally we told the manager we’d be leaving where he told us he’d take our orders but we sat there for an hour with no orders taken and damage had already been done. Do not recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCelFXNVBNM3B3YkRWWFYyUXdjVEpDYlRKSmFIYxAB",
            "text": "Get the grape leaves stuffed with black cod and wild rice! I promise you won’t regret! Grilled octopus salad too yum!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210NU1UVllZbWxvTWxsalRGOHRlRFJuYTBoWVIyYxAB",
            "text": "Dj Clay changed the vibe in the main dining room"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVU5UVnJOV1JtYmpNNFkzbGhkMGxvU1dGelpHYxAB",
            "text": "The potato did not do it for us. Everything else was good."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOS2d4cHU1MllQVUJnEAE",
            "text": "The atmosphere is welcoming with a warm vibe.  It is beautifully designed (Mediterranean decor) with gentle breeze and sunlight coming from their wide opened full length windows. The bar downstairs looks sharp and posh. The food here is delicious and fresh seafood from their raw bar. The service is attentive and friendly and not overbearing. It was a perfect lunch and drinks on a gorgeous sunny cool breezy Memorial day 😊"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOYTBxdHFkZ2REU3RnRRAB",
            "text": "The food was very good, and I especially loved the intense flavor of the black garlic hummus, the bread, and the chocolate pudding. The portions were on the smaller side for NYC. The ambiance is wonderful, I felt transported somewhere else, and it feels upscale. The waiter confused me, sometimes he was engaged and sharing information, and sometimes he seemed to hate being there. For instance, he recited the menu in monotone, and flung the plates on the table without saying what the food was. I obviously preferred interacting with his first version."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJbUkxSkREamN1ZzB3RRAB",
            "text": "Really enjoyed dinner here\n\nThe tzatziki wasn’t my favorite but loved the burrata. The Greek salad was sooo delicious.\n\nBeef and mushroom Kebob was outstanding. Only comment is that the portions are small for the price but the atmosphere is lovely"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdGFhZ3VRRRAB",
            "text": "My friends and I came in for brunch last Saturday. Nice ambiance, good vibe, decent food and great service.\n\nWe start off with Black Garlic Hummus which I am still graving for it, so good. The Caesar Salad with Chicken was refreshing, Lamb Panini and Grilled Swordfish Club were delicious as well. We also got a side order of Za’atar Steak Fries. Everything was flavorful, no complain at all.\n\nI will definitely be back again to try something else!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJaVBfT3l1OXB2WTJBRRAB",
            "text": "Elevated dining experience for the neighborhood. Perfect for a date night or girls night out. The hummus was to die for and the truffle pasta was delicious. The cod was so so and my only criticism was that the wine pours could be more generous. Otherwise, lovely dining experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLREx5S1dobnJLcEt3EAE",
            "text": "The black garlic hummus is unbeatable! The warm pita has the best seasoning and the beef and mushroom kebab was good. I didn’t try dessert but the Olive Oil Semolina cake was highly recommend ☺️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJcUowYWZrcUt5X2J3EAE",
            "text": "The 4 of us had a very simple dinner. 3 drinks. 2 apps & 4 dishes + panna cotta. Lump crab ceviche & spanakopita. The latter is great. The lump crab tastes great, but I'm not sure if it should be a ceviche. The mains are steak, orecchiette, cod dolma & Santorini salad. Steak is cooked to perfection. The cod was great. Nice & fluffy. The grape leaf is a bit too old for me. The orecchiette seems like it lacks eggs & it has the consistency of some low quality, thick Chinese dumpling dough. The Santorini is chopped up too small & the dressing overwhelmed the salad. Gyro World version with chunkier cut made the salad tastes fresher, less withered. The Panna cotta with blood orange was very nice. Not too sweet & complemented with candied pistachios, which are very crunchy. It's quite a contrast."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZek0zQ3dRRRAB",
            "text": "I recently had the pleasure of dining at Leonetta, and I can confidently say it’s one of the best Greek restaurants in Manhattan! If you’re looking for a great place to hang out with your friends, this is the spot.\n\nThe atmosphere is lively and welcoming, making it perfect for a casual night out. We were particularly impressed by their drink selection. We tried the Loca Loka Tequila, which is a new addition to their menu, and we absolutely loved it! The flavors were vibrant, and it paired perfectly with our meal.\n\nThe service was excellent as well—attentive and friendly without being overbearing. It made our experience all the more enjoyable.\n\nOverall, I highly recommend Leonetta for anyone looking for delicious Greek cuisine and a fun atmosphere. I can’t wait to go back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvc1ptYzd3RRAB",
            "text": "Loved the food! The drinks were amazing, our bartender really went above and beyond after I described what I like. The food was fantastic, and the service and ambiance were spot on. We were a big group of 14 and everything ran smoothly. After dinner, we headed down to the speakeasy for more drinks and had an absolute blast!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJck9tTFJBEAE",
            "text": "We caught up with an old friend at brunch here, and I'm not mad I schlepped here for it.\n\nSplitting everything family style, we started with warm, homemade pita and the scrumptious Beetroot Tzatziki. The Black Garlic Hummus, another dip, wasn't as tasty (oddly nutty and slightly sweet), and we didn't receive any chilled crudités like the menu mentioned, but I'm not mad because the Beetroot was so fantastic.\n\nThe Jumbo Lump Crab Ceviche was a pleasant surprise, with a generous portion of crab, as was the perfectly decadent Lamb Tartare. The Steak & Eggs Kebab came out delightfully medium rare, while the Lamb Panini was a crunchy reminder that more sandwiches should sandwich lamb (if it weren't so expensive).\n\nWe also threw in the Shawarma Spiced Bacon (lovely), and the less lovely Za'atar Steak Fries. I'd skip the latter unless you like giant slabs of mostly unseasoned potato--it was the only dud on our table.\n\nService was great, and the plant-focused decor is always a win for me. All in all, I'm glad I came and now I kinda want to come back for dinner. Isn't that the ideal brunch experience?"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReGQtTVR3EAE",
            "text": "We had a good time at Leonetta; the atmosphere was lovely, and the food was good. However, the service felt slightly overbearing as we were approached a bit too frequently. I recommend booking in advance—it’s a great spot for group dining!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMzRDUVlBEAE",
            "text": "Loved the hummus! The best. Nothing to say.\n\nPork chops amazing. Chicken really tasty and good texture. Filet mignon sooo yummy. Happy I got to try this place. I’ll be back soon."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRM011XzFRRRAB",
            "text": "New favorite restaurant in nyc. We were greeted by a really warm friendly staff. The music was upbeat and but not too loud, great background for dinner conversation. Our waiter was excited to give us recommendations and explained the specials with extensive detail. We also really enjoyed talking the wine sommelier, he was passionate and lively. The dips here are a must. We tried the hummus, burrata, and baba ganoush. Split a few entrées, all with fresh Mediterranean flavors. I will be back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MEtYQTh3RRAB",
            "text": "Fun NYC dinner experience.\nWe ordered a wide range of entrees and enjoyed them all. The wine pour was a bit smaller than in other places but it was a lovely evening. I would encourage reservations"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2OTVHVXVnRRAB",
            "text": "A genuinely delicious experience!  Leonetta is the total package from cocktails, service, ambiance, and all three courses of our experience. Jill was friendly and knowledgeable about the menu.\nStandout dishes include the black garlic hummus, rack of lamb, and chocolate pudding."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMEt6cWJREAE",
            "text": "Leonetta serves up flavorful food in a chic, welcoming space. I ordered the half chicken Caesar salad, which came in at $35—definitely an aggressive price for a salad. It was a whole lot of chicken and not enough greens; I would’ve preferred more salad with the chicken diced in for better balance. That said, the overall vibe was great, with a DJ spinning nostalgic brunch tunes my mom was vibing to. Customer service was excellent—super friendly and attentive. The downstairs lounge wasn’t open during our visit, but it looked like a cool spot for after-work drinks or a date night. I’d go back, just maybe order something else.\n\nDef recommend the crab ceviche and the tuna appetizer (not pictured)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOE9ybmR3EAE",
            "text": "Leonetta is a solid vibe all around. Between the restaurant and speakeasy on the lower level, it lends itself to a full evening experience. The food and cocktails were perfectly executed. Absolutely outstanding."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnek55YlN3EAE",
            "text": "This is a great new place that has opened in Kips Bay.\n\nAmbiance: I loved the decor and set up at the restaurant. It’s boho modern Mediterranean. The seats are very comfortable and I love that most of it has booth or half booth sitting. The plateware is really cute and suits the theme of the restaurant.\n\nThey also have this amazing lounge area downstairs. It’s a great spot to start the date before you go up for dinner. They have a fireplace and comfy sofas. They also have a really nice bar area there with very comfortable bar stools.\n\nFood: We got the spanikopita as a starter. It was good, well seasoned, but it wasn’t really spanikopita. They used a pita/focaccia type of bread instead of phyllo pastry. The mix instead was also wetter than spanikopita usually is so it felt a little more like a spinach dip.\nWe also got the beet tzitaki. It was so yummy and probably my favorite dish. I don’t think I’ve had anything like this other than maybe something in Greece. The pita bread that came with it was fresh and warm. It has the right level of zaatar to enhance the bread.\nAs the main we got the baked stuff shells. I really liked the rice mixture inside and it was really well seasoned. The shells were well cooked and the tomato sauce was nice.\nWe got the fries as a side. It was nice and I liked the ketchup it came with.\n\nNote: as vegetarians be aware that unfortunately the truffle dishes aren’t vegetarian. They looked really yummy but unfortunately they use some chicken something to keep the truffle texture correct so it cant be vegetarian.\n\nDrinks: they had a great selection of wine and I had a really good sparkling wine. It was perfect. I also got the Paloma Picasso cocktail. It was the perfect mix of sweet and tart and it was a good size.\n\nPrice: cocktails are about $20. The glass of wines are fairly on the high end especially the half bottles considering some of the whole bottles were the same price. Food was on the higher end but the portions were pretty filling so even though they looked slightly small it was the perfect amount.\n\nService: service was fast. We didn’t have to wait long for our drinks and food came out at the right rate."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdzhUakN3EAE",
            "text": "We had an amazing dinner here! Great service and an upscale yet cozy atmosphere. We ordered the sea scallop crudo, the tuna phyllo roll, and the Caesar salad and each dish was delicious. Would also definitely recommend exploring the cocktail menu both upstairs and downstairs!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNUpYRWZ3EAE",
            "text": "I really wanted to love Leonetta, especially since it’s right in my neighborhood, but unfortunately, my experience was disappointing. We were upsold a tomahawk, and when it arrived, it turned out to be tuna—something we weren’t expecting at all. My two guests and I all agreed that at no point did the server mention it was tuna, which made the situation feel misleading. The steak frites were also giant pieces of potato and resembled potato wedges which was disappointing. It completely soured the meal for our group.\n\nTo make matters worse, we were told the bar downstairs would be open the next night, so we planned to check it out, only to arrive to locked doors. It felt like a series of miscommunications and missed opportunities to provide a great dining experience.\n\nI was really excited to have a new restaurant in the area, but this experience didn’t live up to expectations. Hopefully, they can work out some of these issues as they settle in."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzd19MX3VRRRAB",
            "text": "I had the pleasure of visiting this stunning new restaurant in Murray Hill for their soft launch last night, treating a friend to a belated birthday dinner. The ambiance was breathtaking, with clear attention to detail and a sophisticated vibe that transformed the space from its previous life as a sports bar into a gorgeous Mediterranean-inspired setting.\n\nWe were seated quickly and impressed by the diverse food and drink menu, which included Mediterranean-inspired dishes, pastas, seafood, and a great selection of both inventive cocktails and zero-proof drinks. The variety ensures there's something for everyone, which we loved!\n\nThe service, though friendly, had some early hiccups. Our server took our drink order but didn’t return to take our food order for over 20 minutes. We ended up flagging someone else down to send over our server, and while the server wasn’t rude, there was no acknowledgment of the wait. That said, we know soft openings can have minor kinks, so we didn’t let it affect our experience too much. Joshua, the sommelier, really made up for it! He was hospitable and knowledgeable and encouraged us to check out the lounge downstairs—a must-see.\n\nAs for the food, it was a mix of highs and potential. We started with the beetroot tzatziki and housemade pita bread, which were incredible! My friend had the saffron mezzi rigatoni and thought it was good, but not particularly standout. I had the sea scallops, which were flavorful but could use a bit more balance to offset the richness. The charred broccolini, however, was a showstopper—cooked perfectly and packed with flavor.\n\nWe were also touched when the staff surprised my friend with a light dessert for her birthday—the olive oil semolina cake was the perfect sweet ending to our meal.\n\nThe only other challenge was catching our server’s attention to settle the bill, as my friend had a train to catch. It took a bit of effort to track her down, but she was genuinely sweet and likely just getting the hang of things with the opening. I think with some support, the team will find their rhythm.\n\nWe finished our night by checking out the downstairs lounge, and wow—it’s stunning! I’ll definitely be back for drinks. Overall, this restaurant is off to a promising start, and I’m excited to see how it evolves. Highly recommended for anyone looking for a fresh, stylish dining experience in the city."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcWV2RDZ3RRAB",
            "text": "I was recommended Leonetta by a friend who’s a foodie and it did not disappoint. Immediately when you come in the atmosphere is great, the staff is very welcoming and friendly. Our waitress was very knowledgeable of the menu and made some great recommendations.the prices are fair for the quality of the food. Portions are moderate but filling. I would definitely recommend it, I will be going back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMFlLMW1RRRAB",
            "text": "Wow! I’ve been a hummus lover most of my life and think I just tasted the most delicious hummus of all time. It was a beet hummus and I can’t stop raving about it. Also my Caesar salad was perfection ❤️"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMlotS3NnRRAB",
            "text": "Wonderful experience at Leonetta, from the ambiance to the service to the food. We received very attentive service from all members of the staff. While I was waiting for the rest of my party, Henry at the bar took great care of me. The cocktail menu is expansive and delicious, with great mocktail options as well. Highly recommend the spanakopita pita, crispy basmati rice, and skirt steak—but you can’t go wrong with any choice. The tiramisu was a phenomenal end to a delicious meal. The dining area is large with multiple seating options and a curated vibe. Leonetta is a great new addition to the area!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2c09iV1lBEAE",
            "text": "Fantastic meal after only 1 week of opening. Great location, amazing spaces created inside. The food though...next level good. Thanks Chef Ed, Craig and the whole team. You've done it again."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBdEpuZ0N3EAE",
            "text": "We happened upon Leonetta on a Monday evening around 9pm as a group of 5 and were thankfully seated straight away in one of their booths near the bar. For a Monday evening, the atmosphere was buzzy and the restaurant was quite full, which added to the experience.\nAll the staff were friendly and attentive, but none so much as our waiter Josh! Once seated, he gave us some excellent recommendations (some of which we opted for) and ensured throughout our experience that we had all we needed, but without overwhelming us.\nFood wise, this was the best meal we had during our time in NYC. As per Josh’s recommendation, we opted for the flat bread with truffle as a sharing starter which was very tasty. We then mostly followed his recommendations for our main courses: 3 of us opted for the recommended Filet Mignon and Mushroom kebab (pictured), 1 for the recommended Brick Chicken and 1 for the Santorini salad with Steak Chips. The food was absolutely delicious, we could not fault anything.\n\nAll in all, I had a wonderful evening at Leonetta and I would recommend to anyone interested in booking here to do so. Thanks again to the lovely Josh for helping to make our evening that bit better."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBXzluLW5RRRAB",
            "text": "Visited Leonetta for dinner. Started with Black Garlic Hummus and Lamb Tartare. The Pork Shank Shawarma is large enough to split between two or three people. Pass on the Za’atar Steak Fries for one of the other available sides."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2a295bGNnEAE",
            "text": "Amazing ambiance/vibes, great variety of inventive dishes for my sister's birthday celebration with family (a few were a tad on the saltier side)\n\nI think maybe our sever was a bit new since we asked her to check the order for us with my food allergies (soy & tree nuts) and she initially said only one of our 7 dishes ordered would be unsafe for me ...but when the food started arriving she came and said only 3 of the 7 were safe. Had we known we would have changed our order :/"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQei12M1VBEAE",
            "text": "Fantastic experience. Bit of a wait, even with a reservation, but they were very nice and accommodating with bar seating and cocktail tables downstairs. Staff was attentive and the food was absolutely amazing. Could not recommend this place more. Well worth the price point."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURReDRfTnZ3RRAB",
            "text": "Beautiful restaurant. Great atmosphere, decoration, and service. Recommend everything we got—black garlic hummus, burrata, filet mignon and black truffle mafaldine. Loved the cocktails as well."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJZy1fWGp3RRAB",
            "text": "I stopped by for dinner and enjoyed their Caesar salad, beetroot, zaatar fries, and one of their N/A beverages crafted by Mia. Everything was delicious and flavorful. The beetroot followed me into my dreams that night—I highly recommend it!\n\nCan’t wait to come back 🫶🏽"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMemNfb3Z3MXRtcVJ3EAE",
            "text": "Excellent option for drinks. Kebab was the highlight. Food was not the highlight but downstairs bar woth Dj was amazing"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdk5Ha0d3EAE",
            "text": "Waited 45 mins for our table to be ready although we had a reservation. Our server must have been very tired from the day as he wasn’t very helpful in making recommendations. Food was tasty but overall not sure if I would be back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOcld4ZGJGaE9TMzRBRRAB",
            "text": "Had a lovely weekend lunch at Leonetta and was really impressed with the beautiful decor and delicious food.  Everything we had was pretty good, and the service was solid.  The space is completely renovated from the former bar scene and it's pretty beautiful.  I'd love to come back in the evening and experience the downstairs bar / lounge area.\nThe music was a bit too loud for a weekend afternoon - it felt like the DJ (yes, DJ) was spinning for a Saturday night).  Overall a good experience and would go back to try other dishes."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmbEp6dHV3RRAB",
            "text": "This place is new. Food is good, a little creative. And i like Mediterranean food. In a good location or area that needs a restaurant. I love the inside and decor. Service was good. Music was a tad too loud. Tables were spacious. The pita and bread and hummus is good. Got a lot of appetizers, scallops and tuna was good but small. So why 4 stars? I think this place is pretty pricey especially for appetizers and some mains which are small. And I got swordfish kebabs for dinner which was drowned in salt but Still ate it all. Also the plate for swordfish kebabs is big but they only fill half the plate, seemed like it needed another side or more pilaf. My mom next to me had same dish but not overly salty. She liked it more than me. Everyone liked their entree but me. But those who got the other fishes didnt include any sides, so thats an extra price. Didnt have dessert. I think the bar or this place may be a good date spot for the atmosphere, drinks arent cheap though. Even non alcoholic drinks were like 17 bucks."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQcTV1Ty1TanFqREtnEAE",
            "text": "We came here for our second date as a last minute alternative, and we could not have been happier. Our server recommended several vegetarian friendly options that complimented each other, and the wine director paired a delicious Greek white perfectly. The pacing was perfect as we swapped courses and finished the bottle. We shared everything and it was one of the most satisfying meals I've had recently. We loved the ambiance."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMUwta3NBRRAB",
            "text": "We had such a great dinner here. The food was genuinely impressive — everything tasted amazing and felt thoughtfully put together, like the kitchen really cared about every plate that came out.\n\nJoshua, our host, was fantastic. He gave us great recommendations and made sure our group was taken care of the entire evening. You could tell he actually wanted us to have a good time, which made a big difference.\n\nWe were in a private room that worked perfectly for our group of 14. It felt cozy and comfortable, but still really nice — a great space where we could enjoy each other’s company without any distractions. Overall, it was just a really special night and we're very grateful for the experience!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdHNIWW9RRRAB",
            "text": "This spot is such a great addition to the neighborhood! The food, service and atmosphere were all incredible. Will definitely be going back!"
        }
    ],
    "reviews_count": 88
}