{
    "name": "Giorgio's of Gramercy",
    "place_id": "ChIJ0f2BYaFZwokR1ZhJ5byw-co",
    "grid": "MN6",
    "address": "27 E 21st St, New York, NY 10010, USA",
    "rating": 4.5,
    "user_ratings_total": 529,
    "phone_number": "(212) 477-0007",
    "reviews": [
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psdmRIUTBOMFpaVTBWR1NYVkdhMHRQVG1VeVUyYxAB",
            "text": "Food is good, the seafood linguine had fresh pasta and plentiful of seafood in it.\nThe Charred Octopus 🐙 was cooked perfectly and considering that I don't like Octopus it was very good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xVGR6aHFhWGxCVkdGUmVVZDZkSEZHT1VrMlJuYxAB",
            "text": "We walked over here from the Harry Potter store behind the Flatiron Building. Everything was great. Awesome service. Delicious food."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSa1FrOVNRek16VjJodVVuVTFOMk16Y1UxelYxRRAB",
            "text": "Quite literally the best restaurant. Period. Always amazing service, food, ambiance. Great staff that treat you fantastically. Can’t wait to come back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wWVJXZE9VRlJaYjNWT1JTMHlOM3B4Y0ZaRFFuYxAB",
            "text": "great selection of food at a very affordable price!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSck1uRkNTVGhZUVc5TmMwUlhORkYwWW1Wc2VtYxAB",
            "text": "Murshalin is awesome !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOU1ZUbG5la05NYWxKS05GcHpTVmxYY0RVMGRVRRAB",
            "text": "I found your restaurant by doing a Google search in the Gramercy neighborhood. Since moving to NC, when I’m in the city I’m on a mission to make sure I have a great meal, particularly Italian.\nIt was outstanding! The flavors, quality were delicious!\nI was in Italy two months ago and your homemade pasta did hold up beautifully. I look forward to coming back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kV2J6VlphWEZtYmxsNlkxcFZhalo0WW5OeFVVRRAB",
            "text": "Just bought desert from that place. Service was great! Inside atmosphere cool and friendly. Cosy place, yea..."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4bE9IUk9WMk5NZEdKeWNYSTNibWRXWkc1dExWRRAB",
            "text": "We went with family and as a big group. It is a great space for it and everyone enjoyed their meal including the children!\nWe had pasta, gnocchi and grilled octopus and they all were nicely done and flavorful.\nThe menu is very diverse and accommodating for vegetarians and pescetarians.\nThe wine has a great collection as well."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5c2VGZzNPRVJCVG1sd09GWlNTM0JLVFdsMFpuYxAB",
            "text": "Absolutely delicious and great service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNM1VtcTdaMmJ1SElnEAE",
            "text": "Went for a small company dinner, total group of 9 people on a Wednesday night. It was pretty empty. The ambience was old school fancy tavern style.\n\nFor appetizer, we got the calamari (really good), colossal shrimp (was not seasoned at all), meatball (I don’t eat meat but the table enjoyed it), and charred octopus (tasted good). For dinner, I got the salmon and it was really good, highly recommend it! My coworkers go the rabbit ragu (he really loved it), veal (the portion is huge!), and Diavalo (all who got it, loved it). For dessert, I believe it was a chocolate cake with ice cream - it was ok.\n\nThe highlight of the night was our waiter. I wish I got his name but he did an amazing job!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNSGFwN0dvMDRyYjBnRRAB",
            "text": "Found this Italian spot that was spot on. Service, Food, everything!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQLUlxNXJrd3BDTEhREAE",
            "text": "Amazing !! Nothing short of amazing - food - staff - ambience. Don’t miss this little gem in Gramercy!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMcnh4WVdGOF9mM0NREAE",
            "text": "Loved the food but the service was just ok. Not a lot of options to customize your meal. My kids weren’t allowed the option to order a basic fettuccini Alfredo, also no options to request a half order of pasta."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3OXAyUDl3RRAB",
            "text": "Great place to power lunch. Get the organic lettuces for a nice pick me up!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRamRfZ2VBEAE",
            "text": "This surpassed expectations for nice atmosphere, terrific food, great value. We are from SC and visit NYC every year.  The welcoming character is what we look for up here."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbmJ1TW9RRRAB",
            "text": "Excellent service. Love that they provided coat check. We visited on Valentine’s Day and so it was very busy but the food and service were on point. Old school classic Italian. Only lost a star because the tables were so close together we could not even get in or out of our seats with out having to move the table or disturb other guests. Also the bathrooms could use a little tlc."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneW9PYzBBRRAB",
            "text": "Bad. Like really bad. We think they’re buying or doctoring these reviews.\n\nLocal young professional couple for a Valentine’s dinner\n\nAmbience: You’re welcomed with a basic, commercial cheap door you’d find at a CVS, old dated tile flooring in the first half of the restaurant, and just an overall feeling of decay. Instant red flag\n\nService: ok\n\nFood: We compared it to a Gordon Ramsey kind of experience. Meatballs were bland and lacked flavor, Caesar salad was caked with dressing and overwhelmed with anchovies. The gnocchi needed a paper towel to soak up all the grease. It was barely edible. Actually disgusting.\n\nWe’re most upset that after rereading a lot of the reviews they seem fake. Was not a good dinner\n\nWill not be back"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnc3NfaGF3EAE",
            "text": "Amazing food, very friendly staff, and wonderful atmosphere. This gem is now on my \"always stop at when in NY\" list."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmM2NEQ0NREAE",
            "text": "Quiet little restaurant with great food, superb service."
        },
        {
            "date": "10달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmblk2TjlnRRAB",
            "text": "Excellent repas, prix très bien pour NY. Ça mérite une visite"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2b2ZLLWtRRRAB",
            "text": "One of the best Italian spots in NY! The food is absolutely amazing, but more than that is the staff!! Beyond friendly, accommodating and truly welcoming. We were a party of 13 and every one of us walked away having had the best time. Generous portions and really delicious veal parmigiana. So happy we discovered this gem. Manager was so cool he played music that we loved!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2X3R5NmdRRRAB",
            "text": "All 3 dishes we ordered were amazing!!\nYou really need to eat here!!\nVeal parmigiana, lamb and steak were perfect!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2XzVuRnpnRRAB",
            "text": "Great spot with an old NYC feel and friendly service. We started with the meat and cheese board. Meat sliced extremely thin, which for me is perfect and the addition of honey when serving blue cheese is always a hit for me. The cacio e pepe was solid, nothing bad but nothing outstanding. The duck special was very good. Duck was cooked as ordered, seasoned well and very tasty. The grain’s served with it, while maybe not an obvious choice were very good and a nice complement to the duck. Overall a restaurant I would return to."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQZ1pDcUdBEAE",
            "text": "You need to try the halibut. Probably the best fish I've ever had"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQeVB6cHhBRRAB",
            "text": "Waiters failed to connect with table or appear to care.\nDidn’t size appetizers for table\nPortions of some entrees were small.\nFood was pretty good."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzOUpUZTlBRRAB",
            "text": "Great little restaurant in the city with an old timey feel. Cute bar area. The restaurant is quite narrow, seems almost impossible to fit a restaurant in this space, but this is New York.\n\nCame here for dinner with a few coworkers on business travel. I had the lamb chops which were very nicely done, along with a caesar salad starter, which was also very good.\n\nThe service was a bit slow and the food took a bit, so you may need to pack your patience. The meatball plate ordered by my colleague came out cold and he sent it back. It came back fairly quickly.\n\nWine, beer, and cocktail selection was nice. Overall it was a nice experience and great atmosphere."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNElTNFZnEAE",
            "text": "Very cozy restaurant. They make our pasta very quick and it was delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYeXBDRkh3EAE",
            "text": "Dining room reminded me of the 90’s restaurants in Chelsea.  Loved the red walls and high ceilings.\n\n*pasta is made in house\n\nLunch today, we the pappardelle bolognese, calamari fritti, seared chicken. Will definitely return next time for dinner and drinks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYM2RpdWhBRRAB",
            "text": "An absolutely fantastic experience from start to finish, staff were attentive, friendly and knowledgeable, Haley in particular took amazing care of us. Food was all beautiful. Couldn't recommend this place enough"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubjl1SS1RRRAB",
            "text": "Terrible experience. We have never seen such a rude waiter in any countries.\n\nIt was the first time for us in USA. When we came to restaurant we were so tired after 9 hour flight so our aim was to go without complaining. But our lunch experience was:\n\n- We asked wine together with octopus, he brought wine after we finished to eat octopus.\n- We asked paccheri and we received conchiglioni.\n- We asked linguine (in picture) and they were swimming in oiled sauce.\n- We asked bread and he said that the bread is finished.\nDespite the low quality of the food and of the service we wouldn’t write any reviews if the waiter would not behave like this:\n\nwhen he brought the check (even if we didn’t ask it yet) I gave my credit card and I went to restroom.\nWhile my wife was alone at table the waiter came and said to her ‘here there is no tip, if there was something bad you had to tell me’.\n\nWithout knowing anything about how the tip works in USA, my wife was trying to say to him about paccheri etc.\nHe throwed the pencil on her table saying ‘we are not slave.’\nMy wife replied ‘Ok, when my husband comes back speak with him’\n\nHe continued with his rude style also with me saying ‘go to your country’ and other bad words that i cannot write here while we were exiting.\n\n1- No one has to know about your culture, you should tell in a kind way.\n2- We will already turn back to our country, we hope also one day that waiter can come to Italy. Maybe he can learn how to do this job.\nIf we consider that he did all this just for 10-20 dollars we don’t have any words to add.\n3- First of all learn HUMANITY and after providing wrong Italian receipts and rudeness put away from your restaurant ‘Italian’\n\nTo close, we want to highlight that no one of the staff did anything to stop him.\nSo stay away from this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuellLVEhnEAE",
            "text": "This restaurant is incredibly overrated. The food is actually BAD and overpriced, the service was bad, the atmosphere was ok. The tables were greasy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbmZDa2RnEAE",
            "text": "Royalty treatment,\nseated at Georgio's.\nFrom nowhere surprise,\nradiant scenarios.\nPlated art,\nE lasagne molto sbalorditivo!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMS12MEF3EAE",
            "text": "Unpretentious old school Italian place with great ingredients and handmade pasta. Our server, Kaitlin, took great care of us!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bXZuSHJRRRAB",
            "text": "We tried this place for lunch during the week and it was delicious! The staffs are extremely friendly and went to extra lengths to make sure we enjoyed our meal. The scallops and salad were extremely fresh, and you can 100% notice the fresh taste. I'm looking forward to coming back and trying their seafood pasta next."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiaWZEZ0hBEAE",
            "text": "Giorgio’s was excellent. Even with a party of 10 the service was very fast. We were well taken care of and the food was delicious. The Veal Milanese (pictured) was outstanding, and they make a great espresso martini. For appetizers, the grilled octopus and burrata were both great. I don’t think you can go wrong here, no matter what you order."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMN3I3Q1pnEAE",
            "text": "This is just a good all-round Italian American spot backed by friendly service. I started with the burrata which was an interesting take as I’ve never had it with squash and the quality of the burrata itself was top notch. The veal parm also made for a solid choice although it is huge so definitely come hungry if you order it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMLXN6aUJ3EAE",
            "text": "Great food! The veal parm is awesome."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMnFDQWVnEAE",
            "text": "Simply amazing! Best service I’ve had in America so far and food is great, will definitely be coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMa05lMTlBRRAB",
            "text": "We had a great dinner. It was our first time there, but it won't be our last. The server, Hailey,  was fantastic. We enjoyed our time there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMX3RtYVdnEAE",
            "text": "Came here for a quick lunch before leaving the city. I got the bucatini al la vodka and my husband got a burger and fries. Everything was absolutely delicious. The pasta was so good and the fries were amazing. Service was very quick and attentive. Both the staff we interacted with were incredibly helpful and nice and you cannot beat the lunch prices. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMak16SlNnEAE",
            "text": "This is our favorite restaurant!  The food is absolutely delicious with some of the best cacio e pepe around - and we try it everywhere!  The dijon brussel sprouts leave us craving for our next visit here and the drinks are great. Best of all, the staff are friendly, helpful, and attentive. They always make us feel welcome and at home. The atmosphere and decor are beautiful as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNUx2T3hBRRAB",
            "text": "Hidden gem. Food was delicious. Servers were friendly. Great overall experience. Got the Cacio Pepe and Mushroom Fettucini. Prices pretty reasonable for NYC.  We will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6akxqeF9BRRAB",
            "text": "Pretty average"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbmNqUGpRRRAB",
            "text": "Had a great meal with colleagues here.   The food was excellent.  We ordered a few appetizers including the baked oysters in the pics.   I had the salmon which as excellent.  I’m giving 4 not 5 because it was not a blown away experience.  But it was very good and I would go back.  We had a great time.  The service was excellent.  We did order tiramisu and it was still frozen."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUaFlQUVFnEAE",
            "text": "came for lunch with a friend, nice staff. Unfortunately, my pasta was too hard (more than aldente) and my friend's burger was not great either."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNULXFqYV9RRRAB",
            "text": "Was really delicious! Good value for money"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqNl9ydmV3EAE",
            "text": "The food was so very good.   You can see the chef making the homemade pasta in the window, and it tasted amazing.   The baked Alaska dessert was also very delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdjk3QWhnRRAB",
            "text": "This is one of the Best Dinners that I've ever had!\nThe food here is AMAZING!\nFor appetizers, we had\nthe prime meatballs.\nGrilled octopus\nKing salmon tartar\nPasta marinara.\n\nThe Cioppino was the best I've ever had.\nThe seared scallops were Amazing.\n\nThe dessert menu had so many great selections.\nWe ordered three of them and they were incredible.\nThe S'mores Bread pudding is a must.\n\nThis restaurant is a hidden Gem in Gramercy Park."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5Xy1HQndBRRAB",
            "text": "The food here is delicious . Came here for the first time, and will definitely return. Absolutely recommend. Great atmosphere and Exceptional service. Ernesto took great care our table."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5LUlhVDh3RRAB",
            "text": "incredible experience all-around and stellar food. the staff are also gems 🫶"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCNy1DQVhnEAE",
            "text": "Food 7/10\nThe octopus was delicious, and the pastas were also quite solid and classic. I enjoyed the seafood spaghetti especially. Because we were not seated for quite some time, despite having a reservation and despite arriving earlier than a group of the same size that got seated before us, the host gave us a table of complimentary appetizers. I appreciated that gesture, and the dishes they served were quite good–prawns and oysters. Unfortunately, taking a star away because of their decision to seat a group before us who arrived after us.\n\nAtmosphere 7/10\nVery classical style interior, classy and dim lights.\n\nService 5/10\nQuite disappointed by the way we were treated while waiting for our table, but after that, they were very attentive and accommodating."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1M3Aza0VREAE",
            "text": "Came here for restaurant week. Was able to make an impromptu reservation a couple of hours prior. The waiter was very nice and kept asking if we needed anything else. The bottle of Riesling was beautifully paired with our dishes. The…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHelpxVzV3RRAB",
            "text": "We have visited Giorgio’s twice in less than one-month. Both times the food and service have been phenomenal.\n\nTheir Don Julio 1942 margarita is one of the best margaritas I have ever had. Their burger is also great! Which was a pleasant surprise for a Italian restaurant, so much so, that our second visit was due to a craving for their burger and fries. Vodka pasta, great 👌Mushroom pasta, great 👌Salmon, great 👌\n\nThe ambiance is not the most trendy (90’s FRIENDS vibes) but I’ll accept good service and food over a “trendy” restaurant setting anytime!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNzhlWHB3RRAB",
            "text": "Super nice staff was able to fit us in. The food was delicious, like absolutely outstanding. The seafood linguine was delicious and so was the grilled octopus. I highly recommend going. This is one of my favorite restaurants in New York."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNteWZhS2RnEAE",
            "text": "Went here on New Year's Eve , had a reservation, I was seated immediately. Had a Phoenix cocktail to start , it's a mezcal cocktail and was nice for this time of year. My 2nd cocktail was a Mr Bourbon Toddy and it's big ! Too be honest if I'd gotten that first I would only have had one cocktail, it's enough for 2 people to share. My friend had a Paper Plane bourbon cocktail which is sophisticated and different. I liked that. And an blue Aviator cocktail which was nice but might be better in Spring or Summer. Started with Roasted Bluepoint Oysters appetizer which is delicious! Don't skip the appetizers! There was an earthy nice flavor on these roasted oysters and the juice left in the shells was nice to dip bread into ! The Charred Octopus was nice appetizer with chickpeas and greens too. For main I had the Salmon which was cooked great and had tasty grains with it. My friend had a steak which he liked and it came with tasty fingerling potato with fried herbs that was nice. Skip the side of fries as they're basic. Side of mashed potatoes would be better as they are homemade tasting and really nice and fluffy. Jazz soundtrack was playing as well as live band at one point. This is a classic place , great to bring out of town family . Definitely don't be in a rush when you come. Staff are nice ."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtdVBLekV3EAE",
            "text": "This place is the best little spot for an intimate date. Excellent atmosphere, food and warm service.\n\nThe seafood is especially good and fresh. I just moved here but have tried this place for lunch and dinner.\n\nGreat wine, great cocktails. The owner and GM are Greek so there is a surprisingly large selection of Greek wine. As a sommelier, I love Greek wine. It’s the best value on the market currently.\n\nIt even has banquet space for up to 70 people upstairs.\n\n6/5 stars if I could. The best of the old worlds food traditions combined with the warmth and innovation of New York."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhaHVYdmtnRRAB",
            "text": "Went for lunch with coworkers. Service staff was friendly and attentive. Everything we had was good. The charred octopus starter was amazing and i highly recommend it. Can't go wrong with any of the pasta choices. Good food portion!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaODVxSmh3RRAB",
            "text": "Local Italian eatery. Fresh seafood, pasta and steaks. They have a good wine selection and full bar. There barrel aged cocktails are great and strong. They have outside seating and the atmosphere is very happening. Service is attentive and quick. Overall a good place to hangout or grab a bite with friends and colleagues after work."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlMVBUQkNREAE",
            "text": "Great service very attentive.  Ok ambience. It’s quite loud though.  Try the Chilean sea bass special. It was so good. The cedar plank salmon was also good. The seafood linguini also good but needed more garlic to seal that deal. The chicken martini left much to be desired. It missed the mark by far. I do not recommend that dish. The Giorgio cocktail was very good. The bread pudding was really a brownie with ice cream on top.  It was good but it’s not bread pudding."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtbFotNm1nRRAB",
            "text": "We came here on our minimoon to see NYC during the holiday. I choose this place for our first night. IT WAS AMAZING!!!!!! Beautiful, quaint, great staff and delicious food! I would definitely recommend, We would rate it 10 stars if I could!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHMWZUSXBBRRAB",
            "text": "I stopped at Giorgio’s for an impromptu dinner and it exceeded all expectations. I had the bet salad and it was amazing. All beets and veggies  and no lettuce, but it was delicious. I had the fettuccini with mushrooms and added grilled chicken, for my main. It was absolutely delicious. The bartender, David, was also incredible. He knew the menu and drinks like the back of his hand and served the bar with graceful ease. I will definitely be going back."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLbFlXUXZBRRAB",
            "text": "The scallops and the octopus here are yum! We came back and had the seafood pasta and funghi fettuccine - soooo good. The staff is very friendly and attentive."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBNnZpeGpBRRAB",
            "text": "Came here for restaurant week and they were quick to inform us of a time limit, which I appreciate. The waiter was still super accommodating and even replaced my friends drink (to a good old fashioned) when he noticed her barely touching the first drink.\n\nService was quick but courteous and the decor is great for a date night."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbWZ6bEVnEAE",
            "text": "Quaint,  cute, delicious food.  Upper quality food and delicious veal. Bread was made in house and not horrible. Needed some help as far as bartender services and willingness around a dirty glass."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaOEttU0xREAE",
            "text": "Super delicious place for lunch or dinner. Everything we got was extremely tasted. Excited to come back again and try other dishes. Highly recommend."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhaWFMa1p3EAE",
            "text": "Perhaps I ordered the wrong things but not too many items I ordered were wow. It was good but nothing that left a big impression. The drinks were quite good though.\n\nOrdered the grilled octopus, grilled calamari salad, spaghetti alla pesto, bucatini Cacio e Pepe and Mint-pistachio crusted rack of lamb. Within the lamb dish there was a bone marrow & wild mushroom polenta flan which was actually my favorite part of the entire meal."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlZ2JTZm1BRRAB",
            "text": "Wheelchair accessible seating in the front by bay window.  Learned of their fresh pasta made on location.   Tasty rack of lamb properly prepared!   Exceptional timely servicing."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHaWZ1OFlREAE",
            "text": "The ambience of the restaurant is very good. The food quality is strictly okay. But the restaurant is exorbitantly expensive. I feel that the quality of the food does not justify the cost. The selection of wines were pretty good. Overall the experience was just okay!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhenNhZkJBEAE",
            "text": "This was my first time here and what an amazing experience with take out for restaurant week. The sever was attentive to me while I waited, the manager checked in and was friendly and even a follower regular was engaging.  My order was…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtenNyMVNBEAE",
            "text": "My friend suggested this place for dinner. I got the steak and my friend got the tomato pasta thing. I don't remember those menu's names. Mine was quite heavy to me. Of course, it's a steak. Lol. The portion was quite huge to me. I couldn't finish all of this. My friend's one was delicious. Especially the pasta! And the meat was fried like a Katsu! Chill environment w a glass of wine! But a staff kept asking whether you need anything else.. quite too much...😂 It got us a little bit annoyed.... he kept cutting our conversation by asking..haha...except for that, it was good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMycWVQZTFBRRAB",
            "text": "What a cozy, romantic place.  Found this for Restaurante week and went on a weekday for dinner for $59.  Three courses with options and none of them were disappointing.  Sadly, they were out of the initial wine choice but did have my second in stock.  The service was good, and we had reservation starting at 6:30...we ordered dinner around 7 (part of the party was delayed) and we didn't leave until 8:30.\n\nI ordered he mushroom truffle soup, braised short ribs and s'mores bread pudding for dessert.  The rest of the group ordered the Branzino, Duck, tuna tartare (they substituted salmon as they were out of tuna) and the trio gelato.  I only tried the Duck which I thought was delicious.  However, the braised short ribs where the best out of the four dishes.  The s'mores bread pudding was super rich...wow.  Thankfully they gave vanilla gelato with it to help cut that, but it was still rich.  The trio gelato was the best for dessert as you got vanilla, chocolate and strawberry.\n\nI'd totally go back to try other items on the menu."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJZ3RTeHlRRRAB",
            "text": "Good food, but quite overpriced. I really liked the burrata and the scallops dish, and the dessert was rich/decadent. Ambience is nice, but a bit too dark and tight for me liking. A good spot nonetheless!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtaDRiZ213RRAB",
            "text": "Go to spot for exceptional food in an intimate setting. Ernesto is an amazing waiter and knows what to recommend and provides such a high level of service. The long narrow space has a New York feel and the food is always satisfying."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsbnVIejJRRRAB",
            "text": "Ernesto was a great server! Atmosphere and food were great. The pasta tasted FRESH and did not wait long for food at all. DELICIOUS AND I WILL BE BACK!!"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBaW9TTXZnRRAB",
            "text": "I stopped here once in the afternoon (last July as I recalled). It’s a nice place, looks very luxurious that me and my friend were taken aback despite looking up for the price before we walked in. It wasn’t busy. The server (I think the…"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJNWJ6YXFBRRAB",
            "text": "Within a stone's throw of the Flatiron building, this delightfully warm and cozy Italian restaurant is something of a hidden gem. I sat at the bar, and was welcomed and treated more like an old friend than just another customer. The food is…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQybTlfRURnEAE",
            "text": "Delicious Italian food, ordered the octopus, Caesar salad, the seafood linguini, mushroom fettuccine, rack of lamb, and chicken parm- everything was great! Classically styled interior and solid service as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURacHRtOWJBEAE",
            "text": "The bolognese was a little too rich/creamy for my taste, but was ultimately good in its own way. Service was very good. We also enjoyed the desserts."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzNlpueU1nEAE",
            "text": "Restaurant week dinner. Attentive and fast service by our waiter.\nLamb shank was great, juicy and falling off the bone. Wine pairing was just right, specially the port at the end with dessert"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1bzlEMWhnRRAB",
            "text": "Giorgio’s of Gramercy is one of the few restaurants in the neighborhood that still carries a local charm and exceptional service. For a succulent starter try the grilled langoustines. The food always seems to exceed my expectations at this place. The Baked Alaska dessert (a cake, strawberry gelato and méringue) is my favorite dessert-You can’t go wrong! It was probably the best dessert I’ve ever had. Thank you to the GOG Staff for such a pleasant dining experience!"
        }
    ],
    "reviews_count": 80
}