{
    "name": "Bella Union | Rooftop Bar",
    "place_id": "ChIJhWLyL1FZwokRq5e_w2IWYx0",
    "grid": "MN6",
    "address": "411 3rd Ave, New York, NY 10016, USA",
    "rating": 4.4,
    "user_ratings_total": 423,
    "phone_number": "(646) 627-7841",
    "reviews": [
        {
            "date": "수정일: 1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSllVaDRVek50YmpaTWFuQjNOMWcwWjNRd2RGRRAB",
            "text": "From my mother, who would like to share this review:\n\nLast night we celebrated my daughter’s engagement party at Bella Union. I would like to thank Carly, who patiently answered all our questions via emails to get information about the venue; Sarah, the events manager, who was there every step of the way to make sure everything went smoothly; Alison, the bartender, who made sure all our guests’ needs were met; and the staff who constantly made sure there was abundance of food for our guests.\nI would like to thank you all for making this evening a memorable one for my family, friends and especially my daughter and her fiance.\nI would highly recommend Bella Union for any one considering holding a special event and again I truly appreciate every thing you did for us."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUFdHMXVTV05UUkdwMWVHdHhNVkZTYTFkaVVXYxAB",
            "text": "Friendly staff .good good and amazing place ..great music"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQeUpxVWNBEAE",
            "text": "I really love this place, been coming for a couple years now."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSFdXTTJiM0ZUVEdWNVZVSjVlVWRUTWpSbFJHYxAB",
            "text": "Bella Union: NYC's Happy Hour Holy Grail! Seriously, if you're hunting for the BEST happy hour in all of New York City, your search ends at Bella Union. This place is a hidden gem!\n\nThe drinks are expertly crafted: they don't skimp on the alcohol, and the menu has something for everyone. What truly sets Bella Union apart is the atmosphere. It's upscale and inviting. Making it the perfect spot to unwind after work or kick off a night out.\n\nBut the star of the show is the prices! Unbelievable deals and incredible value. With happy hour this good, you can keep the party going all night long.\n\nIf you're serious about your happy hour, Bella Union is a must. Don't miss out on this NYC treasure!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0cFlqRldTMUJHZVdnMFRHZExSR3d4VHpSV1MxRRAB",
            "text": "Amazing"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTk9VZzJlbkpvVjB3NWIxRlBWSEpwVXpZMVUwRRAB",
            "text": "We had a Fantastic lunch today & the bartender was excellent . Bravissima."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaeWREUlhkV3RHU1RoTmRWVmhjQzFHWDNFNE5FRRAB",
            "text": "I selected this place to host my daughter turning 17 years old with 15 of her friends. They were so accommodating. No down payment was required no minimum spend. ALL the food was good !! But best of all was the server . I didn’t get his name but he resembles BENSON BOONE. He managed the 15 girls and the adult table. He was SUPER !!! And there is a view of the EMPIRE STATE BUILDING. Just perfect !!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toU2NWZzVaV3B4TmxaWlkyRkVSWHBVZVUxamMzYxAB",
            "text": "Great rooftop brunch. Love that you get a free cocktail with brunch and the prices are very reasonable. Enjoyed the steak and eggs dish and the eggs Benedict"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wU1FYZFlRM0ZxZEZOUU5VVjFVa1JqWWt0V1EzYxAB",
            "text": "Amazing place for drinks, happy hour, we watched the NFL game and the food was great with amazing service from Zoe, Lorna and Sean!!!! Lovely to meet Irish people in this city!!! Will be back again :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwNlJubEJTV293UXpobVVtOVdkM2hWTm01emMxRRAB",
            "text": "Truly appalled how your staff treated my friend with a surgical boot. Then the hospitality worker at the top of the stairs refused to give her a stool"
        },
        {
            "date": "1달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsc2NrOUZlRjh3VDFjdFVsZDRSRU5KZUZJelIxRRAB",
            "text": "Schönes amerikanisches Restaurant. Bezahlbares und sehr gutes Essen, große Getränkeauswahl. Schnelles und wirklich total nettes Servicepersonal. Hübsche kleine Rooftop-Bar. Hat uns sehr gefallen - fünf Sterne!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWlgwUk5XRXh0UzJkVWFEZHhaRWxIZVU5eVNsRRAB",
            "text": "Definitely a place to go with friends, coworkers, and a date."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWRFJreFFiek40VFRjeVNHNXhablJaTW5FNFlsRRAB",
            "text": "Great spot! Came for brunch on a Saturday, made a reservation for two. When we arrived we were seated right away, if it is a nice day out I do suggest sitting up at the rooftop. The views are amazing and truly set the vibe. The food and drinks were delicious. Our waitress was so attentive and sweet always making sure we were good and had everything we needed. I would definitely recommend this place!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CSVdGYzNUbWQxZVhWM1gzZExlalZwU0RaaGMwRRAB",
            "text": "Tuna bowl was outstanding!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xabVp6WjFNMUJqVFc1aldqUmpVVXhhYkRGNWFGRRAB",
            "text": "Visited for the first time on Sunday 8/24/25 and tiu are welcomed with a smile by the young ladies at the reservation booth. Everything was great and Jenny our waitress was very welcoming. She has a “smile” and “personality” that shines. We will remember and recommend. Thanks Jenny for making our visit a worthwhile experience. Mattie"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1cmFuZFVObVp3UTNWb1ZGTlhZakZuTkdnemJsRRAB",
            "text": "Extremely cool place for drinks. Great view. Nice staff."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWlRqRmtNMFoyZVZGdGFtWlBUa3N5ZEZVNFlrRRAB",
            "text": "$5 espresso martinis on Tuesday honestly can’t beat it!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214eFNYQTVjRlJmUkdvelIwOHlRbUZFVFZOMlZrRRAB",
            "text": "Bella Union is a fun pub. It has the reclaimed wood aesthetic of The Penny Farthing blocks down the avenue, but it has the advantage of a rooftop terrace that is often open. My only gripe so far is I wish it had a couple more craft American beers on tap. But their cocktails and food are above average for a downtown pub. The burger is excellent. The service is speedy. I plan to visit again soon!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOemNURXRWVnBMV20xblRYTjZRbGx5Ukd4ZmVFRRAB",
            "text": "From the moment we were seated, Sarah made our dining experience exceptional. She greeted us warmly, was attentive without being intrusive, and anticipated our needs before we even had to ask. Her knowledge of the menu and thoughtful recommendations elevated our meal, and her genuine kindness made us feel truly welcomed. It’s rare to encounter service that feels both professional and personal, but Sarah delivered it effortlessly. She’s a true asset to Bella Union, and we look forward to dining here again thanks to the outstanding experience she provided."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKaWNYWm1UR1ZXUkZOSVYwZzVZemRFTlRSb2JGRRAB",
            "text": "I spilled a drink here and within 2 seconds there were 2 waitresses on hand to clean it up, rescue my phone and suggest we move to a different table. One of them then brought us another drink at no additional charge. The fault was entirely my own. 5 stars."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWNGVtZEVhUzFIVW5KZkxVaEpVVTV2ZWtvelRWRRAB",
            "text": "Love this place, great rooftop with a view of the empire state building."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOYVRGTndZbkJyZGpOcGJVMWpYMmM1UzA5VlIyYxAB",
            "text": "We arrived after making a reservation specifically for the rooftop, and after walking 20 blocks, the hostess told us it was closed.\nVery disappointing  this should be clearly stated and updated online, and reservations for the rooftop should not be available if it’s not open.\nOther than that, the service was perfectly fine and the food was very nice."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xcmNUbEVSbEoxTm01NVFUVlNhMnRaZGxKTGExRRAB",
            "text": "The pizza felt store bought\nThe rest of the food was decent\nWe came for the rooftop and even made reservations, just to find out it’s closed with no notice or anything\nVery disappointing"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xVGJ6TXdVM0JsVTFkaWRHcFZTRGxrUkZWRk1HYxAB",
            "text": "La comida muy buena ,comida normal y real . El precio fantástico y personal muy amable. Lugar cómodo . No se puede pedir más."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsT1pIQm1lRkJmTUdNM1dXNVFlRVJ5V2tWMllXYxAB",
            "text": "Fun rooftop, delicious burgers and enjoyed the frozen margarita. Deeeelicious!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1cWF6TkZUWE5KT1daVGFpMVpNM0prYTBoUGFFRRAB",
            "text": "The filet mignon sandwich was SO GOOD!\nAlso, I love the music they were playing. Would definitely return!\n4 stars for atmosphere because the bar area near the tables were very crowded."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVGRsYzVOVjlpVWt0RGNubE1kRkZZVmtWaU9YYxAB",
            "text": "great happy hour, the servers are cool, & bangin food!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsR1VuTnBaWFl5YVVJNFNWbERWSGt6TWtWdWRGRRAB",
            "text": "Delicious food not salty very well seasoned you will not be disappointed"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21keVowZHNWWFp1ZFZReVkzTmFiblF3T0VkYVpXYxAB",
            "text": "Great service. Roof deck was a little cheesie the night I went. Worth another try."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WU9UVTBVVkpZUzJaVlpXeEtiVEp3UjJoMVZVRRAB",
            "text": "I had a terrible experience here. I came here for happy hour with my gay best friend. Grace was an amazing hostess but the manager and the bouncer were awful. The second we walked up they said his ID was fake. They were rude and didn’t know…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOT01sOTVkV1JwY3pkQlRYVk1la1pDWkhSSVpVRRAB",
            "text": "Happened to pop in to meet some old friends from the UK and ended up staying the afternoon. Great location, staff and view from roof terrace."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twbmRXdHFXRFI2ZEMxb1RVUmZOR3gyUWpkTlduYxAB",
            "text": "It is now unfortunately the case that I have review stalkers. They sit in the shadows and await my comments on everything from train stations to schools, entire airports to tiny burger franchises that often go out of business as fast as they appeared. I imagine, if you have read this so far, then you might well be one of those individuals. If not , then I had best get on with some kind of review….\n\nI was at a work event so as far as I could tell, everything was free and plentiful, which is always a good start for a bar in manhattan. However if you ignore this component, as I’m not sure the same will apply to you attendance, then you can take away the fact that the servers were super efficient and completely unforgetting (in the good way that they would always remember the order). So do visit this place, and lastly, hi kids 👋"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKek1qWkZWRGRKWVVobk4xTnhUV2xKYm0xMFNYYxAB",
            "text": "Food and Service excellent, my only complaint was it was extremely loud."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRmRsOVFMWHBJYkRkb1ZtNDNhVTFKWjFKaVVtYxAB",
            "text": "Came here for an event on the 2nd floor. Loved the ambiance and will be returning for another get-together."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMcWE3b09VOTZydXRRRRAB",
            "text": "Not good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQQ0t3SnlyMXNqQWlBRRAB",
            "text": "A perfect neighborhood spot with excellent food, wonderful servers and a vibrant rooftop. There are different specials most evenings as well and a great happy hour til 8 pm!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQUGYtY19PeUkyWmJREAE",
            "text": "Nice to get a drink with friends. The rooftop is small but nicely organized"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPVDVyNUdJMU5PaDlRRRAB",
            "text": "Fantastic burger... fantastic Makers Mark @ the bar.  Great last meal in NYC before heading back to Houston.  Great atmosphere."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJZmQ5NlRDa2ZyTjNBRRAB",
            "text": "This is a great restaurant with delicious food. They run specials Monday, Tuesday, Wednesday and Sunday. I went on Wednesday and got their 10 dollar burgers. It was well worth the price.\n\nThe restaurant has a great atmosphere and the service was top notch. They also have a balcony and you can go outside and enjoy a nice view of the city.\n\nMy one complaint is the stools they have are very uncomfortable. It was really awkward to sit on them."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMellrT3ljbi11RDJRRRAB",
            "text": "Good food average cocktails"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOT2UzSXYwOG9yMFFBEAE",
            "text": "Good food and an amazing atmosphere!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLWDJ6ZFRib2N5S3lBRRAB",
            "text": "Third floor bar for a private event, drinks were tasty, chicken strips were good. Sliders, meh.."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VKT3BzcXZ0ek1yTlFBEAE",
            "text": "The entire venue, spread across three levels with a stunning rooftop bar, is really impressive. The service was good and the staff were super friendly. Unfortunately, the food was very disappointing and didn’t live up to the rest of the experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMZjlpYkt5ak55d2JREAE",
            "text": "Great spot and happy hour! Burgers are great!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOaW95YnlobUppZnZnRRAB",
            "text": "Great food and vibes and to Sean the waiter my mum wont stop talking about you she loves you your service was great xxxxxxx"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNdnBsb1g3cUpfVzV3RRAB",
            "text": "Waitress was nice and manager was awesome"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbmFqQ2R3EAE",
            "text": "Rooftop!  Yay!  Busy place.  Medium nyc prices [$16 Burger and fries, $16 kahlua and coffee] one bill per table."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaTZTaHBRRRAB",
            "text": "Vibe and service are awesome. The food was awful. I took mine to go. Tried a bite of each dish and threw it out. Inedible."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJN2NQOU53EAE",
            "text": "Our server Sean was amazing! We came for the $8 Aperol spritz (which honestly in this economy is a bargain) and stayed for the atmosphere! Service was above and beyond and so personable!! Not my first visit and definitely won’t be my last! First time for food and the goats cheese balls were so so good!!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINkkyc1hREAE",
            "text": "The service and atmosphere of Bella Union was remarkable! The servers are very kind and are very patient, it didn’t take long to be seated, and the menu options have a large range of things to choose from! The rooftop itself was very floral and urban— with outstanding views of the city! In fact, I feel as if this place is very underrated and lives up to every single review. The food is incredible and the ambience is something every New Yorker would love to engage in. I went for lunch with a friend, the servers, the staff and even front desk were extremely nice with impeccable service. Great overall!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNnEzZjNnRRAB",
            "text": "I came here on a Friday night with three others in early July around 645pm before a movie we were seeing around the corner. We didn't have a reservation and were able to be seated immediately.\n\nThis is definitely a bar with a standing area mixed with dining tables. Despite the bar vibe/atmosphere, it was not obnoxiously loud and was well air conditioned on a hot day. We ate in the ground floor restaurant and did not go to the \"rooftop\". The food and service were fine.\n\nI probably wouldn't come back here unless someone else invited me. I also would not recommend. This place, like many in the neighborhood, is worthy of definitive \"meh\"."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKeV9Dc3ZBRRAB",
            "text": "What a beautiful Place to Dine and Enjoy good Company! O’Neal was very friendly and made recommendations! The wings were amazing! Nice and crisp and the right amount of heat. The French Fries was also perfect! I did not love my salad… too much arugula but I was told that the burger was really good! They enjoyed drinks! My water quenched my thirst perfectly!!! What a lovely time we had! … and the bathroom was clean! Thanks!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyMmUzbmpRRRAB",
            "text": "We stumbled upon this place with my friend completely randomly, but we were very pleased with the experience because the food here is really delicious! I recommend the NY strip steak salad. We happened to come during the lunch special, and the prices pleasantly surprised us. Generous portions for very good prices! Beautiful decor, plenty of space, and a wonderful view. The service was 3/5; the waitstaff wasn't very friendly and forgot to bring our drinks, but the food, prices, and decor made up for it. Overall, a wonderful experience. The place is quite popular bc on Friday afternoon it was already very crowded. Def recommend this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyeExuSG5nRRAB",
            "text": "Literally delectable. Googled for a good eggs Benedict with a nice view near me and my desires were DELIVERED. The food was a 10/10, my mocktail, “Good Luck Babe” was great as well. The potato fries were definitely my favorite addition to the entree which ended up being a very reasonable price as a whole meal itself. The staff were also just very very nice to greet and seat me. My server was even more eager to be of service as well and I felt very welcomed at Bella Union! I’ve already recommended it to a few friends and I’ve totally found my go-to rooftop spot for the future. ;)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMMTlMMjNnRRAB",
            "text": "We went here to have dinner on a hot Sunday evening. The upstairs terrace had a nice breeze and a beautiful view. We enjoyed the water melon & feta salad, beef salad and  tuna bowl very much and the service was super friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINS1PYmRREAE",
            "text": "FANTASTIC!!\nWe were headed somewhere else but super happy we ended up at Bella Union. We shared three appetizers and had delicious cocktails. The atmosphere is trendy & fun.\nService was a group effort and impeccable.\nI highly recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1dFBxNVZ3EAE",
            "text": "Great after work spot for happy hour. Rooftop is 3 floors up. Place is pet friendly and very upbeat. Service was quick, drinks were strong and everything on the menu was delicious. Highly recommending the spicy habanero wings! They were tasty and spicy! Also, the tots were perfectly crispy on the outside but soft on the inside."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGaGJ5UlpREAE",
            "text": "Great spot all around especially for happy hour! Friendly and attentive service, broad menu, nice happy hour, plenty of drinks. I love the spacious multi level atmosphere. There is plenty of room to sit at the long bars, tables, so great for groups and private events.The rooftop is great, for dining and also happy hour. I enjoyed the Italian sandwich that was freshly sliced and yummy fries for dinner, but there was plenty on the menu I'd comeback for. Enjoy!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXMDhXX1FnEAE",
            "text": "Really nice decor and ambience, good number of options for food and drinks with good portions, reasonably good food and drinks (I am told), large amount of seating including rooftop (and 2 floors) typical Manhattan crowd.\n\nWe went as a large group for a farewell dinner and spent about $70 per person for average 1.5 drinks, half a starter, one entree and one dessert.\n\nOf the starters I would recommend the tots and wings (guac didn't have much salt), entree I would recommend the Salmon, grilled chicken sandwich and the burgers. Dessert the vanilla ice cream tasted funny, but the chocolate cake was good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkOUpfMnFRRRAB",
            "text": "This spot in midtown has a romantic vibe and a delicious eclectic menu perfect for date night.\n\nEvery Monday and Wednesday is Prohibition Hour which includes unlimited cocktails and the app platter seen here for just $30! An insane deal.\n\nHere were some of the menu highlights:\n\n🍣 TUNA CRISPY RICE\n🍯 HONEY RICOTTA CROSTINI\n🥩 NY STEAK & POTATO FLATBREAD\n🍝 BELLA PASTA\n🥖 FRENCH DIP"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnZzduTkhBEAE",
            "text": "They do an excellent $10 lunch burger deal, it was excellent, and I was able to easily switch the fries to be sweet potato fries at no additional cost, will definitely very back!\nThe beer was +$10 on top, go figure, maybe order the water if you're coming here on a budget 😉"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwM2NUQ1JBEAE",
            "text": "The place is rustically beautiful, but that was kinda of it.\n\nCrowd & Culture: 3 out of 5\n....NYU-centric. For a while I was the \"darkest\" skin toned person there. Eventually , three persons who were black arrived. It was a little weird we were all sat \"together\" (one behind us, and the others beside us) when a lot of space opened up, but I can't say it was done \"on purpose\".\nMost people seemed to be 17-25\n\nThe Wait and Accessibility: 2.5 out 5\nThere was a wait to sit on the roof that afternoon, but it wasn't a terribly long wait. There are A LOT of stairs and I did not see any ADA access or accommodations at all.\n\nDrinks: 0 out 5\nWhen we first got there, I ordered a French 75. It was mostly lemon juice, no champagne, and I'm guessing Gin (it didn't taste like it at all). Whatever the lady used to give it fizz, was awful. I asked her if she'd given me a French 75 (just to be sure I didn't accidently recieve something else), but she was sure that's what it was. It almost tasted like a flat prosecco or flat club soda. I'm a winemaker and own a few wine companies. This is my go to drink. This wasn't a French 75. I tried drinking as much as I could because the bartenders attitude,when I asked about the drink, gave off the energy that she wasn't going to want to have to correct the drink, and I don't like to waste.  However, I couldn't continue to drink it as it was making me queasy.\n\nFood: 3 out of 5\nI ordered the steak au poivre (burger & fries) 2.6 out of 5\nBurger meat was cooked decently, but the overkill of the sesame seeds made it unbearable. I did ask if there was perhaps a brioche since they were attempting a french burger (brioche bun is a far better option), but there were no other options. The fries were decent\n\nMy brother ordered the mac & cheese 3.4 out of 5\nServing size was snack size, which was shocking for a $15 main dish. The consistency was pretty decent. However, it was more cheese than pasta (which can be a plus or not)\n\nService: 3.5 out of 5\nOur server was highly distracted, but that may not have been their fault. They weren't timely on bevs, and I had to ask several times for the sauces.\nWhile being kind is the bare minimum for any job, it's still nice that the server was not rude.\n\nView: 2.5 out of 5\nIt does have a \"view\" but you can only see it if youre sitting on that side of the patio. It's not a great view as the roof top isn't very high, but it's reasonably nice.\n\nTotal, I would give this place a 2.5 for my experience. It wasn't so gawdful, but I don't think it was \"worth it\" to go again...unless the menu and drinks greatly improved. Above all, there needs to be ADA accommodations made. I've quite strict on places about this."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNONXVmTzZRRRAB",
            "text": "We’ve done a lot of team events at Bella Union, and we can't say enough wonderful things about this place.  They have a fantastic team, making you feel welcome each time. They have a nice rooftop view adds a special touch to the experience, and the food is downright delicious! We highly recommend booking your next event with them!💯"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwamZ5X1JBEAE",
            "text": "I would recommend this space for a cute event.  I came here for a baby shower on the third level and even from the entrance I was like “oh this place is cute”. It has a great location with a really nice atmosphere and decor. This reminded me of the rooftops in LES but less of a trek. I heard the food was good and the mocktails I had were enjoyable. I definitely will have to come back here!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNThDNFJBEAE",
            "text": "This place was super cute and my food was amazing! Definitely recommend the French toast, so yummy. Had some drinks and the were equally as good. Came here for a brunch and we were on the rooftop. Definitely the place to be when dining in. The view is beautiful."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwd05MUHFnRRAB",
            "text": "Amazing place for a view of the Empire State and Chrysler building if sitting near the edge. Food was okay a bit dry but tater tots and mac and cheese were great! Service was also amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkcU5mUVdREAE",
            "text": "We had a private party on the 2nd floor.  The space is spacious and accommodating for 30+ people. Decor is nice and well lit. The food provided was excellent bar food. They did an amazing job considering our groups shinanagans. Kudoos to our bartender (red head tiny lady) who managed a crew that size without breaking a sweat. 10/10 will do that again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5dWZuUnVBRRAB",
            "text": "Randomly Found this Place for lunch and I ABSOLUTELY LOVE IT !\nThe Atmosphere, the vibe , the food and the Service are just amazing !!! Zack was a love and super helpful . Stayed for dessert and even had two more friends join us because we just didn’t want leave !!!\nThey have so many great options for food as well as a lunch menu and prices are just perfect .\n\nI’ll definitely be back to try the drinks and enjoy their rooftop !!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqMGQ2M3VRRRAB",
            "text": "What a bizarre experience. Saw the sign for rooftop happy hour. On the first nice day in the city, I decide to get a beer at the “rooftop bar”. I double-checked with the hostess, ordered two beers at the bar below, and then I'm told I have to get a side of fries to drink on the roof AFTER the beers are poured, no refund. Seriously? You have to order a side of fries to drink on your supposedly rooftop bar? What a joke. The place was empty. Vibes are way off."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MUtHdDhRRRAB",
            "text": "I hosted a party here & could not have had a better experience; the space was gorgeous and spotlessly clean, staff were all SO nice and the booking process super easy.  Everyone had a great time, thank you so much Nikki & the rest of the staff at Bella union :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5Mkx6TTd3RRAB",
            "text": "Def a solid rooftop bar for an early spring rooftop drink!\n\nShoutout to Zach, who was the best server ever—super thoughtful and kind when explaining that we needed to order food to get a table.\n\nRecommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPeHBqMUx3EAE",
            "text": "Nice rooftop with a good view of the Empire State building. Was disappointed with the cocktails though, too citrusy. My boyfriend got the Old Cuban. I got the Strawberry Ginger Mint Love Potion ($20 with tax and tip) and it was poured out of a pitcher. If I wanted jungle juice out of a pitcher I would go to a frat party instead."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKMW9pZHF3RRAB",
            "text": "Nice space with good happy hour drinks. The high ceilings give the bar an open feel without it being too loud. There are 3 floors."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocmR6WEdBEAE",
            "text": "Excellent bar and has a lot of sitting and dining options. There is a lot of group for group-based events and also outside sitting is an option.\nThe staff are great!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndTdMcUtnEAE",
            "text": "Bella Union was fantastic! We used this venue to host our start of semester social for our school’s student association board and it was a hit! The drinks & happy hour specials were very worth it & delicious. The beautiful views outside the rooftop were hard to beat! Definitely recommend this place to host unforgettable events!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCZ1AzcWVBEAE",
            "text": "You can be on any floor here & it's a great vibe. Rooftop is the nicest spot & they have individual overhead heaters."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQaHF1WENREAE",
            "text": "I recently hosted an engagement party for my fiancé and me at Bella Union, and I cannot recommend this place enough! From start to finish, the service and communication were absolutely incredible. The staff made the entire process so easy and stress-free, ensuring that every detail was taken care of flawlessly.\n\nThe food and drinks were absolutely delicious, and our guests couldn’t stop raving about them. Special shoutout to Jen, the amazing bartender, and Sarah and Niki, the fantastic party coordinators, who went above and beyond to make our event perfect. Everyone who worked there was so friendly, kind, and genuinely helpful.\n\nIf you’re looking for a venue to host an event, Bella Union is the place to go. They exceeded all our expectations, and I would recommend them to anyone wanting to create a memorable and seamless celebration! Thank you, Bella Union, for making our engagement party so special!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQaHV1eWV3EAE",
            "text": "We reserved the mezzanine bar area on the 2nd floor for an engagement party and it was perfect. The whole Event staff (Sarah, Nicki) were so friendly and flexible when we were initially booking the space. The night of the party went so smoothly and Jen behind the bar was so kind and helpful. The people, the vibes, the food, the drinks, everything went great. My first choice for any future event in NYC!"
        }
    ],
    "reviews_count": 78
}