{
    "name": "Rossini's",
    "place_id": "ChIJV6mJyQZZwokRPoUsJJjsgoI",
    "grid": "MN6",
    "address": "108 E 38th St, New York, NY 10016, USA",
    "rating": 4.5,
    "user_ratings_total": 669,
    "phone_number": "(212) 683-0135",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sYU4zTjBkVlU1ZFdGakxWcGhPVEZFTlVSMVdrRRAB",
            "text": "Exceptional service and dining."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OUlZFTmhkVGRsYjNwSlJEUTRibEUwZVhWb1NsRRAB",
            "text": "Food and service are always top-notch! The staff was very accommodating when last minute are group # increased from our reservation.  The staff is always very attentive and the food very fresh and tasty!"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paeFFrTTJlbFZSTUZNNVJURndSVEpHUVZWcWJXYxAB",
            "text": "Excelente atención, deliciosa comida, el lugar es encantador lo recomiendo"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GM1pHMVFlbTloYVU5cFFUTkZSMDVKY0dkQ1IzYxAB",
            "text": "Exceptional appetizers, mains and desserts; attentive and on-point service and fair pricing for the location and offerings at lunch. Returned for dinner. Again, a terrific beet salad, delicious veal sorrentino and (for dessert) a small pasta Alfredo.  The montepulciano was a bargain at 55$.  The noise level descend as the evening aged."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odVpsSlZiV0ZTWTNZNWMxRlBlV0ZrTlRKTU1GRRAB",
            "text": "The food is always excellent, the staff goes way above and beyond to make guests welcome. Rossini's is a treasure and I hope it continues to thrive well into the future. The definition of a neighborhood gem."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GRVdpMDVWVEo1Vm5GQlRFaDFVM1JwWVdZeFJXYxAB",
            "text": "Excelente lugar para una reunión familiar muy tranquilo muy rico todo bebidas comida y atención exentelugar  😊😉🤗"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCMWF6QTFjVlJDWVV4aVRsOHhlR1Z5WDNRelYwRRAB",
            "text": "We had a wonderful lunch. The food was incredible and the service top notch. Welcomed into the restaurant and not rushed to leave. Very enjoyable!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsd1MzQTRaVWxpYWxoVFpXMUZkbE5qWXpreE4yYxAB",
            "text": "Fantastic experience for dinner. Grabbed a drink in the bar room beforehand, their martini was fantastic. Then dinner in the back dining room which was excellent. Highly recommend."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwNEp5NjBRRRAB",
            "text": "EXCEPTIONAL FOOD, even better service. Worth every penny. Old world charm. Definitely try this."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xVmRtcGpSalptZG1oWWFEVlBYelpUUW5oNk9GRRAB",
            "text": "Best lasagna made with sausage and bolognese sauce I have ever had.  It was highly recommended by my server.\nThe entire staff is extremely friendly and competent.  The rooms were beautiful and very tastefully decorated.\nEverything gets 6 stars.  A wonderful dining experience. A little  pricey but worth the cost.\nI will definitely be back."
        },
        {
            "date": "2달 전",
            "language": "ja",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OcGMyWTBNSGhFVG0wNFdrOTNWVkpYTW1sd1ZVRRAB",
            "text": "目立たない場所にありますが、全てに良心的で質の高い料理を提供するお店です。パスタメインの注文でしたが、心から楽しめたひとときを過ごせました。感謝致します。"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FMFpYUlhWMXBXUTNNMFJuWndlbmhQYm5Ca05sRRAB",
            "text": "The food is absolutely delicious ! I’d definitely go back . My husband took me there to celebrate our anniversary and we had a great time, food is amazing . The restaurant has a vintage Italian style. Everything was perfect !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCSFZUaENOa2hMUjNReE9VVlZiMDFZVWpka1IwRRAB",
            "text": "Piano starts at 7. Excellent service. The best, most authentic Italian food we've ever had. Highly recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205ak9VUkxTVjlGV21WNU1VSldlR3g2ZVZCek9WRRAB",
            "text": "We recently dined at Rossini’s on 38th St in Manhattan, NY, and it was an absolute delight! We savored the Tortellini alla Rossini, which was rich, creamy, and bursting with flavor, and the Saltimbocca di Vitello alla Romana, perfectly tender with just the right balance of savory notes. Every bite was a treat! The atmosphere was lively and fun, creating a warm, inviting vibe. What truly stood out was the team approach by the servers—they made us feel like family, with their genuine warmth and attentiveness. I can’t wait to return to Rossini’s for another memorable meal! Highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210aVVtTm1la1pzT0U5Rk5HWndWa2c0YmtsYVdGRRAB",
            "text": "Always amazing they have highly skilled opera singers on Saturday’s. I usually get a special, but I’m pretty sure they can make you anything you want."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SbmJEbHJUR3RwVGtoaVNERTNSVVpWYzNsVVJFRRAB",
            "text": "A restaurant right out of the Sopranos.  Food was delicious...beyond delicious. Wonderful old-time Italian restaurant atmosphere. The great American standards, Dean Martin, Rosemary Clooney on the sound system. A memorable experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMT1FqT2kwci1qbFhREAE",
            "text": "Food was good.  Service was great.  We had a large party and they accommodated us flawlessly."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveF9uUlNBEAE",
            "text": "A \"moon struck\" experience"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOWQzVXlnRRAB",
            "text": "Made reservation a week in advance, and had table right next to the server station\nLast time I had veal it melted in your mouth, mine last night was small pieces and tough.\nYou barely finish your last bite or sip of wine … and everything is wisked away , while one of my guests was still eating. i enjoy leisure dining"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcU9uTVlREAE",
            "text": "The food and the staff are fantastic. Also my mother has a server gluten allergy and they have great gluten free options including pasta dishes."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdFl1OHlBRRAB",
            "text": "I have visited Rossini's a few times over the past couple of years when travelling in New York and can strongly recommend it. The food is excellent; my veal chop was overcooked compared to my order (unfortunately this is a relatively common experience in general) but they were excellent at replacing it quickly. The wine is excellent (I am a fan of North Italian wines) and the environment is classy and cosy."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3LW9taUlnEAE",
            "text": "we had no expectation . we got inside just because it was under the hotel and looked fine.\nThe service was excellent. The waiters seemed to sing with their Italian accent.  Their  attitude was inviting making you the filling you are the most important one.it was polite generous with gentle humor.\nThan came the dishes . Everybody was most happy with his order. Perfecto !!\nI ordered pasta with kalamri dhrimpz and oisters. never in my life I ate soft kalamry. WOW.\n\nMOST RECOMMANDED"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3b01MM0t3EAE",
            "text": "Fabulous meal and experience."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ek5Tb3FBRRAB",
            "text": "Average food, quite far from authentic Italian. We had meat drenched in sauce or covered with cheese. The appetizer scallops were generously drenched in butter. The tiramisu struck a nice balance between creamy and biscuit texture."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3OVB2WjNRRRAB",
            "text": "A time machine back to an era of old school Italian ambiance. The chicken dishes are just as good as the carbonara. The night we visited they served lasagna as a special. The tiramisu is the best dessert on the menu. But the cannoli is a close second."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnLU55cFdBEAE",
            "text": "Everything that I had was very good. The Alfredo sauce was excellent. The staff were very classy."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcDYtUThRRRAB",
            "text": "Amazing carbonara and minestrone!! Great service and atmosphere. Highly recommend, they know how to treat customers and it feels like a really authentic New York place."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfaThtTVd3EAE",
            "text": "Awesome place to go. It was my 1st time and we went for my girlfriend's birthday. From drinks to dessert it was awesome. A highly recommended NYC place to go."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfODVLeDFRRRAB",
            "text": "It was a pleasant meal. Lovely experience."
        },
        {
            "date": "10달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmM0lMeFhREAE",
            "text": "Sensationell, wie die Reise in eine andere Zeit…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmckxIZHNRRRAB",
            "text": "Terrible service, pasta was chewy and undercooked"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwOHZTR2RREAE",
            "text": "Classic NY Italian dining"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2LWV5eUtBEAE",
            "text": "Ice old fashion Italian place."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2M3RyQzFBRRAB",
            "text": "This was the best Italian I had in quite some time. I had a long Island iced tea, but the drink wasn't great, but the rum and cokes were good and strong, also really quick. But most importantly the good was amazing. I had fettuccine Alfredo and tiramisu, I just wish there was more because they were so delicious."
        },
        {
            "date": "10달 전",
            "language": "la",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cnFxcll3EAE",
            "text": "Great rigatoni!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2aloyTGdnRRAB",
            "text": "Went to this Italian restaurant a week ago. Food was wonderful, and so was the staff. It's an old school Italian place with reasonable dishes and prices and they have been around for roughly 45 years, you can't go wrong stopping by this gem."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzeXV6SmNBEAE",
            "text": "Grilled octopus is good. The stripe bass and seafood pasta is good. Sautéed onions and mushrooms are good.\nServing speed is a little slow on 2nd course.  Service needs to be better.\nThis is the only restaurant that doesn’t have honey for my tea among around 300 restaurants in Manhattan have been."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdUpYQ3V3RRAB",
            "text": "Definitely a place to come back.\n10 out of 10 in food quality and service.\nA place to slow down and have an amazing meal with family and friends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYMDhlRlJREAE",
            "text": "Thank God there are still places like this. The interior is pleasant and calming; the space is private and intimate; the acoustics are gentle and practical; the service is excellent; the food is delicious  which all combines to make a memorable and very satisfying experience. I take out my clients to lunch here all the time and it never fails to disappoint. This establishment is well managed. 5 stars."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYeVpiSldREAE",
            "text": "Everything great but these portion sizes are laughable for an Italian spot. Very tiny meals"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYb1p5Z2VnEAE",
            "text": "Recomendable"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdGZXem1BRRAB",
            "text": "Just an old fashioned excellent vibe restaurant with excellent service and sensational food. Most the staff has been there for years, some several decades."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYM3NpQjhRRRAB",
            "text": "We went to Rossini's for a birthday dinner after a NYC show. The meal was soon good!  We ordered the eggplant as an Appetizer which was delicious and hot!  The entrees were equally as good. The colognes sauce was perfection. Seriously just great food in a nice, quiet restaurant with great service! We will definitely go back.  A gem!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURueGVQUm9BRRAB",
            "text": "Lovely Italian restaurant,  waiter's dressed in dinner suits made it a very nice vibe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuM0xTXy1BRRAB",
            "text": "One of the worst dining experiences I've had! The lasagna was made with sausages and canned tomato sauce. What's even worse is that the food is super expensive and awful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIeU96Q25nRRAB",
            "text": "Atmosphere is great and always welcoming. We are not New Yorkers but have been going to Rossini’s every time we visit NY, for almost 25 years. Yesterday we had the chicken Marsala and a steak and it did not disappoint. I always have the Caesar Salad and my husband has the bisque. Food was prepared to perfection and the bread and wine were were perfect! Family owned and operated with their special attention to detail! It’s the best of New York!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINExHVkNREAE",
            "text": "Delisioso lugar y lo mejor es que no cierra a las 2pm como el resto de los restaurantes... 100% recomendado. El rissotto delisioso"
        },
        {
            "date": "1년 전",
            "language": "pt",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdkp2N293RRAB",
            "text": "Ambiente super agradável, você se sente transportado para os anos 1920 aqui. A comida estava muito boa, as porções são bem servidas e o serviço foi bom."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdlBxQmpnRRAB",
            "text": "Lovely place with wonderful staff and food. Hits all the notes well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3Z3JudVV3EAE",
            "text": "The welcome inn,is amazing, really like in Italian restaurant.\nVery good wine, I choose a glass of prosecco,super nice.\nThan I started with soup of the chef,was pasta e fagioli ,than I proceed with Pollo alla Fiorentina, simply amazing.\nClose dinner with an amazing espresso coffee.\nThank you for having me over here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURObi1tUlV3EAE",
            "text": "Visiting New York and happened across this beautiful little restaurant. It was the only place we felt we had to come back to during our short stay (which we did). Our second meal demonstrated that it was not the honeymoon effect of arriving at a new destination!\n\nThe staff were friendly, very approachable, and willing to help. The place was cosy and decorated for the season (we were around in late January to little hearts and rosy tinsel) and the live piano made for a very romantic atmosphere.\n\nAnd the food… we had one of their specials (chicken on the night), their spaghetti marinara, and finished on the tiramisu. It was nothing short of outstanding.\n\nWe did not sit in the bar area towards the front of the restaurant but it was lively as we passed through and the layout is such that diners would not know that there was a bar there, making it perfect for dates, birthdays, or any event where diners can just forget the outside world and exist in the meal.\n\nWhen we are back in New York, we will be returning!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyeHJqYi1BRRAB",
            "text": "The service here was was very good and professional. It's a bit fancy, and there was a mediocre piano player/singer. We were less impressed with the food. It was pretty good, but we expected better for the price."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoeUxUYUp3EAE",
            "text": "I got the fresh green fettuccine with pesto topped with chicken. It was the best meal I had in New York! The atmosphere, food, staff, experience was 10/10. Highly recommend to visit and they make a great espresso martini!"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZakpYTlBBEAE",
            "text": "Was craving Italian food mostly pasta, and came across this place just wandering around.  It didn't look busy from the outside but as you walk deeper into the restaurant the tables were all filled from the back.  The manager greeted us as…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREdjRTZnZRRRAB",
            "text": "The service was great! The food was amazing, including the dessert! In love with everything I ordered. One of the best tiramisu I’ve ever had!\nDefinitely will come back next time☺️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEb2FDRnVBRRAB",
            "text": "The food, the Italian wine, the dessert was such absolutely amazing. I have never tried pasta like this before, I have the spaghetti a la carbonara and I really enjoy every minute. Stuff were very attentive and profesional, and the atmosphere pretty nice too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxaEp6R0JREAE",
            "text": "Rossini's is an interesting spot—I appreciated the variety on the menu, but the execution left something to be desired. The ambiance was nice, though!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2X29xMkV3EAE",
            "text": "Great bar and dining room. Surprisingly large and very cool looking place .\nThis is the bad wedding food posing as “Italian” that Mario Batali (credit where it’s due) saved us from 25 years ago. All the entrees come with the same sides: a scoop each of mashed potatoes and frozen vegetable medley. All of our dishes, though different, were finished with the same sauce. We had trouble picking wines and so the waiter tried to explain to us that Barbera and Barolo are the same thing. We’re all certified wine professionals. It was an awkward conversation. The same waiter also very skillfully banged us out for a few little extras here and there and our bill came to over $700 for the three of us.\nThe place has its fans but it’s a one-and-done experience for me."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzbUo2OGtRRRAB",
            "text": "Unexpectedly good Italian American restaurant.  The swordfish was excellent,  great service and the opera singers are a pleasant addition. Not cheap but worth the money."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbkt5d01REAE",
            "text": "I'm sick of the recommendation from the magazine and press. This place is supposed to be tried by the acquaintance personnel.  Stop by and feel the ambiance."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNncHVmcU5nEAE",
            "text": "The food, ambiance, and decor are all quite clearly derivative of the classic Italian-American style here at Rossini's and I loved every minute of it. One of my dining partners remarked that the layout of the restaurant was very classy in an old-school-cool way, and another said they felt they were transported to the restaurant from the movie Goodfellas.\n\nAll hyperbole aside, we had a great time here. It is very formal, so do not underdress. We all ordered a variety of dishes including seafood, steak, and pasta, and the consensus was that they were all delicious. Comfort food is how it can be best described...everything is very savory.\n\nDrink selection is great too, however if you are used to dining at places that have set drink menus like myself, you'll also be surprised at the lack of one here. However, although there are no true house cocktails, the bartender could mix every drink we asked for (negroni and french martini to name a couple).\n\nI recommend Rossini's for those looking for a very formal and upscale Italian meal...Best enjoyed with a large group like family or friends since the tables are huge!"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvemRuamFnEAE",
            "text": "Delicious Northern Italian food!!  Great host Nancy Martino for planning our reunion party. Will be back."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJdllILXhBRRAB",
            "text": "This place was fantastic - a real hidden gem! Delicious food (I had the veal with lemon sauce and a tasty glass of the house Cabernet), attentive and courteous wait staff, and a comfortable and warm ambiance was a pleasant find for this restaurant that I found on the Open Table mobile app."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxMk9pUEJREAE",
            "text": "Great spot in the city for a holiday party! Thank You Rossini’s! It was a pleasure DJ’ing for one of your well known customers."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJZ2Zma1JnEAE",
            "text": "This is a must when in New York. We enjoyed the intimate feeling of the lighting,  to the opera singers, to the impeccable service of the staff. I had mussels for the first time, and the white wine broth is to die for. We both had a pasta dish and were pleased."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyN3ZEa0tREAE",
            "text": "Ate a superb dinner last night. I very seldom order a chicken dish when eating out but I'm glad I did. Best chicken dish I've ever had. My wife had the octopus and it was tender and flavored quite well. I did have shorts on but did not feel out of place. We always sit at the bar anyway when we eat out. It's always fun and you tend to meet some great people. Met and talked with a nice couple and a beautiful lady named Mikala who shared her dessert with us. Our bartender was Maryanne and was just delightful.  We had a great night and hope to return. Would definitely recommend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXNmNxNnFRRRAB",
            "text": "We had a fantastic meal. The caesar salad was great. Wait staff were very attentive and professional. Would eat there again for sure!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCM3RmSDNBRRAB",
            "text": "Wonderful experience we had a few appetizers including delicious oysters and faboluous delicious Apple martinis, great ambiance and service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMmZpT2F3EAE",
            "text": "Mistake on an appointment we had. Decided to get something to eat. Did not know where to go. Rossini’s was close by. Such a wonderful experience!  The staff was very attentive. We were seated in a corner table ( just like in the 30s&40s movies. Wonderful atmosphere. The food was superb. A lovely lunch. We’ll be back!  Thank you Rossini’s!!  PS - the choice of music was perfect!  Frank Sinatra can’t be beat. Only we hoped to hear “You Will Be My Music”,  our wedding song. Maybe next time!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpMElfbnVBRRAB",
            "text": "Its a real nice place for a cozy dinner. Food is delicious. Staff is very attentive.  The service here is simply impeccable and as good or better than some Michelin Star restaurants."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWblpQWVNnEAE",
            "text": "The culinary experience at this restaurant is nothing short of extraordinary, with each dish bursting with unforgettable flavors. The portions are meticulously balanced, ensuring a satisfying meal from the first appetizer to the last bite of dessert. This place isn't just good; it's a gastronomic revelation. Be warned, securing a table can be a challenge due to its popularity, so I highly recommend making reservations well in advance. And if you can, request Xristos as your server for an impeccable dining experience."
        }
    ],
    "reviews_count": 71
}