{
    "name": "The Flatiron Room NoMad",
    "place_id": "ChIJiXS6uaVZwokRqjgLG65i9Gk",
    "grid": "MN6",
    "address": "37 W 26th St, New York, NY 10010, USA",
    "rating": 4.5,
    "user_ratings_total": 1903,
    "phone_number": "(212) 725-3860",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUk5GUjNORnBQYTFwSFoyZG5Uak5FT0hweE9HYxAB",
            "text": "Good food, good drinks, good vibe."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TVdFTjVNUzFzYmxaaFVXcFlka2RGZGpaNk5FRRAB",
            "text": "I had read about the Flatiron in a review of the best whiskey bars in America and the hype is well deserved! Excellent selection of whiskeys, with the exception of Midleton. The service was excellent and friendly. The food was tasty and they even had a good selection of mocktails, so that my wife was happy! The jazz trio was tight and played a great array of standards. And I want to reiterate that the staff was exemplary, anticipating any request we had!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205TVMweERYM3BUVWtoVVRtbFVja3hKY1dOVWJsRRAB",
            "text": "I had a really lovely birthday here last weekend. I came in with my younger sister (who's under 21) for a fun \"live music\" kind of night, and the night was exactly that! We got the charcuterie board and two sushi rolls for dinner, which was plenty. I had the martini from their menu with goat cheese-stuffed olives—absolutely delicious! I will definitely return for a girls' night or a solo date. <3 Thank you!"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdHJEdHRBRRAB",
            "text": "The service here continues to be the weakest part of the experience."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTE9FWkZTMkZGZWpkRWFtWTNWblo0VW1oNU5HYxAB",
            "text": "I’ve been slipping into The Flatiron Room for years to reset with a glass of sambuca and live jazz. It’s like stepping back in time... amber lights, red velvet curtains, incredible sushi, and music that makes the whole world slow down for a while.\n\nThe service is always top-notch. Michaela at the door always saves my favorite table, and Eric and Norman make every visit feel personal.\n\nThe flat iron room is an escape from reality... It’s one of those rare New York spots that still feels like a secret. Elegant, timeless, and effortlessly cool. 🍸🎷"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKbmNtWlVOblpmZGtVeFlUZzRURGh4U1ZoeWNFRRAB",
            "text": "All of my birthday wishes came true yesterday at The Flatiron Room!\nI had been craving caviar, steak and chocolate cake. And everything I wanted was on the tasting menu. Unfortunately, due to my work schedule I had to celebrate my birthday alone. But, was it one of the most amazing restaurant experiences I’ve ever had in my life? ABSOLUTELY! And they had an amazing jazz singer who dedicated a song to me for my birthday. The staff was SO incredible, as well as the delicious food and the amazing atmosphere. And Hugo is an absolute treasure!!! Thank you to the staff of The Flatiron Room for making me feel SO very special! I will be back for sure!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkTlNGbDNibkZhU2tWNFNIUkhNVmRNZVVWNVEwRRAB",
            "text": "This place has a special charm. The warm, inviting atmosphere makes it easy to relax, and the live jazz adds a beautiful touch."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1VFlWUnlURFZQYkRocFpIRnRUMlJNUkhwaFNsRRAB",
            "text": "It was a wonderful evening. We did show up a little late for our reservation & they still accepted us and helped us for our evening. They were very nice! We went out for my girlfriend's birthday dinner. The service was great, the food was delicious, and the live music was awesome! The band even sang us happy birthday! A little pricey but all in all a great location!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCZmRWUnJNbGhwTFhodGNuQnNZV2xrYTE5YWJIYxAB",
            "text": "This is an amazing stand-out lounge in an area with many of them.  The dimly lit red interior creates a pretty cool vibe.  The live music was a perfect variety that created a great energy and high level of sophistication.   The food was very good with every dish impressing us.   Get the torched salmon roll.  Lastly the cocktails were so unique and tasty and the service was excellent.  Check it out!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odFMzTlVSalZ3WjFSUWFXbEZZelp5ZDNGQ1ZXYxAB",
            "text": "As a native New Yorker, it takes a lot to impress me.  Upon entering TFR, there was a receiving area, with the restaurant masked behind double doors.  When my party and I were escorted through those doors, we felt transported to 1930's New Orleans.  As soon as we were seated, we all shared the same exact thoughts. It was a big bday celebration and we enjoyed the Tomahawk steak, Lobster Thermidor, Smashburgers, etc., accompanied by delicious craft cocktails. The dessert sphere was a show stopper, the layer cake delish.  The food was exquisite.  The music enhanced the experience and made the evening complete.  We seven had a truly memorable evening.  Give TFR a try..."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZelNVSk9URzVuYW5saVIwWnlSMGh1WDNOa1RIYxAB",
            "text": "An Exceptional Experience from Start to Finish\n\nThis venue is truly stunning. I had a 7:30 PM reservation but was running behind schedule. The staff graciously accommodated a time change to 8:00 PM without hesitation.\n\nUpon arrival, I was warmly greeted, promptly escorted inside, and seated with care. After settling in, I shared my drink preference with the server, who thoughtfully offered tastings of two exceptional cognacs—both were outstanding.\n\nThe strip steak, accompanied by sautéed mushrooms and broccolini, was perfectly prepared and paired beautifully with the drink selection.\n\nAlthough seated on the second tier, the live jazz performance was crystal clear and added a vibrant, elegant touch to the evening.\n\nHighly recommended—an experience I’d gladly repeat."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VelZIbGxNWEl4YTBOQlZsbGlSMkV3U2tsTGVVRRAB",
            "text": "I loved this place, the service, drinks, and ambiance were top notch. I highly recommend this place if you are in the area."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVd2VIRTBjRXRzYjA0eGRFZHNVM1JXZFRRNWEzYxAB",
            "text": "If you want live music and a relaxing vibe, this is where to go. An amazing selection of scotch and whisky if that is your vibe. I thoroughly enjoyed my cocktail."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjdE1FMUtkV3RmUVZOT2ExbzVWRU5YY0VSTVgxRRAB",
            "text": "10/10 date spot"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210T2RWaGtiRXcxZWtKRmRVMUVha2czZG5wU1dIYxAB",
            "text": "Amazing night;  incredible service, great music,  drinks and food were top notch, highly recommend.  We will absolutely be returning."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205aE9HNHRPVTlzZEZjNFRHbDVkbE15WXpGSlIyYxAB",
            "text": "Great music, ambience, food and service is top notch!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnM1NWTjNlR2d0ZEhsR05YUXlXRWhUV1dzMVgzYxAB",
            "text": "We stopped by here for live music. Great place. Edwin Vazquez is an amazing musician. The bartender makes killer drinks. We enjoyed our time there. Will definitely come back to see live music again!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ob2VGRXhObFozVUV3NGRIcFRlRk5GVVVkaGJuYxAB",
            "text": "Great atmosphere, good music, good time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxSGFsVlVPWGhHZG5sQlZVSk9iV1pJWVRoR1UxRRAB",
            "text": "Wow!! Their Sunday sushi box was exceptional. The service, cocktails, music, and ambiance were also fantastic. Couldn’t have asked for a better evening all around."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSWlVqQlRibGN0YTB0TmFIZGxZamt5VUhWWVdGRRAB",
            "text": "Hugo offered the best service and made the best smoked old fashion Ive ever had! Music was perfect definitely a great spot to enjoy with friends or on a date!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRNFltbHFiM1p4Ym5oeFozQkNkRk5DVjFVeVZXYxAB",
            "text": "Great service, amazing atmosphere & best cocktails!! Staff was really nice and musics was spectacular!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sUVVXRkJSV2hHV1VkWFNEWm9SMWs1TTAxWE5GRRAB",
            "text": "We visited The Flatiron Room in NoMad earlier this month for a special celebration, and the experience was truly unforgettable. From the moment we started planning, the staff went above and beyond to make everything seamless. They were incredibly kind, patient, and flexible.\n\nBrian (the manager), Masha (the Event Coordinator), and the entire team made us feel genuinely welcomed and cared for. Their attention to detail and warm demeanor created such a comfortable and celebratory atmosphere.\n\nDinner was outstanding—easily a 10 out of 10. That Sunday evening, they offered a delicious sushi box, and I enjoyed a fresh salad and some rolls. The live music featured two phenomenal blues musicians who blended traditional blues with unexpected covers, including Bryan Adams and other expected favorites.\n\nEven weeks later, we’re still talking about how special that night was. We’re already thinking of making this a yearly tradition. We’re incredibly grateful for the hospitality and the unforgettable experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Vd1FtVmZTbW8zTnkxNGVUVnBXVEYyWVVjeWJGRRAB",
            "text": "Lovely authentic jazz bar restaurant.  Food was great and to match the atmosphere."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNHRXVWNBEAE",
            "text": "We've been several times and it's always fabulous. Beautiful venue. Good food. Great service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wa1V6Vk1iRXRKUzNNdExYSkNTME5UUzJSaFJGRRAB",
            "text": "It's a really nice place to go on a date  or just a night out, the band was GREAT. I highly recommend everyone go just one time, and you will keep going back I promise."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KdE9XdGFkbVJNYWpKSmExRTJaa1ZET0cwNWFrRRAB",
            "text": "Amazing vibe. Live music was great. I was amazed to see their whiskey collection. You can apparently order whiskey bottle and they can keep it locked for you for around a year. They have a huge collection of whiskey cocktail as well.\n\nI ordered Cosmojito, ideal husband and garden of eden. Ideal husband and Cosmojito tasted good. Cosmojito came with pineapple on side. For food, I ordered vegetarian sushi. It had mushrooms, cucumber and avocado. Also ordered french fries and garlic aioli. Both were good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScGIyWnVaRkEzT1ZsUWVHOU1UMDlhUVcxNlpYYxAB",
            "text": "First time and it was a great experience. The food I tried was genuinely perfect - no notes! Drinks were good and the stamped ice is always a nice touch. Service was fine, but there’s room for improvement. Great lighting and sound plus the live music was a perfect vibe. Cheers!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sc1ZGQk9lRkYxZUhSUmJsRXpjbUpQWVdkeE0wRRAB",
            "text": "The Flatiron Room is the place to go if you are looking for a romantic night with your significant other, or want to enjoy live music with a group of friends! The ambience was superb & the service was immaculate. We enjoyed the sushi options, the cocktails, and the chocolate sphere dessert. My boyfriend loved his birthday dinner here & we would definitely come again!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GYWRsTTNhRlV0TFV4U1UzSjZlbWxqWjJ4MGFtYxAB",
            "text": "amazing experience and food. live music schedule every evening. alcohol selection is endless. the food is on the expensive side but tastes absolutely surpasses expectation for a tavern."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxWVpuZHdPRm8yVkZsUlNtUkNWbm95U2sxcVZVRRAB",
            "text": "Restaurante elegante y bien decorado con música en directo. La comida japonesa muy rica. Se recomienda el Flight de wiski. Tomamos el flight de Maccallan. Inolvidable el sabor. La conversación con el cantante y los camareros fue divertida. Una experiencia extraordinaria."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rM2NGRmhNbVJTU0ZsTVkxcEdTa05DT0VaRE1rRRAB",
            "text": "The whole maine lobster, is not a whole main lobster. The waiter was clueless about an approx weight and also did not know how the lobster was prepared. The waiter could not answer why the claws were missing. We did not realize this until we got rid of all the mac n cheese that was covering the tiny lobster. We were guessing it was about a 1 lb lobster as the tail might of been 6oz. Was listed under the “shareables” for the whole table… 3 people were still hungry… He was asked to get the chef, instead he went to the bar and talked with friends. Disappointed for 85$. Then we walked about a block and found whole maine lobsters for 25$ a lb… with claws. (Took a pic) Very odd service. Whoever the chef is must not know much about seafood. We are sure the server never even mentioned anything to the chef."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kVFFtWjZkblUwT1Vkb2JXWkZkekZWWjNrd1JsRRAB",
            "text": "Great atmosphere, don't wear a hat!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUlkxUkRhR1J6VldvMlpEVTVlbmd3WDNkc2FtYxAB",
            "text": "Loved the music and the great cocktails (including non-alcoholic)."
        },
        {
            "date": "4달 전",
            "language": "el",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTVMyUlRMVkJ0YlRaWlpVZHBVbk55YmxKaFlrRRAB",
            "text": "απίστευτος χώρος....τεράστια ποικιλία σε whisky...."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VWJHazRORXBYT1ZsdVJHcFBOazlOTjJGc1lsRRAB",
            "text": "we love the flatiron room (nomad),,,, it's a great atmosphere w/ live music ( the music is played a softer noise level, so you can still have a conversation ) food is great and every time we've gone the service has been exceptional!!!,,, highly recommed it"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWblIyRkpNRVZVWWxaM05VMVFjelJCTkcxNGNHYxAB",
            "text": "Great service and attention to detail.\n\nThis review might be way overdue but I have been a constant costumer of this location for 3 years now. I will say, at the end of your stay the food and the atmosphere combine perfectly to a pleasant experience, just make sure the music and style fits your interests to enjoy it fully. I am personally not much of a jazz listener more of a whiskey drinker and I love their selections.\n\nThe servers are very attentive and deal with food requests properly and politely even if in cases such changes can’t be made they know well enough what other choices to offer.\n\nIn general food quality seems fresh and the dining portions are well distributed. So you pay for a good experience and for a full stomach.\n\nI will continue to come and enjoy the FRN, keep on the good work."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCclQwcDJZWFp2V1ZoSVpsWkJaWHB0TW5GVWVWRRAB",
            "text": "Great food, nice bartenders, and pleasant jazz music in the background"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4UFgxSTBhRkl5VWt4YVZtRnphbVZQT1RCamVGRRAB",
            "text": "We visited the Flatiron Room during a challenging time in NYC, having been stuck there for over two weeks four years ago during the pandemic. While we couldn't recall our previous experience, this recent visit was nothing short of exceptional.\n\nThis time, we were fortunate enough to secure a dining table close to the stage, which truly enhanced our evening. On that Monday night, the duo performing bossa nova—featuring a talented vocalist who also played the guitar alongside a skilled violinist—created an enchanting atmosphere. Their performance was so captivating that it made us completely forget it was a Monday!\n\nThe combination of their soulful music and the intimate setting of the venue made for an unforgettable night. We felt transported, and it reminded us of the magic that live music can bring. Overall, our experience at the Flatiron Room was a delightful escape, and we can't wait to return!\n🍸🍸❤️💕🌹"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205eFdsTnJWVVZrYTFGblNXOXJaVTUwUjE5VWRVRRAB",
            "text": "Fabulous experience!  Great atmosphere.  Wonderful ambiance and location.  Very good drinks.  Food was good.  The service is impeccable.   Nice music.  Wonderful experience to enjoy good music in beautiful setting with great service!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTk4wOXhObFl4VWxsWFQxaHpVVGMzY0ZZdFUxRRAB",
            "text": "I always loved this place,its a one of hidden gems of NYC ,warm cozy and great positive vibe ,always great performers"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTGIwRllVV1UyVUhkWFJqbGFSa0ZwZW1aUVNGRRAB",
            "text": "Our bartender was excellent. He allowed us to sample spirits and provided excellent conversation. It was my fiancés birthday and without even telling the bartender it was a birthday celebration (he must have over heard) he presented him with a birthday cupcake. We will be returning during our next New York City trip!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKV1V6dFMwdGRuU193RRAB",
            "text": "Went scotch tasting, absolutely perfect pours with fantastic entertainment. Definitely worth going too for any whisky lovers."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPeUhzWjZhdlpYQWpRRRAB",
            "text": "Música en vivo, realmente sonaba muy bien. Buenos tragos."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214MFRUZFNWV3BOV0VsVlVHUnFZVTAxVDBWTVZsRRAB",
            "text": "It is a lovely space to enjoy dinner with music. Check their listings for an artist you might enjoy. We enjoyed the food, and there is an extensive bar menu. The staff is friendly, attentive, and professional."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2podmJESnJSSFJ6WWpWUVdHbHRVR2xXV0RsM1puYxAB",
            "text": "What a great place. Enjoyable dinner with live jazz music. Food is expensive, but all is super delicious and well served. Everything is Good sharing portions sized. Will definitely be back more times."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaklHWWFnEAE",
            "text": "I love the Flatiron Room. It's a constant go-to when I'm in the City.  I love the amazing whiskey choices, I love the live music, the vibe. All of it. Tip: Sit at the bar, have great happy hour pricing on great food (5-7pm), and have a rich conversation with bartender who knows a ton about all the options this place offers."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VQSGIyNXI3dUtMa3dnRRAB",
            "text": "Music was ok. Not too loud. Not worth travelling for. Food and drinks definitely not worth travelling for. If you can’t go or get in elsewhere and want a little live music and happen to be nearby then worth a shout but sit at the bar . No complaints about service but exceedingly bad value for money spending over $250 for four rolls of below average sushi, two tempura shrimps, two watery cocktails and two glasses of acerage Cali pinot."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQaVZ4TVdEODhhYkl3EAE",
            "text": "Came here for a drink and really enjoyed the live music that was on. The setup looks fantastic and makes for a great atmosphere."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJSzdsTTdaeHNqMEl3EAE",
            "text": "Amazing place, amazing music, amazing service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPVDd5LUtBc0pHa25nRRAB",
            "text": "Sophisticated but yet relaxed atmosphere.  We had a really enjoyable evening out with friends drinking wine, eating tasty food, & listening to great music. Service was also excellent. I highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudUttUkd3EAE",
            "text": "분위기도 너무 좋고 친절하고 무엇보다 음식이 맛있어요~ 쇼트립이랑 문어 완전 추천하고 가지파스타랑 칵테일새우도 괜찮아요 저희는 와인 마셨는데 위스키 전문인 것 같아요! 디저트도 맛있어요~ 재즈는 공연느낌보다는 비쥐엠느낌인데 분위기 있고 좋아요 추천!!"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuODVPRXhBRRAB",
            "text": "내가 뉴욕 여행하면서 유일하게 두번 방뭉한 곳. 바텐더 루이스님은 진짜 친절하시고 뉴욕에서 먹은 칵테일 중에 제일 맛있다...😊 언제가 될지 모르겠지만 뉴욕에 온다면 100번이고 방문 할듯. 노래 분위기 술 다 좋다"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWdjdqemx3RRAB",
            "text": "추수감사절 디너를 가족들과 함께 했습니다.\n재즈 밴드 라이브 공연과 함께 식사를 했는데 전반적으로 만족스러웠습니다."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtOWNUeERBEAE",
            "text": "재즈바인데 재즈도 가까이에서 라이브로 들을 수 있고 분위기도 좋은 바였어요. 칵테일은 37 West 26th 이랑 18 Smoking Old Fashioned로 시켰는데 두번째 칵테일은 시그니처 같아보였는데 담배향 싫어하시는 분이나 달달한 거 좋아하는 분이면 비추드립니다. 사진용으로는 좋아요. 안주 치즈까지 해서 84.92불 나왔어요."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtdjU3S2tBRRAB",
            "text": "화요일 저녁 방문. 예약할 때 데이트라고 체크했더니, 무대에서 가까운 테이블로 잡아줌. 분위기 좋고 라이브공연 너무 좋았음. 다시 또 가고 싶음. 음식도 맛있고, 분위기에 비해 비싸지도 않음."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaeHNhcThRRRAB",
            "text": "칵테일도 맛있고 분위기 최고였어요!!"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCcGV5QzRBRRAB",
            "text": "힙한 미국 재즈바\n맛난 칵테일\n재즈는 좀 잔잔함"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxdU5Yb1l3EAE",
            "text": "분위기 좋다."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVZ29qMThBRRAB",
            "text": "멋진 장소 친절 분위기"
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRbzViRjJ3RRAB",
            "text": "너무 좋음"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cFBxOUl3EAE",
            "text": "We were in the way to a bar when the sign “very happy hour “ caught out eye! We had to check it out n so glad we did. Great jazz vibe. Champagne is $16 for glass n west coast oysters were amazing! Love the cocktail Ideal husband, a tequila based cocktail w logo ice. The selection  of whiskey is amazing. Great vibe great servers friendly n knowledgeable. Love this place."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvLXVfYW5BRRAB",
            "text": "The place is amazing. The service was impeccable. The music, the vibe… you don’t realize you are in the middle of a city as you listen to jazz tunes. All the bartenders there were friendly and helped with trying new things. Best spot to visit on a trip to NYC"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3Mm9qX1BBEAE",
            "text": "The Flatiron Room in NoMad is an absolute gem! From the moment you walk in, you’re enveloped by an elegant, vintage atmosphere that’s both cozy and sophisticated. The live jazz performances are top-notch, adding an incredible ambiance to the night. The cocktail selection is impressive, with each drink crafted to perfection. The food is equally delightful, with every dish prepared with care and full of rich flavors.\n\nThe service is impeccable; the staff is attentive and knowledgeable, making you feel truly welcomed. Whether you’re there for a romantic evening or just to enjoy some great music, The Flatiron Room delivers an unforgettable experience that my partner and I won’t forget.\nWe Highly recommend for anyone looking to enjoy a night of fine dining, exquisite drinks, and jazz."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bm9hY2RREAE",
            "text": "I have a wonderful experience last Thursday’s the restaurant was amazing the food was wonderful\nThe steak my favorite 100% recommend the octopus for appetizers and meatballs was so delicious, we order margaritas for drinks but was ok 5/10, the dessert so delicious 10/10. The server Tamara was very kind and check if all was good very often good service 10/10. The music was fantastic beautiful voice and moments. ( Only at the entrance  the hostess look very angry or something was wrong, it didn't make you want to enter the place)."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmejkyTGtnRRAB",
            "text": "The Flatiron Room at Nomad has become our go-to location for special events, for always great food, always great music, and, even more so, always great service! This year's New Year's Eve dinner was again awesome. Our server, Brian, was the best! The appetizers, entrees, and desserts were spectacular. We will visit many more times."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6NDU3dVF3EAE",
            "text": "We went to the Flatiron Room for a late dinner on Saturday night. We had a reservation (highly recommend) and were seated quickly. In our reservation we requested a table in the main room so we could hear the live music. If you’re looking for a quieter meal with more conversation, especially between a larger group, then I’d recommend requesting being seated elsewhere.\n\nThe food was pretty good—but I think you really come here for the atmosphere. The dessert we got was great and also fun! Our server was nice, but busy with many tables. Overall, would recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNId3R1TG9BRRAB",
            "text": "Came here for our 5 year anniversary dinner. Food was fantastic, cocktails were exquisite and delicious. Very well crafted. I got the take me back to tulum. Restaurant menu week was still in effect got a 3 course meal for $60, great deal. Amazing service as well and the ambience was hypnotic. Live music was so good. And once again, the service! New spots come in to this city and are trendy and cool but in my experience lack in service. It’s nice to come to these established spots with a reputation and focused on service. Highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIN2FuY09BEAE",
            "text": "Absolutely incredible place. Extensive whiskey/scotch selection and unbelievably wonderful live jazz. We caught MCP, who performs there each Friday night, and wow. Just divine! Would come back every Friday if I lived her but it will be my go to for evening jazz entertainment and top notch drinks and shareable whenever I’m in the city!\nWe had the stuffed eggplant, the eggplant portion was delicious but the oyster mushrooms were meh, the charred octopus was perfect, and the halibut was exceptional. Everything was cooked perfectly and the service was impeccable!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfLS1mVmRBEAE",
            "text": "We were visiting from Canada and were pleasantly greeted by a man named Miri at the door. I could hear that he had an accent in his voice hence I asked where he was from assuming it was former Yugoslavia or Eastern Europe, as I am from there, and he said he was from the region. Instantly we developed a very warm and amical connection with Miri. After that, he began serving us and was an exceptional waiter. He provided excellent recommendations and allowed us to pick our seats. We had a fantastic view of the performers (live music, amazing atmosphere, very unique and romantic) and the setting of the place was very dim, red and just absolutely alluring. Very tastefully put together. It was very clean and everyone was very professional but also interpersonal. Very charismatic staff. Miri took an extra step to bring the table taste testers of sushi even though we didn’t order any. That was very kind of him. Him and his coworkers checked in on us repeatedly and made sure we were happy with the food and drinks and cleared any empty plates or replenished our water glasses at all times. The food was superb and the chocolate cake was phenomenal. The presentation is excellent. Someone will pour warm chocolate over the cake while shining a flashlight on it and turning off the warm lighted mushroom lamps at the table so that all the focus is on the cake. Definitely grasped all of our senses due to this presentation. Very pristine and exciting. We billed out and Miri offered us another drink, and before we could say yes he was already bringing us taste testers of their house bourbon roasted espresso martini. He explained that the beans are flavoured in house and then that they get to get roasted locally in big batches if the taste is right. If it isn’t, they create a new batch - attention to detail. It was very kind of him to do that. He also charged my phone for me behind the bar which was very sweet. We then got another drink and he said it was on the house. The staff of The Flatiron room made our experiment exceptional (especially Miri) including the live performers, and then music that played afterwards, very good vibes that makes you want to sit in silence and enjoy the life around you. Miri is an amazing person. We are so lucky to have met him! Miri if you are reading this, Mia, Erica and Anna from Tuesday night January 14th wish you all the best and we are grateful to have crossed paths with you. Upon leaving, the staff said a very warm goodbye to us. We left feeling extremely happy, satisfied but especially impressed. Will be coming back, no discussion there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNucmZlRXJnRRAB",
            "text": "After a week of amazing Italian food in Hell’s Kitchen, I wanted to experience some live music with my dinner. I sat at the bar, so did not have to make a reservation or wait (definitely make a reservation otherwise). The atmosphere had that speakeasy jazz bar feel. Fun music, dim lights and the service was great. I tried one of their mocktails which was fantastic, however the rest of the menu felt quite lacking. I ended up getting the Eggplant Pasta which was good, but nothing to write home about."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMnV2Q1l3EAE",
            "text": "Beware:  WINE SCAM at the Flatiron Room! (photos attached)\n\nWe visited the Flatiron Room in NoMad for a girls' night out, expecting a sophisticated and enjoyable evening at a renowned jazz bar. Unfortunately, our experience turned unpleasant and felt truly deceptive. We ordered a specific Pinot Noir “Maison L’Envoye” from their menu, yet the bottle served to us was noticeably different, a brand named \"Straight Shooter,\" which wasn’t listed anywhere on their beverage menu.\n\nAlarmingly, the server swiftly poured out the remainder of the wine into our glasses, promptly removing the empty bottle from our table—effectively hiding any immediate evidence. It wasn't until we carefully reviewed our bill that we sensed something was wrong, as the price appeared inflated.\nWhen we questioned our server, they initially reassured us, claiming we had received a \"better,\" more expensive bottle for less price. Luckily, we had some photographs taken where the wine bottle was captured. We realized the \"Straight Shooter\" Pinot Noir served was not on their menu at all. Confronting the server again, he deferred to the manager, who dismissively stated the wines were \"from the same vineyard,\" which felt evasive and misleading.\n\nFurther research on retail prices revealed that the wine we were given sells at approximately $18, cheaper than the $31 listed bottle we originally ordered—yet we were charged $99 for it! This egregious upcharge and blatant deception left us extremely disappointed and frustrated.\n\nSuch unethical practices at an establishment as reputed as the Flatiron Room are deeply concerning and utterly unacceptable. Sadly, instead of leaving with joyful memories, we left feeling scammed. Be cautious and always verify the wine you order here—this experience was undeniably shady. And my gut tells me that they do this often to customers who come here in evening enjoying music and company paying less attention to the bills SO BE AWARE!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuMjdUXzZ3RRAB",
            "text": "I cannot say enough about the incredible experience I had at The Flatiron Room's Supper Club last night! It was truly a special evening from start to finish. The ambiance was perfect, the service impeccable, and the food — wow. The chicken was absolutely life-changing and so was the dessert! Plus, the magician was mind-blowing. This was an experience to remember, and I can’t wait to go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURONTV5YTBnRRAB",
            "text": "I went here last Saturday night.\nI tried also the last year to walk in but with no result, because I forgot to make the reservation.\nThe location is very small, but really intimate, the acoustic is really good and grant you to ear the music at 110 %!\nI had also a dinner here and to be honest, normally when you go to a music club the food is not really the best, but this cliché here is completely refuted. The food was good, with high quality row material.\nLast but not least the drinks, no words to describe it…..super!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdWFhbGZREAE",
            "text": "“The band was absolutely amazing, especially the talented guitar player, Mr. Hicks! Our waiter and bartender were incredibly attentive, and the food was outstanding. My husband started with the escargot for his appetizer and had the Branzino for his main course, while I enjoyed the seafood pasta — everything was cooked to perfection. We had a fantastic evening and will definitely be back soon!”"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwLWRmcGdnRRAB",
            "text": "The mushroom gnocchi was excellent but the steak was salty and chewy. I would say it is a great place for appetizers. They didn’t ask how we want the steak first. size of dessert were like gigantic. 5+ people shareable with 1 dessert! The live music was playing when we went to the place. It was ok. Atmosphere was chill."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM2M2Z2F3EAE",
            "text": "What a fantastic place, live Latin band led by Edwin Vazquez, +ED MUSIC LLC\nThe food was amazing, the whiskey selection was second to none, even scored a dance in between meals, what an amazing place!!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1dmJtVGJ3EAE",
            "text": "Great date night spot. Live jazz/soul while you eat. There seems to be a 2 hour maximum for the table and they make that apparent when you arrive. They have a coat check for cold nights. The cocktails were on point and the food was delicious. Would come back when in NYC."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwb2F1RWFBEAE",
            "text": "Had done two very informative and fun virtual whiskey tastings with the owner Tommie during the pandemic. Finally got here in person. Beautiful room. Live music. Best Espresso Martini (with bourbon) ever. Food was excellent. Our server, Maria, was attentive, friendly and helpful. Will return!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbEthTlFnEAE",
            "text": "The atmosphere there is amazing, this is my 3rs time and both the service and the live performance is superb. Also the design is stellar and the choices of whiskey is the biggest I've seen in one place. The food itself is good but I would come to this place for the food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0N0tfV2RnEAE",
            "text": "Food was all perfect with an unbelievable menu of whiskeys. The entertainment was good too. Very dark inside but you do have lights st every table that get brighter with a touch."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NzhfMGJ3EAE",
            "text": "Amazing.  We are staying at the Motto by Hilton and just checked in.  This was a 5 min walk from our place and what a gem.  Their whiskey selection is impressive.  I got a flight of their Single Malts and it hit the spot.  You MUST order the pork belly, one of the best I've ever had.  The tuna tartare was spot on and the fries were solid.  The live music just added to the great ambiance.    Definitely recommend this place for any occasion."
        }
    ],
    "reviews_count": 81
}