{
    "name": "wagamama, murray hill, new york",
    "place_id": "ChIJmw7HvHpZwokR_jQtbm6Zrj0",
    "grid": "MN6",
    "address": "605 3rd Ave, New York, NY 10158, USA",
    "rating": 4.4,
    "user_ratings_total": 1317,
    "phone_number": "(646) 813-3396",
    "reviews": [
        {
            "date": "13시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tadVFWSlRaRUZ0T0RGdU0xaG1jblZhUTI0eE5WRRAB",
            "text": "Wonderful waitress\nDuck ramen was excellent.  Third time here, and will return."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KUlNWQkpjbk4xY1U5TllXOXBSVkZRYWxKa1ZGRRAB",
            "text": "Had an amazing experience at Wagamama Murray Hill! The food was fresh, flavorful, and came out quickly. Our server Massimo was fantastic—super friendly, attentive, and made great recommendations. Manager Dane also stopped by to check in and was incredibly nice and welcoming. Excellent service all around—can’t wait to come back!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWTmRIRlRTWE00YkVOWE4ydFBha1ZEZVRoUWMyYxAB",
            "text": "Server Irving and Manager Henry were very friendly and welcoming. It was a pleasure chatting with you. Everything was delicious and the drinks were tasty and refreshing.  My recs are grab a few pork/duck/mushroom buns and some cocktails for a nice evening."
        },
        {
            "date": "5일 전",
            "language": "ar",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSa1VVd3diRGR3Y3kxRVMwSnVkRTF6VnpOclJYYxAB",
            "text": "تجربة ممتازة\nالطعام لذيذ جدا\nالموظفين في قمة الاحترام واللطافة\nسأزوره مرة اخرى"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jeGFqSkxNRWxQYkZKS1lVSjVXRTh6YVZnMWRuYxAB",
            "text": "The service at this place was absolutely fantastic. Steven nailed the drinks, and the manager Kevin was incredibly attentive. Our waiter was superb, making the entire experience enjoyable. I loved every moment here and will definitely be returning. Must-try items include the backyard burger, salmon nachos, and the U Be espresso martini."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2preGJrRmxObXRTYTB4WmREVlJkV1JHUTNod09FRRAB",
            "text": "I work in the area and had never tried Wagamama before, so on a cold, rainy day I thought it would be a great opportunity to give it a try. I placed a to-go order and waited over 30 minutes. When the rain started pouring and I realized I wouldn’t have enough time to walk back to work and enjoy my meal, I politely asked if I could dine in instead.\n\nTo my surprise, the staff immediately dismissed my request and told me I couldn’t stay. I tried to explain my situation and even offered to purchase a drink or leave a tip, but I was met with rudeness and told, “this is how the service industry works.”\n\nAs someone who has worked in the service industry for years, I was genuinely taken aback. I was always taught that hospitality and empathy are at the heart of good service, and I left feeling disrespected and disappointed. I had hoped for kindness and understanding, especially on such a miserable day, but instead felt unwelcome.\n\nI hope the management takes this as constructive feedback. Guests deserve to feel valued, and small gestures of understanding can go a long way. Also food was mid."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swNWFuWlhWMjQxTjFGQlJEUkphVlpKWTJVM2VWRRAB",
            "text": "Great food. great staff. 5stars to kitchen staff."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5R2FIRnFTMUpaVkRkNE9HOTFhMGhTT1ZsT1ozYxAB",
            "text": "Service was excellent!  Our server was very pleasant, even though its was almost closing time, doing his best to make sure we get what we are looking for. I apologize for forgetting his name but he is was very thoughtful and helpful with us, with our little one, making sure we were all happy.I was a little sick and needed a spicy, hot chicken ramen and he delivered.\nIt was the best I ever had!\nI appreciate the little details,  glasses cups (not plastic), water bottle,  wooden spoons, etc. After this experience, this restaurant goes on our \"must have in NY\" list. Thank you for dinner #wagamama."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RlQzQlNZbUZDWmxNMFZHNTNiMlI1WkdWa1FXYxAB",
            "text": "The food was delicious! So good. Also our server Robbie was so fun and energetic. Great experience. Will definitely come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWlozWlhTeTFOTkRsSWJ5MXJlR05vV1cwMVRXYxAB",
            "text": "Had an amazing time at this place. Robbie was 5 stars all the way. Professional, kind, didn’t just check on us 2 times like other places. Robbie made sure we were smiling and comfortable the entire time. Thank you Wagamama for having a Family oriented atmosphere THE BEST!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvMlZuRXlRbTVtVjI1M1ExbGZhMVpPZVdnMWEwRRAB",
            "text": "The restaurant staff of full of crooks who were forcing me to pay 20% tip amounting around 39 $. Never experienced a restaurant staff any where in the world acting like a mafia to pick pocket tip. The owner must take notice of this and stop such crooks to spoil other goods of this restaurant"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTU9YZzRUMDlMWWw5NkxVMTZiekZEZEdSWFJWRRAB",
            "text": "Service was amazing and the food was even more amazing.  Recommend 100%\nRogi was very helpful in helping us enjoy the experience here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MVF6UndTM05RVUUxeWRqYzNNMGhOUlZWT2RIYxAB",
            "text": "Food and service was great and the happy hours deals worth to be in the city for and shout out to Texas (Jason) for the experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVGRHTnBZVFJmVms1R2JteEhSREJsV1RaMlRFRRAB",
            "text": "I usually enjoy this restaurant quite a bit, but the most recent time I went here soured me so much, that I now will never return to this location again. Both me and the person I was with enjoyed the food immensely, however while the prices are not great here, and it is considered somewhat premium, I don't complain because it tastes solid and I like eating with friends or on dates.\n\nSo anyway, I gave a certain tip this time because the service was lousy and I also didn't want a bill to go from $70 to $80 when it wasn't deserved. (Tipping culture is going too far anyhow) The obnoxious, entitled waiter gave the Toast POS device an odd look after I punched in the tip as we were leaving. I thought something was wrong but didn't say anything, as to not make things awkward. He went and did that to a stupid degree anyway, so I didn't have to! The waiter approached and asked if everything was okay, and I replied that service was a little slow but nothing else was wrong. He then proceeded to shame me in front of my date for leaving a \"low\" tip and asked why I didn't give more.\n\nWaitstaff these days are extremely entitled, but this was a bridge too far! If your service isn't great, I'm not giving you a 20% tip, and you can just deal with it and cope harder. That's how life works. I shouldn't have to explain myself, especially in front of a date. Because of this egregious behavior from that staff member, I refuse to give this location any more money at all. I'll be going to the Nomad or 6th ave locations from now on. They have nicer layouts and friendlier staff anyhow. Wagamama needs to do better with training staff to not be pushy with tips. Otherwise, you'll continue to lose more customers, and rightfully so."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVdFIyODRZbE51YVRsR1NISmxha0pIYmpsMk9HYxAB",
            "text": "Cedrik was amazing: super attentive and kind. The short rib ramen was rich and flavorful, and his service made the whole meal even better. My wife and I really appreciated after a very rainy day."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5blNFRmhka3RGWldKSFlUQnpiRkl0WXpSd1kxRRAB",
            "text": "Madison was pleasant and an excellent server"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGQmNFMDViRTlRUldzNGRuQnlielJaZVZNeVdsRRAB",
            "text": "I was at the bar here one night and it was a wonderful experience! The food was good and the staff were very friendly. The bartender Osiel was super attentive and present. I felt very welcomed"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FMFZrMW5UVVpTTTJobWVsZFdjRUpwYkUxa2RuYxAB",
            "text": "Carlos was wonderful and provided amazing service! Food was great and reasonably priced."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUVRGZHpRamx5TTJ0VVpYaEJiVUpaV2pSMk4wRRAB",
            "text": "Great food in a cozy atmosphere. Firecracker Chicken is the menu to go: delicious and spicy. Fast and attentive service thanks to Suu. Wagamama is always a great option. Highly recommended."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdFpIbHNaM2RVZVU5amRqUk5ha1pSVUVoWFJXYxAB",
            "text": "I’ve found that many Chinese-owned new-style restaurants are also named with the word “mama,” like “Mother’s  Kitchen,” conveying a warm and homey feeling."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NFdsaDBZMGhJZDJwSlRqTlhVRWg2Ym1wcFpFRRAB",
            "text": "Prob best overall meal I’ve had in NYC so far!! Restaurant week is a blessing — got a $30 three-course dinner! Stephen was an amazing waiter throughout the night, very attentive and kind.\n\nThe apple Porkbelly bao was a great start. The sweetness of the fried apple slice countered the saltiness of the pork belly really well. The textures were all there, the flavors were dancing — phenomenal.\n\nThe main was a schezuan pork ramen. A bit on the saltier side, but the noodles were nice and springy, and the pork bits were yum. It paled in comparison to the rest of the meal, but still a very solid dish.\n\nThe matcha cheesecake was a bit slow to come but totally worth the wait. Such a light yet decadent dessert to finish the meal. Not too sweet, and the ice cream is made in-house. The ice cream had ginger notes (I think) and really tied everything together since the cheesecake was a tad dry. Wowowow did it blow me away.\n\nPorkbelly and apple bao: 9.4\nRamen: 7.8\nMatcha cheesecake: 9.7"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VNE4wcEROMEp2YjB0M1JuSjNOblYzZFdoMVJVRRAB",
            "text": "I tried chicken soup. I didn’t feel flavour. I think seasoning was not good. Smoothie was good tho."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvdFQxTlZNVU13UWpCMVgyNW5TRU0zVGxwWU9IYxAB",
            "text": "Love this place. Food was delicious and fresh! Friendly service and pricing very fair."
        },
        {
            "date": "3달 전",
            "language": "iw",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0c1dtaFhibDgzWTJ0MGFtVmFWakZoY1RGUWRGRRAB",
            "text": "סטנדרטי\nלא מתעלה מעבר לבינוניות\nלסגור פינה כשצריך\nקצת שקט מההמולה של רחובות ניו יורק"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTE5FdFNMV2RsWlMxSE5uSnhWM0ZyVTBGWFRuYxAB",
            "text": "Same menu than other locations\nGood ramen and very friendly staff"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWk1IVkxOR1p5Tm1ZelRFdzJVRkJFYkZKMVUwRRAB",
            "text": "Ang sarap! Angel (our server) was the best! 🙌🙌"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FMFRVZGFRM1ppVW05SVIzUjBOREp0TVRGT1ZsRRAB",
            "text": "Amazing food - the katsu and matcha cheesecake are to DIE for. Also, Ate Angel served us, and she was the BEST."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsS1FqVkxRVWQzVmpsMmJWOUlUbGwyYld0NVYxRRAB",
            "text": "Food was great! Also honorable mention to Maddy who served us wonderfully and made sure everything was tasty and well!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRUxVb3pNVXBRYkdndFMwZHVRelZTUTNGdldrRRAB",
            "text": "Jason has been great with the service and guiding us with recommendations for my family."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxRFlVVjZRMlJ1TVhFM1IyZDVTRkIwTVZwQ2EwRRAB",
            "text": "Jason was amazing with our group loved the food and service it was great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMVh6aHlOelZJYjNvMVptUk9YekJRT1RKc1YyYxAB",
            "text": "Loved eating here. The food and the staff are amazing. My best dinner in New York. Much thanks to the staff for doing such an incredible job with the food and service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxeWNXWkVPWFpQTjFaMmVrdDVVVk5TVkRsTGFFRRAB",
            "text": "Great food and great waitress, Aya. I would recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjNVJsQnpZMmxsYVRkbVJuQnNNR3BwYWtoYWJuYxAB",
            "text": "This location is one my favorites; the food is always so good (Szechuan pork ramen is my #1) and the servers are so welcoming. I’ve had such great experiences with Henry and Massimo taking care of me. Will always recommend this spot."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NlgySmliVWxSYjFwRGVESnNTREpRVjNCRlozYxAB",
            "text": "Great experience!    Great location!   Friendly staff.    The appetizers I ate were great and the Juice bar drink was fresh and smooth."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsSGFscE9NRkpxWDNwQ1dqWkdVbWsyU1hwNlMwRRAB",
            "text": "Great food, cool kid-friendly options, amazing service, ambiance is great"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0aHJLV1JnEAE",
            "text": "Paollo was attentive, delightful and very sensitive to my food allergy. Hie made this experience second to none. Thank you, Pollo"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMNkwxYks0bnBpdHZ3RRAB",
            "text": "Jason was great"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oSVgwUkdORWhzV21ka2FtNUtibnBUV1VORVRVRRAB",
            "text": "great server thanks jason"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKSGNEQTRXbU5hZFc1cU4zbHRORlpxY1ZWaExWRRAB",
            "text": "Wagamama is one of our go to spots in the neighborhood. The price range is great and the food is good. Service is also amazing, you really can’t go wrong if you go here.\n\nJason was an excellent server. He was friendly, thoughtful (gave our children age appropriate cutlery) and helpful. He went over and beyond by surprising us with a cake because it was our daughter’s birthday.\n\nWe highly recommend this place to anyone who lives in the neighborhood and for those who are visiting."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPdmd4UGlkdUl5Tkp3EAE",
            "text": "Wagamama is my go-to restaurant when grabbing dinner solo while on work visits with the UN. And it's just 3 steps from my hotel. Steven and colleagues make me feel so welcome and comfortable, tending to everything to 5* service. Tonight I misordered a dish I could not really eat and got fabulous gyoza and wine on the house. I'll be back and warmly recommend this place to everyone up for great food and tip top service!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPV2UxTk9MMklhRzRRRRAB",
            "text": "Madison was an amazing server!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCTVdGcEJTSFF0UkhoSGF5MDNORk15TldOSVUzYxAB",
            "text": "Excellent Wagamama in a great location. 1st time for my son, he is definitely a fan.\nCheck 'em out!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPSHZfdEhzanZUYUFREAE",
            "text": "Had the vegan pho. The mushrooms on top were phenomenal! Tofu was crispy! Everything came out really fast ☺️ wish there were a few more vegan options, but the one I got was great. I asked for no cilantro on the pho and they obliged!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJZnQxX0dHdnRXYlRREAE",
            "text": "We arrived at New York yesterday and really needed a good meal before going out for our adventures. Jason was our server and made the whole experience enjoyable while at Wagamamas!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNZllzTnk2bWVIbkVnEAE",
            "text": "The server Jason was really great."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prMlJVRnNOM1UwTVZjMlVXUTBSRlYzV1dGRmRYYxAB",
            "text": "My server jeancarlos was an excellent person. Showed good service and good customer care. Didn’t miss a beat with my order and was friendly to me."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPbi1qLVBxXzg3a2VnEAE",
            "text": "Steven was amazing!! So welcoming & attentive! He rocks!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKTG5yX0NTdWIzbWxnRRAB",
            "text": "Steven our waiter was amazing!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213ME9FUkdYMjV0Um1kWVVsVlJlaTEyUlRWcE0xRRAB",
            "text": "Jason our server was phenomenal"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKajI4YmpucVB6a2hBRRAB",
            "text": "Stopped by for dinner after work and was served by Jason. What a legend. Great service, very attentive and made sure we were all taken care of"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdlBid2hnRRAB",
            "text": "우리는 다양한 음식을 주문했고 모두 훌륭했습니다.\nSteve는 우리 요구사항을 잘 들어주었고 친절했습니다."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWNGY2NU9REAE",
            "text": "한번씩 가는 편인데 다양한 메뉴를 즐길수있어요~"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMk8yQUVREAE",
            "text": "Everything about our visit was a 10/10 from the incredible service to the amazing atmosphere. What really made the experience stand out was our bartender, who was not only knowledgeable but also had a fantastic sense of humor and a super positive attitude. They recommended a Manhattan to pair with my meal, and it ended up being the perfect match. Their energy, friendliness, and great drink suggestions made the night even more enjoyable. We’ll definitely be coming back! :)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMVC11OE9nM0wycTRBRRAB",
            "text": "Despite coming off hours (between lunch & dinner),  Irving and Jason gave me VIP service with a smile.  What a lovely, warm place where you are treated like family.  The pork bun with apple was absolutely amazing. I still can’t believe that was an apple so delicious.    I also had the crispy tuna appetizer so good! I will be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMNnd0ZTdJdmFiSnZRRRAB",
            "text": "The young man who helped me said he’d only been working there for about three months, but he did a great job. Super friendly, spoke really well, gave solid recommendations, and seemed kind and attentive to everyone around him. Definitely a great fit for the team. Great food! Would eat there every night if I could"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNdUJzWS1yX19fX0ZnEAE",
            "text": "Nice Vibe at the Murray Hill wagamama.  Almost as good at the wagamama's in London.\nThe service was good. Appetizer was very tasty.  I had the Pad Thai with shrimps instead of the chicken.  Delicious with a nice bite."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKU0J1OGVNb3NueTFRRRAB",
            "text": "Very empty during weekend lunchtime, great food and service. The “Bang Bang Cauliflower” is unique, fried crispy outside, delicate inside"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMGN5ZzNBRRAB",
            "text": "The chicken pad Thai here was very good in flavor and everyone else enjoyed their meal as well. We had the cauliflower and dumplings as an appetizer and that was delicious as well. I’ll certainly return and try other dishes. The juices were also very refreshing."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBemVyQVdnEAE",
            "text": "I came in with a very snug outfit that day. I was excited to try something different. I was sincerely disappointed. The bowl looks good but I promise you I'd rather feed that to my dogs. This was literally plain white rice, chicken and some vegetables slapped on a bowl.\nThe chicken smelled rank. It was also dry.\nBut here is the worst part.\nAnd I kid you not, I was ignored for almost an hr and 45min before my food could even arrive. I sat paitiently and watched as everyone that came after me got served first. I don't know if it was because of my appearance or so but I didn't feel welcomed after a while. The place was not busy at all too.\n\nI would suggest turning your sights to other places for better food and expiriences."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJM1c1UFdsZ3ZHSUhREAE",
            "text": "The meal was absolutely delicious, and Angel was a brilliant waitress. She ensured that we were well attended to. I will highly recommend this place; you will not regret it."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRamYzMmRBEAE",
            "text": "Chicken Katsu Curry was great! I just wish it had more salad and less rice. But the chicken itself is crispy and tasty, and the curry sauce is rich and flavorful\nI also had the duck pao. The flavors were good, less spicy than expected but a bit dry for my liking.\nRestaurant was busy and service was slow but everyone was nice."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfN01EbWt3RRAB",
            "text": "I came to this restaurant on impulse. Near my doctor's office. It was lunch time and I was hungry.  I was greeted and warmly welcomed to my table by a young man named Kevin.  He had a big bodacious smile and a gentle, friendly demeanor. I had questions and he was very knowledgeable of the menu items. I liked some of his recommendations. Had the pork dumplings that were absolutely delish then a bowl of chicken Ramen that was equally delish. I sipped on a glass of Chardonnay that was perfect and a glass of this lime, mint beverage that added a kick to my Chardonnay. Thank you Kevin for the great service and for making a pleasant Monday afternoon lunch experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJZmtfTmVZaWQydEpBEAE",
            "text": "Wagamama has excellent happy hour specials--definitely worth stopping by after work! The food leans more toward Asian fusion than authentic Japanese cuisine, but it's still enjoyable. I tried the grilled duck ramen, though it wasn't particularly memorable; the broth was a bit bland, so I'd skip the ramen next time. However, I highly recommend taking advantage of the happy hour and trying the bao buns--they're delicious!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRaVAtMXZRRRAB",
            "text": "I have dined at Wagamama’s several times over the years, but this was my first time at this location. As I walked in, I loved their dining area appearance, was so stunning, with modern furnish, large windows, full of sunlight.\n\nTheir menu was same as other locations. We ordered bunch of items like duck and karaage chicken baos, calamari, edamame, bang bang cauliflower and the duck ramen. Food came out at decent pace. Most of the items were good, the baos and edamame specially. Duck ramen never misses, their best dish. But the cauliflower didn’t taste good. The chicken in daughter’s kids meal was also dry.\n\nThe service was excellent. They gave coloring paper and crayons to the kids. We got few drinks that were well made. Overall we had a wonderful lunch at this location."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRazU2Z2V3EAE",
            "text": "Enjoyed my first visit to this Murray Hill location.  Started with tuna tataki and nicely spicy bang bang cauliflower. Short rib ramen (served on bone) was delicious, maybe wanting for a bit more broth. Service was good but a bit frazzled. Disappointing cocktail came late and with dinner and a little confusing as to just who was waiting on our table, but I think staff was having an off night. Otherwise, nice ambiance and enjoyed it."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2eE9QN2N3EAE",
            "text": "We absolutely loved the food. The wait times weren’t bad either. The only reason I am giving 4 stars is because of a drastic price difference on a menu option I ordered. Thankfully our waiter did return to let us know that the kitchen staff informed him of the price for the night and he then helped me to choose a different option."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfLXV1aWJREAE",
            "text": "I think the usher was a little scared with my presence - I might not have the appearance he expects in a customer😂 - and he was a little off when I asked a table for 1, respecting the protocol by waiting for him to seat me . So many free tables and he places me right in a weird location. I already knew what I wanted to tray and another waitress with attitude came to ask me if I was ready for ordering . As I did so , she disappeared and another guy - more polite though - came to bring me the food . My vegetables yakisoba was really beautiful but extremely dry . So, I asked about the kinds of mushrooms they were using in the dish and again, the “bossy” lady just ignored . Anyways , they have to understand that we LATINO can afford their food and they need to train them to work with diversity . Not sure if they realized but they are in NYC."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dy0zbk13EAE",
            "text": "I’ll start off by saying I usually never leave reviews. However I ate here at wagamama in Murray Hill and this was my experience. I ordered the Kare Burosu and it was absolutely delicious! What really stole the show for me though was my waiter Kevin. He was so attentive, so polite, he made sure my drink was never empty , he was just such a pleasure to have met & I will be back soon ! If you’re ever in the area you have to stop by !"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dzk2Y2RREAE",
            "text": "I had an amazing experience at Wagamama! The duck ramen was absolutely delicious!!! Rich broth, tender duck, just perfect.\n\nMy server was Kevin. He was super attentive, kind, and made sure I had everything I needed. Honestly, he made the meal even better! Great food + great service = a place I’ll definitely be coming back to."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQbHZISGRnEAE",
            "text": "Drinks took forever to be served, but food was pretty tasty, some creative dishes. Vibe of the entire place is good. Big groups are welcomed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1cHM3TkV3EAE",
            "text": "MCame for dinner a couple nights ago & I loved this place so much. From the moment me and my friends walked in, we greeted immediately & seated quickly. The food was top notch, quick, incredibly good. Our server was so kind and got every detail right. My favorite were the crispy pork rice rolls!!!! Even the manager came by our table and checked on our experience, which was really nice.\n\nThis is place is def a must go to go lunch or dinner!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMYjFncGoxd295SmtBRRAB",
            "text": "Nice outdoor seating.  Plenty of seating available.  Menu offered plenty of options and the food was very tasty.  Price point reasonable."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MDlDb1ZREAE",
            "text": "Kevin was my server and he was amazing! I ordered the ginger chicken udon and was delicious! 10/10 - definitely will be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbHRYOE9nEAE",
            "text": "Our server Jonathan was excellent with his service, he gave great recommendations and was attentive and helpful with our questions."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3OEx5UFpnEAE",
            "text": "I had Kevin the bartender and let me tell you they were extremely sweet and welcoming. It made the experience 10 times better because of their attentiveness and outgoing personality. I definitely will be back and hopefully see Kevin flourishing at their job."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsN05IZWRREAE",
            "text": "Steven was such an amazing experience.\nThe food was delicious, his recommendations were tasting great and we had a lovely experience, first time at wagamama. Will come back. I highly recommend the Tokyo fries."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcXBhVDF3RRAB",
            "text": "My visit to Wagamama was exceptional, thanks largely to our amazing server, Cedrik. From the warm welcome to expert menu recommendations, Cedrik made the experience truly memorable. His attentive yet unobtrusive service, combined with his genuine care, ensured everything was perfect. The ambiance was top-notched too.\nThe food was delicious, the best short rib ramen I had. The stellar service is also what will bring me back. Highly recommend this place and hope to be served by Cedrik again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidGFXNmRBEAE",
            "text": "Nice restaurant with a large number of vegetarian options on offer.\n\nLooked very quiet when we arrived but quickly picked up which is always a good sign.\n\nBoth of the vegetarian bao options were very yum, though if I had to pick one it would be the eggplant. I also ordered the vegetable curry which was pretty good. To me it felt like there could have been much more curry sauce, and while it was on the menu, I didn't expect *only* katsu vegetables."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeXRpQ2VnEAE",
            "text": "Went here for a dinner and the restaurant was not crowded. Good ambience but the one near Madison Square has it better.\n\nThey have nice cocktails - Aviation, Blossom are must try! The eggplant baos are a good vegetarian option. The Chicken Firecracker was REALLY spicy  (rightly so) and the Chicken Pad Thai was perfectly spiced and well done.\n\nThe chocolate layer cake was moist and goey balanced with the ice-cream scoop - a lot of texture game going on there!\n\nOverall, great service and food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6bHZYa0NBEAE",
            "text": "What an interesting Japanese fusion-esqe restaurant! The ingredients were so fresh for each entree and appetizer — I was in awe with how delicious each dish tasted and how aesthetic the kitchen crafted the dish to look. Will definitely come again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsd1lqY0FREAE",
            "text": "Excellent experience!\n\nQuiet Sunday night with quick and excellent dinner service. Sam was super helpful and we had a great experience.\n\nThe chili edamame was good - I was expecting it to be spicy but it was very mild.\n\nI got the chicken pad Thai and it was delicious! The chicken was yummy and it was a huge portion."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5Nk9qY3hRRRAB",
            "text": "Overall decent service, a bit delayed at times and the waiters changed without informing us, but overall good service, yummy different food, decent drinks, and atmosphere to come with a friend to eat and have a drink. My friend mentioned the steak being a bit too fatty for her liking but overall liked her plate."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNDliMzRRRRAB",
            "text": "We live in the neighborhood and eat here semi regularly.   On Saturday night we arrived 10:14pm for a quick bite, 45 minutes before 11pm closing.   We were told we could order take out only - they would not seat us… No explanation or apology.  Just very rude."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQMkdsdVNzamI2MjFnRRAB",
            "text": "The food was great. Jason was super responsive, taking care of every need we had, including a gluten allergy. He was very fast as we were rushing to leave for an event after dinner. We would love to come back and have the kind staff help us again"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dzRYOEx3EAE",
            "text": "We had the pleasure of being waited by Kevin. He was so attentive & recommended the spicy beef donburi ! It was amazing. I love me so spicy food 😋 thank you Kevin! We will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkalBLOExBEAE",
            "text": "this Hass to be one of the best ramen spots, their broth is delicious 🤤 prices are also pretty good considering that it is right near Midtown but definitely worth the cost. Happy hour prices are also pretty decent I recommend go during those times. only thing I would say is you might have to order more noodles because it’s so good🥶😍😍"
        }
    ],
    "reviews_count": 86
}