{
    "name": "Villa Berulia",
    "place_id": "ChIJe14KpQdZwokReRadKUwTRSM",
    "grid": "MN6",
    "address": "107 E 34th St, New York, NY 10016, USA",
    "rating": 4.7,
    "user_ratings_total": 447,
    "phone_number": "(212) 689-1970",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tneVRIVXdkMUkzVDA1WU1ERmpOM2RWYUZkelJtYxAB",
            "text": "At prime dinner time, this restaurant was too noisy for us.  The walls seem to echo and we couldn't hear each other across the table.  Service was attentive and food was good."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbFlUQjZNM2RTWVdFemFHRXlaVVJ4YVY4MVVtYxAB",
            "text": "If you’re working in Midtown, this place is located well.. right next to Park Avenue where a lot of offices reside.. very tough to locate this from outside. The name boards outside are small and not striking..,    The inside of the restaurant was great. Perfect and ideal for official meetings and get together.., the ambience is cozy and there are lots of tables inside to sit and eat . Service was OK.\n\nA pricey restaurant  ..  minimum vegetarian and vegan options but I’m glad that at least had it.. got her ravioli pasta vegan for about $30! It had tomato basil sauce on top and tasted good.. very pricey though.. other got fish and chicken dishes, which they liked.  Cost them $35-$40 for a chicken or fish dish…\n\nOverall liked the food but it’s an upscale restaurant and not for all.  Good experience . 4 stars . ⭐️⭐️⭐️⭐️"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsRU5IcFBWRWRrZDNORlZWZEdVMU00WjJvM05XYxAB",
            "text": "Quite surprised by this almost hidden gem! The service- the SERVICE ❣️ and food were all so lovely. The food was incredible; I could have licked the plate. But really it's the environment and how everyone working there makes you feel welcome and \"at home\"."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KWFNGUlBORWhJZFVKWFoyOTBlVTVqVTA1eVNsRRAB",
            "text": "It's a big disappointment! We had dinner at this restaurant yesterday. I ordered seafood pasta for myself, and my girlfriend ordered baked salmon. The sauce in the salmon dish was delicious, but here the ge was baked and steamed, which ruined the whole dish. But at least it could be eaten. The pasta I ordered was not possible to eat at all! It didn't taste good, and the shells were washed well, so there was a lot of sand in the paste! I ended up leaving hungry and going somewhere else to eat. Wasted time and money!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JelNIRmZRV2N3YzFaNVZVbFpXbkoyYkZacFgyYxAB",
            "text": "Had a wonderful evening celebrating a birthday here. The service was very attentive and everything was delicious. When it came time for dessert I was very pleasantly surprised when they brought a cake and sang happy birthday and remembered my name. We were very appreciative of the experience and will definitely be coming back highly recommend"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210ZldtNTBjRTFhYXpJMmVsQlpTV28yYjFsbU9YYxAB",
            "text": "Excellent service, food, and drinks. I absolutely loved their meatballs"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoYWJGY3hjemRZVjFKMVpETXRYMHd4V0U0NVpYYxAB",
            "text": "I attended a group luncheon here in the back room. Food and service were very good!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJdGQzUmZiSEpqUlY5ellqSkVSM0p1VVRscVQxRRAB",
            "text": "If you want to pay to be conveniently comfortable disregarding a true foodie experience , this is the place.\nIt caught my attention after reading several reviews in TripAdvisor, over there people gush about their  “outstanding service, delicious food and very reasonable prices for NYC”. I don’t know, I do t think they’ve eaten out in the city a lot because  to me it rings like tourist talk, doesn’t it?\n\nSometimes a place is just too… nice.\n\nI genuinely don’t think anyone eats here twice. I mean, if you wanted to, you’d go back to something real not this Midtown polished-to-a-shimmer joint.\n\nI don’t know… it was absolutely flat.  Not worth the hype or expensive prices at all. The service was excellent and the ambience was nice. Too bad the food isn’t."
        },
        {
            "date": "2달 전",
            "language": "de",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vMVNtY3hkVGhPUW1ZNFdXdHpSMUZpU1hjNUxWRRAB",
            "text": "Durchaus. Das Essen war ziemlich lecker, jedoch ging alles Schlag auf Schlag und man hatte das Gefühl, dass man uns als Gäste (sowie auch andere) schnell anfertigen wollte. Die Weinempfehlung war ok aber mit 30$ für ein Glas(!) definitiv überzogen. Hier sollte man sich die Weinkarte geben lassen, da meine Empfehlung nur mündlich kam."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoeU5EbHpTRUpNZVhoWmJsWmZPVEJ1Y21WV2FtYxAB",
            "text": "Good pasta! Stopped in during restaurant week. It was very loud and a little hard to hear your own table, but also an testament to how good the food was because it was busy!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBbVpyODRBRRAB",
            "text": "So happy I was there after so much time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkR2NtcDFXVkZRVGpSVGJWQlZlbmxIVW5FdFJGRRAB",
            "text": "Visited for lunch as part of the restaurant week in NYC. Solid menu with classic Italian options. Had a delicious appetizer and a fabulous tortellini bolognese for main. Great option in Midtown East for a business lunch."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SUE5IcFFTR1ZyZUc5MVp6aGhNRGxrUWxZMFoyYxAB",
            "text": "Nice decor and great food. Love the chicken scarparielo!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25weFJtd3lORlIzZW1FdFpHZDJTa1JFT0RkaWVGRRAB",
            "text": "The food was really excellent and the service friendly and charming. One of the best pasta dishes I have eaten and also one of the best tiramisu"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KWk1tUjFTMkp6UjI5WVl6RlJkVTlPVDI1S00zYxAB",
            "text": "Welcoming and attendant staff, wonderful service and exquisite grilled calamari."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vMFZUQk9jMkoyUkZCcFJEQkxkeTAyVGpkMk5IYxAB",
            "text": "There is something comforting and nice coming back to a place you were 17 years ago. This time with kids but the place didnt skip a beat. Amazing food, service and overall experience. Thank you for being amazing hosts once again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CM1FrdFJiV1JKTkd4eFh6Vk5iMjF0Umt0bU5sRRAB",
            "text": "A classic, vintage, Italian restaurant that has been around for decades. Restaurants don’t last unless they’re good and this one delivered. The service was professional and polite without being pretentious. The servings were generous and impeccably prepared. Fun atmosphere for a family outing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205b1MxbHVaM1Z5WDE5T05VSkJjVjlLVkZBNU1uYxAB",
            "text": "I had a lovely experience at Vila Berulia in NYC. The cozy atmosphere and authentic flavors instantly reminded me of home—I’m from Croatia, and this place brought back so many warm memories. The antipasto was fresh and flavorful, and our server Pedro was exceptional—kind, attentive, and made the whole evening even more enjoyable. A true hidden gem in the city!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sc016UTRNMEpPWTNsUVlXTlZjbGRyYTI0MlFWRRAB",
            "text": "I read that one should have the osso bucco so I did. It was perfect. I got two meals and an incredible bone broth out of it. I took no photos as it was business."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkZk16RkpSbGxDZG0wd2RETnJhRFJLVDFOSGVIYxAB",
            "text": "Beautiful place, excellent service and food. I went during lunch so it pretty quiet. I imagine on a busy night it feels like an event."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBZ3MyMVZBEAE",
            "text": "This restaurant is six stars. The food the service and the atmosphere are absolutely phenomenal."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKQzIzTXZjMlpYcjhnRRAB",
            "text": "Had a great dinner on Saturday, food and staff were wonderful. It was a late afternoon reservation we made just walking down the street to Union Square for an early show. Definitely be back when we visit NYC again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOSGUtLXZYeVBTVDZ3RRAB",
            "text": "Great food, even better service. We just moved into the neighborhood and are so glad to have this gem  literally around the corner. We chatted with the owners and they were super kind and offered a bottle of wine as a welcome gift."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJSDIzZFRwaUllWlhnEAE",
            "text": "Best local Italian restaurant - staff is so kind, food is exceptional. Killer wine list and bar, great for group and solo dining. Only bummer is they’re closed on Sunday and Monday"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZc1l5VklnEAE",
            "text": "One of my favorite spots - super cozy, the food is delicious, and service is top notch!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZN3VuclFBEAE",
            "text": "Villa Berulia is the first restaurant I've gotten to try in my visit to New York and it was a great choice! I absolutely love how lowkey the entrance is, if you're not paying attention you may miss it.\n\nThe inside is relaxed and intimate. Their wine selection was plentiful and precise, I really appreciate they put what type of wine each glass is instead of just \"White wine, red wine, etc.\"\n\nAdditionally, our food was delicious. Coming from Portland, I've been lucky to have so many amazing Italian restaurants in my neighborhood and Villa Berulia brought me right back to those restaurants with authentic, delicious pasta.\n\nThe service was a standout as well. Attentive and friendly, and I appreciated how they allowed the table to eat and talk. I recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMThXNkRBEAE",
            "text": "An absolutely perfect evening. Food was good. Service was excellent. This would be our weekly restaurant if NYC was home for us. You can't miss spending and evening here."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNTlua2hnRRAB",
            "text": "Great food and services were great."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMW9qMzlRRRAB",
            "text": "This is a must experience. I had two incredible meals over two days and now I want to try everything on the menu. Frankly, I expected great food, which it was. The shining star here is the intimate atmosphere and the best service I have experienced in awhile. Simply amazing!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJN0xXZ2RnEAE",
            "text": "Fantastic classic Italian spot. Amazing service and food in a stunning space!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOElYdzRnRRAB",
            "text": "Grabbed a last minute reservation here on a Saturday night and was blown away by the experience. Every single employee was incredibly gracious, kind, and helpful. The service was extraordinary. The food and drinks were all delicious and fairly affordable by NYC standards. The ambience was dark and quiet, a perfect place for an intimate dinner with family or friends. Cannot recommend enough!"
        },
        {
            "date": "7달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bk5PVWtRRRAB",
            "text": "Passámos uns dias em NYC e decidimos reservar mesa para, num dos dias, jantarmos todos juntos e celebrarmos a viagem - de empresa - que estávamos a fazer: e não podia ter corrido melhor.\n\nO ambiente é muito bom, com média luz, simpatia, um balcão de bar estupendo e simpatia de todos. A comida acompanha o ambiente, deliciosa, bem confeccionada e acolhedora.\n\nA cereja no topo do bolo foi conhecer o Steve e conseguirmos, no centro de NY, ter uma bela conversa em Português. Sentimo-nos ainda mais em casa.\n\nObrigado ao Steve e a toda a sua equipa. Se estão em NYC e querem ter uma excelente refeição, num bonito sítio, visitem a Villa Berulia."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bE5PZHZ3RRAB",
            "text": "Great meal and great experience. I will want to try the entire menu."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaC1udHhBRRAB",
            "text": "I'd gladly return."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncXBLMnhnRRAB",
            "text": "Beautiful atmosphere with friendly staff, along with delicious Italian food, best dinner of 2025 thus far."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNjY2TlV3EAE",
            "text": "Great place great food i highly recommend staff was absolutely nice and great service"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVOXRQbXRBRRAB",
            "text": "Among the loveliest  restaurants in NYC.\nThe food, the atmosphere & the owners.\nVery very special~"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcGVuU21BRRAB",
            "text": "The flourless chocolate cake is amazing!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMllUVTB3RRAB",
            "text": "Amazing ambience, delicious pasta and wine."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dlk2UkxREAE",
            "text": "Lovely  place and great staff ! Super nice and food is great ."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cmJUT0NBEAE",
            "text": "Highly recommend this place! Their staff is highly trained and attentive. They went the extra mile in serving my family for our holiday dinner in NYC. The ambience was just perfect. And the food!! The food was soooo so good we all cleaned our plates and left very happy. 10/10 experience. Thank you guys for the great hospitality and delicious meal. It's no wonder this place has been in business for decades.\n\nA real NYC gem.\n\nThanks!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2OXMzRXZBRRAB",
            "text": "My wife and I have had the pleasure of dining at this location over the years. The men are men, the women women, and the food is as expected. Hail to the classic European values and traditions!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQbE9uVUhBEAE",
            "text": "Excellent environment for families and business. Great food. Chef is very open to tailoring the dishes to specific needs - like in my case, I eat plant based whole foods and they made sure I had a good meal."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzMzdMVGFBEAE",
            "text": "We had such a lovely night here. Old world charm and warmth.  Our waiter/bartender Josh was top notch! The flourless chocolate cake was out of this world! Will definitely be going back And recommending!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcDdpRnFRRRAB",
            "text": "Absolutely wonderful experience with the classic Italian cuisine, friendly and very professional service, and pleasant atmosphere! Every bite was a masterpiece, and the dessert presentation was spectacular!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdlpTMWhBRRAB",
            "text": "LIFE LIVE LOVE .\nGreat food ,management, staff, location,  it's a beautiful family atmosphere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbGVUUHJ3RRAB",
            "text": "Villa Berulia is truly a gem in NYC. The food was outstanding—we enjoyed a variety of delicious entrees, and for my main dish, I had a pasta with squid ink and seafood that was bursting with flavor and beautifully presented. The attention to detail in both taste and presentation was exceptional.\n\nThe service was just as impressive, with a friendly, attentive staff who made us feel right at home. To top it all off, I even had the pleasure of enjoying a shot of Ginja, a Portuguese liqueur from Óbidos, with who I believe was the manager—a unique and memorable touch! Highly recommend Villa Berulia for an authentic and welcoming dining experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYX3JMZDhnRRAB",
            "text": "We hosted a group dinner and the food, space, and service was outstanding.  The vibe is relaxed and polished. The staff was exceptionally attentive and each course was delicious. It is a family run business serving home-grown recipes. The fish was light and tasty, pasta perfectly cooked, and the osso buco tender, juicy and melt in your mouth good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYX3VTSGt3RRAB",
            "text": "The food, cocktails, staff and service is all top notch. I have never been disappointed eating there. One thing that does bother me is the cranky old people that complain about a busy and loud restaurant on a Saturday night. Please stay home then!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbHNUX1VREAE",
            "text": "The ambiance and the service were impeccable.. I chose to listen to Pedro and Steve’s recommendations and they were superb. I came in for an early dinner and left feeling like I had been hosted by family. Could not recommend more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuLS1LRC13RRAB",
            "text": "Visiting New York from Hawaii! My family and I enjoy coming to eat, play, and shop. Villa Berulia is an Italian restaurant with a friendly family style atmosphere which we loved. The restaurant was clean and polished. The service was excellent! Pedro was very friendly, knowledgeable, and helpful with the menu. They have a great selection on the menu and cocktails & wine. The food was well prepared, presented, & delicious! Steve, the Manager, came to our table and greeted us and thanked us for coming to Villa Berulia to celebrate our wedding anniversary. Overall, it was a wonderful experience all around! We will definitely come back here again on our next trip to NYC!❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREOG9DXzFBRRAB",
            "text": "1- Food =  Excellent. 5/5. Everything from appetizers too deserts are all made with the finest ingredients and cooked to perfection. Very happy here.\n2- Service =  Excellent. 6/5.  Their unparalleled service separates them from mostly every restaurant we have visited. Very friendly and inviting service that treats you like family. We never feel rushed and we are constantly being asked if everything is ok. Owners and everyone else here are very friendly and accommodating.\n3- Ambiance = Excellent  5/5. Beautiful romantic environment. Tables are good size and there are plenty of unique pockets to this restaurant. Interesting layout.\n4- Reservations =  Excellent. 5/5.\n5- Value = Excellent  5/5.  Unparalleled service and amazing food.\nWe will continue to Visit and recommend this amazing restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURacUx5Z2p3RRAB",
            "text": "A Midtown classic, Villa Berulia never disappoints. I've been here a handful of times and the service and food have been second to none!\n\nThis time around I came with my good friend and my godson for Friday dinner. We started off with a plate of fried calamari. It's probably the best calamari in town!\n\nAs the main dish I had to get that night's special which was a lamb shank with a side of gnocchi. The meat fell off the bone, and the sauce was unbelievable!\n\nThe icing on the cake was a nice complimentary glass of Limoncello and small cookies. A nice touch.\n\nPro-tip: Villa Berulia is a great place for dinner or lunch before heading to a concert or sports event at MSG or before or after a visit to the Empire State Building!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoX2U2TERREAE",
            "text": "What a discovery! A friend invited me to “drinks in the neighborhood” and it turned out to be Villa Berulia. Since I’m new to this part of the city, I wasn’t familiar with it, I’m sorry to say. But I CAN say that I am hooked.\n\nThey have a sauce they use for the meatballs and more that’s out of this world.\n\nOnly stayed long enough to taste a simple pizza, a plate of cocktail meatballs and a cheese and meat board. Each was delish and a step above most Italian places I’ve eaten at in the city.\n\nGreat service and a family atmosphere (owned and operated by the same family for 42 years!) made it extra special. I can’t wait to return for a full meal — and another review."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtOVA3Njd3RRAB",
            "text": "Highly recommend!! I ate at a lot of places in nyc but this was probably my favorite. Maybe one of the best Italian dinners I have ever had. The service here was incredible everyone was so positive and helpful. They had the best service I have ever experienced in any restaurant! The food was incredible and everything tasted really fresh. The prices were reasonable for the great quality. The ambience was also very nice. If your nearby I definitely suggest making the trip!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyNnBQcHRRRRAB",
            "text": "Best Italian dinner I ever had.  Amazing lasagna and Croatian wine.  The scampi was delicious. Incredible service and special attention by owner Alex.  The desserts were perfect!  Antipasto appetizer."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzLWE3NnJBRRAB",
            "text": "The service here was fantastic!  The host was warm and welcoming.   He came at the right times to check in on us, always with a smile.\n\nWe ordered the seafood linguini and shrimp francese.   Both were seasoned well.  The seafood linguini had a good seafood-to-pasta ratio.  The mariana sauce had a clean, clear taste while the shrimp francese had a delicious egg batter with a smooth white wine sauce.  We enjoyed the tiramisu as well.   The lady fingers were soaked the right amount in rum and the dessert had a perfect silky texture.\n\nThe dishes were a little on the pricey side,  but your get what you pay for :)"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNTZqc3dBRRAB",
            "text": "El ambiente es lindo pero no es muy iluminado, nos atendieron muy bien, el mozo hablaba español Asiq nos sentimos muy cómodos, venden media botella de vino q la pagamos $40 usd estaba bueno y nos dieron una copa de lemonchelo q estaba muy rica. Comimos lasagña y ravioles de langosta, gastamos $134 con 1 vino y un agua con gas"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKb3JMbF9RRRAB",
            "text": "Beautiful restaurant loacted in Manhattan Mid town east. Very casual but also chic.\nI had a main dish of fish, i enjoyed every piece of it.\nService, friendliness, staff and ambiance are great.\nVery recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0cjhIVEtBEAE",
            "text": "Villa Berulia is New York City’s best local gem. The family that runs the restaurant truly cares about everyone who walks in so you really feel like you’re at home. They have great drinks, but the food is completely next level. I cannot recommend the Chicken Berulia enough as it is a life-changing experience and everyone needs to try it. I can’t go more than two weeks without it, it’s that good!\n\nHighly recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1ak8ySXd3RRAB",
            "text": "Found myself dreaming of this place again & realized I forgot to leave a well deserved review. In short, my spouse and I reserved an evening here during a celebratory trip in the city. From the moment the door was opened for us, staff was welcoming with care start to finish, my first impressions being how beautifully dim with candle light our table was.\n\nOur appetizer, calamari, was perfectly cooked and crispy. We were practically drinking the marinara sauce! My spouse ordered an in house champagne and gave it good marks. I then received my tortellini and was floored. Simply the best I’ve ever had. Impeccable from-scratch mushroom sauce and pasta, as expected, but not at this level. Portion sizes were great (maybe too great, we barely waddled back to the hotel!). We were then convinced by two gentleman handling the dessert cart to get a pretty undersold “chocolate cake”, which ended up being a decadent mousse topped with sugar and drizzle.\n\nOverall, worth the money, time, and company to be here! The only thing I would suggest to the wait staff is to not constantly attend our water, especially when it’s a couple on a romantic date. A nice man came every five minutes or so and it was truly unnecessary. Regardless, we hope to be back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1c0phR2hBRRAB",
            "text": "Came in on a Wednesday night with a few girlfriends to try out the restaurant as part of restaurant week and celebrate a friend's birthday. From the moment we stepped in the door the service was impeccable. Stephen and George made sure that everything we could even think about was taken care of. A big shout out to Stephen, who went above and beyond the entire evening to make sure we had a great time. It's a beautiful restaurant, dimly lit and super romantic- equally perfect for a date night and a ladies dinner. The food was SO SO good. Highly recommend and will definitely be back."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzOHVpYVpBEAE",
            "text": "A traditional Italian place, classic dished done well. Was neglected a bit after entrees came out waiting to see the desert cart, getting and paying the bill. Waiter busy schoozing with the other tables instead of attending to our table causing meal to be 30 min. Longer. Good layout, lots of nooks creating much more privacy for tables. Clam casino is more bacon than clam, portions for veal marsala is quite small though the osso buco is delicious with tons of bone marrow."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXd0lDSFRnEAE",
            "text": "What a special place! We hosted a milestone birthday here for my great aunt, and from the very first email to the minute we walked out the door after the party, the service was impeccable. Alex and her husband Stephen make you feel like…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzNi1LMHdBRRAB",
            "text": "Amazing staff. Great food. Tranquil atmosphere. The wine is plentiful per glass. I cant wait tontakenthe family here for a large dinner."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4OXZYYy1BRRAB",
            "text": "For service and quality, this restaurant is unsurpassed. Incredible attention to detail and the finest Italian food I've had anywhere. The service was nothing short of pure excellence. I'll return here on every visit to NYC, it was simply that good. Thank you Steve!"
        },
        {
            "date": "3년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtX1lIRnVRRRAB",
            "text": "Das tolle italienische Restaurant im Herzens Manhattan entdeckt. Sehr sehr nette Mitarbeiter, man fühlt sich direkt sehr wohl, die Atmosphäre ist super und das Essen mega lecker. Wer in New York lecker italienisch essen möchte, sollte hier einen Abstecher machen!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtbDdmV2dBRRAB",
            "text": "The food quality is so good! I ordered Buzara. Lots of fresh seafood in my plate. The service was excellent. And love the atmosphere. It’s a lovely night with lovely meal."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNNy1Pd1F3EAE",
            "text": "Very nice place, perfect for dates. Intimate environment. Prices are okay compared to other places in this kind of neighborhood (at least have a 100 with you). Food tasted good. A very welcoming place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4MEpuWDlBRRAB",
            "text": "Great lunch spot. Service was great and quick too. The food was delicious ! And good amount too!! Definitely would come back and recommend. I even like the bathroom decor. Lol try it out !"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtb3U3TEZnEAE",
            "text": "So happy this restaurant is still here after COVID, as this was where my fiancé proposed a few years ago.\n\nIf someone asked me for a romantic dinner recommendation, this place always comes up first in my head.\n\nThe atmosphere is intimate and unassumingly elegant and the table service is unmatched. Everybody, from the maitre’d to the servers to the owners, is so genuinely thoughtful and welcoming, consistently checking in on the tables to make sure guests are comfortable and are enjoying the dining experience.\n\nFiancé got the Bistecca and I got the Pumpkin Ravioli special. Everything was absolutely delicious. Our dressed-to-the-nines server, with the glasses and infectious smile, offered complementary sambuca with our cappuccinos and chocolate mousse at the end. The chocolate mousse was decadent and incredibly rich and the cappuccinos had the espresso to milk to foam ratio perfected.\n\n10/10 in every aspect!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURScFplMWtnRRAB",
            "text": "Family owned Italian restaurant, relaxed and comfortable atmosphere, great food and wine. I had the osso buco, which they make the traditional way. Not cheap, but I highly recommend it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNidHZDSUJREAE",
            "text": "Food and service were good but not great, I was disappointed w the atmosphere. For the price I expected more"
        }
    ],
    "reviews_count": 73
}