{
    "name": "Park Avenue Tavern",
    "place_id": "ChIJgbFrPwFZwokRiSXnTa5SUOs",
    "grid": "MN6",
    "address": "99 Park Ave, New York, NY 10016, USA",
    "rating": 4.4,
    "user_ratings_total": 2229,
    "phone_number": "(212) 867-4484",
    "reviews": [
        {
            "date": "4시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4ZmMwcDFNVUZpYlc1aWNVMUpSVzEzZFhFdGJWRRAB",
            "text": "I’ve been ordering take out from park Ave tavern for the past several months. I’m fortunate enough to work from home, although I do frequent Park Ave on my few days I do have to go into the office.  One day, to my surprise I had received my order from online and saw a smiley face on the IGC take delivery bag.  There was my order of Uncle Pats Comeback Roasted chicken, along side of an additional to go box with a special note written on it…it said “Laura, we appreciate you continuous business, please enjoy this special dessert as a thank you” it was signed from Paul\n\nThe next day I came in to say thank you, not only was i blown away from the hospitality and thoughtful gesture, it made my day.  I came in and said hello to my favorite staff members, Carlo included and thanked Paul as he made my day!  I don’t know of any online order from any company that would even notice that recognition nor write a personal handwritten note.   Keep doing what you do! I love park Ave tavern!"
        },
        {
            "date": "5시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxV1FsRXpVa1U0UWpONVJUWktUbkZEVlRWWWNXYxAB",
            "text": "Carlo was incredible! Best server ever. Loved the energy he brought to our evening - cant wait to come back again all thanks to Carlo :)"
        },
        {
            "date": "5시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WNFFVUkNRWGRpUVVGT2NIUlFXVFJWUkVsSllWRRAB",
            "text": "Carlo was amazing!!! Incredibly attentive, and went out of his way to make our dinner special. Would come back just to have him as our server again!"
        },
        {
            "date": "7시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbVFUTmFMV0pIYnpScE1rVTRXRUYyZEdScFVrRRAB",
            "text": "I've been to PAT several times over the past few year. First time was for my birthday a few years ago and they hosted a group of 20+ of us on the lower level. Since then I've had cocktails and dinner here several times and held my team holiday party here in 2024. The staff is always kind, attentive, and efficient! Want to shout out manager Scott and server Carlo for their hospitality at dinner this week - they made dinner a top notch experience keeping me comfortable and full! Highly recommend folks drop by when in the area or commute to the area! Atmosphere is intimate, great music and crowd! It's always a good time when visiting!"
        },
        {
            "date": "11시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oa1EzWkJhelpzWVZaVFVsY3dWRTVhY1VKUmQyYxAB",
            "text": "Very awesome food and service, I will come back again. Jairo is a great server, very nice and friendly person."
        },
        {
            "date": "13시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOV1ZXWXdMWFl5YTFSRVYzZG9hazQ0WlRGWWFGRRAB",
            "text": "What a fun place, and close to Grand Central! Greeted with a smile and our server, Joe was a 10 out of 10! He was attentive, humorous and when asked if we wanted coffee and I asked if they had hot chocolate, he said they didn’t but surprised me with his homemade hot chocolate, free of charge, saying he made it with ingredients they had in the kitchen. It was delicious! Our lunches were very good and I will definitely go back. Strongly recommend!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOT2VtTmhjVTB3VTJkR1QzVnVMVzEzZFhRNGNuYxAB",
            "text": "Thank you Carlo for a great dinner!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OWlUzaDVNblJuWVVSemFrdGxXR2x3VldGUVJuYxAB",
            "text": "Service was great! Waiter was friendly and extremely helpful. Food was serviced quickly without a long wait. Everything was delicious!  Our waiter recommended a desert that was great. He even took a group picture for us before we left."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213NVgxZE1VbXhxYkRkd00yZFZUbWhSUkVSRFkzYxAB",
            "text": "Jairo could not have been more amazing! Food was great but Jairo was even greater!\n\nThe Mgr (didn't get his name) was wonderful, too"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTlRYUlpia2d0ZHpKWmJVMUtZMVEyVkZWTFgzYxAB",
            "text": "Great lunch! Kid friendly and good food. Emmett was a great server. Thank you!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OcFQyWkpTamw2YjFWRVIxVkphRzl2TFhSMGJFRRAB",
            "text": "Great place.  Great cocktails.  The appetizer: Pull Apart Bread is absolutely delicious...hot, soft, reminds me of Southern bread  just Excellent.  Food great I ordered the Roasted Salmon.  Cocktails great.  Music great.  Environment great even if you just come by yourself you will feel VERY comfortable. Even Scott, the manager, came to my table to ask how was the service and of course I told him I loved this place.   I highly recommend this place if you are coming in a group OR just yourself they make you feel comfortable."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkaWRWcEVZakEzTldSVVdrWkpkREpIT0RZeWNuYxAB",
            "text": "Emmitt was such an amazing server and the experience was a 12/10. Will definitely be returning"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poTFpVZG1aMmhKYmpWaU9IcE9kVEp1WmxKNmEwRRAB",
            "text": "Emmitt was awesome"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWdVJIbGlUbVpXTlZCSllXeFVaV1JTZW01c09WRRAB",
            "text": "Loved the vibe! Emmit was great"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WeVdHeFFXVWQwTURWamNuWmxlRlpYYnpsbmNGRRAB",
            "text": "Emmitt was awesome"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214RWREWmxWblZ0TkdkalJtUk9kbGhqYTBzME9HYxAB",
            "text": "10/10. Starting our day with great food and drinks served by Emmitt who was the absolute best!! Would def come back, even if just for our server <3"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCaGF6UjNjWGhRUzA1V1MwVlhibHBLTkdOTFVIYxAB",
            "text": "Love Emmitt!!!!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFemF6WlBRMHMyZUV4VloycE9hMjlFVFRnMmNFRRAB",
            "text": "Emmitt was great!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oMmNEVTRRV3hETUVvMU1WQlVUVTFrWkRCSWJIYxAB",
            "text": "Emmett is the man!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201T1gwTlFUbXRJTjBKcFlYSnBjRU13YnpSbFFtYxAB",
            "text": "Emmitt was the besttttt"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGMVlreDJlVFZ2TTBwWFgxOW9VWEpPTW14UmNsRRAB",
            "text": "Emmitt was an amazing waiter!!!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zeFdsbHVjRGxyWTI1MFpEZGhjVXhITVZCUGQwRRAB",
            "text": "Emmitt was the BEST!!! So friendly and an overall great server! Will definitely be coming back!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsSlRVaDZZbFIxTm5WblVIZFhTbXAwWnpWblRYYxAB",
            "text": "Emmitt was an amazing server he was friendly and extremely attentive. Our whole party was a big fan of him he was perfect. Thank you Emmitt!!!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUGQyTmpYemxqV0dsYVZFOWxiMHRGVUhsRVVWRRAB",
            "text": "Emmitt was so lit and the best"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25scFFVTllObkIyU25aNGMwd3hXblJzTlUxcVJtYxAB",
            "text": "Our server Carlo was amazing. We had such a wonderful time at Park Avenue Tavern. Felt like 5 star for our whole meal."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0cWNUTmFjWGhKU2t4VmVHWlRZV2x5UkRKUkxWRRAB",
            "text": "Stopped in the Park Avenue while in NY for the weekend and I was astonished by the atmosphere! Very laid back and chill scene with great employees! I was helped by Jordan who was very friendly and accommodating to me and my friend. Scott the manager even check on us as well. Highly suggest you stop by and check them out!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tORU1UVkhVRk54U0ZoNVRYTTJRbnBOUWtoRFQwRRAB",
            "text": "Awesome service, great food, and really nice atmosphere. If you are lucky you will get Jordan as your bartender, he’s fantastic!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poMGVXODFMVlJVUlRWelpUaFRhRUUzUjNObkxXYxAB",
            "text": "Thanks for looking after us Carlo!"
        },
        {
            "date": "5일 전",
            "language": "la",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GcFdFVXdUbVJ0Ukd0VVJUTlNTREpyZVdkV2QxRRAB",
            "text": "Jairo is excellent…."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KcmVFVnVVWGx3Y1ZoRVZYQkZiSGM0V2xkNmRGRRAB",
            "text": "Carlos was the best Park Ave Tavern! Super attentive, friendly, and fun!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210UlFsaEhWbU5zVGxsT2FHTmhRMWwwYmxOV1gyYxAB",
            "text": "Went there with a reservation and had to wait a short time to be seated. Great food, cold drinks and a nice atmosphere. We enjoyed ourselves."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200d01scEVUSEp4YkVOelZ6TXdSWEUxUzB3M2FVRRAB",
            "text": "We had a wonderful experience at Pat’s!  Our server, Katie, was exceptional. Her cheerful, professional, and positive mood reflected the upbeat vibe of the Resturant. My husband and I come up once every three months from Baltimore to see a doctor. Before our appointment, we have made it a ritual to come to Pat’s first. It’s the perfect way to turn a hum drum doctor’s appointment, Into a fun afternoon date!! Thanks Again, Katie for making us feel at home In the big city!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFeVoyVlplRGgyUzFSVGJXTjFTa1pCTWtGU1JuYxAB",
            "text": "Katie was a great server!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVlJXUmZhVU41TTNoMU5rbFRXVVJKVW5abVVtYxAB",
            "text": "Emmitt was so attentive! Great time!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GdFIyVTNNV1o0ZG1oM1lWOUhaMmxDVjJ4cGNHYxAB",
            "text": "The food was excellent, loved the atmosphere & our server Jason was outstanding. Jason made our dinner extra pleasant. Thank you."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOc2FrRlhkbFJhUkhWVVVuVm5RbEV4VldSQllXYxAB",
            "text": "Carlos was so nice and the food was amazing!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wNU1IUnBjblJ2ZWxSbWFEUnhVREZQWVhkdk5XYxAB",
            "text": "It's almost unthinkable to find an old-style tavern on Park so I was pleasantly surprised. Nice ambience with friendly staff and okay food. Meet my uncle that I haven't seen in 10 years here. I ordered the special burger French onion dip burger? The burger actually tasted amazing but they did the one thing I hate the most OVER COOKED THE MEAT!! But the flavors were on point...super fresh side salad...If you need to grab lunch with your colleagues or family members this is a great little place."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4QlpESTBOWFZEVjNKdmEyNU5NRzlOV25KWGNIYxAB",
            "text": "Jordan is a great daytime bartender- delicious Margaritas!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pReldqYzRZMWRrU2xwUWNGRTRRVjg1YVZkaGVFRRAB",
            "text": "I very much enjoyed my visit and will definitely be back! The chicken sandwich and the prosciutto flatbread were both delicious! Our server, Lauren, was fantastic!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213NU5uUnNWSEU0ZGsxWGJrTTVSM0JrZUU1TlYwRRAB",
            "text": "Make sure to sit in Lauren’s section! And don’t forget to order the Steak Frites!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rdFIwTnFVVWxYY0hCcFFYbzNaa1ZXV2tVdFozYxAB",
            "text": "Amazing food, Lauren was so attentive and gave great recommendations! Will definitely be back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxUVQxQTJZVFpLWlZKUlNucE9hazVFY0RaNU9FRRAB",
            "text": "My service from Lauren was awesome and the prosciutto flatbread was amazing!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CZmIwSkdUakIyY2pOcloweGtjbmd6VTJkeE1WRRAB",
            "text": "A good casual place a couple blocks from our apartment. Crazy busy and noisy with locals and commuters during weekday happy hour. We prefer weekends and/or lunch. But dogs inside are a problem!! We don't want to be in a restaurant with dogs, especially don't want to be seated next to one. There are regulations against this for a reason. Makes us reconsider our favorite local places"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214Q1VtZFpkMjloWDNCcVNsaFVWMjE1TlVreVJIYxAB",
            "text": "We live in the neighbor and go often. We like the food, casual but good for when you want that. People who work there are attentive and courteous. But today at brunch a woman and dog were allowed in the restaurant. Clearly not a service dog.  A jittery little dog in a coat that needed to be held up at the table level and soothed at one point. NYC311 The Official Website of the City of New York says “Dogs are not allowed inside restaurants unless they are service animals. This rule helps prevent unsanitary conditions that can cause a food safety issue.\n\nRestaurants may allow dogs in outdoor areas. They are not required to do so.\n\nYou can bring a non-service dog into a restaurant only if you are sitting in an outdoor seating area.”\n\nWe may have to change our local casual dining spot. Dogs in restaurants are a hard no"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21acVIzUnFObGxYYkMwd1FXMURPRXQzYmtZMFRHYxAB",
            "text": "we come here often love it so much! Jordan is by far one of our favorites. Such attentive service and always makes sure our glasses never run dry. cheers."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWQ1QzQlBjVW80UWpKRWJEUmhWek0yVkhsb2FrRRAB",
            "text": "Great vibe and good food with friendly service."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCTE1IaGlVV0Z4VEZKMlJuUmFhVWhETVZSWmRYYxAB",
            "text": "I love Park Avenue Tavern !!! Jordan is the best. Great service and fantastic attitude 💕"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbGNGWXhjbUp4V0hFM1ZXWnNNRjlsYkhsNlRXYxAB",
            "text": "Jordan was amazing!! We had a great time and a great meal"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUldITlRkM2t6ZFRGdVoyMWZRM0Z1V25KdlRXYxAB",
            "text": "Omg this is the best place everrrrr <3 I’ll never forget the night we had here! We came in late after exploring as it was our first time in NYC and we wanted a couple drinks before we headed back to our hotel. We were divinely guided to Park Avenue Tavern to meet David, the best bartender we’ve ever had! The drinks were perfect and the conversations even better. He made us feel so welcome and really added to our experience of the city. Thanks so much David for being such a light!!! We WILL be back when we return to the city:)"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUWNrNDJVWFJYUldZNFpIa3hXbU50WkU0MGNVRRAB",
            "text": "Emmett was amazing! Great experience!"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkcDdPWUVnEAE",
            "text": "괜찮음"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NFkzRXRTWEZWVDJvMGQwUjNkRXcyU0d4TE9IYxAB",
            "text": "Im picky about my fries and like them more on the potato-y side. These fries were perfect and the cup is deeper than it looks in the photo. Burger was really good too! Maybe a touch much on the sauce/cheese, but other than that it was great. Service was also attentive and friendly!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21relNtTkxVbVpPZVU5cWRHUTBVRGt5WW1wMmNHYxAB",
            "text": "This is a lively place with a friendly neighborhood vibe. The service was great. I just had salad with salmon and it was really fantastic. Very fresh. Tried the homemade chips which were great. Maybe needed a little dip to heighten the flavor & justify the indulgence!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVMFgyNVlRbkZuTFdwSmNVSTFZVzB6ZHpaaE5WRRAB",
            "text": "Wow. Excellent food and service last night at 8om. The bartennder was super accommodating and kind. She came all the way around from the bar to take my order and check in me frequently. I left full and happy and tipoed here and the staff 30%. The food was hot and delicious. It's conveniently located near the Hampton Inn. I will come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200NFNrMXRNRVpaYUZkdU4ySnFOSE5RYVZkbWVuYxAB",
            "text": "Such great staff… A small mistake was made, easily fixed, and we were treated with a round. Made us feel right at home. Will be telling my friends about this place and coming back— FOR SURE. Chicken sandwich was so good I couldn’t even get a photo of it! Great drinks."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWa1l5MXdhM1V5U214alJqTnVNalpxWnpCbmVGRRAB",
            "text": "Food was okay but my soup was served almost cold.\nFurthermore due to the ventilators it is way too cold inside and even colder than outside. Due to the temperature drop in NY for fall impressive, that this is even possible."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oU1FtZHVkMUpKZUdabVgyRXhXVzE0TjNOdFZtYxAB",
            "text": "Great service, good food, nice atmosphere. We popped in on our way to New Jersey for a concert (and got out of the rain while we were at it). There was no wait when we entered, the mood was low-key and it was easy to talk.\n\nWould recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ19pSmVFcEpheFVBEAE",
            "text": "Carlo was an incredible server! And we loved everything, every time we come to the city this is our first place to visit! We loved PAT and we were part of the team. It will always be a pleasure to return to this place"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNGJVdFlUREJrTUVWalUxbElkM2REUzI1eFduYxAB",
            "text": "Surprising place, I'm camping close by and got in late. Decided to grab a salad here. I added grilled shrimp to this large salad and it was excellent!  Very simple but fresh, the lettuce was crunchy and varied.  Shrimp were excellent and dressing homemade.  They even had their own root beer.  The place was mobbed so I ate at the bar, bartender was awesome."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OWmFrTXdPVXgyY2twMlpXaFFUbFZ0ZWxGUWNGRRAB",
            "text": "Me and my friends came to just get dinner last minute and Nicole was lovely, giving us a warm welcome and seated us at a nice table where my whole party felt comfortable. My party and I weren’t planning on drinking but Jason recommended great choices from their selections of drinks. And the drinks were phenomenal. Definitely worth a try. At least try one.  Jason is a great server who knows his stuff and has great recommendations. Made us feel like we didn’t want to leave."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1aGRsSlhTRzVCZG01dWQwVlRkVVV6VmpoSFMzYxAB",
            "text": "I went to Park Tavern for dinner, and overall, it was a solid experience, but nothing spectacular.\n\nThe cocktail menu was decent, but nothing really stood out. The food menu was similar: fine, but not exciting. It’s mostly the usual suspects, burgers, salads, flatbreads, and while everything was prepared well, there wasn’t anything especially creative or unique.\n\nThe one exception? The Mahi Mahi tacos, which were on the specials menu. Those were amazing, a definite 10/10. Honestly, it was the only item that really excited me, and probably the only thing I’d go back for.\n\nThe prices felt a bit on the high side for what was offered, and I was disappointed that they don’t have a happy hour. That definitely would’ve improved the overall value.\n\nWhat really saved the experience for me was the service. Our waiter was fantastic, super friendly, attentive, and gave great recommendations. They genuinely helped make the evening enjoyable, and I really appreciated that.\n\nIn the end, it was a good place, just not memorable enough for me to rush back. I’m giving it a 4 because it was solid, but not a stand out."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOTDloTENkMTdEcGtnRRAB",
            "text": "A bit biased but being a neighborhood staple for our family, my grandparents enjoy walking us a couple blocks up to Park Ave Tavern.\n\nFabulous food with unbeatable service. The staff there is so kind.\n\nFood wise you cannot beat the grilled cheese with tomato soup!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paMVJIcG1OR2xTYzNacmFqWlJNbHBHTTFOWFdXYxAB",
            "text": "We didn’t have a reservation, but as return guests had no trouble getting a great booth right away during a crowded Saturday afternoon. We all enjoyed our meals, and this is a great spot before heading to a show. We dine here each time we have theatre tickets and will be back again no doubt."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMNi13WXJsbW96c0lnEAE",
            "text": "Our family had a perfect dinner here while visiting New York. The staff are welcoming and attentive and our waiter, Carlo, was the best!  Drinks, food, dessert…all tasty and delightful. We came to this restaurant on a whim and were just blown away by how great it was. Quite a memorable time."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKbWo2YnU3bGRTMWV3EAE",
            "text": "I fly back to Florida tomorrow but after having the burger of the month I’m changing my flight to June! It was the best burger I’ve ever had and if I had to give one of my children away as payment I would. The explosion of flavors in each bite was amazing. Great job to whoever thought up this masterpiece. Next time I’m in New York I’ll be stopping in to see if it’s on the menu."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJcmhqNlcxcE1PQlpBEAE",
            "text": "The service at this restaurant is amazing and very welcoming. Everyone was really nice and polite. The spinach artichoke dip was delicious and good drinks. I recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJMjBvS09weC1qa3V3RRAB",
            "text": "Had the BEST time celebrating my friend Emma’s birthday at Park Avenue Tavern! Emmitt was the epitome of a golden retriever! Very sweet and accommodating. Highly recommend visiting."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OUGNFOUVkMDFxUm5GNU1tbENRbUY1ZUdNMGRFRRAB",
            "text": "Un lugar totalmente distendido! Es casi media noche y hay mucha gente. La atención es muy buena, el bartender se esforzó para poder servirme lo que yo quería. Recomiendo este lugar"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbjQ2UTVnRRAB",
            "text": "Had a very good brunch on our last day in the city. My partner had chicken and waffles and said they were the best he has ever had. I had the soup/sandwich combo and the soup was very good but I wasn't a big fan of brioche for a grilled cheese. More of a sourdough girl. No fault of the restaurant, just my preference. Service was excellent and the bloody Mary was also excellent. Would recommend!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGVWN6SkVSekF0UW1kV1YzUnJibDlVZWpremJIYxAB",
            "text": "I've been popping into Park Avenue Tavern over the past few weeks after work meetings in the area, and I have to say this place is truly better than it has any right to be.\n\nThe entire staff and especially the manager, Veronika are warm, welcoming and make the restaurant feel like a neighborhood joint, even though it's on Park Ave, a few blocks from Grand Central. Veronika took time during an after work rush to show me their lower level when I mentioned I wanted to have a private party there.\n\nI've visited a lot of venues and met with a lot of restaurant managers as I coordinate events as part of my job, and I found her to be very professional and honest - she convinced me to order their fries, which were really top notch. Actually, I love all their food to be honest and with winter approaching, it's a great menu with a very warm vibe."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BM1ZXazVTMHN5UmtONmRTMXZiSE5HZGpONlozYxAB",
            "text": "This place is amazing! Visting here from Michigan, and the experience was the best I’ve had in a long time. Food was also amazing and they had great beer choices. Would recommend to any travelers or locals. Ask for Carlo, he will give you the best experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25neGRFTXplQzE2VHpGWE5qVkVTVEZVZGxseU1GRRAB",
            "text": "I’ve had brunch, lunch and dinner here. Love the food. Steak Frites are one of my favorites. There’s also a relaxed and enjoyable atmosphere.  The manager, Ilayjah, always makes sure we are well taken care of.  Better hold on to her. She’s a keeper."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKdVQ3UDIyaE8tNjBnRRAB",
            "text": "I am a regular. Food is great, service is great and servers are polite and friendly. Carlo treats me as a friend every time I come in. Burger of the month special is always a fun surprise and the fries are amazing and hot"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcnRiY2R3EAE",
            "text": "My girlfriend introduced me to this place and it's great. I've had almost the whole menu and everything is great. The bartender Adva makes amazing drinks and delivers perfect service. Before meeting her I never liked margaritas and now it is my to go drink. Adva makes the best drinks and is very kind!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFNVRXTnhjSEZIZVVOb01sWjFNRmRvVmxVdE9GRRAB",
            "text": "I love coming to PAT.  I've been coming for years and it is always consistently good.  The bartenders make great drinks.  The servers are all wonderful too!  Today's server was Jairo and he was excellent.   But the server who has waited on me most is Joe.  And he is an excellent waiter and a really good person.  I always look forward to seeing Joe!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVNVZFVXhTVzgwZUZWd1FrUnNlRmxvU25OUVNFRRAB",
            "text": "Our server Carlo was a phenomenal, the food was great, the atmosphere was wonderful.\nI had the fish and chips. The fish was absolute perfection. The fries were a tiny bit bland, but perfectly cooked; one little shake of salt and they were delicious!\nWill come back anytime we’re in the city for sure.\nSeriously, Carlo was an absolute delight. The staff here is amazing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214U1JVTmZVRzF6Y1ZoMGFtVnBWMWRVVW1sU1JsRRAB",
            "text": "I had an absolutely wonderful visit to Park Avenue Tavern thanks to a warm greeting at the door by Lola, phenomenal service at the bar by Adva, Katie, & Raul and the most exceptionally kind service by Carlo & Alex! I also appreciated Quincy the doorman’s eagerness to help - he helped me catch a cab on my way out!! Five stars for a five star team."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsbE1FTjBUMFJaV0hsR1owWXhRa3hDVEUxaGNsRRAB",
            "text": "Park Ave Tavern is in a convenient spot for anyone working in Midtown. it’s an easy place to stop by after work. The food and drinks were just okay, nothing particularly memorable. The service, however, could definitely be improved. Overall, it works as a casual after-work option because of the location, but don’t expect anything exceptional."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMmR6SXdhR2x6YjNkNU5XaEZORzFTU1haS1QzYxAB",
            "text": "We had a great experience with Carlo! He was extremely attentive and SUCH a fun guy. We loved our evening with him - he made it extra fun!! The only issue was the temperature in the restaurant - it was pretty warm for a hot summer day. Thanks again to Carlo!! He is phenomenal!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aSFlrOXNhVnBsWkZOS2VXUmlkelo0VUhkMWVIYxAB",
            "text": "Came back to Park Avenue Tavern with friends from work and had a BLAST. Emmitt, our server, was such a gem. What a great host. The Tuna Poke bowl was INCREDIBLE! Definitely a place you need to check out!"
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3MklIZ1pREAE",
            "text": "Splendido locale dove puoi trovare diverse cose: pranzo, cena, brunch e chi più ne ha piu ne metta. Io ho preso una fantastica Guinness ma abbiamo provato diverse cose. Personale molto cordiale e disponibile. Siamo stati accolti bene dalla host che ci ha subito trovato un tavolo. Spesa nella media della zona e della città."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KMWVuTktPSFpJYjBOWFFWSXdZMUJ5ZW5GWU5sRRAB",
            "text": "Great spot. Perfect American style menu, nice outdoor seating. Service is usually good, but one Thursday lunch hour was pretty slow. Place is always packed and for good reason."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNZnBzZHFMb09hSWhRRRAB",
            "text": "Chorizo burger was amazing!! I can’t believe it’s only for a limited time? Make it permanent!! Waitress SiuLen was fantastic."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201bVRERm9jemxvTkRGT1NsTlFNR0V3VGxsalZtYxAB",
            "text": "The restaurant is cozy and cozy comfortable. I got the Caeser Salad with chicken and the truffle tots. It was delicious. The drinks were very tasty and we really enjoyed our time there."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNeVZsQkpiakJYU0habVNWOU1lVUpTYUZScGJsRRAB",
            "text": "I’ve been here several times and if I could give this restaurant a 10 star review I would. This  time we came for my friend’s birthday. Lobster Benedict was off the charts. The manager Paul was super accommodating and sent over a cookie dessert in a skillet. Everyone raved about the service and food. Will definitely be back and recommending to friends."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTVVqWTNXbmM1YVZSWFdHWTNiV1l6TkZoWk4zYxAB",
            "text": "Omg! This place is amazing.  We walked by after searching these amazing google reviews and have the pleasure of meeting some of the staff as they were outside setting up this morning for brunch.  Paul, Katie and Lauren welcomed us with open arms as we just landed from London and jet lagged.   They invited us in to watch the futbol match while they were still setting the dining room before the operation was even open.  Such amazing hospitality. We will be in New York all week and will be here every day!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1ck1uVkRkWHBSVDNablMyOUthV2x0TjJJM01tYxAB",
            "text": "My family and I came in for lunch, and were taken care of by Emmitt for our meal. To say his service was great would be an understatement. The food was great, but the service was better—we will be returning just for that! Stellar environment all around, everyone there is so kind- shoutout to Nico! Thank you PAT and especially staff for making our meal so lovely!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKT3kwTDd1LTh2MjV3RRAB",
            "text": "An Unforgettable Client Dinner at Park Avenue Tavern!\nPark Avenue Tavern provided an absolutely world-class experience for my important client dinner. Zach, the manager, greeted us personally, ensuring a top-tier welcome. Carlos was incredibly attentive, like a personal assistant anticipating our every need. And Blaise at reception made sure the overall seating and experience were seamless. The fantastic team made this an exceptional evening. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREX09HR0hREAE",
            "text": "Food is really good! I love the diverse menu. Everyone enjoyed their meal. Service was really nice and quick! They had extra seating in the basement, which was really cozy!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKLVlqLXY5emZEMElBEAE",
            "text": "I’d like to share how wonderful my experience was thanks to Joe, the waiter at Park Avenue Tavern:\n\nFrom the moment he greeted me, Joe’s warm smile and genuine friendliness made me feel at home. He knew the menu inside out and recommended dishes perfectly suited to my taste. Throughout the evening, he kept my glass full, answered every question with patience, and added a touch of humor that made the meal even more enjoyable.\n\nWhat really stood out was when he surprised me with a small gift from the chef to celebrate my special occasion—without me even mentioning it. Joe’s talent, kindness, and attentiveness turned a simple dinner into a memorable event. I can’t wait to return and be seated at his table again.  Thank you Joe; you are one of a kind. Sandra H."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wcE1tcE1VRXB3YmpJelpFZHFWRVJYUm1odFQwRRAB",
            "text": "Paul was amazing, he went out of his way to make sure our night was special. Great service and awesome food. Also Kudos to Carlos and Blaze. This was our favorite restaurant and meal during our stay in New York. Thank you Paul and team!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGTlNrMDNORUp1ZGpJNGFtdFhjbFpGTVVWMmFXYxAB",
            "text": "Food was good. Some of the orders were late but they made up for it by removing it from the bill. Their manager Tim was also kind enough to give us free desserts after another issue w our order and made sure to look out for our late orders so shout out to him. Overall would go back!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJdjE0WXowMmEyaG5RRRAB",
            "text": "Sat at the bar for lunch.  Rarely can you go wrong with a Caesar salad; I decided to add the hangar steak and it was great.  Service was wonderful.  Conner the bartender was an absolute pleasure.  Just so warm and inviting checking in just enough, and just really good conversationalist.  The food came out at a decent time; enough for me to know time and effort was taken with the plates.  Also ordered the mac and cheese as a side, best decision! Food, staff and drinks were fabulous!!"
        }
    ],
    "reviews_count": 93
}