{
    "name": "Sam's Place",
    "place_id": "ChIJ1XtiVAFZwokRhRSA2bnhJs8",
    "grid": "MN6",
    "address": "132 E 39th St, New York, NY 10016, USA",
    "rating": 4.6,
    "user_ratings_total": 443,
    "phone_number": "(212) 599-6360",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwNlRuaEVNVmxzV21KUGRuTmpiV0ZJY1dkUGNXYxAB",
            "text": "What a gem. I haven't had a bad meal here in ten years. The food is just always exceptional.  The service is 5 star."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2OEpMWUJnEAE",
            "text": "A small Italian restaurant with a very cozy feel. Although the attitude of the service staff was not good or bad, the food tasted pretty good."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCbmJsUnJTR3BoYTA1VGFFeHJTM2s1VTBweVowRRAB",
            "text": "Been coming to NYC for 15 years from NC. Fell in love with Sam’s Place on our first visit. Excellent food, love the local venue. Highly recommend!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1MGN6QktSMnRmVm1FNFpHaGtOMGxNVVhScmRFRRAB",
            "text": "Great service and great food!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSNFNGUllaa1pRWW5WSlRXbGlUMUJYWlcxRExWRRAB",
            "text": "A must stop every time we visit the city. The best!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5eldreDBkM0JvWnpWa1MySkxUREJ6ZGtkcVFXYxAB",
            "text": "Fantastic authentic neighborhood spot.  A must visit for excellent food if you are in New York.  Owner operated and years of consistent great consistent food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3d2JHcFdlSFpWWWpKNlJVaE5SbFpSU0c1TU5sRRAB",
            "text": "My wife and I have been going to Sam’s place for the better part of 30 years.\nMassimo and his staff are beyond reproach - great food, great service and atmosphere - it’s a neighborhood gem!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNVZsRnlOa2hYYms4NGNVSlpMWFptTjNoUlluYxAB",
            "text": "We passed by in a cab on the way to our hotel...made a reservation and walked down ...had two fabulous veal entrees and a super Tuscan ...food and service were excellent...The in-house made Tiramasu was heavenly"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GUlNteHNhMXBKT0dRelduRjZlamd0U2xSbFpuYxAB",
            "text": "Found it on Maps and came in since it had some good reviews. Was met with smiles from the waitstaff and I even got to meet the owner! This restaurant truly has a family feel to it.\n\nMoving on to the food: I didn’t know what to get so I asked the owner for some suggestions. He suggested some chicken under mozzarella with a lemon sauce (or something like that). The special came out huge and piping hot. I was so excited to dig in I burned my tongue on the food multiple times 😂. This place has some of the best Italian food I have ever had. I would highly suggest stopping by and trying their food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxMFRUQXphVzh0UTBwS04wcHFPRTQ0VUhOMldHYxAB",
            "text": "The most outstanding part of our experience at Sam’s Place was the very warm welcome and attentive service. The food was decent, especially so for their salad and lemon cake. Would not mind coming back for their lemon cake alone."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGM2IxRXhjbFZ0ZWpKYVQxRkhSVFZxY25kUFNIYxAB",
            "text": "Finding Sam’s was like finding a lost gem.  From the moment you walk in to the service, you immediately are taken back in time. The owner, Massimo, his staff, the ambiance, the quality of the food, and the overall experience is like a lost art. It has become my favorite restaurant and every experience has been nothing more than perfection.\n\nStephen Grisanti"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzd1NXeHdjMGxyT1hsUFdHUXpSMWRHYjJaU1NWRRAB",
            "text": "I went there this evening with a friend that had been there before. The food was very good. The minute you walk in, the owner greets you and shakes your hand and is very welcoming. The service was also very good. Nice small and quaint restaurant with a nice atmosphere."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twbE5tUmhVa05hTlhnM1Z6UmFRbU5wWkdadmExRRAB",
            "text": "Amazing pasta"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xRVZGSkNabFJZUWxGa1pYZFdkamx2UTBOSlIwRRAB",
            "text": "A true old school Italian restaurant."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVFJ6RkpSRVZ0WVZkbFJHZFhaVTV0YlMwd1MxRRAB",
            "text": "Always good service and good people"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psS1FqRk5UbWwyYTNkb2VVOTROVVJqU0dKR1VYYxAB",
            "text": "Fast service, cool workers"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KNFF6TjVZMVJaYlZKeVJGQkRibVZLVUMxRVYzYxAB",
            "text": "Great food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5aE9HdDVTMWhrWm5oT1VWOTNjbDlsWDA5QldWRRAB",
            "text": "I visit frequently! Some of the best Italian food I've had (and I lived on Mott St. and frequented Little Italy often).\n\nMax is the best host/owner ever!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJaXFXXzJnRRAB",
            "text": "Best kept secret I'm mid town"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUGJ6bHBRUzFUVmxKSE9YSkdUMkZHT1d0S1VYYxAB",
            "text": "Always an amazing meal and great staff. The chicken martini is a must !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKV1Q1ZUdaMVliVER3EAE",
            "text": "kind and friendly staff and a very cozy environment. 10/10"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLYjgxSWUzMXIzdnh3RRAB",
            "text": "Always the best!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOZkV4TXFtcnY3MmZBEAE",
            "text": "An Absolute Gem – Always a Delight!\n\nThis restaurant has quickly become one of my favorite spots, and for good reason. From the moment you walk in, you’re greeted with a warm, welcoming atmosphere and attentive service that makes you feel right at home.\n\nThe food is consistently outstanding – fresh, flavorful, and clearly made with care. Whether I’m trying something new or sticking to one of my go-to dishes, I’m never disappointed. The balsamic chicken is a must-try – it’s absolutely delicious and always perfectly prepared.\n\nThe staff goes above and beyond, and you can tell they truly care about creating a great experience for every guest. It’s the kind of place where quality and hospitality go hand in hand.\n\nIf you’re looking for a spot where you can count on excellent food, friendly service, and a relaxing vibe, this is it. Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLX05fb1Q0dnJ1dEdREAE",
            "text": "Our favorite place.  Amazing food and service!!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOcWc2UHFucmNpdDJ3RRAB",
            "text": "Excellent food! Staffs and Owner are very nice! Strongly recommended. Many returning customers"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnb1pfRl9RRRAB",
            "text": "Outstanding service my server Enrique was very attentive such a great experience. food was impeccable I ordered a chicken Marsala so delicious. Very cozy, waiters were all magnificent. I will deff be going for future events. If you are in Manhattan SAMs place is the way to go!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJTG9tOWp0NmFZVhAB",
            "text": "Love Sam’s. Everthing is delicious."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLVHg4LV9abXFlOHN3RRAB",
            "text": "Always special every time I go there."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPR29tcTZTcDl2VXhnRRAB",
            "text": "Great food and service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOT1kyb0t4MHJDcjRRRRAB",
            "text": "Authentic, genuine and amazing menu. Always. Great service and an enjoyable time. Consistently great!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJUGc1N09fMlBhTE5BEAE",
            "text": "I have eaten here many times the food is one tofu and absolutely delicious. The servers make you feel at home and treat you with exceptional service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPZVZ1WW10d2Q2eWZBEAE",
            "text": "Great experience. Loved the personal attention of Massimo. Awesome restaurant!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJck4yRWxBRRAB",
            "text": "Me and my dinner companion ate here on a Saturday evening. We found Sam's place by chance, or serendipity. Our taxi driver took us from LGA to our hotel on Broadway and was driving along E 39th. I spotted a well-dressed gentleman sitting at the one table outside, saw that it was an Italian restaurant, and I knew we had to eat there. If the owner hadn't been outside, I might not have noticed.\n\nWe shared the Portobello mushroom salad, Veal Scallopini, Veal Forestiere, Lemon Sorbet, and Ricotta Cheesecake. Everything was amazing, especially the warm Portobello and the tender veal. I can easily say it's my best meal of 2025.\n\nThe wait staff were so very attentive. I was impressed that the  owner was present and i noticed that he personally went to every table to make sure the diners were satisfied. And I must comment that I could actually carry on a conversation with my table mate and hear her. The acoustics and noise level were such that you could converse and not have to fight against music or excessive noise levels.\n\nIf you find yourself in NYC, and you're wanting to experience quality service, atmosphere, and food, I highly recommend Sam's Place. Now that I'm back home after a too-short weekend in NYC, I am going to try to find a similar restaurant where I live. Restaurants should aspire to have an establishment like Sam's Place."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcDlILXNBRRAB",
            "text": "Stopped in to have a cappuccino and a cannoli AMAZING 🤩.\n\nGreat atmosphere and the service. Forgetaboutit!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMDZ5NEh3EAE",
            "text": "Food was good but service was bad.  Very pushy and the waiter didn't listen to anything I said."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnb2FHODd3RRAB",
            "text": "This is an excellent restaurant. The steak was cooked to perfection with great tasting side dishes. The wait staff was attentive and polite."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMDl2RER3EAE",
            "text": "This is an adorable quaint authentic Italian restaurant. Had the homemade pasta and it did not disappoint. 10 stars for the lemon sorbet in a real lemon."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfd3E3RlVREAE",
            "text": "Everything  was so delicious,  good service, nice place."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQd2JmNVpBEAE",
            "text": "Excelente atención, su dueño muy atento!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaU11dlVBEAE",
            "text": "I have visited Sam’s Place twice now, and am creating a tradition of eating here with colleagues for our annual holiday celebration. I’m not sure exactly the appeal, but I love it. I think a lot has to do with the vibe. Each time I’ve visited, I’ve seen the owner (or who I presume to be the owner) sit down with solo diners - who I assume are regulars - and chat to them like old friends. It’s a restaurant that, from the outside, most would probably walk on by. But I think by stepping inside, I discovered something special."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcHA3ZlB3EAE",
            "text": "Very welcoming! Great food and service! We went back!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURIeTVzORAB",
            "text": "This place is NOT up to the reviews\nOrdered the tortellini ala panda. Was so bland and watery.   I have made better at home.  My wife's prefers the baked clams - they were old and tasteless. Full of breadcrumbs.  Yeah this is a cute little honey place, but the food, sorry not sorry, it sucks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIaW9xVzNRRRAB",
            "text": "Old school Italian spot on 39th and Lex . Very cool vibes . We got the App Special which was a tasty grilled Calamari that they split onto 2 plates for us . My main was also the pasta Special of Gnocchi in vodka sauce and was really good and also such a nice portion that I ended up taking some home.  My friend got the bone in Veal Chop and he liked that a lot . Now they don't have a Cocktail menu but you can order any drink you like and they'll make it. I got a Margarita and it was perfect.  Get some Tiramisu too. It was delicious.  Bathroom is upstairs.  Staff is friendly and professional.  Stop by if you're near Grand Central."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIanI2amFBEAE",
            "text": "What a great genuine Italian restaurant, I had a nice Cesar salad to start with and a linguine bolognese cooked perfectly. The waiters were very nice and attentive. All in all a great place to enjoy real Italian food in this great city"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURieXE3a3d3RRAB",
            "text": "Un lugar muy hogareño. Muy atentos los meseros."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRMmJiZ1dREAE",
            "text": "One of the best dining times ever had in NYC. Massimo was a special person and owner. The food was fabulous and reasonable. Will always return when in NYC. Enjoy your vacation."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMbk5IenJBRRAB",
            "text": "Excellent restaurant italien. Cuisine delicieuse. Plats italiens, personnel italien et ambiance italienne. Rien à redire. On recommande !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOUlXeUlREAE",
            "text": "A must when in NYC. Mr. Sam welcomes you at the door and unleashes his team of  professional and delightful staff. WOA! They have a great italian menu in a quint venue but also offer the option of creating your own dish. This is home!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUdnRXS25nRRAB",
            "text": "I've quickly become a fan of Sam and his place. Old-school Italian-American I'm unpretentious digs, but very close to Grand Central Terminal, and so, very convenient, too!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCLVlLNl93RRAB",
            "text": "Literally my favorite restaurant because:  they absolutely know their patrons / a warmer welcome you won’t find and that is backed up with superb food.  What more can you ask for??"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTdmZqMkJ3EAE",
            "text": "Wow! So happy to start my New Year dining experience at such a great establishment. All around a fantastic experience.\n\nI made a reservation on Google Assistant and they prepared a four seat table for us. The seating was comfortable. The napkin art was a nice touch. We couldn’t be under the tent but they moved two heaters near our table to accommodate so we weren’t cold. They treated us very nicely.\n\nThe bread for the table was fresh and crunchy. We started with the calamari which had a fantastic sauce - more on the sauces later. I ordered the special clam stuffed with crab meat and shrimp. It was the large size because the small comes with two. It was toasted to perfection on top and I could see the real lumps of shrimp and crab! The clams sat on top of a LOVELY lemon sauce that put the dish on top. All of the people at the table live together and tried each other’s dishes. The mussels were tender. The risotto wasn’t overpowered with too much pesto. And the chicken portobello sauce was tangy and rich. Every plate was delicious and you wouldn’t go wrong getting any of these. We also drank some nice wines and finished with the ricotta cheesecake and cappuccinos.\n\nI can’t wait to visit again for the cute indoor dining one day."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlNW9LaFBnEAE",
            "text": "Cozy, friendly, a place that feels like and tastes like family. Very quick and attentive service, immediately made me feel like home. The food was tasty and comforting - fantastic calamari. My only “complaint” was that the food felt a bit too much on the salty side for my taste - but it didn’t take away from the flavor at all. Makes for great leftovers too!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcDhYc1ZREAE",
            "text": "This place is in the residential block that you would not expect the restaurant be here. Yet it seems it has been here for ages. The space and the food feels traditional. The dishes we had is great. Bronzino is cooked perfectly. Cozy! Quiet! Pleasant!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCa3BQcjZBRRAB",
            "text": "This place is so cozy and lovely. Looks so much more beautiful on the inside than what it seems. It is pretty expensive for what it is, but a lovely option for an Italian date night. Been here a few times and seem to always gravitate to the chicken parm because it’s so good! We got a lovely house pinot grigio too. Can’t wait for my next time back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdjdEbTVBRRAB",
            "text": "A joy!  Just across the road from our hotel, but sadly, slightly obscured by scaffolding!\nWe received a warm welcome on arrival and were shown to a table in the corner, very cosy.\nThe staff were very friendly.\nWe ordered a bottle of Chianti, excellent, and were given bread and butter to enjoy while we awaited our starters. Soup and Portobello mushrooms on seasonal greens.\nOur mains were Veal Marsala and Veal Forestiere, which came with fresh vegetables. Both dishes were delicious.\nDesserts were Lemon cake and Canoli, which we accompanied with Limoncello!\nAn excellent evening in a charming Italian, much can be recommended and we hope to return next time we're in NYC!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwb3AtdWhRRRAB",
            "text": "A great neighborhood, traditional Italian restaurant. The food is delicious. The calamari in red sauce was delicious, perfectly cooked, seasoned and complex. I had the veal marsala with linguini which I also thought was perfect. The meat was tenderized, subtly coated and bursting with that delicious marsala sauce. The portions are large so definitely expect to take leftovers home. Their homemade, traditional cheesecake was the perfect way to finish the night."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSc0w3YWRBEAE",
            "text": "Absolute gem of a restaurant in midtown Manhattan. Atmosphere was comfortable and fun loving. The food specials and menu choices were top notch. The staff awareness and attention was the best I've experienced in NYC. Hands down. An absolute gem!"
        },
        {
            "date": "7년 전",
            "language": "fr",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnN1lDWUlnEAE",
            "text": "Ambiance intime pour ce petit restaurant italien de Manhattan. Le maître des lieux surveille l'évolution des tables dans un coin et vient saluer chaleureusement ses clients. La nourriture est bonne et copieuse. Bon rapport qualité prix. Je recommande le veau à la forestière... un régal."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCLS1PX1d3EAE",
            "text": "Uno de mis lugares favoritos en mi visita a New York. Excelente comida, excelente atención, una bienvenida al lugar inimaginable por parte del dueño. Lugar pequeño pero Super acogedor. Excelentes personas que me atendieron y me hicieron sentir realmente bienvenida. Lo recomiendo!!!  y volveré en mi próxima visita a Nueva York."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlOWFhd0lREAE",
            "text": "Needed a quiet meal by myself on a business trip. I found this super cosy Italian restaurant. It was a lovely spot to enjoy some great homely pasta, I had penne bolognese, and Italian wine. The service was good and it was a nice homely atmosphere."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMteTVhaUd3EAE",
            "text": "Absolutely the best Italian food we've ever had.\nThe owner and staff were spectacular!\nWe had mussels, veal marsala, shrimp alfredo and had to try the marinara.\nAtmosphere was impeccably cozy and warm."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURScTdiMnlRRRAB",
            "text": "We actually walked pass by this restaurant. Checked google review, pretty good scores so came in. They didn't disappoint us! Great food, fantastic services and the best Espresso Martini we have ever had. What a nice surprise!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBNGVDUjJnRRAB",
            "text": "A very nice place with good food, it is what you would call cosy, the staff are very nice. You should bring a stroller if you're coming with an infant. They do like their cheese:)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxd2RQdmlRRRAB",
            "text": "An unbelievable hidden gem in Murray Hill! Excellent food and superb attentive service! Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxbzdmSHNnRRAB",
            "text": "A cozy gem!  We were lucky to get a last minute table due to bad weather.  We were greeted warmly by the owner, and our waiter was kind enough to make a special plate when one of us couldn’t decide on what to get.  Everyone enjoyed their delicious meals.  I was hoping to show off NY red sauce Italian to out of state guests, and this place did the trick.   Cannot recommend it enough!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5dnV5ek5BEAE",
            "text": "Sam’s Place is a hidden gem, being going there for over 25 years. You are made to feel like family. The food is excellent, you will not be disappointed. Had the lemon chicken with vegetables, along with mushroom salad. If you are looking for a good meal @ reasonable prices Sam’s is the place!"
        },
        {
            "date": "6년 전",
            "language": "nl",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwOFliT19nRRAB",
            "text": "Helaas is dit niet wat ik had verwacht. Zelf kom ik al 42 jaar in Italië en het lijkt totaal niet op de Italiaanse keuken. Ik had tong ( sole ) besteld maar kreeg ik iets van witvis, zeker geen tong. Alles is aangepast aan de Amerikaanse cultuur. Het is niet het pure eten dat ik ben gewend in Italië."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2ODV6WnZnRRAB",
            "text": "Loved the food and the place! The owner is one of the most respectful guys I have met!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzMUpmbnV3RRAB",
            "text": "Cozy little establishment serving an authentic NY dining experience. Food was delicious and perfectly cooked."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREbnVmN2RBEAE",
            "text": "We had my mom's 96th birthday celebration for 14 people (upstairs.) The ambience is perfect (warm and homey) , the food is sumptuous (old style NY Italian at its best, esp love the baked clams), and Sam is the consummate host. People attended from all over the country. This was a well-healed , well traveled, up scale group. Long story short , everyone LOVED it. Huge success, the place is a gem. Value is also off the charts, especially for NYC. Getting hungry writing about it. Thanks Sam!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtMmI2MDB3RRAB",
            "text": "This was one of the best Italian meals our family has ever had! I had the Veal Marsala, my wife had one of the specials, Chicken, artichokes, capers, in a white wine, lemon butter sauce. The kids had Pesto Shrimp Risotto and Beef Raviolis marinara. All very different and each one perfectly cooked with outstanding flavor. The service was great. The bread, breadsticks with butter and olive oil was brought to the table promptly. Sam's Place is a smaller restaurant with great character. I strongly recommend giving Sam's Place a try."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqbC1DbWZBEAE",
            "text": "If you’re looking for authenticity, Sam’s place checks all the boxes. Came for a work lunch; were spoiled to have Sam himself spend time with our table. The genuine hospitality shown by all staff encountered was impeccable, food was absolutely delectable, will definitely return!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtajhyb1FREAE",
            "text": "This place is a gem. The food is delicious, extremely fresh and served in large portions. Everything is of the highest quality from the meats and fish to the homemade pasta and sauces. Additionally the service is immaculate with attentive…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoakpYbDhRRRAB",
            "text": "Just ate a great lunch special that was hot and delicious.\n\nThe owner said it was  the first dish he made for his wife 30+ years ago.\n\nWhite wine, lemon, garlic, chicken...I had it with the vegetables instead of pasta. The vegetables were fresh and delicious, green beans and carrots.\n\nThe service was wonderful. You are paying city prices but so worth it, delicious."
        }
    ],
    "reviews_count": 74
}