{
    "name": "Petite Boucherie",
    "place_id": "ChIJye1nGZRZwokRpt8fmbCxNLE",
    "grid": "MN2",
    "address": "First Floor, 14 Christopher St, New York, NY 10014, USA",
    "rating": 4.7,
    "user_ratings_total": 1943,
    "phone_number": "(646) 756-4145",
    "reviews": [
        {
            "date": "8시간 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twclozYzVXVGhMVm5SSmJHNDBjRE51V1dJeE5rRRAB",
            "text": "My date was wonderful but the sandwich was sadly bone dry and the beef was very tough and chewy.\nOnly a few tables.\nBeautiful restaurant with wonderfully high ceilings but I would not return."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paNlRuWkZaRFp5YUZsUVZVUllXV3R0Y1U5Q1gyYxAB",
            "text": "The food was good and the ambiance of the restraint was delightful. Staff is super kind as well. Agnes took such great care of us!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZelNXdHVjMVZSVjNOR01WaHZkV1p5TVRoQ2NHYxAB",
            "text": "No options for vegetarian folks and food is sub standard. Do not recommend at all"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCMk1tOUtZMVpZVm5GcFlUZGxkMGRCTlZoa1NuYxAB",
            "text": "Had such a great time here! Food was exceptional, great atmosphere and vibe."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJMFdWWjNURFJpTFZwR1RFRnpkVkpaY0VsdmNXYxAB",
            "text": "Food tastes so good. Service perfect. Environment phenomena. 10 out of 10"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKMVlsQnhhV0o0ZUZoWFpqVk9aVm93U21kbmVGRRAB",
            "text": "Bartender is very hot"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zdFRIRkthVTh5WlhwMk5HRjZWMjFCV0Zvd1JIYxAB",
            "text": "Nice ICE"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xONU56Qm9aRXhtYXpNMGExbHJORVpXU2t0dWEzYxAB",
            "text": "Great service and great food 👍"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRdGIxTkNhSGxEUzJKeVZWUlhOMmRuUW1KTE0xRRAB",
            "text": "Such a cute little french restaurant with a great atmosphere and server.\nTheir french onion soup is a must-try, it has a smoky flavor on top and the cheese is very fresh."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xWGRFcG1UUzFuZG5GbVNqTnFWR050WTBoNVJFRRAB",
            "text": "I went to this restaurant for Sunday brunch with a friend. The Egg Norwegian was absolutely delicious! I’ll definitely come back to try their lunch or dinner next time."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wME5YZFZNMk5zT1V0amRYVjZVRmN0ZHpaUmNuYxAB",
            "text": "I love this bartender balsa, he was amazing"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214VWVFeDZTVm8zZFVKZlNIbHRiazF3Y2xaUGRuYxAB",
            "text": "Balsa is the best! His drinks were perfection and he made us feel right at home."
        },
        {
            "date": "2주 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdWNFbFdRM0JoVlVoc05tUkVVa1prT1VaU05VRRAB",
            "text": "On recommande vraiment ce restaurant pour retrouver les bon mets de la France avec son bon pain, nous nous sommes régalés, vraiment rien à dire et le service au top !"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUE5VcHBUMHRCWmtFeVYzSjZkMnBXVlV4UFZVRRAB",
            "text": "Definitely a hidden gem! The burger was amazing and the service was even better. Daniel has treated incredibly good.\n\nThe spresso martini was amazing"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsRmFGRmpXazE0T1ZCSWNuUlFUVlE0VFdaQlgzYxAB",
            "text": "Hidden gem! Amazing atmosphere and service! Food is authentic!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWVVVNXNabWRhTjNJM2FGRkRjRkYwZFZsNmIyYxAB",
            "text": "Not recommended. Very dirty and unkept kitchen. Saw it after I ate and didn’t want to ever come back. Decent food. Nothing special. Low quality cuts of meat."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201SlNGWkpZazluT0dKWVZrODBlV2RyZDNCZlJYYxAB",
            "text": "I can't get enough of what they serve here. The service stood out while the food showed innovation. This restaurant's team has mastered true hospitality. This restaurant provides outstanding value! I'm now committed to this place."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pObGNVUlVaVGRUTW1sRGVrdzNTV1pPUjA5TFEwRRAB",
            "text": "Wonderful food. Great service. Make a reservation for this wonderful little boucherie. The small setting and limited menu make it feel like a little bit of France in Greenwich Village. One of my new favorites."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pscFFUZ3lSRFYxYTBWa1FuZ3RNMlYzU25jeGJrRRAB",
            "text": "My friends and I had a wonderful meal here! The food and the atmosphere are amazing. Highly recommend their tartare and the service by Srecko made the meal even more special. Enjoy the nice views and a beautiful time!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbFExaHNOSFV5TlhsUE9GTklhRFZyZDNGYWVXYxAB",
            "text": "Srecko was the best! So sweet and friendly ❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSS1h5MHlRWEIwWVRSamRraGhXRTAwU0hORFkxRRAB",
            "text": "Stopped by for a drink on a weekday afternoon. Since it was raining, I just went into the spot I saw. The cocktails weren’t exactly cheap for the taste, but overall it was fine. I’d love to come back next time for lunch or dinner."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MlVVOVFRMmd4ZHpFMlJUUmtXVXR3VGxoS1gwRRAB",
            "text": "We had delicious escargots, salad, and duck confit. Our bartender, Nemanja, was especially welcoming, and served us a couple of excellent absinthe cocktails. Will definitely be back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkbWRuRnhhRzFrYlRkdFdIUkpkMjFXWlVKdWQxRRAB",
            "text": "This place is great, especially the bartender, Nemanja. Had such a lovely evening sitting at the bar, eating amazing duck and escargots, and drinking Nemanja’s cocktails. Will be back for sure!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210V1NVSm5TbEJKTW1wRWVtUmFPRmg2ZWxJek5tYxAB",
            "text": "Petite Boucherie has such a charming atmosphere, the kind of cozy, Parisian-inspired vibe that makes dining here feel special. The ambiance and overall experience were fantastic, from the décor to the energy of the space.\n\nFood-wise, it was a bit of a mixed bag. The croque monsieur looked promising but fell short of expectations. For the price, I was hoping for more, and it wasn’t hot enough… The flavor was pretty muted, and honestly, I’ve had better versions elsewhere for less. Not bad, but definitely not worth it at that price point.\n\nOn the flip side, the steak sandwich was excellent. The steak itself was tender and flavorful, and the baguette was perfect, crisp on the outside, soft inside. Easily the highlight of the meal and something I’d come back for. Quick side note: their Eggs Benedict is a standout and one of the best I’ve ever had. I didn’t get it this time, but when I’ve gone in the past, it’s usually my go-to.\n\nOverall, Petite Boucherie is worth visiting for the atmosphere alone, and while some dishes are hit or miss, the right choice (like that steak sandwich) can make for a really satisfying meal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOM1UxUndiMmt4VFhJMWRUTlFOMlpDYUZSamNGRRAB",
            "text": "Everything is super delicious. Very beautiful place at west village! Def worth a try."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KQ2NtWXRTVlZoY0hObGFXbHVRbVJKV0dWUlIyYxAB",
            "text": "Not only were the cocktails inventive and absolutely delicious, but the bartender Nemanja also went out of their way to make sure we had everything we needed. Fantastic experience — can’t wait to return!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSR1NXNUJSVkIzTVZWemFtWm9Oa2h5VjFsQk5sRRAB",
            "text": "Took my fiancée here for her birthday and it didnt let us down. The food was amazing, so was the service and atmosphere. Their portions are so generous and quality of the food is really high. The place reminds me of paris a lot. I definitely recommend this place for anyone who wants a taste of france"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21odldWbDNWWGM0Tms5YVZHazFhWFZ4V214eVMwRRAB",
            "text": "Amazing food, romantic setting, to try again"
        },
        {
            "date": "2달 전",
            "language": "fr",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xONWEwZEhMWGRqZW5aUExUVTNUMXB2V1hWMWNYYxAB",
            "text": "J'y ai mangé en juin c'était bon , escargots et filet de poulet au comté, l'ambiance était chaleureux, un service très pro, merci encore 😉"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SUU1XWkhSbWRMT1ZoR1kzWjBNbWRZY1hsNWFHYxAB",
            "text": "The espresso martini is to die for. I loved the people the scents and the music, Daniel is a great bartender and he is strong"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4d01uSmhURVl5V2t4blEyeDVjbUZtVVZKbVFrRRAB",
            "text": "So much fun and good vibes, loved the cocktails and the bartender is a handsome and sexy Venezuelan. God bless America. Also the steak tartare is amazing! Bye"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wV2NFUjVTbVpCVDE4d05ERXhSRzVtUVdoVGNuYxAB",
            "text": "Tucked away on a charming little street in the West Village, this restaurant is such a gem. The atmosphere is cozy and welcoming, and Suzana made the experience even better! She was so kind and gave food suggestions that turned out to be amazing. Every dish was delicious, and I can’t wait to come back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVU5VTXRYM3BvVUV0b2FUUnRTRTVLU3pOMFptYxAB",
            "text": "Great space and fun staff. The food is poor. The special pasta tasted like a diaper. A clean diaper. But still. The chef clearly mixed salt and sugar up on the cherry desert because it was an inedible chunk of sodium. However, when I showed the server my blood pressure reading, she admitted they were trying to kill us and brought some delicious treats to replace it. Sorry but…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Rd1pUSk1TRGt3VWxobFNEUmplbkpGWmw5bU1sRRAB",
            "text": "Celebration for my bday alone\nThanks for the free bday drink:)\nNice service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSbGQyVTRZVTU0Y0dsS1QydHFkMGsyVkRKcmNVRRAB",
            "text": "Had the best time. The food and service was incredible!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwTGNEbHBXRUkzWWxKaGMwUnNPRFF4Ym5sNVlrRRAB",
            "text": "The food was amazing, but the service was even better! Our server Lola and the bartender were both incredibly kind and welcoming."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1UE5uTk5VM1EwVVdvM1JIcDRWek5XYUdWdmMzYxAB",
            "text": "The best place for brunch in the village"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WR2EyRk9SVjlMZFVOdWNETTRNMlJYU0V4YVduYxAB",
            "text": "10/10 Ive been several times and it’s always great! The most recent time it was restaurant week. It was great to try the new specials and the dessert. The steak tartar is my favorite. Summer is beautiful here because the large windows open up and it has a soft breeze on a quiet street corner."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVM01HbHRRMnR0T0ZsNVoxUTFabnBmT1Y5SE0zYxAB",
            "text": "we had the best experience with my family at Petite boucherie the food was outstanding and the cocktails were the best in town 👌 definitely deserves a 5🌟"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21obmFXUkdWVE5UU1ZWclYydDFkMjFOT1MxQ1VIYxAB",
            "text": "Came here for a quick bite and drink during my New York trip and it was amazing great service very cute spot"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ndE1IZGpRMWhGYTFGTlZFdDFRbXRETVZZdE9YYxAB",
            "text": "Petite Boucherie has a fashionable setting. They cook well and bring it promptly. I never expected such a great restaurant. Every staff member was notably flexible. My final verdict: Petite Boucherie is impressive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSS1ZUWnBObU13Y0hwdVNIRmlTRWh0ZFhkTGFsRRAB",
            "text": "Our dinner here featured proper cooking techniques. The restaurant has proven itself reliable. Their dishes maintain quality while prices stay fair. The service team gives this place its stellar reputation. The place gives superior results."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkNmMxVm5XVU5MTURSMlZrazVkbTVPVmsxZmEwRRAB",
            "text": "Best espresso martini I had in my entire life! Cool, cozy and upscale restaurant in east village. We stopped by for drinks on Sat afternoon. Highly recommended! If you use the Inkind link that’s in my profile you’ll get 25$ off! :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CV1RXeDBjbFZKVkZCUGJtZG5jMEZ1WkdSdFkyYxAB",
            "text": "Cozy little French bistro with such a warm vibe. I had the eggs Norwegian and they were amazing-smoked salmon, perfectly poached eggs, and that hollandaise was buttery and light. Great brunch spot to relax with coffee and good food.\nWarm, attentive staff and flawless service made the brunch even more special!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSGNuaHViRVpvTTFKMVZuVkVia0V6T1RKek1WRRAB",
            "text": "Food was amazing…and service even better! We are coming back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1d00wbDJSa3RyTURGaGIybFVOR294TldsbmRYYxAB",
            "text": "This is very mediocre French food. Proportions for the burger were off (very bready / bun-heavy), the duck was not tender and way too sweet and not seasonally appropriate, and the goat cheese salad was pedestrian and had over-fried goat cheese.\n\nThis was place lacked the things French food is known for…technique, refinement and rich flavor."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSb00xWm9hRUpxTUc1aFpWRlVlV3hxT1VrNGIxRRAB",
            "text": "Food was fantastic, as well as the service! One of my favorite places to eat in the village- ive been coming for years and they never let me down."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rdGJVeGFNbTVuV0c1ak9URmZTRTEyVDJwbVRGRRAB",
            "text": "The food was fantastic but i9t took too much time to arrive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5dGVsODJZbmd6V2swMlFVOHdURXRuVDNCSFMyYxAB",
            "text": "Agnes was incredible, she was our waitress and did an amazing job! Vladimir was great as well. The atmosphere and staff were fantastic, and we’ll definitely be going back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3dE5rWTJXV2QyV1d4TFdtVlBSREpNUjE5Q1RtYxAB",
            "text": "What a great time there, what a great atmosphere, what a great people, what a great food.\nFernando, Vladimir and Andrés made sure we got all we needed and beyond, as soon as im back to NYC, will definitely visit again.\nSuper recommend"
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURncHBERThRRRAB",
            "text": "Exterior was very nice and beatiful. However, I was very disapointed at foods. It was normal style amreican foods and not impressed. Duck and beef were pretty good, but pasta was not good enough.\n\n분위기가 좋아 꼭 한번 가보아야지 했던 곳이지만 음식에서 대단히 실망한 곳. 노멀한 미국 음식이 주로 제공되며 가격또 조금은 부담스럽다. 프렌치 어메리칸 음식을 만드는데 정통 프렌치에대해 이해도가 좀 많이 부족해 보인다. 음식의 볼륨은 크나 맛은 대단히 실망한 곳. 음식보다 차라리 간단한 페스트리나 커피로 전향해도 좋지 않을 까라는 생각을 해본다. 아쉬웠던 장소"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNWRMZGJnEAE",
            "text": "I was NOT happy with the service, terrible experience and will not come back. The waitress hinted and asking if we are finished with food while we were still eating, talking with other waiter and keep giving me glance so we can leave early when we only stayed for 40 mins.\nfood was so so, small and uncomfortable table I would recommend to go to different location.\n음식은 그냥 그렇고 직원들 불친절하고 밥먹는데 빨리 가게끔 눈치줘요 여기 가지마세요 맛도별로 다른지점으로 가세요"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SemF6TnNiVXBmY1ZWZlEzaHFOVXhOUmpOeVpGRRAB",
            "text": "We went on a nice summer evening when it was 80 degrees outside. The restaurant had the doors and windows open so the entire place felt like we were eating outside. Our server was great. He helped my wife with her questions on the ingredients. He was attentive but not overly so. The food was great as expected from Boucherie. My wife had the duck and I had the pork medallions. They served real potatoes, which I have come to appreciate given how many places serve some substitute for potatoes. I love a simple potato compliment. The duck had cherries and apples. It was great.\n\nFinally for dessert we had Paris-Brest in honor of the Tour de France which was ongoing this month."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tob1QwaHJNRFJ2VlVWWVNETjJTVlJmVUc1SmRFRRAB",
            "text": "This was a fantastic experience – we were well taken care of and felt seen throughout our visit. Our waiter from Serbia was very skilled and kind, and he truly made sure we were looked after. The food arrived quickly, and we didn’t have to wait long. The only thing I would have wished for was a bit more   seasoning in the dishes, but overall, the food was very good. All in all, this place is well worth a visit when you’re in West Village."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkeFFtcFJURTR0ZUhGRGFFVTNSbE5RZG1seGIwRRAB",
            "text": "I had the best time here. The food was heavenly. The drinks were amazing. The service was great. The environment was all I could’ve asked for. Our bartender and waiter, Daniel, did a great job at making sure we were being cared for and made sure our glasses were always full. My Friday night could have not been spent at a better place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VMN05vWWFaaDZiNzZnRRAB",
            "text": "The ambiance is definitely the highlight: charming decor, cozy lighting, and classic French vibes. We ordered two cocktails, and the Papillon was crisp, refreshing, and probably my favorite part of the evening.\n\nThe escargot appetizer was excellent — rich but not overpowering, especially good with the house bread.\nAs for the mains, the pork chop was tough and dry, while the beef bourguignon was much better — tender and flavorful, with hearty mashed potatoes underneath.\n\nService was polite but the wait for food was longer than expected.\nOverall, it’s a lovely spot for drinks and conversation, but I wouldn’t come for the main dishes alone."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VKdm1xOURQajlYcmlRRRAB",
            "text": "I must say that the experience was below expectations.\nThe guy who served us and took our order was always very kind and attentive. Different from the girl who was on duty and at the bar.\n\nWe were welcomed with water on the table and a basket of bread and butter, honestly, this was the only tasty thing of all the food.\nWe ordered onion soup, I was hoping to try it for the first time in a restaurant, it was very disappointing, lack of flavor, even the cheese didn't taste good in that combination.\nWhen the girl came up to ask us how the soup was and knew we weren't very happy about it, she gave us a very noticeable look of annoyance and from then on she always had that attitude.\n\nWhen the second course arrived, we thought it might be different, but we found a \"salad\" which was actually just lettuce leaves with a hint of oil, with no flavor whatsoever.\nThe sandwich was a definite no for us, we have been able to have a much better and cheaper simple ham and cheese sandwich in any coffee shop. It just looked fancy because of the presentation with the cheese on top of the bread, but the bread was a bit hard and the amount of ham was poor.\n\nThe price definitely doesn't justify the quality of the food at all. It's too expensive for something so simple, tasteless and poor.\nMy partner had already gone with friends before and they tried other types of food such as meat, It had also been a bad experience in terms of food, taste and texture. So this is something constant.\n\nIt's sad because the place is very nice and in a good location.\n\nHonestly, it puts you off trying other\nlocations and finding out if the food is only bad here. But we're not going to spend any more money on this place.\n\nDO NOT RECOMMEND IT."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdVkzcFpjalZHWDNsRk9UWmhiRnBSVUVsSVRXYxAB",
            "text": "Loved this place! Amazing burger, fresh salad with anchovies and the bartender was spectacular. Also on the most picturesque tree lined street with a large open air feel. Def worth the stop for a nice lunch, romantic dinner or elevated cocktail stop around other bars!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKV1UzVlNURk13ZFZaM1RFY3daMWhFYW5sS1NrRRAB",
            "text": "Petite Boucherie is a quaint escape from the city bustle that, with some good weather, will transport you to another place. Lovely little spot to sit both outside and in near the bar for some good wine, cocktails and french classics. The petite’s old fashioned was a good take on a classic but nothing to write home about. Unfortunately I felt the same about their burger. The flavors were decent and portion size of the burger and fries was awesome, but I ordered the wagyu burger medium rare and it came medium to medium well. For a $30+ burger, there are others better in the city, though it was still good overall. The fries were the best part, perfectly breaded and crispy. Service was also very attentive and a lovely lunch overall."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGdldrUlFZVlEwZEU1TE1qaDBSMEpKWWtadU5rRRAB",
            "text": "I went there on a Monday night around 8:30 PM and was seated by Vladimir, who had a very welcoming attitude. He took my order right away. I got the Steak Frites, mixed vegetables, the PJ mocktail, and Millefeuille for dessert.\n\nFernando served my food and bussed my table. He was incredibly attentive throughout the night, and I noticed how kind he was to everyone around. At one point, a random person walked in just to ask for napkins and water—and they treated her with the same kindness and care. It genuinely made me happy to see that.\n\nI really enjoyed the ambiance and the food, but I have to say—the Millefeuille was AMAZING. I loved it so much I even considered getting a second one!\n\nI would definitely go back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RGFXVlBNbE5SYjJWRU1IazRhbVZoVGxoT1NGRRAB",
            "text": "Had a lovely evening sitting at the bar. The windows were open and the restaurant had such an inviting warm glow. We also thoroughly enjoyed our drinks - highly recommend the Hola Paris! My mom enjoyed the La Vie En Rose (both pictured). The bartenders were friendly (Thanks Balsa) and I would say great service all around!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeW9tU3hBRRAB",
            "text": "Outstanding French Lunch – Ask for Susanne!\nWe had an incredible lunch at Boucherie – easily the best French food we’ve had in NYC. The moules were perfectly cooked, the filet mignon au poivre was rich…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNk9YYTlnRRAB",
            "text": "Came here for brunch and loved the vibe. Cozy and understated with a lot of natural light, perfect for Sunday brunch! We got the Norwegian eggs and they were delicious! Loved that they came with a side salad instead of fries!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oUWNVRkVhWGxrTTFFMU0zSlFSbVJSYjBsSlpVRRAB",
            "text": "If you’re craving a little slice of Paris in the heart of NYC, Petite Boucherie is the place. Tucked into the West Village, this cozy French bistro oozes charm from the moment you walk in — vintage mirrors, dim lighting, and a warm, bustling vibe that instantly transports you.\n\n🥖 The menu is classic French — think escargot, steak frites, coq au vin — and everything is beautifully prepared. I had the duck confit and it was rich, crispy, and tender. The French onion soup? Comforting and deeply flavorful. You can’t go wrong with anything here.\n\n🍷 The wine list is solid and well-curated, with plenty of French options (obviously), and the cocktails have that perfect bistro twist.\n\n👨‍🍳 Service was friendly, professional, and attentive without being overbearing. They really take their time to explain the dishes and make sure you’re having a good experience.\n\n🌇 Bonus: sitting outside gives you that classic NYC-meets-Paris sidewalk café feeling — perfect for people-watching over a glass of red and a crème brûlée.\n\nVerdict: Whether it’s a date night or you just want to romanticize your evening, Petite Boucherie delivers. It’s not just dinner — it’s a vibe. Highly recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFeFpIWjZPRmRPWDJOa2RIaFNVVVJJZVdWS1ZsRRAB",
            "text": "Holistically charming from the ambience, to the food, and the service. The aesthetic transports you to Paris by way of New York, the burger was delightfully cooked, I even complimented one of the line cooks. The bartender took amazing care of us. Random, but one of my favorite mayonnaises in the city! Will certainly return"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214bGRFSk5UMDVuUzBaWk1UWlNRWFZYT1hOVU9IYxAB",
            "text": "I had the pleasure of dining at Petite Boucherie tonight, and it was truly a wonderful experience. The food was absolutely amazing—beautifully prepared, rich in flavor, and authentically French. Every dish felt like it was made with care and attention to detail.\n\nThe service was just as impressive. The staff were warm, attentive, and made sure everything ran smoothly without being intrusive. From start to finish, the atmosphere was cozy and elegant, making it a perfect spot for a relaxing evening out.\n\nHighly recommend to anyone looking for a memorable French dining experience!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdzZpeDNBRRAB",
            "text": "Do yourself a favor and make a reservation here, it’s a wonderful experience. The staff was exceptionally friendly and helpful for newbies to French cuisine, the food was delicious; we started with a bottle of wine and steak tartare w a quails egg as an appetizer, then perfectly cooked salmon steak and filet mignon that melted in your mouth for mains. Pistachio cheesecake w an apricot preserve on top, a dense chocolate caramel tart, and cappuccinos for dessert. We were in heaven. The atmosphere was relaxed, the music was fitting and not too loud for conversation, it was a nice April evening, their big window walls were opened out onto the quiet side street with tables on the sidewalk. We chose to sit inside their charming space. Wish we lived closer!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOUl2TDRRRRAB",
            "text": "Cute intimate date night spot! Great menu options. We had the beef tartare, escargots, lamb chops and steak frites. The beef tartare was interesting I didn’t really like the flavor profile in it. It wasn’t bad I definitely think if you’re big on texture this isn’t for you. First time having the escargots and it was really good, Lamb chops and steak frites were delightful. I was stuffed by the end of the night. The drinks were a bit on the stronger side."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNibUtQY3NBRRAB",
            "text": "Came here on Friday for lunch with some colleagues. The door leading in to the restaurant is beautiful and so is the interior. I love the big window looking out onto the very quaint street. However, the interior is pretty cramped. They tried to seat us at a table that is literally right next to the front door, but moved us after we asked.\n\nI ordered the L’Auvergnat and a lemonade. Beware that the lemonade is VERY bitter. I’ve never had anything like that and the waitress seemed annoyed that I didn’t like it. She wasn’t very friendly, and was borderline rude to us, so I shouldn’t have been surprised. The sandwich was good but too “bready.” I had to take the top layer of bread off in order to enjoy it. We got an order of fries for the table and they were really good. They season them with salt and black pepper and you could really taste the black pepper. So yummy.\n\nThe prices here are what you’d expected for this area (i.e., overpriced). Not sure I’ll return."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzemFEVXBnRRAB",
            "text": "Absolutely delicious French style cuisine as I’ve been to French inspired restaurants where they try so hard to make the dishes unique that the ingredients do not combine together well and tastes terrible. That is definitely not the case for this restaurant. Everything here that we ordered was phenomenal, cooked to perfection and I would definitely recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3NXRDYzl3RRAB",
            "text": "This cozy little restaurant offers a perfect setting for an intimate dinner. The dim lighting and candle-lit ambiance create a warm, inviting atmosphere that feels both romantic and tranquil. The food is a standout—light, flavorful, and expertly crafted, leaving you satisfied without feeling weighed down. The attentive service adds to the experience, making you feel genuinely cared for throughout your meal. Whether for a special night out or a quiet escape, this place is an excellent choice. Highly recommended!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKTGhzc1dKNmV5c1JnEAE",
            "text": "Amazing little boucherie! Cute French place, delicious food! The servers forgot our burger, so 4 stars to them, but, otherwise, great place! Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMHE2cDJBRRAB",
            "text": "This was my first time here as a New Yorker, and I absolutely loved the food and the amazing atmosphere. Despite it being busy, we received great service. I would especially like to thank Balsa for his helpful advice and friendly approach during our first experience at Petite Boucherie! :)\n\nCheers!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kcGVVWlZUbFJQYms5dlNYRktTSFJDUWt4dlNuYxAB",
            "text": "Had such a lovely experience and the food is amazing! Also loved the incredible service we received from Fernando :)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLbWs1ckxMdXRlMDVBRRAB",
            "text": "One of my favorite bar/bistro/restaurants in the world.  The ambience of this smaller Boucherie location can't be beat - equally cozy and comfortable on a quiet dreary night or a sunny afternoon with the windows open.  The food is always phenomenal, wine list spot-on without being overwhelming, and the cocktails classic and delicious (not to mention great value for quality ingredients and craftsmanship).  The service is always impeccable and complements the ambience and mood perfectly.  Always my first choice for lunch, dinner, or just a drink when I'm in the neighborhood.  Special complements to Balsa and his incredible espresso martinis!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKU216b2J4bUozeHFnRRAB",
            "text": "Had a fantastic time in Petite Boucherie! The highlight was the amazing service. Huge thanks to Balsa, Suzana, and Agnes for their warmth, attentiveness, and professionalism. They made the whole experience memorable—highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOME5sQlBXV0paY0RaUlprMUpUMk5MU0RKRFFXYxAB",
            "text": "Daniel the server it’s amazing guy , He knows the whole menu he recommended me a great dinner,but what we liked the most were the drinks (negronis and expresso martini)"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdlkzU2dRRRAB",
            "text": "Came for late Sunday afternoon lunch. Absolutely enjoyed the mixed cheese and charcuterie board and a bottle of French Chardonnay. The vibe is Parisian and place is the perfect size for more intimate moments with friends. Susana the manager was extremely welcoming and friendly, a true hospitality professional."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNWMycDNTM2RQWkc1MVNuUnpPV0pUYVhGaVNuYxAB",
            "text": "I have been here twice and absolutely love the place! It’s like a tiny piece of Europe on a quiet beautiful neighborhood corner in the village. The food and drinks are great, and Fernando has been my server twice and is excellent. His service is top notch, and he even remembered us from last time which made us feel so welcome. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibU4yNnV3RRAB",
            "text": "Absolutely love this Boucherie location! It's perfectly situated on a quiet street where one can people watch and take in some wine and divine escargot. Suzanna, the hostess was incredibly knowledgeable, genuine, and friendly. Above and beyond the service! Petite Boucherie, truly has kept the remnants of the West Vill. alive and well. This will definitely be my staple inspirational culinary retreat!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMXZMX1J3EAE",
            "text": "Each plate was served with attention to detail and quality food. We ordered the charred octopus, foie gras(not my fav but daughter loved it!), celery gratin, a pistachio apricot  cheesecake, and the lemon tart dessert. The bartender made our daughter a pineapple mock-tail and it was delicious. Highly recommend this adorable restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdThYNDBRRRAB",
            "text": "I’ve been to Petite Boucherie several times now and always sit at the bar with my favorite bartender, Balsa, who is always so amiable and makes an amazing drink. The atmosphere is so lovely and makes it easy to spend a bit of time enjoying the food (my favorite is the tuna tartare) and chatting with other staff members like Darko and Suzana who always make it a great experience for me. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURial9IaUd3EAE",
            "text": "Really great service and food! We ordered the tuna tartare and Eggs Benedict, it was delicious.\nPetite Boucherie has a Lovely ambience and decoration\nMe and my friends had a great time here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGcHVLX0VnEAE",
            "text": "Came in for a quiet lunch . Was really nice to practically have the whole restaurant to myself.\n\nStarted with some complimentary bread. Was so nice , warm and crispy .\n\nHad the fixed lunch , phenomenal price with an amazing portion .\n\nLoved everything, will happily come back ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYZ1o2SW9nRRAB",
            "text": "Cute little French spot with great food and service. Sampled the absinthe drip, got mussels, French onion soup, steak frites, crème brûlée, and espresso martini. Recommend it all! Gf said it was the best crème brûlée she ever had. Shout out to our incredible server Namania (sp?) who went above and beyond!"
        }
    ],
    "reviews_count": 85
}