{
    "name": "Don Angie",
    "place_id": "ChIJfxC19JVZwokRX2uKgQAL17c",
    "grid": "MN2",
    "address": "103 Greenwich Ave, New York, NY 10014, USA",
    "rating": 4.6,
    "user_ratings_total": 1615,
    "phone_number": "(212) 889-8884",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKTFJUTnlSVXBEVUcxUmNGbEVVVkZrV2xoSFIzYxAB",
            "text": "The lasagna and the chrysanthemum salad are definitely worth it. The salad in particular was my favorite part of the meal.\n\nThe bbq calamari was nothing special compared to the other meals - i would not order it again.\n\nThe buffalo milk caramelle was okay but very few pieces - i would not order it again, bad bang for your buck\n\nSourdough pasta was good but the lasagna and salad are the true stars\n\nBe prepared for an expensive meal"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTmIzaFljSFJWUVhSakxYRlhUUzAzWjJ0S0xWRRAB",
            "text": "Don Angie absolutely lived up to the hype. We came at opening on a weekday and were able to snag bar seats right away. The compact menu is full of creative Italian dishes, and everything we tried was outstanding - the Tonnato Vitello combined veal tartare and tuna carpaccio in a well balanced and savory bite. For pastas, the Sorpresine with Smoked Mussels was very umami, while the Buffalo Milk Caramelle with black sesame and candied kumquats was refreshingly bright. Even the Japanese sweet potato side was a highlight - beautifully crisp and fragrant.\n\nEvery dish felt intentional and creative, and I can see why this spot gets so much love. Can’t wait to return to try their signature lasagna next time."
        },
        {
            "date": "수정일: 2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbmY3T013EAE",
            "text": "This is definitely top class traditional Italian with a chef who seriously knows the craft and is brave enough to try new things. Coming back after a few years it still surprised me with its food. They are very generous with the cheese, which makes everything taste delicious. The lasagna is good, but salty. Other pasta was surprisingly sweet. I loved the salad appetizers. The portions are on the smaller side, so order accordingly, and if you can order to share!\n\nThe waiter provided good service, but the busboy wasn't filling out water regularly (and they don't provide a jug for us to pour ourselves). The ambiance is nice, modern, but the tables are squeezed together and it gets very loud."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1RU1sTmxkREZzV1VkUmRISjRja05VVmpjeGJFRRAB",
            "text": "Extremely cold hospitality. The week in advance reservation system is a scam. This place sucks."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVVV6RmtZMkZuUmxsRU4yRTNYekZMV1V4aGVWRRAB",
            "text": "By far one of my favorite places in the city"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BdGVFOU9UMmRmWVRKdVJteHNiWGRCUWxWbWJVRRAB",
            "text": "Don Angie’s lunch include complaints about bland lasagna and overcooked chicken, with several guests noting that the food was either too salty or overly sweet. The portion sizes were described as small, and the flavors felt unbalanced for the price. Service also seemed slow, leading to a less-than-ideal dining experience, making it hard to justify the high cost for an average lunch.\n\n👎👎👎👎"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOaFZXaEtkVTVqZUVoS2JGSjZSVFZoUTFoVVRXYxAB",
            "text": "We took all of the recommendations from our wonderful waiter and wowwww was this place worth the hype! The lasagna of course was the star of the show but I was most impressed with the sweet potato’s! A definite must visit, get in line at 3:30pm and put your name in, definitely worth it!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wNldHZFhabUp5WmxCcGJpMTNXRkpVTlVwcVRsRRAB",
            "text": "Went with a walk in option on a Thursday. The pinwheel pasta was good and not too heavy at first bite. The tiramisu is really good. A special mention for the garlic bread. Overall a good dining experience and exceptional service."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFNE1HMVFMV2xRWDNvMWFuRldNa05KU25aeFpVRRAB",
            "text": "Loved this from the minute we entered."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4elZtWndPR2hxVUdWcGNtVlBhM05tUzFCVFRtYxAB",
            "text": "Great restaurant. If you want to try Italian in a different version this is it."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRU5IVlFXRVEyVlROeE5IQjNOREZtU1RGT2VIYxAB",
            "text": "I was able to get a lunch reservation a week in advance on OpenTable and it was worth it! Everything was delicious and lived up to expectations. We ordered the chrysanthemum salad, calamari w/pepperoni rice, caramelle pasta, and the lasagna to share and everything was beyond expectations. The calamari really surprised us, but the salad is a must order. The lasagna is delicious and the portions are huge. The bread it is served with is amazing. Highly recommend this restaurant as “worth it” if you’re trying to get a reservation: keep trying!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odU0wcHVRblZ2TXpKb1ZFZG1TRXBzTm5oUVVXYxAB",
            "text": "Unbelievable food service and atmosphere.\n\nLoved literally everything on the menu.\n\nTip : get there early at 4:30 if you can’t get a reso online as they allow guests to form a small line up and if there’s space early they will accommodate you.\n\nWe were 4 people and we got in like that as we couldn’t get a reso online or by phone as they were fully booked."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKb1NtNXlSR1JzZVV3MGJqbEpOa3RJVGs1M1NWRRAB",
            "text": "The food was excellent. The service was excellent. The chrysanthemum salad was wonderful and we enjoyed the lasagna as well. The only unfortunate thing was we had a family next to us that continuously played tik toks on full volume as well as a movie for their children on full volume. It was extremely loud and disruptive. At some point the staff needs to request this type of disruption stop as it completely ruined our dining experience. We left early and our waitress was apologetic, but I don’t think it’s too much to ask that patrons wear headphones if they insist on watching videos on their phones during a nice meal."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oa2ExbzJlVEJSUkY5aFkzZDVTVEJtYmt4bFZsRRAB",
            "text": "Loved going to don angie when I was able to get a res (very very difficult). The service was amazing and the food was divine. The lasagne was incredible and highly recommend the caramelle. The chrystanetheum salad and the tiramisu were our other favs. Would love to go back!"
        },
        {
            "date": "4주 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WUGRVcGZUR2RJUm1WMk1XaEhkRUpQTUU5NFEyYxAB",
            "text": "Cuisine et service remarquables. Et quel bonheur d’avoir dégusté le tiramisu offert dimanche soir, à l’aéroport, avant d’achever notre voyage ! Mille mercis, au plaisir"
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKX0tDaVlBEAE",
            "text": "The food is exceptional, however the service was just ok this time."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paeFJHNTNiVWh3Ym1kb1IyRndNVWwxUTFkVVJXYxAB",
            "text": "Great service but food is definitely overrated but very beautiful and instagramable. 🤷🏻‍♀️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kNmJHTjFRWGw2VmpFNVRYaE9NbGQxVHpoU1RYYxAB",
            "text": "10/10"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsd2R6RkxUbXRmYTFoRGFsOVpka1ZIVkRodU1YYxAB",
            "text": "We had a wonderful evening of delicious food and wine at this busy Italian restaurant in a great location in the West Village.  Host was so pleasant, which is a great start.  Pasta was made with high quality ingredients.  The only reason…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsdVFrNU5jbEpwVG14WGFWRlJVVU5XY0RCaFkzYxAB",
            "text": "Everything was excellent! One of the best meals we had on this trip to NY. Modern Italian dishes, with no pretention and plenty of flavour. Not a single bad dish we could point to with everything impressing in some way.\n\nDifficult to get a table at, but we gave a walk-in a go and were seated with almost no wait. Would thoroughly recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkTGVIVjVaQzFTV1RWNVVUVllORFpOY1RWMlRYYxAB",
            "text": "Tried to walk in on a Saturday in September around 4:35pm - they said it was a 10 minute wait; we were seated by 5pm. I was very surprised how easy it was to get a table on a weekend night (again, go early!). Delicious espresso martini, lasagna is a must try - the flatbread was incredible and tasted a bit like a scallion pancake. We also split the cauliflower which was great and not too spicy. Service was a little bit lacking - the waiter seemed unbothered to help us, it felt like he had the air of \"you're lucky to be in here\". He did not come over to take our drink order until we had been seated for at least 15 minutes. He also barely checked on us, and did not seem attentive. This is somewhat disappointing, especially given that we spent close to $250 for the meal. Despite the poor service, I would say I recommend a meal at Don Angie - the food is worth it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFd2NIRnlPVFYzTW5aa1NWWmpVVkpGVG1GaWNGRRAB",
            "text": "Sad to see a place with so much potential just flop. Food has become too salty, too sweet and too everything that should be nuanced. The dishes were once in balance. Servers don’t allow tiered orders…..must order all in full even on a quiet night. Atmosphere has gone from loud to impossible to hear. For the price, go have 3 good meals elsewhere. Don Angie’s days are numbered. Just a scene now. I mentioned to our server that the lasagna was burned, loaded with an insane amount of creamy cheese and just overall not what I had before and their response was “what do you want me to do”"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZNVVYRnlhbE5aV21KaFZIaDBaekl5VTNCaGJIYxAB",
            "text": "I was by myself so I didn’t try the lasagna nor the salad… so my experience is different. However, the overall experience was good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5d2RrSTRabGhoVVZwclVWaGZOMnM0T0d0a2VVRRAB",
            "text": "Average food, above Average prices"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjMU1XZHpjVU5NYm1sUVJuTlBVM0ZpV0Rnd2VrRRAB",
            "text": "One of the few places in NYC that are genuinely worth the hype. Get the chrysanthemum salad + negroni — perfect\ncombo. Steak was great as well. Incredible staff (shoutout Lisa and Matt)! Highly recommend if you’re able to snag a reservation."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZd1ZuTmpVRGhtZWtoU1lrTk9aWFZwUVY4NWFsRRAB",
            "text": "the food is fresh and full of flavor—offering tastes you won’t easily find at other restaurants. The service is attentive and pleasant. The only drawback is that the environment can get quite noisy."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xQmRXc3RSbUZzY0Y5MGRtd3laM2hEWjBaMWVYYxAB",
            "text": "So good I had to review in the middle of dinner. 100/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vM1VHMTJjWEl4T1doRE5VMUtVbGh5UW5GelMwRRAB",
            "text": "Amazing lasagna, living up to its reputation. Tiramisu was a too crunchy for me."
        },
        {
            "date": "1달 전",
            "language": "it",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoV1VHaGhlWFJhVkhOU2JGbFBXbkJCWjBzeE4xRRAB",
            "text": "Sono stato da Don Angie per provare la loro famosa lasagna per due. Ho anche provato il loro crudo  scallop come antipasto. Pietanze molto buone e ben preparate. Come dire, anche l’occhio vuole la sua parte. Venendo alle lasagne, devo dire che erano di fatto dei nidi di rondine. Porzione davvero abbondante tanto da meritarsi pienamente il nome di lasagna per due. Piatto molto ricco di sapori e molto sostanzioso tanto più che viene servito con della focaccia di accompagnamento e per l’immancabile scarpetta. Devo dire che le aspettative sulla lasagna sono state parzialmente deluse. Inoltre, a mio avviso, la difficoltà di prenotazione e gli spazi ristretti sono altrettanti aspetti negativi che pesano sulla mia esperienza complessiva."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tacFV6TjRiVmxIWTNBelgzbHROMEZyZVhaNmNGRRAB",
            "text": "Don Angie is a small, cozy spot with excellent food. The lasagna was the highlight — served in their signature rolled pinwheel style, it looked just as good as it tasted. The pasta was thin and delicate, layered with rich cheese and sauce that balanced perfectly without being overwhelming. Each bite was creamy, savory, and super satisfying. Everything else we had was tasty too, but the lasagna definitely stole the show. Glad I finally tried it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BeVFYZGpkVzlKZUZadlltUnBWVEl3WDFoeFNHYxAB",
            "text": "The star of the show was the chrysanthemum salad, an original and tasty dish taking a flower/weed that grows pretty much everywhere and turning it into a tasty, refreshing, light treat. The lasagna was original and tasty, but unfortunately, I thought the sausage was over-seasoned. Maybe a mushroom version would be outstanding. Sourdough pasta cachotore was tasty, rich, and reminded me of a farm country pasta dish. Great, solid restaurant; I enjoyed my meal there."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGcWJEVlpiMWR3VEcxa1lrOVhXalpLZVhSemQzYxAB",
            "text": "I had the pleasure of dining at Don Angie in New York, and it was truly an exceptional experience. From the moment I arrived, the atmosphere felt warm, stylish, and welcoming—perfect for enjoying classic Italian flavors with a modern twist.\nWhat made the evening especially memorable was the outstanding service from my server. She went above and beyond to make sure everything ran smoothly. Her knowledge of the menu, attentiveness to details, and genuine enthusiasm made me feel like I was being hosted in a true Italian home. She anticipated needs before I even asked, checked in at just the right times, and added a thoughtful touch to the entire meal.\nIn many ways, she was the perfect example of what great Italian hospitality should be—warm, gracious, and dedicated to making sure each guest has a wonderful dining experience. Between the fantastic food and the excellent service, Don Angie easily stands out as one of the best Italian restaurants I’ve been to in New York.\nHighly recommend both the restaurant and the team that makes it so special!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aSFIyMUZXa2R4UjI0eFRGbElVblZDYkUxRGIwRRAB",
            "text": "Had a great time at Don Angie! The lobster, deconstructed meatball, and Caesar salad were all 🔥—seriously some of the best bites I’ve had in a while. Huge shoutout to Alicia, our amazing server—she made the whole experience even better with her energy and attention to detail.\n\nNow, I gotta keep it real… the espresso martini wasn’t the best I’ve ever had, but it still hit the spot and kept the vibe going. Overall, would definitely recommend—especially for a special night out or if you’re trying to impress someone with your taste in restaurants 😉"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxMU9UVjFRbWxvYUhReVVYSjFXSEExUzBaWFgyYxAB",
            "text": "Lasagna is a must order!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OZlptUmZjakEwTFhjeFp6SnJXR3h0WHpZeldXYxAB",
            "text": "Great spot. Great vibe. Great food\nSat at the bar and met a few groups of people. Some local and some tourists.\nNick the bartender is the best. All the food was great. For dessert the Tiramisu is exceptional."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWaVZsQkNORmhuT0doZlNVUkJPVnAyYVRaNlJrRRAB",
            "text": "Definitely get the scallop crudo and the rolled lasagna!!! A big thank you to Don Angie for the complimentary bubbly for our anniversary."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kaVVtZ3RWRUZ3YTFwYWIxOXdWV0Z0Vm5kbFdsRRAB",
            "text": "Simply impeccable!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214eGVWbGtjMjFmY21sbGEwZDFlR0YxUWpkVFNHYxAB",
            "text": "Don Angie is a fantastic spot in the West Village for a special meal. I absolutely loved the stuffed garlic flatbread-it was a perfect appetizer, cheesy and flavorful. The garganelli with meatball ragu was also a standout. The pasta was cooked perfectly and the sauce was rich and hearty. A great experience from start to finish. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sd1NYaENTVVpqVVhKNk0waDBZbXRwUzJGTVZVRRAB",
            "text": "We had a very disappointing experience at this restaurant due to the service. Our server came across as rude and dismissive from the start. After we explained our dietary restrictions, he gave us a few options. When we ordered, he chimed in with a comment along the lines of “that’s on the lighter end of your order,” which felt extremely inappropriate and fat-shaming.\n\nWhat made it worse was that he went around to check in with the two tables near us but never once stopped by to ask how our food was or if we needed anything. The entire interaction left us feeling singled out and insignificant, which is the last thing you want when dining out.\n\nThe food itself was fine, but the service completely overshadowed the meal. It was an unfortunate experience that made us feel targeted, and I wouldn’t recommend this restaurant based on how poorly we were treated.\n\nWould love to see if Don Angie can make this right?"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcFgwNXhOSE5yWWpoRFFYUXllWFYzTWs5clgwRRAB",
            "text": "Most amazing lasagna in the world. No point of comparison. Before and after experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NmJETnJSV1poT0RscE1YbHpZMFZ0Y1RFMGRXYxAB",
            "text": "Creative Italian-American with a must-try lasagna for two."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxRlZrRmljMEp4YTFCVk1FTkhhVzB4VEVsc1NrRRAB",
            "text": "Amazing, easily the best lasagna and Italian fusion dishes I have had in my life. Highly recommended, awesome service and wonderful location. Can’t wait to try them again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGMlpHNWhaRXRRVmtWVlFUZGlkalJmYm5OVVUxRRAB",
            "text": "Excellent service, food and ambience. Tough to score a reservation but if you’re able to, you’re in for a treat."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsdGN6QXhlR0pFZFMxbmNERjBaRWsxVDBVMlVuYxAB",
            "text": "Surprisingly average. After all the hype the food did not shine at all. Could be any other restaurant. I will say though the tiramisu was top notch but not traditional."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMlpXVnllV0o0VUdoU1JWZFZZbkJDYUROVlZrRRAB",
            "text": "Honestly don’t understand the hype.\nI’d been so excited to finally visit Don Angie after months of seeing great reviews online, but felt everything was seriously mid.\nThe signature lasagna tasted like pasta and sauce out of a jar and was superbly salty.\nThe chrysanthemum salad was the only good dish.\nCourses were so rushed - we sat down at 6:30 and finished dessert before 8pm.\nService was cold at best.\nAgain, honestly dont understand why this place is so popular!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aZlp5MWpaVnBEWVVaR01EUTJZMWxVZEVoQ2FXYxAB",
            "text": "Big ambiance  in a intimate corner view.   Delicious"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xV2JsWXlURkJQZUcxdlEwTXdRa040UVdveE1sRRAB",
            "text": "Very tasty."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KWFprMXZZMDFLYUdRd1kwSTJjRk5zYkU4elEyYxAB",
            "text": "I am a huge steak snob, I have never had steak prepared in such a unique way. Exceeded expectations. Very delicious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oVWJ6STJTM3BSUVdWSk1VUm9XWGRITkhnNWRXYxAB",
            "text": "Was it worth the hype? My verdict is YES. Do try out their buffalo cheese pasta, it’s sweet and creamy. Love love love everything I ordered here. Do reservations days before because it’s hard to get in"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210alNYRlBZVWx6TjJodWJsRkpaMXBzYTFWTFNtYxAB",
            "text": "Now…THIS…is an exceptional dining experience. Every single bite was refined and bursting with unexpected yet familiar flavor. Service was phenomenal. This is the standard."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNad0tESGZ3EAE",
            "text": "웬만하면 예약 하시길 추천! Walk-in 하려면 오픈 4시 반 맞춰서 가시길 추천드립니다~ 바 자리는 바로 자리다 차더라구요! 요리는 5시부터 주문 받습니다~ 2인이서 쉐어가능한 라자냐가 제일 메인인 것 같더라구요. 사이드로 컬리플라워 시켰는데 묵은지 스러운 맛인데… 맛있었습니다(?) 칵테일은 바텐더에게 요청하면 mocktail로 가능합니다~"
        },
        {
            "date": "3달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NlUxbEpMV3BRWkRSSGEyeEhYMGx2VEZSNGJXYxAB",
            "text": "정말 어렵게 친구가 예약해서 방문했습니다\n라자냐는 단연 맛있었고 서버분들도 너무 친절하시고 좋았어요! 다만 내부가 너무 시끄러워서 대화하기가 쉽지는 않았습니다"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyeXRUNTZnRRAB",
            "text": "뉴욕 최고의 맛집입니다. 이집 오려면 예약도 되지 않아 4시10분즘 와서 기다렸다가 4시30분에 들어가서 먹어야합니다. 뉴욕에 있을땐 무조건 이집을 여러번 다녀와야 서울가서 후회하지 않습니다. 모든 메뉴가 다 엑셀론트입니다!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTk5VVXlkV0o0WVRSNE1uTllPRmxaVkdRMlMwRRAB",
            "text": "Got a reservation here for the exclusive Chase Reserve event. It was packed!\n\nMy favorite dish was the mussels. Very different taste, great pasta, and just delicious. My second favorite was the tiramisu as it was very different and crunchy.\n\nI thought that the bread and other pasta dishes were good, but they were quite thick dishes. There was a ton of flavor with each but the dishes were so thick with ingredients it created a ton of confusion with textures and tastes.\n\nThe lasagna had a soft and hard texture. The lobster wasn’t just lobster meat. As long as you’re prepared for a ton of flavors and don’t want just traditional Italian, you’ll enjoy this beautiful venue."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaDV2SThBRRAB",
            "text": "There are certain restaurants where it is almost impossible to get a reservation, or you can wait in line for two hours to get in. The question is always “Is it worth it?” In Don Angie’s case, the answer is a resounding “Yes!”\n\nWe walk past this place all the time, occasionally “peek in” (and are always disappointed), but the Restaurant Gods were shining upon us yesterday and magically there were two seats at the bar open. We went in and of course ordered their best known items. And they weren’t just good it was “best ever” type stuff. The lasagna was the best thing ever, even better than Carbone’s, which I didn’t think possible. And the famous chrysanthemum salad was incredible. Not as famous, but the crudo was amazing. And then the tiramisu was like the best dessert you’ve ever eaten in your life, a very different take on the concept. All these items, even the lasagne, are presented in highly original ways.\n\nThe service was extraordinary, the wines as well (try the pinot) and the atmosphere wonderful. The place is very small but very well staffed.\n\nSo yes - go here before you die - it really is “that good” and went far beyond our expectations in all respects.  It lost its Michelin star two years ago but I would choose coming here over any 3 star place in New York, it’s much, much better and more memorable. Two hours in line is like nothing."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOGFMZ253RRAB",
            "text": "It was aaaaamazing so say the least!!!\n\nI've been dying to come here and finally get to come omgosh!! Super hyped!! My friend was able to get a table for doing walk in at 3:30pm on a Friday. We were added to the waitlist and it was a 2.5 hr wait but this was super worth!!\nThey're also super hard to make a resy - never able to see it 7 days in advance at 9am. Someone pls give me tips if you do know the trick!\n\nWe order the 2 most popular items and it was the best decision ever!! Although a little much for 2 people but we still finished it!!\n- lasagna 6/5: it was just amazing! Right amt of sauce, meat and pasta texture, a lil crispy on the top - just perfect\n\n- lobster 5/5: superbbb creamy, the pasta and salad went really well with it!\n\nThe drinks were a miss though! So would prob pass on the drinks next time we go"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKLXJ0OVhfcWRuc2dnRRAB",
            "text": "This restaurant is one of the most hard-to-get reservations right now. Liked their lasagna for two and chrysanthemum salad, but everything was too salty. The lasagna came with some breads, which helped. Loved cocoa tiramisu. Service was great and atmosphere was cozy and nice, but a bit tight between tables."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210cFZYcFlNRTFyYkdwUU1EUTBRbGc0T0ZJMFptYxAB",
            "text": "Don Angie is a meal to remember, if able to grab a reservation it is well worth the time and money. Inside packs the old school italian joint feeling while having a modern touch. The service was attentive and helpful, and the food is the main attraction with every dish being perfectly executed. The salad and the lasagna are absolute musts! Cannot wait to make my way over again. Also get the Tiramisu! It is amazing best one I have ever had."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBd1gyZEtSM1pKV0V0VVlubHNOemgxUm5sVVkwRRAB",
            "text": "The place is tiny. Tables are almost elbow to elbow. But that’s OK. Service was great. Very attentive staff.\n\nPersonally, foods were nothing extraordinary. I only wanted to try their round-shaped lasagna but we ended up ordering more. We tried chrysanthemum salad, sopresine and smoked mussels, chicken scarpariello, lasagna, and fior di latte mochi.\n\nChrysanthemum salad was too sour for me.\nSopresine with mussels are OK.\nScarpariello is good. I took one piece and that’s it for me.\nLasagna was OK. I wish there’s more sausage meat.\nMochi was very good.\n\nAll in all, it’s a good experience. It took a little bit of time to get reservation but one visit is enough for me. Kudos to the staff! They’re excellent."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkR1ZDMVhUVmRLWjJRd1NHSjRaWE5WWDNSMWJtYxAB",
            "text": "it's one of the hardest place to book, but i was able to score a  reservation for first seating lunch on a Friday. I was told by the host that there are many seats outdoor that's for walk-ins. so make sure to come line up to get a table , especially on nice days out.\n\nThe food did not live up to the hype. It was satisfying but nothing was impressed .\nthe lasagna , as italian known as \"Roselline al Forno\" is over-priced. it's good but not memorable.\nChrysanthemum salad is a dish you dont want to pay that much to get it here.\nstuffed garlic bread is delicious that was unexpected.\nthe veal is over cooked and dry.\ntalk about most over-priced dish here is BUFFALO MILK CARAMELLE, the portion is so tiny, only like 8 or 9 ribbons in such a small piece. it's only just appetizer size dish\nTiramisu: probably one of the worst take of this dish ever had. the Mascarpone is very mininum which is a let down but there are too much crispy feuilletine. i wouldnt mind a little crispy layer but it's a bit too much.\nwhite peach sorbet is a very good dessert instead .\n\nService is great. our water has never been empty for more than 2 minutes."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWRWMyTmlSVnBoY3pGQlRFUlNYMU00YWpOcFZtYxAB",
            "text": "We ordered a lot of the pastas and the steak. None of the pastas we ordered, I would order again or necessarily recommend. We liked the appetizers and the tiramisu was the highlight. Overall not worth the hype in our humble opinion."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJSHI5b1RWcS0tTkZREAE",
            "text": "After giving Don Angie a second visit before sharing my thoughts, I can confidently say they did not disappoint. The food was truly outstanding, each dish was crafted with care, flavor, and authenticity. I thoroughly enjoyed indulging in my meal during Sunday dinner.\n\nA special thank-you to the very polite hoestess and Matt, the manager, who personally welcomed me and went out of his way to help secure my reservation in person. That level of attentiveness speaks volumes about the team’s dedication to guest experience.\n\nIt is clear that Don Angie takes hospitality seriously. From the quality of the food to the warmth of the service, everything reflects their commitment to excellence. I highly recommend this restaurant to anyone with a refined palate and appreciation for exceptional cuisine.\n\nI will absolutely be returning. Don Angie continues to deliver authenticity, consistency, and high-quality dining."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWdFRsZHRVWGhSTUVwdVZIcDZVaTFmYjFCdmVIYxAB",
            "text": "The waiter was one of the best waiters I’ve ever encountered. Very knowledgeable on the menu and super friendly. The atmosphere was terrific…and the food was incredible! We had the cheesy garlic bread, lasagne and sweet potato."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdXV1NTNnRRAB",
            "text": "I revisited Don Angie after a long time — my first visit had left me hesitant due to an awkward seating experience.\n\nBack then, we were a party of five and asked about a large open table. We were told it was reserved, only to see another group seated there as we were leaving — after finishing dessert, coffee, and tea. It left a bad impression.\n\nBut I’m glad I gave it another shot.\nThe service was genuinely warm, attentive, and thoughtful.\n\nWe tried a wide range of dishes, starting with the stracchino gnocchi, which was pillowy and rich with just the right touch of provolone and crisp garlic. The BBQ calamari was smoky and perfectly tender, brightened up by a tangy herb labneh and seasoned rice.\n\nThe grilled sea bream was beautifully cooked — flaky and delicate, with a lovely balance of saffron, almonds, and fennel buttermilk.\n\nWe also had the Japanese sweet potatoes, caramelized and sweet in the best way, and the stuffed garlic flatbread, melty and flavorful without being too heavy.\n\nThe tonnato vitello was classic and well-balanced, with tender veal and a smooth, not-too-salty tuna sauce.\n\nFor dessert, we finished with the tiramisu. The cream was slightly saltier than expected, but still enjoyable and satisfying.\n\nThe food was consistently excellent, and despite the tight seating — tables are still very close together — I left feeling really happy I came back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkVlpsaDJSM0YzWmtoU2FuZFNUelZWVkVSdlUzYxAB",
            "text": "The place has an old-school restaurant vibe. I wished the tables were a bit farther apart from each other; it felt quite packed and the tables being round didn't help. We were seated right next to the bathroom, and they were always people waiting to use it. All this just didn't quite create that level of comfort I sought.\n\nThe food was pretty good. Maybe the lasagna was overhyped for me but I did expect it to have more texture, with its rosette patterns and the top being broiled. Instead, it underdelivered on texture. If you're used to sautéing slices of day-old lasagna to make them crispy, you may be disappointed like I was.\n\nWe didn't try any mains. We only tried the pastas and they're creative and delicious. This place is definitely worth the visit."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkSFREZFlVRTVEUjFweFNWUnNNekZxYTFoNmJFRRAB",
            "text": "We had the Chrysanthemums salad to start which was very cheesy for a salad. The Sourdough Pasta Cacciatore was nice without being amazing and the lasagne for  two was good, my partner enjoyed it due to the nostalgic flavours of a homemade lasagne. We had to try Black Cocoa Tiramisu  which I do enjoy because of the rich chocolate flavours."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPZmpsdmprMzhDcEFnEAE",
            "text": "Getting a reservation here was not an easy task, but absolutely worth it. Their chrysanthemum salad and lasagna dish was even better than I expected. I also tried the Japanese sweet potatoes and stuffed garlic flatbread. Everything was delicious! Don’t forget to save room for their tiramisu, best I’ve had. Thank you Nick and Dennis for Great service and shoutout to the bussers and runners for elevating our experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxUVdsVTVXbmN5ZGxJNE1HOVhWbEJyZFd4UGJWRRAB",
            "text": "Don Angie was everything we could have hoped for! We were lucky enough to catch an online reservation 1 week before my birthday trip to NYC. We are from southern Michigan. We started with the Chrysanthemum salad. The taste, the crunch, the cheese and dressing!! Everything!! Do not skip on this salad. The Buffalo Milk Caramelle pasta was to die for! We opted for the Lasagna and sweet potato side (sooo good and crunchy) . For dessert we topped it off with the Peach Basil Sorbet and Tiramisu (yes the cornflakes are true). Every bite, every service interaction, was 10/10! Highly recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205ek5EUnBkR3RDWTJOQlRYaEVNVkpNUTBacWFsRRAB",
            "text": "Absolutely phenomenal food at Don Angie. We went in expecting a good but overhyped spot and walked out with an all-time top 5 restaurant. Service was incredible — Bobby was very friendly and accommodating for our table alongside giving many recommendations.\n\nFirstly the drinks were amazing. It won’t be as good as dedicated top speakeasies/cocktail bars, but much better than any generic cocktail lounge. Tied best espresso martini next to Dante’s.\n\nThe chrysanthemum salad was very unique. The leaves had a sweet and floral taste and the dressing prepared for it paired well to add a bit of extra base. The garlic flatbread was honestly the highlight of the meal: the cheese melts in your mouth and the flaky bread becomes one flavorful orb are you chew it.\n\nThe pistachio pesto pasta was amazing. The sauce was acidic/citrusy with a savory, but not overpowering, pesto flavor. The pasta itself tasted and had texture of noodles freshly made.\n\nI’m not a fan of gnocchi but this one literally dissolves in your mouth (barely any chewing required). However the sauce it was cooked in literally unlocked a new flavor for me that I had never tasted before. It is hard to describe: something like creamy, full-bodied, and herby.\n\nTo finish the meal, the black cocoa tiramisu was heavenly. Not overly sweet at all with a  deep cocoa flavor. The cantaloupe sorbetto was also a great dessert for a hot summer day — and on the sweeter side contrasting with the tiramisu."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210V1FWbFpVVkZoYkRBNE5sZzJPVFJ5U1hWVVJHYxAB",
            "text": "The best lasagna I have had! I really liked the food and understand why it is so hyped. The beer was not draft, but still okay and the salad was also unique and good. Highly recommend if you can make it in!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKUE1oWkdqX003YTNBRRAB",
            "text": "ngl i was really skeptical after an extremely mid experience at carbone, but came here for lunch and it was such a good experience !!! service was fast and the noise level was kind of perfect\n\nlasagne and tiramisu were some of the best i’ve had, i def see the hype\nthe chrysanthemum salad was also shockingly good.\nflatbread was decent\nthe rest of the pasta dishes (gnocchi and chicken thing) we got were fine but wouldn’t get again.\n\nwe came in a group of four and didn’t do drinks, and it was like $60pp"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMdjN3dDZ1cUppczN3RRAB",
            "text": "Incredible spot for dinner or lunch, just be ready to feast!\nLasagna is a must - but every other bite I’ve had has been incredible. The salad and steak are some other favorites of mine.\n\nBe sure to book a reservation."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNGJERHFnRRAB",
            "text": "I happened to nab a Don Angie res at 2 pm on Sunday for 10:30. This is good. It’s a toss up between torrisi and this for my favorite Italian. We got the chrysanthemum salad, garlic flatbread, buffalo milk caramelle, sourdough pasta, steak Al limoncello, lasagna and sweet potatoes, Peach sorbet.\n\nEverything was delicious. The salad was a cool take on Caesar which I love, the flatbread was light and cheesy and steak was citrusy, fresh and juicy. The lasagna was really good nothing I haven’t tasted before. The presentation was cool and the pasta was a better quality but flavor wise it didn’t taste very different to homemade lasagna. The sweet potatoes was the most shocking. I hate them normally but it was really good so must order in my book. The pastas were really good but I actually preferred the sourdough. The caramelle was very cool looking and interesting tasting but a bit sweet to me so  not my favorite. Definitely would go back. The sorbet however was a total miss. Not creamy, very icy and tasted a bit savory with the pepper. Highly recommend skipping. Next time I would try that lobster. Service was really good and they let us eat a half hour early."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJV2lxNTJJMU1Icm5nRRAB",
            "text": "Finally scored a reservation at Don Angie after MULTIPLE attempts! They’ve switched back to OpenTable—reservations drop 7 days in advance at exactly 9AM, so set those alarms. I snagged a Sunday 4PM spot, and surprisingly, the restaurant was pretty empty. Honestly, it seems like walk-ins are very possible.\n\nThis is a solid 4 star spot for me. I genuinely loved every appetizer we ordered:\n• Stuffed garlic bread – Rich, creamy, and loaded with garlic. An absolute must order!\n• Chrysanthemum salad – Totally worth the hype. Crisp, refreshing, and the shaved parm adds just the right touch.\n• BBQ calamari – Tender, flavorful, and served with crispy rice for the perfect crunch. Loved this!\n\nMains:\n• Grilled pork shoulder – A bit dry and the beans just didn’t pair well… The pork was a bit bland.\n• Lasagna – The famous lasagna… I was really excited to try and wanted to love it but I have to say it was a letdown… The Italian sausage bolognese was overly salty. It was underwhelming!\n• Charred broccolini – Decent side, meh.\n\nBut let’s talk about the tiramisu—WOW. Easily the best I’ve ever had. Not too sweet, perfectly crisp layers, and that touch of sea salt? Chef’s kiss!!\n\nWould I come back? Hell yeah! I’d return just for the apps and dessert alone."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKRDl4cml1NnFXZWd3RRAB",
            "text": "We sampled a couple appetizers, 4 meals, and the cauliflower and everything was delicious!!! Highly recommend the Chrysanthemum salad, it is similar to a Caesar, but the lettuce is so unique. The lasagna is a must and if you have room, you have to try the Tiramisu!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OTll6VmZTMjFGZFVzMVEwTklhMEpCZDA5eFNtYxAB",
            "text": "The lasagna and the chrysanthemum salad were delicious. Was able to secure a seat at the bar doing a walk-in just a bit before opening. Friendly staff."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5aVpYTkdPRFJPUmxCa01HRjFiVGs0V2pFeE1VRRAB",
            "text": "We came in at 4:50 and were able to get seated right away. We had the scallop crudo, lasagna for 2, garlic bread, and pork shoulder. The scallop crudo was the perfect balance of sour, sweet, and savory. The pork chop was slightly dry in some areas but had a good flavor. The lasagna was good but wish it had more noodle in the noodle to sauce and cheese ratio. But the buttery garlic bread that came with it was the perfect compliment for the extra sauce."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMR0N0ci1YbGFyRktnEAE",
            "text": "The strong highlight here was definitely the buffalo milk caramelle, it was such a unique, stunning, and delicious dish. Everything else, however, was just very “okay”. While it didn’t meet the expectations set by its hype and the difficulty securing a reservation, it was still a positive experience overall."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfbXNxWDlBRRAB",
            "text": "With Don Angie’s reputation, the food should be life-changing. However, it was really just…good. Not great. First, the restaurant is SO loud and the tables are incredible close together, someone next to us getting out bumped into our table. Yes the salad was good but way too much cheese. I know the salad is known for being covered in cheese but it doesn’t add to anything. The sweet potatoes were good. The sauce should’ve cut the sweetness but added to it, making me only want to eat a couple. Either use a different sauce that’s more acidic or regular potatoes. The steak was easily the best thing we had, but again, did not need the sauce and was good on its own. The lobster was good and to us the lobster pasta/meatballs stole the show. But it actually had a little spice. Everything else needed something or had too much sauce/cheese. Maybe I’m a purist, but we felt the restaurant was just trying to hard and the natural flavor of the dish was hidden. Tiramisu wasn’t anything special."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUN2JlUUR3EAE",
            "text": "4.9 stars!  The chrysanthemum salad was the bomb! All of our dishes were great including the BBQ calamari, lasagna, mussels, and sourdough pastas. We had all three deserts offered and they were fantastic too— especially the strawberry sorbet. It was simply the best I have ever had. Our server was delightful and efficient. I’d consider this a can’t miss."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGb1VtNUhTSHBVTWpSQmRFaHdVbkZ2UzJrMlZuYxAB",
            "text": "What more is there to say? Don Angie is an iconic restaurant in the West Village that lives up to all of the hype. From food to service to atmosphere, everything is on point. I highly recommend the garlic bread, salad, sourdough pasta, and garganelli. Really, you can’t go wrong here; even the steak is delicious."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWeUxXMVBWamxMTkhBeE9TMHlXbXh2TXpsUFJFRRAB",
            "text": "8/10\n\nSome dishes were amazing like the chrysanthemum salad, a mix of crunchy, fresh and citrus in every bite. Would go back for that.\nThe Garganelli Giganti is amazing with fresh al dente pasta and tasty meatballs.\n\nI had ordered the steak al limone before and this time we didn’t enjoy it as much."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNE1hTnBnRRAB",
            "text": "Excellent Italian restaurant.  Pastas were amazing but the salads were even more memorable.  Rolled Lasagna was really impressive but we liked the black and white pasta even better.  I never seen chrysanthemum salad in any other restaurant but this unique salad should be on more menus.  The whole menu is pretty unique.  The peach salad was really on point too.  Highly highly recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KVWVVaFJUVnB3ZWpOdmJISkhaVVl0VkRod01GRRAB",
            "text": "10/10\nI loved San Sabino so had to try Don Angie.\n\nStuffed garlic bread: this was alright, I wouldn’t get it again because there was nothing special about this dish.\n\nChrysanthemum salad: one of the best tastiest and tangiest salad. I loved the tang and the cheese combo of the salad, would order every time I visit\n\nBuffalo milk caramelle: I wish we got two plates of this. We were a table of 5, and I could have an entire bowl for myself. The texture was perfect, and perfect blend of sweet and not too sweet.\n\nGarganelli giganti: this was too similar to the lasagne. Both tomato based taste and it was okay. I didn’t think it was anything special but a very classic Italian dish.\n\nOur lasagna for two: very delicious and I would also get this again and again.\n\nBlack cocoa tiramisu: not a traditional tiramisu as it is more flakey, but I would eat at don Angie again just for the dessert"
        }
    ],
    "reviews_count": 84
}