{
    "name": "Marumi",
    "place_id": "ChIJM_hKtpFZwokRBMH-ozSrBNQ",
    "grid": "MN2",
    "address": "546 LaGuardia Pl, New York, NY 10012, USA",
    "rating": 4.5,
    "user_ratings_total": 304,
    "phone_number": "(212) 979-7055",
    "reviews": [
        {
            "date": "23시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201NmRFcFZSM3BNTFhsblVVaHBSbXBGZEZGdldHYxAB",
            "text": "A classic in the Village. I used to come here almost 20 years ago, when I lived in the city, and I am happy to see that they keep the great attention and the old vibes. I especially like to sit in the backyard, that gives a sense of isolation from the city. Today I reencountered this favorite sushi place and everything is almost intact: the real japanese style and decoration, the quietness, the food and the attentive service. I hope I will keep coming in my next visita to the city."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NNU5uVjBUWFpKZEhoWFYwUm5SRFpOYzA5dmIyYxAB",
            "text": "Best sushi in NoHo. Food is always fresh and the staff is courteous. Lunch special is cash only but worth it if you need a quick sushi meal in the middle of the day."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGUlZUSm1lVTl2VFZCaVVUZFRWMU55T1MxVFlXYxAB",
            "text": "Inexpensive sushi, and the lunch sets are nice. A cozy little spot by the park. The nigiri was very good but the rolls a bit too ricey for my taste. Cash only!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOaVdHOTBZamRyU1d0ZmFreEdVVlpDU0ROQk5VRRAB",
            "text": "Got some good beers and loved that they have some cool vegan rolls."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGRFF6TlFTV3hwVVZWcVlXVmxWbVYyVEdOTWNGRRAB",
            "text": "We enjoyed our time here Marumi. Someone in our party has a sesame allergy and she made sure what he irdered was safe to eat. It's a small hole in the wall type restaurant but they make you feel welcome as soon as you enter."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOWEyM0JnEAE",
            "text": "Yummy"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tocldscHZjVTFuT1ZWM1ZWVTJTa0Z1UzI5aVkwRRAB",
            "text": "Yummy food warm service definitely recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKS2QzQkJUbU15UlhKTVNIcFRVVGxTTVc1UGFrRRAB",
            "text": "After a long day of sightseeing,  it was great to be seated right away and the dinner was delicious.  The service was great."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WbVdDMTFlalV5TXpONVEyeEdOWE55YkdKUE5GRRAB",
            "text": "We had such a wonderful experience at this hidden gem in the Greenwich Village / SoHo area. Having just returned from Japan, we were blown away by how authentic and delicious everything was. The atmosphere is cozy, charming, and genuinely Japanese — it truly transports you.\n\nWhat really stood out, beyond the incredible food, was how honest and reasonable the pricing is. In a neighborhood where most restaurants are constantly raising prices, this place feels refreshingly grounded. We later learned the owner is from Osaka and has been running this restaurant for nearly 30 years — no wonder it feels so real.\n\nWe’ll definitely be back regularly. This spot is seriously underrated and deserves much more recognition. A true gem! ❤️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMaTRtcG5wdmJ2d2ZnEAE",
            "text": "My fave sushi place in the US so far! (I’ve moved here for over a year)\nFresh and yummy!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcGM3MGRREAE",
            "text": "Amazing food and cozy atmosphere!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJejh6Z1pREAE",
            "text": "Low quality fish for a medium price. Catering to tourists who don’t know any better"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJd00tYkxREAE",
            "text": "affordable & great quality sushi. love the sake & tea options. it’s always so relaxing and soothing in here, 10/10 recommend for date night with your significant other or with a friend :)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRMDYzYW9nRRAB",
            "text": "I’ve been coming to Marumi for years. Right now I’m sitting down to a plate of chicken Katsu, which is excellent."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdEo2X1JnEAE",
            "text": "Best sushi I've had in NY, which may not seem impressive given I haven't had much sushi here, but I've spent a life having a lot of great sushi in Seattle so my standards are high. I hadn't heard of this place, but we popped in for a late dinner.  Great space, very classy interior, just look at that picture, look how shiny and warm the wood looks. Anyway, I had some miso and split the Sushi & Sashimi for two with my dad. Not cheap, but well worth it for the quality, plus they don't skimp on the serving size. The fish was so good. Oh my god. The salmon?? The MACKEREL??? Probably added at least ten years to my life. Exceptional quality, the rolls too, all of it. All the staff were wonderful, they all said goodnight when we left. 10000/10. I'll be dreaming about it until I return."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQdy1PbEZnEAE",
            "text": "Have been eating here for many years.\nLast night went with a group of 6 and 2 people got sick from eating Sushi Jo.\nAfter eating 3/4 pf their meal we saw tiny worms on the plate.. apparently a roundworm.. can happen when fish is not handled correctly.\nMarumi staff was apologetic snd comped the meal.\n\nBut damn.. scary. Luckily i do not eat fish myself."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQbWJ2T25RRRAB",
            "text": "Good quality sushi in a pleasant, unpretentious setting. The sashimi was fresh and tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYemNqRmVBEAE",
            "text": "Great service + atmosphere, fresh & delicious sushi."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYZ2ZDUGVBEAE",
            "text": "We’ve been coming here for many years and it always delivers. We love marumi!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMXRmQUZ3EAE",
            "text": "We like the unadon. Give it a try if you like sweet food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIanNyam9nRRAB",
            "text": "Just perfect, excellent sushi, atmosphere, and service. Family friendly as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdUxtTnJRRRAB",
            "text": "Awesome sukiyaki, sushi, soft shell crab, age tofu, and miso soup. I would definitely recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bzlqQ05REAE",
            "text": "The peefect place. Quiet music, polite service, awesome dishes. Thank you!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3OWFEaU1nEAE",
            "text": "delivery arrived packaged totally sloppy and beat up as in picture, disappointed based on reviews"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3NHV1aWlnRRAB",
            "text": "Fish quality is quite bad, and some sashimi doesn’t taste fresh"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidVBhbXl3RRAB",
            "text": "Best unagi don in town"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMOU52TVlREAE",
            "text": "The place had a good vibe and the food was decent too but the staff were despicable, I couldn’t tip cause I only had 100 dollar bills left after the bill so after paying I went out of the place that’s when the waitress started following me and demanded a tip. I had to get my 100 dollars changed then tip her"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtZ29LSXBRRRAB",
            "text": "Great quality sushi and sashimi."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMOVA2bi1nRRAB",
            "text": "Sushi is fresh and good cuts. Most of the fish is what you’d expect of a decent sushi place, but the toro exceeded my expectations. Really great value for the menu price. Definitely coming back again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUNjRQdVl3EAE",
            "text": "my family and i come here pretty often. the price is really good for the quality of food. we usually get the spicy sashimi salad, spicy scallop roll, and some uni appetizer and miso cod. they ran out of uni this last visit so i ordered a la carte nigiri. cousin ordered an eel bowl with egg and soup and veggies that turned out to be pretty tasty. it’s a solid sushi spot that isn’t heavy on the stomach or too heavy on the wallet"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqcGVYZDVnRRAB",
            "text": "Japanese food cooked by Japanese people.  I’ve been dining here for nearly two decades.  Nowadays New York is a sixteen hour flight away, and no matter how long I am in town for- Marumi is always on my menu.  It is this warm anticipation that everything will be just perfect that pulls me back every time.  Hope our next encounter will not be too far away."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREaGRmZFhnEAE",
            "text": "Nice little restaurant with fast service and pretty good sushi."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4ME5hYXF3RRAB",
            "text": "Authentic, amazing, and perfectly priced. Soooo rare to have a restaurant maintain perfect and unwavering quality over my whole lifetime. The food, drinks and atmosphere are ideal"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEcUwzUE5nEAE",
            "text": "Neighborhood staple for 30 years"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0ekpTTUdREAE",
            "text": "This is the best sushi + HOMEMADE HANDMADE MISO SOUP IN THE CITY!!!!\n\nNever disappoints I love this place with a passion."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0ek9DSEFnEAE",
            "text": "Best Japanese food around NYU"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxOU9tZFRnEAE",
            "text": "Delicious and affordable! Their toro is insane!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWNC1QQUl3EAE",
            "text": "Came in last night for a last minute dinner for our last night in NY. Food didn’t disappoint nor did service! Everything was great up to quality to price point!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNscGFtTFd3EAE",
            "text": "Great spot. Good prices. Quality fish. Recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1LXNUcEhBEAE",
            "text": "good food, nice atmosphere, fair price!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNab2FuTGZBEAE",
            "text": "Actually the best non-Omakase sushi I’ve ever had in NYC. The salmon is absolutely divine."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMklPTGVnEAE",
            "text": "Walked in on a weekday for a post work dinner. I ordered the chirashi bowl and was pleasantly surprised with how much fit into this little bowl. The prices are about average for NYC, but the food is made well. The outside area is pretty cute too, but service was a bit limited out there."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMDRqR1R3EAE",
            "text": "Been here since early 90s - always great sushi"
        },
        {
            "date": "2년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwX0s3Y0V3EAE",
            "text": "Tolles kleines einfaches neighborhood Lokal mit leckerem Sushi und günstigen Preisen."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNVlyQVZnEAE",
            "text": "An amazing gem in the neighborhood. Cost wise it’s reasonable and everything here is excellent. I’ve been coming for over ten years ever since I had a job in the area. I will go out of my way to go here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbmN2QkRREAE",
            "text": "Just awesome!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeVpHcWJnEAE",
            "text": "Extremely good sushi at completely reasonable prices. A neighborhood gem, beloved of the locals. Half the menu is interesting non-sushi Japanese dishes; there are also seasonal specials (especially in the cold months). Friendly and attentive service. I go here almost every week!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NzRmSEJBEAE",
            "text": "It was so pleasant and our serve Marie was so fun and gave great recommendations!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2bmVfSGhBRRAB",
            "text": "Oldie but goodie!! My go to sushi restaurant in NYC since my college days..."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdkphdV9nRRAB",
            "text": "Decent sushi."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJaHJHdlNBEAE",
            "text": "Heart-warming, authentic Japanese food. As soon as I walked in, I heard Japanese spoken among waiters, which goes to add to the place’s credibility. Fast, efficient, and friendly service, with food that was deeply flavorful, seasoned perfectly, and executed well. The place is a bit cramped, but worth the trip and the wait."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURleGVia0ZnEAE",
            "text": "This place is our go-to for sushi night! We are Japanese, and even from our perspective this food is amazing and authentic 🤤 The service is amazing and the ambience is also great! Feels cozy and perfect for a laid back dinner.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXNkxfcGh3RRAB",
            "text": "We stumbled in on a sunday evening and was seated immediately. The setting is super intimate and quiet, so good for a date night! We ordered the sushi for 2 and it came a great selection of food! Everything tasted very fresh. The service was attentive and quick."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNXy1hM2xnRRAB",
            "text": "Amazing Japanese restaurant located near NYU Bobst library. I’ve been here twice and every time the food was amazing. One thing though, they only take cash during lunch (which I don’t really understand) so don’t forget about that. Amazing restaurant, I will definitely be visiting again soon."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3OFBHRk5nEAE",
            "text": "Food quality is average, but for the price in this area, Marumi is a steal. Sushi is standard. Classic Japanese comfort food options in the udon and grilled meat and fish options. I love love love nabeyaki udon and this is one of the few…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPOVozaU9BEAE",
            "text": "Great value for quality sushi! We were sat immediately on a Sunday night and I ordered the Sushi Nami (5 pieces of nigiri and 2 rolls) — it was affordable and all the fish was fresh. Would definitely come back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXNHIySWRnEAE",
            "text": "Nice cozy restaurant. Not too loud and perfect for an intimate dinner . Sushi was great and very reasonably priced."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlc2F1cDJnRRAB",
            "text": "The food itself was amazing!! The service was sooo kind and quick!! We will come back"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURROVAyTEdnEAE",
            "text": "Mom’s favorite Una Don (Boiled BBQ Eel ove rice) lunch in NYC.  I love the friendly service and simply good traditional dishes (mostly eat there for lunch) 🥢…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBaE1xR09nEAE",
            "text": "My favorite place near NYU…… Good food in general, and price is cheap. Sushi and Sashimi are not that great but considering the price…… good enough."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXcDVYS3dBRRAB",
            "text": "THE best sushi i had in manhattan\nTry “chef’s shushi platter” you wont regret"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVbGZlZndRRRAB",
            "text": "Food was great. Service was slow when we went (Aug 20, 2019)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPNDdTa0dnEAE",
            "text": "Decent options! We ordered the sushi/sashimi for two. Highly recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPcUxlRlFREAE",
            "text": "Quiet and intimate choice for Japanese food, likely my neighborhood favorite. We've ordered everything from sushi to sukiyaki over the years and they've always nailed it! The food was rich, flavorful, and doesn't miss a beat. Prices are…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1ajhpTktBEAE",
            "text": "One of the best Sushi places!!!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzNWRHcTV3RRAB",
            "text": "We've tried  many Japanese restaurants in the city and this is our go-to for casual Japanese dinning.\nThe food is fresh and, since the place run by Japanese, authentic.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCbklTTEJREAE",
            "text": "This is the place that me and my wife come to or Friday to sit down and have a bite to eat. The service is excellent in the food. I can’t find it right now to see how great it is but I enjoyed myself every time I’m there. I prefer one person to wait on me and I prefer hot all the time being that I haven’t seen the Boston solo at the place."
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMEkzbnV3RRAB",
            "text": "Excellent sushi for a reasonable price! Have been to Marumi many times over the past ~7 years since moving to the area. Always highest quality fish and truly amazing sushi/sashimi! Could compare to Blue Ribbon quality-wise, however, the price is much more reasonable. Highly recommend!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRMEwzNDNRRRAB",
            "text": "Quite good. I had lunch with a friend. We sat at the sushi bar. I had the sashimi bento box.\nEverything was delicious and the presentation was quite nice.\nMy buddy is a regular there. So he enjoyed it.\nI've never had dinner there but my pal says $75-$100 per person is about average.\nNo starving artists here!\nI will check it out again"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRdmYyX0ZnEAE",
            "text": "The foods are good. The service could be a little better. I ordered an appetizer and two rolls. They brought the first roll after the appetizer. After I finished it, they brought the bill before I was even presented with my second roll. I…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1cXJmbmtRRRAB",
            "text": "Classic bait and switch. Avoid!!! Some reviews here are probably fake or old from the previous management.\n\n\"Wagyu\" was just regular beef, dry and a tiny amount. Glass noodles were cooked hours ago and were stuck together. Plus some basic steamed vegetables. The only flavour was a drenching of soy sauce. Miso soup was from a dehydrated instant packet. Seaweed salad didn't arrive.\n\nThey are here to just profit of the old reputation."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRN3U3d2t3RRAB",
            "text": "Marumi is-or seems to this Westerner--authentic. We often cross Japanese people there enjoying their meals. The atmosphere is calm and simple and the prices are reasonable. We enjoy the sushi, tempura and plum wine and will return soon to this pleasant establishment."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnOXBIakJnEAE",
            "text": "Not bad. Not the greatest. Simple yet elegant. Good service albeit a little slow when things get as little busy."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRN3FXWmt3RRAB",
            "text": "Went to dinner there a few nights ago.  The food was very good.  The miso fried pork belly on the menu caught my eyes so we ordered that.  It was good but not what I had expected.  It tasted more like a thick cut bacon, a little on the…"
        }
    ],
    "reviews_count": 74
}