{
    "name": "Loring Place",
    "place_id": "ChIJ69NaKJdZwokR3CamunXyYig",
    "grid": "MN2",
    "address": "21 W 8th St, New York, NY 10011, USA",
    "rating": 4.6,
    "user_ratings_total": 1118,
    "phone_number": "(212) 388-1831",
    "reviews": [
        {
            "date": "수정일: 4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kNk1FTTFjMHBsWkVSME9VbHhhRGhRVURJNGVWRRAB",
            "text": "Hip atmosphere, great service and tasty food."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCd2RXOWlRME5CWkRKblh6UnhZVEp3VkdkclZIYxAB",
            "text": "Delicious, can be loud but excellent veggie selections and well cooked, seasoned fish. Loved it!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxM05tZGZTR2Q0Y0RsbWEyOVRNWE5hUTIxV1RYYxAB",
            "text": "I went to Loring Place last night for my birthday. It is my favorite restaurant in the city. I have been several times.\n\nFrom the moment I walked in the door I knew it was going to be a special night. The restaurant was packed and they offered me a drink right away as they were running no more than 10 minutes behind.\n\nThe food, the atmosphere and service were all top notch. Since I am in the wine business I got to speak with Hendrick the house sommelier. He told me about all the great wine he is bringing in as well as creating new and interesting cocktails. He was such a nice guy.\n\nFrom the Fish to the Broccoli salad the food lived up to the hype and then some as it always does.\n\nAs someone who is in the hospitality business and eats out all the time, Loring Place has my highest recommendation.\n\nChef Dan Kluger has knocked it out of the park once again. I can't wait to go back. Such a treat.\n\n-Chad"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsM1ZYUktRekV5WDJjMmNETjBOSFJHWWxOVlRWRRAB",
            "text": "Beautiful decors, very interesting flavours on generally healthy dishes, attentive service. A little pricey but worth it.\n\nI really enjoyed the beets and the burger. Other salads were good. Humus and pita are nice but overpriced for a single pita bred and some humus."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vMWEyNTViVTExWVdSQ1Qwc3lTREJWVWxsWFpHYxAB",
            "text": "I think I hate farm to table restaurants like Loring Pl.  Don’t get me wrong, I appreciate freshness but flavor-wise very lacking.\n\nI been here a few times and first time got short rib which felt underwhelming and quite forgettable.  Another time got their popular burger and while most patrons seem to enjoy it, not so much for me.  It’s one of those burgers where grease just comes pouring out with each bite.  That’s gross for me.  Too much bun, too.  When bun is bigger than patty, that’s a problem.\n\nI was gonna try their pizza another time but I’m not sure that I wanna come back since food just too bland and boring for me."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taQlgzQXhSVFpDT1VoM1J6VkxNRkp5Y0ZWeFZWRRAB",
            "text": "Wow, what a treat. Loring Place is the perfect balance between modernism, comfort, progressiveness, and homely, all at the same time. This seemingly impossible yet perfect balance can only be felt, starting from the interior and the decor, to the server interaction, all the way down to the focused yet sophisticated menu. Loring Place oozes of modern-day charm. Not snooty. But classy. Not awkward. But familiar.\n\nThe food is an Californian / American cuisine where you have a mixture of great appetizer concoctions, fabulous salads, creative pizzas, and a solid variety of main course. There is no theme other than probably what came to the chef's mind. The Fall Seasonal menu had a generous mix of butternut squash and chili infused into many of its dishes. Again, no dish was simply mainstream but also not overly complicated. And each one of them definitely had a perspective. The chef doesn't just play it safe, but rather chooses to test you if you dare. And you are handsomely rewarded for it. The list of ingredients may raise your eyebrows but soon all is understood as you spread the flavors in your mouth.\n\nPretty much everything was phenomenal. The ricotta cheese with butternut squash was wonderful and paired amazingly with the sour dough bread. The salad was rock solid and this slice of chili really added a welcome twist. The Date pizza was such a joy while the short ribs was soft and succulent. All the dishes were absolutely made with care, just like the decor, just like the service.\n\nLoring Place is a joyful place. It's not boring, yet it wants to be subdued for all the right reasons. This is a place where you can come over and over again, knowing you'll have a good time, but not worry about the superficiality of trying to be fancy.\n\nEverything is right here. Go enjoy."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ORVF6ZFdkRkJaVkhWQ2MwdzROa1ZVYjA1alRWRRAB",
            "text": "We walked in after a couple leaving told us we \"had\" to eat here! A group of 4 with no resy, we were lucky to be sat quickly. Shared the cauliflower,  fish and chips, butternut fries. All was good but the grilled Artic Char... I will go back just for that dish!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ORWJHYzVla1ZxVVhkNlN6UjBObmhQYkU5elpsRRAB",
            "text": "My husband and I grabbed a couple of seats at the end of the bar last night. The bartender was warm and very attentive. We started with the crudo, which was absolutely delicious. I wanted more of it! And then decided to split the Short Rib & Grandma’s pizza. We were pleasantly surprised by how much we enjoyed the pan pizza since both of us usually prefer a traditional thin crust. It was really good. We shared everything and appreciated the smaller portions.\n\nThe space has a great vibe. It was exactly the feel and the meal we were hoping for on our last night in New York. I’d definitely go back and recommend it to friends."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaME5IZFBjMlpITkZkTVpVYzVkWGh1VUVJMlQyYxAB",
            "text": "We were blown away by the food and service.\n\nHuge recommendation for everything we tried:\n- zucchini fries\n- baked ricotta\n- roasted short rib\n- bbq chicken\n- cookies\n\nThe corn that came with bbq chicken was out of this world. We will attempt to recreate it at home lol\n\nThank you for making our anniversary so special ❤️"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xacGRVdFdNMmxWWW5nM016QkNabWwyY1VkUFRYYxAB",
            "text": "We have eaten at Loring Place many times and their chef’s creativity and consistency keep us coming back. The staff is always professional and friendly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vdGJHeE5RVUY0UVRNek0waFhNMFZDWms5a1dWRRAB",
            "text": "Outstanding!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwV1ZIcHZTek5GUTFCelRFMW1kbHBIYUVsalRWRRAB",
            "text": "The squash blossom pizza was unbelievable!!! Great for a larger group during the week"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toeE4xaEVNelJVVDFCd2FXODBSMjVZTTI1Zk1IYxAB",
            "text": "Burger was medium-well even though we both ordered medium-rare. The buns were burnt (completely black on the inside), while the bacon was incredibly soggy & limp — no crisp. How do you mess up a burger so badly? Can’t recommend this to anyone."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poa1ZVMUhNVXczUXkxUWJtWlFVSGxoUWpBNU4zYxAB",
            "text": "A cozy-elegant restaurant with a quiet, relaxed dining room. Much of the menu is naturally gluten-free, and the staff are knowledgeable about GF and dairy-free needs. We shared fresh tapas appetizers (tomatoes, eggplant, broccoli with crudités for me), mains of BBQ chicken, elegant pizza and Arctic char, and finished with coconut sherbet & almond cake. Delicious — I’ll be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSFUxUnVWSG8yWlRSV2JrWkhhME5DYkRrM1VtYxAB",
            "text": "The food was great, and the service was exceptional. Would have liked more options on the menu."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfeHNiZ1pnEAE",
            "text": "This is one great New York restaurant that understands real hospitality as well as GREAT food. A true gem."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUVlVUkJPRmhITFZGRVQzWm5lVU5tUzBKeE1WRRAB",
            "text": "We have not spent time in the West Village for many moons but were heading to the area to catch a movie and found this lovely restaurant on yelp. While it seemed some of our haunts from our younger days could be options for a pre-cinema dinner, the menu at Loring caught my eye - especially the salads and whole wheat pizzas. The atmosphere, service and the food which had enticed us to give it a try was exactly what we were looking for! My husband is not usually a fan of fruit in his salad but took my lead and loved the grilled strawberry salad! We opted for pizzas for dinner - the more traditional grandma for him and the corn pizza for me - delicious! (Next time we'll get to the larger plates on the menu!) We also loved the vibe - couples, families, larger groups - which made it feel like we had stumbled upon a neighborhood gem! We put this restaurant on our list of places to return to when we are in the city and to recommend to friends and family!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rNFQxaDBaa2RJZDJ0cWNWa3pPRlZJWmpOb1JHYxAB",
            "text": "Consistently great evenings at Loring Place and for us that's been years now. Across the menu the short rib, Arctic char, even grandma pizza have been favorites to get every time so be sure that you have four or more people to try a lot of thinghs"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KMFNFMW9TR1pWVDJwaFIwaHhUMDgzV2xsWGRGRRAB",
            "text": "This is an above average spot but nothing worth rushing to. Burger was medium well even though we ordered medium, and the grandmas pizza was decent. The crudo/ceviche was probably the best thing on the menu. Seemed like they only had one person serving for lunch."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nMFdrcG1lbGR4Y0dWbFoxbE5iMVF0YnpSR1VrRRAB",
            "text": "We went for brunch. The cocktails were divine, the food outstanding and the service excellent!"
        },
        {
            "date": "1달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxeFdUSjFkMlZvVTJOR2FUVjVjMG8zYjNoQk1XYxAB",
            "text": "Nette Lokalität , sehr freundliches und zuvorkommendes Personal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRk56QjZPRGw2TlY5b1RtTlZkalpUT0RGcFkzYxAB",
            "text": "We were 12-15 people. They put us in a private room. The staff was outstanding and incredibly kind. Your place for a group dinner (and non-group dinner)!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsclpuSkZkRVZ2TnpWWFozbHJVWFpvYlZGRFYzYxAB",
            "text": "Emily and Stewart were the best part of my birthday. They made it such a beautiful birthday experience. The food was also 10/10 but service was 12/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RMGFIRkpjRXd3ZFZveE1WTklkMVppVkVFM1dVRRAB",
            "text": "Our server Bri was amazing!! We loved all the food especially the Tuna Crudo. Great experience!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sYWJuWktaRWhRWmtObFh6TmZhMHA1TW1WNFZWRRAB",
            "text": "Exceptional customer experienc and amazing service. Santiago is a rock star."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201MGFYTmxPV293U20xRmVFZEllV2RTZVc1Vk9HYxAB",
            "text": "Loring Place is absolute perfection! The food is OUTSTANDING - every bite is a masterclass in flavor and technique. The wine and cocktail menu is SO on point, with innovative pairings that elevate each dish to new heights. But what really sets Loring Place apart is the service - the staff are knowledgeable, friendly, and genuinely passionate about what they do. And the ambiance? Inviting doesn't even begin to cover it - it's like stepping into a stylish, upscale oasis. If you're a foodie (or just someone who loves amazing food), Loring Place is an absolute MUST-VISIT."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aS1pFWlFOMjVuTVdoWWFuVlBWbU5FUWxONVMyYxAB",
            "text": "The restaurant was an outstanding and memorable experience. I had originally planned to celebrate my brother-in-law and his girlfriend’s birthdays here with them, and I was also planning to go with my husband. Since my brother-in-law was not feeling well, it ended up being just the two of us, and we could not have chosen a better place. From the very first warm welcome from the host to the gracious goodbye at the end of the evening, everything felt special. The food was absolutely delicious, beautifully prepared, and full of flavor, and the wine was perfect. Our server, Daniela, was attentive, friendly, and knowledgeable. The entire team at Loring Place worked seamlessly to create such a wonderful atmosphere. Thank you for making our evening so memorable."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWVJsbzBjbVJvWXpoWWNrcFdNM0pqVkZGUmNYYxAB",
            "text": "One of the best restaurants in NYC.  Dan Kluger is a great chef and the staff is excellent"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNd0xYZzFaM2c1Um1scU9VRjBaR2RGVUVKdGRrRRAB",
            "text": "Did not have a reservation, nonetheless they found us a fabulous table up front for 2. Will definitely put back on my local list of places to dine.\n\nPS Had a rese at another restaurant near by and told us we needed to sit next to two very large parties and half the 4 tops we empty! Thus we went to LP"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WdFRISjFTMjU0YjB0MGFtaHROVEJUZG14Wk5tYxAB",
            "text": "Loring Place was such a special experience for us. My husband is a longtime friend of Chef Dan, and we were so happy to see them reunite at his restaurant. He and his team welcomed us with such warmth that we instantly felt at home. This casual American restaurant focuses on seasonal, wood-fired dishes, and everything was cooked to absolute perfection. You can truly taste the freshness in every bite, from the vibrant vegetables to the perfectly prepared mains. The combination of genuine hospitality and outstanding food makes Loring Place a spot we can’t wait to return to. Thank you, Dan, and all of your team for welcoming us, see you soon!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poUFlsaEtUSGRLVjNWelUwRkZPRFpaWmpadVZuYxAB",
            "text": "Outstanding food and excellent service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SUlYwNVZZa2haWmxSVkxYbG1WRFZYUkVSS2NYYxAB",
            "text": "an amazing experience!  go for the drinks!, go for the service !  go for the pizza's !!!!!!!!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RFVWOTBiVUpUVldneVZFTTBNa2ROUTFCTVNVRRAB",
            "text": "Came on a Wednesday with a resy for 3. By 7pm the place was packed, which surprised me a little because it was also a 95 degree summer day, and a weekday. I can see why it was packed… the food and service is exceptional. Started with the corn salad (if you like corn, you’ll love this) and the eggplant appetizer (I’m not a big fan of eggplant and rarely like it but this was good and comes with delicious pita bread). They also serve complimentary olives! We shared the squash blossom pizza and the gemelli pasta. Both were excellent. My main reason for leaving this review is as follows: I had brought small dried bouquets of flowers for my two girlfriends and arrived early. I was seated 15 minutes before they arrived and placed the flowers on their menus. I think it was a server but I’m not sure… she came by and asked if she could bring me water for the flowers! They were dried so it wasn’t necessary, but her thoughtfulness was unexpected and very appreciated! (Our actual server was also attentive and friendly.) The place is packed on a Wednesday night for a reason. I will absolutely be back at least a couple more times to try more of the food!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5UVZEVnBiRTB0U1VwUFdGQlBhWGh2YWxOWVoxRRAB",
            "text": "Honestly, one of the best values in New York. Dan Kluger’s food is absolutely amazing. Flavorful, delicate and inventive. You can easily pay twice as much and not get anywhere near this quality of food. Cannot recommend it highly enough."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wellWTk5VRkpFY21SelpHRXlRMng1TkVSclltYxAB",
            "text": "We had our 19th anniversary dinner at Loring Place last night and the team at could NOT have made us feel more celebrated. The food was delicious, the service was spectacular, the atmosphere was beautiful and lively. The wine selection was wonderful  and we particularly loved the ricotta appetizer, grilled strawberry salad, grandma pizza and vanilla ice cream dessert. What a perfect dinner."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1Q2NVTnFNRGhqWkU1elFrNXZabGxRVG05Tk1sRRAB",
            "text": "A lovely restaurant with cozy lighting and delicious food. The service is incredible, they go above and beyond to make sure you're comfortable and happy. Adding to my must-eat-at list for all friends and visitors."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJM1lYb3hNR2hNZW01VVdEbHNhR1kzZURORE5FRRAB",
            "text": "Loved this place! From ambience, to service to food, everything was impeccable and still low key and comforting."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKSVFUUmlWVmRJVkhGVlZsQk1SSGhWVTNwV1dsRRAB",
            "text": "Delicious, interesting food; gracious service and lovely, elegant atmosphere."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tadWNrTTVTRlI1ZUdwT2VHb3hPR0pzU1ZsZk4xRRAB",
            "text": "Visiting from overseas we arrived as random walk-ins, no reservation on a Friday evening and we were made to feel very welcome. We were immediately seated in a busy restaurant, the menu was brand new seasonal summer theme - innovative American food where the vegetables were the focus for us, although a sea bass main was absolutely delicious.\nThe team also surprised us with a corn, okra, mint, manchego and chilli salad that was outstanding.\nService was attentive and friendly without being cloying.\nThis unplanned meal ended up being a highlight of our 3 week holiday - thank you Loring Place for a lovely experience and memory!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oaVNVMURWbFJaYnkwek5IUm9XSFp3TTJkd00xRRAB",
            "text": "Food was great, highly recommend this place"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoanVlLVRREAE",
            "text": "Best spot in the Greenwich Village"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKWFFtTnpkbGxHWm1OVmVVdEdNM05XWldWM1JrRRAB",
            "text": "Delicious food and great service. Also loved the vibe. If you're a veggie lover, try the beets and broccoli salad!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poRmJIZDVkM0JPVFc1MlZrUk9jV1ZrTkRKRFJVRRAB",
            "text": "My partner and I stumbled on Loring Place years ago by chance and ever since we make it a point to return when we're in New York; especially on our anniversary. Over the the five years we've been coming the staff has been reliably kind and helpful, and the food fresh and inventive. The restaurant itself is a bit loud, but that's because every table is full. My partner and I both have food sensitivities which some restaurants struggle to accommodate, but we're never worried when we dine at Loring Place. Dining there is always a highlight of our trips and we look forward to joining them for dinner for many years to come."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJdk9qTG45bWNxa1FREAE",
            "text": "I want to give Loring Place a good review. I’ve been going there for years and it’s been consistent. I went for lunch yesterday however and it was really disappointing. The snap pea salad was so overdressed I couldn’t finish it, and my usual favorite appetizer the baked ricotta was oily and just tasted like scallions- even the toast seemed like it had been reheated (it was so hard I could barely bite through the crust). My friend got the French toast which was a single piece of toast (for the price, kind of ridiculously small) and he didn’t eat the crust either since it wasn’t softened by the egg soak. I know brunch isn’t a restaurant’s favorite meal, but it’s also such an easy way to make people happy with simple execution. Loring place, please return to form so I can keep recommending you!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOYjFtWnVDXzhYSmlRRRAB",
            "text": "The best drinks and food! We had a big family brunch here and everything was amazing. The lemon pancakes and roasted broccoli were my favorite."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JME1HTjFSSFY1UTBwMGIzUllXRTF3U0hoMFRVRRAB",
            "text": "Incredible seasonal menu, super attentive service, very vibey atmosphere. It’s a great date spot or a place to have dinner with the girls. Also had the best Riesling I’ve ever tasted here"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKX0UyYmJtdFphMTVnRRAB",
            "text": "Wood charred broccoli was by far one of the best plates I had in New York City during my recent trip. On top of the fact that the beverage manager, Hendrick, was amazing and ultra accommodating, it was overall a GREAT experience. They even played Tribe Called Quest at the end. Enough said."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNNlN4S2VyenFUb3lRRRAB",
            "text": "Daniel Kluger is a wonderful chef.  Loring Place has kept up its consistency over the years.  Nice atmosphere and not over-priced, unlike so many restaurants of comparable quality. Highly recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VQbmJwWm1YOTRiSzlBRRAB",
            "text": "Food was good, very on point for brunch. Vibes were good on par with nice WV establishments.\nLo was the best waitress we loved her personality and wonderfully fast and punctual service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLMmhxTVNicXMzWGRnEAE",
            "text": "Food was good, but the overuse of citrus flavoring on most of the dishes kept it from being great. Service was attentive and ambience was pleasant."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNGNmX3BBRRAB",
            "text": "뉴욕에서 조용히 식사할수 있는 몇 안되는 곳\n브로콜리 셀러드, 머슈롬 피자, 숏립 맛있었고 멋진 샴페인 추천 고마워요\n생일 저녁 아주 좋았어요"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMN2puNl8yMnZuZFVBEAE",
            "text": "Loring Place is our go-to spot whenever we visit our daughter, who lives in this West Village neighborhood. We dine here frequently, and it never disappoints. The chef is outstanding, and the entire team—from hosts and servers to house managers—is consistently warm, attentive, and professional.\n\nOne of the things we appreciate most is the thoughtful, balanced menu. Our daughter is Vegan. While my wife and I are not, it’s important for us to find a restaurant that celebrates vegetables without sacrificing variety. Loring Place does exactly that, offering seasonal dishes that are fresh, creative, and satisfying for every palate.\n\nThe cocktails are another highlight—expertly crafted, well-balanced, and often featuring seasonal ingredients that complement the food beautifully. The wine list is equally impressive, with a well-curated selection that offers something for every taste and pairs wonderfully with the diverse menu.\n\nWith its ever-evolving offerings and consistently excellent service, Loring Place remains one of our favorite dining destinations. We highly recommend it!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VObmFpNDMzc0lmR0tnEAE",
            "text": "Loring Place is an amazing restaurant situated close to the NYU campus in the vibrant Greenwich Village area. The staff were friendly and welcoming and their hospitality fit the vibe of the restaurant. The food was absolutely amazing and some of the best I’ve seen in New York City. I would 100% recommend this place and would visit again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VPeVp1S2p4a2JHRnZRRRAB",
            "text": "OK experience but nothing to write home about.\n\nWe tried the Olives, Beet Salad, Fries Asparagus, Burger, and Chicken and all were mostly average and/or pricey even for NYC. Service was good but the A/C was broken so we had to eat quickly and leave.\n\nIn sum, we were looking for more flavor but left still chasing it."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMy1Ud1BREAE",
            "text": "If you’re looking to avoid the tourist crowd and enjoy a classy night out, this fine dining spot is the perfect choice. With ample space for large groups, it’s great for special occasions or an elegant evening. The service is top-notch, and the food is so delicious that it’s well worth the splurge.\n\nI tried the Date Pizza, and it was a delightful surprise—an incredible balance of sweet and savory flavors. The atmosphere is just right, with low music that allows for easy conversation. The desserts were absolutely spot on—every bite was a treat! My friends ordered the salmon, and it was just as impressive, perfectly cooked and full of flavor.\n\nIt was my friend’s birthday, and the staff made it extra special by bringing out the dessert we ordered with a candle. Such a thoughtful touch!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2NDQyS2dnRRAB",
            "text": "A gem of a restaurant in the heart of SoHo. This is an upscale establishment that in my opinion embodies the American New York food scene. The decor is clean and well spaced and in the evening when we went the place was buzzing so you will need a booking. It’s great a date with its romantic ambience or for small groups where table conversations and shared plates make for a memorable meal. The menu is rotating as it’s freshly sourced.\n\nThe evening menu is eclectic and caters to all taste and especially if you have a fondness for a vegan diet. The starter of hummus with a freshly baked pita and baked ricotta cheese was exquisite. The salads were farm to table and perfectly dressed . I especially liked the kale salad and even the non kale fans on our table were converted.\n\nThe large plates of maple seasoned chicken and short rib were juicy and tender. The home made pizzas came highly recommended but this was perhaps the one dish we were a little disappointed with. But all in all this was an 4.5/5 meal and I would return at a heartbeat. Highly recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6c05UOVpnEAE",
            "text": "So happy with this restaurant!\nThe dishes were plated in such delicate and detailed way, perfect for get you ready to get into all the flavors. The Grandma-style pizza is a must! And arrive just in time!\nAlso it’s such a great place with an amazing staff and the perfect ambiance; the brunch bartender suggested the best cocktails keeping in mind my preferences about liquor.\nDefinetly Loring Place continue show dishes full of flavor, color and an open invitation to come back for more."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQNXFyRVF3EAE",
            "text": "Five stars all around. All dishes have well balanced flavors and textures. Great attention to detail. The menu has a good selection of seasonal dishes + classics. The Grandma pizza has a satisfying crispy crust. Baked ricotta is a MUST. It has been on the menu since Day 1 (ten years ago?). Butternut squash fries have fluffy on the inside with crispy shell. I don’t know what’s in the dipping sauce but it’s so unique and delicious. The Brussel sprouts salad looks simple but was just as good as the meat dishes; very well seasoned.\n\nAmbiance and service are both very welcoming and comfortable. And the best thing is that resys are not hard to get!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMU9pa1dBEAE",
            "text": "This was just an all round great restaurant! Nice modern and spacious design, friendly and attentive service, and a wonderful menu focused on seasonal ingredients. I started with a grilled strawberry and cherry tomato salad, seemingly simple but bursting with flavor. For the main, I had a sea bass with summer beans in a peach tomato sauce that was outstanding - perfectly cooked, a sprinkle of nuts on top providing a nice texture contrast, and all the great summer flavors really shining. The one letdown of the evening was dessert - the vanilla sundae didn’t really do it for me and looked premade. I won’t judge too harshly though - on a return visit I’d probably just go with one more of their appetizers, many of which sounded really good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMX083YmRnEAE",
            "text": "My family of four enjoyed Sunday brunch at Loring Place. Overall, we had a pleasant experience. The food was delicious and prepared well. The pancakes were great, and the scrambled eggs were fantastic. The staff was attentive, and the restaurant decor was comfortable and nicely appointed. There were a few minor annoyances that I took issue with. The hot tea, orange pekoe, was not good at all, and the restaurant did not have any sugar substitutes, such as stevia. Lastly,  we were charged an additional fee for \"still\" water, which was tap water. This was a new one for us."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnNDRIb0dREAE",
            "text": "Food was enjoyable - recommend the broccoli and cavatelli. Fish was ok. Short rib was serviceable.\n\nService was not enjoyable.\nDo not recommend getting served by our waiter (white man with ponytail). He was incredibly lackluster."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcEo2a2FBEAE",
            "text": "The halibut special was good. The food was alright, would have loved to have more flavors... The vanilla sundae dessert was lacking. Drinks were good - I enjoyed the vodka pear."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBc2JySG9RRRAB",
            "text": "Exquisite food. Aesthetically pleasing decor and wonderful ambiance.\nWe got the pancakes (lemon curd delish), baked ricotta, baked eggs, smoked salmon pizza and creamy scrambled eggs, OJ and. Cappuccino. 10/10 for Food !\nBrunch on Feb 1, 2025."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMVlUMkt3EAE",
            "text": "Such a quaint, beautiful restaurant. The atmosphere was so inviting,  the food was divine (I love how they used seasonal ingredients), the service was impeccable, and the drinks were delish! Such a great experience, and I will definitely be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMYWcyNS0tNnNQNG1nRRAB",
            "text": "My family and I visited Loring Place for Sunday brunch over Memorial Day Weekend and had a delightful experience. We were seated at a cozy booth seat at the back, which was perfect for our toddler. Our server was attentive and friendly.\nWe started with the beet salad and the hummus, which were both fresh and tasty. The hamburger and baked ricotta were both satisfying, but the highlight of our meal was undoubtedly the buttermilk with lemon curd pancakes - for both of us and our toddler!\nOverall, Loring Place is a fantastic spot for a relaxed and enjoyable brunch. We look forward to returning."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNE5uWlZNM04xVDJ4dGVGTm1iM3AyUVU5Q09HYxAB",
            "text": "Beautiful restaurant! Lovely lighting. My daughter and I sat at the bar and enjoyed a wonderful meal. Excellent Tuna. Followed by fabulous sugar snap pea salad. Rounded out with a flavorful Sea Bass. And of course a very nice Chardonnay from California. Our bartender/waiter was cheerful and knowledgeable. Really a great dining experience in NYC!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcDczT1hBEAE",
            "text": "Sleek and intimate spot. The short ribs were super tender. The bass was memorable too. In the appetizers, loved the wood grilled broccoli."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURULVlDMEtnEAE",
            "text": "Not only does Loring Place have a well-informed and friendly staff, their menu includes a lovely selection of options for people with various dietary preferences, and they have an ambiance that is fitting for any occasion. Dining at this restaurant was nothing short of a perfect setting to celebrate my friend and I’s graduation (party of 2) and allowed us to have great conversation while still being attended to regularly. I loved their French toast, snap pea salad, and their freshly squeezed orange juice which was very refreshing. Their marinated chili sauce paired well with many of their items. Diners can expect to pay ~$30 for an appetizer and entree (pretty reasonable) and will surely enjoy their time here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0NUtmQ0VREAE",
            "text": "Lovely place in a cute neighborhood. I have had two extravagant pizzas that were sensational, pumpkin ricotta bake that was out of this world and baked broccoli that was also very good.\nHummus had some space for improvement but the sourdough bread served with it was amazing."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXaHZPenhBRRAB",
            "text": "A great new American dining experience with some unique dishes. We had the gem lettuces, the roasted sweet potatoes, the date pizza, and the roasted short rib.\n\nThe lettuces were OK. The lavender lemonade I ordered was a tad bit too strong in its tartness and sweetness. The rest of the meal was great, though. The sweet potatoes had many amazing layers of flavor. The date pizza was my favorite. The sweetness from the dates worked really well with the bitterness or the radicchio to create a unique flavor unlike any I'd had on a pizza. The short rib didn't have any twists but was just very well executed.\n\nThe ambiance was nice and relaxed with dimmed lights. The service was great. I'd go back to this place to try their other dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREOExqM0lBEAE",
            "text": "Wow, this dining experience in New York was exceptional! Everything was flawless: outstanding cuisine, exceptionally courteous service... The chef pleasantly surprised us with special desserts. The best food experience we had in New York, highly recommend!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZeE1XZ1RnEAE",
            "text": "Our office came for lunch and was very impressed by the prix fixe menu (small plate & large plate for $29). The baked ricotta cake with the bread on the side and was incredibly light. The veggie burger was dense and moist, one of the best I’ve ever had! The quality you get for the price you pay is most definitely worth a visit."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPNkptcTNRRRAB",
            "text": "Great atmosphere! I found the food to be good and it was fun to share a few plates with friends to try a few different items. The asparagus fries were most interesting and I would definitely order them again."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURraS0yY2RBEAE",
            "text": "Good food.  Lots of fresh flavors,  not too heavy.\nApps were better than mains.\nBaked ricotta and cauliflower were a couple of the favorites.\nArctic char was a nice piece of fish but could have used some more seasoning and or sauce.\nThe halibut was more balanced and cooked better."
        },
        {
            "date": "11달 전",
            "language": "it",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQLUlMYXRnRRAB",
            "text": "Ho preso un hamburger senza pane perché intollerante al glutine. L’ho chiesto ben cotto essendo un hamburger (non bisognerebbe consumare gli hamburger non completamente cotti) ed era molto secco, oltre che piccolo\nHo mangiato solo questo e ho speso sui 40$ con la mancia\nSo che hanno anche la pizza senza glutine (non l’ho provata)"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOGMtQUNBEAE",
            "text": "Came here for burger league and ordered some extra. Loved their roasted beet root app. The ragu short rib was out of this world. The cheese burger was amazing as well 10/10 would recommend."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQZ3VPMVRREAE",
            "text": "Had a great time here. Chill atmosphere, delicious granny style pizza, solid if limited beer selection.\n\nStaff were super friendly, as well as the other customers. Prices are not high, and reasonable. Would return."
        }
    ],
    "reviews_count": 77
}