{
    "name": "Chinese Tuxedo",
    "place_id": "ChIJyW-u9iZawokRY1sHXGzZHGI",
    "grid": "MN2",
    "address": "5 Doyers St, New York, NY 10013, USA",
    "rating": 4.4,
    "user_ratings_total": 1194,
    "phone_number": "(646) 355-8693",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNmFucEdURmxtUldWUlYycG1Va2N0V0VOV09GRRAB",
            "text": "Came for dinner, it was okay but the manager was rude. Not a good look"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taU2FEUjZkME51UTBGVE0yUXlXR2xRVVVGblRFRRAB",
            "text": "firing someone over a review is insane. people have bills to pay and kids to feed. poor management and poor leadership. do better."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMGRWbFpTMGt4ZVhNeVdEVjBTMHB5ZFhsb1FuYxAB",
            "text": "Great dining experience, very satisfied with the food and the prices, Louis was amazing and provided an excellent service and was very nice to my elderly parents."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1TFVFSjZSblF5VjJobFpuaDBRMFpLVWtab1pIYxAB",
            "text": "Don’t go here!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSdVQybG9PRTV2U0hWUGIzUmhVRWhxVFhsblZWRRAB",
            "text": "the waiter Louis is an exceptional waiter. I hope I can get more like him in my future dining experiences while I travel. I hope to see him again before I leave town!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOalVtcFJVMnRDY2twTmJFc3dVRFp5UjJneGFXYxAB",
            "text": "Place is extremely poorly managed."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205aE5FcHdZbWt6WlRZMFoxWnNVWFZmV0V4a00yYxAB",
            "text": "I enjoy coming here with out of town friends. The special ambience and great food are more than worth it. What really sets it apart is their staff. I have been here about 10 times over the years and the vast majority of times the service has been nothing short from excellent. Nathan, Anna and Louis are just some of the people that come to mind that I have interacted with and they are all lovely. Will be back soon!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWVldEQnJhMll3YjE4MlpFWTNYMlF0T1VoNVJGRRAB",
            "text": "Hands down one of the best spots in the city! This was our first time visiting and the food was unreal… the oxtail bun was my personal favorite. The cocktails were amazing too 😉\n\nOur waiter Louis was awesome and made some great recommendations. He was very attentive and knowledgeable about the menu and had great energy all around!\n\nWe’re already planning to come back on our next visit. If you go, make sure you ask for Louis!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNVgzSkNOMUZuWHpFelRuSm9VV1E0WTNkM2RrRRAB",
            "text": "There was a waiter named Louis who got treated really bad by another table. I wish the staff would’ve stuck up for him more."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214NVpEYzVjWGxZWkRsNVpXRlNSV1pHZVROME1tYxAB",
            "text": "Our server Louis was amazing. Never get a night out without the kids, and Louis made sure our night out was well spent. Best service I’ve had in a long time. Will be asking for Louis when we return!!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRVpYRTJTSFpwU3psUWNVcFpSWGx2VERSeWNGRRAB",
            "text": "Came for my birthday dinner and wasn't expecting anything crazy but from the start our waiter was distant and cold. The ambience and food were great… the space is beautiful, and the dishes were flavorful and well-presented. Unfortunately, the service really brought down the experience. Our waiter Louis was not attentive, never introduced himself, and overall did nothing to make us feel welcome or elevate the dining experience. He even scolded us for asking for more hot tea and water. For a restaurant of this caliber, we expected much better hospitality."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRFRXdFJhMGwyTjBWd2JFTk1SMlIxUlhkU1IxRRAB",
            "text": "Braised Black Pepper Oxtail Bun\nCantonese Style Half Roast Duck\n‘Johny Fried Rice’ Char Siu\n\nPerfect meal, perfect service, wonderful atmosphere.\nWill be back for more experiences at this amazing place"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWU1JuTTFZUzFTUm5wbk1WUm5UbmROY0ZwMVpIYxAB",
            "text": "First time eating here and it was the best Chinese food I've ever had! Incredible menu and drinks. Our favorites were: the burrata, the beef, the duck, pork dumplings, and fried rice!!!! The Oxtail bun was unreal. Will be coming back asap. Beatrice (server) was fantastic and the bartenders were very sweet and welcoming."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wb1dtSm5WMDV0TTI5cFpGTnJVMDkyYm5ScFJWRRAB",
            "text": "Great food, and buzzy atmosphere done really well"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CWGMyVmFVVE40YVRBdGIwVnRRVTl2TmtkaWIyYxAB",
            "text": "I’ve been to Chinese tuxedo a couple times and it has always been a lovely experience. The staff are great especially Anna, Ash, and Jason. They really make this place feel welcoming and awesome. Also the ox tail bun is mad yummy. Not gluten free tho."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcE5ucG5ZMUJUUnpWMmFYRjFWbU54VmxCblVWRRAB",
            "text": "Delicious beef tartar"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRGNqVlJObTl3YURKbU1GcEhaWEZVUzJzNVlXYxAB",
            "text": "Amazing authentic mandarin cuisine. The presentation of dumpling in a tea cup is original. But it tastes even better. The sashimi hamachi crudo with crispy toppings …wow!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paMGFXRk5lRXhrY0hnelZHbHpWMlo2YjJnd01FRRAB",
            "text": "Chinese Tuxedo has good food and a cool ambiance that references Chinatown's past. But there are layers to this.\n\nWhen we went to Tuxedo, there was hardly any Asian clientele, which is strange given that we're in Chinatown and there were loads of Asians among the many people hanging out in the neighborhood.\n\nThere are a few reasons, partly about the food, but also about that \"cool\" ambiance.\n\nThe prices at Tuxedo, while a bit high, would not scare away Asians, as there are increasingly wealthy Asians in the city. And restaurants like Blue Willow or Cafe China are pretty similarly priced, have a very cool retro vibe, and are popular with Asians.\n\nThe difference is that if you're going to charge $32 for steamed fish with ginger and scallion, an incredibly simple standard Chinese dish on Tuxedo's menu, you have to do something special if you want to also appeal to an audience that's very familiar with Chinese food.\n\nThis of course isn't the only kind of thing on Tuxedo's menu. We had duck and radish fried dumplings ($16), which were yummy, and lobster noodles with black pepper sauce (MP $88), which had a bit of twist on the traditional presentation.\n\nBut then there's that hip vibe -- that I found off-putting. The restaurant is located in an old theatre that was the site for a legendary fight between Chinese gangs. This happened during a time of Chinese exclusion, when Asians could not become citizens, had almost no rights, and families could not be together...there's a lot to unpack.\n\nIn an irreverent wink to that past, the restaurant has drinks called \"Bloody Angle\" and \"Five Points Pegasus\" and tries to evoke some of that illicit history. Despite the fact that the owners must know that their clientele is not Chinese, the restaurant entrance is only in Chinese so you might not be sure if you're in the right place, and they give you a menu with one side entirely in Chinese.\n\nThey clearly don't expect most people to rely on the Chinese - it's more part of the \"ambiance.\"\n\nIt seemed fitting then that when you get the bill, the restaurant gives you a postcard with an old photo of the original Chinese Tuxedo featuring a table of customers. None of them are Asian."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWFdXTlBWWEZYVFhwalNrbG9NRTF3WlhKUlEzYxAB",
            "text": "​A fantastic night out! This spot has a vibrant, lively atmosphere, the service is impeccable, and the \"fashion Chinese cuisine\" is absolutely delicious and creative. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZMGFTMXdWVll0T1haUVltSTNZV05UZW1wcWVsRRAB",
            "text": "The tables are a little small and the place can get really loud. The food was OK. I thought some dishes were slightly too salty. The squid ink pasta, eggplant, and egg tart dessert were the most memorable. The eggplant was too salty for my friends but I prefer really salty foods."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKc05YVkhkMjVMYWxrME5WZERSR1ZQVm5sRlRHYxAB",
            "text": "If I’m being honest, the atmosphere and service were amazing, but the vegetarian food was not that great. We ordered for around 10-11 dishes (photos in the review), and it looks quite good. So, presentation is a 10/10 too.\n\nOut of all the vegetarian dishes, the Burrata was the best. The cocktails were nice too. I would not recommend the tofu dish at all, we didn’t enjoy it. The eggplant dish was good.\n\nSo, in all I would say go for the non vegetarian dishes."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKekxYcFphRGxSUVhaYWN6UXlZM2RMUkVWTVJXYxAB",
            "text": "The food was good, but it didn't have much flavor or excitement – the spices were a little lacking. The atmosphere felt pretty focused on getting you through the meal quickly, which I wasn't really into. The old theater room is nice, but it is clearly lacking restrooms for the amount of people that are eating here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdFlYRk9Oa2hSVUVRM2NrZzFZVlZ5UlRaa1IxRRAB",
            "text": "Don’t let them sit you in the small room behind the bar.  It’s impossible to hear anything but the screeching of the groups on the large tables. If it wasn’t Friday night we would have gone elsewhere. The noise was unbearable. Atmosphere is great but that room!!!!!!!!\nWe came here a couple of years ago and were impressed but not this time. Very disappointed with the food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkUVZXOWpRblUzYVRKSlVXOWhOV2h1ZWtwc1dsRRAB",
            "text": "Absolutely delicious food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CaGRYSkhORWRQWDNSMGFFWmhNMlpyVkdOSWRWRRAB",
            "text": "Came for dinner last night with family. The food, service and ambiance was exceptional.\nAsh took care of us - so knowledgeable about the menu and diligent when taking our order given there were allergies at the table. Will definitely be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVGFXaENSRzFsTkdoNlVHOVBkaTFoYUdOT0xXYxAB",
            "text": "Food is inspiring and delicious. Very unique. The staff is polite professional and knowledgeable about food preparation and ingredients.  Cocktails delicious.  The room is a little dark had to use phone flashlight couple times."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wUldqTk9VRUo2ZDJwVFgwbzFjMnMwWlhaTFVtYxAB",
            "text": "10 out of 10"
        },
        {
            "date": "1달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcWJ6QkRSV1ZDTmxkQ1oxOU5RM1JFTjJscWJXYxAB",
            "text": "C罗老婆来吃饭了"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWbFlXODBURlpMV0ZacVVWTkVUbEkzVlZSWVFVRRAB",
            "text": "Louie is the best"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMmMwRm1NMmRpV1dOVk9UbEdXRlJFU0dsWlpYYxAB",
            "text": "Great attention to the diner’s experience with exceptional care to ensuring a lovely meal. Love the atmosphere and aesthetic."
        },
        {
            "date": "2달 전",
            "language": "ja",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNE4wa3pjMVEzYlhKWFJWOW9WVk5tZEZWb2JHYxAB",
            "text": "Chinese Tuxedoで素晴らしい体験をしました。料理はどれも美味しく、盛り付けも美しくて感動しました。スタッフのサービスもとても丁寧で、リラックスして食事を楽しむことができました。特別な夜にぴったりのレストランです。ぜひおすすめします！ ✨🥢"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CcU1TMTJWRkpHY0cxUVIwcEhVamMxU0VsclozYxAB",
            "text": "The best part about this spot is the atmosphere. It's beautifully decorated and has a charming yet not too excessively classy vibe. Food-wise, I found most things were decent, although some were a bit too fusion-y for my personal taste. The most memorable meal was the XO crab butter noodles. Otherwise, the service was very attentive. I'd still recommend it if you're looking for an elegant place to try, although if you're looking for traditional Chinese cuisine, this place is not it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRNVkzUlVTRE5TTUhOVVNYcG5UWFJRUm1sUlUxRRAB",
            "text": "We had a wonderful dinner at the Chinese Tuxedo’s restaurant. Ash provided outstanding service and his knowledge of the menu was exceptional. Most dishes recommended by Ash were delicious. Our favorite was the squid pasta, the Burrata and the Duck dumplings. We will be back soon!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GUlkzTlVZVmg2Y3kwdGRtRmpUMjVTWDIxc2VYYxAB",
            "text": "Used to be my favorite but not anymore. The servers are obnoxiously rude, can't even take orders correctly and gave attitude when we told them about it. Felt literally being kicked out of the place. I don't understand why I even had to pay for the tip, which I gave more than 20% because the aggressive server was holding the reader right in front of my face urging. Won't be coming back for a while. The servers are ruining the chef's hard work."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoclVsWnRXSEZVU21vMFp6SjJWV1JXY25Ga2JIYxAB",
            "text": "Incredible. Service was stellar. My boyfriend made a 1030 rez, we sat in the main floor. Our waitor was a young version of Liam Nielson. Attentive with the right amount of distance. Food was so delightful. Ordered everything and it was coursed perfect. Show stoppers were the scallop toast,  squid ink pasta, and crude. Def coming back. Liam was awesome"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjNFkxRkxXRTVaY0V4UFgxaGFNVzluT0RkUmNYYxAB",
            "text": "Best Chinese restaurant ever. I mean, even my kids were impressed and that takes a lot. We will definitely come vack when we are back in NY!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0emFrZEJhRlZTVURsc1lsVjFablV4TjFvMFUwRRAB",
            "text": "First visit and absolutely unforgettable. I had the privilege of dining here as a guest of Amazon and want to thank them for hosting at such an incredible place.\n\nFrom the moment we arrived the ambiance was perfect, a seamless blend of upscale, modern, and inviting. The service was impeccable, attentive without being intrusive, with drinks and food flowing throughout the evening, literally.\n\nThe culinary experience was outstanding. Every dish was vibrant, flavorful, and beautifully presented. Dish after dish, I was fulfilled and it was outstanding.\n\nCrazy because just last week we were at Resident’s 58th Street location with a Michelin chef, yet Chinese Tuxedo matched that level of quality and creativity with ease.\n\nThe entire evening felt effortless, with the kitchen and bar working in perfect harmony. There was never a pause, never an empty glass, and every plate impressed. You can feel the pride in every detail from presentation to pacing. (Wish I’d taken more pictures but was having too much fun!)\n\nAn absolutely top tier dining experience in NYC. Although we were over 20 guests, nonstop delight.\n\nWhether for a special event, a business dinner, or a night out with friends, Chinese Tuxedo delivers on every level.\n\nThank you again Amazon and Chinese Tuxedo!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSk5WRjVTRE10WlhCS2NERjFVR3hQU1ZJeGFYYxAB",
            "text": "I travel the world to find great restaurants and by far this is one of the best on my list.  Asian fusion like nobody can imagine.  I’ll fly to New York any time to have this meal?."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMFFrTXlSR1ZDVFZnME0xUk1ZMGhFYlZNMU1HYxAB",
            "text": "I’ve been twice to this restaurant so far and it has been very good !! If you have a shellfish allergy as for the shellfish feee menu !! We ordered the spicy cucumbers, the crispy eggplant, vegetarian fried rice and the lamb noodles (special for the day). Everything was delicious and flavorful !!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pScFptWlFRa3BhZEhacldUUXdRVzlVT1c4M05YYxAB",
            "text": "We stopped by Chinese Tuxedo on a stormy night — flash flood warnings, heavy rain — the restaurant was quite empty (maybe 25–30% full at best). We were a group of four, hoping to enjoy a few cocktails based on the great things we’d heard.\n\nDespite the many open tables for four, the hostess directed us to sit at a small bar table for two. When we asked for a proper table, she said she’d need to check. But we didn't think it's a crazy ask given how many tables are open. Initially, we were told we’d have to order at least one dessert, which was ok with us. But when she came back, the requirement had changed — now we’d need to order two desserts, just to sit at a table for four.\n\nThe whole exchange felt needlessly rigid and unwelcoming, especially given how quiet the restaurant was. If the place had been packed with a waitlist, we’d completely understand — but that clearly wasn’t the case. The experience left a bad taste in our mouths, and we chose to take our business elsewhere.\n\nHospitality matters — and unfortunately, Chinese Tuxedo fell short."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201NFYzcG1WR0YwTXpGSVoyUXplRVIyUzAxRFRrRRAB",
            "text": "Bomb FOOD. Love the eggplant, the drink with the Lillet, everything!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KR2RFbDZVa2hRU1dSekxXWTFUa3QxTVROa1RGRRAB",
            "text": "I had an amazing Monday Night meal with my favorite people!!! Shout Outs to Nicholas and Jonathan,  you treated us like family 🥰"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOcFJFWk9TVEJaT1dWZlNEUm5aV3R0ZW01ZmVYYxAB",
            "text": "Absolutely loved my experience here. Every dish was beautifully presented with layers of refined, bold flavour. It was a perfect blend of modern execution and classic Chinese inspiration!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poa1FrVlVOMjl6TlhaWFlqTjNTMjkyTTJWaGJsRRAB",
            "text": "Outstanding. The Dan Dan noodles are a must try"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214dFdtWmpOME5QWWxwbmIyeGpValU0VEdseE9FRRAB",
            "text": "Amazing food and drinking, amazing staff, and amazing atmosphere. This is a must try and go with a small group so you can try it all!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25adFV5MUZOSEUyWTFsblVXdG1WVGRNYjJsaWNYYxAB",
            "text": "verynice"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRdGFuUjBjSEZsZEdsalNVUjJkbkY1ZG5sSlpsRRAB",
            "text": "The food was great"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwd1RtNVJTbE4xWDA5VGFUaFFUWGQxYmtjeVZuYxAB",
            "text": "My friends and I had such a wonderful experience! Our server, Anthony, was incredibly hospitable—warm, attentive, and made us feel truly welcome from the moment we sat down. The food was absolutely amazing, every dish full of flavor and…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWUFRFSjZNM1ZYTWtZd1psUlRaVVpyVmxGaE5HYxAB",
            "text": "All the dishes were seriously so good! Three three of us loved everything and our favorites were the fried eggplant and squid noodles. They do an amazing job with fried dishes! Lit every single one we tried was incredible. Definitely one of my favorite Chinese spots in the city. The portion was p small so recommend ordering multiple dishes. We got 4 appetizers, 3 main, and 2 desserts for three people and was a good amount"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1b1pYZHlZVEZEU0dVMlMydGlTekZXVDJOdVlVRRAB",
            "text": "Okay, so this place is a bit different from what you might expect for Chinese food, especially if you're used to more traditional spots. But honestly, for folks who haven't had a ton of Chinese food, it's a pretty nice experience.\n\nThe place itself is super clean and has a really cool vibe – it totally gave me old-school Shanghainese bar feels. The servers are on it, super polite and always checking in.\n\nNow, the food's decent, and the portions are kinda small. That actually makes it a pretty good pick for a date night since you won't get totally stuffed."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxOU15dm1BRRAB",
            "text": "Chinese 보다는 fusion asian\n\n대체로 음식이 매워요\ncrispy ox tail bun 맛있는데 duck dumpling이 향이 있는데 너무  맛있어요\nEggplant 는 한입 먹는순간 가지 육즙이 나오고 최고예요\nMigorang은 맵고 비빔국수같아요\n쿵파오도 맵콤하네요\n오이를 넣어 오이맛이 입혀지고  야채도 싱싱함이 느켜지네요\nCrispy red snapper는 많이 매워요\n밥이랑 같이 시켜 먹으면 좋아요\n저는 개인적으로 Eggplant 가 최고예요"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNSDJ4cS1vX01teWVBEAE",
            "text": "We started with the spring rolls which were my favorite from the appetizers. The fried eggplants were a bit too sweet and oily for me and the scallop was just okay. For mains, the dan dan noodles were amazing with a nice spicy kick. The squid ink noodles were absolutely outstanding and definitely the best thing on the menu. We also tried the beef sirloin which was perfectly cooked and full of flavor, and the duck which was also very good.\n\nSpecial shoutout to Jeffery and an even bigger shoutout to our waitress Beatrice. She was incredibly friendly, welcoming, and helpful. She recommended most of our dishes and provided exceptional service throughout the night."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sSE4yNVNjREp4VW1WRFJ5MXFVblY0Y1RWR1lXYxAB",
            "text": "Food was completely disgraceful. I usually never write bad reviews but what the hell! Don’t get any dish from the dim sum or any of the fried items. All the fried items were pre-fried. Frozen & refried. The crisp was all stale and tasted terrible. Avoid the hamachi the raw fish was NOT fresh at all. My husband got a cocktail & it was not good at all. The only dish that was decent was the butter xo crab noodles & the fried rice dish. But I would not come back for anything. So much more actual good restaurants in Chinatown with tasty food. I wouldn’t even consider the food here mediocre."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VLUzVnOWZld2FTWkhBEAE",
            "text": "I went to this Restaurant for the First time and I like the vibe of the restaurant but me and my friends had the pork Dim Sum and It really wasn't cooked all the way through like the waiter had told us but I would like if it was cooked all the way through but all in all it is a good restaurant. We also ordered rice that could have been shared between two people the portion is shareable only between two people. If I come here again I would want my Pork Dim sum to be cooked throughly next time.And also the branzino Fish tasted too fishy but my friends liked it but anyways it was definitely an authentic Experience in Chinatown.And most of the food items we ordered was too sweet."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNelZUWXpaR1JUVEhnM1JGbFJiMjV5UVdWc1duYxAB",
            "text": "Had an incredible time at Chinese Tuxedo! My best friend and I came here after seeing it on RHONY, and I'm so glad we did. The atmosphere was amazing, the music was on point, and the food and wine selection--just wow! From our host, to the waitress, and fun sommelier, the service was quick, genuine, and lively!\n\nWe ordered tapas-style, which was the perfect way to try a little bit of everything. Every dish was delicious, and the whole experience was top-tier. I'll definitely be back. Great for girls night, date night, everything. Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvek5haWdnRRAB",
            "text": "I had an amazing experience at Chinese Tuxedo! I was intrigued by how hidden it was, and once I walked in, I was pleasantly surprised. The food was absolutely delicious, and the service was top-notch. The drinks were also great. The ambiance is fantastic, and the staff is friendly and attentive. I highly recommend the veggie dumplings and the oxtail bun—they were both flavorful and satisfying. To top it off, I discovered a speakeasy in the basement, which had an incredible vibe. Definitely a must-visit!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMVdGSldSblJxU0U1RVdWcHNURzV4Yms5WExWRRAB",
            "text": "I have not been this excited about a restaurant for a long time. Our daughter has celiac and they have a gluten-free menu that is DELICIOUS! Our 15 year old really enjoyed the GF egg plant rolls. The pork was great. The Johnny Rice is something special as you can taste the wok grill enhanced flavor. We loved our dinner. We were all so excited about it and happy.. with celiac it was nice to be able to go out and eat and she could just eat without worrying. They have a lot of really great drinks too."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cDdxR3VBRRAB",
            "text": "this has to be one of my favorite restaurants in New York. The service is always fantastic, the drinks are great and the food is outstanding. Especially for the price point. I think everything is absolutely worth it. One of my friends has been here five times for this reason even though we live in New York, where there are a million restaurants. I can't believe I only tried this place now and I'll definitely be back as the service was exceptional, and every single bite was just delicious. Not to mention, the interior is really beautiful too. Extremely recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjd1NWaDJaa2xaZG10bFZGaExRV3hNZDFZMFRWRRAB",
            "text": "We had a wonderful experience at Chinese Tuxedo. 1st their service is exceptional! Our server was informative and share the history of the space and gave great recommendations. We tried a dish from each section, woodear, eggplant, ham sui gok, dan dan noodles, oxtail bao, crispy pork belly.  The dishes were all delicious and I love the twist on the sauces for the crispy pork belly.\n\nAlso they have a speakeasy as well!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aUtLeWhBRRAB",
            "text": "Chinese Tuxedo was a cute vibe & i actually enjoyed the speakeasy located at the lower level named Peachy’s. It’s a much more relaxed environment down there, Chinese tuxedo was busy and fast paced so I believe it creates the perfect balance.\n\nFood: the pork chive dumplings were good and flavorful & the crispy prawns were delicious. Order it with a small side of jasmine rice which is what I should’ve done.\n\nP.S that creme brulee was everything!\n\nI person would go to Peachy’s to enjoy the cocktails in a much more open environment"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNaXd4WjdDaWZDS2VBEAE",
            "text": "Tried Chinese Tuxedo as we had loved Tyger in past. This is bit upscale and had a good menu of cocktails and small plates/large plates and dimsums. We enjoyed everything. Ended up going to Peachys as well downstairs which is their speakeasy."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oalNYVm9NblJ5UzJvMVdtWllTR014WmtVMldtYxAB",
            "text": "More for the aesthetics overall. The food was good but nothing super memorable. Food is family style. I enjoyed it but feel like this is not a place I would return to if in the Chinatown area."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WYVVGcFlXR05TV2tkS1NWcGlRbmRKT1VKdlMzYxAB",
            "text": "Wonderful establishment. Service was 5 star. From the owner and manager, down to the floor staff, were so polite and obviously into what they do. Very knowledgeable about the spirits and the food. Would highly recommend!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnc29IdjJRRRAB",
            "text": "Everything you want in a classy yet modern restaurant. 90's & Early 2000's hip playing, along with Afro beats and reggaeton! Definitely sets the tone here! All the guests enjoyed the music. Chinese Tuxedo is Nestled on this side block perfect for pictures, in the heart of Chinatown! Inside you really feel the culture even more with the decor. The food and drinks are good. My lady and I ordered pork dumplings, fried rice, The stir fried snake river beef sirloin with kampot black pepper and the branzino, I also had a glass of Chardonnay. You can share the food together because portions are decent.  The only critique from me is, The desert options are little limited. There's a lounge as well so after you eat you can party! You get all the vibes you want here. Eat, drink, and dance. Will surely be back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNXJiYUdnEAE",
            "text": "Loved the squid ink pasta, shrimp toast and oxtail buns. The burrata was some of the best we’ve ever had to all our surprise and was personally my favorite. Service was good and the courses were well spaced out timing wise"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVVVFZExUbU5TT1RrNVdXOXZVMVJWUW5sMGFGRRAB",
            "text": "One of the most memorable meals I’ve had recently in NYC. The ambience is lively and beautiful, the service is top notch, and the food is absolutely delicious. This is fusion Chinese at its finest. The burrata appetizer with Chinese spices was unexpectedly incredible and a must-try. We ordered entirely from the vegetarian menu and loved everything: the eggplant, pea shoots, noodles, and fried rice (the furikake crunch was a standout). Cocktails and mocktails were excellent too. Ended with two light, perfectly balanced desserts (loved the mango one on the right in the picture). Great for special occasions. can’t wait to go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcUpHbFZBEAE",
            "text": "Had to book this spot two weeks in advance to secure a table and I now know why. This place is top tier all around. The staff were warm, welcoming and attentive. They made the experience all the better with their professionalism. The drinks were tasty and refreshing. The food was amazing from start to finish. All of the food was bursting with rich, well-balanced flavors, beautifully plated, and expertly cooked to perfection, enhancing every bite. Booking this spot along with the Peachy’s bar next door makes for a great date night."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMGI3dzlnRRAB",
            "text": "Great spot honestly service was nice and attentive. I had the prawns and the fried rice with the oxtail dumplings and some other things food was so good I forgot to take pics. But I’ll be back to try that snapper and fried chicken hopefully they put it back on the menu."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQeTVDVWh3RRAB",
            "text": "Now, I’m a generous reviewer, but I have to tell you, this place blew my mind. The outside seemed very boring, but immediately when I went inside, I was greeted to a large room with candlelit tables, perfectly setting the atmosphere. We were quickly seated and the food came out fast. All of it was phenomenal, and everything was cooked and prepared to perfection. I would have to recommend the sirloin, because I was shocked at the complex flavor and the tender, juicy meat. All in all, a 97/100 merely due to the appearance from the outside. Definitely would recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMGNTUENBEAE",
            "text": "The food here is soooo good. This is my 2nd time going, and I’m already planning for a 3rd. I’ve pretty much tried the entire menu and evening is divine & the staff is super friendly!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIczViNGNnEAE",
            "text": "I’ll classify this restaurant as high end Chinese cuisine.\nThe service was excellent. Our server was attentive, thoughtful and paid attention to our every request. The hostess was honest and attentive as well.\n\nWe made reservations so I highly recommend you do so.\n\nThe establishment isn’t that large but can fill up pretty quickly without filling cramped. You may experience tight quarters if you dine at or near the bar. The dining room is sunken in and adored with what appears to be faux plants. The room is lightly dimmed highlighting the rooms concrete like structure.\n\nThe space was relatively loud and it was difficult at times to hear our server but the overall dinning experience was excellent.\n\nWe ordered the chicken, it wasn’t my favorite but my dinner date enjoyed it. The rice dish was excellent, just wish it had less corn but that’s my opinion. The dim sum was tasty, the eggplant rolls were good too just a bit oily and the hamachi crudo was excellent. Flavors, texture and preparation was amazing.\n\nThey have sodas but not your Americanized sodas with tons of sugar. Their sodas were good.\n\nThis establishment is absolutely stunning just wished they had more relevant culture art on the walls. Nonetheless the food is moderately affordable and dining for two can cost up to $100+. We had a ton of dishes and even leftovers so your wallet won’t take a beaten.\n\nHighly recommend this location. I’m extremely happy I got to dine at this spot since it’s been on my radar for sometime."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmaXRteWVnEAE",
            "text": "A modern Chinese restaurant with an interesting take on traditional Chinese flavours and ambitious restaurant design. We especially liked the eggplant dish and the dan dan noodles.\nWe were seated in a smaller adjoining room to the main dining hall, which took a bit from the experience. If we were to visit again we would prefer being seated in the main room."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIbTVxTHVnRRAB",
            "text": "I've had this restaurant on my list for a while, and it's truly a hidden gem. Tucked away in what is essentially an alley in Chinatown, this spot is easy to miss but worth the search.\nLet me start with the staff—upon entering, you're warmly greeted, setting a welcoming tone from the beginning. The restaurant has a dark, moody ambiance typical of many high-end Asian establishments in New York City, with minimal lighting that adds to the overall atmosphere and works beautifully here.\nOnce we were seated, we started with sparkling water and some alcoholic beverages. I ordered a drink called the Golden Ratio, which was quite strong but still enjoyable. I noticed many other diners also had it, so it seems to be a popular choice.\nFor dim sum, we tried the shrimp & scallop toast and the crispy pork & chive dumplings, both of which were delightful. From the rice and noodles section, we selected the vegetarian XO fried rice, which was a unanimous favorite at our table. The fried rice was incredibly flavorful, with distinct notes of ginger and scallion that really stood out.\nIn the seafood and meat section, we ordered the stir-fried Snake River beef sirloin and the Cantonese-style half roast duck. As a frequent duck eater, I was particularly interested in trying the duck, while it was my friend's first time. The duck was delicious, though I found it to be quite fatty—perhaps due to its preparation in the Cantonese style, whereas I’m more accustomed to Peking duck. If you’re not a fan of fatty duck, I’d suggest opting for something else on the menu.\nUnfortunately, I can’t recall the names of the desserts we ordered, but we enjoyed both. However, there was one significant downside to our dining experience—the restaurant didn’t serve all of our main dishes at the same time. Our stir-fried Snake River beef sirloin arrived well before the duck and fried rice, so by the time we received the other dishes, the beef was cold. This was quite disappointing.\nOverall, I would still recommend this restaurant. It was impeccably clean, the food was delicious, and the service was excellent, despite the issue with the timing of the dishes."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNRHN2YVAwcU9mejdBRRAB",
            "text": "Amazing squid ink pasta! LOVED the Hamachi Crudo too. Our waitress was also super kind!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneXJEdXlBRRAB",
            "text": "After enjoying cocktails at Peachy’s Cocktail Bar (downstairs), the vibes continued at Chinese Tuxedo and we were definitely ready to try a couple of menu items.\n\n- Crispy eggplant (crispy, flavorful, a tad oily)\n- Spicy cucumbers (nice spice to it)\n- Shrimp & garlic chive crystal dumplings (not bad)\n- Vegetarian xo fried rice (delicious!)\n- Stir fried snake river beef sirloin (beef was cooked perfectly)\n- Espresso martini\n- Paradise park cocktail\n\nThey’re small plates so order a couple to share amongst each other. Highly suggest making reservations to both spots. I booked via Resy and was able to call to get reservations close enough between the bar and dinner. They were so accommodating. Definitely would visit again for date night or with my girls."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyNXFfTFlBEAE",
            "text": "We came here to celebrate an anniversary and it was a perfect spot to do so. The vibe and aesthetics were super cozy and cute. The food was outstanding. We got the cucumber salad, strange burrata and shrimp spring rolls, and the shiitake dumpling . The strange burrata was the show stopper. For the mains we got the hot honey chicken and the the Dan Dan noodles. The chicken was super crispy and not oily. The noodles were so flavourful. The service was also a 10/10 and they gave us a cute note congratulating us!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIME51QTZRRRAB",
            "text": "ORDER THE CRISPY EGGPLANT. One of the best dishes I've ever had.\n\nAll our dishes were great. Will definitely order the eggplant again, and the Dan Dan Noodles- different and interesting.  Everything was hot and flavorful.  The dining room was dark and super loud.  It was after 10, but the loud music and people talking over it made the experience less relaxing.\n\nStaff was great. Food was great.  Big Win. Will be back again."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2M0lPQjFBRRAB",
            "text": "Went on a busy saturday night, but our food came out at the perfect time. Not too quick but we werent left waiting and our table was never left cluttered. Our server was amazing (can't remember her name sadly) and her recommendations were phenomenal. The drinks and food were so delicious, and the prices were actually reasonable considering. Can't wait to come back and try Peachy's."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xndGQxSmlXRkpmTVVOUFpWcHVWVWhHTTFaWFYxRRAB",
            "text": "We were so lucky to get a reservation last night (last minute!) after our small marriage ceremony. The warm welcome and atmosphere was great. The professionalism and high level of service was the best we've experienced in all our visits to NYC. We loved every minute, the wine and all the dishes we shared were absolutely delicious. 10/10 & thank you all for making the occasion feel even more special."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQLW9EN1VBEAE",
            "text": "Great ambiance, lively music, awesome vibe for a date or hangout with friends & the free speak easy bar & lounge in the basement is a great touch for an after dinner event! Oh & there’s free coat check as well :)\n\nHad the squid ink noodles, shrimp dumplings & branzino…A+ for flavors! The fried eggplant was extremely oily so wouldn’t re-order. The mocktail with the lemongrass was excellent! The blueberry lemon one, was just too flavorless & sour. Oolong tea refills was a nice touch. Waiters were pleasant, the dimly lit ambiance was sexy, and the street it’s on gives Thailand vibes! Hard to secure a last min reservation without booking in advance but sooooo worth a visit!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNk1EeGpnRRAB",
            "text": "This spot never disappoints! The food is a solid 10/10, and the ambiance is on point. From start to finish, everything here is top-notch and absolutely worth experiencing. Put this place on your must-try list—you won’t regret it! We went all out with the burrata, pork dumplings, shrimp rice, hamachi crudo, and honey-glazed pork—and every dish was flawless, as always."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGMEozRWR3EAE",
            "text": "Went in recommendation that this place was good and had great dumplings.  This place had great modern Asian decor located in NYC Chinatown.  We tried a lot of their dim sum menu.  The one that surprised us the most was the oxtail bun.  Was the best out of all the things we tried.  The next best was the 5 spice quail.  They had these fried leaves as garnish and was surprisingly good. Such a good aroma to it and crunchy too.  It was fried and had a good taste to it.  The disappointing dish was the lobster and shrimp toast.  The toast was so oily.  Didn’t see or taste much lobster.  It is all shrimp.  They have a pickled vegetable on top of a marinated dried squid and the toast was cut into 4 pieces.  The garnish was more interesting than the actual dish.  Didn’t enjoy the over the top oily toast.  The dumplings we had all are nothing to write home about.  The squid ink noodles were super oily.  I don’t know who has a taste for oily stuff.  I personally can’t stomach it.  The noodles so had a bit of sour flavor, I’m guessing out in to counteract the oil.  Didn’t work.  The last dish we had was the spicy fried chicken.  It is pretty spicy but very good.  They keep the place pretty dark.  Service was great.  Recommend you try it at least once."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPLXZ6QnlBRRAB",
            "text": "We had a delightful evening here, delicious food, professional service, good music, tasty drinks. You come into the bar and descend into a large, high-ceiling dining room with lots of green plants and chic atmosphere. Every dish we had was…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNnQ3VDhRRRAB",
            "text": "The service was excellent, and I was able to make a reservation two weeks prior.  While the food was decent, nothing stood out as particularly special.\n\nThe eggplant dish was a highlight, but both the fried rice and chicken were bland. Overall, my experience wasn't the best, but I'd still suggest giving the restaurant a try."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqNi0yblZREAE",
            "text": "As two huge fans of Chinatown in New York City, we have been here exactly one time and this is our number one favorite spot.\n\nThe ambience is absolutely phenomenal and the service is top-notch. then the food happens and every dish is something new and really delicious in a simple kind of way.\n\nwe're going to make this a regular treat to go here."
        }
    ],
    "reviews_count": 85
}