{
    "name": "Little Owl",
    "place_id": "ChIJTX6hP5NZwokR93muGu7l4X0",
    "grid": "MN2",
    "address": "90 Bedford St, New York, NY 10014, USA",
    "rating": 4.5,
    "user_ratings_total": 1356,
    "phone_number": "(212) 741-4695",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WWVEZ3ljV0pSWkVWUkxYVlNiREpHWVdNMGJtYxAB",
            "text": "Little Owl was established in 2006. I have had this restaurant in my radar for many years but it took me 19 years to finally dine here. I wish I discovered this gem of a restaurant sooner. The vibe is of a comfy cozy neighborhood restaurant. We enjoyed the French onion soup, meatball sliders and the Bibb and Beets salad. The salad was absolutely delicious and worth coming back for that dish alone. I enjoyed my non-alcoholic drink but found the desserts a tad too sweet for my taste. The service was excellent. Jorge was especially hospitable and made us feel welcomed. I will be back soon."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdE1WRmhlRTlLTTFWeE4wdG5iRGxuY1V0S1pGRRAB",
            "text": "I love this place. Old school simple good food using good ingredients and friendly service. Had halibut, my partner had chicken. All was good. Rassiel is a sweet and adorable server, charming"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFNVZGbFNSMDR3ZDE5UWIyUmtWa1ZaWVZVeFNuYxAB",
            "text": "Had a fantastic experience at this West Village brunch spot! Enchiladas, poached eggs and chicken sandwich were true highlights. Service was attentive, friendly, and the atomosphere was perfect!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oVk9VcHdYMk5hZUhBM2JqUnJkWHB3WDA4MWFIYxAB",
            "text": "What a little gem of a place!!! The good was spectacular, the hostess Amy could not have been lovelier or more accommodating. Our waiter was also so amazing. Thank for an amazing night!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFNFduaE1PREpoWkhWRmEwNHRUSGsyVW1wa1pIYxAB",
            "text": "We walked in the restaurant randomly as we were in the neighborhood anyway and it didn’t disappoint. We didn’t expect much and for once got pleasantly surprised: food was great, staff extremely friendly and welcoming. Atmosphere was great and what was supposed to be a small lunch in a random place turned out to be a relaxing moment “at home”. Recommended!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xQlRtUkhVbU5VV1VsUFpWZHlVWFJFVERGUVFYYxAB",
            "text": "The most gorgeous place with excellent food and AMAZING staff"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OeGJUQnZXRkZOVUUxeldUQjVRVWhXWjBWaU5tYxAB",
            "text": "Little Owl was Great experience. Lovely little space located in the “Friends” building. Lots of people taking selfies. The food was wonderful and everyone was extremely helpful and willing to offer suggestions."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkRFQwTlJWM0pGT0MxTFdGTkRMV3hqYWt4RmVFRRAB",
            "text": "We honestly came just to have a few pictures of the location and we ended up having brunch. Probably one of the best meals we had in New York so far! Really nice! Also, staff was helpful, smiling and respectful. Congrats!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poaFRuQXRVak5xVmt4T1FrdHViVlE1TjNaTGExRRAB",
            "text": "Brought a foreign friend here for brunch on a Wednesday and Jorge was very attentive. We told him we were visiting the city for her birthday and, without anyone asking, he put candles in her pancakes! Jorge also gave us a small gift of their postcards for her to take home. It was so kind and quality customer service. Food's good too (pancakes, coffee, mocktails) and yes, this is in the bottom of the exterior Friends building. Thanks for making a Wednesday morning so special, Jorge!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KUVRHVjNReTFIVDFGd2QySlRPRkowU0VRMVJGRRAB",
            "text": "I remember coming here a while ago with a friend.\n\nThere were many tables available, but the waiter went out of his way to seat us as far away as possible from the other (white) patrons. I hate to pull the race card, but it was clear discrimination here (we are both non-white and there were plenty of open tables).\n\nDo better."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoU2RXMUlXbWN5TURsMFltdE1Ua1o2VjI1Zk9GRRAB",
            "text": "Great spot for a delicious lunch.\nSuper friendly staff."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdFVtdFNNSEpTVTFwR1dIUkJORTFtUWxoc1NVRRAB",
            "text": "Es un lugar emblemático por ser el edificio de la famosa serie \"Friends\""
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKR1ozTlpOV3hKY1UxcFYwSkJaMnhHY1VWQlFrRRAB",
            "text": "Amazing food in a cute, cozy restaurant. We had a salad (the one with sherry vinaigrette) which was AMAZING, a seafood pasta which was also AMAZING, a very good swordfish, and a pretty good steak. I would definitely recommend this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205TWNXdHpOWGRqWldKSWJISkRaUzFRUkdac1dtYxAB",
            "text": "The best!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aQmJtcEVTbTFpZW1GVFoyNHhMVU5pWTI1c2NuYxAB",
            "text": "Didn’t get to eat here since it was closed, but as a Friends fan, this spot is a must-see! The Little Owl sits right under the famous apartment building, and it’s such a surreal moment standing there in person after seeing it on screen so many times. Definitely worth a stop if you’re in the West Village, even just for the photo."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkU2VFRnNOak5ZTmxsWGNXY3pWR3g1Y1dONFRFRRAB",
            "text": "It was good for what it was - if that makes sense. Very quick, friendly and attentive service. The food was definitely good but not exceptional. Perfect for a quick bite."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaSGMxWm5kbEpGV2pCd2VqZFBRV055YlU5RU1IYxAB",
            "text": "An outstanding dining experience, from start to finish. We were looked after by Jordan who was a wonderful host. The ambience of the restaurant is cozy and warm, with great music and a knowledgeable and friendly staff.\n\nThe Mexican corn starter, the crispy chicken and the peach cobbler are to die for, but the whole menu looked amazing. Will be back soon!"
        },
        {
            "date": "2달 전",
            "language": "nl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WS1FYRldNbTFMVjNCR2RrbHVSMG8wYTFaV05FRRAB",
            "text": "Leuke plek voor een kopje koffie, of ander drankje."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psdFJteGxhVEZqZG1WRFIyczVjRGR5V2pNMmJVRRAB",
            "text": "Great food and service in a magical corner of the city"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taUWNrMDFNRkpyTW10UVVsUlBkRGxQV0U5eVpXYxAB",
            "text": "We wanted to visit the famous apartment building from Friends 🏙️✨. Of course, you can’t actually go inside – it’s a private building where people live – but just standing in front of it feels so special for fans of the show. 💫📺\n\nThe whole neighborhood around it is really charming, full of little cafés, restaurants, and cool spots to explore ☕🍴. Even though we couldn’t step inside, we didn’t mind – at the end of the day, it’s all about business and real life 💼, and the true magic is simply being there and soaking in the atmosphere.\n\nIf you’re planning a visit, bring your camera 📸, your excitement 😍, and enjoy the iconic vibes of this legendary spot. ✨\n\nYou can’t just go in for a coffee – you also need to order some food 🍴. The café is quite small with limited seating, so I understand the owner’s concept of not wanting people to sit inside with only a coffee.\n\nSince we had already eaten earlier and weren’t hungry, we had to go somewhere else. We didn’t mind – nowadays everything is about making money and business 💼💡.\n\nIf you plan to go inside, make sure to bring your appetite 😋 and enjoy the unique atmosphere. 🏙️✨"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOQ2RHaDBTM0pWVjJwaU1ISjZjbkZ1UTAweE5GRRAB",
            "text": "Very New York. Great food and vibe."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nNFRESmlYMlF0YTFwNldVazVUalZoZURjdFlYYxAB",
            "text": "The food was below average. I had the Chilaquiles and it had no flavor besides heat. The presentation of the three dishes we ordered was a mess. The serve was nice enough to take my food off the bill without me asking because I barely touched it. The weirdest part is the Bloody Mary. They can only do wine based cocktails, so make sure you look at the menu well before ordering. We ordered Bloody Mary’s when we sat down, it turns out it’s “vodka” wine. The serve didn’t explain before we ordered and couldn’t explain what it was after we asked. Overall it was disappointing, especially for the price."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRNFVtMVpRVlZXU1hJMU5YRkhTWHBvUzJSSVgwRRAB",
            "text": "I got very excited to be there because when I was an insurance broker 25+ years ago Le Bistroquet was my customer.  I had to try the meatball slider and the corn was great. My only objection was the restaurant was soaked noisy.I could hardly hear the person I came with. I would go again but not on a SundayI afternoon. ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWbFIyUkpTSGxSVjBsNlZVSkZVREZVWldWTmRIYxAB",
            "text": "Little Owl — tucked right under the iconic \"Friends\" apartment building — is a must-stop in the West Village. Cozy, welcoming, and absolutely delicious. The meatball is non-negotiable: tender, perfectly seasoned, and sauced just right. Service is friendly, the vibe is intimate, and every plate feels thoughtfully made. Come hungry, order the meatball first, and grab a quick photo outside afterward. Perfect NYC spot!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsd2VqWllZVlIyVHpreVRYUTBUSEZWVEdKMWEwRRAB",
            "text": "I had an incredible experience at Little Owl. Suggested to me by a friend‘s mother. It did not disappoint. If you’re going, definitely get the halibut. A very unique yet simple way of cooking the fish. The story goes that it used to be grilled until the grill went out in the first week and they’ve decided to broil ever since. They really go over and above to make sure you’re comfortable as well. It was very nice to feel well taken care of."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkclNuVllkMHhmTVVsblJ6STRSa0pKV1RkZllrRRAB",
            "text": "Enjoyed lunch at Little Owl, food was spectacular, staff was wonderful and restaurant was so adorable!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2b0ltY0xBEAE",
            "text": "Someone should tell you....they aren't called \"bajo\" fish tacos. They are \"Baja\" fish tacos. Like Baja Mexico. And Baja starts with a capital B...since it's a proper name. How do I know? I have a business there and I'm in Ensenada (in Baja…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUVprOXJkSGM0TFVacU1GTTFjMmx3VkVGVFdIYxAB",
            "text": "the Jamie Moyer of NYC restaurants. it’s been around forever, and seemingly will be, and we’re all better off for it. you know exactly what you’re going to get - intimate, cozy, delicious, EVERY. SINGLE. TIME. OUT. there’s never going to be a 99 MPH fastball, and that’s okay. it gets by on quality, guile, and a commitment to the craft. little owl doesn’t give a shit about your Instagram algorithm or your TikTok recommendations. it’s 92 down the middle followed by a you won’t touch this 88 mph slider that kisses the absolute corner of the strike zone and makes you walk away mystified and asking yourself, do I really need to pay Roger Clemens money when I can get the same result with good ol Jamie? up to you, but I know my pick every damn time. also, insane my man isn’t in the HoF. I have extremely high standards for entering the hallowed corridors, but my guy had a 50 WAR and pitched TWENTY FIVE years. for the love of god put some emphasis on longevity (but also get Harold Baines out of there, an absolute stain on the standards)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WSFZrWnZWMUpKWnpocFZqSjFNRXRrVkV4ek0wRRAB",
            "text": "What's there not to like about this place? Cute decor, lovely wait staff and delicious food. We ordered the poached eggs and they cooked to the perfect temperature with delicious hollandaise sauce."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMVZXSlJVRUpQUm5SSVQwMXRSemd3UjJkbFgwRRAB",
            "text": "From the sidewalk, Little Owl is a postcard-perfect dream — charming brick façade, small pictures on the walls, the kind of place that makes you want to linger. Sadly, once inside, the magic ends. The food is uninspired at best, inedible at worst, and the blaring music makes conversation a chore. Come for a photo, not a meal."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGQldsWm1Za1JKZHpKVVRXeFJiR1YwZW05cFoyYxAB",
            "text": "We got this place recommended by the CEO of my company. It was great! We walked in with no reservation, two adults and two children. Everything was delicious, it’s a small really cozy place that made us feel like at home. Service was super friendly and attentive. I just wish I lived in NY so I could eat there more often. I will go back if possible."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KU1QwbFVMWEI2VVMxa1dIVmFkVU5FU0ZBeGRIYxAB",
            "text": "Cute little restaurant"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SR2VuWlVaVlZMTnpBMlJVZGpSV3hVUjIxcWFIYxAB",
            "text": "They are the best. Menu always has nice surprises, customer service is great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214TlpURjBabEJGYzB0T0xWUkpjVmcyUVROd09GRRAB",
            "text": "Great eatery in the West Village. Friendly staff. Fresh delicious food.\nFine selection for different dietary preferences."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKRmNqSTJWRXBOZEdSMGR6azFRbVJqVlZwTmJuYxAB",
            "text": "Came back 10 years later and we are so happy! The place is still as charming! Jorge was so welcoming and made of this second visit another great memory and this time as well for our kids. The food was delicious (perfect lobster roll) as well as the wine! Thank you for this lovely souvenir on our trip!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210Zk5uWmZaR0pLYWpkZmRuUllhRkpGT0ZnNFJrRRAB",
            "text": "Where do I even start… I’ll be honest, I was a little skeptical walking in. My reservation was at 2 PM and the restaurant closes at 2:30 PM to reset for dinner service. Usually, when you catch a spot right before closing, the quality can slip. But let me tell you—boy, was I wrong.\n\nFrom the moment we sat down, our server Adrian was a sweetheart. She swore every dish I asked about was good. Normally, I take that with a grain of salt—but the chef took that grain of salt and seasoned every single plate to absolute perfection.\n\nThe steak? Juicy and flawlessly seasoned. The fries? Golden, crisp, and salted just right. The corn? A straight-up 10000/10. The bibb lettuce salad literally melted in my mouth, the eggs were cooked exactly how I like them, and the drinks? Bomb.\n\nSpecial shoutout to Jordan, who was just as amazing and attentive. Between the food and the service, this was hands down an amazing dining experience. I cannot wait to come back for dinner service.\n\nYou’ve got a forever customer in me."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kSU1XOXdkak5MZDNJMU9HSnpaMEZoWkRaWE5FRRAB",
            "text": "Nos encantó, tanto atención como la comida, amamos que el personal también hablaba español  ✨\n\nLos precios sentimos que están bien para los precios que se manejan en NY."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sRmNteFpNa3AyZGxCWGVXUkxaazlKUkV4b2VIYxAB",
            "text": "Been here a couple of times and last night sat in the Chef’s Room next door which handles overflow when the corner location is full.   I really liked it - sat at the bar to eat and it felt a little more intimate and quiet, but the same menu and same kitchen (perhaps ?).\nServed by Rassi and Jordan who were really great - well worth visiting."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcVVFMWpXR0pCVFU5RlpWUmxTamRtTkZKQ09GRRAB",
            "text": "This spot receives most of my dining business. You'll find fair prices and lots of vegetables at Little Owl. Each server welcomed us with natural warmth. It's a tight space with busy lunches, yet the food quality and service stand out. The food was exceptional."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OMFVpMW9ibUUxYkVKbU1HMXhUMGhrZVVKSk4xRRAB",
            "text": "Delicious brunch or dinner location- Dani the Maitre 'd is awesome!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsek5HWTJTRjlxYkVoU1VVbHljVTEyTkcxNldVRRAB",
            "text": "Overall, a very pleasant lunch spot. The Pink Prosecco Lemonade was refreshing and delicious. The Smoke Salmon was Devine. Will be back again but the portion was quite small."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMFdrVTFRVkY2UVUxTlozSm9MVW8zZUhSNFgxRRAB",
            "text": "The food was absolutely amazing! The service was so nice and welcoming. Such nice people! Jorge was my waiter and he was one of the nicest people I’ve ever met. I would definitely go here again and I totally recommend this place!!!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KNE1qRTVhblpKTVRWYU1VcFRSbTB4YTNWd1gyYxAB",
            "text": "Solo fuimos a sacarnos fotos por la serie Friends. Muy tranquila lazona y el lugar. Pintoresco."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCclVVWndjR2w2TWtOd2JFeHVTR2xsVlRCYVVVRRAB",
            "text": "Jesus loves you!!!\nBelieve in him!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3OE1UVmhnRRAB",
            "text": "A thoroughly charming and intimate American bistro in the West Village. Food couldn't be more delicious. And the service was as good as it gets. The roast chicken was sublime. Try the spicy green beans as well. This is sometimes a tough reservation to get but keep trying. You won't be sorry. A New York classic.\n\nWent back June 14th and was again fantastic. From start to finish this is one of the best meals you'll get in nyc. Service is outstanding. The food looks as good as it tastes. You haven't eaten in nyc unless you've eaten here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCd01tUlFWWFYzY0hSUWNXWmpMV2xTUlRCcE9VRRAB",
            "text": "Absolutely wonderful place. The host (I didn’t get her name) is on top of it! We stopped by last minute just looking for a place to eat after our son’s piano recital close by. We asked if there was seating, was told it was a wait and we walked outside just kind of not knowing if to wait or not. She came outside and followed up with us and reassured us it would not be too long and she would seat us as soon as possible. Other restaurants would have just let us walk away. The service was impeccable! At one point I dropped by napkin and by the time I picked it up, someone was already placing another one on the table! What!? And BTW, yes you can seat on that upper area that overseas the whole dining area! Pretty cool if you are a party of two! Just climb that little ladder! The food was great! I had the chilaquiles and thoroughly enjoyed them! I was not aware that this was a “FRIENDS” building which explains all the people taking photos of the building."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VKbnMtUHJKcGIzQ2dBRRAB",
            "text": "Food is good but portions small. The person clearing dishes made the dining experience anxiety inducing as you could barely put down your fork before all your dishes dosappeared without a word."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLRDRxZjJDdXZuMHd3RRAB",
            "text": "There were 4 of us - everyone went with a different dish and we shared an order of fries. Food was all fresh and sooo good. Our server was great, nice smile and seemed generally happy that we all enjoyed our lunch."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKYVItSk85ZzVPZGJBEAE",
            "text": "Lively space in the Village serving great food with interesting wines. Get the pork chop."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VOVDN0ZXVLdG9tVFhnEAE",
            "text": "Food is good but the portions are tiny for the prices they charge"
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRNThuelhnEAE",
            "text": "그리니치 빌리지에 위치한 미국 가정식 레스토랑"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtdklfWHBnRRAB",
            "text": "뽈뽀 리조또 컬리플라워 폭찹"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMG9tdXd3RRAB",
            "text": "Food and service was exceptional. The atmosphere is loud but it was expected. Little Owl is a cozy, charming restaurant offering delicious, high-quality American cuisine. Known for its intimate setting and warm atmosphere, it serves flavorful dishes with a creative twist. A great spot for a memorable meal!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdTdtaXVRRRAB",
            "text": "Little Owl, located in Manhattan’s West Village, is a charming and intimate restaurant that boasts a cozy, neighborhood vibe. Its iconic corner exterior is instantly recognizable as the apartment building featured in the TV series Friends, making it a must-visit spot for fans of the show.\n\nThe menu is Mediterranean-inspired, with standout dishes like the Gravy Meatball Sliders and the perfectly cooked Pork Chop. The quality of the food is complemented by warm, attentive service and a relaxed yet upscale atmosphere. While the space is small, it adds to the intimate charm, though reservations are highly recommended.\n\nOverall, Little Owl is a delightful mix of nostalgia for Friends enthusiasts and an exceptional dining experience for food lovers."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaF9mZjFBRRAB",
            "text": "We originally found this restaurant bc it’s below the Friends apartment, although the show used the exterior and was not filmed in the apartment.\n\nWe thought we were being seated in the restaurant and they took us to their secondary location, just a store or two door. A little disappointed since the reservation was made in advance and one of us was a huge Friends fan.\n\nThe food. Good to great. There are limited vegetarian items and you need to ask, bc depending on your strictness, some things container chicken broth, oyster sauce, etc. However I was happy with their accommodations. I had the burrata and a salad. The rest of the table had a variety of items, their overall favorite were the French fries. Would maybe come again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbjhlWWx3RRAB",
            "text": "Nice cozy place, really small though. I went with a friend for breakfast before taking my flight back home, I was traveling with a really small carry on luggage and I had to leave it close to the door because there’s no room around the table for it. The food was really good, but I don’t think I will be back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQM0pEUmhnRRAB",
            "text": "I went with a friend to The little Owl for a Thanksgiving Dinner. The menu looked amazing and to our surprise it was the best Thanksgiving Dinner in a very long time. WOW!! the food SO GOOD, Delicious!! The service & presentation amazing. Our bartender Gilbert was on point the Hosts Jordan & Jack LOVE them. I attached some photos I missed a few I remembered after I polished the dishes,  so the Scallops & meatball sliders were awesome cooked to perfection. The wine red & white paired perfectly and the dessert topped it all up. I cant wait to go back!! Brunch anyone :) W/Love Hana"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bjk2QlVREAE",
            "text": "We spent our Christmas Eve dinner this year at Little Owl and absolutely loved it. The food was fantastic—tender and flavorful pork chops and perfectly grilled sea bass. We finished with brownies topped with gelato, which was the perfect end to our meal.\n\nThe only thing keeping it from 5 stars is the limited and pricey wine selection. We wish they had more affordable full-bottle options.\n\nWe’ll definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUb3VYTlB3EAE",
            "text": "The cute little place is downstairs from the \"Friends\" apartment building. I came in for lunch one day while I was in the area playing tourists in my own city.  The restaurant is small and clean inside, and they do offer outdoor dining.  They have a limited sized menu with some pretty good options, and the prices are reasonable. I went with the Crispy Bell and Evans Chicken, and it is absolutely delicious. The skin was perfectly crisp, and the chicken itself was juicy. The mashed potatoes with gravy were superb.  Service was great here as well. I was expecting your usual tourist trap kind of establishment, but this place exceeded my expectations. It is definitely worth checking out if you are a fan of \"Friends\" and are looking for a place to dine while in the area. I will stop in again the next time I want to play a tourist again in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWZ0xfZzJBRRAB",
            "text": "Loved dining here! The food was amazing and our servers were excellent. We dined in the outdoor area, but there are warm heaters and it was very cozy. I recommend making reservations, as they stay very busy. If you’re a Friends fan, the restaurant is at the bottom of the Friends apartment building and was also used for the outside shots of Central Perk."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKMk1YeDB3RRAB",
            "text": "Came here for dinner on a Friday night. We had a reservation, but it it looked like there were one or two empty tables outside, so walking in might be an option here. The place was so cute and there were a couple of groups of girls starting their night there as well as a few couples who were on a date. Overall I really liked the vibe and the food and service were great too. We had the Mexican corn and the salmon and their Black Sea bass special and all were great!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbXNTZ1NBEAE",
            "text": "What a gem on Christmas Day. Was driving by and stopped here on a whim for brunch cause there was parking in front. 🥇🥇\n\nI usually cycle by here on the way to Penn station. There’s always a crowd. I only found out today that the building is famous. 👌\n\nThe salmon with eggs was impeccable. The burger must have been pretty great cause my niece devoured it like no tomorrow 😅😅\n\nWe sat at the bar top which can only accommodate 4. Sitting here allowed us a glimpse of the kitchen doing its magic. Each dish came out with incredible efficiency.\n\nSuch a fantastic place for brunch. It’s now included in my TOP 10 for Manhattan 🥇🥇\n\nLooking forward to another great brunch 🙏🏻🙏🏻"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtclBpZkJ3EAE",
            "text": "After a friend recommended this spot to us (and visiting the Friends apartment many times without going there), we finally tried it on our latest NYC trip.\n\nThey have a really nice outdoor seating area with heaters so we were plenty warm in the winter.\n\nWe had a busy day full of eating planned, so we got a light brunch here and tried:\n- Poached Eggs\n- Gravy Meatball Sliders\n\nI really enjoyed both dishes. The biscuit with the poached eggs was delicious as was the sauce on the sliders.\n\nThey also gave us complementary prosecco for our anniversary which was really nice.\n\nI would definitely recommend this spot!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5OXIyMTBRRRAB",
            "text": "What an incredible and intimate venue for our date night! Jack, the GM, and Dani, our server, were both spectacular hosts - we were seated promptly and had some lovely conversations, then began appreciating this gorgeous little corner restaurant! Huge windows, simple vintage decor with a gorgeous chandelier and eclectic details such as fresh flowers on the tables and little notebooks to write messages in which presented the check.\n\nThe food was marvelous: they split our caesar salad in the kitchen for us, while we enjoyed the squash risotto and palm hearts salad on the first course. So delicious! Fantastic caesar with fresh anchovy, the risotto was rich and perfectly cooked with great balance of flavor and texture in the garnish.\n\nThat palm heart salad was the winner for me however: fresh citrus all over, the softest palm hearts, and a delicious cappeletti reduction made for a sweet and rich salad with bitter and fresh green notes to round it out. I could eat that every single day.\n\nFor our entrees, we shared the daily special: striped bass with another risotto, shrimp, and crispy shallots, with a side of the eggplant parmesan and some lovely green beans. We both agreed the fish was delightful and soft, cooked perfectly, but the whole dish was a bit light on salt. As a special that's understandable - less time to perfect it, or maybe we just like more salt, but it was quite tasty and pleasant on the palette. The eggplant parmesan was classic, and the green beans were lightly spicy and sweet and were delicious.\n\nWe finished with the dulce de leche brownie and three different flavors of gelato on the side, which were all tasty, but if you have to choose one get the banana chocolate chip gelato all the way.\n\nThis may be one of our new favorite date night spots. The friendly and comfortable atmosphere, incredible food and a killer, tight wine list, and great hosts made this an easy place to spend our evening. Thank you team!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMDVUZzN3RRAB",
            "text": "Loved it here. Food was amazing and service was friendly and charming. The seating is tight around the 2-tops for a cozy atmosphere."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQybGFiTFFnEAE",
            "text": "Great spot in a cute neighborhood! The waiter was incredible and even made me a drink off the menu. Prompt service and good convos.\n\nThe food was delicious. We loved everything we ordered. It was fresh and flavorful. We came at 9am on a Sunday and it wasn’t very busy.\n\nLots of people take photos outside with the restaurant’s connection to Friends. We’d definitely come back and would recommend it to others."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMM0k3NzdBRRAB",
            "text": "We randomly walked here on a Saturday at 6 ish and were able to get a table with out a reservation outside. Food, waitress, vibes were all on point!\n\nThe meatball sliders were the best thing we ate. You have to get them, tender, quality well seasoned beef and the sauce was heaven.\n\nJolene got the strawberry drink frizzy and the glass had the coolest little stripper on it!\n\nI loved the porkchop, cooked perfectly and juicy. the soy tasting sauce paired well with the beans and lettuce.\n\nThe risotto was ok, lacked flavor compared to the other items but still good.\n\nThe waitress was awesome, super good with recommendations and it was such a perfect day!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1NDUzMEVBEAE",
            "text": "This was really a sweet spot. Sat outside,  they turned the heat lamp on for us. The staff was all very friendly.  The drinks were decent and the food was good. My only complaint would be that the chicken entree came with potatoes and no vegetables.  It was literally just chicken and mashed potatoes.  It was delicious,  especially the sauce on it, but just would have rather had one less piece of chicken in order to have some veggies like asparagus perhaps. Other than that lovely spot. Was always a crowd of people standing by and taking photos since the \"Friends\" apartment building is above it. Would recommend and come again. The staff gave out flowers for the women eating because of an event someone had. Wouldn't expect that to be a regular thing but was still sweet!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLdDhmS1NBEAE",
            "text": "They were able to accommodate us for dinner even without a reservation which was nice . Staff was also very nice. This is wine and beer only - no full bar but the outdoor tables on this beautiful corner in the West Village is kinda beautiful and relaxing . Appetizers of calamari and grilled octopus was really delicious. The octopus came with a really old fashioned and homemade tasting potato salad that wasn't throwaway like most are but was actually good ! Mains were also nice. I had the fish of the day but next time I'd try the salmon. Get a side of fries too because they were excellent and all got eaten . Comes with ketchup and some other dipping sauce but it's good . Bill was alright too. Recommended"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNTZxTXRnRRAB",
            "text": "Little Owl has been such a special place for us this year. Starting from when we got engaged till the day we came back to do our engagement photoshoot! Little Owl and the staff has been nothing but accommodating for us and so much more! Recently we have been able to do our engagement shoot here at Little Owl and everyone has helped our vision come to life! We just want to thank you everyone who has helped us on this day and it is so much appreciated ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxcnJXaXZBRRAB",
            "text": "Little Owl captivates with its intimate charm and culinary excellence. Nestled in a cozy setting, the restaurant's ambiance sets the stage for a memorable dining experience. The menu is a delightful fusion of creativity and tradition, offering a range of dishes that showcase fresh, high-quality ingredients. From appetizers to desserts, each plate is a testament to the chef's artistry. The attentive staff and personalized service contribute to the overall warmth of the establishment. Little Owl's commitment to delivering a gastronomic journey makes it a standout choice for those seeking a blend of exquisite flavors and a welcoming atmosphere."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMV9MTDZnRRAB",
            "text": "Came here for the meatball sliders but appreciated the menu of simple but delicious dishes including their fries, Caesar salad and beignets. Yes it’s in the “Friends” building so there’ll be folks in the adjacent streets snapping pictures but they don’t bother you. Service was friendly and helpful."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4XzVieWdRRRAB",
            "text": "Iconic restaurant beneath the “Friends” apartment that lived up to the hype!\n\nWent for brunch and will return for dinner.\n\nChilaquiles hit the spot with a good spicy flair. Also had the side sausage patties, which were tasty.\n\nMimosa was delicious and service was attentive.\n\nNeighborhood gem with good reason!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMybWVlT21BRRAB",
            "text": "Absolutely wonderful.  The staff is terrific.  The space is very comfortable and has a great vibe.  Make a reservation because word is out.  Our server was amazing with incredible knowledge of the food and also very helpful suggesting the…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5ak9LVlBREAE",
            "text": "A great cozy place to sit down and enjoy the food under the Friends’ apartment building. The Veal and Roots stew was vey delicious, so was the Eggplant. The Tiramisu ice cream was my favorite! Chef was very friendly."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VObXUxZjdFckx2ODBnRRAB",
            "text": "Service was a bit inattentive. We were ready to order twice but were ignored. Standard brunch items are decent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdHRPRWdRRRAB",
            "text": "Lovely brunch, friendly and attentive service with great food. We’ve been several times and always informal and impeccable. The sliders are essential as are the beignets. This visit we opted for the omelette and French toast which did not disappoint either. Highly recommended."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfekxTT2VnEAE",
            "text": "La comida y la atención es muy buena, contundente pero muy caro para lo que es, un jugo de naranja la cantidad que sale en la foto cuesta $6 los precios son elevados quizás por lo turístico del lugar. Además de eso nada que que decir, la comida estaba exquisita!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIb3RyWklREAE",
            "text": "Loved the branzino. The cocktails are delicious.\n\nA bit disappointed by the tomato salad (tomatoes were bland). Fried calamari is mid. Fried duck is mid."
        }
    ],
    "reviews_count": 79
}