{
    "name": "RedFarm",
    "place_id": "ChIJx3LV_bWAj4ARlW17cSsmwp4",
    "grid": "MN2",
    "address": "529 Hudson St, New York, NY 10014, USA",
    "rating": 4.5,
    "user_ratings_total": 680,
    "phone_number": "(212) 792-9700",
    "reviews": [
        {
            "date": "2일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSNVRHVnFlbnA2UkRBM1FVWTFOVGx0U1dGdFFrRRAB",
            "text": "Great experience! Excelente servicio, especialmente de Roberto (si pueden pidan que el los atienda). La comida deliciosa, los tragos bien servidos y el personal amigable. Súper recomendado."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMlRrNWZXbXB6WDA1aWREbFROblZ0TWtoWlNXYxAB",
            "text": "I recently had dinner at RedFarm on Oct. 14.  I come to the city every year and I have been planning on visiting every time to get my hands on those Pac Man dumplings.  Something always interfered though; I didn't have time, I came when this location was closed, etc.  But this year, the stars aligned and I finally got my dumplings.\nThe food here is no joke.  We tried the lamb meatballs (I believe they were a special), the duck tacos, the dumplings and I had a Basil Peach Cobbler mocktail.\nWe had reservations, but I was a bit late due to my misunderstanding of subway routes.  My friend had already arrived and they assured him it was not a problem at all.  When I arrived, we were seated at the long community table.  I was worried it was going to be a tight squeeze, but there was not an issue there at all.\nOur server (unsure of her name, but she was a lovely blonde wearing a Wisconsin sweatshirt) was very kind and attentive.  The atmosphere was quaint and homey and the food was divine.  I will be returning to RedFarm on my next visit and many future visits as well."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzdFQwaHdTa3hZTjI5cmMwSjZlbFV3WVcxWlJFRRAB",
            "text": "We first fell in love with RedFarm during dine-in visits — the food, mocktails, and overall experience were fantastic — so when it came time to plan a celebration, we knew exactly where to turn.\n\nThe team was wonderful to work with from start to finish. Communication was prompt and helpful as we explored menu options and coordinated logistics for pickup. Everything went smoothly on the day — easy pickup, friendly service, and the food was incredible.\n\nThe Peking duck was the star of the night and fed our group of about 20 beautifully. Everyone loved it, including those with gluten-free needs who were well accommodated. It was our big splurge for the celebration, and it was absolutely worth it!\n\nHighly recommend RedFarm — both for dining in (don’t miss the mocktails!) and for catering special occasions."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5VlpGbHpjVXd3Vm5aMVYydGtSREJ6WlVSWU5GRRAB",
            "text": "Robert best there is"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wZlp6TnNMVE01WjJkaFZtWXpabVJaYzFkb2MxRRAB",
            "text": "Great as always. Have been to the upper west location, and wv location is just as good. Roberto was the man. Will be coming back"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vd1IyTTJhVzg1ZFdoQ1lUQkhZbU5uTW10T2FYYxAB",
            "text": "Red Farm is back!!! Duck is as good or better than I remember it (make sure to call ahead to reserve).  Cocktails were delicious. Chocolate soup dumplings for dessert were also a highlight."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOa2JtNTFMV1Z3TlVoelltbE9kazVoVlUxNVlVRRAB",
            "text": "Insanely overpriced mediocre food that anyone can get for 1/3 the price at 100+ similar restaurants in Manhattan"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OaWNXZDFWVlJwTjB4SWRsaG5aRU0zZFhoR2FYYxAB",
            "text": "Ordered delivery. What happened? We used to love red farm (and still like the UWS location) but the new version is just low quality, bland, and poorly cooked. Our food was a disaster. Please return to your old version!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWQlJITTJOMDVHUm5wVGVVVmphbnBYYjJ4aFZIYxAB",
            "text": "We loved our time here. Great service and food must go here!!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMydm9XWjV3RRAB",
            "text": "We finally went back to RedFarm in the West Village with my parents—our first visit since 2020—and it was just as amazing as we remembered. The pastrami egg rolls still an unbeatable favorite. Service was warm and attentive, making us feel right at home.\n\nAfter so many years away, it was really special to see that RedFarm hasn’t lost its magic. Can’t wait to come back for the duck!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsemIzbFFTRzVZUTNWdWIyeDZhbTFHYWpoQ01XYxAB",
            "text": "So happy this spot opened back up. Everything on the menu is a 10/10 and the service is incredible. Can’t recommend this place enough."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVd2RtNW5SRkJVVjFWR09UUldUbEJtZFdKcFIxRRAB",
            "text": "Something has gone awry in their reopening. The food is bad. Like flavourless and low quality, but the prices are through the roof. We didn't even finish our dishes it was so bad. The service was mediocre at best. I don't know if they are trying to find their footing again since reopening, but if you eat at their other location and then come here it is night and day obvious that something is wrong with the food and staff since they opened their doors again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWamRsRmphVW8xVnpjM2NreE9ja3RJWjFSc2RWRRAB",
            "text": "Playful Chinese food with a modern twist."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOaWNtdDVaMlZhYld4UVptbExVR2RaWVdOTWFsRRAB",
            "text": "Great cocktails and the fried rice was amazing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCalRFSjNOazlFZGxSNE9YTnpOV0l4Vm1oWmRtYxAB",
            "text": "The reputation seemed inflated until my meal proved it was deserved. The people working here elevate the experience significantly. You get location-appropriate billing at this place. Delicious preparations with responsive staff in nice surroundings. This restaurant excels from start to finish."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGaWJIWXlNRWhPWm5OblEwUmxhV3BmTUd0TE1YYxAB",
            "text": "Please stop claiming items are GF if they are cross contaminated. It doesn’t matter if you cooked with GF ingredients if they then come in contact with gluten through shared equipment. A little gluten is not free of gluten. You wouldn’t call an item nut free if it came into contact with nuts. Please stop this."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5WlNWRlVOVmx4UzBOWlNuSnpiRmc1T0UxWVJYYxAB",
            "text": "We were lucky to have a sneak peek of their Peking duck before it returns to the menu… exceptional (I’m Chinese) ! Everything else is super tasty too! Particularly the summer corn and oxtail dumplings! Will return for more!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RelpUbDZkVzFvUTNOTlkzQlRZMFphV0VGR0xXYxAB",
            "text": "Becoming a favorite dinner spot in the city! Service is great, super friendly, casual, comfortable atmosphere. Food is amazing – the pastrami egg rolls are life changing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUmNrSjJjamxGUnpaa1pUVkhWM1pSV0V0dmNtYxAB",
            "text": "We had to wait an hour in the store for a pickup review we ordered ahead of 3 hours ahead of time. But that is NOT what prompts this bad review - the food was extremely mid. To wait that long for food that tastes worse than a generic Chinese joint is a joke. Their prices are also eye-gouging compared to similar spots."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwT00xbEJUbnBrTVRSMFIxTmZUR1F6T0RGUU9GRRAB",
            "text": "We decided to try Red Farm because of their gluten-free offerings. I ordered the crispy vegetable & peanut dumplings — gluten-free option. Apparently these dumplings are always gluten-free, but the gf option is to sub out the soy sauce for gluten-free soy sauce. The dumplings were delish. I can’t wait to go back and try other dishes!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwMVFtZHhSWHBaZUY5TVMwRnZVRGxwYlVOT1pYYxAB",
            "text": "I am a huge fan of Redfarm Broadway and I finally had the opportunity to visit the west village location this holiday weekend. Kendall was able to accommodate my goddaughter and I with barely a wait. Our waitress Maria was very nice and helpful. They both made my goddaughter’s first solo birthday trip a success! Thank you all very much."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSFNHNDRXR1pqZDFwaFEzbFdWV1ZNVFRoTVZXYxAB",
            "text": "Really good food but definitely overpriced and communal seating is really not it…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNRzY3dlhJOGVULUhREAE",
            "text": "AMAZING SPOT. The drinks and food are so good. Come once a week at least."
        },
        {
            "date": "수정일: 5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3MWJyWDhBRRAB",
            "text": "La comida es buena"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJZzlfSEtBEAE",
            "text": "The restaurant is a gem; one of my favorite neighborhoods in New York.\n\nEvery dish was delicious. The vegetable dumplings were almost too pretty to eat, the scallion pancakes hit all the right notes, and the duck fried rice? A standout that I’m still thinking about. Albert, our server, was extremely welcoming; he made us feel completely at home.\n\nAlready counting down the days until my next visit.\n\nThis review was made in connection with a Toast promotion."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbU9QVmh3RRAB",
            "text": "They are finally back!!!\nFood and service was great as always 😍"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCeHZUdVNREAE",
            "text": "REVIEW AS OF 1/17/23 - RedFarm closed due to kitchen fire, did not see it on website anywhere.  Doesn't matter, still the best Chinese food around"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtaXFYVlZBEAE",
            "text": "Amazing food and very pleasant service in a cozy environment."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtalBYMUpnEAE",
            "text": "First I would like to thank the host for being so accommodating.  We were on the run to have drinks elsewhere and some nostalgia struck as I walked by.  It's been almost a decade since I have been here.  My date had never been.  With no reservation and very little space he squeezed us into a booth and let us order some dumplings and a cocktail before our next destination.  Japanese old fashioned and dumplings hit the spot!  🙏"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtOUo2YUx3EAE",
            "text": "Hands down my favorite restaurant in NYC! Incredible Chinese food, great vibes, amazing service!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtLU1lS1dnEAE",
            "text": "Generally the food was pretty good, we came for the Peking duck and had called in ahead of time to reserve it.\n\nShrimp & truffle dumplings: this was delicious, so rich and flavor (but $$$$)\nShrimp stuffed crispy chicken: this tastes the best when hot (and crispy obv), very interesting but I think the chicken itself lacked a lil flavor.\nPeking duck: the duck in general was good but I wouldn’t say it is authentic unfortunately. They gave plenty of cucumbers and green onions though, which was good!\nLobster fried rice: also $$$$$ - the lobster was a bit fishier than I had originally expected and the rice a bit soggy unfortunately.\n\nThe drinks were also pretty good and we liked the vibe as well! Definitely an expensive place though"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNGZLTDNRRRAB",
            "text": "Great duck, crispy skin with moist meat. Pancakes were thin and warm. However that and the foie gras bites were the only highlights of the evening.\nWe got a few apps and most of them were overcooked until a chewy texture. The scallion pancakes tasted a bit burnt as well. Mains were well done but not worth double the price of Chinatown.\nThe ambiance was probably the worst thing about the place. 6 of us were sat at the end of the communal table. Everytime someone comes in and out of the door, strong winds would gust through. They also squeezed 2 chairs at the end of the table to fit 6 of us. Besides, it was my friend's birthday. We saw another table celebrate with chocolate cakes on the house so were really excited for our friend. They were closing up the restaurant and the manager/ waiter came to our table, told us there are no more chocolate cakes. Then the waiter just came and put the bill on our table. They made the birthday girl feel so awkward and made us all feel unwelcomed. Understand it was the end of the night and everyone was ready to go, but we were also delayed because the restaurant was backed up. Such a weird experience, and deffo not a good place to celebrate birthdays."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcy1YM2x3RRAB",
            "text": "The duck is amazing"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbXU2S29RRRAB",
            "text": "The atmosphere is welcoming, the staff is wonderful and the food is something you have to experience. The pecking duck is soft moist and the drinks are really good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlc3EzdThBRRAB",
            "text": "The food was terrific.  Particular standouts are the duck lettuce wraps (you roll yourself) and the chicken/mushroom dumplings.  The service was good and the food came very quickly.  The place is pretty pricey though.  We got a shrimp/scallop fried rice which was great but not much better than what you'd get for $10 elsewhere (it was $34).  Soup dumplings were also great but you get fewer for twice the price of the Shanghainese places around town."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlbXRESjFRRRAB",
            "text": "Exceptional service. Our table was running a bit late which we were fine with but the manager/owner sent over appetizers on the house to thank us for our patience. He and our server were extremely attentive all evening and the food was absolutely delicious as always."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1dDQzcENnEAE",
            "text": "Excellent service, the food could be better. I think some plates lacked flavor. I would avoid ordering more than one fried plate. The BBQ beef was great and there are a lot of options on the menu. I would come back to try something different."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1bnVyWEpREAE",
            "text": "Creative and tasty food"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1cHJMVWxnRRAB",
            "text": "RedFarm is by far the best dining experience we’ve had in NYC. My husband and I visited this week and chose to sit at the bar in the basement, which was an excellent choice. The service Larry delivered was phenomenal and the food itself was exceptional. The entire experience was so positive that we ended up cancelling a reservation we had the next night at another neighborhood restaurant and re-reserving RedFarm. We again chose to sit at the bar because of Larry’s service and had yet another perfect time. We were made to feel so welcomed back and cannot wait to visit again. We can’t recommend RedFarm enough and highly recommend asking for Larry when you visit, as his service and attentiveness truly made this the absolute best experience for us. Thank you again!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dUpLd3h3RRAB",
            "text": "I just finished a meetup dinner at RedFarm with five lovely folks. The atmosphere and cocktails were fantastic. However, there were three big problems with the the food: 1) the extensive menu gave no details about the food, and yet most things I had were bizarre in some unpredictable way; 2) the food combinations within one dish did not work; and 3) the food was cooked poorly. Furthermore, the wait staff offered no explanations, nor did they ask how we enjoyed the food. While perfectly efficient and responsive, the staff were obviously completely uninterested in whether w the  the food or experience was pleasing.\n\nI split two starters with a dinner friend: the pastrami egg roll and the arugula, mango, and yuzu vinaigrette salad. My second course was duck and crab dumplings. Then I wanted to finish with a strong finale: the lobster fried rice.\n\nThe salad was fine; a bit overdressed and not great fruit, but the flavors were good. The egg roll had a fantastic mustard, but the pastrami seemed overcooked and seasoned Taichung that it took on a beef flavor. Then it got bizarre.\n\nImagine in your mind what duck and crab dumplings would look and taste like. Now, what I got was a massive plate with four gigantic dumplings, fried with a thick layer of batter and a brown vegetable curry in the middle with tomatoes (which I hate) and close-to-raw broccoli “for dipping.” The dumplings tasted like oil with poor duck in them. Instead of the flavor of crab, there were tasteless shrimp sticking out of each saucer of fried disaster. I cannot express how disappointed I was. I would give it a 1 on a 10-point scale.\n\nThen came the wait. A long wait made me think they were cooking the lobster fried rice with care—taking the tender lobster meat and mixing it with a high-quality fried rice. No. What came out was a gigantic plate with a bland fried rice cramped at the bottom, unmixed with anything. The next layer up was a heap of sweet corn. (Why?) The next layer up were many virtually uncooked and unseasoned Brussels sprouts. What? Then, sticking out of the sides of the plate was a wildly over-steamed whole lobster, claws and tail clipped. Can you imagine anyone would ever order fried rice with sweet corn and Brussels sprouts and lobster? It’s totally bizarre. Of course, I was going for fusion and quirkiness with a lobster fried rice, but this was a $59 disaster. I barely ate any of it. But I felt wasteful—as did my dinner mates, who were also disappointed in my food—so I picked out the lobster and took the rice, corn, and Brussels home. I figure I can take out the Brussels, reheat the corn and rice and have a meal. Then I can fry up the Brussels separately and have them in a pesto pasta or something. Anyway, did the waiter ask if I liked the virtually uneaten lobster. Nope.\n\nSo, the morals of the story are: go here for drinks and atmosphere, not food; if you get food, ask the waiter to list all the ingredients, or expect the bizarrely unexpected; and don’t expect you wait staff to care what you thought of anything."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1b01lWXhBRRAB",
            "text": "Very interesting place, if you think about it as a modern American style decor, combined with Asian cuisine. It's almost like going to top chef and getting served with all Asian cuisine types. Well they're picking up wasn't as good as the Peking duck house, several of their beef dishes and veggies were actually quite good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1a1pxclh3EAE",
            "text": "Honestly, the food is pretty good, but not the best value. The Peking duck is one of the best I’ve had in nyc so far… but not the best I’ve had for what I’m paying. Dumplings were delicious, but for ~$20 avg. for 4 small dumplings, it’s hard to justify that spend. However, since I did enjoy my meal, I would come back for the right occasion."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1dHMyeWt3RRAB",
            "text": "My favorite Asian restaurant. Everything is just delicious. Can’t go wrong with anything you order.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1X0tyb3dRRRAB",
            "text": "Delicious food and drinks!  We will be back to try more of the menu. Service was excellent."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1aExMdFp3EAE",
            "text": "Food ok. Good service. Over priced. Trendy and cute but probably won't return."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdjZ6NHpRRRAB",
            "text": "But why does it have to be so hot inside? Seriously."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPd2FfVFFBEAE",
            "text": "Awesome food."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPX3JIZDBRRRAB",
            "text": "Comida buenísima y servicio muy atento. Un must cuando venimos a NY. Las raciones son grandes!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPN29PV2x3RRAB",
            "text": "Come for the DUCK, stay for everything else!!! (Try to reserve the duck when reserving the table).\nSimply great food, service, and atmosphere. (Sitting is on one long commune table).\nGood for family dinner as well."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPN3I3VDJnRRAB",
            "text": "Came for the duck which was great, but the other dishes and small plates were stunning. Each just set off a surprise of flavors in your mouth that was amazing experience. I haven't had this much of tasting experience in a long time. Among our favorites, Shrimp and Crispy Duck Dumplings, Pastrami Egg Rolls, Spicy Crispy Beef. Just typing those names in makes me start salivating.\nA great time with friends in such a fun environment."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtLXMyVllnEAE",
            "text": "My partner is a great fan of Chinese food, while I’m not a huge one. She enjoyed every bit of our evening and admittedly so did I!\nThe cocktails were very creative and complemented the dishes nicely.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNtMnBsdxAB",
            "text": "One of our new favorite restaurants!  Super fresh, elevated Chinese. The Peking duck hit that perfect sweet spot between crackling skin and succulent meat.  The pea vine in garlic sauce, bacon and egg fried rice, xiao lang bao were all outstanding. Plus everyone was so nice. A perfect Christmas lunch in NYC!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNndE5Temt3RRAB",
            "text": "Another great restaurant that serves dim sum in a cozy and comfortable place. I feel it's super high end Chinese food because their putting exotic ingredients like black truffles. The staffs are friendly and attentive. The food was jam pack…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2aVlqZHVBRRAB",
            "text": "The food here was amazing! The Peking duck was absolutely delicious, but all the other dishes were also very good. We ordered a few to share - lobster, fried rice, and soup dumplings. Our server was super friendly and gave us great recommendations of dishes to try!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5blBQanR3RRAB",
            "text": "For Chinese food this place was surprisingly very good. The interior is very simple and all space is used for maximum seating (obviously not during Covid). The servers and service was exceptional. We were advised to order with our gut and they were not wrong.\n\nThe drinks were delicious, not sweet but smooth.  The food was well prepared and flavorful. We odered the crispy beef, chicken dumplings, snow pea shrimp sumplings, egg roll (massive), crispy fried rice, short ribs, three chilly chicken and key lime pie. All were delicious but the three chilly chicken wasn't anything to rave about."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNndjY2Wnl3RRAB",
            "text": "Delicious food and a great selection of drinks! There are so many options of dumplings that it was impossible to try all of them in one sitting. The dumpling flavors were unique and beg for a return back soon! The rest of the food was just…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHMTVDSUJREAE",
            "text": "Oxtail dumplings: outrageously delicious.\nCrispy beef: so crispy that I wondered how it was made, and what percent is actually meat.\nPeking duck: I thought the pancakes were especially tasty and texturally nice for their flour dusting. The duck itself I liked, but no more than the Peking duck I've had at lower prices. It's served with three sauces, one hoisin-based, one with I think cranberry that was interesting, and ordinarily there's a peanut sauce that we substituted for the hoisin sauce due to a nut allergy. It's also served with miso-based shot (to drink!).\n\nOnly criticisms are the price point mentioned above, and the fact that we were seated at a communal table. At this price, that surprised me."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3ajhLUWtnRRAB",
            "text": "This was a fantastic dining experience. The food was delicious. Staff is extremely friendly making you feel at home. This cocktail has paw prints which is amazing and sooo tasty. My favorite was the ox tail dumpling."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURReUlqY0J3EAE",
            "text": "A nice modern twist to Chinese food with communal tables and some private booths.  The service provided by the restaurant staff is exceptional! The dishes brought out are really fresh and very tasty.  But they do not offer a side of white…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2cUwyakV3EAE",
            "text": "Every dish is delicious and all staff is friendly. They gave us duck soup shots while waiting for our food (not for too long). Best Peking roasted duck in Manhattan!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURncnNhbjV3RRAB",
            "text": "We were so lucky to get a table without reservation! You must make a reservation otherwise you might end up waiting outside.\n\nIt is a bit pricey (otherwise I would have given it 5 *）but every dish we had was super delicious. Oxtail dumplings, pork & crab steamed dumplings, yuzu wasabi prawns, pastrami egg rolls, roast duck noodle and smokey chicken are Not your everyday traditional Chinese dim sum and dishes so don’t try to find them in Chinatown because you won’t find them.\n\nThese are unique recipes that work very well with Chinese and Japanese ingredients combined.\n\nOur server, Wilson is absolutely brilliant!! Very friendly, helpful and recommended popular dishes for us."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvMzdDNnd3RRAB",
            "text": "If I could give Red Farm more stars I would. The service was really good. All the food we had was amazing: The bbq beef fried rice, shrimp dumplings, and pastrami egg roll.\n\nJust ask the server for some of the popular options. Either way, you won't be disappointed."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNneWZQYTd3RRAB",
            "text": "Was really tasty and deff different! I recommend everyone come here at least one while living in NYC. The only thing is that it gets really really loud and almost uncomfortable. But I still give it the 5 stars because the GM was really nice!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHMllMRlFBEAE",
            "text": "Hands down the best Duck in the city. PacMan app is a mush try, Pork Belly for days, and their cocktails are great too. They even have high-end Tequila which is a unexpected treat."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwXzVudzd3RRAB",
            "text": "RedFarm held the #1 spot on my go-to list of slightly-expensive-yet-casual-enough-for-a-weeknight restaurants in NYC during fiscal year 2018. This is my first time back almost a year and the food is as tasty as ever. I suggest sharing…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvbm9hVWtRRRAB",
            "text": "INTERESTING MENU. Very popular, Food looked amazing. Sat downstairs at the bar next to two other ladies and chose from the Decoy menu. The staff were very friendly and welcoming. A very chilled and smooth atmosphere. Nice to see such a team feeling from staff really wanting people to enjoy themselves. I enjoyed duck and ginger rice with a side of asparagus in garlic. They went together perfectly and the garlic sauce went well with the rice. Accompanying this with a very pleasing glass of Malbec.\nDefinitely coming back to try more from the menu..."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPOE1qc3hnRRAB",
            "text": "A bit pricey but well done. One of the best Peking Duck in the city. The skin is well rendered and shattering crispy. Pricey dumplings but innovative interpretation of traditional dumplings."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVdC1UOThnRRAB",
            "text": "Excellent and a must visit place in NY. Dim sums, duck, beef or fish are tasty and fabulously prepared. Good cocktails ! Nice area ! Staff are friendly and will suggest good combination Take the time to eat there"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMXViRTRnRRAB",
            "text": "Note, you can’t make a reservation so be prepared to wait. Although you may not expect a good salad, the salads are tasty.\nThe pork buns are very sweet. Sitting in one long table is kind of fun. The cod…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwdVp5Y1JnEAE",
            "text": "Originally we were 4 people for dinner at Decoy, but then a local friend wanted to join us; however no space in Decoy so they accommodated us regardless and moved us up to their sister restaurant Red Farm, and still honored our wanting the…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHNmIyOHB3RRAB",
            "text": "Got a basket of 4 crab and pork soup dumplings for 19 dollars (!!). The skin was thin, but it had a noticeable pleating especially since there was a smaller filling that breaks apart easily. Each dumpling packs an adequate amount of soup, but by no means a respectable amount compared to other places in the city. The soup was a little bit lighter in flavor and tastes a little like shrimp, but the crab is nowhere to be found. The goji berry at the top was a good touch. Overall technique gets a 4/5 and flavor gets a 3/5.\nThe cocktails are fairly unique and complex, but nothing was particularly exciting."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5dS1icXN3RRAB",
            "text": "Yes! Elevated Chinese! Very cool and unique basement floor is even cooler than the one on top.\nMust preorder Pecking Duck. Must have. And get there before it gets too crowded to squeeze in!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLMjlTaThRRRAB",
            "text": "Upscale, modern Chinese, with a casual and laid back vibe. The food was incredible - each dish was better than the last. This place is a perfect west village gem!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtN3ZtXzZRRRAB",
            "text": "Red Farm never disappoints - the 2022 limited Chinese New Year's specials are super yummy. Duck fried rice, grilled bbq octopus with ramps and my personal favorites - chicken and truffle soup dumplings and shrimp stuffed crispy chicken.\nShould you go for their regular menu - shrimp and truffle dumplings and the bone in NY strip steak are a must!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXcHFqb1hBEAE",
            "text": "Wonderful place for birthday dinners. They come w a pre fixe menu for large parties. Drinks are strong, and servers are attentive. Peking duck was phenomenal z"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMya1lEVDVnRRAB",
            "text": "Basic & bland East-Asian fusion fare, mixed with some dishes of dubious origin. Tried 2 mains, 2 appetizers and dessert -- the best were the least Asian (beef tarts & key lime pie), which says a lot about the quality.\n\nBasically pretentious PF Chang's, or something asian-seeming for people who aren't really fans of Asian food (like to Buddakan, but with worse decor). Maybe a good spot to bring grandparents who aren't adventurous.\n\nThat said, the wait staff and hosts were lovely and service was excellent!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNFa091MEpnEAE",
            "text": "Wow this was amazing! Clean and beautiful interior and the food was outstanding! Oh and their watermelon juice and peach tea! We will be back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyNFpxWVFREAE",
            "text": "There were over 10 of us, so we got the pre fixe menu. The order the dishes came out in was haphazard and the timing was a bit off as we were drinking a lot in the beginning. Everything was delicious but must get are: oxtail dumplings, duck. Lobster, egg,  foo yung like dish was also delicious. Would definitely come back."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJN09HYk5nEAE",
            "text": "Delicious food, with a mix of the traditional and innovative. The crispy beef and the bbq duck fried rice were definitely worth a taste. Heads up that it's a tad on the pricier side."
        }
    ],
    "reviews_count": 79
}