{
    "name": "Ramen Misoya West Village",
    "place_id": "ChIJ3XHVpEtZwokRdiVb19vfuNE",
    "grid": "MN2",
    "address": "535 Hudson St basement, New York, NY 10014, USA",
    "rating": 4.6,
    "user_ratings_total": 211,
    "phone_number": "(646) 368-1101",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201VGRFbEtXVWRJUzJONFdta3pNVVJKVGpGSWMyYxAB",
            "text": "I had a little trouble actually locating this place until I finally saw a sign pointing down stair steps to the restaurant. It's a nice quiet restaurant with ample seating and great service. I tried the Kome Miso Spicy Ramen, which was outstanding and a huge portion for the price. I'd love to come back in the winter because it's a cozy space. It's a great spot for high quality ramen!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4Mk1FUTBUbTlFY0hwUU5UUTBaM0pIYUdKTVptYxAB",
            "text": "The best ramen in town, with fresh ingredients and great service."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMGMyTlhUbXgwZWtjMGJFdDBkWEpJTFRoTVZtYxAB",
            "text": "TRY BEST MISO RAMEN IN NYC West Village ‼️\n\nJust had an authentic ramen experience at Misoya hits every note 🗒️ Don’t miss their sidewalk sign 🪧 it’s on the lower level, absolutely a hidden place.\n\nWhat’s the best part ❓ Miso-Based Ramen.\nI’m so satisfied with the special new ramen “Midnight Ramen” 🍜 OMG, it comes with rich soup (black broth) with Margret duck breast. The meat cutlets were tender, savory and balanced perfectly with the miso. Wowww, this is the best special ramen ▪️\n\nAll home-made Chicken Ramen ❓ It comes with heavy creamy chicken broth with a hint of house blended white miso. I’m obsessed with home-made meatball, a big, tasty and delicious surprise ✌️The broth is deep and full of taste.\n\nThe popular appetizers - Pork Gyoza 🥟 Chicken Karaage 🍗 Takowasabi 🍣 All of them are decent, I’m just truly grateful of finding this place. If you’re craving health & authentic homemade ramen, this is your place"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOaVZrRnZZVEJGUzJGTlpYSklNa3BxTVZaSmRVRRAB",
            "text": "This place is in the located in the basement to the left of a bagel shop. It might've been used as a storage or waste disposal space in the past but the restaurant did a good job of renovating the space into a more welcoming atmosphere (once you get past the front door). Inside there were a few tables and counter seating in the main dining area. There were also slightly larger tables further in but the lighting seemed really dim there for some reason. The bathroom is beyond this area so the walk there was also a quite dim but at least the bathroom was cleaned and well stocked.\n\nI didn't realize till after I ordered but apparently they also have lunch specials! Will have to check it out next time. I ordered the Shiro Miso Cha-Shu Ramen and boy was it a lot of food! The chashu was okay, I wish it was slightly more smoky. I appreciated the copious amounts of bean sprouts as a beansprout fan. Below that were a good amount of ramen noodles. The soup wasn't too salty or oily, very drinkable (though probably not a good idea).\n\nService was attentive, the waiter refilled my cup of water whenever it was not full."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjNVVqSkhhVW95T1hrNVUzUlVXVXhNTmpKM1NFRRAB",
            "text": "Surprised it's been  around so long"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKRVMwNHlMVzlmZFRkUGNGRjJjR0UwTFY5UlRFRRAB",
            "text": "Patronized this restaurant.  The service was terrible and so was the Food. Please stay far from this place."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKR05uVkhTazV4U3pkNGFWOXhUamh2ZWs1UExVRRAB",
            "text": "small hidden staircase, that is easy to miss, lead you down to a small heaven of good ramen with brick walls and small wooden tables the gives the place the mysteries vibes that needed to make the whole experience memorable. As a Ramen 🍜 lover, usually a Ramen with many ingredients is likely to fail, but here the MISO CURRY CHICKEN KATSU RAMEN, is a big , tasty, delicious surprise 😳😍♥️ it comes with\nRich Curry Flavored Miso Soup Base.Topped with 3 pcs Crispy Chicken Cutlet,\nGround Pork, Bean Sprouts, Cabbage, Scallion, Corn, Fried Potato, Menma (Bamboo Shoot), Fukujinzuke (Pickled Daikon Radish), and Miso Egg. The chicken cutlets were tender, savory and blended perfectly with the miso, the ground pork gave another deep aroma and interesting aroma and taste to the whole Ramen. One of the best spicy special Ramen I ever had. The staff is nice and welcoming, the atmosphere is nice and gives the perfect vibes for the good food they serve here. A Must"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxS09EWlBiWE4zWmxGbVZUaHdTM1pUV0hkWlIxRRAB",
            "text": "Their team understands what hospitality really means. The portion was big enough to satisfy. The atmosphere and design here will please those who notice such things. Client attention shows remarkable quality! Incredibly flavorful cuisine throughout!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sZkxWaFZhRFE0Y0hCWGF6UmZOekpDTVZWbk4yYxAB",
            "text": "I really enjoyed myself. The food was prompt and fresh. The portions were very big and we all left feeling full and satisfied. They also serve imported wines which was a really nice touch. I will be returning."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kWWVGUlRTVFJUWjBSRFdWbGZUMlZ0Wld4cGFrRRAB",
            "text": "the food and the atmosphere here were incredible, I can't wait to go back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWFRITm9kWEJ5VDNCM2MxZFRjRFJmVTJSUmJXYxAB",
            "text": "Excellent food, great service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoek1tOXdiMWxpTmpKcE5VOXpTMW96UkdsSFdGRRAB",
            "text": "Good (and I mean... Good.., if you tell me ippudo is good ramen (they used to be good... Like 10 years ago), just disregard my post please) ramen places that are not ridiculously crowded during peak hours are rare gems in popular nyc areas... I really should keep this place a secret and have everyone go to danbo or menkoi Sato..."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201NGVsWTBSVlYxZG5vMWRWUTFaRlpFY1hsVlQzYxAB",
            "text": "The most delicious ramen 🍜 only here! ✨"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nMWFUSTNWM0ZWWTJ0V1pISnhVUzFKU2pWcmVWRRAB",
            "text": "Karage and ramen are amazing here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSVpFUm5ZVU5EYUc1bWFEVlFObFZ1TTBWYWMyYxAB",
            "text": "A nice place where you can eat authentic Ramen! Really good vegan options! We loved it"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRM1FYaExWRTVaYkdFeE5HdHNYekZEUlVsTGVHYxAB",
            "text": "Good food, good portions"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWGIwZFNabU5pZWtObWRuTXlPRXh1VDI1V1ZtYxAB",
            "text": "A very good food, nice staff, highly recommended"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MlRsZHZSbTR0Um1SRlZYSTJXVlY2WjI5bVZuYxAB",
            "text": "Very good ramen in a variety of styles. Relaxed but sophisticated atmosphere. Good for couple or small group of 4."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJM2NXSjRiMjFxTkdKMFVIcHhkakozT1RGUVgzYxAB",
            "text": "best ramen in nyc!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUmVVaDVXWHBGWWpSeFpYSjFOVWN0VlVSclRIYxAB",
            "text": "Tasty Hokkaido ramen hidden underground. The lunch set was of great value - you got a karaage / salad, a ramen, and a soda.\n\nThe soup was super tasty but I found the noodles a bit too hard and thick."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkR1duSTFZMUZ6U1Y5elFsZENZa0ZzWW5kS2MwRRAB",
            "text": "My favorite veggie ramen (v2 every time) in the neighborhood. Tasty broth and stacked with veggies"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WUFowSTFPR05LVkU5V1QyVXdibU5wUm1Gc2MyYxAB",
            "text": "They have gluten-free tapioca noodles. Win!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbE1XOXBVVXRNUTIwNU5GZzVlaTF6WTBNNFNWRRAB",
            "text": "This is literally a hidden place. You might not notice it even walking by unless you see the sign. The restaurant is in the basement of the building but let that not detract you from coming. This place is worth it. It not good for large crowds but maybe a max group of 6. Great for 4 ppl or couple. The atmosphere is nice. This is like a speciality ramen 🍜 spot for miso. They have 3 different types from Hokkaido Nagoya and Kyoto. The misos vary from dark and bitter to light and sweet.. they have lunch specials where you can mix and match. All the items were good. The karaage chicken was good and light. The black pepper tuna was light and savory. Everything went well with Asahi super dry beer 🍺.\nI recommend coming here especially on cooler day this spot will fill the tummy with good food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RNVRYTnNWR3RJT1RkWk5VZDBSMVZUTUhCRFNVRRAB",
            "text": "Tasty, reasonably priced ramen!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLQ0FnN1dyX01MQk1REAE",
            "text": "Fireeee"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VKM2kxX0x1aTlBahAB",
            "text": "Surprised to know this gem hiding in the basement!! Miso Soup base is smooth, not too salty, just be sure to turn on the phone flash when looking for the light switch of restroom!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMSzBsWmlGNlBpWGtRRRAB",
            "text": "Bright. Casual."
        },
        {
            "date": "6달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZX3AtZ2xRRRAB",
            "text": "Bardzo niepozorne miejsce, które łatwo pominąć przez umiejscowienie ale zdecydowanie warto wejść do środka! Pyszny ramen i bardzo miła i uprzejma obsługa!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdkluSlJBEAE",
            "text": "Honestly so-so."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJejhheE9nEAE",
            "text": "Can’t really speak to the food or atmosphere because I was turned away from eating here. I arrived by myself at 9:34PM on Friday night. The woman that greeted me told me they already had “last call.” I’m here to eat a bowl of Ramen lady not to hang out all night. If any of my staff turned a customer away 30 minutes before closing time I would fire them."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaXFXVjJRRRAB",
            "text": "soooo delicious ramen. thank you"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dkx2UUN3EAE",
            "text": "The absolute best ramen I've ever had, especially for a veggie/vegan. I'd buy their veggie Shiro (slightly spicy) broth by the gallon if I could. Whether pickup or dine-in, Misoya is a true gem and delight. I'm spoiled ... truly don't ramen from anywhere else (nyc and beyond, lol)."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ZzRXMGlRRRAB",
            "text": "I came to Ramen Misoya in West Village with some friends, and it was a great spot to enjoy a bowl of ramen together.\nThis is a contemporary, brick-lined restaurant that specializes in ramen with a miso-based broth. They have a few different types of miso to choose from, including the standard Kome Miso (Hokkaido style), a darker Mame Miso (Nagoya style), and a milder Shiro Miso (Kyoto style). It's a cozy place with a modern feel, and seemed like a nice spot to catch up with friends over some delicious ramen. They even have vegan options available!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cnRET1dREAE",
            "text": "Yummy!! Great experience. My husband and I wandered in here while walking around West Village. It truly felt like a “hole in the wall” experience. We were only one of two tables inside around lunch time which was surprising because the food was great, prices were reasonable, and service was great. Definitely recommend."
        },
        {
            "date": "8달 전",
            "language": "ja",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnMl9YbDhRRRAB",
            "text": "閉店してました。"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnX29MblRnEAE",
            "text": "Absolutely amazing vegetarian ramen. Amazing:"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndHJlQ1dBEAE",
            "text": "Gyozas are great!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBbVBxWnl3RRAB",
            "text": "Amazing service and authentic ramen. Thank you."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfeE91SmVBEAE",
            "text": "Great service! Yummy ramen. Cool drinks selection. However, dropped a full star because if you order an egg ($2!) and get half an egg it’s a bit disappointing. I would specify half an egg on the menu or add the full egg in"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbTR1ZHN3RRAB",
            "text": "Hidden Gem. Our Ramen and edamame were delicious. 😋"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbzdEVldREAE",
            "text": "Good flavorful ramen and gyoza. Chasu was also nice and tender. Would go back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2OEwtTGZBEAE",
            "text": "The reason for the low over all start is because getting charged 2 $ for condiments is insane! I understand if is something that the restaurant makes from scratch, but something they get from restaurant depot in bulk should not be 2$ for a tablespoon! The broth was good, maybe let the patron know when there is upcharge as i would not get it. I came for lunch, i was not offered the deal with additional sides which is included in the price. My meal was 17, the lunch special with a side was for 16. It just left a bad taste in my mouth over all. i wish it was a different experience. If there is modification to the order do you price adjust? ill find other ramen that are more appreciative of their customers."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cjg3aFF3EAE",
            "text": "Sooooo good! It is pretty small so it might not be a great place for a large group, but perfect for a few people! I got the kame miso cha-shu ramen."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQeXVDOGlBRRAB",
            "text": "Every ramen here is 👌🏽👌🏽👌🏽 highly recommend"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNlB6NDRBRRAB",
            "text": "The restaurant is just opposite the company, so I bought a special lunch set for my lunch. The appearance is OK, the price is normal, and the taste is very average. There is too much salt in the ramen soup base, and the whole tongue is bitter and numb after eating it. Because there is really too much salt. As a result, I can't tell whether the soup base is pure or not. In addition, the portion is small, so people with a big appetite are not suitable to come here"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbjZEd1l3EAE",
            "text": "Really cozy quaint place in west village! Delicious miso ramen and wonderful service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYeVlIb1BnEAE",
            "text": "I went here for a first date and it was super quiet and cozy. The food came less than 10 minutes after we ordered nice and hot and it was so good. And the person who served us was really sweet. I’d definitely go back there. And I now have a girlfriend so to me it’s a good luck experience :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYaVk3VUpBEAE",
            "text": "amazing!\nextremely tasty ramen and super friendly host! would definitely come back if we’re in New York again 🥰"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYaWZiZjJRRRAB",
            "text": "Wow, amazing food and an amazing host :) would recommend anytime :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYaTVQQlZBEAE",
            "text": "Finally a ramen place that serves really hot ramen! This place is surprisingly good! Definitely, try the miso ramen!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibnBfTXRRRRAB",
            "text": "A small staircase in the heart of the west village will lead you to a kind of a wide cellar with brickwalls and wooden tables.\nThe ramen is great! And there are so many options to choose from.  The broth was deep and full of taste, and each of the ramens we took was huge - we couldn't finish them.\nDon't miss in the homemade shrimp dumplings. Also, there are many vegetarian options. We came in early and manage to use the happy hour as well!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMEk3djhRRRAB",
            "text": "Misoya is a hidden ramen speakeasy located in a basement down a sketchy staircase in West Village. Once you step in, the restaurant is spacious with warm tone lighting and clean bathrooms. They specialize in all types of miso-based ramen, including Hokkaido, Kyoto and Nagoya style.\n\nWe ordered 3 apps and 2 ramen for two people. Everything was authentic and enjoyable. Highly recommend trying their signature miso ramen as this is what they are known for.\n\n＊Black Pepper Tuna\nThe seared raw tuna sprinkled with black pepper is so delicious and full of flavor. The dijon mustard adds a tangy and sweet flavor that complements the tuna's natural sweetness.\n\n＊Ikura Tofu*\nI described it as a tofu version of chawanmushi. The tofu is incredibly silky and jiggly, literally slipping into my throat. The dashi sauce coated on top has a slight hint of ginger-y flavor. They also give a decent amount of ikura to ensure you have it with tofu at every bite.\n\n＊Ebi Dumpling\nI’ve never seen a whole shrimp wrapped in gyoza skin before. It is so unique as an appetizer and a less meaty appetizer to pair with your ramen.\n\n＊Shiro Miso Cha-Shu Ramen**\nShiro miso is a Kyoto style ramen using sweet and light soybean paste. This type of miso is less salty and milder compared to their two other miso options. We couldn’t stop but kept drinking the soup. The cha shu is seared to give a slightly smoky, caramelized exterior. The meat-to-fat ratio is simply perfect.\n\n＊Cold Dipping Noodles**\nSummer special. I really enjoyed this soupless ramen as it is served cold. Very refreshing on hot days. The dipping sauce is miso-based with chilli powder on the side. The sauce is thicker and richer than the white miso, and the thick noodles hold up well to the sauce.\n\nKeep in mind both ramen come with many bean sprouts. Personally not a fan but my friend loved them."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMZ3JUWWdBRRAB",
            "text": "Absolutely love this place for a hearty bowl of ramen. All three base broths are great and plenty of customisations available, even for vegans.\nReally enjoy the service and the hosts here every time.\nIt's underground, so you'll need to climb down to get in. Very clean."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNicHZIUU9BEAE",
            "text": "Mame miso was very unique, slightly earthy and bitter reminds me of herbal medicine, Shiro miso was white and creamy, mildly sweet and less salty, Kome miso is the most commonly seen miso, combined with curry becomes a super rich and comforting broth.\n\nBesides ramen, all their sides are decent too, especially the homemade ikura tofu, super silky and creamy, I literally gasp at first bite, definitely one of the best tofu you can find in NYC.\n\nFollow me on Instagram @joannekyc for honest food thoughts"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMDdUZlpnEAE",
            "text": "My pastor suggests this ramen place to me so last Sunday I had a chance having launch here. I got a set of launch special. The ramen I picked came with choice of Gyoza, Chicken something and Salad. I wasn't hungry so I had salad. The ramen I had also salty, and I wish I pick something else. Service is good. Recommended."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtbWQ3YlRBEAE",
            "text": "My partner and I are truly grateful of finding this place. By far the best Ramen I personally have had in NYC, and I have been to many. The ambiance is great and the employees are the sweetest. The servings are rather sizeable compared to many other places, yet most importantly tasteful. The location would remind you much of a speakeasy, not being street-visible. We definitely go out of our way and recommend the experience….support! Oh btw get the tea!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwejdQNFl3EAE",
            "text": "A cozy ramen spot with miso-based ramens, cold dipping noodles (seasonal), lunch specials. Located in the basement around the corner from the bagel shop, it appears to have a speakeasy vibe as it can be hidden if you’re not looking for it. Our waitress was super kind! They have bar seating and table seating for groups. Great option for lunch, dinner or date nights.\n\nLunch special includes ramen with your choice of a side for $16-$18. Ramen has thicker noodles and the pork chashu is one of the best I have had in NYC. Egg was perfect and the broth was rich and flavorful. Bottles of prosecco are $25. We were able to get the seasonal summer cold dipping noodles which was delicious, highly recommend for a hot day.\n\nBathrooms are super clean. There is an elevator and an accessible bathroom."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMWRtTzVnRRAB",
            "text": "Large bowls of delicious ramen! They had 3 kinds of vegetarian ramen, each with some customisations available. I tried the standard vegetarian ramen with extra spice, and it was delicious! The portion sizes are large! They also had a side of butter and cheese which was curiously good with ramen."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtbUxMMmNnEAE",
            "text": "We went there for the first time last time and we loved it. It is hard to come by a very good ramen in  NYC, but Misoya is one of the best. We had Mame miso Kara and Mame miso spicy with chicken and the vegetarian with shrimp. Both were amazing. The appetizer menu is great highly recommend the ikura tofu. They also have a good selection of drinks to go with the meal\n\nBeautiful ramen shop, great ambiance and sweet and friendly staff."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXczhuVG5RRRAB",
            "text": "Cool atmosphere in a brand new space. We ordered the kome miso cha-shu Ramen and the kome miso vegetarian Ramen for the main dish, we found both to be less salty than other Ramen in the city but equally delicious. The tuna and spring roll appetizers were great as well. Overall a very nice space to grab a bite with delicious food and a cool atmosphere."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtbWVmV2lnRRAB",
            "text": "Ate here a week ago after touring Cooper Union. Good ramen. Enjoyed the pork dumplings as well. I had the #1 Kome Miso Cha-Shu Ramen and my wife and daughter the #6 Shiro ramen. Everyone left happy. A laid back atmosphere and informal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUNTlxWTlnRRAB",
            "text": "I normally go to the location on 2nd Ave and was around the area so I decided to try this location.  Decorations is cozy and the ramen is as equally as good.  Definitely recommend and will be back again when I’m in the area."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1NmN2TWZnEAE",
            "text": "We were so amazed and happy to find this gem!! We were so hungry and this place was hit the spot! Specially after walking away from Jeju noodle bar. Come here! It’s just a few steps away. They have so many options of miso-based ramen, and since the place is still new the service and amenities are just so nice!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0eTR2QUl3EAE",
            "text": "My friend and I decided to check out Misoya around 7:15pm on a Saturday due to the glowing reviews on Google and Yelp. The restaurant is a bit hidden so when you get to the right corner, just go down the stairs, through some doors, and you will find it! I was shocked that we could get seated immediately, and it seemed like we just beat out the rush. The interior is small and simple.\n\nWe ordered Kome Miso Ramen ($14) and Kome Miso Spicy Vegetarian Ramen ($15). I was very surprised by the price, especially given the location. I am a huge fan of miso ramen, so anything here would probably satisfy me. The highlights of the dish were the chewy noodles and the miso egg! My friend mentioned that the spicy ramen was not as spicy as it could be, so it may not satisfy you if you like a strong kick.\n\nService here was terrific! There were several checkbacks and water refills. The two staff members helping us were so kind and courteous. If you are in the area, warm up with tasty miso ramen at Misoya!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6bXBPTFdREAE",
            "text": "Hidden spot\nThis restaurant is located in the basement and has two sets of door.\nOnce entering the restaurant, the interior is nicely lit and kept clean.\nService wise, because there was only one waitress who was taking care of everyone, it felt a bit chaotic. The table in the middle was being used as a take out order preparation station. Overall she was able to take care of everyone just took a bit longer.\n\nFood wise, i ordered karaage and shiro miso cha-siu ramen.\n\nThe karaage\n>The exterior was over-fried to a dark brown color. Not much of seasoning for both the batter and the chicken.\n>The chicken was juicy.\n>The dipping sauce was an interesting mix of soy sauce, vinegar and scallion. It’s unique, but definitely did not go well with the overcooked karaage.\nThe only upside is that there were 6 big pieces of chicken if you care about volume.\n\nThe ramen\n>The broth was light, not too salty but also lack of depth.\n>The chasiu was greasy in a sense that when i bit into it, that’s all i could taste. Perhaps next time I’ll try the broth with a  richer flavor.\n>The fried tofu, perhaps because i didn’t eat them immediately, instead of being crispy, the exterior was sticky/chewy.\n\nThe best part of that bowl of ramen was probably the bamboo shot.\n\nI was excited to try this restaurant because the rating was quite high. Perhaps i tried the wrong type of ramen. Will try to go back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbU9PZG9nRRAB",
            "text": "Came to Misoya because unlike most tonkotsu-focused places, they specialize in miso. They have 3 regional varieties of miso: Hokkaido, Kyoto, Nagoya. I got the Goma Tan Tan Ramen because I wanted something spicy and different. The thick dense ramen noodles were paired with a delicate miso broth dotted with chili oil. It took me back to 10+ years ago, getting Sapporo ramen in a tiny Japanese food court in Cambridge MA. You can taste the kansui that keeps the spring in the noodle. I regretted not getting the Kome Spicy Miso because the butter and corn would’ve added a nice silkiness and sweetness. Overall a decent ramen, but I didn’t feel like finishing the entire bowl."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyZ1lpMW5BRRAB",
            "text": "Excelente por su relación-calidad precio. Algo oculto, se sitúa en el sótano de un edificio, y debes acceder bajando una escaleras. Ramen picante con pollo y ramón de cerdo muy sabrosos. Quedamos completamente satisfecho con la cantidad. Precio por persona 20-25 dólares con tips."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKb1lQeVpREAE",
            "text": "Honestly really enjoyed this place, the karaage was hot and juicy not seasoned much but the sauce was a great compliment, the ramen was delicious, not much usual style of ramen but definitely would come back. Excellent service as well."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxOGFXLTRRRRAB",
            "text": "Great ramen spot in WV, tucked in a nook but actually very spacious inside. Ramen and various miso soup bases were all excellent and not too salty, esp the Shiro Miso.\n\nUpdate: They also have cold dipping noodles for summer!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbW92MEJnEAE",
            "text": "Cudowne, kameralne miejsce, świetny ramen, porcje duże, nie do przejedzenia, obsługa kompetentna i przemiła 🩷 Uwaga! Restauracja zaznaczona jest na mapach nie bardzo dokładnie,  więc łatwo ją przeoczyć, my o mało jej nie minęliśmy 🫣"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1eVpPbTVRRRAB",
            "text": "Cold yuzu miso ramen is absolutely what I needed during this hot summer!! Enjoyed the noodles. The interior of the restaurant was clean and nice. Would wanna come and try something else in the future!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdGFIdkt3EAE",
            "text": "Excellent, wide range of ramen options. Ultra tasty. Nice staff. 2 years later, no difference."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbS1EWFNnEAE",
            "text": "Basement ramen restaurant with a focus on miso-flavoured ramens. Had the chashu ramen which was packed with ingredients and at decent value. Overall decent spot if you’re looking for ramen in the area."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPM18tcTVRRRAB",
            "text": "Well made wonderful, comforting ramen. Miso Broth is nice and rich, but not too salty or overpowering. Will definitely be making a return visit"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbzREY1dnEAE",
            "text": "The gyoza is very good. But the ramen are just so so. One thing that stands out is this place is very clean and services are excellent."
        }
    ],
    "reviews_count": 75
}