{
    "name": "Spicy Village",
    "place_id": "ChIJt8rEHyhawokR5iJZu_Em_g4",
    "grid": "MN2",
    "address": "68 Forsyth St B, New York, NY 10002, USA",
    "rating": 4.5,
    "user_ratings_total": 1495,
    "phone_number": "(212) 625-8299",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xQlkwRkJTa3hHVEdoR1VEWmhWRTlNUjFKdlRFRRAB",
            "text": "A bustling Chinatown gem that instantly transported me back to China with its street side and lively energy. The Spicy Lamb Hui Mei featured wide, chewy noodles coated in a fragrant, spicy sauce that was satisfying and comforting. Not necessarily a spot I’d rush back to, but definitely worth trying for an authentic, no-frills noodle experience."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psV1lXUTRWVmRoYVRsSGRsZHpkRXMwVUc5YWMzYxAB",
            "text": "The food is very delicious"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdloyd3RNVjl6TjBkemIxSlhVM1ZKVlRJMVltYxAB",
            "text": "Loved the food! Don't go for the ambiance, but we loved our meal even when we were sat outside on little stools.\nHad the spicy beef brisket wide noodles and it was amazing, along with delicious soup dumplings!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taeExYVkZZMHBNVjJKa1pFaEpiamRTTXpOSWRuYxAB",
            "text": "10/10 food\nauthentic chinese (coming from a born-and-raised SEAian)\nso so so good"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkSFoxWk5OV00wZERWZlJ6VmFjSEZVUTFkV2IxRRAB",
            "text": "We tried the XLBs and the spicy chicken soup in lamb broth with hand pulled noodles. Both were fantastic. Looking forward to coming back again."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZNVdESXljV2RYYnpSdldVVTRSVU5qV2pkUk1GRRAB",
            "text": "Delicious! Everything is a hit."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toeU5GTkJSR1Y1U0VwWmFFaDJSSEUyY1hock4yYxAB",
            "text": "Spicy Village is a Chinatown classic! The food is bold, flavorful, and full of that real homemade taste. The famous spicy big tray chicken is amazing — tender meat, chewy noodles, and the perfect amount of heat. Everything feels authentic and satisfying. The place is small and no-frills, but the flavors make it totally worth it. A true hidden gem for anyone who loves real Chinese comfort food! 🌶️🍜🔥"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGd2NGOXZVbmQ2V0V4MlpWbDZObEZxUkdWWWNrRRAB",
            "text": "I love it here! Great place to have a casual little sit down meal outside with a friend. I recommend the spicy big plate chicken with the hand pulled noodles added :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xodVZrSlZSemhCYUhaSVZrd3dWRFJLUm5kVk9GRRAB",
            "text": "I finally tried Spicy Village after spending loads of time in the area. I've been thinking about it ever since. The food lives up to the name  - very well spiced. I got the vegetarian dry noodle (fully vegan), and I was blown away, and the portions are huge! You will wait a long time for your food if you order takeout at peak times, but it is worth it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wbWVUTlNPV2cxYUdwVlZrRm9Tbk5YWm5ZMmMzYxAB",
            "text": "Highly recommend the lamb noodle soup, the pork burger, and the scallion oil dumplings!! This place is cash only. Remember to bring cash with you when you visit"
        },
        {
            "date": "1달 전",
            "language": "it",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTFRWWTVObG8wT1MxZk1rMDBjakIyUWxKaGRGRRAB",
            "text": "In realtà meriterebbe zero stelle.\nEsperienza davvero deludente, cibo insapore, di scarsa qualità e presentato senza cura.\nLa pulizia lascia molto a desiderare e il locale, che speravamo fosse un tipico ristorante di Chinatown, si è rivelato invece decisamente scadente.\nPrezzi eccessivi, soprattutto se paragonati alla qualità offerta e agli altri locali della zona."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cFFVUm9ibXRPVkdjeFZGQkxjRWhIT0VaTGFIYxAB",
            "text": "During a food tour of NYC, we ate at many places, but Spicy Village stood out. The scallion sauce veg dumplings were amazing. The flavor was so authentic it felt like we were eating in another country. I can't recommend them enough—definitely a 5-star experience!"
        },
        {
            "date": "1달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRd1lYZERjVzVMWkhjNVltdHBibXhDTldWelowRRAB",
            "text": "太好吃了！！！！！！"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nd1IzVkdhV2N5Ykc5NE1IQlNla1ZWVDJoSFRVRRAB",
            "text": "amazinggg comfort food and reasonably priced! The service was fast and the food came out quick. We tried the hand pulled noodles, vegetable scallion dumplings, pork bun and the pepper chicken rice. Everything tasted great and the noodles the portion size was huge for the noodles. Be informed that they accept cash only!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kVFFWOXZlRkkwUW5sQ1dEZFJNbG93VkVsQ1RGRRAB",
            "text": "Get the spice scallion sauce pork dumplings!! 10/10. Ordered these as a starter and then the lamb hui mei and the beef brisket hui mei for our mains. Decent noodle dishes but nothing to write home about. The diners seated beside us ordered the big plate chicken, and I will definitely be trying this next time. Small place with very little seating, but we were able to get a spot right away. Popular spot for all types of people."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCamNqaDZRalZvYUdZd1Qyd3dUREIxTmpaNmEwRRAB",
            "text": "Very yummy lamb soup!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZNGVVNW5aV3Q2TkVGRFVqUXRNMTgzTTJkcWJFRRAB",
            "text": "Food was really good. Wolfed it. Wolfed it so hard I almost went out Elvis style. Would be five stars if it didn’t literally make me pass out and send me to the er. Invoicing for the stitches I had to get. Would recommend 👍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVWVEWkZkbDkzYkZaRlNVVlZTWFZNYlVGT01sRRAB",
            "text": "I love this place so much. They deserve all their flowers"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4T1RsaEtSSFJ1U1ZSUFoxZEZibWxEY3podVpXYxAB",
            "text": "Great place. Unpretentious and delicious"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pabmFqSmxORFo1V2pGM1IzUkNielZIWlc5d01HYxAB",
            "text": "Restaurant but mostly street seating, and like most of china town cash only while expecting tips"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkc1p6UnBaWGhKV1hWbFdtRndPR0ZMTmxWR1ZHYxAB",
            "text": "Top 5 favorite restaurants in NYC. A true staple. Grill pepper chicken here is the best"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTWJrTlZWemh0V2tSSFUxb3lVRUl6VFZST2VtYxAB",
            "text": "Spicy Village is known for their fresh, hand-pulled noodles, particularly broad, homemade, wheat noodles. This spot is a hole in the wall, no-frills restaurant serving Henan-style cuisine. We ordered their spicy beef brisket noodles, the beef pancakes, and homemade steamed dumplings. The noodles, you can get in either soup or dry. They have a nice chew and bouncy texture to them - rich, hearty, and filling. We ordered the bowl with tender beef cubes, where you can definitely taste the cumin spice through these noodles. The steamed dumplings are filled with pork and scallions - a little savory, a little sour, a little spicy. For the pancake with beef, the breading is crispy and the beef they use in every dish is very tender and savory. A great spot to try traditional Henan flavors in Chinatown!\n\nSpicy Village\n(68 Forsyth St B, New York, NY 10002)\nOpen Mon-Sat 10:30am-10:30pm"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRVRrZHViR1JaZDFaSWQwcEJhMFV4T0VwUmFsRRAB",
            "text": "This tucked away noodle place is not very noticeable, a figurative “hole-in-the wall” place, but by gosh they have good food. A true hidden gem close to the metro station in Chinatown."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RNFJWRkdWekIwYUROUmVXOVdaV3R2TkZCeWNFRRAB",
            "text": "Dry black bean with pork noodles tasted so much better with chilli oil, the beef noodle soups tasted too kelpy at first but it grew on me and it feels good for your soul and health. Pork pancake was my favourite. Cash only js annoying but there is an ATM inside a little grocery store around the corner."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oa09YWmhNRkJPU1ZwaVFtcFFOWGcxTm1WblExRRAB",
            "text": "Muy rica la comida, una buena opción para comer, el lugar es pequeño."
        },
        {
            "date": "3달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSUlptdFZhbGMwTTJOT2NrVXlaVFpoWDE5cWRFRRAB",
            "text": "Incroyable"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WQ04xa3plRnB4TmtFelltcEhZV1ZzVFZoeldFRRAB",
            "text": "Yummy"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xdk1YTm1VRTFVZEhveWNVZDZObDlIV1MxaVprRRAB",
            "text": "Most excellent noodles!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKME1rY3dVMmwxUmtOek9UVjZOazl1UTNCU1pVRRAB",
            "text": "It’s a distant food that you expect in New York City nothing crazy especially they only accept cash and place it itself is overcrowded and lack of hygiene"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSU2VXNWlORVJFTlhFMlVrZG5kVTlNTWxKQ2FsRRAB",
            "text": "The service was great in the food was delicious."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CcFRuaHFNRFJxWkU1bVJuQnBXRWxYU0hSZmNGRRAB",
            "text": "I found a glass shard in my leftover noodles from last night :( typically don’t leave these kinds of reviews but please be more careful with your food preparation, this is very dangerous."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxQmVrTkZTVXB3ZEZaM1ZHUmxVMFpNVGtGWWIyYxAB",
            "text": "At a Chinese first generation immigrant I think this is a really really good food with a really really good prize really really nice people"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMmFWVm9TMWxYU3paRE1uWk5WV3hFYWs1VlNuYxAB",
            "text": "Really tasty! Though I wish they were spicier though and the noodles a bit chewier"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRNWMwcG5VRzVFZUVoclNXNDViRnBqTjB3MVZXYxAB",
            "text": "Really enjoyed their hand pulled noodles!\n\nThe noodles had a great texture and coated with delicious sauce. The lamb was well seasoned and the bok choy was cooked well. The cilantro added a hint of freshness and the chili oil was flavorful.\n\nWould recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUE5FNWlibVpIVVRObE5sYzFkRll4YTNGNWJWRRAB",
            "text": "Good, hearty food. No frills. Just eating :) Cash Only."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wTk16Z3ROMkZsVmtSb00ydFlXVVl5ZGxGNlRFRRAB",
            "text": "People were nice but honestly not worth the hype at all. Must have gone downhill in recent years.\n\nGot the soup dumplings (they look and taste just like trader Joe's ones. These are clearly not homemade), the spicy pork dumplings (good but not spicy), the cucumbers which were fine, and the beef brisket Hun mei - the beef broth had barely any flavor and only a few pieces of brisket.\n\nHonestly do yourself a favor and go around the corner to super taste. Was surprised with all the food influencer hype at how disappointing this place was"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRd2NqUjBNRVE1VEc1amFrbG9kMHQ2VUhVeGNXYxAB",
            "text": "Absolutely loved this spot! Got there on a weekday around 9pm so it was pretty empty. We were seated quickly and got our orders in. The food was so excellent! And you can get some drinks of your own by the nearby bodega. Sure, I saw some rats scuttle by (in the distance) but it honestly added to the charm of it all. For me as a first time visitor, it was truly a hidden gem."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNWJEZHliMlZzU25SdGJXSmxVRmxSVXpsTWJrRRAB",
            "text": "Awesome hole in the wall Chinese. Delicious soup dumplings! Also, great lamb noodles"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paS09XSmxNVEJFYXpkTFpWQnljRnBLVW5WTmRXYxAB",
            "text": "my favorite dumpling spot in all of nyc. truly. it’s cash only, so bring cash!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOb2VqWllURlpMY1dGQ2JrSkhYMlZFVGxBeFZIYxAB",
            "text": "I come to Spicy Village specifically for the soup dumplings. They are perfection. Just the right size & flavors. I order soup dumplings whenever I see them on a menu and these really hit the spot for me.\n\nThe pork pancake is also delicious and their lamb broth so flavorful."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWVVIcFNMUzFJTjBaTmMzSlBiSEJKTUdOM1RFRRAB",
            "text": "No frills place, I ate outside with a friend. Becoming popular. Food is tasty. Loved the pancake with pork and the spicy chicken"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLSFJxcGVCZ2Jqa0d3EAE",
            "text": "The food is good and affordable, its small place, but the ladies are kind and sweet."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNN0Ryci04X09EamlBRRAB",
            "text": "Excellent food by staff good service 👌🏻👌🏻…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQam83cnppcF9tV253RRAB",
            "text": "The soup was good, but the dry spicy noodles were amazing! We ordered three meals, plus one for a friend — and everyone loved it. The broth was perfect for dipping the pancakes into."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNTGh5OUswb0tTSERBEAE",
            "text": "Easily my favorite vegan chinese place in new york city. I travel there several times abl year for work and order from different vegan chinese places every time. Their general tsos and kung pao is perfectly crispy and the dumplings are served in this spicy chili oil that is incredible. They keep the sauce separate from the veggies so they dont soggy in transit. I ordered delivery and have never been to the location in person, so I can't comment on service or atmosphere, but I look forward to ordering from them again next time I'm in new york."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMdmw1NkhtN2ZmQkxREAE",
            "text": "Cant go wrong w/ Spicy Village"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKR1N1YWpodE1mV3F3RRAB",
            "text": "It’s a small restaurant. It’s not terrible by any means, but the food just isn’t that good.\n\nWe had the big plate chicken (大盘鸡） and the stewed beef noodles.\n\nThe big plate chicken was decent, but it was missing a lot of bell pepper. The seasoning was good, but without the bell pepper, it was missing freshness. The noodles were ok.\n\nThe beef noodle were mediocre. The noodles are ok, but the broth and toppings left much to be desired. Despite having an option to select beef or lamb broth (picked beef) it was more soy sauce than actual broth by a large margin. Not worth the price.\nBeef was mostly salt-flavored. Not particularly flavorful."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNUGkySjJkd2I3dUZnEAE",
            "text": "we will always remember Spicy Village"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPT2pwdGZ4eTR1SVRREAE",
            "text": "really good & great value"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPN1l6TkdpM2JPZlZBEAE",
            "text": "I got the Big Spicy Chicken Tray. I was not that impressed. The noodles were good though. Maybe I’ll try something diff another time."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZZ2QyT0lREAE",
            "text": "하나도 안매워\n고추기름 많이 추가함 ㅋ\n맛은 소소\n닭고기가 싱싱하지 않음"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURybUkzbEtnEAE",
            "text": "따봉"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOVlTMEpnEAE",
            "text": "I went today around 1 pm and waited less than 5 minutes for a table. I got the beef pancake and spicy chicken soup and omg… amazing. The hand pulled noodles were so fresh, chicken was tender and the beef pancakes were so warm and savory. Both dishes tasted delicious with their chili oil. I cannot wait to go back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmbHBTNXlRRRAB",
            "text": "Excellent food quality, friendly staff, and loved the Big Tray Chicken dish. The Seafood Hui Mei soup itself is extremely flavorful too, and the Beef Hui Mei had chunks of good tender beef with the noodles and bok choy.\n\nOnly down side is that the restaurant is very small and you are squeezed almost shoulder to shoulder with other tables and chairs and there’s barely enough room to walk in and out. Otherwise, it’s a great affordable location for noodle soup!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOWJ6blVBEAE",
            "text": "Had an excellent meal here today. We ordered the spicy big tray chicken and spicy scallion sauce pork dumplings. Just wow. So much flavor, generous portions and friendly staff. Highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBeWRMN1lREAE",
            "text": "flavor is decent and not what you would expect, very savory noodle shop with handmade noodles that have bouncy texture and flavorful broth. broth. the food comes out hot, and the place is not for spicy crave but for savory tastes. very bustling also and service is attentive and quick and decent pricing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNua0tPcGx3RRAB",
            "text": "The prices here are great; but despite having \"spicy\" in the name, we did not find the spicy items that we ordered to be all that spicy, although they all had great flavor. We got the dry pulled noodle brisket, the spicy scallion sauce pork dumplings, and pork pancake. I'd skip the pancakes next time. It's a cash only establishment, so come prepared."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYN3ZuSXlRRRAB",
            "text": "Great place! Great hidden gem!\n\nAuthentic Chinese food, I recommend coming here. Food is fresh and definitely homemade. Reminds me of when I was living in China.\n\nIt is a small space and it does require cash.\n\nBut food is so worth it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEb3BHSS1BRRAB",
            "text": "A small restaurant in Chinatown that serves a lot of Chinese noodles dishes. I ordered the Spicy Lamb Huimei ($11.75) and Pancake w. Pork ($5.75). The noodles were decent but I was not amazed, but the pancake w. pork (also known as a Chinese hamburger) tasted delicious. The service was great and they are cash only. The pancake was a bit on the expensive side, but still not expensive. Overall, I would rate this place a 7.5/10 - I wouldn’t have any urge to revisit, but if I were to be in the area I would show up to enjoy a good bowl of noodles + Chinese hamburger."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbk1DTVF3EAE",
            "text": "Wonderful handmade noodles, soup dumplings at a reasonable price. Expect leftovers and for two people for lunch would range between $30-40."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bTZfb1VBEAE",
            "text": "IF YOU DO ONE THING IN NYC, COME HERE. It is the best Asian food I have ever had in my life (and I’ve been to Asia 4 times!!) get the spicy big tray chicken with plain hummei, and spice scallion sauce pork dumpling. Absolutely incredible 10/10"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmaTdEM1JnEAE",
            "text": "Cash only and small dining space but the food is great!\nMy friend and I split the spicy chicken tray with plenty to take to go, it was worth the price. Probably not a universal reaction but my mouth went numb from the sichuan peppercorns but the chicken was so good 🙏🏽"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbjRUWWh3RRAB",
            "text": "Undoubtedly one of the best Chinese food I've ever had in all of NYC and also while traveling. We had a pretty big portion of spicy chicken plate with curry and handpulled noodles, steamed vegetarian dumplings and another plate of grilled pepper chicken with rice. The taste was straight out of China/India, great spices and blend. Super delicious and felt like home food.\n\nThe prices are also very affordable, considering the portions were really big. Highly recommend if you're in Manhattan/NYC Chinatown area.\n\nIn the daytime the place is not so crowded but my friend told me that peak hours can be crazy with long queues - so keep in mind. Also: only cash!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbi1DU3VRRRAB",
            "text": "This spot is a gem. Had to wait a bit since it was very busy. Small space inside but line is moving quickly.\nBe careful if you cannot handle spicy food since many of the dishes have chilli oil. You can ask to adjust the heat.\nReally liked the beef brisket with noodles. Meat was tender and good for those who cannot eat spicy."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2bExmZTh3RRAB",
            "text": "This place is a real gem! I have been craving the food here weekly. Those well spiced dishes are just so satisfying. I used to go to Xi’an famous but after my friend recommended this place to me and I tried it first time, this place has had my heart and stomach!\n\nUpdated 11/13/21:\nI went there for lunch today and had a pancake with spicy beef which was just perfect. I also had spicy chicken hui mei. I was planning on getting a spicy big tray chicken today but the nice lady there successfully talked me out of it again! 😄 She said I won’t be able to finish it and I’m glad she insisted on me not getting it. But I’ll get it next time when I go there with a foodie companion!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKOXJyTkNBEAE",
            "text": "I can't say anything about service/atmosphere since I ordered takeout, but the lamb hui mei (a type of noodle soup) I got was amazing! Honestly I didn't have very high hopes for it because it looked very plain visually, but the more I ate, the more I liked it. The broth is this beautiful creamy color with a rich lamb flavor but not too gamey. The noodles paired so well with it, and the vegetables added the necessary crunch. All the dry ingredients are simple, but that broth really  ties everything together. Would definitely order again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNS1tM3lBRRAB",
            "text": "I had a little time to kill today so I searched for a spot to eat at and Spicy Village came up on my map.\n\nReally glad I found it.\n\nI ordered the pancake with beef and oxtail noodles. Everything was really good. I wish the pancake was a little hotter, but it was quite tasty. The noodles were thick and filling. Such a good spot to visit on a cold day.\n\nMy only gripe was I spent $22+tip. I understand inflation is hitting hard."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzZ1lDNWNnEAE",
            "text": "Love this place! Truly a hidden gem in Chinatown. This place gets packed pretty quickly because there are a lot of tourists. It has also gained a lot of popularity because it was featured in the 2020 Michelin Guide. When you come here you have to get the big tray chicken with the hand pulled noodles. That's what they're famous for. It's good enough for two people, but wish there was a little bit more noodles. We also ordered the triple salad that had cucumber salad, seaweed salad, and tofu salad. It's a pretty nice refreshing side to cut the spiciness at times. We also got the pancake with beef and the spicy scallion sauce with pork dumplings. To be honest, we enjoyed the dumplings the most! The sauce was really tasty and not too spicy. I wish there was more meat in the pancake but overall a good place to go in Chinatown!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobk1hRHZBRRAB",
            "text": "In Chinatown, NYC, there are lots of Chinese restaurants... ok, this is not a very good introduction, I know... 😂 Yet this is true. And finding the best option in all this offer is kind of mission impossible... Google is here to help, though, but does it really help?\nWell, somehow, it told me that, in the Lower East side, slightly outside of Chinatown, there is a small and affordable restaurant called Spicy Village that has good reviews. But I failed to see that the restaurant is always packed and that I would have to wait outside for... 45 minutes, maybe?.. because the venue is so small you can't barely move from the door to a table.\nThe waitress initially told us there was no room and then she told us to wait... or so we thought, because we couldn't really understand what she told us and I'm pretty sure she didn't understand us either.\nAnyway, we managed to get inside and get a small table for the 3 of us (my wife, my son and I). And we started ordering. The tricky part was that my son does eat spicy food at all... but we basically ordered everything else. And it was way too much. It would have been nice if they had told us to stop before. But for the price, ordering too much wasn't really a big deal: we paid $50 for the 3 of us (no desserts... but none needed) and ate a lot. This is very cheap for NYC. And we ate good and unusual dishes.\nHonestly, next time, I'll probably get there at the opening time, but I will definitely go back.\nJust keep in mind that they don't accept credit cards...\n\nQuality & taste: 9/10\nQuantities: 10/10\nAtmosphere: 3/10\nOriginality: 9/10\nRatio price / quality: 10/10\nService: 2/10\nHow I felt afterwards: 9/10\n\nMore on IG @runnerandfoodie"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMFBLUjlRRRAB",
            "text": "Delicious Food.  Super fast service.  Had the Spicy Brisket on hand-pulled noodles (dry), and Spicy Scallion sauce pork dumplings.  Very, very good.    Dumplings were some of the best I’ve ever had, USA or in China!"
        },
        {
            "date": "7달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3X29TZDRBRRAB",
            "text": "羊肉面很香！味道再浓一点就好了！但是这个价格很良心了The mutton noodles are very fragrant! If the soup is thicker, it will taste great! But the price is very conscientious"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcktlNzVBRRAB",
            "text": "Nice authentic Chinese restaurant. Small dining space, probably 18-20 chairs. Simple menu, but plenty of selections. We enjoyed it. I had a spicy chicken noodle soup and my wife had a vegetarian dish. Affordable."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfNS03UmpBRRAB",
            "text": "The soup dumplings have been great! The big tray chicken was just chicken and we added noodles, not really special or outstanding"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1NU5taFlREAE",
            "text": "Cash only spot in Chinatown with delicious and affordable noodles! Generous portions of  meat in all of our noodles, and the flavor is extremely authentic. The beef pancakes were slightly disappointing, as we were expecting more meat. The soho dumplings were delicious and comforting."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1aHNTR3hnRRAB",
            "text": "Tender brisket and crispy pancake pork burger. The friendly service was great as well.\n\nI took one star off because the noodles was not as spicy and the burger could have used more pork. Nevertheless, it was a good hole in the wall at Chinatown :)\n\nAlso, it is cash only."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlZzduTmNBEAE",
            "text": "Beef pancake was so delicious. The beef was so flavorful and the crust was crunchy. The dumplings in the spicy oil was yummy too. I’m not a huge fan of thick noodles but my parents loved the soup. They really liked the noodles and beef broth."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkbGV6Xy1nRRAB",
            "text": "Cash Only💵\nSat right away on a Saturday night. Food came out quick.Ordered extra chicken made it perfect for sharing for two. Pork soup dumplings also good, but smaller than advertised."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmam9xMmZREAE",
            "text": "Maybe the best value in Chinatown. Expect a wait, but they work efficiently here - server was taking orders from people in line even before seating them. Once I got in I had my food within minutes."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhMHVEbFNBEAE",
            "text": "the food here is amazing for such a good price.\n\nthe pork pancake is absolutely amazing ! the outside bread is crispy and the inside had so much marinated meat !\n\nthe soup dumplings were excellent ! the only downside is that it is a little small, but it is packed with flavor. it is not too greasy and the meat is juicy. it also had a ginger flavor in the soup, which complemented the dumpling so well."
        }
    ],
    "reviews_count": 79
}