{
    "name": "Carroll Place",
    "place_id": "ChIJ53TP75FZwokRSlw1VwT_zHM",
    "grid": "MN2",
    "address": "157 Bleecker St Suite 1, New York, NY 10012, USA",
    "rating": 4.3,
    "user_ratings_total": 1472,
    "phone_number": "(212) 260-1700",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twSGN6TXpSM0ZpTVc5YVpXZHRhbUYzVkc5MWJWRRAB",
            "text": "Amazing service. Good food. Can’t complain"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCcmVHcFhZbGM0T0VSWVoyRkJXVTl2TFVwc2FFRRAB",
            "text": "Came in late and there was no menu with prices, drafts were cut, and a single bottle of Stella cost me $14.\n\nI thought I had misheard but there it was. Absurd as well as the late night fee when the place was practically empty, very disappointed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poaU1TMXNOMlo2YVhSaVRtMXBiMEoyV1RReVRYYxAB",
            "text": "Great brunch, turns into more disco vibe at night"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aQmMwMUpNVFF5Vm14V1IzbGtjRFZxY0VvMFdWRRAB",
            "text": "We had a private event and the food and service was great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWUllrYzVkUzFsTTNkVVowWnFPVXd5ZG5Gb2MxRRAB",
            "text": "We had a family birthday celebration in the event space at Carroll Place this weekend, and we could not be more delighted. Kay was super easy to work with, and the event was really wonderful. Food was great, space was perfect, and the team could not have been more accommodating. Do not hesitate to trust them to handle your event - I would give them 10 stars if I could."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkQk1sUkVaRVpZUWtsdGJGRnpVV293UldsNmFHYxAB",
            "text": "I love loud music but the speakers right above bar seats are too much….44 dollars for two jack and cokes was a bit too much as well"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nd1UxOHRTVGxUWkVrd1luUmpTVWRwWkRock9HYxAB",
            "text": "Delicious fresh pasta. Good service. A bit too dark in restaurant and music too loud. I would prefer softer contemporary Italian music."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdlVHOHhVRmx3YlhFNUxYQlBUbGg1WWxSVmJGRRAB",
            "text": "Carroll Place is the old Kenny's Castaways. Loved the place back then and love it now.  Great vibe, stop in."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gc01UUmZaVTlOZUVkMGJFWlBNWGx4Y0hOclFrRRAB",
            "text": "Food was alright, but we were starving so that probably made it taste a little better. Standard pizza and pasta with nothing super special about it. Prices were a little bit higher than I would have expected, but nothing super unreasonable.\n\nOverall it did the job and filled up my stomach nicely. Each dish was just enough for a hungry person."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNlEwWjNNVFIzWWtoUlVHZEJXa3g2V1d0alEwRRAB",
            "text": "Service is top notch. Good brunch menu. Fun spot."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMQ2Rnc3E5c2FfQk1nEAE",
            "text": "They do a great drunk brunch. For parties of 8 or more, they do a family style brunch that was fantastic! The vibe feels like an old theater. The music is very loud for brunch depending on the vibe you are looking for."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNldTRyZXFRRRAB",
            "text": "I’ve been patronizing this brunch spot for over a decade and it never disappoints.  $30 for bottomless mimosas, rose sangrias, or bloody Mary’s. The mimosas are Potent!  The rosemary wings are a must. We ordered Dteak and an eggs and Tartufo pizza as our entrees. The classics Tartufo and Armatrecianna are delicious. Reservations are a must as the place gets pretty crowded. Good music and vibe. Definitely try it out."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhdmUtNGl3RRAB",
            "text": "Bustling atmosphere and music is always great for groups. Bottomless brunch is a great deal."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMm9IQnRRRRAB",
            "text": "Super bad service…. Horribly late and super wrong order, not getting what we wanted. Bad margarita…virtually cero tequila just mix and ice."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeTl2T29RRRAB",
            "text": "hostess is an absolute nightmare not accommodating at all"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJeGVLYUdnEAE",
            "text": "todo bien la gente es amable serviciales dedicada a su trabajo. 🥳"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJb2JhNXNBRRAB",
            "text": "We celebrated my birthday and did the 2 hour open bar and food package, it was really worth it!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aU1PcDFBRRAB",
            "text": "Delicious food and fast service. We ate our entire meal in about an hour, very quick. Also relatively cheap for NYC. We also managed to get a table without a reservation on a Saturday night."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3a3EyS2h3RRAB",
            "text": "Went to bottomless brunch here on a Sunday, and was very disappointed. The food was not very tasty, other than the french fries. My burger was flavorless and overcooked. Not to mention, it was also over-priced. The mimosas were extremely watered-down. The sangria was the worst sangria I've ever tasted, and tasted like someone had tried to add whiskey to it. We were rushed by an incredibly rude waitress who informed us several times that we were about to approach the 90 minute cut-off mark for bottomless brunch, even though the restaurant was half-empty. When we asked if we could substitute out the undrinkable sangria for something else, she told us that she could not accommodate us. The bathrooms downstairs were also extremely dirty. I will not be coming back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRX1B5ckNREAE",
            "text": "Had my birthday here the best"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNjZLZUlnEAE",
            "text": "Every time I come here - it’s a five star experience. Great food, great atmosphere and perfect Negronis."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTUNndkl3MRAB",
            "text": "This is one of my favorite places for happy hour. Affordable drinks & food. Love their pizzas & arancine. Later in the evening they have live music in the back room."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnaE9Xc1ZnEAE",
            "text": "I had a wonderful Saturday night out here! The place had a lot of traffic in and out but never felt overwhelmed with people. Each plate was well crafted. They all had great presentation to them which made for great photos. The quality of the food was right on par with its appearance.\n\nAs for the service, it was felt completely missing. We were never given a proper introduction has to who our server was, and they never really took a moment to even try to vibe with us. It was very much so just a “what would you like” and that was about it. Towards the end of our meal, the server also randomly switched without us being informed. To it overall felt weird to tip 20% on a service I didn’t really feel like I was getting. HOWEVER, when it was time to pay, a 20% auto gratuity was already applied to my bill (which had mine and my girlfriends stuff on it) which even the server seemed confused by but said nothing about it. I didn’t question it because I was going to tip 20% anyway, but just the fact that a 20% auto gratuity happened without any warning or without me being told about it seemed very fishy to me.\n\nOverall, I think this is a great place. I will definitely be returning for another nice night out, and hop that this is not a common practice for the establishment."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfeF9HbmVBEAE",
            "text": "Great place for a reasonable bottomless brunch in the city. With tip and only base food options it came out to $52 a person. The food is served family style for the brunch and the whole table must agree on the dishes.\n\n4 starts because the place was really hot (but it’s nyc in winter so I’ll give them a pass) but worse:\n\nThe hostess tried to tell us our bottomless time started at 12:45, our reservation time, after we had all ordered a round of expensive drinks at the bar waiting for rest of our party.\n\nThe waitress was lovely and quickly let us start our timer when we were all seated. We did not enjoy that rude introduction."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdHIzOWJREAE",
            "text": "Cool place, good pizza .."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMEpmejdRRRAB",
            "text": "Bottomless brunch is very good value. I asked them to cut off my boyfriend as he was on the verge of unspeakable struggles, but they kept serving him, so the service had to take a ding for that.\n\nI enjoyed the Benedict. It’s quite good."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmX2Y3TUZBEAE",
            "text": "Great spot for brunch, whether it be to catch up with friends or a nice date! Had a great time there, food was amazing and the service was beyond!\nFor sure recommend this place.."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2OV91VHRnRRAB",
            "text": "Wasn't too busy when I visited. Food was good. Drinks was ok.  Always a pleasure to visit!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2aDZxcU5BEAE",
            "text": "We recently visited Carroll Place, formerly known as Kenny Casterway, and had a delightful experience. The meatball Parm sliders, sautéed spinach, and wood-fired rosemary wings were absolutely delicious—each dish full of flavor and clearly crafted with care.\n\nThe restaurant is spacious, offering plenty of room to relax and enjoy a meal. The staff were friendly and courteous, making the overall atmosphere warm and welcoming.\n\nWe have fond memories of Kenny Casterway, especially its vibrant live band performances every night. While Carroll Place has its own charm, it's great to know you can still catch live bands next door at the Red Lion, keeping the music scene alive in the neighborhood.\n\nWhether you're revisiting or discovering it for the first time, we highly recommend Carroll Place for its great food and inviting vibe."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dWZLWTdnRRAB",
            "text": "The food is incredible! We had tartufo pizza and the homemade lasagna. The appetizer was burrata cheese, desert was tiramisu. Everything was delicious. The cocktails are amazing too. Definitely worth a visit! Price is super reasonable... We are absolutely coming back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2NzZ6MU13EAE",
            "text": "Didn’t honor a reservation because santacon happened. We also didn’t know it wasn’t going to happen until we turned up. Such bad management."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQb2VIOTRRRRAB",
            "text": "Great venue!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQc0oyZnNBRRAB",
            "text": "Cozy bar with a stage for live music in the back"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNXB2N3ZBRRAB",
            "text": "Love everything about this place over the years. Just getting better. Simple great menu. Orichetti dish was awesome. Fiona was a terrific server! Highly recommend."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzM2QzUFhREAE",
            "text": "The place is nice, downstairs is the bar with a dance floor and the upper floor is more in a restaurant vibe but very loud. The food and drinks were ok. The problem was with the check - the drinks prices in the bill were different than the ones on the menu!!! We asked the waiter and she kinda went to the manager, they  fixed it and brought a new one, again with mistakes..seems like you really need to be on top of things and if not - you're gonna loose a few dollars. The waiter didn't have any explanation and really didn't wanna engage with us. It's very weird, not attentive service.. Will not be coming back - if you go , take a double look at the bill."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEamF6a3hnRRAB",
            "text": "Superb food great cocktails friendly service."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNzl6OXF3RRAB",
            "text": "Mimosas were all juice . Asked for less juice and still it was horrible . I love the place been goung for 10 years but drinks r no longer good"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzanN2X293RRAB",
            "text": "This is a spot you go to to get drunk with your friends. A very college friendly restaurant for bottomless brunch. The food itself is alright. And the bottomless mimosas are actually not very good, but you’re here for a good time, not a life changing delicious time.\n\nThis is a fun place. Full of young people and loud music. We ordered the eggs purgatory (very cheesy. mostly ricotta.) and the eggs benedict (on biscuit with prosciutto) The food wasn’t bad but also not amazing. An entree comes with the bottomless brunch but we opted not to get wasted. Had one mimosa each which was mid to be honest, but it is expected of the area. Next time we will try the pizza."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaUw3UGZnEAE",
            "text": "Pretty cool bar. Here for Peter Frank’s talented performance. Also had some great Margherita pizza and drinks."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXN3RMYUp3EAE",
            "text": "Our reviews had over 52 million in the last 12 months.  We do not get paid we just love to eat and have fun.  We really love Carroll Place.  Sitting next to the bar was MICK JAGER all by himself, but we were too star struck to say hello!!!!  This was a not so busy Wednesday night.  Crazy.  This is the most fun place to eat and drink in NYC.  Right down where are the bars and nightlife are but a stunning crowd in here that is lots of fun.  Do not miss out on the food.  The salt and pepper ribs app is a MUST HAVE.  Super fall off the bone tender and great flavor.  Note the small pizza oven that uses hardwood to give each pie a great flavor.  All the pizza is fantastic.  Go early on Friday and Saturday as it can get busy but DJ in the house about 9 pm and last until 3 or 4 am.  We met 2 of the owners there and they took the time to show us around.  Great drinks at good prices and the best bartenders in town.  This place is huge with lots of rooms down and up.  Note that there is a stage in the back room for live bands as well.  Used to be called \"Kenny's Castaway\" for 40 years but changed hands 3 years ago and is even better now.  Fun secret is the all you can eat and all you can drink brunch for a very cheap price.  You sit down and they give you 2 hours of all the food and all the drinks you want.  Do not drive home after that!!!!  LOL.  Two big thumbs up to this place.  The manager Luke is a great guy and will make sure you have a wonderful time. Check out all of our reviews and look at all the photos below. If we do not like it we do no review it so all of the ones you see are places that are fantastic. Follow us if you like. We had over 52 million views in the last 12 months and we thank you for that. We don't get paid, we just love to eat. Be sure to click on \"RobH\" at the top of this review to see all of them and to follow us if you like good food and FUN.  If we do a review it is because we love it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdG9xazZBRRAB",
            "text": "Came on Halloween weekend of '24 (early Halloween Saturday)... guy (bathroom attendant) harassed me for a tip for a starburst and washing my hands, real aggressive, blocking the door before I gave him one. I just didn't like it, I go \"what because I'm by myself, I'll give you a tip\" and so, he got a bouncer and a shorter patron fishing for brownie points...\n\ny'all are soft & corny... kicking me out because a bathroom attendant is begging for a tip 😂\n\nGtfomf"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYOHMzWE5REAE",
            "text": "Such a great spot for the best pasta and pizza!! Still thinking about it!\nThe music was also great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbzV1OTJnRRAB",
            "text": "Steve saved our night!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdFl1NWZREAE",
            "text": "horrific experience at the door. I feel sick thinking about this."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMHNDNVVnEAE",
            "text": "Great good, great live music"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMk9DUzBBRRAB",
            "text": "The place was very cute and cozy.  For me just a little too dim, but that's just because I like everything to be bright.  Customer service was on point, we never had to request for our refills.  Very attentive and all our food came out as we requested.  The food itself was delicious,  def one of the best French Toasts Ive had and I am not a French Toast girlie.  I also really loved the flavor of the steak and eggs.  That came with a salad and fries.  Salad had the perfect amount of dressing and the fries just had the right type of crunch!\n\nI didn't give 5 Stars because I believe that the portion to price didn't match.  I was still pretty hungry and it left me wanting more.\n\nIt was busy,  but it didn't feel cramped. We were very comfortable.\n\nI would def recommend this place because everything we had was delicious.   I'm looking forward to trying the food that wasn't a part of their brunch menu next time .... it all looked so good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuaXF1WjF3RRAB",
            "text": "Okay atmosphere is amazing. But they were blasting annoying pop music the whole time that did not match the upscale vibe. My beer was very flat and both the vodka pasta and Cesar salad were SO salty. The salad dressing tasted like salty mayo. I loved the e atmosphere but the music and food was a shame :/  the pizza was pretty good though. Service was pretty much non existent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudmIzU0hBEAE",
            "text": "In town visiting, was looking for a a spot with great vibe to start the night. Gigi was a great server, recommended cocktails, entrees and neighborhoods to visit in NYC."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNucmYyRmdnRRAB",
            "text": "Great Food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaEplZEZ3EAE",
            "text": "Gigi is the best server ever!\nHow much she care about us, the hospitality and smile that she always had! Little big things that make your meal better! So as your day!"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCaHMycEZnEAE",
            "text": "이태리레스토랑과 바 느낌이 물씬 풍기는 곳 파스타가 맛있고 고소해서 하나하나 음미하면서 먹음 와인도 맛있고요"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxMWNTRFpREAE",
            "text": "Great spot for bottomless brunch if you have a large group, we were 17 people! All appetizers were served family styled and we pre picked all our items. The food was good, came out in a timely manner and the price was reasonable! We received an incorrect entree, but it didn’t bother us! Bottomless drinks were okay, we just stuck to the mimosas, but they have sangria and other options!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsdzRpWW1RRRAB",
            "text": "We went to this place for a friend's birthday dinner . Upon walking in, the place was really cute!\n\nThe service started off, shaky. We had a party of 18 and the tables that they gave us was just not picking up to suit our party. We asked to be moved to a different area, but they said they had a bigger party. However, they ended up moving us to that place, which was interesting because I thought they said they had a party. It ended up that they did have a party. We just got there first. I'm glad they moved us because it was definitely more comfortable.\n\nThe bottom is option was all or nothing but that's pretty typical for a restaurant in the city.\n\nWe got the some appetizers:\n- Caesar salad was made out of spinach. Spinach leave the weird taste in my mouth which has nothing to do with the restaurant. The salad was good.\n-The Meatballs were so good. Not dry and very flavorful. -The Fries were incredible. They had a hint of truffle flavor. They also had a nice bite to them.\n- The brussels sprouts were cooked well. I wish they were more saucy.\n- The pizza was floppy but decent. I'm overall not a huge pizza fan but I liked the thinness of the crust.\n- The penne alla vodka lacked a decent amount of sauce for me. I needed more of that creamy tomato sauce.\n- The chicken was kind of dry but okay.\n\nAfter like 10pm, the place turned into a club vibe. The music was bumping and it was a nice mix between current and oldies songs.\n\nI would recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NHFEVldREAE",
            "text": "We had a delightful bottomless brunch experience. Their brunch menu features bottomless mimosa, Bloody Mary,or rose sangria and one entree of your choice for $30. I got the steak and eggs which cost an extra $5. The mimosas were definitely not watered down. I’d definitely come back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuLU5HNnlBRRAB",
            "text": "Made a reservation for brunch as we were planning to see a show in Union Square afterwards. The weather was lovely so we decided to sit outside which was a great choice. Gigi was our server and she was literal perfection. Attentive, answered all our questions and continually made sure we were taken care of as we dined. She even offered to take our photo as she could tell we were having a great time, very much appreciate that in a server. I had the Pappardelle which was delicious, fresh noddles, braised pork, would highly recommend. Can’t wait to come back and try more!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUb2NpZFhREAE",
            "text": "Great brunch spot. Our server was incredible. The food was excellent. Their eggs benedict were sooooo delicious. All of their pizzas are a hit. I’ve tried most of them and it is a no-brainer. This place is definitely a safe choice for a good bottomless brunch on the weekends!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMWNqX3NRRRAB",
            "text": "They have a group menu that was pretty worth it for value ($40/person) but the food itself was not good.\n\nThe only things that stood out were the salads.\n\nSalmon was Smokey but not salted, the pasta felt overcooked, pizza was very whatever (bread was decent) etc. I’d say this is more of a bar than a food place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkaE9tQWt3RRAB",
            "text": "Dark Industrial vibe and really fun atmosphere. The food is amazing. We were a party of 8 and opted for prefix menu which is supposed to be 38$+tax but a few items on the menu cost extra so the bill ended up being 58$ per person which felt really less for the quantity and quality of 3 course meal, botomless minosa and sangaria that was served to us. The rice balls and chicken tenders are really good for apps, mushroom pizza(we got the vegetarian version), spagetti, egg benedict was sooo good. Great vibes, atmosphere and food makes it a must go. The only challenge is limited time, they don’t allow to stay for more than 1.5 hrs so it felt rushed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3OHZqb193RRAB",
            "text": "As with many restaurants I’ve visited in NYC, I ate here with my family; we chose this place after hearing a local band would be playing tonight.\nHaving lived in Austin, the live music capital of the world, any place with live performances from local artists gets a rating boost in my eyes. Perhaps a rock band isn’t exactly the vibe for an Italian restaurant like this but I liked it regardless.\nThe service was phenomenal. A loud musical performance might make ordering difficult but the staff were attentive, took our orders well, and made sure we always had water.\nFood-wise, you can’t go wrong with a pizza and a couple appetizers. My girlfriend and I shared the tartufa pizza, Brussel sprouts, and fries. The Brussel sprouts were by far the stars of the night (off-stage of course). They were slightly crispy with a salty-savoriness from the diced pancetta. The fries were pretty standard truffle fries, good stuff but if I were to get the two appetizers again I’d just choose Brussel sprouts twice. The tartufa pizza was top notch with mushrooms and a bit of truffle flavor. The only drawback was the slight sogginess of the bread; a slightly crispier bread would’ve made the pizza topper notch.\nIf I visit again in the future, I’ll likely order the brussel sprouts again and perhaps some other pizza and ask if they can possibly make it a bit crunchier/toastier. Regardless, excellent food overall."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbU1yTkJBEAE",
            "text": "We really liked the vibe. Place got very full with a nice crowd of folks going bracing windy rain on a Saturday evening. Great location near the comedy clubs and other venues. Service was meh. Food was meh. Hot drinks were warm/hot."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpbGFpNnBBRRAB",
            "text": "Cute place to brunch. I would recommend making reservations as it is a very popular spot. It has an unlimited drinks option which was nice. I would suggest that they place their pitchers in the fridge before serving as our rose sangria was…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoa2VQSGRREAE",
            "text": "FOOD:\nStrawberry cheesecake = it was on the lighter fluffy side, but was still really good with real jam and a crusty crust\n\nSERVICE\nGreat. Nice hostess and also really nice bartender too. Last time I stopped in, the host was really friendly and helpful too when asking about live music in the area\n\nATMOSPHERE:\nLove the warm dim Edison lights reminds me of an old saloon or tavern with the rustic wood beams and hanging “candle” light fixture, and table candles. The disco ball was a hint of modern times though lol. Anyway like that it’s on Bleecker street, conveniently in Greenwich/West Village area with so many things to walk to on the same street, blocks, and neighborhood. I believe Mondays is karaoke night or something. Might have to come back to verify."
        },
        {
            "date": "수정일: 3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1Mm9DWFZREAE",
            "text": "Es un lugar ideal para el brunch y compartir con amigos, el ambiente es muy agradable, y limpio;  me gusta la luz cálida que hay en todo el lugar.  De verdad, que la atención del personal es excelente.  Toda la carta se ve deliciosa, de lo que comí súper recomendado la burrata con el delicioso pan plano de romero a la leña,  the meatball Pomodoro, la pizza margarita y la jarra de sangría rose...\nSi deseas asistir con un grupo, te sugiero reservar el Brunch Family Style.  Consiste en 1 1/2 horas ilimitadas de las bebidas del brunch con cualquier entrada."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiOHRiSDJBRRAB",
            "text": "I had a fantastic dining experience. The ambiance is warm and inviting, perfect for a relaxed meal. Our server, Lina, was exceptionally attentive and provided excellent recommendations. The service was quick, and we felt well cared for throughout our visit. The food was delicious, and the drinks were top-notch. I highly recommend this restaurant and will definitely return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbUktMFFBEAE",
            "text": "They were very accommodating when our party of 6 showed up thinking we had brunch reservations but didn't. Food was excellent and the bottomless brunch drinks were totally worth it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiOHNhSW9RRRAB",
            "text": "My recent visit to Carroll Place was fantastic! The ambiance was warm and inviting, perfect for a relaxed evening. We were served by Lina, who was super kind and provided exceptional service. She offered great advice on menu choices, making our dining experience memorable. The food was delicious, and the overall service was top-notch. Highly recommend Carroll Place for anyone looking for great food and excellent service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbFBTcVN3EAE",
            "text": "Dinner plans? Look no further than carroll place , an Italian American Gem with Gastropub twist.\nFrom Happy hour specials to Live Music nights ( after 9 PM ) , it’s a perfect blend of delicious dishes and vibrant vibes.\nA must go-to-spot for creating unforgettable memories.\nfeatured⤵️\n⭐️ Meatball in Pomodoro\n🍕 Margherita Pizza\n🥗 Endive salad with Salmon\n🥩 Grilled Hanger Steak\n🍝 Linguini Vongole\n🍰 Chocolate Cake\n🍨 Strawberry Sorbet\n\nAll the food was excellent, we really enjoyed the dinner with live music 😍."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBMXRheE1BEAE",
            "text": "Staff was very friendly. The bottomless brunch is a great value. The waitstaff promptly refilled and checked in with us. The portions were appropriate. The pizza is large enough to ave leftovers. The bathrooms were really clean."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWNXVUYjJRRRAB",
            "text": "Quick Service with Reservations (Sunday 12pm)\nCreaky chairs and hot environment.\nSmall space in between tables after 4 min of sitting  waiters/servers were already grazing past me, the table arrangements are out of place and too close to one another not leaving enough room for passage. I arrived at 11:50 and was sat down for a 12pm reservation water was promptly brought out but by 12 no one has checked  in on me or taken my order. There are plenty people walking around.\nTable that was seated after me was being attended to. Had to ask to get my order taken after sitting for 15 min. Also asked if they could switch my table since there was very little room and they accommodated for a table outside which was okay and the service was fine.\n\nFood was also average. We got a pizza and some pasta dishes. Overall okay place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPLXBYZ1VnEAE",
            "text": "One of the best bottomless brunch places in NYC. $30 for bottomless (generous table service/refills) AND an entree. You have to tell them to slow down cause you won’t be able to keep up.\n\nThe food is solid, the options range from popular brunch options like eggs Benedict, French toast, pancakes, etc. and pizza/burgers. I loved the eggs in purgatory. There’s nothing more to say. Go here with your friends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEc3RyZ3NnRRAB",
            "text": "Our group attended specifically to hear the Peter Frank band, especially Billy Burt on bass guitar and vocals.  We we're intrigued by the karaoke live band so stuck around and Melissa in our group actually performed and received an overwhelming applause.  Food & service was great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMXy1xUkpnEAE",
            "text": "Carroll Place exceeded all expectations during our recent family outing for their renowned bottomless brunch. The cozy, rustic ambiance provided the perfect backdrop for a memorable gathering.\n\nThe highlight of our meal was undoubtedly the rosemary chicken. Cooked to perfection, the chicken was tender, juicy, and bursting with flavor. The rosemary added a delightful aromatic touch that made each bite a true pleasure.\n\nWhat made the experience even more special was the impeccable service. The staff were attentive and friendly, ensuring our glasses were never empty and that we had everything we needed to enjoy our brunch to the fullest. The diverse menu offered something for everyone, making it a hit with the entire family.\n\nCarroll Place's bottomless brunch is an absolute must-try. From the delicious food to the warm atmosphere and excellent service, it was a fantastic experience that we can't wait to repeat. Highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkeEo3bHpRRRAB",
            "text": "Went there for the bottomless brunch with a couple of friends, overall it was good. Our sever was Mondy, we was super helpful and overall made our experience enjoyable. I ordered the steak and eggs. The eggs were super fluffy and creamy which I loved. The steak was good as well. The sangrias were eh not the best. They will also start to kick you out from your table after your time is up, which is kind of understandable because it does get packed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdThXbldBEAE",
            "text": "Amazing! Amazing! Amazing!\n\nThis was such a charming dinner experience, aside from the Uber soft and warming interior, the staff provided the most unbelievably welcoming service. The entire place was full of smiles and laughter from happy diners.\n\nI had an unforgettable dinner with some friends where we opted for Carroll Place's new family style dinner menu which offers an array of appetizers and entrees to choose from, and dessert plus a bottomless beverage add-on.\n\nWe got to select 4 appetizers and 3 entrees, and all decided to sip on endless rose. Our starter choices were Arancini, Calamari, Rosemary Wings and a Cheese and Meat Charcuterie board served with honey and soft bread. Our shared entrees were Margherita Pizza, Hanger Steak and Penne a la Vodka alongside Truffle Fries and Broccolini as sides!\n\nThe huge sweeping meal then wrapped up with a Nutella Calzone Pizza, would definitely recommend for an intimate group celebrating something special or just looking to have a great time over a delicious feast.\n\nThank you Carroll Place!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPOTREVmtnRRAB",
            "text": "We've always liked coming to this place when in New York, however we were met with a very rude front desk gal when we arrived at 11:00 a.m. Sunday. We could see they were still setting up but asked if we could possibly go inside, as it was 5 to 11:00 and very hot outside. She looked up, glared at us, looked at her phone, and said very curtly \"we open at 11:00\". It was 4 minutes until 11:00. So, we stood outside and waited for 4 minutes. Then another group walked in ahead of us and she seated them. Awesome.\n\nI had made reservations weeks in advance as we were coming from out of country and specified we wanted to sit on the main floor near the front. We had experienced the back room before with a lot of drunk and 20 somethings in big groups, found it very noisy and uncomfortable and didn't want that again. She began to walk us through to the back which I said again that we did not want, as per my reservation request. There was nobody else sitting in the main area anyway, and she had just seated the group that walked in from the street ahead of us right at the front table that we had actually wanted. She told us that the seats at the front were generally \"only for larger groups\" there were 4 of us and the tables seated six. I was about ready to walk out as I'd already had enough with this person. But she rolled here eyes and told us we would have to leave by 12:45 if we wanted to sit there. I was very embarrassed as we were there with relatives from England and had raved about this place. I couldn't believe how rude she was considering the day had just started. I must add that this was not the person who was seating everyone as we left, just the person who was there for the first 20 minutes that morning. But I would highly recommend finding her a new position as front reception is not her calling.\n\nAside from that, the servers we actually had were really great and made up for the rudeness. The food was still very good, but I think that will be our last time going to Carol place unfortunately."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWbC12NkhREAE",
            "text": "I must say this place is very beautiful, I bought a groupon for 2 which was a 3 course meal and wow it was amazing the food here is sooooo good and they give you a lot of food omg i really enjoyed the drinks everything i would definitely come again the manager Alex was soo friendly and nice to us live coming to places that make me feel welcomed can’t wait to go back ❣️❣️🥰😁😁😁😁😁"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJdzZUUk9BEAE",
            "text": "Attended brunch at Carroll place for maybe the 3rd time yesterday. This however was my first time enjoying the family style format since we had a party of 16. You get to choose 2 starters, we got arancini and meatballs, both of which are delicious and then 3 entrees. We got the rucola pizza, eggs Benedict and French toast. The eggs benny were a little disappointing as the eggs were overdone but it has to be hard poaching so many eggs at once. Finally they brought out 2 nutella calzones which we could barely eat we were so full. The bottomless brunch experience is accompanied by literally endless carafes of mimosas and Carroll Place's signature rosé sangria. You can also get bloody Mary's, coffee, tea and soda. The service at this location is wonderful and you absolutely get your moneys worth. Thank you!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBcVktUThBRRAB",
            "text": "Great value for the money and very tasty dinner food. Pizzas are about $15, and great for sharing! Our group of 4 split two pizzas and had a side salad and adored the pizzas--caprese and truffle. We also ate our fill in truffle fries, which were maybe a little less truffled than I would have liked but were absolutely delightful."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDeTdibDhBRRAB",
            "text": "I ate at the restaurant on a November Sunday, just after 11:00 am. I was seated outdoors along the sidewalk and I ordered the Eggs Benedict. This was my first time here. The eggs were done medium, as ordered (see photos). The meat was…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXb0tMejF3RRAB",
            "text": "Food was excellent- had the braised short ribs to die for and OMG the fried calamari - had two orders of that!  I’m sure all the food is terrific. It is a pretty place, warm atmosphere and friendly staff."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoenF6a0dREAE",
            "text": "Everything was wonderful from the time I stepped in, to the time I left. My waitress was so kind & accommodating (shout out to Farah!). The bottomless brunch is fantastic, the mimosas had me 🥴, the pizza was phenomenal, & those rosemary wings baybee! Delicious! Can't wait to go back!"
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bnVHVzJnRRAB",
            "text": "Molto carino. Luci soft con musica dal vivo. Cibo buono e servizio eccellente."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiMHRMd1ZREAE",
            "text": "Loved Adam, great guy. He recommend their fabulous margarita pizza. The ambiance is very Italian and American. 10/10 rating"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKX05EQ0N3EAE",
            "text": "A former historical gay bar, speakeasy, and music club has now transformed into a beautifully antique themed restaurant right by West Village."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsN3QzNFVBEAE",
            "text": "Really loved the vibe of this place! Unfortunately our server was not only unfriendly but was also very unhelpful our entire visit. I couldn’t believe the service we had, I haven’t had an experience like it in quite some time. Food was good, we loved the bread from the cheese and meat plates, and the margarita pizza. The salmon and pasta wasn’t anything to write home about. This place could be amazing, the restaurant is so fun. Wish we enjoyed it more"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVOElIV253RRAB",
            "text": "Went as a party of 14. That's probably the most that could fit at once.\nOn stage.\nIt was a Brunch family style affair.\nFood was amazing. They kept the mimosas/sangrias coming.\nBloody Mary's on request along with coffee. The bloodies were so-so.\nBathrooms are coed, there is a bathroom attendant! Stalls are fully enclosed so yay.\nReservations recommended."
        }
    ],
    "reviews_count": 86
}