{
    "name": "Da Andrea",
    "place_id": "ChIJS1uszZRZwokRbKPTzS6hnWM",
    "grid": "MN2",
    "address": "35 W 13th St, New York, NY 10011, USA",
    "rating": 4.5,
    "user_ratings_total": 2327,
    "phone_number": "(212) 367-1979",
    "reviews": [
        {
            "date": "3분 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdk1uSnZSMGxITVhJelZWWlVhRkY1U0ZCcFQyYxAB",
            "text": "Place was delicious and Abdel was lovely !!!"
        },
        {
            "date": "22시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cE1DMVZiRXhmTjNSVE1GWm9WbXhhZWpkRGIyYxAB",
            "text": "Beautiful place and delicious food! Our server Noemi was the best. Her recommendations were great and food came on time. Seemless experience!! We also enjoyed our espresso martinis a lot."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSFgyTnpOM051WlZwcE1GWlBjRmxPUW1ac00xRRAB",
            "text": "Edison our server was absolutely wonderful and diligent, making sure we were always good and that the food was made to our liking. Made it a very enjoyable and carefree experience."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xbWFscGlURUZqU1VONVpFTkhZVUZzTFZBME9YYxAB",
            "text": "Exceptional food!! All we tried was super delicious. Cappellacci tartufo e porcini will blow your mind away 😍"
        },
        {
            "date": "2일 전",
            "language": "tr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tobmRVSmxYMjVQWm00NVJsOVBTM3BpUkZCWWJrRRAB",
            "text": "Ortam ve ambiyans çok güzeldi. Yemekler ve servis hızı yemeğin tadını almak için harika 2 saat kadar yemeğe vakit ayırabilirseniz akşam yemeğinizin tadını çıkarmış olursunuz. Mekanın müdavimleri olduğu belli oluyor yüksek se hiç yok keyifle vakit geçirmek harika oldu teşekkür ediyorum."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSalgyTkZRbE5SWm5aVlpWUjFWR0ZIVlU1aVJYYxAB",
            "text": "\"What a cute spot\" my date said.\nThe food was delicious\nVery happy with the staff. The drinks were made well. Happy I chose to eat here."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQlUzbEdWV3BLUm5CeWEyNXlia1Z4YlZoRGRWRRAB",
            "text": "If you use Google Reservations, you cannot specify indoors/outdoors table, and you will likely be seated outdoors even if you make your reservation more than 3 weeks in advance and show up nearly 20 minutes before your reservation time.\n\nWhen I arrived 20 minutes before my reservation, I was told that tables indoors are \"first come first serve\" even with reservations, and we would be seated outdoors with a heater above.\n\nOnce we were seated, we looked up, and the table was not under a heater.  There were only a few heaters, and our table was not under one of them. I asked if we could wait for a table indoors, and a server told us the tables indoors are for reservations only. I told them, we made a reservation as well, and they looked confused. We ended up leaving.\n\nI was hosting a guest who flew in from another city, and we were disappointed our plan we made nearly a month ago didn't go as expected."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWGFrUmZPVll6V1hKNU9USXRUbXBPZGxacWQwRRAB",
            "text": "Chef Meliano Plascensia is truly a prince among men! I’ve been coming to da Andrea for years, but today he went above and beyond and made our entire day.\n\nMy wife and I came for brunch to celebrate her birthday. Her favorite dish — the grilled octopus salad — wasn’t on the menu, and she was pretty bummed, but of course we understood. What we didn’t know is that our server mentioned it to the chef… and Chef Meliano surprised her by making her favorite dish anyway!\n\nIt was such a thoughtful gesture and made the celebration incredibly special. The food, as always, was fantastic, and the staff and atmosphere continue to be top-notch.\n\nHighly recommend da Andrea — the hospitality here is unmatched!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUVkwSlBPRXgxYms1bGRFOXhNV2h3TkhOaVluYxAB",
            "text": "This restaurant (Chelsea location) has all the facets for a luxurious evening out.  We indulged in four courses with drinks, spending well over $100 per person for our party.  I really, really wanted to love our evening out, but small interactions made it less than a \"5\" star for each category.\n\nThe back waiters were pretty aggressive about clearing plates; our nearly full basket of bread was cleared before our main came without inquiry (I had been saving it to enjoy with the sauce of the seafood), and, though we had finished our main desserts, our mignardise biscotti was cleared, again without asking.\n\nI am sure everything was plated deliberately and the colors of the ingredients may have been beautiful, but it was very dim and none of us could really see what was on our plate.  I think \"feasting the eyes\" is every bit of the experience, and I was disappointed to be denied that part.  I don't mind using my phone flashlight to read the menu, as I noticed most tables needed to do, but I really wanted to enjoy seeing what I had ordered.\n\nIf we return, we may try the Village location or keep our spending in check so that we're not left with a bad taste in our mouths about the experience."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twWk1sYzJOV3QzYmxRd1FYSjJlVFI1VjNSQlRVRRAB",
            "text": "Dinner at Da Andrea was wonderful! The staff were all so lovely and friendly—the hostess, Ibaia, and our servers (one of whom I believe is named Johnny) were so accommodating and made us feel so welcome. A bunch of people checked on us and always made sure we had everything we needed and that everything was to our liking. All our food and drinks were delicious and we will be coming back!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21weE9GWmhhV0ZRYUMxd2NrZFJSMkV3YW01NWRuYxAB",
            "text": "Carlos provided us with a fantastic experience, can’t recommend the ribeye special enough- fantastic food, service, and ambiance! Thank you Carlos!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMlVYVnVNMUpWUm1SNVIyOXJjVVJVU21Wak1XYxAB",
            "text": "A wonderful dinner. Great food, great vibes! Loved the hospitality (Carlos is amazing!)"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201NmJVYzBhVFJEVTJaSk9GcDZWbmcyY1haUlZXYxAB",
            "text": "They were so nice.  We made the reservation for the wrong location. But they helped get us in.  Food was delish."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prMVZEZFBlWFpKVGpsM1dqUkNOV05xY1V4cmVrRRAB",
            "text": "A lovely space. Authentic cuisine. Friendly service. They hit all the marks. Certainly on my list for future occasions."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SYU1rTmtlVTA0TUZGV1JFeDBMWEJ5TFVSbVJGRRAB",
            "text": "Great food and drinks. It’s a cute date spot"
        },
        {
            "date": "1주 전",
            "language": "zh",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkSGRWaEZiVGxTUXpOMWNUSXpNRTFoYjNWRU1GRRAB",
            "text": "夏天来的时候可以做外面，冬天就只能室内用餐喽"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205b1preHdjalZqUmxCSlVrSnNjR1JJWDA5WmRGRRAB",
            "text": "What a beautiful end to a great day in NY, staff were wonderful, food was awesome and the atmosphere was 100%"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxcFpuTnFSUzFCVGpWQ2RVWlhRMVJqT0daVU5GRRAB",
            "text": "Yummy biscotti."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pobFIxUkJSR3BVYjFKT1VYTTJNbVV5TlZBNGRuYxAB",
            "text": "Great service and food!! Would highly recommend this place to friends❤️"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRlExTTRiamRIZDJSaU9ISkpUbEpsWWpkQmQzYxAB",
            "text": "The service is amazing, the dish is nice. Really a good place for your birthday or any big days"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSU2NrMVdhVWQ1U25VNVF6TnpOamRQVTFoTVRVRRAB",
            "text": "The carbonara was wonderful! So good"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ac1RUWndXWGxoWW5kalNFdEVXbWxRWDJ4WGQwRRAB",
            "text": "The food here was so good, the pasta and especially the veal meatballs were to die for. Issac was amazing and made sure my whole group was taken care of."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSQk5sUnJjMEZCZUhoNk4yNXRjakZWTVY5c2RXYxAB",
            "text": "Issac was so nice! The food is is amazing!"
        },
        {
            "date": "2주 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSFYzZG9VVWxIUmpCWlYwTTBNM2gxYURCMVYwRRAB",
            "text": "每一道都超好吃😍\n當日現量的海鮮可能是本旅 top1"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbE0wczVhR0pDVjJNeFdXOHlkRVo2WDA5VFozYxAB",
            "text": "Three girlfriends catching up over cocktails and nosh at the bar - Nelson our bartender took great care of us, and didn’t rush us along. While there was a wait for tables we were able to walk in to snag seats at the bar. Food was delicious and shareable, atmosphere lively with lovely snug tables in the dining room for date night too."
        },
        {
            "date": "3주 전",
            "language": "fr",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRldIRnRRamM1YTNkSFJXNUVhR3A0WkRObVRVRRAB",
            "text": "Des assiettes de belle qualité mais l’accueil est déplorable (impolitesse de certains serveurs et service expéditif pour fermer le restaurant).\nIl va falloir peut être envisager un recrutement moins exotiques !"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMFpGbGpVMWR2VkZaU2FtdHViVTlXTkV0SE1XYxAB",
            "text": "This was exactly what we were looking for when we wanted to celebrate my best friend's 32nd birthday. the atmosphere was perfect and the food was delectable.\n\nThe staff was so caring and attentive during our stay and made sure everything was perfect for us."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGR1pWVkpaR1ZaVW5wU1NHa3dlR3RyUm1obGEyYxAB",
            "text": "Noemi is great!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1SlRVWllUbll5YmxScFdISmllRXBNU1RCWllXYxAB",
            "text": "Absolutely phenomenal food, atmosphere, and service. Nelson was our waiter and we will be requesting him when we go back. Cannot recommend enough."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKME9FWlJaV1ZWVjB4cldUWkhOVlJ2VVdOSGVHYxAB",
            "text": "Had dinner at the bar. Nelson, at the bar, was exceptional. When I asked what he recommended for pasta, he suggested half portions with his favorites which were delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kdWNYZEdXV3BHT0VKWk5UQXdTMk5GVm5kNFVVRRAB",
            "text": "Such a good night celebrating my cousins bday at Da Andrea! Service was great and Juliõ was amazing and attentive 😊…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WYU1FSllVR3g1VG1ad2JXcFhOR3g0VUVnek5WRRAB",
            "text": "Celebrated a friend’s bday here!! Julio was an attentive waiter all the way."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMVUxRjVXREpWYUV4VFVtWlhiRGRmUVhOeU1IYxAB",
            "text": "Amazing food and even better service!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoS1RsWllXRVpTTFRRMVgwaEhaRGxIY0VWdU5HYxAB",
            "text": "Authentic Italian fare with tasty house made pasta dishes, a good wine selection and a cozy vibe! The service is very friendly and professional, beginning with our greeting at the door through the goodbye on our way out. Everything we had was spot on with flavor , a good size portion and reasonably priced."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWa2RqQm1XRE00WjBKc1pFWktlVzF6VVRSNFRuYxAB",
            "text": "Amazing place. The food was really good and the service was impeccable. My only complaint is that the tables are very close together, but it didn't affect our experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFNGNIWm9iMU5OYVdoTFoycDJPVXROVEZneWIxRRAB",
            "text": "Da Andrea has been my favorite restaurant since I moved to this neighborhood. The decor and ambience is superb ! The outdoor seating and flowers frame the restaurant beautifully. Sidi and Wendel are the best managers and will always make you feel at home . The service is great and the menu  offers a great variety of Italian dishes . The chef goes above and beyond to give special touches to his plates . The Cesar salad with the polenta croutons is a classic and is a great gluten free option !! All the pasta are to die for !! I highly recommend the gnocchi, the ravioli and the  lasagna . They offer special dishes every day . The veal Milanese is my favorite !!! I love the steak and the chicken they have in the menu . The desserts are all good !! My favorite ones are the creme brulee and the panacota.\nThey have gluten free penne and deserts that are also GF!!\nA place you cannot miss !!❤️❤️❤️❤️❤️❤️❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sbWVVUjNjMHRGZFhwMlFuRm5iUzFMU1ZVek9IYxAB",
            "text": "Great stuff,lovely cosy atmosphere and delicious food. Truly enjoyed my dinner here. Staff is super friendly, kind."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wb1R5MHROVVF5U2tKcFNrVjVTbFExYTJGR2QxRRAB",
            "text": "Cesar salad was very cheap. It was like way too much hidden valley cesar dressing. I experienced some passive aggressive staff. Risotto of the day was good. Not worth the $$$"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWFkyczBiblpRTm1kM2NrZGxSRk5rY0ZRNFNVRRAB",
            "text": "Loved it. A great neighborhood option for northern Italian dishes. Enjoy!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSUGNUVjRUV3QwVEdaNlFUTXdURTV2UVdOMFduYxAB",
            "text": "Such a cute spot for delicious and authentic Italian food. A must try. Andrew by the bar was just a delight, kind and knowledgeable, made the dining experience that much better. Will definitely be back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWFZ6TTFTR0pNU1d4RFZqWm1UbGxwVTNjNFgyYxAB",
            "text": "I rarely leave reviews. I booked this restaurant to celebrate my birthday, but the experience was very disappointing. Even though I had a reservation, they refused to let me in at my scheduled time just because one of my friends hadn’t arrived yet. While we were taking photos, the staff kept rushing us, which felt really unfriendly. On top of that, the food was very average and not worth the hype. Definitely not a place I’d recommend for special occasions."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWmFHWnRUM3AxUTNnME0zUnRZVVp0VVVGWWJtYxAB",
            "text": "A group of friends and I went for drinks today and some wanted some appetizers. We didn't see anything Gluten Free and Lactose Free items in the brunch menu so one of them asked if they had something like fries, the server answered in a really nasty way \"we don't have fries, this is an Italian restaurant\". There was no need for that comment, she could have said \"we have roasted potatoes\" instead, but she chose the rude answer. Other than that, drinks were excellent, appetizers too."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWeWJYZHhSRmd6VkRKWGJWcHdhbFpEVnpkRU4zYxAB",
            "text": "Woooow! The food, the ambience and the outside flowers 😍. Simply the best experience for a birthday brunch. Thank you so much for your hospitality ❤️🇪🇨"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGblNVZ3hhRTlQTFhSSGNVRnhhMVV0WXpWdVJtYxAB",
            "text": "Had an amazing time. Great outdoor table with wonderful candle light, plenty of space between tables and wonderful spacing of dishes throughout the night. Great recommendations- steered us right! Ribeye special was phenomenal. Many thanks and will be back again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xseGNFdFpORTkwYnpWaWFXNHhkMU5NUVVGM01sRRAB",
            "text": "Issac was amazing! As was the food, ambiance,  and service.  Food absolutely delicious! They were able to accommodate my dietary needs - vegan. Definitely will come back again!\n\nThis is a place in the sun."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJeGVIRXlOM0l3VUc1NWVVdGtYM0Z3UVRORWJFRRAB",
            "text": "This might be one of the most ideal first date spots, since they never rush you out. Funny enough, the table next to us was literally on their first date.\n\nBoth pastas were perfectly al dente, the appetizers were fresh, and the seasonal cocktails and mocktails were the real standouts—super refreshing. While the food here isn’t mind-blowing, they still do everything right.\n\nIt felt so nice to sit on their beautiful patio on a cool summer night. The price point is high, but you pay for the service and the vibes. The whole experience felt genuinely Italian as we ended up staying for three hours, enjoying three courses and dessert, without ever feeling rushed.\n\n＊Warm Octopus Salad $21 **\n＊Carpacio $20\nI actually really enjoyed the appetizers, especially the octopus salad with crispy potatoes, olives and capers! The beef carpaccio was also great, with generous slices of raw beef\n\n＊Pesto Cavatelli di Ricotta $31**\n＊Sausage Ragu Pappardelle $30 *\nThey are best known for their shiny, velvet-green pesto pasta, reviewed by Eric Kim on the New York Times.  The rich pesto pasta was my favorite, though at this price point, I expected the shrimp and salmon to be of better quality.\n\nOur server split the two pastas into two servings and brought them out as separate courses. It was such a thoughtful detail, especially for a first date, so you don’t have to awkwardly share from the same plate.\n\n＊Homemade Apple Tart $12\n＊Panna Cotta w. Amarene Cherries $12\nWe ended the dinner with an apple tart and panna cotta — I hadn’t had an apple tart for so long, so this one really hit the spot with vanilla ice cream. They brought out biscotti on the house which was very buttery and crispy.\n\n＊Frangola Fizz $19 **\n＊Watermelon Man (mocktail) $14 **\nThe strawberry basil cocktail with titos vodka and elderflower was refreshing, and I loved how unique the watermelon and lemon mocktail tasted like."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21velpYSnlWbTVvZEZOblIxVmZWMkl6VlRRMVNXYxAB",
            "text": "went there for my daughters 18th birthday. great place was empty when we arrived but quickly filled up. service was great and the food was delicious. portions were for more than one person. busser Mohammed was exceptional made the experience a great one."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201V01XMVBSVzVEU1hwVk5uZ3hSa3hVZUVoNWJVRRAB",
            "text": "The service was so slow and the waiter kind of caught an attitude with someone in my table who didn’t know English fluently. The food was really great though!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OeVZWZHJUMkpFYTBOdmFWOTFMVFJWWXkxbVVtYxAB",
            "text": "Excellent food magnificent service. Yesterday we celebrated my best friend Birthday was fantastic.  Gratitude"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOS2RIWlZSbGxQZUU0NE5GUm1aa0paVFV4NGFtYxAB",
            "text": "Wonderful Birthday celebration with my wife and friend. Everything was wonderful. From the tiegelle modenesa appetizer I have thought about having again since I’ve eaten them 30+ years ago in Modena Italy to the Lamb shank with risotto and completing my Birthday meal with the ricotta cheese cake. My wife had the Gorgonzola gnocchi and our friend had the mushroom risotto. Everyone enjoyed their entree’s. The service was amazing from James the waiter to Khan his assistant (Hope I remembered and spelled his name correctly) we’re both amazing along with the entire staff were all attentive and made my Birthday celebration so very special. We will return to try other items on the menu and bring back family to enjoy the wonderful food. ❣️"
        },
        {
            "date": "수정일: 5년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvb0phQktREAE",
            "text": "I have been Italy for many times and the food here was really similar taste like real Italian style. I tried the pork chop steak with the fruity sauce and it was really great. I could give 5 stars but the server was really rude to us and not pleasurable.\n\n이탈리아 여러번 갔다왔는데 먹어본 이탈리아 식당 중에서 정말 이탈리아 전통적인 맛이 납니다. 다만 서브하시는 분이 굉장히 불친절해서 4점."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHOUtueXFRRRAB",
            "text": "분위기가 좋습니다\n파스타는 3종류 다 많이 짰어요 특히 까르보나라.. 너무 짜서 못먹겠더라구요 ㅠ_ㅠ\n\n구운 야채 에피타이저로 시켰는데 지이이인짜 맛있어요 추천추천!!"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHNUtuSGt3RRAB",
            "text": "분위기 좋아요 ❣️ 애피타이저 진짜 맛있어요 !!근데 중요한 메인 파스타가 너무너무 짜요 까르보나라 진짜 짜요 입에 마비올 수 있으니 조심하세요?"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMycjdLYWRREAE",
            "text": "맛이독특하고 맛있었어요.주문해주는 웨이터도 아주친절하고 ..너무 시끄러운거 빼고는 아주 맛은 좋아요"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQydktXSUdnEAE",
            "text": "친절한 웨이터의 레코멘데이션으로 맛있는 식사했습니다."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tScU0xRm5VVk4wT0c1YWQyUnNUazVLV2pKak5VRRAB",
            "text": "Everything we had including appetizers, pastas, mains, and desserts were all so good! Excellent foods and services, couldn’t get any better. Had a wonderful family dinner celebrating family occasions. The portions of each food is pretty big ; though they say it’s for 1-2 persons, it could be for more people.\nMost definitely recommend, and can hardly wait to go back again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wcVQyWmlRMHBrUW1aMGNYWXhWbUl0ZFZoUFlsRRAB",
            "text": "I’ve been coming to this restaurant for over a decade—at least ten, maybe twelve years. It used to be a dependable gem: cozy, flavorful, perfect for a date or an intimate dinner with a friend. And parts of that are still true. The space is still lovely. The pasta? Homemade, excellent. The lamb shank—rich, tender, and well-executed. But something has shifted.\n\nThe portion sizes have noticeably shrunk, across the board. It’s hard not to notice when you’ve built a relationship with a place over time. Whether that’s an organic sourcing shift or just cost-cutting, it doesn’t feel good. The mussels were a bigger issue—slightly fishy, likely frozen, and not up to the standard they once held.\n\nService was the final blow. We caught them at the tail end of the night, sure—but that shouldn’t mean rushed, spotty, or disengaged. That’s not the restaurant I remember.\n\nThey were also out of Grey Goose, which felt like an odd miss for a place that once paid close attention to its bar program.\n\nAll in all, I left with a full stomach but a bit of an empty feeling. This was a place I used to recommend. Now? I probably won’t return. There are too many other places in the city that haven’t forgotten what made them special."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNeXBvZXZTdDlQT2dBRRAB",
            "text": "This is an amazing restaurant not far from Chelsea Market. The food and drinks are SO good (I’d recommend the seafood ravioli but everything was great). It is a super cute place in a great location. Noemi was our server and she did a great job. She was very attentive and had great recommendations."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLV3J3YUxLNlBEd3VRRRAB",
            "text": "Visited this past Thursday evening with my small group and we thoroughly enjoyed ourselves from the moment that we stepped in to the moment we left. I had high expectations, couldn’t tell if the food was better or the service, it all left me in awe. Authentic italian dinner I felt right at home. The young lady who took care of us was very knowledgeable about the menu, she really sold us on all the chef specials including the Swordfish with a tomato sort of tapenade which was to die for. The Maitre D or perhaps could have been the GM was extremely charismatic. We were the only guests left besides bar guests and he personally came over to greet us and hear about our wonderful experience, even shared a personal story of his with us that we loved, which was the cherry on top. Great food and warm, thoughtful service will always have continuous business. I hope Da Andrea stays here forever. I hope everyone working behind the scenes to make our dining experience as wonderful as it was gets all the praise and positive acknowledgement"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOVE5DMXFOV0ZmWDJrelVWWjFabUUxYmxORU5uYxAB",
            "text": "Came in with low expectations, having only heard that the vibe was cool—but Da Andrea completely surprised me. What really stood out wasn’t just the aesthetic, but the level of service.\n\nIsaac was laser-focused and thoughtful with every detail, and Sidy (thank you for the amazing service) at the front made sure everything was smooth from the moment we walked in.\n\nI ordered the salmon and swapped all the sides for a Caesar salad, and wow—anchovies done right. Salty, rich, full of flavor. The salmon itself was crispy, juicy, and exactly how I like it. My girls got the filet mignon, medium well, with butternut squash and broccoli on the side, and not a bite was left. We also shared the pesto pasta special with shrimp and salmon, and it was honestly one of the best pesto pastas I’ve had—bold, bright, perfectly coated.\n\nThe warm focaccia with olive oil and bits of olive inside was such a nice touch to start with, and the entire team, including Redwan who checked in throughout, made sure we felt completely taken care of. Big thank you to everyone—this meal was a win."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WcU1YTnNkRXN5YTNSWVdtSklka00xTjNsZk0wRRAB",
            "text": "Had reservation here 3 of us hostess very nice sat us inside our server was a little abrupt but we delt with it. Cocktails were strawberry Tito’s and elderflower a little on\nThe sweet side $ 19 was a little high for the size of the cocktail but we are in New York. Food wise we had carbonara, bolognese and Mediterranean pasta dishes all were very good. Good spot but did feel rushed we would come back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOcmREaGpUbFkyVmxSWlIzQlNORVpuUkdGclVrRRAB",
            "text": "I rarely leave reviews, but my recent visit to Da Andrea was disappointing enough to warrant one. I came in hoping for a nice lunch with a friend, but the experience fell well short of expectations.\n\nTo call what’s served here “Italian food” feels misleading. I ordered a salad priced at $20 and was genuinely shocked by how horrible it was — more like scraps than a proper meal. While the interior is noticeably run-down, that alone wouldn’t have bothered me had the food made up for it. Unfortunately, the combination of a tired space and lackluster cuisine gave the impression of a place well past its prime.\n\nMy friend ordered one of the pasta dishes and described it as “bland and chewy.” She cooks often at home and remarked, “We probably should’ve just stayed in. I could’ve made this myself.”\n\nThe only redeeming aspect of the visit was our server, who was attentive and professional. That alone was enough for me to still leave a standard tip.\n\nAll things considered, I wouldn’t recommend dining here. Save your money — there are far better options for Italian food in the city"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjeU9EVXlkekl3U0ZKMlkxRndXbU4yVlUxU2VVRRAB",
            "text": "What a great little place this is in Greenwich. We came up for the weekend and ended up eating here three times. Great food. Italian done right. Excellent service and craft cocktails. We’ll be back. And you need to eat here."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJazVlbWVBEAE",
            "text": "The service was amazing but it can’t make up for sub par ingredients. When I eat out I am expecting top ingredients, more Whole Foods and above, less Key Foods and below.\n\nI had potato soup and a mushroom prosciutto salad with shaved slices of Parmesan cheese. Portions were fine. Just my salad had those cheap, white, grocery store mushrooms.  The garnish on my soup (I think alfalfa sprouts?) tasted like moldy dirt. My friend has tuna tartare which she said she liked but barely touched.\n\nThe waiters were very attentive and kind, so that made up for much of it. The price was $72 for just this and two cups of tea.\n\nThe atmosphere was fine, if a little tight. We went mid day so was pretty empty.\n\nWe may just not have ordered well. But not sure we will give them a second chance, we shall see!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkMVYxbDJNRFF0VkVKaU9WWk1RMk53TUV4RGVsRRAB",
            "text": "I took my girlfriend here on a planned excursion and she was blown away with the quality of their food. They accommodated her allergies, which are many, and were extremely welcoming for our specified needs upon entering the restaurant. The host is such a kind man and helped with the allergy accommodations. Thank you so much for the amazing food and beautiful restaurant!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNWN2RTdBRRAB",
            "text": "I would come back! Cozy and welcoming. Everything was really good. We tried the carbonara pasta and the risotto with Italian sausage (specialty of the day). Delicious food! You won’t regret! Issac served us and was the best!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdHNtZUNREAE",
            "text": "We visited this restaurant recently and were really impressed! The pasta was absolutely delicious – perfectly cooked with a rich flavor. The octopus was also fantastic: tender, aromatic, and beautifully presented. And the dessert was a real highlight! Light yet full of flavor. The atmosphere was very pleasant, and the service from Polina was outstanding. She was attentive and friendly, making our experience even better. We’ll definitely be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOGZhUHh3RRAB",
            "text": "Overall, was a good Italian spot depending what dish you got. The Bolognese was tasty and it was a good portion. The ravioli was a much smaller plate. Make sure to get the tiramisu, it was delicious!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNW9XandBRRAB",
            "text": "One of the best dinner experiences I’ve ever had.  I went with 15 ppl and enjoyed a 3 hour extravaganca. The service was great and the decor was beautiful.\n\nWe shared wine and all did the tasting menu. Appetizer,  Salads, pasta, steaks, cocktails, and desserts were all delicious.  Everything carefully well seasoned and thought out.\n\nDefinitely give it a try"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kc1prVXdNWEZqZUdoRk5WZEJkMnN3ZWpsbFMwRRAB",
            "text": "Delicious food, service was a bit slow, seating was slightly cramped but it was overall an excellent experience. Staff were very friendly and were busy dealing with a group of disgruntled guests when we first walked into the restaurants."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLX1RpUGZKNnRYeklnEAE",
            "text": "Great ambiance and the food was delicious! Julio was the best server! Definitely worth it for a dinner reservation."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNV3h4SnZmeVBTSjNRRRAB",
            "text": "I went to this place last month for lunch with two friends. At first, everything was fine; the appetizers were delicious. The problem arose when I ordered my main course (filet mignon)—I told the server, “No spinach, please.” Spoiler: The dish came with spinach!!!. I didn’t say anything because I didn’t have much time to wait for another dish. When the server came to the table again, I said, “Excuse me, I think I said I didn’t want spinach.” The girl responded, “I sent the note on the ticket, but I don’t think they don’t know how to read.” She wasn’t able to apologize, and that basically ruined the lunch. I wouldn’t return because of the service or how they resolve issues there. Please speak to the server because she didn’t offer a good answer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMX1pIdWRnEAE",
            "text": "The he food was wonderful 5 star. The prices for the food were also reasonable 5 star. The prices for the desserts were high 3 star as each was the same as the pasta dishes. The reason for the 2 star review was they rushed us. They would clear the table sometimes before we were done multiple times; after the appetizer, after the main & event after dessert. Then the put the check on the table without us asking for it.  It was an hour & 15 minutes.  There were 3-4 other empty tables inside and 10+ empty tables outside. We paid $300 for 4 people.  For $75 a head, you’d think they would let us take our time. I’d also understand if there were customers waiting but there were plenty of empty tables with no line outside.  I DO NOT recommend this place despite the great food and ambiance."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MWZpVzhRRRAB",
            "text": "Really late in reviewing this place but I really love this location and this restaurant. Great restaurant to go to for date nights, or lunches. Waiter was super nice and amicable and made great recommendations for us. We've gone to their Chelsea location but we preferred this location simple because it felt less crowded and more personable which might be our preference to their particular staff and space.\n\nHighly recommend their octopus appetizer, called \"Insalata tiepida di polipo\" if it's available. I haven't been here in awhile so I'm unsure if their menu changes seasonally or whatever, but if you see it on there, please get it. My husband hadn't had octopus before trying this restaurant, and because of them, he loves it now. It was so tender and delicious, cooked masterfully.\n\nCan't wait to come back. The interior is intimate, but not super dark and gloomy, it's just a lovely place to go out and enjoy some good food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNGUybXNBRRAB",
            "text": "Went to Chelsea location for fixed price lunch. Great deal. Excellent food. Biggest surprises were: the grilled octopus (worth $6 extra), mushroom truffle risotto and the steak (worth $9 extra, perfectly cooked great flavor). Nice atmosphere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREaTdyUVVREAE",
            "text": "Very nice restaurant, I think I’ll return for great food. We had a party of 7 and everyone was satisfied with their orders, antipasti were good too (we got octopus salad and mix of fried calamari, shrimp and zucchini). Deserts were great, we ordered big selection of them for the table and shared, so I had a chance to sample many and each of them I’d order again.\n\nSlight minus of the place is that servers are a bit slow to attend. We spilled water on the table and it took a while before someone finally collected wet napkins from us and attended to the table. However, besides that I have no complaints. Waiter was friendly, provided us with great recommendations, food came quickly. It’s a pricy place but totally worth it, good food guaranteed."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjNVQyYzJRVzVpU0RCYWFGQnFhV2RCYmxZMGRuYxAB",
            "text": "Super nice place, super cozy environment( especially after a long working day lol) I want to especially mention Tatiana, super nice and the recommended wine match with my pasta so well! Pic is the special watermelon salad, really refreshing for a hot summer day!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibzYzNXBRRRAB",
            "text": "Tatiana was our server and she was the best! She was kind, attentive, and gave just the right amount of attention. Drinks are a little pricey - $18 cocktails - but the spritzes are unique and yummy. Grilled vegetable salad is flavorful, and the papardelle pasta was a good portion."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNXNueDlnRRAB",
            "text": "After scouring through the plethora of Italian restaurants in midtown Manhattan, Da Andrea kept coming up on every list and I decided to go ahead and make a reservation for our 10th wedding anniversary.\n\nWhen we stepped out of the cab and saw the exterior, my wife said \"oh this is so pretty and sparkly!\" and I had a good feeling from that point on. The moment we entered the restaurant and were met by the host (the young Senegalese gentleman who epitomized hospitality), I knew I had made the right choice.\n\nThe crowd in the restaurant spoke enough volumes for me and as I looked at the food coming from the kitchen, we knew that we were in for a treat. Our server was incredible and made suggestions on what to order and was very attentive so top marks for service.\n\nWe began with the burrata bon basilico which was wonderful (I love cooking Italian food and this hit the spot). Our entrees were the penne con melanzane and ravioli di crostacei and to put it plainly, if there was more room to eat, I would gone for a second round.\n\nFor dessert we were brought an anniversary creme brûlée which was amazing and capped off a wonderful evening for both of us.\n\nThank you to the wonderful staff for your hospitality and kindness. We look forward to returning."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyeklXNl93RRAB",
            "text": "Beautiful place for dinner with friends or a date night. I definitely recommend booking a table in advance. We ordered a salad with warm octopus as an appetizer, and it was pretty good. Their signature dish, Cavatelli di ricotta with shrimps and salmon, was delicious — something very unique compared to classic pasta dishes. The homemade pesto sauce is flavorful and light.\n\nThe service at this place is superb; we were pleasantly surprised with a nice bonus of biscotti cookies at the end. I’d definitely love to come back to try their other pasta dishes."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNM1JfWVdGbTlpeFVREAE",
            "text": "Beautiful place, very elegant. Good fod snd service, excellent service! I was dying for a mimosa and they made me one even though it was not in the menu"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4MGJ6c0x3EAE",
            "text": "Please do visit and try this place, because this review is limited to only few dishes on a specific brunch day.\nThe atmosphere is lovely. Live music for brunch. The waiter (Vicente as stated on receipt) was wonderful. The rest of the staff seemed very professional and nice.\nSalad with shrimp-shrimp were good, salad was bland. Flatbread with arugula and lemon was very good, a winner. Salmon was a disappointment. Dry, bland and side veggies tasted like heated frozen food.\nDesert was below average. Tasted like it was old reheated or from a box.\nOverall it seemed like there was no heart in the preparation. Bland. Way overpriced. Photographs nicely.\nI truly believe other 5 🌟  reviews and saddened that mother's day meal wasn't better for me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREdk1UR1ZREAE",
            "text": "This place is a fantastic Italian restaurant! 🇮🇹 Da Andrea on Greenwich Village 🗽 offers a wonderful selection of delicious 🤤 Italian dishes. 🍽️ Definitely try the Chicken 🐔, Carbonara 🥓 Pasta 🍝, Spinach🥬 Ravioli, and Lamb 🐑 Shank! 🍖 Everything is absolutely delicious! 😋 Staff 👨‍🍳 is friendly and professional, ambience 🎶 is great, the place is nicely decorated 🛋️, and they have plenty of indoor and outdoor seating. 🪑 Making an online 🖥️ reservation 🛎️ in advance is recommended. I wish I knew about this place sooner! ⏰"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtdjVibWNnEAE",
            "text": "We loved our time here! We sat in the outdoor seating, which was surprising warm with the heaters. The food was delicious, the waitstaff was friendly and bottle of wine was perfect addition. Our favorite meal was the cappellacci- most interesting and savory flavors with truffle. I love pesto, but the salmon and shrimp taste takes away from the pesto sauce. Everything else was great; not sure if I would return given so many Italian restaurants in the city. Also, surprising that the portion size was smaller compared to the price point."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2N2V2Tnh3RRAB",
            "text": "Wonderful Italian restaurant. Burrata and Margherita Flatbread were both great appetizers to share. The Gnocchi di Patate were a delicious entree, as were all of their fresh pastas. Service was pretty fast, though sometimes inattentive. We sat outside and it was quite windy in their seating area, but still manageable. Would definitely go again!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMMlo0NTNfdmFHbkRBEAE",
            "text": "This charming little place was well worth the detour it took to get there! Off the beaten tourist path in NYC, this place was well worth the effort. The fresh pasta made in house was on par with pasta we ate in Italy. I started my meal with the Beet Salad- one of the best beet salads I have eaten (I always order a beet salad if it is on the menu) so often salads these days are over dressed but the balance of all the flavors of this one were spot on.  I had the days special of Spinach Pappardelle with pancetta, peas and cream sauce, it was fresh and perfectly al dente. My hubby had the gnocchiti and it too was perfect, no gumminess and the flavor was so smooth. We arrived right when they opened so I was worried it would be sub par as early lunch times sometimes can be rough, but service was excellent as well. I was very much looking forward to trying their desserts, but did not have room for it. They brought out a small pot of creamy custard with a few small biscotti on the house, I wanted to pick up that little pot and lick it clean so badly, it was that good. I cannot recommend this place highly enough!! It is worth whatever taxi or train needed to get there if you are visiting NYC! Chefs Kiss"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwbkpXaXZBRRAB",
            "text": "It’s definitely a fun spot to visit if you’re looking for a good ambiance and great service in the area. We visited on a Saturday night and sit outside, so the service is a little slower than usual.\nFood is on the average or a little above average compared to other Italian restaurants in the cities. You won’t be disappointed! I specifically like the beef shanks with tomato sauce risotto - a special menu of the day. Their carbonara is also pretty good!\n\nI’d recommend to have a reservation if you’re planning to visit during the weekends."
        }
    ],
    "reviews_count": 87
}