{
    "name": "Song' E Napule",
    "place_id": "ChIJ04qK9Y1ZwokRgw_VSJz_lAY",
    "grid": "MN2",
    "address": "132 W Houston St, New York, NY 10012, USA",
    "rating": 4.7,
    "user_ratings_total": 2446,
    "phone_number": "(212) 533-1242",
    "reviews": [
        {
            "date": "22시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GeVVsTk5kRmx6VEcxV1ZYTlVUMHB0WWxwVmJWRRAB",
            "text": "The pasta alla nerano was one of the best pastas I’ve ever had!!! The ambiance was amazing and created the perfect environment to enjoy s good, relaxed meal"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOVGVrRldUMk5HTjBsbFYxRmtaMXBwUzBsNWIzYxAB",
            "text": "Some of the best neapolitan pizza in New York City and one of our favorites. We always recommend them. However yesterday, we ordered the pizza parmesan and notice that it no longer had smoked mozzarella. That's our favorite pizza but not anymore. Not sure why they did this but please bring it back."
        },
        {
            "date": "1일 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOR01YZ3lUVk00Wm1OUFdFMW5lbFpLWjJkeE9XYxAB",
            "text": "Grande ristorante con cucina partenopea. Lorenzo e Adelaide ci hanno accolti e coccolati durante tutta la serata. Il locale è accogliente e simpaticamente arredato. La cucina è ottima e i piatti sono ben serviti. Se festeggiate il compleanno preparatevi alla sorpresa che vi aspetta a base di musica, candeline e panna montata!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkQ2VYb3lhRk5OVVVwVWN6WkJXV3h2ZFRkd1ZHYxAB",
            "text": "One of the best neopolitan pizzas around new york area.Friendly staff 👌"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gb1EzRk1OemxGWmpWQ2RUSkNaM1J1YkhONFVrRRAB",
            "text": "My boyfriend and I popped in for dinner before a show. We were quickly seated despite no reservation and this hip and bustling spot. Delicious pizza! Nice elevated and lively atmosphere on a Saturday night. I would come back again!"
        },
        {
            "date": "5일 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFMWJqYzNNR2RpVkZOSlIydzVkR2hGV2xoaVkzYxAB",
            "text": "La migliore pizza in assoluto!! Sono stata da Song e Napule e mi sono trovata molto bene. Intanto complimenti al personale! Tutti simpatici, professionali e attenti ai dettagli! La pizza è davvero buona, impasto soffice e ingredienti freschi. Ho provato anche la pasta alla Nerano ed era gustosissima, cremosa al punto giusto. Posto consigliato per chi vuole una vera esperienza italiana"
        },
        {
            "date": "5일 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SdU56bGxWa0ZhYWpkdlluTlFSazVXTWxneWIyYxAB",
            "text": "Pizza buonissima e ambiente famigliare molto simpatici e amichevoli"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKQ05IWjJSVE5NUzBoTFJHOVNZbkZVYnkxUGJuYxAB",
            "text": "Food was really meek. I love Nepolitana- style pizza and was hoping in NYC, it would have been outstanding but it was borderline trash. I had the diovola pie and my wife got the squid ink pasta. Neither of us finished our plates."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twbmRrdGZkbFl3VUhWQlF6RlhYeTFpWjIxQ01sRRAB",
            "text": "The best Neapolitan pizza in NYC. No contest. Incredible staff front and back of house. Special thank you to Lorenzo, Gabriele, and Vincenzo. As a Neapolitan pizza kitchen owner in NYC, Pizzalio Lorenzo allowed me in his kitchen and showed me his process. Great people, great food. I would highly recommend to anyone visting the city makes a stop!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GQ1pIVkdNMVZRTnpCSWNrUTRZVzFwZUZWYU1IYxAB",
            "text": "Best pizzeria in downtown if you are like me and looking for a taste of home! Forza Napule!\n\nEverything is imported for their pizza and you can taste home in the buffala mozzarella and the pomodoro! You can taste the soil and the earth. Che bella!!!!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pScWExWnFhMnM0U0VoRVEyeDFZWGhXYVdWbldsRRAB",
            "text": "Came here for lunch and had some amazing pizza served by fantastic staff. Thank you Lorenzo, Gabriele and Vincenzo!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGc0xVaHRSVmx3VlRneU1sbE9kVlZ2VjJSMVFYYxAB",
            "text": "I had such a great experience at this Italian restaurant! The food was amazing authentic, one of the best Italian restaurants I’ve been to in the city. Our server, Adelaide, was so sweet and welcoming. You can tell she really cares about giving guests a good experience. Highly recommend this spot if you’re looking for amazing Italian food in Manhattan!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOeFYwczFVV1kxZFhwaFprRnRha0V6ZVVwS1pHYxAB",
            "text": "What an amazing pizza, just like back home... however Song' di Bari LMAO"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKTGNubDZWMEpRZUdsdmFIZGFUWEJCWVdzd1psRRAB",
            "text": "Pizza, pasta, the atmosphere and whole staff are incredible. Luca and Adelaide make you feel at home. My go to spot anytime I’m in Manhattan."
        },
        {
            "date": "1주 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsUlUyVkhURjg0TjFGQ01ucFpkRjl3VkZOWFUxRRAB",
            "text": "Che dire… Song e Napule NYC è stata una vera scoperta! Il cibo è delizioso, ogni piatto pieno di sapore e curato nei dettagli. Ma quello che ha reso l’esperienza davvero speciale sono stati i camerieri: Gabriele e Luca sono semplicemente…"
        },
        {
            "date": "2주 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWbGJWVTBUaTFoU1dWdFYzUnBkbTlETlhaYWFVRRAB",
            "text": "Napoli a New York c’è e Ciro, con le sue pizze straordinarie e piatti squisiti, lo conferma.\nPer un attimo ci è sembrato di essere davvero a casa, tra i quartieri, ad ogni morso il palato ha gioito e i nostri cuori si sono sentiti a casa. Servizio impeccabile, staff qualificato, cordiale e accogliente. Un saluto affettuoso soprattutto a Lorenzo e Vincenzo. Grazie di cuore per averci deliziato. Siete testimoni autentici della tradizione napoletana a NY."
        },
        {
            "date": "2주 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOeVJXbFhkR3BDZFc5TGMybE9UWGxPZWpCV1JuYxAB",
            "text": "Si mangia benissimo e i ragazzi sono molto gentili"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNmREUmtkV0pKV2xSWlZsazViblpQZWxOcVJYYxAB",
            "text": "Adelaide is the best server, and Napoli has the best Italian food I’ve had in the city. I can’t say enough good things about this restaurant, the atmosphere and the service is amazing. Don’t miss out on Napoli if you want delicious authentic Italian food."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUkxXcFRWRzVVYlRnd1NGWjVUR2wyWDI1SGEzYxAB",
            "text": "Pizza was delicious, very friendly service. Place is busy, loud and tables are very close to each other."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWGJtcE9YMHBRUkRScVNXNW9VRmhEUVZCRmExRRAB",
            "text": "We ordered the black truffle pizza, which was hands down the very best I have ever eaten. It was exceptional… I don’t know the right combination of adjectives to describe it. I fear that I’ll never be able to eat ordinary pizza again and call it “good” after that…"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGcmMxUjZaVUZwYjBFNU1rSlFRMGRHTlU1NWVtYxAB",
            "text": "Margarita pizza was really good. But burrata one was the best! $24 per Pizza was totally worth it"
        },
        {
            "date": "2주 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paQ1FVcEJMVzlTY25RMVpYUnpaa0ZwZFc1NFRWRRAB",
            "text": "Un vero e proprio pezzo di Napoli al centro di New York. Pizza veramente spettacolare, curata negli ingredienti, impasto leggerissimo e digeribile. Consigliatissima a tutti gli italiani che hanno nostalgia di casa ma anche a tutti gli americani che amano la cucina italiana."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkamFsRm1SMDR6TjNBd1lqUjJiVUpsYkdGSmQwRRAB",
            "text": "Amazing restaurant! Limoncellos were amazing and Roberto our server was the best!"
        },
        {
            "date": "3주 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVmVGRmZjMUJzTkVwMGFUQXdaMnN6YzFkYU1FRRAB",
            "text": "Momenti magici e rilassanti. Lorenzo un figo, pota‼️\nCi siamo divertiti. La pizza fantastica. Squisita.\nIl gruppo molto gentile e attento.\nA presto!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kb2VtOHdYMEpvYVc1T2IycEVaak5XZHpGbFgzYxAB",
            "text": "If you like Neapolitan pizza this is one of the best hands down. Blows some of those other places in Brooklyn you might have heard of away."
        },
        {
            "date": "3주 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kRlFuTmhjRFpoWDJkVlJuVkdja3g0ZEdaRGRYYxAB",
            "text": "Come sentirsi a casa. Non ho mangiato molte pizze a NY, ma sicuramente questa fa parte delle migliori che si possa trovare. Favolosi."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWU2FGQlFaR05qVTB4V1ZVaHdXbVkxVVU1cmNHYxAB",
            "text": "came here and the first thing I’m hearing when I sit down at my table is the sounds of the coworkers loudly and obnoxiously growling at each other. they were doing this for a little 5 minutes straight, and it was so aggravating because the environment is already loud as it is. i understand enjoying time with coworkers, but this was so unnecessary I couldn't stand it. me, my girlfriend and a few other customers were staring at each other in confusion when this was happening. on top of that, when one of the waiter’s came to take my order, he goes “ready? ready?” and as soon as we tell him our order, he just walks away."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wa1ducFdYM2gwYW5Rd2FuaHVVblJQY2pacVJIYxAB",
            "text": "Song’ E Napule brings real Neapolitan flavor straight to New York. The pizza is incredible—soft, chewy crust with that perfect char, fresh tomato sauce, and creamy mozzarella that melts just right. Every bite tastes authentic, like something straight out of Naples. The pasta dishes are just as good, full of flavor and cooked perfectly. The space is cozy and welcoming, and the staff make you feel like family. It’s one of those rare places where everything feels genuine—simple, warm, and absolutely delicious."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KNFZYZGFhMFpwVFhWMmVIaDNTMFZOVW1sVlNXYxAB",
            "text": "So good!! We actually just came back from Italy and ended up at this place on the suggestion of a very good friend… We will come back again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ReVNWaGFXakJTU1ZkTk4yaHZUWGQxWmtKcFRGRRAB",
            "text": "Decent"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGV2NGSk5VRnB1VERCTWNFVnhMVXhzYVU1bWJsRRAB",
            "text": "hands down my favorite italian restaurant outside of italy"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4NE5VTlNVbTlYVEZsQ2R6Y3dkblIxVnpoVFpHYxAB",
            "text": "Tasty and Italian recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWFREQm5UV0ZSWms5NllrOVhURTB0WjNKcWRXYxAB",
            "text": "Everything was great! Everything we ordered was really tasty, atmosphere in the restaurant is great and everyone was so nice!\nShoutout to Pietro that took care of our table - his vibe and energy are unmatched! We had great time with him"
        },
        {
            "date": "1달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTVNFaElObXBZUmpBemVsRjRVUzB6Y0dWNU1tYxAB",
            "text": "진짜 진짜 진짜 맛있는 정통 나폴리 스타일의 마르게리따 피자와 파스타.\n직원분들도 정말 친절해서 환상적인 식사를 했다.👍\n\nAuthentic Neapolitan-style Margherita pizza and pasta were absolutely delicious. The staff were also incredibly friendly, so I had a fantastic meal.👍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25keVdtbExOekJIUjNCVVFWcGtTVGhIZGpocWNVRRAB",
            "text": "Absolutely the best pizza in New York. Great service!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SM1FsSlNTR1pJYzNFMVMzbHVkVk16TTFSSGVrRRAB",
            "text": "Such good Pizza, service makes you feel good and at home. Forza Napoli, from a Flamengo fan born in Brazil❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taSWFHaHhUemhWWVhRM01IaENRVzlsYm5SNk4zYxAB",
            "text": "Note my husband and I are European so have high European standards for pizza. The pizza is good, but we have had better in this city. The Neapolitan with anchovies was fine, but the sausage and broccoli one was not good (no flavor at all).\n\nThe staff are attentive and quick, but the restaurant is deafeningly loud. Couldn’t even hear my partner speak. There is only 1 mixed toilet for an entire busy restaurant so often a queue for it."
        },
        {
            "date": "1달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxeE0xbGlhMUJhVDJoR1VrNDVWRkZrT1dkUWVGRRAB",
            "text": "Salvezza assoluta per chi ama il buon cibo e la cucina italiana…detto ovviamente da un italiano 😉\n🔝…"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCYVNsaHRSblJzY1hWMGRsSlZWVmg1ZDFNeFZVRRAB",
            "text": "Un sitio muy bonito con comida muy buena la verdad. El sitio esta ambientado en el futbol y sobretodo en Maradona y mola mucho. Las pizzas te hacen sentirte en Roma y por un precio muy muy justo estando en Manhattan."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GRGFuSmpRVEU1Vm13elJXazFPV0pNWmkxZk5VRRAB",
            "text": "Nice good"
        },
        {
            "date": "1달 전",
            "language": "it",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tseFpFcHdia0p0YXpsTlYwcDZlbVV4ZWxKb1ZYYxAB",
            "text": "Per quel che riguarda la qualità non si discute. Modo di lavorare non corretto. Posso capire, la mancia, se mi siedo ed ho un servizio al tavolo. Ma se ti chiedo un panuozzo da asporto, me la fai pagare comunque senza nemmeno dirmi nulla?!?\nLa mancia non mi risulta obbligatoria. Se la vuoi me la chiedi!!\nScorretti."
        },
        {
            "date": "1달 전",
            "language": "it",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWVNXVlNTV0pxYTNodVkwa3lhV3BUUWpCdmNrRRAB",
            "text": "Servizio rapido e buoni piatti italiani. I camerieri sono un po' troppo esuberanti per i miei gusti, tipico dei meridionali. Locale ordinato e bien arredato, noi siamo stati in un tavolo esterno"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OM05VMUVOR3RQTmxoR2RsWmtWbEJwUjFRMmFIYxAB",
            "text": "Food was amazing, but unfortunately the portions were a little on the smaller end. Staff were very attentive and friendly. They even seated us quicker than our normal reservation time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVU9WVk1lbTFLUWs1SmVVcFdkM3BZZUZOTVJXYxAB",
            "text": "Fun Italian place in West Village. Main focus is neopolitan pizzas which were delicious (the dough was fantastic). The atmosphere is fun and lively and the staff was very nice. We also had some great meatballs."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oYU5FbFlXR0pTWjBKblZXOWlTR0U0UWxsclJuYxAB",
            "text": "Compared with the other reviews I think I got them on an off night. Pizza ingredients were great, but the base was too floppy and the base collapsed when you would pick up a slice. Not a great experience unfortunately"
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKMU0wSkZjM0IxWW1wbk1WZFVVRkZNZFdoRlpIYxAB",
            "text": "Ambiente piacevole ed abbiamo mangiato una vera pizza napoletana, tifando Napoli. Complimenti"
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaaGNsaFRORkZPYTJsc1JVWjRXVkE1V2pKU1RWRRAB",
            "text": "Ho avuto un’esperienza fantastica da Song’E Napule a NYC! La pizza Margherita era semplicemente perfetta: crosta leggera e croccante, pomodoro San Marzano saporito e mozzarella freschissima, un vero assaggio di Napoli. La pasta e patate era cremosa e confortante, un piatto tradizionale eseguito alla perfezione. Le fettuccine alla bolognese, con il loro ragù ricco e saporito, erano altrettanto deliziose. L’atmosfera vivace e l’accoglienza calorosa del personale hanno reso la serata ancora più speciale. Un angolo di Italia autentica nel cuore di New York, assolutamente da provare"
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSaVoyTnRaMEkyTTBKVmJTMUtObVJsU0VRMFlXYxAB",
            "text": "Paccheri alla genovese speciali!! Complimenti!"
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMlRXWTVMVTlZYlZnd2MxOWFaVTFRYUhJM2EwRRAB",
            "text": "Locale caratteristico, richiama la città di Napoli in ogni dettaglio. Ottime materie prime che producono pizze eccezionali! Il personale è disponibile e simpatico!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twZmNFNUxkMmxDUTFSS2JsTnlRVU5QUVdOWE4xRRAB",
            "text": "Best pizza in NY (I have never managed a reservation at Una)"
        },
        {
            "date": "수정일: 1년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqc3MyUzlnRRAB",
            "text": "축구선수 Maradona를 좋아하는 분이신지 인테리어를 Maradona 기념관처럼 해놓았네요\n일단 식전빵과 같이 먹는 olive oil  정말 맛있어요\n판매도 하는데$50\n어쩐지 향이 너무 좋더라구요\nTruffle pizza 와 gnocchi주문했는데 pizza는 맛있었고  gnocchi는 소스가  sour 제 취향은 아니네요\nOriginal Italian style\n이곳은 pizza 맛집인걸로~~\nPizza 는 사이즈가 두가지인데 작은것도 충분합니다\n화덕에서 구워서 정말 맛있고 직원분들 친절하세요"
        },
        {
            "date": "4년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxby1HYUV3EAE",
            "text": "뉴욕에서 이탈리아 피자를 즐길수 곳입니다. 건강한 맛의 피자로 포장과 대기 손님도 많아 예약 필수 입니다."
        },
        {
            "date": "4년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxbzVEZi1RRRAB",
            "text": "예약을 하였으며, 스페셜(추천) 요리 인데, 이탈리안 피자로 뉴욕 맛과 다르며, 기호에 따라 다르나 조이피자 보다 많이 좋았음"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtb2EzdnZnRRAB",
            "text": "피자 존맛탱 파스타 담백해서 계속 생각남…너무 맛있고 친절하다!"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwbk1tTTV3RRAB",
            "text": "작고 소박한 가게. 이탈리아 특유의 시끌벅적. 이탈리아 특유의 흥겨움. 그리고 이탈리아 특유의 피자들. 뉴욕 최고의 나폴리피자라고 해도 손색 없을듯:)"
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNaktEZERnEAE",
            "text": "맛있는데 손님이 많지않네요"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSQ2RHdENPSEpxU21KR1RFTjVTbVV5TVhKaE4wRRAB",
            "text": "One of the best pizzas we’ve ever had — if not the best.\nThe dough had the perfect thickness, and the cheese was absolutely delicious — truly unmatched.\n\nWe tried the Margherita and the truffle pizza. The truffle one was next-level — simply outstanding.\n\nThe service was exceptional. They even offered us complimentary Aperol Spritz, which was a lovely touch.\nThe whole place has a great vibe — it genuinely feels like a little slice of Italy"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRFgwNUxTMUpXVjNwaFdqWldXbHBzUzBaZlFXYxAB",
            "text": "My third time here and always had the same great experience! Thank you Adelaide for your service!. This dinner was so especial for me because it was the first time for my dad in this spot (who is visiting me from Peru) and the first time of my best friend from Germany too and everything was fantastic, the service, the atmosphere, the food! Thank you so much guys!! We’ll come back definitely! 🩷🩷🩷✨✨✨✨✨"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SNGRHaDNiM1IxWWtWcVJGaEdaVlIyWmpkaVVFRRAB",
            "text": "Pizza and homemade pasta were great.  Perfect thin crust.  Waited a few extra minutes for our reservations but service was great and accommodating.  Place was packed and is a little tight and loud but fun atmosphere.  Will definitely add to the rotation!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKaFdXNURVWGxCVUdOeGMwNUlja055YmpKNk1XYxAB",
            "text": "I tried Song’ E Napule in Manhattan, an authentic Neapolitan pizzeria. The pizza was tasty, juicy, and beautifully packed with nice presentation. However, I felt the price was a little on the high side. The sauce had a slightly sour note and the dough was a bit plain, so for me it didn’t reach a perfect 5 out of 5. Overall, I’d give it a solid 4+, though personally I still prefer SIMO’ Pizza for now."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoc05uTmpNSEpwU0hKUGVIZGtWMkZLV21obWExRRAB",
            "text": "This place is AMAZING. Adelaide made the experience 10 times better - she offered an outstanding service!! We were in NYC for 6 nights and went to dinner at Song’ E Napule 3 of them! with so many options around the city, that should tell you how much we liked it. The Diavola pizza is 100% authentic and to die for!!! So are the gnochi (both the tomato and truffle ones), and the insalata de polpo and sciallate alla puttanesca! Their Aperol Spritz is amazing too. YOU MUST ORDER THE COCCOLE😍 we will be coming back next time we are in NYC for sure!!!! My italian boss said this is the same as dining in Napule."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cDRhbGdRRRAB",
            "text": "If you are looking for a real Italian pizza, this is the place to be! I was in New York the other week and since I’m Italian I could not wait to try the pizza at Song’ E Napule. The ingredients used for the pizza were just amazing, fresh, and super tasty. Our waitress was a super kind and energetic Italian woman, and we had the best time in this Italian atmosphere!! Highly recommended :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WT2NGZFlaVTlrY1RSdFFYVjJXbmh1VWxWc1RsRRAB",
            "text": "The pizza quality is simply superb.  This place never disappoints.   I would easily place SEN pizza as one for the top 5 pizzas in all of NY.  Tiny place and very popular!"
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMElEV1FREAE",
            "text": "En visite à New York depuis Montréal, j’ai eu la chance de partager un pur bonheur durant mon séjour en faisant un détour au Song e Napoli (Houston St)\nUn petit goût d’Italie ! Heu non pardon.\nUn petit goût de Napoli !!!\nTout y est ! D’exceptionnels pizza, une ambiance chaleureuse, l’exagération assumée de l’esprit napolitain.\nJ’en redemande et je recommande !\nA bientôt les « guaglion’ »\n(Forza Napoli Sempre)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxcU1FeGxaWEJFVWt0SmNXZG1SVnBRUkRJeFdsRRAB",
            "text": "Had dinner at Song' E Napule in SoHo with Italian friends who confirmed—this is as authentic as it gets. The pizza was incredible, with perfect crust and fresh ingredients. Warm atmosphere, friendly staff, and true Italian vibes. A must-visit for an authentic experience!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbExQckRREAE",
            "text": "Super tasty and one of the best authentic Italian pizza’s I’ve had in NYC. Everything was excellent: drinks, pizza, and tiramisu (flavors were well-balanced, fresh, and not overpowering). Our servers were very friendly and we had the best time here. Felt so good to hear Italian being spoken lol. Highly recommended to all !!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvZzQyYXpRRRAB",
            "text": "Wow. I’m a food blogger in NYC who tries food from all over. This place tastes like Europe. Authentic Italian food and people. Walked into the restaurant and was greeted instantly in Italian. Watched as more and more friends and guest entered the building greeted with a kiss on both cheeks. I ordered the Mozzarella Truffle Pasta and don’t regret it one bit. The server delivered my dish with a cube of mozzarella for me to shred. I could tats the fresh mint and seasonings every bit I took. I didn’t want it to end. I will most definitely be coming back with friends."
        },
        {
            "date": "10달 전",
            "language": "it",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2Zy1PYjhRRRAB",
            "text": "Buon ristorante tipico napoletano.\n\nLa pasta con le polpette buone ma niente di meraviglioso.\nLa pizza aveva un ottimo impasto ma la bufala è il pomodoro erano meno buone di quanto mi aspettassi da un ristorante napoletano. Il prosciutto cotto della pizza invece era proprio scarso, tagliato abbastanza grosso ha un po’ rovinato l’effetto.\n\nTiramisù offerto dalla casa davvero buono, equilibrato nei gusti e leggero, complimenti.\n\nServizio molto caotico anche se comunque veloce ed efficiente.\n\nAmbiente estremamente caotico, tipico di una trattoria napoletana e quindi originale e in linea con l’idea del ristorante. Non adatto per chi cerca una cena tranquilla.\n\nPrezzi in linea con la zona ma sinceramente con 26$ ci sono pizze migliori a NYC.\n\nConsigliato."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNZlQ1LTdNOGRfcWJREAE",
            "text": "This place is no less authentic than some of the finest pizzerias I tried in Italy. It is a place where authenticity is savored in every bite.\n\nI started with the Fettuccini Nere con Gamberi, a perfectly al dente squid-ink pasta. I loved how rich and briny the squid-ink sauce was, yet it was beautifully balanced by the tangy sweetness of fresh tomatoes. The dish was pure comfort and sophistication.\n\nThen came the Salsicce e Funghi pizza. The pie was thin, airy, wet, and came in flawlessly charred edges. Every slice was bursting with flavor, thanks to its San Marzano tomato sauce and creamy mozzarella from Agerola. I love how balanced this dish was, light enough not to overwhelm yet deeply satisfying.\n\nOverall, I absolutely love their real-deal Neapolitan pizza and pasta. Hard to find a place nowadays that hits all the right notes!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQLXFpSlNRNXREVFh3EAE",
            "text": "I love to come here with my family!\nPizza is the real deal here, the ambiance is great and bright!\nThe service is quick and attentive.\nMy daughter gets a free desert every time:)\nI love that the waiters here speak Italiano like me, feels like home!"
        },
        {
            "date": "11달 전",
            "language": "it",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQeVlQS1R3EAE",
            "text": "Abbiamo cercato su google e la miglior recensita è stata la pizzeria di Ciro Iovine Song e Napule. Il locale si trova in un bellissimo quartiere che è Soho. Non proprio vicino alla metro se ci arrivi da Manhattan ma fattibile poi a piedi. Da fuori non lo diresti peró entrati dentro è veramente bello, caratteristico, sembra una di quelle antiche pizzerie di quartiere tra i “vasci” di Napoli. Bella l’atmosfera, accogliente, calda e soprattutto fatta di persone tra gestori e camerieri (Francesco, Adelaide) che ti fanno sentire subito a casa. C’è musica italiana ma soprattutto NAPOLETANA con i classici Gigi ma anche Luchè ecc. Veniamo al cibo: la pizza nel complesso è buona. Quello che ci è piaciuto di più è l’impasto, mentre pomodoro e mozzarella erano buoni ma volendo fare un appunto peccavano di sapiditá. Ad ogni modo una pizza ottima considerando il tutto. Il prezzo è sicuramente alto (72dollari: 2 bufaline, 1 acqua, 1 coca zero, tasse e mance) ma nella media Newyorkese. Vale la pena andarci? Se vuoi gustare una pizza contemporanea napoletana ma soprattutto viverne l’atmosfera che tu sia americano o italiano, assolutamente si!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPYTN6djNfeVozUVB3EAE",
            "text": "Authentic and very delicious italian pizza. Atmosphere is cute but very loud. Some staff was italian what made it ever more authentic :) Reservation recommended.\nBYOB is possible but costs $40 per bottle."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMElULWhRRRAB",
            "text": "Loveee it! Takes you straight to south Italy! Small place with a huge Italian vibe! Pizza is amazing, pasta as well. The guys working there friendly and fun! Definitely a must visit"
        },
        {
            "date": "3달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kMlltOXhjVXRYUVVFME5uRjRlbFF5T0VGVFprRRAB",
            "text": "La descrizione perfetta, sentirsi a casa.\nNew York è meravigliosa e questo è un dato di fatto, e voi siete la ciliegina sulla torta.\nIl cibo è superlativo, piatti tipici napoletani e italiani cucinati come li fa la nonna ( e detto da una napoletana è un grandissimo complimento), il servizio ottimo con un personale gentile e attento. Adelaide in modo particolare, un animo buono e puro, con un sorriso ti accoglie alla porta e per tutta la durata della cena ti resta “accanto”, con consigli e dritte che fanno sempre bene.\nSiete stati insomma una grande e piacevole sorpresa che consiglierò a tutti."
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREck1yaFVREAE",
            "text": "Visitato a Gennaio 2024, questo locale è la prova che a New York si può mangiare la vera pizza napoletana a prezzi assolutamente accettabili. Posso dire con assoluta certezza che a Napoli e provincia ho mangiato pizze di gran lunga peggiori, quindi devo fare i complimenti a questi ragazzi per l'impegno e la professionalità. La salsiccia e friarielli mi ha veramente meravigliato in positivo, per qualità degli ingredienti e cottura, un capolavoro!! Il plus è la bottiglia di olio evo del frantoio Muraglia disponibile ad ogni tavolo, e per chi conosce quel prodotto sa cosa vuol dire in termini di costo, oltre alla sua aromaticità che arricchisce ogni pietanza. Eccellente anche il caffè, un vero espresso napoletano. Ho capito perché questa pizzeria ha vinto la puntata di little big Italy...Complimenti davvero!!"
        },
        {
            "date": "4달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTFVIRmtZVkJzUnpGS2RrZFdUSE40ZGpkMFJXYxAB",
            "text": "Geniale Pizza! Für alle, die die neapolitanische Variante lieben ein absolutes Muss! Geschmacklich ein Traum, preislich echt ok (für NY), Ambiente cool (für SSC Napoli Fans ganz besonders) und Team super! Nur mit einem freien Platz kann es zu Stoßzeiten eng werden. Warten lohnt aber!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGelMyWmZSSGd4VTJwelVYbFNZazVxWDNWa2MyYxAB",
            "text": "Only deserving places get me to take the time to write a review. We went out to dinner for pizza, and it exceeded are already high expectations. The pizza dough is soft and the cheese and sauce are well chosen and delicious. The service was extremely nice and friendly, as was the lively atmosphere and the well done interior. A must go place if you’re in the mood for some exceptional pizza. If it’s your birthday, and tell them, you are in for a special treat. A bit expensive but for good reason!"
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJM1gwbERSbkJ2YjI4M1NsTTRUbFpoTFZVNFVsRRAB",
            "text": "Sono rimasto molto sorpreso dalla qualità dei prodotti\nComplimenti continuate così e ricordate che c'è sempre qualcosa da migliorare"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIaGV2THdBRRAB",
            "text": "Neapolitan Pizza in Soho, Manhattan, offers a delightful dining experience with its charming outdoor seating and delicious fare. The pizza, with its perfect balance of a thin, crispy crust and fresh, flavorful toppings, truly captures the essence of traditional Neapolitan style. A standout dish is the calamari—lightly fried to a golden crisp and served with a zesty dipping sauce, it’s an ideal appetizer to start your meal. The outdoor seating area is a great spot to enjoy your meal while soaking up the vibrant Soho atmosphere. Whether you’re a pizza aficionado or just looking for a pleasant dining experience, Neapolitan Pizza is worth a visit."
        },
        {
            "date": "7달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3d05YVVVREAE",
            "text": "Song’ e Napule è un vero angolo di Napoli nel cuore di New York, un’esperienza autentica che trasporta direttamente nei vicoli partenopei. La pizza è semplicemente spaziale: impasto leggero, ingredienti di altissima qualità e una cottura perfetta rendendola digeribile per tutti. Anche i piatti di pasta sono eccellenti, preparati secondo la tradizione con sapori genuini e porzioni generose. L’atmosfera è calorosa e conviviale, grazie a un personale simpaticissimo che parla italiano e accoglie i clienti con il tipico calore napoletano. Se cercate la vera pizza napoletana a New York, Song’ e Napule è una tappa obbligata!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtLTQ2UDZ3RRAB",
            "text": "Small restaurant, but great vibes!\n\nVery authentic Italian food! Especially the pizza - fabulous! The dough is light and ingredients fresh. You wouldn’t feel too full after having a whole pie by yourself.\n\nThe pasta was very good too - you just can’t go wrong when your have such good quality ingredients.\n\nThe house was so nice to treat us an extra dessert! What a great way to end a dinner!\n\nSuper recommended!"
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMb3M2Z0FnEAE",
            "text": "Pizza buonissima, in vero stile napoletano. Quello che non mi è piaciuto è stato il conto: mi è stato addebitato il 20% di servizio (ben 15 dollari) mentre non era stato specificato nel menù che il servizio era a parte. Negli altri locali ho sempre trovato il servizio incluso (con specifica precisa nella ricevuta). Inoltre, come se non bastasse, il cameriere ha pensato bene di tenersi circa 6 dollari di mancia dal conto pagato, pur avendo atteso invano il resto al tavolo per almeno 5/6 minuti. Il locale non era affollato, e il cameriere mi guardava di sottecchi. Me ne sono andato per educazione, i 6 dollari non mi fanno certo la differenza.\nPerò non fa bene ad un italiano come me sapere che nel mondo alcuni esportano la nostra cultura in questo modo, in cui non mi riconosco. Se il cameriere ha una dignità, per favore consegni i 6 dollari (e magari i 15 di servizio) al primo senzatetto o povero che incontra. Grazie\nComunque complimenti per la pizza."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNktERUd3EAE",
            "text": "❤️ Overview:\nMy friend and I came here for dinner Thursday night and we had a great experience! The servers were great as well. We made a reservation which I’m glad because it got super busy while we were there so I would recommend making one if you can!\n\nOverall, the food was really good. I really like\nThe burrata appetizer and the diavola pizza! I would go back for both of those! I love burrata and the prosciutto. The spaghetti and clams were fine. I liked the flavor of the claims but it wasn’t anything amazing. The only thing I didn’t really like was the eggplant parm appetizer. And I LOVE eggplant parm so I know I can be very picky about it. The flavor was eh, and I know eggplant parm is very saucey but it was just like mush.\n\nOverall, we had a great experience and I would definitely go bad so I can try other pizzas and pastas!\n\n❤️What was ordered:\nFOOD: Burrata, parmigiana de melanzane, spaghetti and clams, diavola pizza, and tiramisu\n\nDRINK: peroni and glass of sparking rose\n\n❤️Stand outs:\nBurrata appetizer and the diavola pizza\n\n❤️Would I come back/recommend:\nYes - I would come back\nYes - I would recommend"
        }
    ],
    "reviews_count": 83
}