{
    "name": "Steam",
    "place_id": "ChIJJYRLYrtZwokRuRmuvnMPaYE",
    "grid": "MN2",
    "address": "470 6th Ave, New York, NY 10011, USA",
    "rating": 4.6,
    "user_ratings_total": 459,
    "phone_number": "(917) 262-0565",
    "reviews": [
        {
            "date": "4일 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxdFUxWkJSR2x0WlRsaVREbFpUM05TTjE5aE9WRRAB",
            "text": "Prodotti molto buoni e ambiente, molto etnico"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0TE5WQXhWa1pJWWpCRlp6Rm5SMGREZUdReFQzYxAB",
            "text": "Good restaurant, not incredible. It’s an easy choice, probably won’t be the best you’ve had but it’s also a relatively safe choice for decent dim sum. We tried chicken dumplings, the siumai, pork soup dumplings… and a couple of main courses that we all shared. All were good, without being mind blowing. Service is a little rough, which is usually the case in the Chinese restaurants I’ve been to but overall good experience. I wouldn’t go out of my way to go there but would enjoy a meal there if I am around."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWZmNWSkNlRFYxYUU1MGRHWkpWMUJYTmpCamJXYxAB",
            "text": "Their restaurant looks as good as their food tastes. Our orders took time reaching us and drink service was equally unhurried. Their cooking techniques produce remarkable results. Steam has my complete confidence. Every detail was handled properly."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1bFRGWlJWekZmWXpkclEwUnpSMGxuYld4QlkwRRAB",
            "text": "Happy to chance on this for a post lunch snack. The snow pea dumpling was generously filled with shrimp and tasted spot on. The scallion noodle was fragrant and nicely balanced. Clean and good service. Reasonable prices. Nice waiting area for takeout patrons. Will definitely return to try their other dishes."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GWmVERlVhM1EwWHkxamMzUllRVEEyVVhSMFJIYxAB",
            "text": "I love this place! I go very often with my friends and we've never had a bad moment there! Food is always great and most times I look forward to the weekend because 9 times out of 10 me and my friends look for an excuse to come back. Cannot wait to go back soon!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdFRVcFZVMEUzVUZReU1VMVpRVWQ1TlRKV05tYxAB",
            "text": "Hands down BEST pork soup dumplings in Manhattan. The dumpling skin is so thin you could see the juicy soup broth glisten from the inside out. Flavor is 5/5. I'm very picky with food and this place gets 5 stars for both Dumpling Execution and Flavor."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OeWNXcEthbFZhZVU5eFVFMU9VV1ZEVUVWc2NrRRAB",
            "text": "Tasty food and dumplings!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wNGIyeFFNMEo1WkdZMFRtTnFkRlpZTmxvd1ZYYxAB",
            "text": "Food was very good and staff was nice and receptive but they don't bring out everything at the same time so you may get yours after everyone has had their first dish. The place is nice and clean but you are packed in very closely next to others and there is not a lot of extra room for bags or a jacket etc. They're is a selection of basic beverage but not a lot."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KallrRkNVVzR3WW1aNlNrSlRlVms1UzE5dFVuYxAB",
            "text": "Delicious dumplings and great variety, I wish we could try more :-)"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWGIzUm9WbUZOUm04dFEwcDJZVlpCVkZselQzYxAB",
            "text": "Very good soup dumplings hot and delicious and good fast service from the staff.. Definitely good value 👌"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdVJtVktha3RqVEV0T2JEaG1YelpyWW1GdFJVRRAB",
            "text": "Steam is such a great spot! The food is fresh, flavorful, and beautifully presented — every dish tastes homemade and full of care. The dumplings and noodles were amazing, and the service was fast and friendly. The restaurant has a clean, modern vibe that’s still super comfortable. Perfect for a casual meal or dinner with friends — I’ll definitely be coming back! 🥢✨"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0eExWSkdZbkZGVVc5UFQwdDFaR053V1hOVVkwRRAB",
            "text": "The restaurant displayed obvious talent. Their commitment to good ingredients shows. This place creates a comfortable mood. The level of customer care was exceptional. This restaurant earns its high marks."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkd2JpMVNTRlZLYUZvelJrVjRjRzlDTmxkeE0wRRAB",
            "text": "Perfect dinner. Everything was amazing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMlZIWXlUa1UzTURCWVNHRkxTekZRY0VOcldWRRAB",
            "text": "This place was awesome! Food was great for the price!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkYVZ6QjBRWFpuWm5CNldXRXlSSEkwY1hkdlEwRRAB",
            "text": "I stopped in for a quick bite and ordered the shrimp & pork shumai and the green onion pancake. The shumai were okay, but the green onion pancake was deep fried instead of pan fried and very oily. Poor value for the price."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRdFdrOTFjV1p4VUdoM1owOVFRVk0wV1dWQlMwRRAB",
            "text": "Tried aromatic beef wrapped in scallion pancake (SO SAVORY AND DELISH). Also tried soup dumplings for the first time (crab meat and pork , such an exciting bite. Will certainly be back!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjd1VIUm5UMVo1VlRoblRqbDBUM0J0ZFU1RVEzYxAB",
            "text": "Food amazing! Everything so hot and tasty. Service unmatched!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KWlNUVllhWHBqVkdkNVp6bHJTVU41WVZBME5WRRAB",
            "text": "Quick and easy place to get dim sum. There are a variety of options. The matcha strawberry was amazing!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKRFQybE1WVTQ0Y1dKQ2NYQlhaazFPZEZsSGJYYxAB",
            "text": "amazing, authentic chinese dishes at an affordable price! the staff are very friendly and kind, and the space is welcoming and warm. can get quite loud during dinners at peak hours though.\nmy favorite dish is the crab meat & pork xiaolongbao, the soup that comes out of the dumpling at first bite is heavenly and piping hot (a little too much, even. be careful and let it cool down on the table for a bit before eating).\noverall, 10/10 place to go to when i miss chinese food!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdFlsQmlUbEZHVlVWMGFXUXdXbDlKY21WUllVRRAB",
            "text": "Had lunch here with my wife. The shrimps and pepper steak were really nice. Good quality for the price. Definitely recommended."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkQlRHWjFTR3RETldveWIyTkpNbWhuVWpBeFRuYxAB",
            "text": "Cute little chinese restaurant. Big menu and they do lunch specials! Loved their scallion pancake and eggplant salad and bon bon chicken too"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSGJrUTBUWEJPUnpobk5YTkpWVEZ3YjJ4T2JWRRAB",
            "text": "Incredible experience! The food was great, well presented, and the place is well maintained with good ambiance. I think I was one of the only Asians in the packed restaurant, considering that it is very traditional Asian food! And they…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUFFrdzVTbkpmZG1ORk9WRnJURkJrU1V4YU1tYxAB",
            "text": "Both what you eat and how you're treated exceed expectations. Steam maintains a small, immaculate and warm atmosphere. The complete staff is courteous and kind. The restaurant's commitment shows in food taste and staff attention. Delicious meals and exceptionally friendly service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OdVZYVnhla2hMYjBSc2RsTlZkRkIyUnkxc1NHYxAB",
            "text": "This is an amazing restaurant! We came to New York this time to watch an animal-themed movie that was only showing at the theater next door. Before the movie started, we stopped by this place and ordered some food, but didn’t have time to eat it, so we had it packed to go. I know this might have been a bit impolite, but the staff were very happy to help. In the end, the food was all delicious! I feel sorry about that, but this place is truly wonderful and I recommend everyone give it a try — the black gold custard buns were especially good! (We left in such a hurry that I couldn’t take photos, but they would have looked amazing!)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xobVkzaHZkMk5KUlRJMlNVeEtVMUpWUW5wVVFYYxAB",
            "text": "The best in this area !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paMlNuQXdVa052TUc5aVdYSkNORmxIWlVneFkwRRAB",
            "text": "This was our first time at Steam, and what a gem! We actually came here after a really degrading and disappointing experience with the hosts at Roey’s nearby. I'm so glad we found Steam instead!\nFrom the moment we walked in, we were greeted with warmth and genuine kindness from every staff member. The atmosphere was welcoming, calm, and respectful — everything we had hoped for. Our server, Ming, was incredibly patient and sweet, helping us with questions about the menu and offering great recommendations. Two other gentlemen also waited on us and stopped by our table throughout the meal to check in and make sure everything was perfect — which it absolutely was.We ordered a variety of dim sum and appetizers:\nShrimp & pork shumai\nLeek & shrimp shumai\nChicken combo soup dumplings\nSzechuan dumplings\nScallion pancake wrap with beef\nBlack lava custard buns.\nTo drink, we had the sparkling white peach, iced green lychee tea, and brown sugar tiger boba — all refreshing and delicious. The total was just over $90, and well worth every penny.\nThe food was fresh, flavorful, and beautifully presented. But more than that, the kindness and hospitality made this one of the best dining experiences we’ve had in a long time.\nHighly recommend this place — not just for the amazing food, but for the incredibly kind people who make you feel valued and welcome. We’ll definitely be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KWlVpMXpabWxpZWtOWFMzZFViSEpvVWxsSVFXYxAB",
            "text": "Wonderful food and amazing and fast service!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21neWJWVldOMFpxWDJkMlVIZzRTemROTWtWd1dFRRAB",
            "text": "Had no reservation on a busy Wednesday, but the wait was only about 10 minutes.  Very attentive waitstaff, quick service, and good food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbVNtSXpXalV0WVVSWVNVSmljbUpWT1VaU05IYxAB",
            "text": "The soup dumplings at Steam are very tasty—delicately wrapped, rich in flavor, and served piping hot with a beautiful garnish. The scallion pancake roll with beef was crisp and savory, a perfect complement. Highly recommend for anyone craving high-quality dumplings in NYC."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsRVIzVlRNVmhRUVVoelVrOVlPVkZUYWxNNVNXYxAB",
            "text": "This place is incredible. You cannot go wrong with anything ordered here but the our favorites are the pan fried pork buns and soup dumplings. Service is always great, super clean, and overall highly recommended!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4NU5ERlJVV05UVVZvMVUzWTRibEJhY1dGak1rRRAB",
            "text": "Great General Tso’s chicken (best I’ve found in probably 20 yrs).\n\nPork dumplings were also excellent."
        },
        {
            "date": "3달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205bmRYQjJWREpwWVhGWVRrRnNTRFZvZGsxeVJsRRAB",
            "text": "Un bel endroit  que je voulais visiter depuis quelques temps. Le service est excellent, les serveurs sont attentionnés et la nourriture arrive rapidement. Côté nourriture, c’était bon et frais. Les dumplings sont un must et clairement leur spécialité! On y retourne? Oui, si on est dans le coin."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGQ2RtWTFjbUpLU1MwME5URmtka3BtV1RKQlpHYxAB",
            "text": "The food is amazing!! Would 100% recommend this place every time. If you have a big party please make a reservation. It's actually a small-medium size place"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kbk1UWlVWVnA0TWxvMFQzRllTa2M0WTFWTlpYYxAB",
            "text": "Might have been the best soup dumplings I've ever had. Tofu skin was amazing too."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214bGNIRmtlbXhrYTFCTVpqWTFTMlpvVFRRM1UwRRAB",
            "text": "Came here for their lunch special. The Pepper Steak Special was great along with the Pork Fries Dumplings. The service was a bit rushed, but the host at the time was polite."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPT08xZFBEcXVpbEx3EAE",
            "text": "Very good.  I had the fried pork dumplings and the shrimp/leek dumplings.  The pork was my favorite.  Lovely staff."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNM1V6dkhBc016UXBnRRAB",
            "text": "The food was excellent. Best soup dumplings I've had in a long time, especially compared to Chinese food meccas like Flushing and San Gabriel Valley in LA (Din Tai fung etc). Perfect dough to filling ratio and soup so flavorful and satisfying. Perfect size also. The dough was so fresh and tender yet chewy. The broth was so delicious.\n\nThe cold salads were very tasty, perfect mix of savory sweet and tangy.\n\nThe Dan Dan noodles were delicious also. The noodles were thinner than usual that I've had and therefore soaked up the tasty sauce better.\n\nThe server was friendly and attentive. The prices were very reasonable. The atmosphere is clean and minimalist. It's not fancy but it's clean, calm, and perfect for a peaceful meal without chaos. Will definitely be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMeWc3OVQ3LU56ZE5REAE",
            "text": "Been coming to steam since they first opened. Whole family loves this place. Somehow the crab dumpling wasn’t up to par last night. Not as much crab filling inside and tasted bland. 6/10 instead of 10/10 all other times. I really hope it’s just an odd day for them………"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLdUlxN3l4bllPX3NBRRAB",
            "text": "Great food and ambiance. Service was excellent"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNblg5NDNHeGZtbHB3RRAB",
            "text": "Watercress with mushrooms made the meal worth it.\nExceptionally nice waiter."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQYl8tc0h2dE5QOVh3EAE",
            "text": "Me, my sister and mom visited yesterday afternoon, we enjoyed our food. We got steamed dumplings, General TSO chicken and Steak and Peppers. The portion of food for the lunch special was good and the soy sauce was delicious. For three meals, 1 appetizer, 3 sodas and 3 seltzer waters, the bill was only $85 (not including tip). We will definitely visit again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNQ1d3ckg2dm92Rkp3EAE",
            "text": "I came in around noon. It wasn't busy, so we got a table right away. I had to get the cran & pork XLB and they did not disappoint. Mind you, I had been to the newly opened DTF in midtown and that place was a disgrace. The dumpling skin is thin, it has ample soup, has visible crab meat and is the right size. The flavor was a bit on the sweet side, my mom says they probably added sugar, which they should change. I would rather it now taste sweet but savory. Their truffle & pork XLB was good also. This had actual bits in the dumpling that you can taste, not colored dumpling skin, where you can't tell what you're eating.\nIf anyone wants good XLB, I recommend Steam or Joe's Shanghai. Steam's is visible more appealing, the skin is thin - like it's supposed to be, where as Joe's XLB skin is thick and flavor is inconsistent."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNRG94TnFkX043dVBREAE",
            "text": "calm vibes and very cozy AMBIENCE, good amount of seating options and attentive waitstaff. The Sparkling peach sake is a must try - So refreshing and fruity!!\n\nThe Wuxi spare pork ribs were SO TENDER, FALLING OFF THE BONE AND THE onion petals were an excellent touch marinating at the bottom of the pot.\n\nYou can never go wrong with the original chicken soup dumplings or try the soup dumplings sampler if you’re feeling adventurous!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNckgyTXpRcFBHTFdBEAE",
            "text": "Hostess was incredibly unwelcoming and rude. She clearly didn’t want us there because we were with our kids. We walked out and won’t be coming back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNbndyTkhveks3SGRnEAE",
            "text": "Delicious food. Excellent service. What more do you want from a neighborhood Chinese joint?"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPUFU1S3pMOUwtZEp3EAE",
            "text": "The scallion pancake with beef amazing no word soup dumpling pork sampler equally delicious. Wasn't disappointed at anything I ordered."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJU3doWXpDM1lPdHpBRRAB",
            "text": "Excelente atención y la limpieza me gusto, también buenos precios no muy altos"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKR01xdEtWcnBULXhnRRAB",
            "text": "I landed in New York with the intention on getting soup dumplings and Steam was a great stop. I think back to this spot often and sad I only got to try it once.\nMake sure you visit!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNeUJrOVRhcG92M1h3EAE",
            "text": "Love the lunch . Good price for great Food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKNzhnX19xcXJfZ1NnEAE",
            "text": "I went to steam for a second time giving it another chance.\nNever again this time I took an order to go what a waste of money $38.00 I threw it all out when I got home. The chicken in both dishes was questionable the chicken skin uncooked the dish was gross no taste as if it was thrown together it was Chicken fried rice & Chicken fried noodles. Upon placing the order the women at the desk was eating I felt like I was interrupting  her placing my order she was rude & nasty I wanted to walk out I should have because the food was a big disappointment and I could not eat it. It went to waste.\nDO NOT Recommend Steam."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcDdDRGdBRRAB",
            "text": "Bland looking from outside but their dishes are absolutely delicious!\nThe “Wined Chicken” aka “Drunken Chicken” is the best I’ve ever tasted in NYC area. The shrimp dumplings are big, juicy and very flavorful. Soup dumplings are also very good.\nI will be back for more. 👍"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NTdMNXNRRRAB",
            "text": "Last week I had lunch at Steam. While exploring Sixth Avenue I saw this Chinese restaurant and went in. The menu had many choices and I ordered pork soup dumplings and cold noodles with sesame sauce. The noodles came first and with the first bite tasted unusual. I had two more bites and left it as it was unappetizing. The wrappers of the soup dumplings were thick but I ate all as I was hungry and now had only one dish to satiate my hunger. The server asked me why I had left the noodles and I told her that the same dish at Hwa Yuan Szechuan was superb. The restaurant had many customers mostly Caucasian and some Asian. This should have been a red signal but I was famished and walked in. An elderly lady sat down next to me and before the menu was given she asked for the Lo Mein lunch special. This too was a sign. As I was leaving, the lady at the front desk told me that before the pandemic they had two restaurants in Chinatown and now they have only this one which is six years old. There is a restroom here and the interior is decorated in a pleasant manner. $22 out of the window for an unappetizing lunch. I will not be making a second visit."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMWNfeUdBEAE",
            "text": "We come to this restaurant whenever we visit New York. On this visit, the two of us ordered a chicken stir-fried soft noodle dish and the salted egg-yolk combination shrimp & squid dish. Both dishes were delicious. Prices are reasonable for NY.\nIf you are looking for authentic Chinese/ Cantonese food, I would recommend this restaurant.\n\nThe service is always quick and efficient, and the toilet is very clean!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcDdqMGhRRRAB",
            "text": "I dined at Steam today and had a great experience. The food was authentic and really flavorful. Everyone in the reviews mentioned how amazing their soups were, and they were right – the soup was fantastic. The atmosphere was pleasant, and the service was attentive. I spent $50 for appetizer, a main course, dessert, and a glass of wine, which I found to be quite reasonable. I’d definitely recommend Steam for anyone looking for Chinese food. Five stars!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYdFlIS01nEAE",
            "text": "We had a great visit!!! First - everyone at the restaurant was very friendly and welcoming, helped us to decide what to order. Everything was tasty- we took the snow peas shrimp dumplings, small won ton soup (arrived with lots of dumplings!), mix soap dumplings and a pan-fried noodles with vegetables and added tofu as well - 10/10!!! We definitely will come back again :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbU9ta1V3EAE",
            "text": "I got the beef noodle soup, soup dumpling, and beef scallion pancakes. All of which were good but special shout out to the beef in the noodle soup. You could split the meat with your chopsticks. The soup dumplings were great as well. Plenty of soup, the skin was slightly translucent and the pork was great. The price was also reasonable. 10% if you pay with cash"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0NEkzOGx3RRAB",
            "text": "We craved dumplings so this was a random place we picked. It had good reviews and they were right. The pork dumplings were really good. Shredded beef scallion pancakes were new to us and we liked them. The spring rolls and chicken fried rice were not the best choices"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyblBQQkhBEAE",
            "text": "I've been here multiple times over the course of half of a year and the food and service have been consistently spectacular. Hands down my fav dim sum place in the city. I really love how their Truffle or Ginseng soup dumplings burst with the flavor. They're not shy of adding the expensive ingredients (I previously had their truffle egg too) and the taste really justifies this. 100/10 recommended 👌"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwd2ZtN3RBRRAB",
            "text": "Food was ok - felt very Americanized.\n\nPork soup dumplings were good, the skin was thin and it was juicy.\n\nThe pan fried buns were basically all dough and it wasn’t crispy nor crunchy.\n\nBeef dumplings (“Holy Cow”) was pretty good.\n\nZhajiangmian was made with udon, not authentic at all but the sauce was decent.\n\nThe crispy whole fish was kinda interesting and so was the egg yolk shrimp and squid."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkNHI3dktBEAE",
            "text": "I went in with friends to Steam for lunch and we were all extremely happy with our choice!  I found the service to be fast and efficient.  The wait staffs were friendly and helpful.  We ordered the following:\n- White Truffle & Chicken Steamed Soup Dumpling\n- Crab Meat & Pork Steamed Soup Dumpling\n- Shrimp & Pork Siu Mai\n- Shrimp Dumpling\n- Beef wrapped in Scallion Pancake\n- Chilly Tofu\n- Combo platter with spicy tofu skin, braised bamboo shoots and jellyfish salad\n- Hot & Sour Soup\n- Scallion Oil Noodles\n- Lava Sesame Balls\nEverything was very flavorful without being overly strong.  The shrimp dumplings were done very well and had great texture, siu mai was fresh, lava sesame balls was a treat (great way to end the meal with this dessert!).  I love the chilly tofu!  It was simple and very flavorful.  Everything was delicious!  It’s hard to find quality and tasteful dim sum (I live in Flushing and have had my share of Asian foods) and was surprised to find this hidden gem in the area.  My friends and I were all very please and can't wait to go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaOF9mdmdBRRAB",
            "text": "New ownership, a new menu, excellent service and renovated premises. Delicious Chinese Food! We tried several dishes. They all tasted good! Especially, noteworthy was brown sugar rice cake, the best I have had ever!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1dGZiM0NBEAE",
            "text": "Super thin dumpling skin and the juice filling, the soup dumplings are the best so far among all the soup dumplings I’ve had in NYC.\nBeside the signature soup dumplings, we also ordered Scallion Pancake, Aromatic…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMGRtSG5nRRAB",
            "text": "A little heavy on the palate but good flavors. Chickrn corn soup didnt look like much but the flavors are good. Lunch special is always a good deal at any place, we got general tso chicken w the pan fried dumplings. Chicken had actually spicy sauce. Broccoli crunch was nice nd yes.\n\nWe also ordered dan dan noodles, I wasn’t crazy about it but loved the cilantro in it. Noodle texture were just ok but the sauce was too watery nd not coating enough.\n\nThe soup dumpling filling were very mushy nd just ok, soup was also just ok inside. 2/5."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaNmUyQ2ZREAE",
            "text": "Like this cute Chinese restaurant. Quite dope.\n\nWe were in a rush. The waiter was able to get us the dishes in a short time👍The pork soup dumping and pan fried pork bun are pretty good. But the watercress with enoki mushroom dish can be treated more to remove the bitterness…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKNmI3bWxnRRAB",
            "text": "I've visited this place on four occasions and everything I tried was delicious.  From appetizers to desserts, everything exceeded our expectations.  Restaurant is super clean, the ingredients are made fresh, the presentation is wonderful and the flavors just blew us away.   The staff was wonderful and welcoming.  My experience on multiple occasions were nothing short of excellent.  We highly recommend this restaurant and definitely will be making Steam a regular go to place.  Here are pictures of some of the dishes for our recent visit."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPc2NtV093EAE",
            "text": "Best Shanghainese food I’ve had in a long time. We ordered the Soup Dumpling Sampler and the black truffle flavor is exquisite. The Shanghai Lo Mein hit the spot, and the rice cakes were the perfect consistency. Our waiter David was fun to chat with and very attentive!\n\n10/10 recommended ✨"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwOTlfblhBEAE",
            "text": "Everything was delicious.\n\nScallion Pancake- Light, crispy, and very enjoyable.\n\nGeneral Tso's Chicken- The sauce was so flavorful. It was the perfect balance between sweet and savory.\n\nShanghai Style Lo Mein- Tasty thicker noodles. I love the vegetables in this dish.\n\nI would recommend this place to anyone who wants better quality Chinese food than from fast food places."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwb3B5eXFBRRAB",
            "text": "Came here with my wife for lunch. Upon walking in, I was immediately impressed with how clean the place is. We were seated by our courteous waitress. What preceeded was a dining experience that left us saying \"wow\" with almost every bite. Our usual excursions for Chinese food were to Chinatown but I've been feeling like the quality of food is degrading as the price goes up for our favorite places. This place did not disappoint. Steam is great!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNweDdMR1J3EAE",
            "text": "When I think of authentic Chinese food with some good dim sum, I think go to Chinatown first, but now with Steam, I will come to Steam instead.\n\nExtremely clean comparing to Chinatown, and smells clean too.\n\nQuick and attentive service.\n\nAmazing dim sum, specially the soup dumplings.\n\nMany Cantonese or Shanghainese, classics.\n\nWill be back for sure."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPc2J2dWxRRRAB",
            "text": "Both the food and ambiance were amazing. Amazing scallion pancakes and soup dumplings (devoured too quickly to have pics taken). Other dishes were amazing too. Staff were also kind and attentive!\n\nKudos to whoever decorated and designed the interior as even the bathrooms were beautiful."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwOWRuWjRBRRAB",
            "text": "Lovely early lunch. The dishes we ordered were well prepared and tasted authentic. Our fav dish was the beef in scallions pancake as well the watercress prawn dumplings.\nWe ll def revisit to try more from the menu.\nNice clean restrooms as well the restaurant is neat."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqb3FTdDRnRRAB",
            "text": "We decided to pop in here for a quick dinner after work and we were pleasantly surprised at the quality of the meal and service. When we arrived we were seated immediately (didn’t need a reservation) and given menus to look over. They’ve got an extensive option but after careful consideration we went with the scallion pancakes, vegetable lo mein, and chicken soup dumplings. A good amount of food for two people. They also brought out the food faster than expected which was appreciated. Ambiance is relaxing and inviting with warm hues and comfortable seating. Come here with friends or family for a guaranteed good meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdlpyM2RBEAE",
            "text": "Steam is a Chinese dim sum place with great dumplings I love sizchuane dumpling with pork and shrimp I don’t like pork though that pork was great and normal pork dumpling with a great general tso chicken great"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCZ0thT1F3EAE",
            "text": "Food is decent for the area.   If this one were in Flushing, it would be below average.   I did my usual scallion pan cake test, soaked in reused oil and overly deep fried.   I can tell the restaurant is making an effort when preparing the dishes.  The noodle was a bright spot in this otherwise average Shanghainese restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3aEl5aUJ3EAE",
            "text": "My first time here and I'm already planning a return visit. The interior was meh - pretty sterile and uninteresting and the service okay - but the food, for the most part, was fabulous. Best salt-and-pepper fried squid I've ever had (and I've been eating it for decades), delicious scallion pancake, great assortment of different soup dumplings, all yummy, creamy brown sugar boba tea, and my vegetarian friend's General Tso's Tofu, which I've never seen on a menu before, rocked. The one item that fell flat was the cold sesame noodles, a fairly bland dish that didn't taste very nutty, which was saved by the addition of a ton of black vinegar, but that wasn't the taste I ordered it for. If they could tweak that I'd give them five stars. But I've already told other friends about it so they can enjoy it, and like I said, I'm going back soon myself to try a bunch of other stuff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcnYzYUdnEAE",
            "text": "Great dumplings with good thinness is skin, enough soup and meat ratio. The crab/pork soup dumplings is made with imitation crab and it isn't my favorite. But the truffles and the classic pork is definitely a must try\n\nThe crispy soup pork buns are good but the version I got could have used an extra 2 minutes of cooking to get a crispier bottom. I prefer a very crispier bottom.\n\nThe Dan Dan noodles are well executed and well balanced.\n\nThe szechuan wontons are delicious but I think it could have been a tad bit spicier with perhaps a bit more chili hot oil.\n\nOtherwise, everything was well done and no complaints. Definitely a repeat and a reminder of Shanghai .  If you can forgive the crab dumplings, you will  enjoy all the other dishes ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4MFBIUzlRRRAB",
            "text": "Very excited about this place and looking forward to trying everything on the menu!! I ordered the soup dumpling tasting and all are fantastic! I also ordered the veggie lo mien which was delicious, the noodles were cooked perfectly. The dry sake was also a great recommendation, cheers!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1a1BMY1p3EAE",
            "text": "Every dish at @steam_nyc was really good and the people there were super friendly! Chinese food in the US is usually too salty, oily, or heavily seasoned, but none of those was the case here! It almost felt like eating in Asia. My favorite was definitely the wuxi ribs - super tender and well seasoned. Xiaolongbao was pretty good too! Would definitely recommend coming in groups to try their food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1aU5IOWZnEAE",
            "text": "Ok so this is without a doubt the best Chinese food I’ve had in NY. And by far. Everything was so delicious tasting, so fresh, so nicely presented, and run by the friendliest people. I really really can’t fault this restaurant. The pancakes, cold noodles, and truffle and pork soup dumplings were just perfect! The Tsao’s Chicken is probably pass only because it was 8.5/10 and everything else we had was 9.5+/10.\n\nPlease go. That is all."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabk1qSFVnEAE",
            "text": "one of the best taiwanese style beef noodle soups i’ve ever had! broth was very rich (similar to an au jus) and had the most tender chunks of beef. this place has the best pork soup dumplings i’ve had in the city too — not too oily in the middle (as they usually are) and the skin wasn’t too thick or too thin"
        }
    ],
    "reviews_count": 80
}