{
    "name": "Cipriani Downtown",
    "place_id": "ChIJ71HLcIxZwokRXymDgawloWI",
    "grid": "MN2",
    "address": "376 W Broadway, New York, NY 10012, USA",
    "rating": 4.1,
    "user_ratings_total": 1397,
    "phone_number": "(212) 343-0999",
    "reviews": [
        {
            "date": "22시간 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SWWFVRkJUMkZGYURsVWNYWnRPSFJ6Y1dwVFIxRRAB",
            "text": "👎🏻 poor guest reception; the guy that was supervising the bar area/ entrance of the restaurant who acted as the hostess, was abrupt and rude. We waited 30 minutes for a table with reservations.\nFood was just ok 2.5 out 5\nOverrated restaurant! Won’t go back."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxYVFqbFVOVFpmYkhreFlqTTJWMnh5Y0dKQ2NIYxAB",
            "text": "The place was really crowded and we had to wait though we had a right reservation. It is really noisy spot to chat with old fellows, but if you are for the first time I would recommend you to be ready for such atmosphere. Again may be because of the crowdness we had to wait for our meals either. We ordered several types of pasta and I would rate them 7 out of 10. For a dessert we tried their bestseller but I wouldn't say it was incredible."
        },
        {
            "date": "1주 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WU2RYTkxRVFZrUkhGSlZuZEJka1JuYjBFMk0wRRAB",
            "text": "Muito bom!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTU1WcEtVM0Z3ZERSa1EyZHdOamRHVEU5TGFtYxAB",
            "text": "In a city that devours its own enthusiasms weekly, Cipriani Downtown on West Broadway is a reliable pleasure—white tablecloths, perfect light, the whipped cod. This is excellence that refuses to apologize for knowing what it is.\nAnd there is Fabio.\nHe moves through the room with that rare alchemy of warmth and discretion, remembering not just names but the small human details that transform service into recognition. He anticipates without hovering. This is craft.\nThe pasta arrives as it should. The vegetables treated with respect. Nothing revolutionary—something harder: consistency as art.\nIn Manhattan’s relentless churn, here is sanctuary. Here is the permission to return, to be known, to find the same grace waiting.\nNot nostalgia. The present, done properly.​​​​​​​​​​​​​​​​"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5aU9HVlRNVTlpTWpkaVVXRmlhVnBUUlRnelQwRRAB",
            "text": "Place was empty on Monday night and they didn't make the slightest try to get tables for people waiting, also waiters are very rude. Skip it in NY go somewere else or go to Italy and eat real Italian food"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toalJrZGxWekpSY0dFNGRuSktWVXBaYWxaVUxYYxAB",
            "text": "Lo mejor de New York para sentir la tradición italiana pura. Buen servicio. Rápido"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMeklpMmRnEAE",
            "text": "Best service in town"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xadGJVSXdWVjlCWjBSMGJEazBiakJLWjNoemRrRRAB",
            "text": "Incredible dinner!"
        },
        {
            "date": "2주 전",
            "language": "nl",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkUGR6Tm5WRkExU2tOTWVFOTBjVTFvZURjMGJYYxAB",
            "text": "Foute tent natuurlijk, en het is niet erg om 35$ voor een negroni te betalen maar dan moet ie wel goed zijn. Slechte vermouth; geen sinaasappelschil."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1LVpLdFZREAE",
            "text": "Always a good time! Great food! Amazing service!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBeGQxcE1TVGgyVUhKcFJXTlFSSFEyVjFSNllYYxAB",
            "text": "I recently had lunch at Cipriani Downtown Manhattan and, while the service was excellent, the food unfortunately fell short of expectations.\n\nI ordered two salads (the tuna and fennel) and a pasta with mozzarella. The flavors were surprisingly flat and lacked the freshness and refinement I’d expect from a restaurant of this caliber and price point. The pasta was not fresh. The salads were underwhelming, and the pasta felt more ordinary than indulgent.\nFelt like my regular dinner salad and a microwave warmed simple pasta leftovers.\nIt’s a pity, because the atmosphere and service set the stage for something special (let alone the price!) but the kitchen didn’t deliver this time."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oUFZWSllZWHBHUWpOaWJETnVSRzlNWVVkdGJHYxAB",
            "text": "Always great service, great food and awesome ambiance."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTU5rOUtXalZuYVRWTk1GWllSMDU1YzJWc2JrRRAB",
            "text": "Very good experience. Restaurant was bumping on a Saturday, but they messed up one part of the order. Also, the food was good, not GREAT. I’ll eventually be back, but not racing back. Touristy as well."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sc1dISjFUelpETW5sU1RtcE1lVzQzU2xaNVNrRRAB",
            "text": "Visited Cipriani Downtown for lunch and had a delightful experience. The baked white tagliolini with was good… think of it as a luxurious, Italian take on mac and cheese. I also tried the seabass pasta, which was fresh and flavorful.\n\nThe staff were friendly, and the manager took the time to check in, adding a personal touch to the meal.\nThe atmosphere was elegant yet relaxed, making it a great spot for a leisurely lunch.\nthe prices are on the higher side…even by NYC standards.\n\nHighly recommend for a special occasion or when you’re in the mood to treat yourself."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJM1JsbzFjR2h6ZGxkelFVbEZNaTEzZFZsdE5FRRAB",
            "text": "I come here all the way from Jersey just to get the Maringue cake !! 100/10"
        },
        {
            "date": "1달 전",
            "language": "iw",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paTkxXbENibXhaYWt4T2JYUTBkQzFCWTNGSGVtYxAB",
            "text": "מסעדת יוקרה איטלקית, שירות ברמה גבוהה מאוד. אוכל מאוד בינוני ולא מרגש, מבחינתי מאוד אוברייטד, אין תמורה למחיר הגבוה והלא מוצדק בעליל."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GaWJHZHBYMXB1Vm1JMlMwaHdjbWRZVlZwMFMwRRAB",
            "text": "Such a fun and unique spot! Really popular and always has a lively vibe. The food was excellent and the service was just as good. Can’t wait to come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwM1gwSjBlVzVRVWt0eGVYbHZTRTFOZW5ObGNsRRAB",
            "text": "Iconic of course plus great vibes atmosphere food service. Love it every time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVVJWWlRPVTB5WTBsWk9VNXNlVWc0VkVadVNXYxAB",
            "text": "Cipriani stands as the very embodiment of Italian culinary heritage, a name synonymous with timeless refinement.\n\nEach plate of pasta arrives freshly crafted, delicate yet deeply flavorful, while the main courses—consistent in taste and impossible to resist—linger in memory long after the last bite.\n\nFor over a decade, whether in Miami or New York, Cipriani has been a sanctuary of reliability and elegance, never once failing to enchant.\n\nThe atmosphere exudes effortless sophistication, the service is orchestrated by a team of consummate professionals, and no visit feels complete without raising a glass of their signature Bellini—an icon in its own right."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkYU5EbElhSFZyTFRGM1JUUTRRbUU0VlZoS1JuYxAB",
            "text": "Highly recommend for a solid meal and great atmosphere. The service is astounding. Sometimes the service may take a little while if it’s super busy but generally speaking they’re very attentive and preemptive with replacing utensils and plates between courses, etc. They have one of the best ribeye steaks I’ve had (even better than many steakhouses), their vodka sauce pasta and baked tagliolini are great, they have a great curry dish with chicken or shrimp, and they have probably the best vanilla ice cream I’ve ever had. Best dessert they have even better than their meringue cake (which is also good). A lot of people who hate on it either showed up late for their res and thus had to wait to be seated or were rude to wait staff. Treat them with respect and they will take great care of you."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vdFEyVlNSMWROUkU5blpsRmlOMjh6ZEdsUGFFRRAB",
            "text": "It was good, but when will Cipriani bring back La Especialita?? I miss my favorite breakfast of a single eggs Benedict, the best, fruit salad and a cappuccino, ordered from the counter. Everything top quality."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOUGVsOWZXblV0VW1GRFlWQmphMWhKY2tKNVVrRRAB",
            "text": "Booked a table far in advance but when we arrived they did not really have a plan. Instead, they placed us on the street which was not a good experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psMVZHUTVYMUJtWmtkSmNYWnZlVlkwVHpjMVJVRRAB",
            "text": "Worst Italian food and drink I’ve tried. Really bad quality!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWQ1Frc3pXSEppWjE5ZlZXRndRVmxFUVVGcVZHYxAB",
            "text": "I went with the dish of the day and started with a delicious burrata so fresh and flavorful. The salmon and salad were excellent as well. I finished with their famous meringue cake, which was good, though slightly below my expectations compared to the other dishes. The atmosphere is amazing, the staff is very attentive, and the place never feels pretentious. My friend had a cappuccino and I had a latte both were truly fantastic, freshly made and full of flavor. And of course, their Bellini is a must have, so refreshing and perfectly balanced. On my next visit I’ll definitely try the carpaccio and pasta. Overall, Cipriani truly lives up to its quality and hype"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVVEwNWZSME4zVGpKS2NVeHBOVjh4VVVwaFgxRRAB",
            "text": "Terrible food. Took forever to get seated even though we had a reservation. Expected a lot more from this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCRE5VcHNWbkZLUldReU56Um1jV2h2ZDJWdU5GRRAB",
            "text": "Pleasant staff"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTU0zaGxaM0Z6WkdVNFZrNVRhVzloV1VsNVVIYxAB",
            "text": "Took forever to get seated even though we had a reservation and food was average at best"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toblR6UjNkWGRUVlRneE1uVXhWMXBsZW01c01tYxAB",
            "text": "Absolutely, excellent service, I use to go to the one on 42nd street...a few times!\nBut, I like the outdoor sitting atmosphere in SoHo better..\nLora V Brooks"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0TVgwZGFZbTQ1VkRWaVpVUmlXVWd5VFVaUVQyYxAB",
            "text": "Beautiful authentic Italian food and atmosphere"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOUFpHUnNOMjl2U1V4S2JtVkhhVXBFUTBzM1JFRRAB",
            "text": "never have i ever experienced such a big racism in a restaurant like this. we were the only asian group there, and the waiter literally snatched the menu after i ordered the appetizer, even when i was still reading the menu. the vibe, the atmosphere, HORRIBLE, tables are placed all tight and close, chaotic, all kinds of noise from everywhere.\nfunny thing was we asked for check for 5 times and even once one of my friends walked straight up to the waiter, it still took a whole century for them to just deliver a check, same as the dessert, we ordered, and reordered, waited for like 20 mins.\nthe most hideous part was that the waiters were smiling to all the white customers but throwing us attitude or even ignoring our existence, WOW, now that’s how gentleman ish a famous Italian restaurant can be huh?\nnevertheless, the food was indeed top notch."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGQ1lteFNTalJITlhaM2VqTm9ZbFZEWHpkalNIYxAB",
            "text": "Just an average restaurant — nothing compared to Cipriani London, Dubai, Monaco, or Doha. The worst in the brand’s food chain!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRNWVXcHliRFZMV0VGSWFGVllWMDB3WjB3NWVGRRAB",
            "text": "An absolutely awful dinner. Service was unacceptable. We waited an hour breeen our appetizers and main courses and had to repeatedly ask on the status of our order. Once the food arrived the branzino was served on a lonely  plate without any garnish and dry and on another plate overcooked broccoli rabe. Veal picatine was slightly better but definitely not worth the wait or the price."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWUFNHSllkbEpFVEc0dGNFYzVWWE5XUVdKUU1VRRAB",
            "text": "Old school great food and service"
        },
        {
            "date": "2달 전",
            "language": "de",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaNE9XNXlja280WTJGNFozTlVSRzFxTkZVMVNtYxAB",
            "text": "Sehen und gesehen werden - hier ist immer was los. Draußen sitzt es sich deutlich besser als drinnen. Wir hatten einen tollen Tisch in der ersten Reihe, das Essen war gut und reichhaltig. Trotz des vollbesetzten Restaurants war der Service war top."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5WVZtdFpVSFF0U0U5Q2NWYzJiVjlGT0ZSWFJHYxAB",
            "text": "Love it service top tier food remarkable $$$$$$"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201aGNucFZWVFozT1c5dVkyRmtlRGt0V25kTU9IYxAB",
            "text": "I used to love it here, and the staff were always so nice. But unfortunately, I dropped a ring while dining, and while the waiters were kind and helpful, I really think they should have checked the cameras to see when it happened. It left me feeling a bit disappointed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21veE9XSkZNSGhHVWxjdFkxVnJWRXQzY0VOUFprRRAB",
            "text": "Haven’t been here in many years until this weekend. Food and service are still excellent. However, the atmosphere doesn’t match the quality and prices of the food. Very strange. They’ve packed up many tables so close to each other that can you hear everyone’s conversations. It’s almost like a big communal table… extremely close to each other.\nAlso, small thing, but given the category of the rest and prices, they should at least have nice soap in the bathrooms. Softsoap in a luxury restaurant is not it. Lastly, having a guy selling candy outside of the bathroom seems so weird nowadays."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKc1ZHOVhhVEZhVEVOeVJVaDZUM2sxZFVaUFZWRRAB",
            "text": "Lovely atmosphere to enjoy dinner in a family oriented atmosphere"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5VWJqUlZUVFV4Y0RKTWVubE5NVTVRZG1aM2NIYxAB",
            "text": "I had been looking forward to trying this restaurant in New York, but it didn’t meet expectations. The atmosphere was nice, but the food was underwhelming – bland and poorly executed. Service was inconsistent, making the experience even more disappointing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWQk56RXRSWHBOYkdOc2IwTktkVmswT0VabmRVRRAB",
            "text": "Honestly there is nothing special about this place and the food is average at best. What was beyond shocking was two African American women walked in and the manager ask them if they needed to see the menu first. He didn't do that for anyone else. Absolutely despicable and shame on you. Will never come here even for free."
        },
        {
            "date": "수정일: 2달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJYmt4NE9WZ3VIdFp3EAE",
            "text": "👍"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVeVoxaDBRbU5pU0dFMFZtZFlkMEptVEZoNVIyYxAB",
            "text": "This place is really just a regular Italian restaurant that you could find in NJ. Overrated. Food was very average and super expensive for nothing. You were not allowed to modify any of the ingredients. Kids pasta plain butter $40.!\nAt the end we took of the dishes home and the server forgot to bring it to us."
        },
        {
            "date": "3달 전",
            "language": "ar",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FNGJHc3hNamh2YzFoamFVVTFaRkJoWlU1WGQyYxAB",
            "text": "لذيذ واشكر الموظف Giuseppe"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xobk1sQjVhek15Y0hRdFRGbG5ibVZPWlRGRFduYxAB",
            "text": "We had such a beautiful experience at Cipriani. We were visiting from out of town and showed up a little late to our reservation, but the staff was so kind and accommodating. Milton, the manager, was truly incredible. He was warm, attentive, and you can tell he genuinely cares about every guest. His hospitality made us feel so welcome and really elevated our whole night. Every single person there was amazing. Can’t wait to come back next time we’re in the city."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rNVUyTXRkSFJDWmxweVozSkxPRmxoT0hWSU1GRRAB",
            "text": "Honestly, this place was a letdown. There were little bugs floating in my water, and the cup kinda smelled weird too. I asked for a new one, but no one brought it over for ages. I had to go ask again, and the server finally gave me a new glass—but looked super annoyed about it.\n\nThe food took forever to come out, and no one ever checked in. I was just sitting there wondering if they forgot about me. Not a great experience. Won’t be coming back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOVlRHOU1USEZrYlVSV2FrSkVWbTlTVVZGc1JIYxAB",
            "text": "Disappointed and Underwhelmed!\n\nI’ve always heard great things about Cipriani, so I was genuinely looking forward to dining here — but unfortunately, it did not live up to the hype. The overall experience was bland and underwhelming.\n\nMy husband had the steak, which was just okay, and I ordered the sea bass, which was honestly awful. The seasoning or oil used on the fish had a bitter aftertaste that made it nearly inedible — I couldn’t even finish it. We also split the chicken sandwich as a starter. It was decent, but let’s be honest: it’s hard to mess up a sandwich.\n\nWhat made the night worse was how rushed we felt. From wine to appetizer to entrée, the entire meal was over in about 40 minutes. It felt like they were trying to flip the table as quickly as possible. The most shocking part was at the end: after we left the tip in the envelope and paid, our waiter grabbed the envelope immediately, opened it in front of us, and wished us a goodnight — before we had even stood up. Completely unprofessional. No one should be handling a tip that way before a guest has even left the table.\n\nFor a restaurant with such a high-end reputation and price point, this was a huge letdown. Sadly, we won’t be returning.\n\nIf you are reading this, please choose a different restaurant !"
        },
        {
            "date": "3달 전",
            "language": "ja",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGbU1HVlFWRTAwV21KTFpIWlRXamwxWjB4SlRFRRAB",
            "text": "美味しかったです。\nブロッコリーのスープや魚が美味しかった。"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGT1RIVjNNbDk0TFdaNlZsUmxRMGh5V25VdFFuYxAB",
            "text": "El lugar es fantástico así como los alimentos, el personal es muy amable y cuidan todos los detalles, el capitán de meseros es muy atento pero creo que le falta un detalle, debe ofrecer explicar los platillos u ofrecer resolver dudas en caso de que surjan, es solo un detalle pero creo que eso le daría un distintivo a él y un extra al lugar.\n\nThe place is fantastic as well as the food, the staff is very friendly and takes care of every detail, the head waiter is very attentive but I think he is missing a detail, he should offer to explain the dishes or offer to answer questions if they arise, it is just a detail but I think that would give him a distinction and an extra to the place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MVUwWnlTa1ptUzJwWGIxazRiWGRUUW05eGVXYxAB",
            "text": "Today was a hot day in nyc and I haven’t been to Cipriani in over 10 years when they used to do promoter dinners there . I wanted to sit outside even though it was super hot . I had a virgin Bellini it wasn’t that cold it was a good 6.5 out of 10. I didn’t love the tuna tartar 2 out of 10 but then again I never really like tuna tartar  but my pasta was good as was my vanilla meringue cake ! FIVE STARS FOR service I would go back again just to experience that hospitality the man at the door who speaks Italian and knew everyone who walked in or seemed like it the waiter and the server assistant 10/10 to everyone in there ."
        },
        {
            "date": "3달 전",
            "language": "iw",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2podmIyd3dOVFpyVVZkWVZ6ZHZVRzUzVmxwVk0yYxAB",
            "text": "מקום מדהים.\nשל הביוקר 😄"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbk1MYU9nEAE",
            "text": "전체적으로 음식이 다 맛있고. 머랭케이크는 완전 최고!"
        },
        {
            "date": "8년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3OWJUWk5BEAE",
            "text": "이곳은 구지 설명하면 촌스러운 뉴욕의 Hot Place에요\n예약을 해도 한시간 기다려야 하는 곳이라네요\n셀러브리티들이 새로운 남친을 원할때 찾는 곳이라고 하네요^^\n여자들끼리 오면 나 pick up해줘~뭐 그런 의미라네요😋…"
        },
        {
            "date": "수정일: 5년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNei1mWFV3EAE",
            "text": "맛있습니다"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJV0FfYXp2X19IRG1BRRAB",
            "text": "Service at Cipriani Downtown is excellent. The staff was friendly, fast, and very attentive. It was raining when I arrived and they immediately took care of my wet umbrella and made sure I was comfortable, which I appreciated.\n\nThe food was good, but definitely overpriced for what it was. Portion sizes were decent, and everything tasted fine, just not particularly memorable. I had the baby artichoke salad—I liked it, but didn’t love it. Their espresso is exceptional though.\n\nThey bring out bread and breadsticks, but no butter, olive oil, or even a plate to go with it, which felt a bit off for a place at this price point.\n\nAmbiance is fine, pretty old school but not vintage / dusty feeling.\n\nOverall, nice atmosphere and great service, but there's definitely a mismatch between food and value."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbmRmNFhBEAE",
            "text": "We went for a lunch yesterday to this location. I didn’t really want to do a search for good spots. So asked my friend to make a reservation right away for this place, since it has been always in my list and I thought brand speaks for itself. So I don’t have to worry about anything. However I was so wrong when I got here. First of all there is no space in between tables, it is so uncomfortable to walk+there is no A/C. Weather so muggy also. I saw a only one fan in the corner, which was not a bit help. I ordered a bellini and my friend ordered wine. But the glasses that they served these drink looked like this. These type of drinks should have been served with the glasses with stem. Tuna tartare was mediocre. Nothing special. Branzino which I ordered was so bald. It didn’t have any taste. I haven’t eaten the greens that came with it. It was too salty. To be honest I can comment on and on. But in a nutshell it was very disappointing especially for this overpriced place. May be we should have commented and let servers know. But they were sweet. I didn’t want to say anything and make my friend to feel uncomfortable. So we paid for it and went to other place for coffee and dessert. Honestly restaurant could have been much better in all terms."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NWRTaWNREAE",
            "text": "El servicio es muy bueno, mozos amables que hablan varios idiomas. Luca nos atendió y es servicial y muy correcto.\nLa comida italiana es rica, sirven una panera con grisines y pan. Los ravioles de espinaca y ricotta son una delicia con una salsa con manteca de salvia.\nLos spaghetti con sea bass deliciosos.\nDe aperitivo podes tomar el famoso bellini, y probamos el steak tartare, y mozzarella di búfala con olivas y tomates.\nEl helado de vainilla muy bueno. También hay variedad de tortas: de limón, chocolate y de frutas."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLMkc4THZQcGFtMmhBRRAB",
            "text": "Cipriani is a true delight for food lovers! The atmosphere is elegant, the staff is courteous, and the menu is refined and exquisite. Every dish feels like a masterpiece — both in presentation and flavor. The cozy yet classy setting made the whole experience unforgettable. I’ll definitely be coming back!"
        },
        {
            "date": "4달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsblFUbDVSRkExVFhCc1UxQmhZWFpJZUVKSVJuYxAB",
            "text": "Tercih ettiğimiz tüm ürünler çok lezzetliydi. Özellikle levrekli domatesli onlara özgü makarnaları kesinlikle yemelisiniz. Atmosfer çok güzel sokaktaki masaları tercih ederseniz daha da iyi hissedersiniz."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPMm9xZmpoeXVqODlBRRAB",
            "text": "One of my favorite places in New York. Vibes are always perfect every single dish was delicious. The dessert specifically just always hits the spot, you can’t miss out on that!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoZ29iekpnEAE",
            "text": "A friend recommended it based on the \"great reviews\" about the place and the food.\n\nWhile service was great, the food was a big disappointment. I could not finish it.  I got the veal, and the food was super salty, I know that I could have asked them to remake it, but honestly, it was not worth to me, the sauce just didn't taste well.\n\nThe pasta my friend got was better, but it was a bit spicy.\n\nLet me be honest, any less than average Italian restaurant would have better tasting or similar tasting food.\n\nThe place is crowded, tables extremely close to each other, but I know that a lot of people enjoy that. So if that's Something you like, you will enjoy the place.\n\nThe place is clean, the staff were nice, liked the decor.  But the food was blah.\n\nThe dessert was really good, that's a plus.\n\nGo there with zero expectations, and you will have a better experience.\n\nStreet parking was available, but I'm sure that's not the case on weekends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaTg2a0tnEAE",
            "text": "Cipriani Downtown has a vibrant atmosphere with a stylish interior, but the dining experience left much to be desired. While the food is decent, it doesn’t live up to the high price point. The portions are small, and the flavors were underwhelming for what you would expect from such a renowned name. Additionally, the service was inconsistent. Some staff were attentive, but others seemed uninterested and inattentive, which affected the overall experience. Although the restaurant has a great reputation and a lively ambiance, it didn’t quite meet expectations when it came to service and value for money."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnLUlySE9nEAE",
            "text": "Great experience. We went on a cold Jan without reservation, and Ofcourse no place to sit inside but we could get a place to sit out, with little outside heating, as it was not windy it was surely manageable : great food tries Prawn Carpaccio. Was great"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcDVtUlZnEAE",
            "text": "This is a scene and a hotspot for sure. You can see a celebrity or a fashion icon there. The food is OK, service is good. The place is old and feels crowded but that’s not why you’re there. It’s definitely a must visit in Soho. It’s always a vibe. Best for lunch in my opinion or dinner when it’s warm outside."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3OS02UkhnEAE",
            "text": "Thank you so much for the excellent service, Jack! You're the best! I had a great time on my birthday! Ally ♥️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuemZMRWZ3EAE",
            "text": "Not worth the hefty price tag but Service was Impeccable, Atmosphere was beautiful ans the food I had was average.... Highly recommend you try for yourself and see if it's worth it. I know plenty of other places just as beautiful with better food. The Burrata and desert was excellent and the only thing i truly enjoyed!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSMGJMdzBRRRAB",
            "text": "All experience was delightful from the first step\nWe had reservation for two but our cousin joined us and gentlemen in the front desk happily put us in a beautiful table . The food was delicious and portions…"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuanJTNDV3RRAB",
            "text": "Este lugar definitivamente vive de su fama. La comida aunque es buena, no es extraordinaria para lo que cuesta.\n\nAlgunas de las personas del servicio se aprovecharon de que mi papá no habla Inglés para hacerle recomendaciones de vino y terminaron trayendo una copa que costó $204USD, sin previo aviso, lo cual es un ABUSO."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNmRPc25nRRAB",
            "text": "Great place for a weekend lunch with friends, especially with the lovely outdoor seating. The food is amazing, as expected—Cipriani never disappoints, no matter the location. Always a solid choice!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbWZUaUF3EAE",
            "text": "I recently visited Cipriani Downtown and had an excellent experience! I ordered the baked white tagliolini with Praga ham. I had a glass of their house Cabernet which were both great. My girlfriend had the salmon along with a cocktail, and she loved hers just as much. There are a lot of different options on the menu and the dishes I saw coming out looked fantastic. We didn’t have dessert but those looked pretty good as well. We didn't make a reservation, so there was a bit of a wait when walking in, but nothing too long. Depending on the time you go, the wait could be longer, so keep that in mind. Overall, highly recommend for great food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyd01XWGRnEAE",
            "text": "Pricey. Had a $27 Bloody Mary in a narrow glass with a lemon wedge. The sake time cocktail was much better. The steak tartar wasn't anything special. The presentation wasn't very appealing.  It looked like a raw hamburger patty taken out of the freezer, thawed, and plopped onto a plate. The pasta with ham was rich and delicious.  Small portion.  The ice cream was comparable to soft serve with a side of Hersheys syrup.  Liked the nuts for it. Good expresso martini."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZcjdXSWJ3EAE",
            "text": "Classic meal choices, and only the best ingredients used! Every time I go to Cipriani, I have never received food I did not like. The menu is constantly changing but always has staple dishes on it. I get The carpaccio almost every time I go and it blows away other restaurants I order it from. The downtown location is nice because parking is never too much of a hassle, and they open all the front doors so even if you are not outside sitting (which is a big preference) you will have that indoor space opened right up to the outdoors! The bright yellow awning offers much needed shade and such a touch of elegance. The staff is phenomenal, so personal, and so kind, only putting out the highest quality of service. I wish I remembered the name of our server from this afternoon, she was great! So attentive, quick, and kind! If you have never been here before I would recommend the Risotto (give it about 20 minutes, try The carpaccio, honestly just try it all). All time favorite spot for summer lunching with friends, 5/5 in my book and I don’t hand those out. If you’re reading this review thinking should I go, less thinking more doing, the answer is yes!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGbTVUaGhnRRAB",
            "text": "We had an amazing dinner here! The manager\ngot us seated quick!! Restaurant was full !! My favorite dish here is  Calves Liver \"alla Veneziana\" with Grilled Polenta its so delicious 🤤!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OWU1FMWlialpOY0RKaGJsbENORUpCYTFGVGIwRRAB",
            "text": "i honestly don’t write reviews ever. but the service was so bad it just made my experience feel horrible. we had said multiple times to many people that we were still eating and they still took our food. they kept taking things without asking if we still wanted to use it and i had to keep asking for the stuff back, example: olive oil, bread etc. and i noticed they weren’t even bothering the couple next to us as much as they were bothering my friend and i and it just made me so uncomfortable and overwhelmed like we just wanted to have a good night and it just left things really weird. i just didn’t like how we were being treated at all."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNleVBxeGtBRRAB",
            "text": "Old school classic modern Italian place. The place is really top notch in terms of the atmosphere,  people,  drinks and food. This place is really classy and busy all the time, so reservation is highly recommended. We had absolutely fenomenal beef and tuna tartare as well as beef carpaccio and poached sea bass. Their chocolate cake is also one of the best I have ever tried. We were also recommended vanilla merengue cake as best seller, but I would suggest to go for lemon merengue pie as vanilla one, although very light and tasty is too plain to my taste. If you are driving exotic car, they will park it right in front of the restaurant. The place is not cheap 3 appetizers,  1 main course and 2 drinks, 2 coffee and 2 dessert was cost $270 without tips, but it was well worth experience"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3X3JEZW1nRRAB",
            "text": "Extra star, due to the extremely beautiful, and trendy crowd. It was New York Fashion Week, and on 09/11, this is where everyone that was that beautiful was. Service was swift, efficient, and detailed by our female server that seemed truly passionate and happy to be at work! What a change from 80% of restaurants where everyone, as professional as they may be, would rather be elsewhere. Pictured above, Pecan Pie, Pumpkin and Sage Ravioli, pasta, and gazpacho. Food itself good, but not great. My orange or tangerine juice tasted like motor oil. I've had this happen before. It's the components not working properly, contaminating the product. My fellow Chip dining regular couldn't taste it. $$$ - $$$$ Expensive."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwa09yWi1BRRAB",
            "text": "The city place, which is mentioned in Tik-Tok as a must-go and that famous Meringue Tart, which appears in every second stories of every self-respecting sugar baby. I can't say that I was impressed, look like a double price for a famous spot. In no case do not take the soup, it will be either cold or something similar to a dark stew.\nNevertheless, I want to put your attention to the Main course and pastas - I highly recommend taking their bestseller, Bolognese. Next, the lamb ribs are tender enough to satisfy your tongue receptors, but too much salty. Also can recommend Lobster salad, it was delicious and juicy, cause fresh tomatoes.\nThe manager at the entrance is quite friendly, however the waiter is too arrogant and not courteous, but does his job. I can’t say that we were impressed, there are less advertised places in the city, not with so much oil in the dishes. The kitchen leaves much to be desired. Atmosphere a little bit tense, it's feels in the air, but you can always sit down outside."
        },
        {
            "date": "4달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NMWNUQmxNRkpGYm1oU1gxUnpkVFJUUTFKcFdrRRAB",
            "text": "Wonderful food and service but little bit expensive"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxaDhUeHpBRRAB",
            "text": "Tasty!!!  Our reviews had over 37 million views this year. We really love Cipriani Downtown.  Updated 8-5-2022.  Perfect again.\nLoved the pasta with just tomato sauce and the vanilla cake with homemade ice cream.  Met the big boss there and he told us about how picky he is about everything in the joint.  A real joy to speak to someone so passionate about food and service.\nUPDATED 11-1-2021 ONCE AGAIN ONE OF THE BEST MEALS EVER. LOVE THE CAKE AND LOVE THE PASTA.  WOW One of the best Italian meals we have ever had.  Everything was great.  She had the Gnocchi homemade and I had the pasta with veal ragu red sauce.  Both were among the best ever.  Broccoli soup was wonderful.  Menu changes daily.  For dessert we had the coconut cake with homemade ice cream. We also had the crepe flamed tableside. OMG both desserts were awesome.  One of the best set of desserts ever.  Check out all of our reviews. If we do not like it we do no review it so all of the ones you see are places that are fantastic. Follow us if you like. We had over 36 million views so far this year and we thank you for that. We don't get paid, we just love to eat. Be sure to click on \"RobH\" at the top of this review to see all of them and to follow us if you like good food and FUN.  If we do a review it is because we love it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2NHZyVjZRRRAB",
            "text": "This is obviously a NY staple, however the food was meh. It could be because we were just not used to the authenticity of the flavors but I wasn’t too impressed. It is also pretty expensive, the majority of our high tab was drinks.. which…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxazZia0tREAE",
            "text": "Food was pretty good but nothing too special. Tuna tartare had just tuna with some greens as a garnish and a fish pate. I would usually expect avocado or mango, tuna was fresh but felt like it was missing something.\nSea bass with rice pilaf actually comes with just rice (probably a bit of butter), the fish itself tasted good. Grilled Branzino was delicious but fins weren’t removed.\nMeringue cake is delicious!\nOverall great vibe, but food could be better for a place like this."
        }
    ],
    "reviews_count": 80
}