{
    "name": "Il Cantinori",
    "place_id": "ChIJH9mMjZlZwokRuIt5KXWOZMw",
    "grid": "MN2",
    "address": "32 E 10th St, New York, NY 10003, USA",
    "rating": 4.5,
    "user_ratings_total": 488,
    "phone_number": "(212) 673-6044",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZeFFUWm1ORGt6ZEZaak5WQkdSSGg2YXpoVFowRRAB",
            "text": "The food is terrible and the prices are crazy."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzeWFIZGthV2R2WVZORVNVRndRVFY2VldjelpYYxAB",
            "text": "The WORST service.\nWe had to wait forever just to place our drink order and then again to get anyone’s attention. Our tall waiter, yes you know who you are  was  ignoring our table the entire time. He stood uncomfortably close when he took our orders , no sense of personal space.\n\nThey brought out a plate of tomato sauce as an appetizer (seriously?) and the bread was nothing special. The main course took 45 minutes to arrive, and when we mentioned it, they brushed it off with a dismissive “yeah, yeah.”\n\nWaiter  never once asked how our food was & completely fake and passive-aggressive. The food itself was mediocre at best, dessert forgettable, and even when the maitre d’ finally came over, it was too little too late.\n\nHorrible service. Fake smiles. Mediocre food. Never coming back."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKaE1VSlRNVzVzVVZaRGVUUldSRVpFZDI1YWVuYxAB",
            "text": "amazing food and service!! Gabriel was great. will be back!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWU9GWjJVRXBVT1ZKUFNVVlFNVGRZZFRoT2MyYxAB",
            "text": "Mediocre food (definitely not worth the price), poor service. Service was very slow, they were idling even though we had plates to clear and had asked for the dessert menu. No one asked us how our food was, even though they were not doing anything but standing around.\n\nService was also uncoordinated (our dessert menu took 20 mins to reach us..overheard one of the servers ask the other if they had given us the menu yet a long time in).\n\nThe servers also don't seem to really like each other? Area was way too dark, only lit by 2 small candles on our table and a few small light on the walls.\n\nOverall, definitely not going back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWQ1RYaGZlRkI1Yms1c2VHTktSVUpJVjNWWWVuYxAB",
            "text": "The food was delicious with a delicious paired wine. The service was really next level. The staff went above and beyond for us. The atmosphere was a really cool vibe. Looking forward to returning!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JeE1teHJWVWRyUjJkRlpuRmxhMnByVTI5alZFRRAB",
            "text": "This amazing place I like service special Leonardo Rodríguez when you go to Cantinori ask for Leonardo Rodríguez"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JMU1FbHVSbXBwUVdkd1NqWklSVWhhVG5Od1pHYxAB",
            "text": "Great Old New York ambiance. Attentive and charming Matre d'. Service was a bit off and my wine was wrong type from what I ordered. We never asked to taste it or if I liked or after it was served. With entrees that start about $40, that shouldn't happen."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25seVgxVXRXVlpNT0V4ZldUTjJTR0psUjAxaWExRRAB",
            "text": "Absolute gem. A glimpse into the best days of New York. Love this spot!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VNFpVeHhNRmRXTmw5aWFHbHpkMXBUYUhVM2FFRRAB",
            "text": "Great food. Great service. Great environment...."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGSFVFNVdkVU16VDJOVWRuQlBRbXhsWVdOWldXYxAB",
            "text": "I’ve dined at Il Cantinori many times. For some reason, the service last night was horrific. They normally give a complimentary tomato sauce with the bread, which was offered to every table except ours. No one asked if we wanted cheese for our pasta, the waiter didn’t check in with us until we were about to be done with our food. They also always give complimentary cookies with the check which we were also literally the only people who did not receive this."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SWVYxVmFWWEp0YTNRdGFFRTBSWEZoUTB0aWNXYxAB",
            "text": "Celebrated my daughters 30th Birthday last night - staff and everyone amazing, food was dreamy, the lovliest people.\nThank you!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkUlRGRnNaVWxOV2t0RFEyTlNaRkpCVmtKWVVHYxAB",
            "text": "I have been supporting this downtown establishment since 2004!  I love it!  Traditional italian food in a cozy atmosphere.  They are the real deal here, not pretentious at all.  Great for a date night, a treat, a special occasion, or a dinner party with friends.  Highly recommend this restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBek5qSllTMVY0TFVab09HNU5lRXgwWTNwR2JWRRAB",
            "text": "Admittedly I get deliver most the time but it is delicious. With that said my family is very sad that the Pollo Saltinboca is no longer available. Is it coming back!?!?"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvelEzSlRTekE1Y2toVVJIRnpOR3hCUm5NeVNYYxAB",
            "text": "Great service and food. We sat near outside so it was also airy. Tables close together but not too cramped."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taMGFTMU1abFpJVUVoSGNGOTNjMHBuYmxwRFoxRRAB",
            "text": "This place gives out some chill vibes. Good Italian food (had the salmon), and friendly but very professional bartender. Will recommend for your next visit."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kMFJuTkJaVFEwZWpOMFNGSXRiVFpRTWxKVU9FRRAB",
            "text": "If I could give this place a 10/5 rating I would. Best pasta I’ve ever had, amazing service (stayed open of us long after everyone left) and amazing wine list!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xReFkxYzFjbU5FTldFd2RXMWxVSEJTVDNCSE1YYxAB",
            "text": "Pasta was great, Ceasar salad and calamari were average at best. Super busy spot with tight tables. Loved the round tables, but the room was very loud."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ob1ZUWkZSWFJJVVZsTk5ESTVUVjh3U3pKaFJVRRAB",
            "text": "Had such a great experience here. The staff is truly impeccable—so warm and attentive without feeling over the top. Everything we ordered was absolutely delicious, and the drinks were just as good. It’s the kind of place you’ll want to come back to, whether it’s for a fun night out with friends or a cozy date. A must-visit."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wa1ZsYzBiR2RmUVVWR1VXVmlZazVVY2tnMVEwRRAB",
            "text": "Best pesto pasta in the world."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KNFpTMW9Xa2syYWpCdWVVMHpUak5yWlZSYVVWRRAB",
            "text": "First time visiting and definitely won’t be the last. Christian, our server, was amazing and if you get a chance to have him wait on you, he’s great and fresh from Italy!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKVlNqZHNjMHBaTjFkRWRtUnFWbXBPZGtkWWRsRRAB",
            "text": "Easily one of the best Italian meals ever. And I’ve been to dozens of cities in Italy."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNT1I0X1RNdmZlay1BRRAB",
            "text": "Classic Italian in NY, fun experience recommended by a local. The bread service, the main meal and wines were all very nice. Waiters were spot on, water glasses always full. Fun place to enjoy a great meal outside of Little Italy in NY. Seems there were a lot locals eating here, that’s always a good sign. They also had a few tables outside."
        },
        {
            "date": "5달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNYmt4S1RnNmZhaEhnEAE",
            "text": "Wonderful wine, Sauvignon Blanc San San Leonardo\nCozze E Vongole. Ins Capesante . Fettuccine Alfredo. Filetti Sogliota. Ravioli Salmone.\nPerfect. Delicious. Excellent Service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPeTJ5dHJrbVpuOHJBRRAB",
            "text": "I’m Italian and I can say that the food is like the one of the worst restaurant of the worst city in Italy. A child can cook better. The prices are totally crazy for the quality. Good the service. The ambient is normal and noise. At the end of the story we had 3 credits cards (Visa and Mastercard) and no one was accepted. We payied cash withou one dollar of discount. Don’t go to this restaurant in your life!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQTzZoSkNzN1BPWmJBEAE",
            "text": "Il Cantinori is my absolute favorite Italian restaurant in New York City (Greenwich Village). Service is amazing, everyone is very pleasant and attentive. Food is utterly delicious! And I love the ambience ❤️💕"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VLR2Jwc0dKMmVuS1lnEAE",
            "text": "Food just ok and definitely overpriced. They were able to customize some items which I appreciated with kids, however asked for grilled shrimp for my son and somehow it comes breaded and maybe grilled underneath, which we didnt expect nor like. Nice staff."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMU9ILV9RRRAB",
            "text": "Great service and delicious food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3aE9HMFJ3EAE",
            "text": "My family and I had an unpleasant dinner experience here last night. It's sad to see a good restaurant go downhill.  il cantinori was a family favorite for years, but last night was very disappointing. Our waiter (a guy with blue hair) was mediocre at best—they provided lousy service, and they snuck in an additional charge of 4 “tomato plates.” We never ordered any tomato plates lol. We didn't notice it til after we settled the bill, but what they did was that they charged us for each of our small plates of plain marinara sauce that came out with our bread, which has been historically served as an amuse-bouche (complimentary app) by the restaurant at no charge!! We were shocked when we saw “tomato plates” listed on our bill. I still can't believe it! We have dined at ill cantinori over 20 times, and this leaves a terrible taste. It leaves a nickel and dimed feeling. The food was also disappointing; the food was below average, the pasta trio dish was swimming in oil—just not the food quality we’re used to from il cantinori, and the service was undoubtedly the nail in the coffin. Be cautious when dining here."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaGZiejdnRRAB",
            "text": "Iconic, Italian restaurant where not only the delicious dishes are authentic and made from scratch, but the service is top notch and ambiance is incredibly romantic. ✨\n\nYou will come back.\n\n5 stars."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBazZ2elVREAE",
            "text": "The restaurant was great,  food and staff really good.    Definitely recommend"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfbDdIU1dBEAE",
            "text": "ravioli dish\ngasp of amazement and joy\nleo tends outstanding"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcVppaXZRRRAB",
            "text": "Everything was perfect. Leo made our night very special. Can’t wait to come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYeHFxODJBRRAB",
            "text": "Enjoyable time.\nGood location"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURud1p1eFl3EAE",
            "text": "Excellent! We weren’t super hungry so we split the chicken parm and it was delicious & huge! Service was excellent, the atmosphere was excellent, & the food was delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNXN1UHVRRRAB",
            "text": "Two of my friends and I ate at Il Cantinori for the first time this last Thursday night. We were excited to go to a traditional Italian restaurant and see its incredible reputation. We were served by Leo and he did an excellent job and had a great attitude! We each had a Caesar salad for an appetizer and then we each had the sampler plate which is off menu. Perfect portions, didn’t even really have to look at the menu to order because Leo helped. Ended the night with tiramisu of course. Totally recommend. Thanks Leo!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNEpLSG1BRRAB",
            "text": "Great service. food is not bad hugely overpriced"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuZ3V6WWZ3EAE",
            "text": "The pappardelle alla buttera was one of the best pasta dishes I’ve ever had- comparable to restaurants in Rome.\nThe bread service was fresh and the table side oil olive was flavorful.\nThe caesar salad dressing was homemade.\nThe service could have been a touch more attentive for the price point.\nGood food can’t wait to go back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIN2ZDMEtBEAE",
            "text": "Superb pasta. I'm not even an Italian fan, but loved the variety plate we got.\n\nThe eggplant parmesan was good, different and crispier.\n\nThe drinks weren't bad either, and nothing like good old sambuca to accompany.\n\nClassic looking Italian place, friendly staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIazZpUEtBEAE",
            "text": "The salads and appetizers were pretty fresh and delicious - caprese salad, prosciutto with figs and grilled maitake salad (my favorite!!). From all the main dishes we had - pappardelle alla buttera and Bucatini Alla Gracia were the best!! I wouldn't so much recommend the grilled chicken as it was overcooked and dry. The risotto of the day was delicious, but the portion was just huge. We also had a delicious trentino Sauvignon Blanc!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNId2ZTTG9RRRAB",
            "text": "This place is perfect. Phenomenal for a group of 8 unappreciative and tough to please friends lacking in taste. Immaculate vibes, food and charm."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNILUt2Um9BRRAB",
            "text": "I came here with my friends to celebrate a 40th birthday and I would go again tomorrow if I could.  The service by Agile was perfect -- he was friendly, personable, and even sang the most beautiful rendition of \"Happy Birthday\" that I've ever heard for my friend. Don't miss this gem!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MllMRS1BRRAB",
            "text": "Came here a while back with some friends during a trip. Food was amazing and the atmosphere was extraordinary. Had an assortment of starters, entrees and dessert and all were delicious. This place is always packed so make sure you get a reservation in advance (especially on weekends) and to dress nicely. An amazing place for a fancy dinner date ~"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bWNXWGxRRRAB",
            "text": "Absurd food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiMzlfMUJnEAE",
            "text": "One of the absolute best Italian restaurants in NYC. It’s my favorite go-to spot. I even host my birthday parties there and they always do an amazing job. The food is outstanding and the service is always on-point."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMN3NuZzlRRRAB",
            "text": "I saw this restaurant on a movie and wanted to give it a try, food was delicious, drinks were fine, service was good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6bkpTaUxREAE",
            "text": "We were excited to try Il Cantinori, and unfortunately the experience felt entirely flat mostly due to service. No one was particularly rude and there weren’t any major issues, but the interactions with the staff lacked any soul, spirit, or courtesy. We even deliberately tried to be engaging with our waiter by asking fun questions to no avail. When you pay $40-45 for a plate of pasta to spend a Friday night at an establishment, I think it’s reasonable to hope for some friendly and personable service at a minimum\n\nFood was good, but not great. Again, that may have been encumbered by the service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdjd2aHpRRRAB",
            "text": "Loved. Food was fantastic. European feel on the service which was very nice"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbEt6MFlBEAE",
            "text": "Amazing food and EXCEPTIONAL service by Gabriel. It’s been rare to have servers that actually go above and beyond for every table in New York City lately, but I did not regret going to Il Cantinori at all."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbV9LZW13RRAB",
            "text": "The last time I went to Il Cantinero was 20 years ago. And I remember having a wonderful meal then, and we had a great meal this time. The service was exemplary and efficient. The food was exquisite. I ordered based on the suggestions from our waiter. If you are a lover of food from Northern Italy, this is your place. If they don't have what you want on the menu, or you're not interested in their daily specials, they well make anything for you, as long as they have the ingredients. This place is that good. Highly recommended!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHNGJLVzBRRRAB",
            "text": "Great food in a formal ambiance.  Short menu with an abundance of specials.  Appetizers and pasta was delicious but the chicken parm tasted like plastic (maybe we got a bad piece?).  Mixed berry dessert was served with whip cream and assorted Italian cookies."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSc2RYdHF3RRAB",
            "text": "Came here for a very Carrie Bradshaw themed birthday and was blown away. The atmosphere, service and food were all absolutely impeccable. They gave us a nice opening appetizer of bread, meat and sauce as we looked at the menu. Then we decided to split the ravioli and risotto and they were so kind to plate our meals split without even asking. The food tasted absolutely phenomenal as well. We will definitely be returning for special occasions."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhMDhDSHVRRRAB",
            "text": "When I made a booking, I let them know that it is my birthday and want the best table! They accommodate my needs which was very good thing to start with. Aldo, our server, was very kind and attentive. Me and my friend ordered the special…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXdHFpVjlRRRAB",
            "text": "What can i say🤷🏽‍♀️ - FOOD WAS INCREDIBLE! We didnt order the whole menu to be an expert here, but im betting my bottom dollar they are all delicious. They give you a saucer of marinara sauce to dip the bread in. That alone was to die for. If it wasnt so embarrassing to ask for a refill of that😂, we would have. Highly highly recommend. Reservation was at 615pm. Barely anybody was there, but came 7pm and people started coming in. By the time we left at almost 8pm, all full & happy, most of the tables were occupied. Service was quick. Place was clean. Bar seemed well stocked. We are going back obviously. Looking forward!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2X2NhN0FREAE",
            "text": "Wow!  Classic Italian restaurant with delicious food - best gnocchi, best pistachio bombolini, squid, scallops, and the most gracious hosting.  We went the night of Hurricane Henri and even the pouring rain could not ruin the night.  Perfect."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxLXFYREdBEAE",
            "text": "Il Cantinori is one of the great Italian restaurants of New York City.\n\nSituated in NoHo, near Union Square, this restaurant is on a quiet street, tucked into the middle of the block. From the moment you enter you are in a cozy but classy place, with tables lit by candle light and the amazing smell of Italian herbs coming from the kitchen. You just know that the meal will be good. That sets the tone for the entire meal.\n\nOur server greeted us almost immediately and took our drink order. An assortment of italian breads can shortly after the server left to fill the drink order. They served this amazing pomodoro tomato sauce on a dish to each of us. It was not like a bruschetta topping but more like a very savory chunky tomato sauce with parmesan cheese. The temptation was to ask for more bread and more tomato sauce, but we resisted.\n\nFor the appetizer we ordered the Calamari Alla Griglia. It had a light dusting of Italian breadcrumbs and cooked to perfection and topped with cherry tomatoes. It was lighter than most calamari that I've had. It was not chewy, which is a red flag for me. It was fresh and crisp.\n\nTwo of us ordered the Tagliolini Neri Alle Vongole E Carciofi (Black squid ink pasta with clams), one with red sauce (special order) and one with white wine sauce. The white wine version was a bit flat. The red sauce version exploded with flavor. It was absolutely delicious.\n\nOne of us ordered the Mediterranean fish special. I can't recall the name, but it was mild, not fishy, and was really tasty. The person in my party that ordered this said they would definitely order it again.\n\nFor dessert we shared a cheesecake round with raspberry sauce. It was the perfect size to end the meal along with a snifter of sambuca. The glass came with 3 coffee beans, as all GOOD Italian restaurants will serve it. 3 is good luck and we certainly had good luck with this meal.\n\nI'm giving Il Cantinori 5 stars and adding it to my NY favorite restaurant list."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaN3J1cFd3EAE",
            "text": "Warm and cozy atmosphere, great for a romantic dinner.\nHad better meals at the many Italian restaurants in NYC.\nAnd the slow service  contributes for a date going right, you never feel rushed!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtNmMtRFl3EAE",
            "text": "Fantastic experience sat outside at the front of the restaurant as a party of 8. The interior is cosy and warm, lit up on our visit with Christmas decorations and a tree by the bar.\n\nThe food was great, we all had pasta but the cacio e pepe was the standout. The menu itself is fairly short but almost doubled in size by the time the specials had been announced."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxaV9pSk9BEAE",
            "text": "In the restaurant game native New Yorkers are not easy to impress.  I'm no exception.  Il Cantinori is a NYers restaurant- it is one of those precious gems you hope not too many discover.  Keep it between us.  Enjoy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMEwzckpREAE",
            "text": "Celebrating birthday dinner\nThis restaurant is amazing\nI will be back soon.\nQuality is paramount when fine dining"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPOTVfX2lnRRAB",
            "text": "Proper, old school Italian with great service. Small, elegant bar, great cocktails to start. For appetizers have the classic Caesar salad, grilled artichoke, or burrata. Get a pasta first (primi) course, spaghetti bolognese is always a fan favorite.  Fsh or meat forain, the ribeye Italian style is delicious.  There is a gluten free spaghetti option if needed, no GF bread...wine list is very balanced with a great selection, both the regular and reserve list depending on budget. Don't miss it, book in advance, bring your appetite."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaW91Y3hnRRAB",
            "text": "I'm pretty sure that was Don Lemon that stopped by our table to say hello. The ambiance was lovely and the menu was good. The maitre d was so sweet. He brought us some desserts for the birthday girl. Overall we had a lovely experience for the evening."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2Nl9PRUp3EAE",
            "text": "We just had sunday dinner yesterday. Every one on the restaurant is a perfectionist. The wine and food were delicious. Its in a very good location too 🥰…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4c2FfdGdnRRAB",
            "text": "All 5 stars! I can't say enough about the entire experience. Our server was top notch. The owner, Frank, was so personable. The food, wine and dessert were incredible. What a quiet, pleasant street and street parking available. They've been there 39 years. They're definitely doing something right. I look forward to going back someday."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxdnF5cUp3EAE",
            "text": "Went here for our anniversary dinner, had a wonderful server, wonderful food, wonderful experience, why 1 star? upon leaving I went to the bathroom to return to my significant other telling me she witnessed 2 servers pointing her way and  performing inappropriate gestures amongst each other directed at her, sorry but that unprofessionalism alone is enough for me to give 1 star, shame we had a good time but wouldn’t recommend the restaurant now unless you want your female guests to feel uncomfortable and get silently harassed. Have a talk with your staff please, I’m sure they know who they are."
        }
    ],
    "reviews_count": 64
}