{
    "name": "Hello Saigon",
    "place_id": "ChIJm5D0G5JZwokRv3D9O8bWAp4",
    "grid": "MN2",
    "address": "180 Bleecker St, New York, NY 10012, USA",
    "rating": 4.3,
    "user_ratings_total": 604,
    "phone_number": "(212) 254-2088",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aUE5sTTJSSGhxY1MweWRUTnJSSEUzTUVwVlMwRRAB",
            "text": "The meal experience ranks alongside my most treasured food memories. Staff demonstrated true friendliness also. Hello Saigon serves meals that matter. Under any circumstances, the food quality stays excellent. This place provides a distinctive event."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jd2ExTnZWWGMzVGtwS1pUSjBZbTl1ZEZZd2IxRRAB",
            "text": "Amazing chicken soup"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jNVZuWkZSR2xyVDI4MlpXUkRkMHBpVlVrMVIxRRAB",
            "text": "A really inviting and welcoming spot with attentive staff and an amazing menu with tons of options, including great vegetarian choices! I got the pho ga and was so surprised with how big the soup was for the price! Delicious, affordable, and a great little gem."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKSVYzUm1OMlZTWDNKS1psQTBTMUJKWjJVM1MwRRAB",
            "text": "sooo good and a amount of meat"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkNFNYWmhUVjgzVEZKWFRXeHJSaloyUzJReldVRRAB",
            "text": "I've been here twice and after a highly disappointing first visit, somehow the second was worse. Don't expect any service, and when you do get service, expect the staff to be very rude and the food to take a long time to come out. They even tried to give me my check before I got my food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSlVXeDJkRkJYYW1kT2IxWnpZVUkzUlV4VFdVRRAB",
            "text": "Reliable delivery takeout place very quick I usually order the pho.🍜…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSaU9IcDRhbmxCUkdsT01rOXpMVlZSVWtWelVXYxAB",
            "text": "I'm Thai, and I've lived here for almost 30 years. That should tell you how picky I am!\n\nHere is my review:\n\nDude, I've eaten tons of pho, so I can tell you this place's pho is seriously good.\n\nThe service is great and quick. It's just down the street from Saigon Shack. They have amazing food, and you don't have to wait in line. Check it out; you might love it like I do."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paMlNXVXRiaTAxWjNGamVUSkVPVkZvWDBSdlkxRRAB",
            "text": "On a rainy day, my friend and I ordered a set meal featuring Vietnamese noodles and pork ribs. The grilled pork ribs were delicious, perfectly seasoned, and had a smoky aroma. The pho broth was clean and free of any fishy smell. It was truly delicious. However, the friendly waiter occasionally made mistakes when taking our orders."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOa2VHY3pja3BQV1haWmFWWTVRa3RYVkVFemJGRRAB",
            "text": "Do Not Sleep on Hello Saigon!\n\nThis is my go to pho spot.\nI’ve gone here many times in the past 6 years knowing that I can always get a reliable, tasty meal and have a good experience. Is it the best pho in the city? Idk. But if you’re looking for something simple, cosy and yummy…This the place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tveFdUVm9lRmx3UTI4emVrMTBkakpzVFZKUmQxRRAB",
            "text": "Rumor has it that this is Ocean Vuong’s favorite restaurant so I had to try…loved the pho and the atmosphere!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VMmEzaEJXVVZQTVdGSGVGaDVOM0JtVDBod1QzYxAB",
            "text": "Food was great, not crowded on a Saturday night. The beef pho was amazing."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkU1kxbFhkMDUwYWs5UlF6VTNWSE40UTBSalNIYxAB",
            "text": "Authentic Vietnamese restaurant! Great spring rolls! Lovely services ! 15% off if you pay cash! 💰 not bad for a soho restaurant! Definitely worth come back soon!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdmFVb3RUbWsxWjJOcVZISkxURWQzYVhsWVIzYxAB",
            "text": "The short rib pho is soooo good"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMT2oxZENkX2IzTWJnEAE",
            "text": "Love this place when i want to eat Vietnam food!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VQLW94THZodXNxeTVnRRAB",
            "text": "Pho broth was really good and good potion."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJemQyclRfa1pxM093EAE",
            "text": "LOVEEE THIS PLACE. They have the best pho in the city ! P3 and a home lemonade is my go to order :) reasonably priced and good portions. It’s even better in the winter."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOLTJwLV9fcmVUZ3BRRRAB",
            "text": "this is the only viet restaurant in nyc my viet friend has approved.. enough said!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNktiNjlnRRAB",
            "text": "I always like to order pork chop and pho. And the water very frendly."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZd042R293RRAB",
            "text": "not the best viet food i’ve had in town and the portion for bánh hỏi is quite underwhelming, but cơm tấm & phở were very delicious and the chè ba màu IS THE BEST i’ve had for a while!! also the staffs are very friendly:)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvX2NhUTNRRRAB",
            "text": "Com Tam and Bun Thit Nuong were very tasty! These are much better than their soup options so i’d recommend those. Staffs were friendly and service was pretty fast!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtdU1lT0hREAE",
            "text": "Informal space with Vietnamese classic dishes."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcjRiMlZREAE",
            "text": "I’m from Oregon, the west coast, where all things Pho is hands down the best. I’ve lived in nyc for 5 years now and truly have had such a horrible experience with pho here. There is simply not a community of Vietnamese people. Chinese food is good, Thai and Japanese is amazing, but never viet food. When I tell you I’ve tried “the best pho in Manhattan” it has all been a true let down. I finally came here with my friend and it was the first time I had hope. The pho dat biet was close to my mama’s home cook pho. I heard everyone in the kitchen speaking viet too so I knew it was authentic and legit. I’m so happy I found my spot. Thank you!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3a1BLMlJ3EAE",
            "text": "Yummy. Beef quality makes up for slight lack of taste in pho"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3aHBhbWhRRRAB",
            "text": "the average pho restaurant. nothing impressive."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3bEptaG93RRAB",
            "text": "No, just no....So I had high expectations. Vietnamese workers - positive sign.  Very complete looking Vietnamese menu -- even better positive sign.  But their dac biet pho doesn't have the traditional tripe or tendon so I should have seen that as a sign of their true quality but I ignored it.  Alas, everything very bland.  Pho broth was not aromatic at all. I shouldn't have expected too much considering they cater mostly to NYU students.  Just make the extra effort to go to Chinatown for the reat thing."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbGJXdWVREAE",
            "text": "Always a local favorite. Great tasting pho with a really generous portion of meat and noodles. Banh mis are really flavorful with fragrant bread, and at really low prices. All their dishes are really hearty and tasty. Service is fast and the taste/price ratio is genuinely one of the greatest ones around.\nI eat there A LOT, and hopefully one day I’ll finish tasting their whole menu.\nWhat’s not to love?"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNna29YdGhnRRAB",
            "text": "The banh mi here is delicious. The pho was okay, the broth could use more flavor."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnLU1XSWh3RRAB",
            "text": "I don’t know if my being in NY for 8+ years has skewed my taste for Viet food.\n\nI had the bun bo hue, and while the flavor wasn’t memorable - I’ll come back just because they speak Vietnamese."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBajdUVlB3EAE",
            "text": "Visited the place after class, food was ok but not only did they not bring me water until I asked for it, they also forgot to bring the rest of the food. No lime, no bean sprouts. I asked for no cilantro, but there was still small chunks in it, as someone who does not eat cilantro this ruins the taste of the food. It was early so the room not crowded, not sure why there’s not enough service."
        },
        {
            "date": "9달 전",
            "language": "vi",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBeWN6WXFnRRAB",
            "text": "Authentic Vietnamese\nBánh mì to die for\nRất ngon!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfaDc3TWhBRRAB",
            "text": "I had the bac diet (special pho). The broth was not good or fatty. Just didn't taste good."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdUwtNmpnRRAB",
            "text": "Delicious food with a unique flavor, very friendly people, and excellent service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdU9fSWxRRRAB",
            "text": "The rice was delicious!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNTZxVjRBRRAB",
            "text": "not bad"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNk5YV0pBEAE",
            "text": "Excellent Vietnamese food in the heart of the West Village.\nThe service is quick, efficient and helpful.\nThe food taste fresh. We tried the Pho and a pork noodle dish.\nWould eat there again."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcTdQNXdBRRAB",
            "text": "Decent price. Noodle soup is delicious. Pork chop with rice is good too. I have been there so many times."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmaXV2WEJnEAE",
            "text": "Having been across Vietnam, taste-wise, this place deserves a much higher rating than it currently has.\nHad an amazing Banh mi, went for the brisket option. Would definitely come back next time I’m in NY"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2enItYnZnRRAB",
            "text": "Great Canh Chua (Tamarind) Soup with Salmon. Come here all the time - affordable and delicious"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bHJ6dl9RRRAB",
            "text": "Don't sleep on this place. The pho is a like a warm blanket for your stomach. Bánh mi slaps too. Service is quick, portions are big. Been here many times, keep coming back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dUstRGN3EAE",
            "text": "When there's more Vietnamese than English darting across the restaurant, you know it's a good sign."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6c04tYkN3EAE",
            "text": "Such a cute spot! Perfect after such a warm day. The staff was friendly!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQeTREU2NREAE",
            "text": "Great food, fast pickup, and friendly staff. Their short rib phở is excellent"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQOHB6WG93RRAB",
            "text": "Forgot to take a photo but I was very pleasantly surprised with the Chicken Pho!!\n\nCame with lots of veggies and clear clean broth!!\n\nReally good."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQbU9UZ1BREAE",
            "text": "I was incredibly disappointed in this restaurant and made the wrong menu choice. I didn't realize Vietnamese ham (Cha Lua) has the consistency and taste of Spam. I am not a fan of Spam, so this ham didn't sit well with me. The rice crepe turned into a glutinous sticky mass and was highly unappealing. I managed to choke down the dish, but it sure wasn't worth the price. My friend's chicken and veggie dish was also uninspired with what tasted like boiled, bland chicken.\n\nThe service was unfriendly and rather slow - I think we waited 45 minutes for our meals. The noise level really got in the way of trying to have a conversation. My friend was very annoyed by the door slamming every time a patron came in and left. You had to walk down a long staircase to get to the bathroom, but it was clean. And I liked the beads framing the entryway to the staircase."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzc19McEZBEAE",
            "text": "Delicious pho that hit the spot. Beef ball was a little tough but very flavorful. Very sweet Vietnamese coffee that made for a good dessert. I look forward to returning to try more dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYejRIRDdRRRAB",
            "text": "The night I came here, I was surprisingly not in the mood for pho, but rather a noodle dish without any broth. So I tried an item from their menu, in the \"Hello Saigon Special Menu\" category. It was the \"dry\" noodles with boneless short rib, paired with the lemongrass sauce option.\n\nTo put it succinctly, I'm a child of immigrants from Southeast Asia, and grew up eating very authentic cuisine from that region, and I can confidently say that the rich, in-depth Vietnamese flavors in the noodle dish I had were equal, if not better than, something my mom would have cooked in my childhood. I will be a repeat customer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYOWRHbnlBRRAB",
            "text": "The water pressure in the bathroom is insane it's like the whole Catskills aqueduct flows through that sink."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYZ2ZPanVnRRAB",
            "text": "The Cha Gio eggrolls are perfect. I love it wrapped with the lettuce and mint which is the way to eat it and they don’t skimp. The clay pot chicken/pork with quail eggs tastes like home (mom’s) cooking. The pickled veggies with it is legit. My new to go spot. Can’t wait to try other dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYOTZubkZnEAE",
            "text": "Best pho with reasonable price made our day 😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbGZyZmVBEAE",
            "text": "$14 for a delicious bowl of pho (excluding tax and tip). I’ve tried pho places around but Hello Saigon was the best that I got for service, portion, flavor, and quickness. I got the bowl around 2 minutes after placing my order and it was very delicious. Would come here again!"
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3Mk02aFBnEAE",
            "text": "자주가고싶다. 국물이 먹고싶을 때 가면 좋을 듯 하다."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZbnFqd29nRRAB",
            "text": "예상할수 있는 미국의 베트남 음식점"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dFlMR1RREAE",
            "text": "The food was delicious and most of it well-cooked. The rice noodles were flavourful and honestly probably the most delicious ones I have had. However, they sticked together which ruined the experience a bit but do not let that put you off from trying that restaurant out.\nThe staff was friendly and welcoming and personally I would eat there again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbzhENzRBRRAB",
            "text": "I’ve reviewed close to 30+ pho restaurants Growing up around great Vietnamese food. The Bo kho here tastes like beef and carrot water. Lacks aromatics and flavor.\n\nPho broth as well was underwhelming. I’m pretty healthy conscious too so I prefer less salty (less sodium) broths. But this one just lacked flavor and was disappointing.\n\nVietnamese iced coffee was good though! But for $7.00 for this is probably pushing the upper range of price points. Food was edible but I wouldn’t come back. Maybe their other dishes are good (vermecelli and other entrees) but the pho and bo kho was meh so I’d expect their other dishes to receive equal treatment\n\nI’d rather spend $$$ at Madame Vo or Sao Mai and get more authentic tasting pho."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoaXZ6UHNRRRAB",
            "text": "FOOD\n1.) P1 Pho Hello Saigon =  includes flank steak, meatball, brisket. It was pretty good. Generous meats.\n\nSERVICE\nIt was fine\n\nATMOSPHERE\nIt’s like a regular Vietnamese restaurant but with a nice Brooklyn bridge mural. I like that it’s close to west village area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMb1o3dy1RRRAB",
            "text": "Hands down some of the best Vietnamese food! Their Jersey City location used to be our go to, but sadly closed, so we went into the city for their amazing food. As usual, it was delicious. The lemongrass beef vermicelli bowl, the pho, everything. A must try!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREdk8tMXh3RRAB",
            "text": "One of the best Pho i've eaten!\nSummer rolls were delicious also!\n\nEven though we ordered 1 summer roll appetizer for 2 people, they brought peanut sauce for everyone which I liked!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURld2MtMUV3EAE",
            "text": "Nice authentic pho with sliced beef. The broth taste just right. Went back a second time for banh mi and drinks. Definitely loved the traditional pork version with freshly toasted baguette. The viet coffee also hits the spot perfectly!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNU5QQ3FRRRAB",
            "text": "Cool Vietnamese restaurant in West Village. Would very much recommend trying the hot sour soup with young coconut. It's served with a small bowl of rice but it is also good to share. The pho Hello Saigon is also quite good and has three types of beef. The broth is quite refreshing particularly on a cold day. For starters, the vegetable spring roll is quite nice and comes with a sweet and sour sauce. You get a lot of value for money with their dishes, which are quite filling."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKNF9EQVpnEAE",
            "text": "Wow, found a gem of an authentic Vietnamese restaurant in the west village, and wish I tried this place sooner! Ordered the grilled chicken over rice and it was really good. My viet gf said it tastes exactly as it does in Vietnam and I devoured it.  It was juicy thigh dark meat and marinated and grilled to perfection.  My gf ordered the Bun Bo hue and really liked it a well.  The fresh coconut and creme brulee dessert rounded out a wonderful meal and we will definitely be back! Highly recommended!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBaHJqMjJnRRAB",
            "text": "The steak with rice was really good.  Enjoyed it a lot.  The Pho was delicious.  The only thing is there was no jalapenos, bean sprouts etc to add.  The soup was prepared as a whole dish.   I enjoyed their fish sauce.  Definitely a place to try.  If you like Vietnamese food definitely give this place a try."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWc3BQNnJnRRAB",
            "text": "Great Vietnamese place up at the top of the West Village, on Bleecker. They have an extensive menu of different dishes, with various banh mi, pho, rice, and vermicelli dishes. We decided to get the shrimp and avocado summer rolls for an appetizer, which were delicious with large chunks of vibrant green avocado, not overripe. Then for entrees we had a curry vermicelli with shrimp, and a Pho Hello Saigon, which was delicious with four different types of beef. I was very satisfied with my birthday dinner and I would definitely return here for Vietnamese food."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjbGNiZlBREAE",
            "text": "They are open for delivery/takeout\n\nVery good, authentic food, at reasonable prices. The service is fast. I love their lunch special menu with many variations from the usual dishes, especially the grills.\n\nMy favorites are the banh my (sandwich), cube beef, chicken soup, the calamari, lollipop chicken wings; flan and coffee.\n\nThe staff are very friendly and helpful.\n\nPlus, this is quite an interesting place: you can take your date here, have a company/family lunch/ dinner, or a birthday party. They are very flexible and fast in organizing the space. Both of the food and decorations inside make me feel like home.\n\nThey accept both card and cash."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdklXSFpBEAE",
            "text": "The bun bo hue broth is 👌 I have had bun bo hue across the country in various destinations. I have traveled far and wide in search of great bun bo hue. And this one, I approve. $20 for a bowl after tip and tax. Not crowded on a Sunday for lunch. Good for groups no larger than 6."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyX0xPN2l3RRAB",
            "text": "Good food! A little pricy for the amount we got. We paid $40 each for 2 main dishes, appetiser, and 2 coconut water.\n\nThey definitely have some very local dishes. Good to try"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcmNmUXpBRRAB",
            "text": "If you grew up with new thanh hoai in jersey city this place will be completely familiar. Some familiar faces running the place and the same exact flavors, that is to say, still tastes amazing! Their cha gio is the best (add a bit of hot…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbDRqS09REAE",
            "text": "Simply a scrumptious banh mi, one of the best I’ve had. The bread was still fluffy and fresh a bit past midday, and my expectation of a slightly dry sandwich was decidedly disproved. Decent value for the large size of the sandwich; I paid $12.50 in mid September 2024 for the special ham banh mi."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBcUlUSFdnEAE",
            "text": "Service was fast and food was good! I enjoyed the pho with grilled pork chop and the spring rolls but I was expecting more flavor from the summer roll. Definitely would go again tho. I didn't see it on the menu - we were told about it mid meal from the manager (?), but next time I'd love to try the short rib pho."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6dnVIMmhnRRAB",
            "text": "Very good pho!! The iced Vietnamese coffee is good too! Very strong! The steam rib pho is very good too!  Will even be better if they have the bird eye chili or chili padi"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbXNLZmlBRRAB",
            "text": "Resto is FULL and profiles of guests are mixed—students, professionals, tourists, families. The pho was comforting and delicious. We tried the beef brisket and grilled chicken. The Vietnamese coffee was STRONG. The Thai milk tea was like dessert—it was awesome."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtNHBDNUpnEAE",
            "text": "Pretty good food - liked the pork spring rolls and the pho broth was alright. Nice amount of rare steak in the pho portion and the meat is tender (not too thick or thin), but would prefer a more savory flavor in the broth.\nThe noodles weren't quite right in the pho, they kept breaking apart and were gummy. The texture was just a bit off.\nStaff were nice, place is clean, and plenty of seating inside."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwNjRTSkJ3EAE",
            "text": "Stumbled upon this place by accident and was a pleasant surprise.\n\nClean, tidy, warm atmosphere, friendly and helpful staff speaking in both English and Vietnamese (southern dialect).\n\nGood portions, so so fresh!  Try the bun cha/nem, it's delicious! The pho ga was nice and slightly modernised with so many large chunky veg.\n\nThe cafe sua da (iced coffee with condensed milk) is 100% Hanoi style and oh my god, taste of home!!! 😍"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvZ1lEdC1RRRAB",
            "text": "We walked in party of 2 around 5:00pm on a Sunday; no wait. We ordered food at 5:05 got our appetizers at 5:10, entree at 5:20. Every item super delicious and worth the time looking for this gem. We are veggie lovers and found each veggie cooked to die for.\n\nOur service was good. Proper refills etc. Wish we had this location uptown."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxa3YtdGR3EAE",
            "text": "Don't expect some fancy service or ambiance here. This is a no-BS straight-up good pho place. Their pork fried spring rolls are out of this world as well."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNndjgteHZ3RRAB",
            "text": "Wish I could rate higher. Walked in with my grandfather in a wheelchair. The server helped get him out, sit him and place the chair somewhere. The following food service was on point and the food was amazing. I had a rice vermicelli bowl…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbU55ekZnEAE",
            "text": "I ordered the spicy pho. I was a bit shocked at the meat. I got beef chunks with the tendon and the skin(?) Still attached. It was a bit too ofal for me. I didn't think it was spicy either. I should have ordered the regular and just added the siracha to it. The price was fine$16"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0ejd1VFNREAE",
            "text": "My family and I loved their location in Jersey City. Unfortunately, it closed and we took the time to visit this location because we knew it’d be worth the trip. Wishing the owner and staff the best of luck!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxb283bVVnEAE",
            "text": "Decent place to get a casual Vietnamese meal. Bún bò Huế was delicious. Not too impressed with other things I ordered. Nice staffs. Overall, 3.5 star for service and food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtdFA2LW5nRRAB",
            "text": "Fast service and delicious pho.  They give you plenty of Thai basil as well!  If your in the area…it’s worth the visit.  If you like more meat in your pho I suggest getting an order or Tai beef on the side.  I quick dunk in the hot broth and you will get a nice medium rare.   So yummy!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBa2QyTUpREAE",
            "text": "A friend and I came in on a Saturday night at around 7. The place was pretty empty, but it was also MDW, so maybe that was the reason why.\n\nTo start, we ordered the Vietnamese pancake with pork and shrimp. I wasn't a huge fan of this because I thought it was a bit dry. Maybe they overfried it? My friend seemed to like it though. For entrees, we both got the spring rolls over vermicelli and we really enjoyed it. This dish is usually my go-to order whenever I go to a Viet spot. While it's not the best, it was still pretty darn good. The menu items are slightly more expensive ($1-$2) than the Chinatown or Brooklyn spots, but you can't really compare, given its location. I wouldn't mind coming back and trying some of their short rib pho.\n\nTip - HH is all day on the weekend: $4 beer and $6 wine (skip this, it's pretty terrible)."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdllYbDd3RRAB",
            "text": "Pretty good pho. Not the best I’ve had, definitely not the worst. The portion was a little small (I ended up getting a full 2nd bowl). Food came out in under 3 minutes so if you’re hungry and in a rush this is your spot."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwNlpqdzlBRRAB",
            "text": "My favorite place for Pho in this neighborhood, better than the always a wait line Saigon Shack. My favorite is the Pho with grilled pork: for $9 you get a bowl of soup and grilled pork, a stealer for sure. The special Pho with the rib is…"
        }
    ],
    "reviews_count": 82
}