{
    "name": "Negril Village",
    "place_id": "ChIJ57MmsJFZwokRpjsY3y4xzdg",
    "grid": "MN2",
    "address": "70 W 3rd St, New York, NY 10012, USA",
    "rating": 4.3,
    "user_ratings_total": 2737,
    "phone_number": "(212) 477-2804",
    "reviews": [
        {
            "date": "2시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGdldrczVPWHBvWm5wWlZsQnNWVFJ1VFRCUlYzYxAB",
            "text": "Came with a large party on Halloween and they were very accommodating. Excellent service at the bar and table. Music was great upstairs. Well managed and friendly. Food was excellent, almost ate everything off the menu. No complaints!"
        },
        {
            "date": "6시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUlpGZE5lRTFtYlRKT1JHNDNWVTg0WWkxdVpVRRAB",
            "text": "I found a place that makes me excited about eating out again. The price matches the generous portions, excellent taste, and attentive service. Workers provide service with genuine kindness and no ego. Negril Village delivers on both coolness and staff quality. The restaurant provides excellent service."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOaFRWOWllbVpGYkd4WU9GazFlRWhyTjBaV1RsRRAB",
            "text": "This restaurant strikes the perfect balance in everything. Restaurant workers offered outstanding service as well. We walked in randomly and were glad we chose here. The plates are loaded with good food. This restaurant should be your next meal out."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZdFZWVnhRMDVOYm5wMWIxTlRRa0paVEVWVWIwRRAB",
            "text": "Loved it!! Good music, amazing food."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21adFVrWk9UR05FTjNwaWJGQk9WVVJqTW1aZldrRRAB",
            "text": "Amazing food, service and atmosphere!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xT2JHeERiWGx4UlVGNFZ6TnpYMWRyY1hJMU0zYxAB",
            "text": "The empanadas and Mac n cheese are my favorites but I also enjoyed the rice and peas and my curry chicken. The service was great and the atmosphere was all you could ask for. Overall, 8.7/10!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GbFVVSnhOVUk1TTNKeGNEWlhkMHBVTVdnNGQyYxAB",
            "text": "The kitchen team and wait staff both excel at their jobs. I wonder why others rated this restaurant poorly. The dishes are excellent and the setting is appealing. This establishment demonstrates exceptional expertise. Without a doubt, I'll be back soon."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMFRESlhha0ZuTmtobU5FVjFkazFpU1VOM1dWRRAB",
            "text": "Negril Village SoHo – A Night to Remember! 🌴✨\nWhat a vibe! I stopped by to see my good friend, the owner of Negril Village, celebrating 25 years in business! The ambience was stunning downstairs lively, upstairs pure chill with candles and plush pillows. The food? To die for! From empanadas and jerk wings to codfish fritters with avocado sauce and warm cornbread muffins every bite was perfection. My mango piña colada and house drink sealed the deal. 💛 A true taste of culture, flavor, and Brooklyn legacy right in SoHo!"
        },
        {
            "date": "2주 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210d2FEVjFTR2R0ZEhwd1VqZG5MVlJMYXkxWVNGRRAB",
            "text": "I love Sénégal clothes new style Sénégal clothes"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WFpFb3pOMk5NZUhBeWFtSnNjVjlxVGxOS2RVRRAB",
            "text": "Renae - Thank you for the great service!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GZlMwdGxOV0p4TjNSNFNXVlhabmt0U1RaRGNIYxAB",
            "text": "A great place for an intimate birthday dinner."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4MFlWQnFSbWsxVUV4TUxXdElVa1phVlhobmIwRRAB",
            "text": "It was my first time trying Caribbean food, food was great and staffs were nice too"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnemRrdFBha1JxTFdVdFoxWTBPVGRmUlhkV0xWRRAB",
            "text": "Cool atmosphere and beautiful design. The Jamaican dishes were tasty and well presented.\n\nPrices seemed a bit high from our perspective, but maybe that is typical in the US.\n\nUnfortunately, the waiter service was not great that day, which affected the experience slightly."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NNFVrSjJVWE16ZUhWTlowcG1VVFpCZG1kVlRWRRAB",
            "text": "I choose Negril Village time and again. The team members joke and laugh with customers. Their cooking is simply excellent. You'll admire the setting and the selection of dishes. I'm drawn to this place and you'll be drawn to it too."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sYVJHUklNVEF4Umtsa2NqSktUVU5oVkVNdGJrRRAB",
            "text": "Renae is amazing! She provided great service and made us feel well taken care of. Jermaine also was great and checked up on us. We will be back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kZllUaFpMV3BPUld0WVdubG9iR0pJVkZGNFNIYxAB",
            "text": "Renae was great!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGS2EzSjJWbmhsWkdVeGNHaFJhSEZ2VVdsbFJsRRAB",
            "text": "Renae was an amazing waitress, very welcoming atmosphere, great time and great food and great vibes!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRE5EVnRiRzl1TkZseGJXaDRWalpzYkdsdlltYxAB",
            "text": "Renae was amazing, so sweet and delightful. She made the experience worth it."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tScVZHTlBZbVUyVW1sSGVWTlJNMVJSVEdreFFuYxAB",
            "text": "Renae was amazing. She was so sweet and the service was great. The drinks were flowing and Jermaine was also great. Loved my experience and can’t wait to come back."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25STGVscE5PSHBSUkMxd1dXSlpVakF4Y0VGSlVuYxAB",
            "text": "⭐️⭐️⭐️⭐️⭐️ Jamaican food done right!\n\nI visited Negril Village in Brooklyn on a Saturday evening and had an incredible experience from start to finish.\n\nFirst off, the ambiance is amazing — vibrant colors, stylish decor, and that warm, welcoming island energy. The space is photo-friendly without feeling overdone. We sat upstairs, which gave us a great view of the bar and the whole restaurant. Chill reggae played in the background at just the right volume, setting a relaxed and inviting vibe.\n\nNow for the food and drinks — absolutely delicious! The rum punch is a must-try: sweet, fruity, and made with authentic Wray & Nephew rum for that smooth yet serious island kick. We started with the oxtail egg rolls, and wow — these were the highlight of the meal! Crispy on the outside, tender and flavorful inside, and bursting with perfectly seasoned oxtail. You only get three per order, but they’re so good you won’t even care.\n\nFor entrées, I had the Oxtail Rasta Pasta, which was rich, creamy, and full of flavor. My friend ordered the traditional oxtail dinner with rice & peas and mac & cheese on the side — everything was seasoned perfectly and served in hearty portions.\n\nOur server, Anthony, was wonderful — friendly, attentive, and genuinely welcoming, which made the experience even better.\n\nIf you’re looking for authentic Jamaican food with great vibes and top-notch service, Negril Village should be at the top of your list. I’ll definitely be back!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFd1gwSnNNa0pLWTNSc1owTlFUbU4xZUhOQ1FXYxAB",
            "text": "Jermaine was amazing!!! He was attentive and super nice!!! Me and my family love coming to Negril!!! Authentic Caribbean cuisine that is absolutely delicious!!!! Highly recommend to all cultures"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMU1UQndRbmN4YUc5V1lrTlBXRmR0YUU5TVQwRRAB",
            "text": "Jermaine provided great service !!! Great food!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdmFVeERla05QWWxoVGFEVkViVlo2TW5adkxWRRAB",
            "text": "Jermaine gave excellent service. He was very patient and kind and was able to give us all the information needed for the night.  Not only was he a very good server and professional. He also gave us a touch of home with his Jamaican touch."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201b1UzRlRkMHhXY0dSc2FpMWlTMlZ5VTJKemMwRRAB",
            "text": "My family took me here for my birthday.\nGood food, good vibes and good music. The waiter, Anthony was exceptional."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KRVZGUlpOMHQwUnpsUlltOUVjR0p4TWsxa2JWRRAB",
            "text": "Renae was amazing the food was so good service was fantastic no complaints will be back for sure once again thanks Renae for great the great service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WUmRHOXdOa1p5ZVV0WFEybFNUbU40TTJ4dmNHYxAB",
            "text": "Jermaine was very helpful and has great customer service. Will definaletly come again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKa2JVVnZkVmg2VEZwMWNHUndNRGcyU3pOUldHYxAB",
            "text": "Renae was excellent and the food was delicious. Amazing service and great experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKSFIwZENiUzEyYmtKd1oyNDFjbkYyUWxKb05sRRAB",
            "text": "Renae was phenomenal!! She was friendly and gave me an awesome food recommendation!!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWlFsUkNlSGhWVldOMmFtWktlbXczZFhseFpFRRAB",
            "text": "My bestie and I went out to celebrate my birthday, and Renae was an amazing server! She was so attentive to our needs and made the experience extra special. We really hope we get her as our server every time we visit."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRGFuRjJUa3MzZVdOd1RHeFJWa0ZvYkVadmJrRRAB",
            "text": "I had an incredibly authentic experience and meal at Negrils for my step Dads birthday.  The aesthetic pays homage to Jamaica. Curated beautifuly. The food - so many great options on the menu! I got the Jamaican breakfast and it hit so close to home. We also had the deviled eggs, codfish fritters, and the jerk chicken.  They all hit the spot. No store marinde here.\n\nAddy,  our waiter was so divine, truly attentive, transparent, and impressive.\nWe shared the rum punch carafe and my goodnesss, the best! We forget in this big city the classics that stay around, but they're here for a reason. Show some love and you'll have a great experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WalFVaHRhRWd4ZFRNemNrRkdabTFuYjFaaE5GRRAB",
            "text": "Renae was amazing. Friendly and super accomodating. The whole vibe and staff were so welcoming and the food and drinks were awesome. Everyone who  I brought said they will be coming back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dVFsUm9hR0ZxZDJOVlFtc3hUR0pRU2xGU1JGRRAB",
            "text": "Christina was very wonderful. She was very attentive super sweet. She made our night after a long day in New York.. The food was really good and very flavorful"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSc2EwMTVSblZmVDJGWmJFNURNUzFUTTFKNk9FRRAB",
            "text": "Ade was amazing! She gave us such great service. Unfortunately the food was terrible. It doesn't taste how we were used to. We are wondering if the chef has been switched because the food taste is way different, to the point where we called the manager and it was so many complaints in regard to the food 🙄"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JeVZuVjZRblUwZURjNGJXVjNObXBIZGpWUVYwRRAB",
            "text": "The food was mediocre and salty. Presentation was good and service was not bad. The wait time was moderate but music and vibe was slow given the time I was there which was Sunday brunch 3pmish. Recommend going with a crowd that matches each other energy and know what you would like to eat ahead of time. The Mac n Cheese was dry and maybe someone else would like that. I would not return. The drink was not it either, I didn’t finish it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5WE5YUnFNMGRKU0ZGb2FtUkJTa293UkRsQmNtYxAB",
            "text": "A bit pricy but the food is good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KSE9EZHhVSFZ0VkhneFZ6QjFSemhMTWxoaE4wRRAB",
            "text": "Ordered uber eats. A couple of the shrimp in the curry shrimp tasted weird, not sure if it was from the tails. The ones where I cut off the tails were fine. The curry sauce itself tasted amazing, although a little too salty for my taste.…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nemJFcElaVFJDTkdOM1kxWlNaMmsyTlRaSmFsRRAB",
            "text": "The people that work there are simply amazing- courteous and friendly. Got the sharing platter and was super psyched for all of it. The oxtail was delish, but a little light on the meat (a lot of bones). The curry goat was out of this world slamming. No lie. The jerk chicken..... Idk we might have caught them on a bad day but it was like charcoaled burnt. We did get a new potion served, and when you got past a certain part of the skin, the flavor was better but we were kind of disappointed with it. But let me tell you, the cornbread with the guava butter?! Dreaming about that! Rum punch was flavorful."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KNFdXeEVjbFJxVFhjNGQwVjNXRFkzTmw5b09HYxAB",
            "text": "The food portions just doesn't justify the high prices. For $29.00 I was expecting at least a decent sized portion. I ordered the jerk chicken and honestly it resembled a half anorexic baby cornish hen which consisted of very little sauce on one side and the other side was dry with no sauce. The rice and peas were mushy. I opted for collard greens instead of the carrots but my meal arrived with two slithers of carrots anyway and no greens. Due to the heat level of the chicken I asked for more water which never came. I also ordered the downtown martini which tasted like straight mango juice. Although our server was very nice she was also forgetful. They also automatically add a 20% (not 15% or 18%) gratuity  to your check no matter the party size, which is a turn-off in itself. IMO it just didn't measure up to any good/great standards. I wish them all the best."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kamNYb3llVkZqY25GM09YTnBVWGhDVFZKTFFrRRAB",
            "text": "This place is a gem!\n\nFood: We got the Oxtail Rigatoni and Jerk Chicken with rice and beans. Incredibly delicious!! The food was incredibly fresh and tasty, even after 2 days in the fridge after we took leftovers, it tasted really good.\n\nDrinks: Marvarita was really good, sugarcane spritz was warm and not very good, you can pass.\n\nAtmosphere: We went at 5pm on a Sunday, there was live music, hilarious singer who complemented people sitting around.\n\nService: 11/10. Barbara(the owner) is lovely, she came and said hi, chatted with us and even took our order. Our server was Anthony, delightful man, felt like he was a cousin. we felt like we were so welcome and KNOWN in the restaurant.\n\nPricepoint: ridiculously reasonable esp being in Greenwich.\n\nThis will be our go to Jamaican spot from this point on."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsdlptVk1TWE5UVjJZMWMxYzJUVmxET1dKTE5WRRAB",
            "text": "Went Friday night. Sat downstairs in the lounge area where they have a live DJ!!  Amazing experience.  It wasn’t too  crowded.  Wait staff was very attentive and smiling. The food was so tasty omg really good drinks. The music was nice. Not so loud that you couldn’t carry on a conversation. We really enjoyed it and are making plans to go back. We loved it so much we ordered seconds to go!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsS1dGcFFRUzB5ZFcxYVpuaERSV2RrWW01UmRHYxAB",
            "text": "I have not been here in over 11+ years used to always come to go to the party that we have downstairs on Fridays and Saturdays and back in the days you used to come here to eat. The food was always on point. Yeah it can be a little spicy, but it’s definitely always been on point cook fresh atmosphere is dope, clean welcoming and I want to thank The server: Renae for your Your patience, your kindness, and your ability to be on point with the menu inside up your appreciated…."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaZlFXRkpVMGhPU1ZaSVVWZG9ZMVJCWkVSeWJYYxAB",
            "text": "Great service and delicious food!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ocVlscDZRVk5aV0docGFtRjBhMEoyY1VSS2JGRRAB",
            "text": "It was was really nice. The vibes were really cool and the DJ played the right tunes. The bartender was a good mixologist. As for the food it was delicious. Highly recommended for a Friday night chill spot."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKU2NXRktWblpETTBWc09XOWpibVJDTmpOaWNuYxAB",
            "text": "Food always good at this location highly recommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21acWVraDRRM2x0Y0U4ME0zSjNSMlp4V0ZCYWJIYxAB",
            "text": "This use to be my favorite restaurant however the food has changed, the quantity is too small for the high prices."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CQk9DMTZRUzB6Vkc5bVZUTm1OREpNYmpGR2VtYxAB",
            "text": "Negril Village has a really nice space—definitely a little dated, but they’ve been around for a long time, so that comes with the territory. The greeters and wait staff were excellent—very hospitable, courteous, and helpful.\n\nThe food, however, was just okay for the price. I don’t mind paying $50 for a plate, but it has to taste right and be an ample portion.  The portions were on the smaller side and only a couple of people took food home. The ackee and saltfish was tasty, but the rice was very mushy and clumped together instead of shelly and loose the way rice and peas should be in my opinion. One relative commented that it didn't taste fresh. Another said that the Flavor was decent, but texture was off. The salmon was good. In addition, my aunt's meal was supposed to come with asparagus but she received broccoli instead.\n\nMy family didn’t care for the chicken and waffles—the fried chicken had way too much breading. (Granted, it’s not a Jamaican dish, so I don’t know why it was ordered from a Jamaican spot anyway.) The jerk chicken was just okay—edible but not memorable. On the plus side, the piña colada and mango punch were delicious.\n\nOverall, nothing was really bad, but nothing was amazing either. I’ve been to hole-in-the-wall Jamaican spots where the food was more exciting, flavorful, plentiful, and half the price. For Negril Village’s reputation, I expected the best Jamaican food in town, and it didn’t quite deliver. I can't say that I'd go back.\n\nAnd one last thing… when it was time to pay, the server informed me that they do not accept Google Pay or Apple Pay. Really? In 2025? I had planned to use a specific card stored in my phone to earn points, but instead I had to dig out my physical bank card, which was not my intention. I would have appreciated being informed of this policy when I made the reservation. Very disappointing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WbE5ubGtWVTVaTms4eFRuZElRV1IzVjJOWWJrRRAB",
            "text": "Incredible food! Great atmosphere! Our server Chelsi was so lovely and gave us some great advice on the menu! I particularly the pumpkin and oxtail soup! Incredible! Would recommend to anyone looking for excellent food with a great vibe!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ObmVYRTFYMHhSUTFaR2NuTnZkV1E1YW5OSVUyYxAB",
            "text": "Yesterday (8.22.25), I met up with a few business owners for a strategy meeting. Our server, Anthony A. brought back great, wholesome service. He was mindful, patient and enhanced to a relaxed atmosphere for a meeting of the minds. I can’t forget the Lounge’s bartender, Bo (sp?) -he was wonderful as well."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNE1UTkhjM1JZVW0xa2QxWTRVbEJ2YkV3NFpWRRAB",
            "text": "Most of the food taste good. We didn't like the jerk chicken."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkTlEyVmZhREpxT1ZORFptaGZabTR4Um5CcU9VRRAB",
            "text": "We had only an hour  for dinner before hitting the road; Our waiter( Linden) took quickly our order and the food came out fast.\nThe place has nice vibe and the food was good. Highly recommend Negril Village"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQYlhwTDNleW9YS093EAE",
            "text": "Negril never disappoints! As returning customers, we were once again blown away by the bold flavors, vibrant atmosphere, and warm hospitality. The food always hits—fresh, flavorful, and cooked to perfection. On this visit, we were thrilled to see they got their liquor license back, and every drink we tried was smooth, tasty, and perfectly crafted. A special shoutout to Anthony, who remembered us from our last visit and delivered exceptional service with a personal touch. Highly recommend Negril if you’re craving amazing Caribbean food and a laid-back, welcoming vibe. We’ll definitely be back again soon!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKRVRuQnBaMHN6UVVaSFlWSXhkblY0Y21sbFZtYxAB",
            "text": "Ok folks, this was a 10/10 highly recommend!!!! Food excellent, service excellent, atmosphere great. It was a Thursday is happy hour all night and drinks were deliciously amazing. Will definitely visit again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aaFQzcHplR0l0YUdWTVRXWllXbUp2VG05alEwRRAB",
            "text": "Wanted some Jamaican food so I came here for dinner while visiting New York. Ordered some mocktails, jerk chicken wings, ox tails and festive. All were really good! The jerk wings had a good spice to them and the ox tails were flavorful.…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rNU9XSnhhVXcxTTIxc1VtNVBiRnBMYlU5cVkzYxAB",
            "text": "Amazing! The food was fantastic, the service was exceptional. Ade was so great and kind. They didn’t have the specific drink on the menu that I wanted and she was made me it for me!! Will definitely be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaTh2VG9RRRAB",
            "text": "Overall, not a bad place but overpriced for what you get. I do not recommend coming here. There's much better Caribbean food elsewhere, especially uptown.\n\nThe jerk chicken was nice and spicy but a little dry inside. For most of the food here, it's a bit overpowering on the spice (rather than a careful cooking for the texture) so you're not a spicy food person? You may not like the menu.\n\nThe server was friendly and knowledgeable. The hostess had a lot of attitude. I arrived at 2:00 p.m. and the place was completely empty, but she acted like the place was fully booked. We had a reservation confirmed.\n\nFinally, there was something weird going on with the music. It would stop every now and then and the volume would fluctuate two notches up and down throughout the song. Kind of strange. The music gave it a nice upbeat vibe but also rendered a place. Not as great for intimate conversations."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNTFFxUFNqeElQRlF3EAE",
            "text": "The food is always great!!! The vibes are nice here the staff and waiters are very very nice and attentive. I always enjoy my self when I visit."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNRFNnZENnelBTUWt3RRAB",
            "text": "Christine was our server and she was kind, gracious and inviting.  She helped us chose our dishes and the food was magnificent. We will definitely be back again soon."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toelJESXdiMGRLWDA5TFZFMTVZM2xXU1ZkU2JsRRAB",
            "text": "One of the best Jamaican restaurants I've been to on the East Coast.  The Ackee Tostones and Calabash Stew were on point, very tasty.  Very nice spot, good music, very friendly staff."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOYnZuOGlOc2FENldREAE",
            "text": "The service was so good! Our server Renae was amazing and personable. The food is always delicious! 10/10"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NUlieHN3RRAB",
            "text": "The jerk wings were amazing definitely spicy but tasted authentic. The curry goat was amazing as well and the rice and peas were amazing. I would recommend this place but please prepare for the spice lol."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNUplOTJ3RRAB",
            "text": "The vibe was great and everyone working there was kind and helpful. The food was also really good. You have to try their cornbread muffins with the guava butter! We also shared their oxtail empanadas which were good. I had the esco fish which was good but they could’ve seasoned it a bit more authentically, however, I devoured it 😂. My friends also enjoyed the jerk chicken and the herb salmon. Their mocktails were good as well which we had as they weren’t serving any drinks when we went"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNSDJsY1BQOUtmNF9nRRAB",
            "text": "I had the best night out with my friend here for our birthday 🎂 dinner 🍽️ the staff here was amazing and they made our experience amazing. Our servers Cristina & Jermaine were super friendly and accommodating!!!  Definitely will come back !!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSMHRLVE53EAE",
            "text": "It has been years since I've been here. They switched it up and the atmosphere is inviting and welcoming. Our server was awesome and knowledgeable in regards to choices and service. The food was dynamic and the portions were good. My only complaint it's that it is BYOB. It worked out because they have a liquor store around the corner. The selections are minimal but if you get some rum the restaurant rum punch is good. Definitely plan on going back soon and bringing the family with me.\n\nThe codfish fritters are delightful\nThe spring rolls are delicious\nThe oxtail with the peas and rice stellar.\nMy friend enjoyed the fish as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0cE9mZzlnRRAB",
            "text": "This place is both 💲💲💲 and 🔥🔥🔥. Atmosphere and service were fantastic. Food was even better. We shared the appetizer tasting plate and entree tasting plate. Everything was fantastic. From cod fritters to oxtail and everything in-between. Perfectly seasoned. I would go back again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twdFduTlRaMEp2VkdKNU1qbGZaelJFUWtGRGVXYxAB",
            "text": "Welcoming from the moment you walk in. The setting is a vibe, great service and delicious food. Definitely recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5eTgySGhnRRAB",
            "text": "Negril Village is an absolute All Time Favorite Caribbean Restaurant located in the heart of SoHo and has my heart always 💚🖤 🇯🇲\n\nI’ve had some delicious food & amazing memories since 2016. So proud that they have survived the pandemic and it has only elevated each time I visit.\n\nThe oxtail with rice 🍚& beans 🫘 is always a must, Jerk Salmon 🍣 is an great healthy option and I love the Curried Lobster 🦞, Shrimp 🍤& Salmon with Jasmine rice.\n\nI highly recommend that you get the Sorrel From the source (BYOB, No Alcohol is served) and I’m sure any of the drink options is amazing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNULTVEUEpREAE",
            "text": "I love this place ! The food was 10/10 the oxtail soup is definitely worth the try. My servers name was Andre ( I think ) but he was great attentive to everything even let me meet the chefs to give them their flowers. As a born and raised Jamaican give this place a try ! It’s BYOB , but trust me the mock tails they make are amazing you add your own liquor and there is your cocktail !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUOUpfLVlBEAE",
            "text": "So where do I begin? We had a 5 o’clock reservation for my husbands 50th birthday. The restaurant opens at 5 but allowed us in ten minutes early because it was HOT outside. We were seated exactly at 5. We had our drinks with in 15 minutes as well as our orders placed.\nThe ackee & salt fish tostones & jerk shrimp are THEE best option on the menu although all are good. We ordered mango daiquiris which were really good. Our main dish was the Curry Lobster, shrimp & salmon roti. I’ve never had food so tasty. We added sides of rice & peas along with mac N cheese which was really good. For dessert we had the passion fruit cheesecake & the black rum cake. Fellas let me warn you, the rum cake will make you stand up! The food was great & the portions were worth the money. We ended up taking food home! Also our hostess/ server Linden was very inviting & provided great service! Thumbs up Negril village!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGTE0wWmhaR3hrWTNGYVVtOUdjbWRvVjJNMlRtYxAB",
            "text": "Great great spot.\n\nHosted our Black ERG’s annual dinner here.\n\nThe hosts were attentive, food was great, music was vibes.\n\nRecommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJNFRtOHlXRGhyY1hodmIwNTBWRGRKTjFkMFlYYxAB",
            "text": "Other than service time from ordering to time food came out was a little long but the server was great 👍  Food was excellent 👌 😋"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOenY5ZjZwdF96WUR3EAE",
            "text": "Waitress Renae was excellent. Mom and I both had the rum punch and escovitch fish and it was amazing."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOUFhwc2l2NXJmZVhREAE",
            "text": "Food was amazing. You must try their jerk if you like spicy Caribbean food. Lots of Caribbean herbs and flavor.\nComfortable seating in the dining and lounge areas. Attentive staff and great music. We enjoyed everything about our visit. Can't wait to go back next time I'm in New York!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNEpYbXFRRRAB",
            "text": "I thoroughly enjoyed my meal (cleaned my plate :o). The appetizers were yummy too, I had to give the garlic butter its own pic. We were celebrating my daughter’s birthday and they remembered from my special note in the online reservation made. That was thoughtful. There was a charge for the dessert they brought out, which was fine… it was also delicious. They do not have a liquor license right now which they remind you of at the door. If that’s something you desire or need, plan ahead. There is a liquor store nearby and you are charged a bottle fee. See their website or call ahead. Our server was pleasant and personable. After ordering, our food was perfectly timed. The restroom was clean and there was a lovely attendant on duty (tip her!) They also had a photography team in duty for photos for a fee. This was Easter so not sure if this is the norm. Lastly, the music was fabulous."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCa0pPN3JRRRAB",
            "text": "Everything we ate was delicious, from the seasonings, to the presentations, and portion. We had jerk wings as our appetizer and jerk salmon and curry shrimp as our main dishes. Our server was very attentive but not overbearing and did not rush us even after we finished our meal and chatted.  The establishment is not currently serving alcohol but even so the food, atmosphere, and service made up for this! Lastly, the venue is gorgeous with two floors of a vibey tropical theme. I can see this being a spot for weekend events and being a hot spot for local young adults. Would def come back and recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKSlJYQlNObkpvVldSVWJHMXJUV2hNV0ZWdVkyYxAB",
            "text": "I happened to be in the city for a night and,  took the time out to support my fellow Jamaican. Well! The food, the food, the food was Exceptional. I had the Curried lobster and shrimp with rice and broccoli. Gosh! Not to exaggerate but it’s the tastiest food I’ve had in a long while, the rum punch was on point with a hint of pimento spice. The atmosphere  was just what I needed not to mention we just celebrated our Independence . Lauren was a breath of fresh air and genuinely Jamaican caring😁. Christina with the very familiar face was simply amazing. Thank you guys for the warm embrace, yummy food and great drinks. I’ll be back soon!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5VlN6WkZiREppYVZOWE4ySkhNM0ZTWjBrMVZYYxAB",
            "text": "My sisters and I took a day trip to NYC and ended up having dinner here. We were starving, so my sister and I shared the tasting plate—and let me tell you, it was so delicious! Everything on it was amazing. I also ordered the mac and cheese (10/10) and the cornbread (10/10). I would honestly say it’s the best Jamaican food I’ve ever eaten.\n\nThe only downside was the wait—we waited about 40 minutes for our food—but honestly, it was worth it in the end. I’ll definitely be coming back the next time I’m in town!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQUzAzcHo3M0plMkZREAE",
            "text": "Very nice atmosphere.  Drinks and food were good.  I just wouldn't partake in the oxtail special again.  They only give one big oxtail, and it didn't have any meat on it.  I would recommend ordering from the actual menu.  Besides that, the service the staff provided was amazing and very welcoming.  This place is good for date night or catching up with friends for drinks. They also had music. I went on a Friday."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaHEtbnZRRRAB",
            "text": "Renae was the best! Food was amazing and very flavorful! If in town please don’t hesitate to try!! :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMcy1pQ3R3RRAB",
            "text": "This place was amazing ! Anthony our waiter absolutely phenomenal. My husband took me here for my birthday in may and we came back a month later to celebrate our 8 year anniversary. The food was amazing. You can bring your own bottle and Anthony has the perfect recommendations for what to mix with."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXcHN2WjZ3RRAB",
            "text": "I really liked this place! Very nice ambiance, decor great vibe! Nice music, I like to keep it authentic. Oxtail stew and greens with rice and peas were my favorite followed by The jerk salmon. I could use a few more pieces of oxtail on…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLYURzX0dvckplRXJnRRAB",
            "text": "\"5/5 Stars!\n\nWe had an amazing dining experience ! The service was impeccable, and our waitress Renae   was absolutely excellent! She was humble, attentive, and made sure we had everything we needed throughout our meal.\n\nThe food was delicious, and the atmosphere was warm and inviting. We can't wait to come back!\n\nHighly recommend  for anyone looking for great food and exceptional service.\"\n\nCurry Snapper and Shrimp, Curry Seafood was lit !!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUaWJXX0F3EAE",
            "text": "Our party of two went to Negril this past Mother’s Day, and although we didn’t have a reservation we were warmly welcomed and quickly seated. Our server Christina came over and introduced herself. I don’t think I’ve ever had such a warm and personable server as Christina. What a beautiful spirit she has. By the time we left it felt like we had known her for years. She truly enhanced our dining experience at Negril.\n\nAnd the food? Spot on! We had plantain as appetizers, which were perfectly made. One entree we had was lobster tails with a side of grits. Another was chicken roti. Both were delicious with just the right amounts of seasonings. We also had some crazy delicious drinks. One was passion fruit and another I don’t recall exactly, except for the fact it was tasty and refreshing (that’ll be the white colored one in the pics).\n\nI love the vibe of this place. The music is at the perfect level, (not too loud), and the interior design is pleasing to the eyes. Way back when I used to frequent the old place on 23rd when I lived in Chelsea, but I like the atmosphere at W. 3rd even more.\n\nThe only reason I’m not rating Negril higher is because it took an unreasonably long time for our food to come out. We were told that our order had not printed out in the kitchen (or something to that effect). Because of the delay we were unable to make the next event of our evening and had to cancel and reschedule, which was disappointing. While the delay altered our evening plans, after we canceled the next event we were then able to relax more and enjoy the great dishes and environment. Gotta be flexible and roll with it sometimes.\n\nIn spite of the above, I’m looking forward to returning (largely because of the amazing service Christina provided), and have already been thinking about what to get next time! In closing I admired the professional, yet warm and personable staff, loved the great food, and just simply enjoyed being there. Give Negril a try, I’m sure you’ll love it.\nHighly recommended!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXcU5qOXNBRRAB",
            "text": "This place blew me away.\nIt’s definitely Caribbean food done in a classy way.\n\nThey no longer require masks to be worn & proof of vaccination. The decor has a modern flare with a touch of a green tropical feel.\n\nTheir food program seems pretty traditional. I felt like they had items on the menu that reminded me of what would be available at my grandmothers kitchen in Jamaica. The food was fresh, flavorful & delicious.\n\nDefinitely a great place to visit."
        }
    ],
    "reviews_count": 83
}