{
    "name": "The Dutch",
    "place_id": "ChIJ3RB9uI1ZwokRxCJXW-HpYZI",
    "grid": "MN2",
    "address": "131 Sullivan St, New York, NY 10012, USA",
    "rating": 4.3,
    "user_ratings_total": 2355,
    "phone_number": "(212) 677-6200",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWGNFNWFSWEZuVkZKVk4wcFJVRVkwVTBOblUxRRAB",
            "text": "Very nice atmosphere\nAttentive staff"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCc2VFdHBXa040WWs5TFRVZEdiMDQxYmpKQ1RIYxAB",
            "text": "Really enjoyed eating there. The food was great. The service was good location. Perfect. The atmosphere was very nice."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVd01FNUpaamhJU1VsYVJHTlNlWGx2T0V4SFUwRRAB",
            "text": "Do not eat here..all hype and cute but the food is really boring and over priced. I spend $30 on potatoes and smoked salmon. The potatoes are DRY like yucca rather than golden potatoes and the sauce they use it NASTY. The breakfast sandwich is wack …better food at a deli tbh"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxaWRXcHpaWGRLV1ZFNGVHbDFVbVphTVVwMldrRRAB",
            "text": "It’s alright. Food was alright. Service was alright. It was very loud tho on Friday evening."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21waE5WZzVkRWc0YkRFd04xcHhkVlY0TFdGUWNFRRAB",
            "text": "Had a great evening here. We were really hungry and the food was perfect."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRMmNYb3lRblJ2VVY5alluSkxkWEZaYlRsbE1XYxAB",
            "text": "the waiters guys😍 omfg"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCME5tYzRibnAyTm1SdWIzaFNRamxZTkdKR05VRRAB",
            "text": "I was very pleasantly pleased by this experience. The food was exceptional: very fresh oysters, well seasoned and tasty half chicken, and mouth watering butternut squash. And our sever Maggie was wonderful."
        },
        {
            "date": "2주 전",
            "language": "it",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJM2IzcHlWbVp1YWpkVVpIVXhiMlZPYUc5SlRVRRAB",
            "text": "Brunch della domenica da The Dutch a SoHo. Menù ricco con proposte classiche della cucina americana affiancate da piatti più particolari. Ho provato le loro deviled eggs con ripieno di granchio e i flapjacks al burro salato e salsa di mirtilli. Entrambi i piatti erano più che soddisfacenti e ben presentati. Servizio un po’ lento e distratto (il caffè mi è arrivato solo dopo aver terminato il brunch e per giunto la tazza era piena solo per 2/3 nonostante i 6 dollari di costo). Ambiente forse troppo poco illuminato ma livello di rumore accettabile."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxd2NqWnhXWEZWUm1wdFNVYzFWMUZKVWxoUmJuYxAB",
            "text": "Solid food and service. Good amount of outdoor seating for nice weather days."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zdFNIaHZlbWRqU0ROcVMzZGFibGxRWXpGQlMwRRAB",
            "text": "I really wanted to like this place, but unfortunately my experience was disappointing from start to finish. Even with my reservation and credit card dining status, we were seated in back room while the front room with windows still were pretty empty, which didn’t set a great tone for the evening.\nThe food didn’t make up for it either — the steak was tough and rubbery, and the fried chicken was overcooked and really just tasted badly. For the price and reputation, I expected much better quality and attention to detail. There are many other restaurants in the area, this one isn’t worth trying."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMFpuQmthRXgwY0RRMVNtMVJkRlpHTjBaek4zYxAB",
            "text": "A solid brunch option - not the most unique menu but both plates we ordered tasted good and ok value. Fried chicken was tender and juicy, biscuits were fluffy, and the soft scrambled eggs were the perfect texture. Service was very efficient. Personally found the interior a little cramped and dark for brunch, but I think it fits the vibe."
        },
        {
            "date": "3주 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSdlVqTjNUMlU1Y1VwbWRHRnRSR2xYVGxjMVNrRRAB",
            "text": "칵테일 마셨는데 분위기 좋았어요. 달달한 워터멜론 칵테일 추천합니다."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SdFpIa3piWGR6WTFJMmJsQkllVk54WWpsV1FVRRAB",
            "text": "Great spot.\n\nOur waitress Maggie was very professional and helped us pick out a good selection of food. Aged burgers are a must."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTWNUWXhkMjF3WTFKeWFUaEVSbVpSWmtrMVpWRRAB",
            "text": "Very nice and cozy place. Their hamburger is maddeningly good, and the salty key lime pie quite amazing, too."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSaldrcGlMV1k1YW5GeFprOVFlV1ZXUlRKSmRFRRAB",
            "text": "A neighborhood vibe with fantastic service and great food. Carmellini has put together a menu with something for everyone even if you are looking for a suprise. Great bar scene, perfect for people watching and reliably the place we go to with our grown children or out of town guests. Chicken was delicious, pasta was fantastic. Desserts were new to us and the chocolate pudding (it might be something else but its pudding at its best) and the real winner was the apple dessert. Go figure."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRVdsVXRVMEZvVkdWTFR5MTFObVJzYlU5cWFXYxAB",
            "text": "Boring unsalted food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rd2NraDFWbGhqWjFZNVpEQmpNM0ZYZWkxMVJHYxAB",
            "text": "Great time. Great Burger."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vM1RWTTFPRnBuVWtOVk5IZFRaVzlFV0VWTFFsRRAB",
            "text": "I'm a regular at The Dutch, and it continues to impress me with its delicious food, attentive service, and welcoming ambiance. For a recent birthday brunch, I mentioned the celebration in my reservation, and at the end of our meal, our server surprised us by bringing over a dessert with a sparkly candle to wish her a happy birthday. Thoughtful touches like this are why I keep coming back to this neighborhood gem."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkRGQwRkVhWGsyVWxWNlRqSTVNbkJCY1VKSlVHYxAB",
            "text": "Beyond tired and…I rarely review but am because I feel I was taken advantage of. $36 for the burger with fries. The burger was bad. The burger at Gramercy Tavern (Tavern menu) is $35 and includes duck fat chips. The Minetta Tavern burger is $31, and its black label burger is $38. At Cafe Lux—a great burger—$28."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVWVYaFFXVjlsYzA5TVZrbFhVelpwTm0xT2QyYxAB",
            "text": "We stopped by for drinks last night. The drinks themselves were fine, but the service was shockingly unpleasant. For the full hour we were there, the bartender kept the tap running nonstop. When we asked why, he told us: “That’s how I make my money.”\nIt was wasteful and uncomfortable to watch, and when we mentioned it, both the bartender and hostess treated us as if we were the problem. With the amount of water wasted (nearly 8 liters per minute), it’s hard to believe this is considered acceptable.\nThis planet is the only one we have. Water is sacred .\nThe hostess treated me as a crazy person.\nWhen I asked for the check the bartender was aggressive .\nIf someone needs the video of the never ending running water, I do have it"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQldHVllWSGt3T1hOVVJubDBhR00xWmtwR01rRRAB",
            "text": "We went last night for drinks, and while the cocktails were okay, the service was extremely aggressive. We stayed for about an hour, and during the entire time the barman kept the tap water running. When we asked him why, he replied:…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkaFlWSkdORTVSVTJSUk1sSk1RemhMZUMweGJsRRAB",
            "text": "Nice table and well taken care of"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUFgxWnJXQzF5WVRscmEwTk1ORU42UW5kWVMyYxAB",
            "text": "The food and service is fantastic"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aM01ubFViWEozWTFBM1NYa3hjRTV0VjFCdVVuYxAB",
            "text": "Wow! I love this place. The atmosphere was charming, the energy was electric, and the staff was warm and welcoming. The food was out of this world. We got the duck meatloaf, and some of the best fried chicken. I absolutely loved the elevated, modern twist. They took on classic food. To top it all off, the dirty martini was one of the best I’ve ever had."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214U2EzSnlWRlE1YW5aS01WZGxlbk5EVWpocE5YYxAB",
            "text": "Very enjoyable early Sat night dinner here. We opted to sit inside and had a nice 4-top in the middle of the buzzy room by the bar. Our waiter was friendly, warm and professional, and everything we ordered was very good, including as starters the marinated baby beets & labneh, the bibb lettuce & buttermilk ranch salad, and the watermelon salad with feta. For mains we had the smoked ricotta agnolotti, the lemon roasted cod (x2) and the famous hot fried chicken. Convivial vibe and really nice staff - would definitely go back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KSGVqQkxYMm95TnpONlIzQnRXWEozUkUxeVkxRRAB",
            "text": "Well proportioned meals, nice atmosphere,  clean facility."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWWJHaHFNVTA0V21OaFptMXhOakI1V2xCcldtYxAB",
            "text": "This was the first time I’d been to the Dutch as my husband & I are visiting NYC from the UK. All I can say was the food, service & ambience there were all excellent. We loved it!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVlZETXdPRm94ZUhkVllsaGhNVzVpYzFkak4zYxAB",
            "text": "I went there a few weeks ago amazing restaurant. The environment is extremely nice."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZMVFYYzViVVJ2Y0RCR1VVeFBNRXBaYmw5M2RVRRAB",
            "text": "Great staff. Friendly , polite and made us feel very comfortable. Great , unique food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pndE1tSlBhRkJXZUZwVlYxUTVURXB1ZVU5c1RVRRAB",
            "text": "Excellent dining experience with great staff and delicious food on the cutest little corner in SoHo. I've eaten here twice in the last two weeks and my favorite menu items are the watermelon-arugula-feta salad, fried chicken, and the chocolate chip cookies served warm are to die for. Also, as a matchbox collector, The Dutch's matches ignite very easily and the box is cute -- but I digress."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSWlExaFliM0p0Wkd0NWFEZFdiRVZHVW1wbU5FRRAB",
            "text": "Fancy spot. Quality menu items obviously - the rose was great. Petty, but the flapjackes should have one less cake and have actual side like eggs or something."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pac1pUQlZabXQyVFhBelZ6TlZlSEpqVkVaSWRtYxAB",
            "text": "First of all the food is delicious and the service is incredible. But my positive experience started about an hour before my reservation when I was stuck in a transit nightmare. I had friends meeting me here from 3 different states and they had no trouble getting to the restaurant. I called the restaurant to explain my situation and they graciously moved my reservation from 7 to 730. When I arrived, my friends were enjoying drinks by the bar. Disaster was adverted and I was able to relax and enjoy a wonderful evening. BTW, we were celebrating my son's NYC debut at the Soho Playhouse, conveniently located a few blocks away."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoVlozVjZiWEkwVEZocmNYSlNRVU40TlZCWGJHYxAB",
            "text": "Table service was impeccable. Food was wonderful well prepared and served. Menu is small but good choices. You must go downstairs to the bar area, it’s a cozy but great place to have a drink."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVMlFqaFBjVmx3YjNKa1lsWlliV1JUVVRWQ2RtYxAB",
            "text": "Food is so bland!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkV05uWjRkWGwwUkRacVVUSlRTR1JzWm5VMmVWRRAB",
            "text": "Services amazing, customer service amazing, drinks amazing. I wouldn’t suggest the calamari. A bit over priced for small portion garnished with more veggies than calamari"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Zek5HTlpTMFV3WkY5NFdGOXBhVTB4V210UVUwRRAB",
            "text": "Sidewalk cafe vibe, good food choices, good service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnMGJtNTBWRFJtVEUxa2J6RmxjakowTlRsTVNtYxAB",
            "text": "Unfortunately this place is a missed opportunity. It is a charming looking new american joint, but lacks food quality and professionalism. Wife ordered two types of oysters, three of each, and they tried to shortchange her the better oysters. When this mistake, which was visible by the size and shape of the oysters, was brought to the attention of the staff, they told her she was incorrect until we insisted, and they brought it back corrected. The pasta was gummy, the sauce flavorless, and the lobster cold and chewy."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGRFNrbG1NVkpmUW01TU1rRjNOa3MxWlU1dGFuYxAB",
            "text": "Thank you to The Dutch for making my birthday incredibly special. The food was absolutely amazing, I highly suggest grabbing your friends and eating family style. Wonderful service and thank you Chef Chad!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twM05GcElja2RuWjJvd09HOVVVbmxRZUhKUllWRRAB",
            "text": "We came to the Dutch last night and had a tasty, enjoyable dinner.\n\nIt was lovely evening out, so we chose to dine outside. It’s on the sidewalk with a lot of foot traffic, which was fine except for the occasional smell of smoke. Also, a bug flew into my rosé, but the server kindly replaced it and gave me a coaster to cover it.\n\nFor food, we ordered the following for 2 to share:\n- The Prince Platter\n- Chinatown Calamari\n- Lemon Roasted Cod\n- Potato Purée\n\nThe Prince Platter was nicely presented with oysters (4 kinds x3 each), jumbo shrimp (4 pieces) and lobster salad. I especially like the jumbo shrimp, which were fresh and very plump.\n\nThe Chinatown Calamari was more like a calamari salad, with cucumbers, carrots and bean sprouts. The calamari was lightly breaded and perfectly fried, which I loved. We didn’t try the famous fried chicken, but will have to next time.\n\nThe Lemon Roasted Cod was a nice, colorful dish and the Potato Puree is a must try for any creamy mashed potato lovers.\n\nOur server was attentive and it was a great meal overall.\nIt looked cozy inside, too, especially for winter months or when it’s too hot to dine outside."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBNFIyUTVURVp0YTJndFdVbFRVa1JSYVhreWNsRRAB",
            "text": "It was great from beginning to end!\n\nWe actually made a reservation, host was nice to chat with, server was nice AND professional, all the other staff was very nice, and the food was delicious!\n\nWe started with Deviled eggs and Wagyu Beef Tartare. Then had Chef AC's fried chicken with yummy slaw and amazing biscuits! Finished with a trio of Sorbet and really didn't want to leave.\n\nDecor is beautiful. Chef really elevated the food and it's no wonder he's had a Michelin star.\n\nIt's definitely a place you should go."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cbk5VWTFNV2swUkVkVlZVNWpaMUpJTW5kWmNrRRAB",
            "text": "Excellent food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrMmRGSjNVSE5pVkU5UVRHOXhSakJ4WlVRMmJVRRAB",
            "text": "Solid place but not extradoniary"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Rd1gzTXRNVUZEUWpCV1FqQXRWbnBXTFVneGJrRRAB",
            "text": "My wife and I had a fantastic date night at The Dutch! It started with a warm conversation with the Service Manager Isabella and continued throughout the meal with our great server Diana.  The food was excellent and the service and atmosphere added to the date night.  Thanks for a special evening! There are many reasons we keep coming back to The Dutch when we visit NYC, these are just a few."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGaWIxSm5aa3BXU0dadmRGbHhTbkZWY1daM1NWRRAB",
            "text": "My family and I stopped in here for lunch and we all left raving about how good it was. If you have kids they were great about being a little flexible and making things a bit more kid friendly. The menu is small but everyone thought everything we ordered was delicious. Our waiter was great at explaining the menu and was attentive. Definitely would recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205VlRqTkpNVlp5VVc4M01sVTJNM0IwY3pkWWNFRRAB",
            "text": "Came in for brunch for the first time. Ordered the pancakes, side of bacon, and mimosa. Food was delicious and the mimosa was made with fresh orange juice. Service was great as well. I will definitely be back to try other things on the menu and would definitely recommend for brunch if you are in SoHo NYC."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCeVdFVjVVMWhsZWtjMk1GTm9OVFY2TVU1dlVtYxAB",
            "text": "Myself and three other friends went on 7/9 and the food and the service was excellent. I will come back with or without anyone. Thank you to the chef."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1MFVWUXlOV1psYnpOemNsSmljMEZmZFMxRU9VRRAB",
            "text": "Stopped in for a wine. Would have been a nice spot for an afternoon summer drink but we couldn't get an outside table despite it not being busy. Felt the staff were not accommodating"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2padVVFVlZWekpDVkZremVHMVhkVk56WkZJMFdXYxAB",
            "text": "Yo fui a pasarla bien pero es un lugar muy de sagradable no hay aire  acondicionado muy caliente no puede uno aprovechar la comida esta muy caliente  los que corren la comida son amable. Abriendo tantos restaurantes y no pueden conponer el aire acondicionado del restaurante.los meseros son muy amables."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SeFdYTlNhblpaY0dReFVrdDRhbkU0VFc1WVZrRRAB",
            "text": "I've been stressed lately. Going through it. In the blender. Just a lot going on, personally and professionally.\n\nOne of the main stressors being this big deal at work I've legit been chasing for a year. It's been a journey. This client is so hot and heavy one day, then just ghosts me for months.\n\nThe team knew I was stressing and down bad, as the client said he was going to sign last week and then went radio silent, so they took me to lunch here at the Dutch to take my mind off it. Everyone got a round of drinks, I just stuck with water because alcohol at this point may have sent me past the event horizon. A random thunderstorm began to pour down outside as if to match my mood.\n\nAs I was sitting there in the beautiful interior of the Dutch feeling sorry for myself, I got a text from the client that read \"Did you get the signed contract back?\" My heart sank into my chest. I showed my work bestie and we silently walked outside while looking at each other like \"oh my god... is this about to finally happen?\"\n\nI called him in the hallway, as I didn’t have anything in my email. I stayed on the phone with him as he re-sent it, and when it came through, me and my homie SPRINTED into the pouring rain chest bumping and hugging. I love that mf. If I saw a movie where this happened, I would have thought it was beyond corny. “That would never happen…”\n\nWe came back inside drenched in rainwater, and ordered champagne and a round of tequila shots for everyone. We proceeded to get LOADED at 2pm on a Thursday. It was beautiful. Sales SUCKS a lot of the time so you gotta celebrate the wins, and boy did we.\n\nOur server, Celeste, was so confused about the vibe shift but just rolled with it like a champ. Big shoutout to Celeste. She's the good luck.\n\nI demolished this 8oz dry aged burger and fries, washing it down with tequila on the rocks. I also had half of my big homies AC fried chicken, which was delectable. Full transparency though, anything would have tasted good at this point.\n\nIf my 20s taught me anything, it's to never tie my self worth to a 9-5 job, but this one felt good I can't even lie. If you ever need to switch the vibe up, roll through to the Dutch. It's much more effective than burning some sage…\n\nIG @jnov_\nTiktok @jnov__"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWcGVFdG9ORzB4WlZkS1QwcE1VbGt5U0hablJuYxAB",
            "text": "My brother and I ate here last summer( my first time in NYC), and the food was really good alongside the service! The waitress also nicely accommodated my sesame allergy and the food was decently priced!"
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNNnRPbGhnRRAB",
            "text": "분위기도 좋고 음식도 맛있었다.\n내 치킨이 조금 undercooked였지만 그것만 제외하면 꽤 맛있었고, 김치볶음밥과 스테이크 플레이트는 정🐎 맛있었다. 미국 레스토랑에서 이런 메뉴가 있다는 것도 신기했다.\n내 음식이 undercooked 되어있는 것에대해 말했더니 죄송하다면서 어떻게해드릴까요라고 물었고 그냥 남은것만 포장해달라고하면서 디저트를 주문했다.\n내 음식에대한 사과로 디저트는 서비스로 주셨다.\n서비스면에서 정🐎 좋았고 만약 로우맨하튼쪽으로간다면 추천하고싶다.\n\nMood and good food. My dish which is chicken plate was undercooked, they apologized and asked me what i want. I just packed leftover. They kept saying sorry a lot and gave me dessert on the house. There service was perfect. We had really good time. If I have a chance to go to Manhattan, I would like to visit there again."
        },
        {
            "date": "8년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnbVBTbmZBEAE",
            "text": "아메리칸 레스토랑으로 분류 되어 있지만 파인다이닝에 가까운 스타일이고 이름도 더치인게 함정. 가격은 좀 나가지만 다양한 재료를 창의적으로 맛있게 먹을 수 있음. 소호에서 손에 꼽을 수 있는 핵꿀맛집"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2azlfc0lREAE",
            "text": "Really excellent place to come!\nNotable mentions:\n- the coffee was surprisingly good, a 7.8 flat white served up!\n- the Key Line Donut 🍩 was the best dish we had, great softness and flavour to sweetness ratio!\n\nThe other dishes were good but not great.\n- Fried Chicken crust was too crunchy and fell off the meat easily\n- the deviled eggs were perfectly average\n- the frittata was good but had too much cheese and not enough crusting"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOXZHV2FREAE",
            "text": "We accidently found this place to have a late lunch/dinner while visiting the area.  What a great find.    Great atmosphere.  Really great waiter and delish food.  We started with drinks and  devil eggs stuffed with crabmeat.  Delish flavor profile.   Then we tried the glazed butter biscuit delish.   Smoked ricotta pasta and the lobster pasta.  All delsih.   The strawberry rhubarb pie and chocolate cookies were perfect with the Cappuccino.   Our waiter Justin was adorable and perfectly attentive to our every need.  The menu was small but perfect because we each found something to enjoy."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMHBTMUZREAE",
            "text": "The pub has such a great, lively vibe - we felt totally at ease laughing and having a good time with friends. The food is delicious, the atmosphere is beautiful and the service is excellent- warm, friendly and kind.\nI recommend to try the chicken fried, (see the picture) it’s totally good to share with someone."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZb2JYODJBRRAB",
            "text": "The Dutch claims to have a famous hot fried chicken, and I’ll say it was quite remarkable. You get half of a chicken carved into four pieces, each fried to crispy perfection, served with a refreshing cole slaw."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbTdEMzhRRRAB",
            "text": "Five star food and service. We were very pleasantly surprised by the duck meatloaf; not something you find often on the menu. The rest of the food tasted great too - hummus, steak tartare (of which we ordered two, the second one for dessert), and the strip steak.\nThere is a $55 corkage fee per bottle (we were told $50 on the phone in case you hear the same)."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQanM0TzZxZ0oteUNREAE",
            "text": "I worked in soho for 3 years and never walked in this place. Little did I know I was missing some SERIOUSLY delicious seafood. The code is delicious and the deviled eggs are going to be on my Friendsgiving menu 😍 best I’ve had!\n\nAbsolutely will be back, I saw a couple having the oysters and I’d love to give them a try."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcktUcTFBRRAB",
            "text": "I was recently here for dinner and my experience was pretty good. Our server was very friendly and most of the food was delicious. The crab deviled eggs were a delicious appetizer. For my entree I ordered the burger, which was not great. I did try some of the fried chicken and biscuits, and they were delicious. Overall my experience was positive and I would return, but I would not get the burger again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKLU04cWFNNHNhVklBEAE",
            "text": "The AC's famous hot fried chicken with honey butter biscuits was my absolute favorite — a truly delicious combination!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcWJUbUxnEAE",
            "text": "Warm busy brunch spot. Fresh ingredients, filling and easily shareable dishes.\n\nThe cornmeal pancakes and avocado toast were a real highlight.\n\nAttentive and kind staff - though maybe a touch too attentive.\n\nIt’s sort of noisy but in a living room hum sort of way, definitely more of a group breakfast spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuZy0ycnJnRRAB",
            "text": "It’s a nice casual place, good drinks and setting. Tuna carpaccio had too much fish sauce added. Calamari was a nice Asian inspired idea but really needed a sauce, somewhat dry. The burger which is a signature dish felt like it had been sitting around, not freshly melted cheese or special sauce, bun was too thick and dry. Fries were great. Overall just lacking focus on taste and well balanced flavors."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNnJQZ1BnEAE",
            "text": "If you are looking for a classy breakfast / brunch with amazing food put together with passion, fresh ingredients, and a upscale yet cozy atmosphere, look no further. The Dutch is a mainstay in SoHo and stands proud and tall. The breakfast experience at The Dutch oozes class, style, and the perfect \"not too haughty but you can impress\" vibes. It's the sports jacket of breakfast joints.\n\nMake sure to try the Keylime Donut. This is an absolute marvel in its creation. The restaurant isn't trying to sell you donuts. They just want you to experience this one thing... a keylime pie converted into a donut in the most innovative way possible. It's covered with gram cookie crumbles (just like the pie crust), with awesome keylime flavored glaze, and has a keylime custard filling. I've never tasted anything like it and it goes perfectly with coffee. Coffee was also quite good, a slight dark roast that balanced the donut and other \"sweet\" things.\n\nI had the salmon, scramble, with a sour dough, cream cheese thing (forgot what it was called). Wow. The egg was done brilliantly - creamy and fluffy. The salmon was good. But What hit it out of the park was the sour dough bread slice - crispy, soft, and structured - with dill and salmon roe and cream cheese. You really can't beat this savory creation.\n\nAdd to all of this, a resonable price (for NYC). A classy, cigar-bar-type atmosphere. And amazing service. It's perfect for a brunch date or a business breakfast. Heck, I'd come here by myself if I had to.\n\nWill absolutely return. Amazing find."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUME9tX1hBEAE",
            "text": "If a place can make an impression with just salt and pepper fries, you know that place would be special. We had just a lovely time at this place. The place has classic fine-dining ambience. We highly recommend the hot fried chicken as well as the spring pea ravioli with ricotta. My wife ordered the chamomile highball which she thought was excellent. The staff was excellent and expect top notch service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREazd2cHhnRRAB",
            "text": "I hate to admit but I had three glasses of the hot tin roof. My oh my it was refreshing and delicious. I couldn’t stop myself from only ordering one. It was my first time here and I was really looking forward to the fried chicken. I’m disappointed to say it didn’t leave me wanting more. The chicken was under seasoned. The crispness of the chicken was great. The seasoning wasn’t it. My friend felt she had better chicken from Popeyes and that’s upsetting. For $44, I had the steak and the kimchi fried rice. When I got the dish, I was appalled to see how small portion the food was. The steak was cooked well but my oh my the amount of food did not match the price. I personally won’t go back again. The service was wonderful and attentive. It sucks the food wasn’t as tasteful as I wish it was. We got the fries which was better than both of the main entrees. Sigh was definitely upset."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyNXN2TDRBRRAB",
            "text": "They surprisingly know their fried chicken so well, it was absolutely delicious. Their lobster frittata was also good. But the fried chicken with their biscuits was definitely the highlight.\n\nThe service is also great, friendly, patient, and attentive. While you sit in a good ambiance. I highly recommend this place for brunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURub2NYMmNnEAE",
            "text": "I recently tried Dutch coffee, and it was absolutely amazing! The flavor was rich, smooth, and perfectly brewed—definitely a standout for any coffee lover. However, the breakfast wasn’t quite to my taste. It was a bit too spicy for me, which might appeal to those who enjoy bold flavors, but if you prefer a milder breakfast, it might not be the best fit. Overall, I'd still recommend trying the coffee for sure!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4M3BhTEZBEAE",
            "text": "Went for brunch on a beautiful Saturday morning.\nLocated in a corner of intersection with large windows where you can people watch.\nPlenty of seating options including bar and patio. Reservation online recommended.\nMenu is basic but fresh ingredients.\nService was fast, but some members of staff were dry.\nWe arrived earlier than our time and we were asked to come back when they are open, which was 10 minute....I didn't see that very welcoming. They could have seated us outside in the patio while they get their things ready."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6d3FxWEt3EAE",
            "text": "Their fries were amazing! Service was pretty good, but that's the end of anything positive about this place. The other main brunch dishes we got were way overpriced for what they were (the Benedict was like $34... and for what 😭 there was literally nothing on the plate) The Arnold Palmer that we got was also incredibly sour - kind of like their \"lemonade\" was just straight lemon juice. I love tart things but this was such an ick. Would not recommend, there are so much other better places in this area"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRcHUyMktBEAE",
            "text": "If you're looking for a brunch spot that breaks the mold and invigorates your taste buds, look no further than this gem. Every dish we tried was a delightful surprise, showcasing familiar flavors with inventive twists that made them sing. From the savory to the sweet, the menu offered a range of options that catered to every palate. The creative combinations kept the experience fresh and exciting, ensuring that even the most seasoned brunch-goers will find something to love. The inviting atmosphere and attentive service further enhanced the experience, making it a perfect choice for a leisurely weekend meal. So if you're ready to ditch the predictable brunch routine, give this place a try - you won't be disappointed!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIODlxVXJnRRAB",
            "text": "Came in for brunch on a Sunday without reservations. I was seated solo promptly. There were plenty of seat options inside and a few outside. The customer service was great. The brunch menu was limited and over priced. I ordered the blueberry flapjacks. They were okay. I also had a cappuccino which was not that great, I didn’t finish it. I would come back to try other things on the menu but I would probably try other places in the area before doing so."
        },
        {
            "date": "수정일: 6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNDd1bExnEAE",
            "text": "Después de sentarnos y ver la carta de desayunos casi nos vamos por los precios.\nEncantado de haberme quedado.\nServicio excelente y la comida muy buena."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwaE82blJBEAE",
            "text": "This place is the perfect example of great food, and customer service. The ambience  is nice. Came for brunch. Definitely make a reservation. The staff is well groomed, dressed, polite, and friendly. You’re greeted with a smile and it…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKbWFyLUN3EAE",
            "text": "Cute restaurant and nice atmosphere but wasn’t too impressed with the food and drink. The margarita was pretty average, not very strong, I think the price is mostly for the presentation in the skull glass. The Paloma, however, was perfect. The biscuits and oysters to start were pretty tasty, biscuits were a little bit on the dry side though (biscuits are hard to perfect, I just prefer a fluffy over a flaky one). The double Dutch burger was alright, nothing to rave about, but we were hungry so it got the job done. Service was great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkNk83NE9nEAE",
            "text": "Not bad - the restaurant week menu wasn't too bad. The calamari appetizer (4.5/5) was super good but spicy - the calamari was crispy and light and the sauce was umami packed. The bass was okay (3/5) but it tastes vaguely fishy and the coconut cake (3/5) was average but had strangely broken apart."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4Mk9MWU13EAE",
            "text": "We discoverer this place while walking down lower manhattan. We saw a bride on her wedding day wearing her dress and having a meal with the groom and immediately put the place on the list to visit.\n\nWe were not disappointed at all as we had one of the best experiences. Firstly, the staff are very accommodating from door to table. We were welcomed and they took our luggage to storage and in the dining area they were served with love.\n\nWe started with the corn bread and it was delicious.\n\nFor the main course we ordered the burger as we saw a lot of people ordering it and let me tell you, it was one of the best burgers we have ever had. We ordered it medium well and it was cooked perfectly and the ratio of beef/cheese/pickles was perfect. The fries were crunchy and well seasoned and delicious.\n\nEnjoy your meal there ☺️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3NmNQdmdnRRAB",
            "text": "The Dutch exceeded all of my expectations! As someone who was looking forward to a luxurious dining experience, I was not disappointed. The food was absolutely top-notch—every dish was prepared with such care and attention to detail. The salmon was particularly outstanding, cooked perfectly and bursting with flavor.\n\nService was impressively fast and attentive, which made the whole experience feel seamless and relaxed. The staff were friendly and made sure we had everything we needed without ever being intrusive.\n\nThe wine selection was fantastic, offering a great variety of options that paired wonderfully with our meal. I really appreciated the thoughtful recommendations from our server, who clearly knew their stuff.\n\nAnd let's not forget the desserts—wow! They were the perfect ending to an already excellent meal. Each one was beautifully presented and tasted even better than it looked.\n\nOverall, The Dutch delivered on its promise of luxury and quality. It's a place I would highly recommend to anyone looking for an exceptional dining experience. Five stars, without a doubt! The ambience was warm and the people were friendly. Come and enjoy!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsNzlTdUZ3EAE",
            "text": "I recently at this restaurant and wanted to share my experience. While the ambiance, service, and table were decent ( I need to add no music) , I found that the food did not justify the price. The sea bass dish, in particular, disappointed as the mussels were not appetizing, making it difficult for me to eat. Unfortunately, both my friend and I experienced gastrointestinal problems after having the seafood. Overall, a mixed and somewhat disappointing dining experience."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPcF9MTTRBRRAB",
            "text": "Tasty!!!  great spot for brunch.  Lots of tables inside you cannot see because they have a HUGE back room.  We love that room.  Food is great.  Had the pancakes which are cornmeal.  Very good.  Breakfast sandwich is good too.  Best item was the ribs, very good fall off the bone with sweet and slightly spicy sauce.  Tart dessert was good, the biscuits are great too.  Check out all of our reviews and look at all the photos below. If we do not like it we do no review it so all of the ones you see are places that are fantastic. Follow us if you like. We had over 52 million views in the last 12 months and we thank you for that. We don't get paid, we just love to eat. Be sure to click on \"RobH\" at the top of this review to see all of them and to follow us if you like good food and FUN.  If we do a review it is because we love it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbWFUTG1nRRAB",
            "text": "The oysters are simply superb - fresh, plump, and brimming with flavor. Their pressed juices are incredibly refreshing and provide a nice balance to the meal. Service is top-notch - friendly, attentive, and really enhances the dining experience. Don't miss out on their shishito side dish, it's a flavor-packed treat!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dXRPaWJREAE",
            "text": "Really great seafood, easy to make reservations or walk in with a small group on the right evening. Cocktails were funky and fun - service was attentive but not invasive. Cozy atmosphere with dark lighting, food was stellar and coursed appropriately"
        }
    ],
    "reviews_count": 81
}