{
    "name": "Jack & Charlie’s No. 118",
    "place_id": "ChIJt4VcYsZZwokRYEw3XwUJP_I",
    "grid": "MN2",
    "address": "118 Greenwich Ave, New York, NY 10011, USA",
    "rating": 4.4,
    "user_ratings_total": 247,
    "phone_number": "(212) 680-4265",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sWmFGWlBkblpPU0dkd1YwZFFOak54Vkd0MFpIYxAB",
            "text": "The brunch was less than stellar. I would prefer more options and more interesting options. I prefer the dinner menu. Why are all the interesting restaurants in the East Village, Lower East Side and Brooklyn?"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWVGFVeElTVXg2WVdGYWEyVTJhRmRCUzNKRWVVRRAB",
            "text": "We had such a beautiful brunch here. Food was amazing! The ladies swear it was “by far the best caesar salad of our lives”. My club sandwich was phenomenal as well. We’ll definitely be back next time we’re in town."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwdFNuQlJObFZQVjFKbE5UWlNUSGd4Y0dsSWExRRAB",
            "text": "Made a same day reservation for the prime rib dinner, it was pretty good! Caesar salad was a little plain, and the shepherds pie croquettes could've used a side sauce.\n\nI found it a bit pricey for the food, but I guess you're paying for the ambiance and location. Definitely vibey!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbldtdEpTM0UyYkhSYWRscEZaVjlsYjBaMFIxRRAB",
            "text": "New favorite place in the city. Food was amazing and staff was so kind and interactive"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4Mk4ydDFPVTB4WDJaMFZVUmhkbmhPYjFkQlZtYxAB",
            "text": "Get the duck meatloaf and a glass of their Pinot noir. I guarantee you will have the best dinner that you’ve had in a while.\n\nBurger was also very good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkUVFVRjZURXRSY1hneVltUmtYM1J4VUdsRVVYYxAB",
            "text": "Fantastic restaurant every dish we ordered was tasty,staff was amazing they made experience special.\nHighly recomend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkb04xTnRPVUZCYVdoclFXMUlMVGh4VlRKTWVWRRAB",
            "text": "Gorgeous food. Best meal of the holiday. Kevin is fab."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xc2RIQnJUVk5WUjAxcFl6WjFNRFUxYjBZeFduYxAB",
            "text": "Great Burgers."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNemQxOVlXRmxUTTFScE9WVm1kRjg1T1VkWVdIYxAB",
            "text": "Such a cute little spot. Not the biggest menu but it is a nice spot for people watching and has good drinks"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pobWJrb3hRWFptWkdVMGNERmphVXREYTJka1QyYxAB",
            "text": "We got in and sat down ordered our food bacon is thick but overall really good waffles is good they have sodas and sandwiches donuts is really good 5 stars"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaeVJUbFNNbU5FZUdNM2RIVndhMGMxUlhaVWRYYxAB",
            "text": "Came here on a friend’s recommendation for their Sunset Menu and it did not disappoint! The Jack Jr Burger was quite filling alongside some fries plus another round of fries specifically the Rosemary & Parmesan Fries with truffle aioli, and the Caesar Salad was very crisp and refreshing especially in this NYC Summer heat. I enjoyed sipping on my Jane Street mocktail, which was zesty, bubbly, and beautifully presented. The staff were so kind and welcoming, even letting me cool off inside before the dinner service started. The space itself feels elegant, like a modern country club and beautifully arranged bar. Definitely worth visiting especially for their Sunset Menu with friends!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVMVVrMVJPWFJLVUd0Zk9FVkVUR1JMWjE5bU0xRRAB",
            "text": "The entire evening from start to finish was exceptional. I chose the venue because i liked the look of a quietish setting and it was perfect. The food was also stellar and the wine list was utterly amazing. I literally cannot wait to return. PS - the tomahawk was cooked perfectly and the popovers were too good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJd2NESmlPRkp4VlZoTGFURXRkMVpwTVZoRGJYYxAB",
            "text": "Came in on a Saturday for brunch with a couple friends and sat in a booth on the far end of the dining area and it wasn’t too busy. Nice atmosphere and well stocked bar, but had 2 problems -  there was a huge cockroach just hanging out on the extensions cord from the ceiling like it didn’t have a care in the world. (The extension cord was for a portable AC system so maybe they had HVAC issues the day we were there.) Our server switched us to another table while they sent one of the back of the house staff to climb up to the extension cord to squash the roach.  The second issue that motivated me to leave this review is that service was petty lackluster - after we ordered our food and drinks(within the first 5-10 minutes of being seated at the new cockroach free table ), the waiter only came by once to refill our waters in the hour and a half we were there. While I don’t think the wait staff intentionally ignored us, but they just didn’t have a presence in the back part of the dining room. They didn’t even pop in regularly to see if other tables around us needed anything."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21abFVWbEhlWHBMWDI1RmJrRkZUM0pqWTJ4MFVXYxAB",
            "text": "Not sure where to begin. Popovers were excellent.  Wedge salad was way over dressing to much I could not eat it. Way way too much. But I wouldn’t sent it back.\nPasta and clam fair also over oiled\nSteak was excellent Alittle over priced    Not very impressed"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkeVFWVlViRWcxVkdKc1VuUmhObFE1ZVc0elVrRRAB",
            "text": "Such a quaint dining spot!\nGreat food at a reasonable price"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KMloyNU1SR3BmU0RodlFscHFUVzFzYm1VMlUxRRAB",
            "text": "Best kept secret in WV. This is a “locals know” spot. Best oysters. Cocktails cold and generous. And the staff is super friendly and inviting."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTFUwVm1kVFJvUlRSVVowbFBMWGhvVlRocmRuYxAB",
            "text": "Good service. But burger was way too oily, dry and not a wow."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSk4wSlhNME5sU1RWTGMxcE9XVXd5TFVGbmNtYxAB",
            "text": "server was great and personable. manager profiled and wanted us to leave as per her words just because we were laughing a little loud… we left and couldn’t even enjoy the experience. manager cussed us out when we willingly left."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TVdtbENiVlZEVkdsYVFUUTNaM2xoU1hsUFRHYxAB",
            "text": "Couldn’t even get to eat there because the servers and managers were sooooo rude."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psRU1qYzRURmQ2UlRWd2JXazNNRGQ0VGs5QlVWRRAB",
            "text": "Atmosphere 10/10, food selection was insane, and overall the place is a great choice for any kind of reunions! I am definitely coming back here when in the west village"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aMVNEUjNVaTFVWTBWbFdUSlNVRU0xYkUxalNtYxAB",
            "text": "Stunning restaurant! Great service and even more delicious food and drinks! My friend and I had a great time catching up and just enjoying ourselves! Get the duck meatloaf it is to die for!!❤️10/10 would recommend-I can’t wait to come here again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KaWJFTmxjMHMxY0hCaVdsVkZVR0pZVlROVGJHYxAB",
            "text": "New happy hour menu"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJakZxcTJuNnQ3RnNnRRAB",
            "text": "Amazing brunch!  Restaurant is gorgeous and the food is even better!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VQZjRfZHVUc1piYzF3RRAB",
            "text": "Even though this Is a steakhouse the meat components of the brunch menu are the worst part of the dish. For example the prime rib in the panini was inedible and the corned beef with the Benedict bland. The side of bacon was really good though.\n\nIt didn't really add to the experience the fact that we were offered the worst table in the restaurant even though we were one of the first guests to come in.\n\nNor did it help the fact that my dish came out 5 minutes after everyone else's. By the way please teach your team to coordinate with positions. When a runner brings the food he or she should know who the food is for.\n\nAnyways, I really want to like this place because we live around the corner but they won't let me."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCQmRUbG9RM3BIV0VJNFdsQkVRelpJZEd4SVJYYxAB",
            "text": "The lamb and shepards pie were unreal"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkeVNUVlBSMFJVTjJKUVJIZGFOM1kyYkVGWFZGRRAB",
            "text": "Caleb served us fabulous drinks!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQZlVfYjJwMTY3RkFREAE",
            "text": "This is one of those very comfortable, high quality places that i'm thankful to have in the neighborhood. I''ll make this a regular. Had dinner here last night with two friends for my first time and really enjoyed it. Service was very friendly and on point, starting with the greeter who met us at the door and showed us to our table. The food was excellent - I had the duck meatloaf (really delicious) and my friends each got the brick chicken, which they also loved. Drinks were great, setting was great.  Highly recommend."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZOEt1MXVBRRAB",
            "text": "Food was good, portions could have been bigger. Service not great, had to remind server about our drink order.  I want free refills on coffee (paying $40+/person for brunch), it is the least you can offer.  Expensive for what you get."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMDdYVE5REAE",
            "text": "I was looking for a place for a great burger and I came across Jack and Charlie’s. The first thing I did was look at the reviews. I thought this would be a hit or miss. I usually dismiss the hit jobs. I’m looking for a place that’s got great food,  hopefully great prices,,  great atmosphere and a friendly staff. I’ve had the good fortune of flying for the airlines for 40 years and I’ve eaten around the world so I think it gives me a good perspective.\n\nUpon entering the restaurant, I was warmly greeted,  the dining room wasn’t open yet. I was asked if I would wanna wait at the bar or outside, nice not to have pressure or be forced to the bar, but I did opt for the bar and our bartender Mia was friendly and engaging, took our order. Of course I’d like to see a hand poor versus a jigger,, especially when you’re looking at $20 a drink, but I understand it’s a business. We were shown our table and greeted warmly by the staff. Our waiter was Kevin, who throughout my meal was warm, engaging and answered all questions, awesome..  The  sommelier I believe was Josh.  He was Knowledgeable, friendly had good recommendations, kind of bounced off each other. I ended up with a gigondas, Domaine Santa Duc, a decent value for the money.\nFor starters, we went with the BLT wedge the Caesar salad and the steak tartare.  Let’s start with the wedge. It was as good as I’ve ever had, crisp lettuce, great presentation, good portion. The blue cheese crumble was good as was the blue cheese dressing. I was ready to order another one on the spot.  The Caesar salad, excellent taste,  good consistency again, I would order another one. The steak tartar a good portio,  presentation was OK, look like a flattened hamburger, but I was assured it was a cut steak and tasted like a cut steak.  The initial bite actually tasted a little medicinal and then I mixed the ingredients, it got better. I love the nice crisp toasted bread with it the taste settled down and it was actually good. I can’t say my all-time favorite,  but good & then we got the shepherds pie croquettes which I really really enjoyed and so did everyone at my table.\n\nThe pace of the meal was great,  never felt  rushed. The engagement from the staff was excellent. The noise level was good as I can concentrate on our conversation & had a great setting.\n\nFor our main course, we tried the bone in duck meatloaf.  I went to J & C  for the bacon cheeseburger, and the pork chop a la Diablo.  Let’s start with the duck meatloaf. It was good,  different soft nice flavor not overpowering a decent size portion. Next I really wanted to dig into a bacon cheeseburger and it delivered!!  big patty, brioche bun, GREAT  slice of bacon,  tomato.  I asked for medium rare and I usually preferred on the rare side of medium rare. This was a little bit more closer towards the medium side. That’s my only gripe.   I’d order it again in a nanosecond. Oh the french fries initially came out warm. I’m a stickler for hot. They brought me out hot french fries in a couple of minutes,  great recovery and lastly the pork chop a little pricey at $64,  I mean, this is pork we’re talking about. But I must say it was as good, a pork chop as I’ve ever eaten. A great size portion cooked to absolute perfection. I mean it was juicy moist, tasty, what a really nice sauce and with the peppers, just the right touch.   It was worth the price of admission for this piece of swine. Can’t wait to order it again.\n\nBy this time we were starting to fill up a little bit,  so for dessert I had the  Sticky-toffee carrot cake.  It was served warm, it wasn’t what you typically expect but I really enjoyed it, not for the calorie conscious,  but really tasty. Overall I had a great experience again a little pricey,  not for the faint of heart but hey, we’re in New York City. You get what you pay for at Jack and Charlie’s and their staff delivered and did a great."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJajczU3hnRRAB",
            "text": "Great brunch"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJa0w2TDhnRRAB",
            "text": "This was our second visit - had to try the dinner after the fantastic experience we had at brunch a few weeks ago.\nThe service was outstanding both times and the staff was always helpful and attentive.\n\nEvery dish we tried was excellent. Some of our favorites were the duck meatloaf, steak frites, and especially the black truffle mafaldine.\nCan't recommend enough!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eFBDWGtBRRAB",
            "text": "Jack and Charlie’s was amazing. Such good food, amazing atmosphere and service. hostesses were so accommodating and the sweetest, Josh the sommelier was so great and Kevin our server was fantastic. Bussers, bartenders were all so friendly. If you’re looking for a cozy spot in the west village with good vibes and good food go straight to Jack and Charlie’s. We will be back SOON"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NFplaFZ3EAE",
            "text": "Food was really good quality! Service was excellent!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdjdQQjVRRRAB",
            "text": "Caesar salad was surprisingly delicious! Chicken was tender, sauce was tasty. Plenty of staff for a Wednesday night and cozy atmosphere."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBejhMQTlBRRAB",
            "text": "Steaks were absolutely not worth it - nicely cooked but outrageously expensive and small. Staff was pleasant. Actually all of the food was small. Drinks were good."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMFBmZWF3EAE",
            "text": "You should beware when you go to this restaurant that the fine print in the menu indicates that there is a 3% surcharge that apparently can only be taken off if you are paying close enough attention to spot it and ask for it to be removed. I didn’t notice it until I was splitting up the bill with friends of mine later. When I asked to have it removed and suggested that it was unfair of them to add such a surcharge, the manager became very upset with me and hung up while I was still talking. I called her back, and she indicated that she would put me in touch with the owner. Several days later, the owner hadn’t contacted me, and they hadn’t removed the 3% surcharge. It was only when I called them back again that they finally they took it off.\n\nPerhaps others will disagree, but I find this type of charge to be unfair and deceptive. It’s basically a tax on people who aren’t paying close enough attention to their bill because they trust the restaurant to not take advantage of them. Even if I had noticed it, I would have been in the uncomfortable position of brining it up in front of my friends, which might have made me seem cheap (Of course, as you can surmise from this review, I am quite cheap, so bully on me for not paying sufficient attention).\n\nAs of yet, no word from the owner. I suspect that’s because they know I’m right that the 3% surcharge is more or less a trick to charge people extra. Still, the duck meatloaf was quite good, so I suppose awarding one star isn’t fair."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfLWRxbWtBRRAB",
            "text": "Nice space. Food and service was more miss than hit.\nRecently had brunch at Leonetta and saw they have a sister restaurant so we decided to check out for mlk day brunch with all day specials.\n\nTHE VIBE\nWhoever designed it did a great job! It's a beautiful room with lots of attention to details right down to wallpaper in the bathroom stalls.\n\nTHE SERVICE\nWe booked weeks ago and even though it was about 1/4 full, we were offered a table almost in the doorway next to a storage closet with some sort of ladder that someone neglected to put away next to it. They were very nice about giving us a different table.\n\nThere were no food specials after all.\nThere was some confusion about the drink specials.\n\nService is friendly but absentminded. I had the same experience at Leonetta where there was plenty of staff but they seemed inexperienced and not well trained.\n\nHe was very good with bloody Mary cart which added a bit of theater to our meal.\n\nIn the middle of meal, he came to tell us he was going on his break and that another waiter would be taking care of us which was nice.\n\nTHE FOOD\nIt all looks good.\nDonuts were a bit stale but the coffee sauce was nice\nMy Eggs Benedict with griddled corned beef  hollandaise and perfect poached eggs and excellent breakfast potatoes. The meat was a little dry. Corned beef needs fat. But overall it was the best dish\n\nMy friends did not like their paninis. Bread and fries were soggy.\nFour cheeses canceled each other out tasted more like cheese whiz.\nPrime  Rib, which according to another table is amazing at dinner, was dry on the sandwich.\nAvocado toast was fine.\n\nTHE BILL\nApparently, the management never told the staff about the drink specials so we were charged full price for our drinks. We had two Virgin Marys and were charged for regular Bloodys.\n\nThey adjusted the bill no problem, but the overall experience was not good ."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbi1LZmhBRRAB",
            "text": "Super cozy ambience and tasty food"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmLThEVFRnEAE",
            "text": "The hostess  told us we were too loud. We had just walked in. We ordered champagne and were told we “”hope you pay bill”  so we paid it with our Amex Black card and went back to the Plaza where we were welcomed. Never again will we go back!!! Very slow hardly anyone there…. Sorry not gonna make it in business."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2ejdtelV3EAE",
            "text": "Went for brunch on a Sunday. Got in without a reservation. Great eggs Benny and good bloody Mary’s. Would recommend. Service was excellent"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2ejVxaGJREAE",
            "text": "Popped in for a quick solo dinner and they squeezed me in before another reservation, which I appreciated. I had a dirty martini with goat cheese olives with the oysters which were very fresh, and paired nicely with a tasty mignonette. Salmon Teryaki entrée was excellent. Will definitely return!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cXZ2LUR3EAE",
            "text": "Can’t speak highly enough of the crew at Jack & Charlie’s! Everyone was so kind when I brought my dad into town for a fine dining experience.\n\nThe cocktails were great, we were recommended a wonderful bottle of wine and the food was incredible.\n\nSome highlights include the Shepards pie croquettes, popovers, steak tartare, duck meatloaf and the brick chicken! Can’t wait to try the tomahawk next time. I tell everyone about this place :)"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQLUtiU0JREAE",
            "text": "I was impressed by the cordiality and congeniality of the staff. They were generous and attentive to customers to a degree that stands out."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMWRIZzRnRRAB",
            "text": "I used to visit this place with my sweet friend of 25+ years, Sean, from Tea and Sympathy down the block, who died suddenly of Brain Cancer awhile ago. I was dropping something for his wife, and decided to stop in for a drink. The bartender, Travis, was just ugly-nasty cold unfriendly from the beginning. Said he didn't know Sean. I hadn't been since Sean's funeral, so got a bit weepy when I saw they'd hung the photo I'd given them of Sean on the bar. An 'airline' couple sat next to me; tourists, and we chatted. I was a F/A for 2 major airlines for decades. He wanted to know how to get into the majors. I offered him advice and references. They asked to follow me on Instagram. A bit later, the couple looked at the overpriced bar menu, and left. I had gone outside for a sec. I limp and am off balance because of Cancer meds I'm on (I'm just recovering from Cancer.) Maybe Travis thought I was drunk? After 1 1/2 weak Margaritas? I came back inside, and the couple were leaving. The airline guy was tipsy and forgot his credit card, and I pointed it out to him.\nTravis The Bartender yells at me \"You drove away my customers!\" WHAT? We had a pleasant convo about Airlines. I offered him advice on The Major Carriers.\nTo try to be 'strong', and not let this man belittle and humiliate me, to kind of not to shrink in Bartender's ridicule of me, I asked for a 3rd (very weak and gross and overpriced) Margarita. \"NO!\" this bartender tells me. I hadn't even finished the second drink, which was ALL ICE ANYWAY ($20.00 each for a Margarita).\nThe bartender was beyond rude and humiliating! Not the \"Where everyone knows your name\" Friendly neghborhood bar by any stretch of the imagination. If this is who they hire, they need to CLOSE! I'VE SINCE LEARNED OTHER FRIENDS HAVE HAD THE SIMILAR EXPERIENCES WITH THIS BARTENDER! I've been reading the 1 Star Yelp Reviews (which Yelp doesn't show you unless you look for them). Seems so many have complained about how rude the employees here are. (They used to have a lovely Bartender, years ago). The other employees that night seemed lovely. Travis would make a good angry and disgruntled Prison Guard. He's in the wrong profession. Ambiance: HOSTILE!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQza2Iyc29BRRAB",
            "text": "We came here for dinner and had an amazing time. The meatloaf is out of this world and the painkiller is so delicious. Excellent service as well."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNELTh1d3JRRRAB",
            "text": "I will definitely go back when I'm in the area!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMza0xEQWV3EAE",
            "text": "First time here I enjoyed it for the most part. The service wasn’t the best but they did deliver on the food. I started with the cut tuna which was very fresh with lots of bright flavors. And for the main, the duck meatloaf was excellent! Skipped dessert this time though as nothing really caught my eye."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOGRLWHh3RRAB",
            "text": "Food $50/$100/$6soda"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuMGRmbjl3RRAB",
            "text": "Great food (amazing chocolate babka French toast), nice efficient service--sat outside on a lovely day--BUT! They charge you twice if you ask for more coffee at brunch! That's insane. The nice waiter took the charge off for us, but COME ON, REALLY? A $5.50 refill?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURub2ZHQTFBRRAB",
            "text": "Very tasty toasts with smoked salmon and specialty donuts with cinnamon and coffee sauce"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1dk0tNHpBRRAB",
            "text": "Went here for brunch. The food was exquisite and quite well prepared. Would highly recommend the Eggs Benedict, Omelette, which was fluffy and bursting with flavor, and the Avocado Toast. Service is timely. The ambiance is relaxed although can get a little loud. Overall, would recommend for brunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREaDU2bGN3EAE",
            "text": "Great American bistro. The duck meatloaf is absolutely worth it. My partner had the burger and said the quality of meat and bacon were very good, but he may try the pastas next time to get a bit of variety. Rosemary fries were cooked perfectly.\n\nMick was a lovely server. The playlist in the background was radio-vibey and fun.\n\nBill with tip was ~$98, no booze nor dessert consumed (just mains)."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdS1Pbkl3EAE",
            "text": "We chose this restaurant because of posted reviews, pricing, and location.\nWe were not disappointed.\nThe only reason I did not give a full 5 stars is because the bone in duck meatloaf had a bone too large, so not enough meat. It was delicious, no lie, but expected more meat.\nOur server was great, attentive, gracious, and felt never rushed or pressured to pay the bill and get out as many restaurants in Manhattan.\nThe appetizers and main meals were liked by all.\nThis will be on our list for our next visit in New York city."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3alpiN1d3EAE",
            "text": "This was one of the Resy's I waited for the most during my NY trip and boy it didn’t dissapoint! The ambiance is relaxed and perfect for a date or a quiet dinner. We ordered a delicious off menu octopus to start and then we shared the brick chicken and the fusilli. Everything was absolutely delicious and cooked to perfection. The brick chicken is something out of this world. To top it all, Katherine's service was spectacular. She guided us through the menu and she was always caring and attentive. I can't stress enough about how good this place is!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXcXF2S21nRRAB",
            "text": "Had a good experience here for the most part, but I definitely agree it's a bit overpriced for some things.\nMade reservations for 5:15 and was seated right away.  Service overall was decent and pretty attentive.\nOrdered the pretzel bites and the mushroom toast to start with. The toast was flavorful but a bit dry and while the whipped mustard was absolutely delicious the pretzel bites were a bit dry as well.\nFor entrees we went with the steak frites and the burger. The burger was pretty good but I've had better. T steak was pretty on point flavor wise, although the fries were a bit too overcooked for my liking. Ended up ordering the chocolate cake for dessert and it was tasty.\nI wouldn't go out of my way to come back anytime soon, but might eventually come back to give a few of the other options on the menu a try."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtcGFEc0dnEAE",
            "text": "I absolutely loved this place. Decorated for the holidays and the perfect spot for a cozy winter dinner. They have the fire place going (Dec).\n\nThe butternut squash soup was so fantastic and I enjoyed some of their homemade pastas. The drinks were also very tasty. I loved the Village Voice pisco. I will definitely be back some time. Great for a special occasion, a work dinner, or a dinner with parents."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyeXVTSnhRRRAB",
            "text": "Excellent! Great vibe! Old English pub feel with an upscale decor. The service was super friendly and very informative about the menu and specials.\n\nWe had a cocktail at the bar pre-dinner where you can eat as well.\n\nWe started our dinner with the truffle toast and tuna tartare.\n\nFor entrees we had the branzino and duck meatloaf which you just order. It was amazing!\n\nFinished with a coconut rice pudding."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWdUozZUhBEAE",
            "text": "The chopped tuna is AMAZING - I would come back in a nanosecond for that dish. The other dishes we ordered (the littleneck clams, the bucatini carbonara) were all good but not memorable. My friend loves the ambiance/vibe here - I find it a little too sedate, not enough energy in the room. Additionally, you must check your bill because they attempted to charge us an additional %  for using a credit card - we caught it and they removed the additional fee but really???"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bDdqa1pnEAE",
            "text": "First visit. Lovely room and excellent service for brunch. Brunch entrees are reasonably priced. We enjoyed our meal, the pancakes with blueberry syrup and the eggs Benedict were good. We shared the donuts for dessert, did not seem freshly made, but they came with a tasty coffee anglaise.\n\nOne thing I didn’t care for, however, was that there is a 3% surcharge added to the check which is meant to cover inflation of ingredients, wages, etc. This is removable upon request and we did request that it be removed. We didn’t look that carefully, but it is disclosed in small print at the very bottom of the menu. Our waitress very graciously removed the charge. The menu says that they have added this charge rather than increasing the prices on the menu, which I don’t really understand. It is just a sneaky way of raising prices."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNueGEtU2hBRRAB",
            "text": "We had a nice dinner with good food and excellent service.  But something was wrong with the air conditioner and it was way too hot in the restaurant, which spoiled our meal.  I will try again on a chilly evening, but I’m guessing it was above 80 degrees inside the restaurant."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyaWM3VWV3EAE",
            "text": "Had a wonderful experience here. The waiter was super helpful and had a good knowledge about the food. Most importantly, he came to check our table frequently to see how we were doing. We just loved the service of this place.\nAlso, the food that we ordered were delicious. Will certainly come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoenNUbm53RRAB",
            "text": "Really suffered in here. Service was troubled. They are stymied by management’s processes, our server said. So that’s why the jam we asked for (to go on toast provided with the meal) took 12 minutes. The place is very busy and the kitchen is coping in a small space, I’m sure, but we waited at every intersection of the time there. Lots of waiting means bad things for them… tables can’t turn if they can finish! I think the food and spot is highly overrated. Eggs again. We eat breakfast out a lot.  This was fine. Didn’t think the ratio of wondrous to price was acceptable. So just an average 3 stars bc I cannot give 2.5."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoOHRUWHJRRRAB",
            "text": "Jack & Charlie is the perfect spot for a relaxed dinner or lunch in the spring. Really loved the cozy dark wood homey atmosphere. Food was really great - some of the best brunch food I've had in the city!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbXBxSFNnEAE",
            "text": "I am going to start by writing that this restaurant is a winner.\nWhy?\nExcellent waiter team (Daniel and Sonal both have great personalities and made our dining experience enjoyable)\nExcellent service (Our branzino fish was cooked to perfection, it was sooooo delicious. I enjoyed the mac and cheese and also the tuna appetizers)\nExcellent decor (beautiful interiors a perfect balance of old and new world charm; clean bathrooms\n\nI highly recommend Jack + Charlie's for a great dining experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwXzlQUXJRRRAB",
            "text": "Nice restaurant with an interesting menu. My wife had the Chocolate Babka French Toast,\nwhipped cheesecake, berry compote, Berkshire maple syrup accompanied by Wood-Fired Bloody Mary plum tomato, wheated vodka, calabrian peppers. I had the Eggs Benedict which consisted of poached eggs, English muffin, griddled corned beef, breakfast potatoes & mustard hollandaise. The coffee was fresh but there is a charge for each cup. There is also a service charge to use a credit card so bring cash if you want to avoid the fee. I would recommend Jack & Charlie’s No. 118"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtOTRXaFZREAE",
            "text": "Went here last night for my birthday. It was the best steak frites I’ve every had. The steak was marinated in black garlic and cooked to a perfect medium rare. The black truffle toast is also a must-have. Service and staff were also amazing. My only regret is not going sooner!"
        },
        {
            "date": "2년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwMkwyU25nRRAB",
            "text": "Très bel établissement, pour la 2eme fois en 1 an je suis venu dans ce restaurant avec des amis et nous avons passé un très bon moment. La déco du restaurant et du bar sont dans un esprit vintage / moderne bien léché, nous avons dégusté différents entrées et plats avec beaucoup de plaisir. Les produits travaillés sont de haute qualité et bien mis en valeur en prenant le soin de produits de saison. Le service est efficace avec savoir-faire et savoir- être. Je recommande fortement ce restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwNHFleUpREAE",
            "text": "the best thing were the appetizers. the mushroom tartare was tasteful and well executed, it was hard to believe they were mushrooms. the chopped tuna was spicy and soft. the cheddar popovers were good but a bit burnt on the outside.\n\nthe mac and cheese was a little disappointing. it was gritty and the cheese sauce was not well bonded to the noodles.\n\nthe fusilli, although it had a tomato sauce, tasted overwhelmingly like lemon.\n\nthe desserts were amazing though. the strawberry shortcake was fresh and sweet. and the banana cake was rich and decadent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqak92aFNREAE",
            "text": "Great bistro. Loved the pretzel bread and spicy mustard, and the toast with the bacon jam.\n\nWe got the burger, pasta, steak, and pasta. Everything tasted great and the ambiance was very warm, professional, and cozy."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyc2JTNEZnEAE",
            "text": "If you haven't been to this amazing new place you are surely missing out!  This has quickly become my go to in NYC.   Everything i have tried so far has been fantastic, but the duck meatloaf is off the charts.\n\nGive Jack & Charlie's a try, you will not be dissapointed!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaN3NHeGpnRRAB",
            "text": "A a trip to Jack & Charlie’s No 118 is a trip to the NYC supper clubs of the bygone days, just with a touch more flair and fewer flappers. Let’s talk food…\n\nThe chopped tuna? A delightful prelude. The mushroom tartare was a revelation! Who knew mushrooms could be so... flirty? That pistachio crust on top was the Beyoncé of all crusts - a true showstopper. It’s crunch complemented its flavor beautifully.\n\nFor those that are citrus-inclined and are okay with surprising flavor, the lemon pepper wings are a must-try.\n\nWhen glancing at the menu, I had my eye on one dish… The Duck Meatlof. This was confirmed by my dinner comrade who had been here a few times before.\n\nNow, the teriyaki salmon was a bit of a gamble. \"Why order fish in this meat palace?\" pondered my comrade aloud. His fishy verdict? A peculiar 724 out of 1,000. Not quite the Rolling Stone top charts but it wasn't bottom of the barrel either. Personally? I was all aboard the Salmon Express.\n\nA special shout-out goes to Julia, our server. What a gem! Not only did she deal with our table shenanigans with grace, but she also tempted us with a flaming crème brûlée. Side note: I'm starting a petition for the return of the truffle toast. Julia's got my back on this.\n\nIn summation, Chef Ed Cotton, the mastermind behind this 100-seat New American dining marvel, has created a space that pays homage to the past while serving dishes that are distinctly now. Venture forth to Jack & Charlie's No 118 for a night of gastronomic delight and mild mischief. And maybe, just maybe, order that fish. Because why not?"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbGZqWjZ3RRAB",
            "text": "Long anticipated opening that did not disappoint.  Chef Ed Cotton and his support of local purveyors makes this menu extra special. Fast at least 4 hours before dining. The cocktails and bar bites are heaven but leave room for the signature Duck Meatball, Wild Mushroom Agnolotti, Clam Chowder, and dessert. Come back for the Prime Rib Fri and Saturday. Not a sponsored post. Definitely worth a few visits and a go to spot while in the neighborhood. Victor Jung co-signed and approved."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMFlmUnp3RRAB",
            "text": "If you have a brunch sweet tooth and love ambiance this is the place for you… chocolate babka French toast was insane! Stole some French fries from partner’s dish and he loved his sandwich too"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKeHNYOXRRRRAB",
            "text": "Should have asked for the bacon and fries to be crisper.  Great service and ambiance. They even provide a little stool for the ladies' purse."
        }
    ],
    "reviews_count": 74
}