{
    "name": "Lava Shawarma NYC",
    "place_id": "ChIJTTfzLtRZwokR0mfPGAXfBhM",
    "grid": "MN2",
    "address": "226 Thompson St, New York, NY 10012, USA",
    "rating": 4.5,
    "user_ratings_total": 780,
    "phone_number": "(646) 490-5080",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSMVpISjFXa2t0Tmpoc2FHSlpjMDVVWmtKeE9WRRAB",
            "text": "Nice spot but the shawarma was super dry. Friendly staff and chill environment. Superb homemade pita, hummus, and spicy sauce"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TlJtWllWalIyUlRod2JIaGtWRUl6WmtkYVptYxAB",
            "text": "Nice"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNU9YZ3RZM1pCZUcxbGFsbzNhMFZGWVRWdVIyYxAB",
            "text": "I’m a big fan of shawarma, but this was the worst shawarma I’ve ever had. After just one bite, none of us could continue eating  the bread had a strong, unpleasant oily smell, and the overall taste was off. Very disappointing experience."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gak0yVm5kVGt4ZUVaamFHbG9OVmhwYW1WNGVYYxAB",
            "text": "Cute little pocket in West Village!! The chicken schwarma was fire and the workers are super nice."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjMlJuYzVOSFZvYlhKVmJXUjNNMVZ1TjBsVWRrRRAB",
            "text": "Delicious, affordable, really kind people, and I love the decorations and atmosphere!❤️"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSVFJIRjZRWFE1ZFhSbGJWWnZXV05HV1hwWk5GRRAB",
            "text": "I can't help smiling when I eat at this restaurant. This spot enjoys a central position. Their staff displays real hospitality. The dish contained rare elements yet came without delay. Everything from service to food was great & I want to return soon!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCcFEyMXNkVjlUTjJrMVNYQk5TRmRXZVY5RlYwRRAB",
            "text": "The food was incredible and amazingly delicious. I came I saw I ate and left with a happy smile and happy stomach"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205elMxQkpTVFJSTjFZdFJYRkRZbTV0UlRKT1dGRRAB",
            "text": "MASHALLAHHH. Best shawarma in NYC"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KWFEyMTRaSGcxYVV0a1dETm1ibVZ6YXpSU1ZHYxAB",
            "text": "Everything was amazing get the family meal you won't regret it. My only criticism is they need a bigger space, it can be a little difficult if too many people are standing or maybe rearrange the seats. Other than that the staff were well mannered and nice, the food was flavorful and fresh. Please try tabbouleh and hummus, they aren't just sides but enhancers for the dishes. I look forward to you next location and growth"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oNlRHOVRSWFJ0Y2xGemVYaHJPV2haUmxNMVNYYxAB",
            "text": "Lava Shawarma always has great food, fresh and flavorful. I do wish the serving sizes were bigger, especially since prices have increased since they opened. I think they could do really well with a mixed restaurant/cafe vibe like some of their other locations especially since this spot has a lot of students around.\nThe reviews complaining about the place being overly 'political' are funny. It's a Palestinian business right next to a college."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSE5URjFaRmRZVFMxclRGQlRXVmxqT1ZCMk5HYxAB",
            "text": "Great food!!! I will come back.."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kMlkxODRia05xWm5CSUxYZzJkekZZUXpkRk1sRRAB",
            "text": "This place impresses repeatedly. The cooking impresses while the prices remain fair. The personnel mix friendliness with careful observation. The service team was accommodating in a well-kept restaurant. We're sure to return in the coming weeks."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OalNHNUdVMnBDZGs5M04yZFNOa05PV0ZOMFNFRRAB",
            "text": "Tried Lava Shawarma for the first time and it did not disappoint. Fresh, flavorful, and the portions were perfect. Definitely worth checking out."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCc2EzSkJRM0JSUmxGTlFuRnFhblpOTVZsNFRYYxAB",
            "text": "The food quality ensures this won't be my only visit. The staff members are cordial and ready to help. Didn't think this part of town had such places. The large servings make the pricing fair. I want to try more dishes here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsemRVMXVZamxzT0dwVWRHbGhVMngwWWxVeldIYxAB",
            "text": "I found a new standard for dining satisfaction here. You get quality dishes without overpaying. The kitchen uses ingredients that taste better than most. The workers exhibit remarkable warmth. To conclude: Lava Shawarma NYC is amazing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsbFVUWm5TVFJYTVVKSExURllXRkZZWlRkbmFYYxAB",
            "text": "Great shawarma but pricey. They should make a combo with fries . I paid $24 for both."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4cWRqTTBWMGs1ZFVzM1MySm9TMlJLTkY5S2FIYxAB",
            "text": "So yummy and generous portions"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUmQyWXdPRk5XUmtSUmRWOXRibGxpU1ZwWGIyYxAB",
            "text": "Prices keep going up and up and up and sup and up\nGreedy!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvMldtWnZXRlYyZVUwellWbGtPVU5vUlhWNFMzYxAB",
            "text": "Best food in the town by far I have tried"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkbVVUTmZURk5TYWpWdE9HNVNaalJMVG5rdGIyYxAB",
            "text": "Full chicken and as very good\nAnd shawarma plate was also good"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MWRmRmpnRRAB",
            "text": "It was great until we had to order and the waitress didn’t speak English. Was looking at the menu to type in the order. They then proceeded to get our orders wrong and kept handing my order to my friend. My friend ordered shawarma and I said I don’t want meat. They proceeded to give us both no meat, asked if friend wanted the mistaken meal for free and then charged her when the bill came. Friend complained that her food was tasteless and with all that trouble to get there i don’t think it was worth it. As much as I want to support Muslim businesses, I will not be able to come back to this restaurant. I also think I was lowkey treated weirdly because I’m black; it makes no sense that all my food was given to my friend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xWE0zRnBPWEZ6Y0dNMmRGZFliamczUTI0MFIwRRAB",
            "text": "Amazing vibes!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VeWVuRjVXWGQzZDJ4bGVYTk9UbEZ5Ymw5SFFVRRAB",
            "text": "Everything taste just please work ur fried its to oily and the beaf too."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzNVdtTjVlazloZUU4eVpIRnRNV05EYUZWU1YwRRAB",
            "text": "1am and this place closes at 2am, on the walk in the whole staff is outside smoking except one...wearing Lava gear...looked at the menu and no one acknowledged us, no greeting or asked to take our order. Walked our and one asked why...never again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCblMyMXZUREJoY1RaVVptVlRXRGhPTWs5VGFGRRAB",
            "text": "this place was a very pleasant surprise with its quality of food and service. This is the most delicious food I have eaten in New York recently!!! I highly recommend it!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kblNVdEhZMHhYUlZvd1YwcFFSbkl6VjJRNVZsRRAB",
            "text": "Delicious food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taTVFYWmZhWGgwVm1wdWNYaHhZV1ZMVkZwTFMyYxAB",
            "text": "Yummy but too salty. Nice place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdE5tODBTbm94WDBWdU1HRnVjMGhZYzJWa2FXYxAB",
            "text": "You won't find a dish that's just okay here - everything's good. The atmosphere balances comfort, cleanliness, and beauty. Their staff showed exceptional understanding of dining standards. I plan to become a regular at Lava Shawarma NYC if possible. You'll leave impressed by every aspect."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCSVoyRkZNVWhNUW0xU09XUlBkall6VUVWWlozYxAB",
            "text": "I got the chicken shawarma with fries and it was absolutely delicious highly recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdVN6VnZNM1V5U21SeGNqbFNSVGt6UVUxU1NIYxAB",
            "text": "I had Dubai chocolate strawberries here. They were really good! A little sweet but not too much. They added Belgian chocolate in the strawberries (I would have preferred dark chocolate though). Strawberries were fresh and sweet. There was a fountain of pistachio butter, which looked pretty.\n\nThere was someone in traditional clothes serving hot tea to everyone for free. Tea was good!\n\nOverall, loved my strawberries."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRmN5MHlaSEExZW5Jek5EbEdXa280YTJkQk0yYxAB",
            "text": "The food was good but when we entered no one checked on us, we had to call a waiter to order food. We were not served water (while our neighboring table did), then we had to wait 15 mins for someone to come and give us our bill."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWZk9UWnJXbmhUV25RM2FHVmphV1ozUVd4MmMwRRAB",
            "text": "This place had Dubai chocolate for 10 dollars there was a wall that said all languages that says welcome"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wWlp6bHZNV3BWVFROMFJURlNNbmhNTFdOUGFVRRAB",
            "text": "Halal certified, kids friendly menu, clean and beautiful location. Inside decorations are beautiful and very aesthetic. Food was delicious and fresh, would definitely recommend this place and come again. The service was on top and waiter was very friendly and patient!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWQ2FGTjBWR3R6ZEdGWE1YUlhTV1owV2poMlUyYxAB",
            "text": "Was relaxing in Washington Square Park, enjoying some live music…someone was playing Aqualung by Jethro Tull, which I hadn’t heard in decades. Props for the throwback and the originality!\n\nStarted getting hungry and ordered the chicken shawarma from Lawa Shawarma, just a short stroll from the park. It was well-cooked, juicy, and hit the spot perfectly. Service at pick-up was friendly and efficient.\n\nThere was a small mix-up with the tip…I was overcharged, but to be fair, I didn’t have my reading glasses on, so the decimal might’ve been my doing. I called the restaurant, and Marwan went above and beyond to look into it and resolve things.\n\nWhat stood out was how he took my concern seriously while also respectfully defending his team (by gently pointing out it might’ve been my input error). That balance really impressed me.\n\nThanks again…will definitely be back soon! 🤛🏽💗"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kUFlVMWtVR0ZMWTBSQ1RqQlhYM0ZPVDJKMmJVRRAB",
            "text": "Went there fresh off the plane during Ng a heatwave and had a salad with halloumi on the side and a lemonade. It was a generous portion that I didn’t think I could finish but it was absolutely delicious and refreshing for the weather. My only regret is I didn’t have time to go a second time to try their shawarmas, they looked delicious too!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsWWVGOUNkRFI0ZFZCUWNsSTRPR3hUZUVob1owRRAB",
            "text": "The food was so so. We waited such a long time for fish and chip and it turned out to be so small."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwSWRtcFJObW80Ykd4U1pGUk1jWHB6Um1OcmJuYxAB",
            "text": "The waiter is rude, impatient and inattentive. The food is ok. This branch is definitely worse that the one in Chelsea."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWT1dsWkdUREZtZHpSNWEwVmZabkF4VkdScU9XYxAB",
            "text": "Shawarma was just okay. Service is very slow, had to wait for around 25+ minutes for a shawarma sandwich."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWFlYUkRPRU40ZUd4VmVtNURORzlwVHpkeVgyYxAB",
            "text": "Great shawarma"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xselJtc3RVMWxTT1dSbldUbFNXVmRVWkZGbGFGRRAB",
            "text": "The ambiance was very welcoming and the food was amazing. We ordered Baba Ganoush and different Shawarma dishes. Extremely flavorful, fresh tasting, and well presented. Although very busy, the service was attentive."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xaU1HZzFVSGRzU0UweGQwbGxSMkpKYUc1dlFuYxAB",
            "text": "No frills, just dang good food here.  Been searching for an authentic tasting shawarma for a long time, and this is THE place that I think is the most similar tasting to the ones enjoyed in the middle east.\n\nThe lamb and beef are my favorite, amazing combination of flavors. They cut the shawarma into bite sized pieces so it's really easy to eat too. Wonderful place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSbFRqVXpRa2R0T0dZMVoxaGtjV2hoZFdOUE0xRRAB",
            "text": "The smallest and driest chicken shawarma I’ve had in a long time."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tremVGRkVYMjlRYTJSeFozVmlXRTVPZDBOVmRHYxAB",
            "text": "Amazing food! Everything is fresh, the music not too loud, great price"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0QlNXNVRaUzFyVUdScFFscFBZak4yY1VrMlNtYxAB",
            "text": "Just went here and the food was absolutely delicious. Highly recommend their shawarma mixed wrap, and their falafels and hummus were also great. Also a good choice if you’re a garlic lover (their garlic sauce was hella good). Plus the service was great and our food came super quickly!😋"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twMk1GVnNiV2hIY1dKamVYRjRUMnhJT0VKd01rRRAB",
            "text": "I really like the food specifically falafel and hummus, must try place. Marwan provided us best service.\nThank you"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsV1VWRllTR2czWVVSTU5WbDFhREZOV1dZMGFuYxAB",
            "text": "Horrible food quality."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1b3JldW13RRAB",
            "text": "램버거 진챠 개맛있음\n서비스 개조음"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VQVFdoZVMtOU5DcUFnEAE",
            "text": "I stopped by Lava Shawarma around 10 PM for a late-night bite and ordered the chicken shawarma and lamb burger. The food was decent,  nothing mind-blowing, but satisfying enough if you’re hungry and looking for something quick.\n\nThe chicken in the shawarma was tender and flavorful, definitely the highlight of the meal. The lamb burger had really nice buns, but the patty itself was a bit cold and didn’t quite deliver on flavor.\n\nI got my order to go, but there was seating available if you want to eat in. Service could’ve been better, the person at the counter was on the phone while taking my order, and the cooks were eating while prepping food, which didn’t leave the best impression.\n\nOverall, it’s a convenient spot for a quick bite, but there’s room for improvement on both flavor and service."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveWR5ZnZRRRAB",
            "text": "Lava Shawarma offers a tasty beef and lamb shawarma—well-seasoned, tender, and satisfying. The garlic sauce was a bit too intense for my taste, but the overall quality of the food was solid. Staff were polite and service was smooth.\n\nHowever, the ambiance was noticeably political, with strong pro-Palestinian messaging throughout the space. While political expression is understandable, some of the imagery and slogans gave off a tone that felt uncomfortably one-sided and, at times, veered into what could be interpreted as antisemitic. It made the dining experience feel more charged than welcoming. If you’re going just for the shawarma, it’s worth a visit, but the atmosphere may not sit well with everyone."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQYnZoN2VPd0pDWXpRRRAB",
            "text": "I love this place and hopefully won't make it crowded after this review. I came here 3 times and the food is fresh, great quality, tasty, the amount in the plate is generous. The chocolate Dubai they sell is delightful."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cGNLUl9RRRAB",
            "text": "-Casual Palestinian Spot-\nHalloumi wrap is so rich and delicious. Menus are crowd pleasers variety mixed ranging from burgers to falafel to wraps to hummus to vegan dishes. I will have to return to try something else. Ambience is laid back filled with folk arts, political posters and messages."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnLUptdFdBEAE",
            "text": "I’ve been to Lava so many times that writing a review now seems a little anticlimactic. It’s one of my favorite places in the area— they have a ton of options in their menu and everything is always delicious. I have had just about every vegan dish, from the platters to the sandwiches to the appetizers. The staff is warm, kind, and extremely patient even when we bring large groups of loud people. Th portions are very generous and the veggies always taste fresh. Love you, Lava!"
        },
        {
            "date": "5달 전",
            "language": "ar",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLQ211Y3puOTktLXl3RRAB",
            "text": "الاستقبال ممتاز\nالشاورما لذيذة\nالأسعار مرتفعه ومناسبة للخدمة المقدمة\nهل سأكرر التجربة نعم بالتأكيد"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dEtLd1JBEAE",
            "text": "Pleasantly surprised with the food and the place.\nTotally enjoyed the food. Tried Shawarma and amazing. My family tried other food items and were very happy with the food.\nTheir burger and lamb chops were also very good.\nThe place  nice and big bathroom which makes this place a nice stop.\nHighly recommended if you like middle eastern cuisine."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJN19LMW1BRRAB",
            "text": "Excellent experience. Fresh, taste and authentic food. Service was outstanding. The place gets very busy very quick glad we got the spots we needed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNueU95cjJRRRAB",
            "text": "Casual, cozy place for tasty middle eastern food. Reasonable prices. Order the Lava Plate. Tasty but the meat was somewhat dry. Falafel was delicious and highly recommend! Coated in sesame seeds and served fresh.\nI also really enjoyed the complimentary spiced tea!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMnBYd29nRRAB",
            "text": "Stopped in for a craving I was having on 4/20 lol. The Dubai chocolate strawberry cup… the best taste so homemade. Compared to the one I had in Jersey.at another place that charges 9.00 extra lol. The price was great and the taste was extraordinary"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmN0xueVdREAE",
            "text": "Spectacular place for Middle Eastern food. It's a hidden gem in the village right by Washington Square Park. Get a side of hummus with your sandwich and enjoy the complementary Tea at the end."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbnNQc19BRRAB",
            "text": "This was such a disappointing experience. I was really excited to eat here, especially after reading the reviews. I’ve been craving Shawarma for months, where we live options are so limited. Service wasn’t great, not friendly and misheard our order. We ordered the hummus, lamb and Arabic chicken shawarma. The gave us labneh instead of lamb. Could have been an honest mistake but the first server didn’t seem to care or want to rectify. Half way through us eating, our server changed and he was nice and much more attentive. Food was so mid. No flavour, bland. Incredibly disappointing."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJM1cwYm55NXNUY2FREAE",
            "text": "The food, and the service are phenomenal. Went in hungry and left completely satisfied. Highly recommend and will come again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYZzg2TFlnEAE",
            "text": "Went to this place for the first time today. Their vegan grilled platter is out of this world. I ordered it with a side of beet hummus which was lightly sweet and so so good. All vegetables and sides were fresh and so incredibly flavorful 🤤🤤🤤\nService was great, overall atmosphere of restaurant was lovely and welcoming. We ate outside at a small table and the outdoor seating was simple but very pleasant :)\n10/10 and definitely coming back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRMGVIQXd3RRAB",
            "text": "This spot is a MUST if you're in the area !! Cozy atmosphere , great food, and unbeatable prices. Staff is incredibly kind and welcoming! + highly recommend the falafel here !! some of the best I've ever had. Definitely will continue to be here every week! :)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbDgtdHh3RRAB",
            "text": "A nice small Palestinian restaurant with a sort of rustic NYC decor. My plates were the chicken biryani and a side of vegan samosas. Extremely delicious food that I would almost describe as being half home made quality and half restaurant quality which is usually the best. Would definitely recommend when taking a break with all the festivities in Washington Park."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoenN5Y3ZRRRAB",
            "text": "Charming Staff. Open until late. Really distinct flavor combinations of the Middle East; each bite layered and great paired with lightly sweetened Arabic Tea. Aromatics Lemon, Extra Virgin Olive Oil, Cardamom, Sumac, Tahini, Fresh Parsley tickle your taste buds in each dish. Great plate Presentations, Fresh Pita, Fresh Herbs; Great Vegetarian and Vegan Options. I recommend, Stuffed Grape Leaves, Lentil Soup and Chicken Shawarma. Authentic, Savory, Fresh and Affordable. Just Good."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMk5PTGNnEAE",
            "text": "I just visited their new location on the Upper East Side. All the food there is incredibly authentic and very delicious. The staff are extremely friendly, and went above and beyond to ensure my stay was a memorable one. Please, come visit, and experience it for yourself. One of the best Middle Eastern food stops in the city!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSam9POFRBEAE",
            "text": "Got their lamb kebab sandwich. It had good flavors. The lamb was freshly cooked. The bread had a good crust. It was roughly the size of a kebab pita. You will probably need to order more to get full. The vibe of this place is like a casual cafe at 2pm. A good place to have some casual food and sit for a while."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveThMWlRREAE",
            "text": "Super delicious chicken shawarma & salad. The staff is so friendly and professional!\nLove the place and will come back every time I can"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbkw3QmJ3EAE",
            "text": "It's a small place that serves food late. They also have paintings hanging on the wall that's for sale, which is different. The chicken kabobs were excellent. However, the chicken in the biryani bowl was very dry."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbFBldjRBRRAB",
            "text": "Great service!\nCan’t go wrong with the Chicken Shawarma.\nTheir lamb burger was very delicious too. You can skip on the lamb skewers and choose the Lamb Grounded(Kofta)"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzMUozRDlRRRAB",
            "text": "Went on a Sunday after an event nearby and this place was packed. The music was wayyyyyy tooo loud and energy was super high. Ended up getting a takeout because the wait was pretty long. Got the chicken shawarma meal that comes with fries and a drink. It was late by the time we got home so perhaps the shawarma lost its flavor/taste. The fries were good though, well seasoned but somehow the shawarma lacked in taste for me. Will may be try dining in the next time."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2eHZ1S2V3EAE",
            "text": "When I first visited this restaurant, I wasn't sure if the food would be good but it exceeded my expectations I haven't had a good shawarma in a while, and the Chicken Lava Shawarma was amazing it tasted just like home. The food was clean and flavorful, and I loved the Palestinian touch in the decor 🇵🇸"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaHZISTBRRRAB",
            "text": "We stopped in for dinner and it was amazing!!! I ordered the chicken kabobs and it was delicious, I also ordered the mango juice and it was INCREDIBLE! The service and atmosphere is incredible, very friendly and fast! We are definitely going to be coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5LXRlY2dBRRAB",
            "text": "The guy working saw me taking pictures with my camera and asked if he would see the pictures on google. “Inshallah” Amazing food and the shawarma was incredible. So good we ordered extra to take with us. 100% recommend it. Based on this review I hope many more people will eat here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1dG91ZWFREAE",
            "text": "The staff are pretty cool! They were playing Linkin Park radio which was pretty frickin cool as a LP fan myself. Food was really delicious, some of the best falafel I've ever tasted!! They give you free tea which is so unique in flavor!! So good"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaeHN6T3VRRRAB",
            "text": "Nice and welcoming place. We visited late in the afternoon on a weekday, and it was quite relaxing. We ordered the Chicken Shawarma Arabica (LAVA) and the Lamb and Beef Shawarma Plate. Both were good and delicious. The portion of the former could be a little larger."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURacElUelVREAE",
            "text": "This is one of my favorite places in NYC because the vibes and the people are so nice.\n\nIf you’re looking for a lamb sandwich but nothing from a food truck, this is a great place! The portion is filling and it’s $13. I would say try their grape leaves too, but the makdous is nothing like the actual makdous. Their tabouleh could also be better, finer dicing and more lemon juice.\n\nI was super excited to see makdous offered in NYC but it’s nothing like makdous so don’t spend money on it. However, their sandwiches are great! I haven’t tried their chicken shawarma but my friends said it’s really good.\n\nYou can also get ice cream inside the shop! And most importantly, the food is halal!\n\nThe restaurant also (I think) sells Zamzam water and various teas.\n\nAll in all though, this place good that I went to get their sandwiches 3 days in a row. If you’re on a tight budget but want to eat more than food from the trucks, give this a try!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0c0wyamVBEAE",
            "text": "Bonus points for the Pali decor! Service was bad for my order but good for the rest of the table. I got the wagyu burger and asked for it to be made spicy which they totally forgot. Tabuli salad was great and hummus was good as well with sauces and olive oil. I wish they had an alternative for white pita as white flour is the worst of the worst you can consume."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqdmVlNXNRRRAB",
            "text": "This is the best Mediterranean food I’ve ever had so far in New York, considering factors like price, environment, and service. The owner and staff are super friendly.\n\nIf you love Mediterranean food, I highly recommend it. Simple, fast and price reasonable.\nBonus: It is located near a very posh area like prince street with a quiet and chic vibe around."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCemJtWjZMVXRCYjNWUk1XVlhMVkZXVkVzemVGRRAB",
            "text": "I've found my new go-to spot for eating out. This place shows modern taste with spotless surfaces. The employees helped me in ways I didn't expect. Food quality was obviously very high and full of ingredients that I had never tried before. Recently moving nearby, I'm delighted to have found this spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUenNxMGpnRRAB",
            "text": "We stopped by on a weekday for lunch after a  college tour at NYU. Nice cozy place, it wasn't too busy. They had a good selection to items to choose from, with vegetarian options. We got the vegan mixed grill plate and chicken shwarma. Food tasted good, hummus was excellent, the vegetables on the platter were a little overcooked.  Nice place for a quick sit down meal. Be aware they charge an 18% service fee for all tables, no matter what the size of the group is!"
        }
    ],
    "reviews_count": 80
}