{
    "name": "Spicy Moon West Village",
    "place_id": "ChIJZRP3DW9ZwokR6NnJ9PaMZxI",
    "grid": "MN2",
    "address": "68 W 3rd St, New York, NY 10012, USA",
    "rating": 4.4,
    "user_ratings_total": 1364,
    "phone_number": "(646) 590-1390",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5WU5uZGpjbk5MWkZabFFuZFpkbnB5VEVGQ2RWRRAB",
            "text": "Decent enough vegan option, but not as good as their east village location. Mapo tofu is a miss without pork, dumplings are ok."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swM1J6ZEpVVXhUVFRGb1gzUk1jV3h0UVRGRGQxRRAB",
            "text": "Racially profiled on Halloween.\n\nI am so deeply disappointed in the experience on Halloween that it pains me to have to write this review. I've been patronizing Spicy Moon for years, and I was disgusted about how I was treated last night. My significant other and I were downtown for a show at Blue Note and wanted to get something to eat before the show. I RAVED about this place and told him to look at the menu while I headed to the bathroom. He must've not heard me too well because the music was blasting, and the front was chaotic. There was a Latino man guarding the door around 9:15 PM (slender, low cut). As I walked to the bathroom, I see him running behind me as if I stole something. Sidenote, I am a 30-something-year-old Black woman who simply decided to use the restroom, because, you know...I've patronized this establishment numerous times.\n\nThe man decides that I am an easy target to scold and yell at. He approaches me with a very nasty attitude and yells, \"YOU CAN'T USE THE RESTROOM IF YOU'RE NOT EATING DINNER.\" I reply, \"He's looking at the menu.\" He hesitates and assumes that I'm lying, because once I leave the restroom, my significant other tells me that he actually asked him if he was with me, to confirm whether or not I was lying. Once I realized what was happening, we left and I knew the man felt very low because he couldn't even make eye contact with me.\n\nSpicy Moon, do all of us a favor and train your staff to appropriately interact with customers without racially profiling them. The place was crowded for Halloween, and the only person he felt the need to harass out of all the people there, was a Black woman.\n\nI will never come back again. The food has gone downhill, and yet, I've still patronized. But the experience I had last night will forever be etched in my mind, and I refuse to go to a restaurant that treats me like a criminal for using the restroom before making a reservation."
        },
        {
            "date": "수정일: 4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOZlpuWlJOMGw1U1VoME9HRXdWM0ZmWVVWNlVFRRAB",
            "text": "Our dinner at Spicy Moon was delicious. We tried Dan Dan Noodles that had a nice flavor profile to it and not spicy for us. We also tried Veg Steamed Dumplings that were good and Veg Lo Mein, which had more of sweet profile and Veg Fried Rice which was good too.\nThe interesting appetizer was Taro Fries,which was thinly sliced and deep fried. They also drizzled some honey on these fries which was pretty delicious.\n\nIn short, the food and service were pretty good and I would definitely recommend.\n\nEdit -\nMade a second visit with my friend and we enjoyed our dinner again. Each dish was delicious."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnNFRXNDRSMU5FZDJ0ZmJVSk1ZbWxFVTA5b2VXYxAB",
            "text": "I’ve been coming since 2021 and there has really been a sharp decrease in quality. The prices are so high and the food is deeply disappointing. The Hen of the Woods bao is *one* bao for 9.50. It is a piece of fried could-be-anything and the bun. If there was sauce, I can’t remember. No chickeny taste. You have to *pay* for rice with the Mapo Tofu which clocks in around $18. And the Moon Bowl was drowning in teriyaki sauce. Also featured fried could-be-anything."
        },
        {
            "date": "수정일: 1주 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3b2JMVnd3RRAB",
            "text": "너무맛있고 분위기 좋았어요 ~!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MFltdE9kVEJ1UjB4a2REZzNZbFYzUlVoM0xXYxAB",
            "text": "pretty gross, nothing about this place stands out as done well, won't get food here again"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wdU9WOTRSbTFDU0ZOemNWQkJhRzQyVVhsNGVGRRAB",
            "text": "DROOLING just thinking about this place. I wish I lived in NYC so I could go here all the time ahhhh.\n\nLOVED the Mapo Tofu and Dry Pepper Style, went back literally the next day to get the exact same thing."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsSFF6aEVRbnB2UldkUVIzSmxOR0ZPZFVvdFNIYxAB",
            "text": "Good vegan spot in the city.\nWe were seated at a small, wobbly table placed on a steel plate right in the middle of a busy pathway — not ideal, especially since most of the staff had to pass by us constantly. It’s not the staff’s fault, of course, just an unfortunate spot (kind of a blind spot next to the bathroom and far from the larger tables).\nThat said, the food was good!\n\nHighlight of the night: The Kung Pao Veggies — absolutely delicious. The fried tofu was amazing, and the mix of tempura-fried veggies tossed in a sweet and spicy gochujang-based sauce really hit the spot.\nDumplings in Chilli Oil: 2.5/5 — Flavor-wise they were decent, but way too oily for my taste.\nMushroom Bao Bun: Tasty, but the portion felt a bit small — just one bao per order, which was a little underwhelming.\nThe servers were kind, humble, and clearly doing their best amidst a packed weekend crowd. Service was fast considering how busy it was.\n\nThere’s a wait time if you haven’t reserved a table make sure to reserve one."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsdmRIcGxaVWw0TmxwSVJsaFVhMlJ0UnkxTFVIYxAB",
            "text": "Had a great time at spicy mood. Recommend the wonton soup and cucumber salad. Their 5 spice Negroni wasn't very five spice tho.."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WNFgwMHlaMVJXVXpVellraHpUSFo2Y2pVeU5YYxAB",
            "text": "Spicy Moon is a total gem. From the moment you step in, the chilled vibes and great music set the perfect mood. The Chopped Cheese Spring Rolls are an absolute must—crispy, savory, and the dipping sauce? Incredible. The Dane Noodles are packed with fiery flavor, and the General Tso's Mushrooms have the perfect crunch with a juicy, umami punch.\n\nWhat really stood out, though, was the service. Sayeed was friendly, attentive, and made the experience even better. The whole experience left me thinking, I might need to relocate just to have access to this place more often.\n\nHighly recommend this spot — you won’t regret it!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVWFHMUZZVGRNTlZoc01WcHdNMW90UjB0RlVIYxAB",
            "text": "Bad experience especially the unpleasant girl by the entrance."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKSFduRTFiMnhZUW1kNllXZHpkRUZFY3paa2FtYxAB",
            "text": "Fantastic vegan restaurant with generous portions and warm, welcoming service. We came here for a celebratory dinner and truly enjoyed the experience. The food was hot, fresh, and absolutely delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200emRYUk1jMnh6VmxGS0xVRXRNVWRCUmxOd2RrRRAB",
            "text": "I used to frequent this location back in 2022 and the food was pretty good then, but since then the portion sizes have shrunk to half of what they used to be, the flavors are pretty bland and weirdly sweet (as a Sichuanese vegan person I think I can judge this), and the prices are ridiculous (you can get the same thing you get here for $30 for better quality in Chinatown for at most $8). For a tiny bowl of noodles and wonton soup, that should be pretty cheap. We also got a drink and it was way too sugary and unappetizing.\nFinally, maybe this is just personal preference but the atmosphere itself had kind of consumerist/pop culture-y/gentrification vibes and obviously directed towards clueless people who don’t know where to find better Chinese food.\nI still appreciate this place & chain as a vegan but I believe I have to be harsh in order for it to improve. Until then I probably won’t be going back…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toUlJUUnhWVkJXUlZkS1l6VjNhR3RPTFc5NGMyYxAB",
            "text": "Amazing food!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nd1VXNHdabkV5VEcwM09XWXlNeTFNVFZSdk5VRRAB",
            "text": "Food was great - consistent with the other locations. Service sucked at this location though"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KUlgyMUpkSFJ5YUdRMkxXdGljSEZSWHpacmRYYxAB",
            "text": "Please beware of the ridiculous tip calculation here! I had a lunch special here, $20 cost including tax, but their calculation showed ‘20% tip - $7’. How? Because they calculate tip based on menu prices of regular size dishes, even though lunch specials have smaller portions and discounted rates. Be careful before you hit the automatically calculated tip here - they’re trying to rob y’all!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CU1NsTlRNWGs1VDFGUGNrSjNMVWd6TlZGZlNWRRAB",
            "text": "Walking in alone, I was blessed by such good energy from the hostess Kaydeen. She accommodated my complicated seating needs, and made me feel welcomed. I ordered half of the menu to taste with a friend of mine, and every dish was made exceptionally well. The Dan Dan noodles weren't as spicy as I expected, but just enough to be an enjoyable spicy dish. The rest of the staff was also nice and welcoming, but Kaydeen went so above and beyond, I'd come back for just her! Such a wonderful experience. Highly recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kSFNqQnBhVVF0Ykc4dGRHWTVObmRIVUc5VVoxRRAB",
            "text": "This was hands down one of the worst dining experiences I’ve ever had. The food was not just disappointing, it was borderline unbearable. Every dish was drowning in oil and loaded with an overwhelming amount of spice that masked any actual flavor. Instead of enjoying my meal, I left with heartburn and an upset stomach that lasted the rest of the night.\n\nTo make matters worse, everything seemed to be overloaded with MSG. The aftereffects were awful — a pounding headache and that “foggy” feeling that no one wants after eating. It felt less like dinner and more like a chemistry experiment gone wrong.\n\nIf you value your health, your taste buds, or even just a comfortable night’s sleep, avoid this place at all costs."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwR05scDNOVlkyWlRneGRWRTFObGhVVm1OM05FRRAB",
            "text": "I can't imagine a better place than this for a vegan spice lover, I had the fried tofu bun, dry pepper drumsticks and chopped cheese spring roll leaving me stuffed but I couldn't bring myself to leave a bite behind. Service and atmosphere was fantastic too"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKR0xWOVNkM1ZVYldKUGMwb3lhWFpsTUhsdFpYYxAB",
            "text": "They are amazing!!!!!Everything was super tasty🤤Specially “GF Dan Dan Noodle\",,, I wanna eat again!🍜"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZeVJHTTRXRVppVW14VlIxQlNhMmhCYm5WNFkxRRAB",
            "text": "The food and service is outstanding. All vegan and delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsc1pFZE9TV1ZHUW5JdGMwbG5XV3RZY2t0Q1IwRRAB",
            "text": "Went there to have dinner. The food was great, but the real star of the evening was Charlie, super sweet and helpful. Charlie deserves all the flowers in the world. Thank you!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGblVHTnhhREI0T1U1SU5ETk5jRU5xVG5WMlVYYxAB",
            "text": "$33 for chicken n broccoli and was served HALF the amount i usually get!!! it was also dry with absolutely no flavor and barely any chicken. extremely over priced to be getting skimped. they have changed the ingredients in the lo mein about four times in the last month today it was extremely dry as well w no sauce or anything. very disappointed this was one of my fav restaurants but after the dry food and small servings today im not sure ill be returning"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWk9YbFhiV3N5TlVwcmFIUnBUMUpPWW5kRmQzYxAB",
            "text": "Foods are delicious. Favorites are salt and pepper tofu and Dan Dan noodles. I practically order them every time I go here"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKMmEzSmZWMWxCWlc5MlFVaHNWRGw2UzFseFVrRRAB",
            "text": "This place serves Jain Food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twYVZVZzNUbFZLU1dreGNrVXlVMlpxUm5sV1lYYxAB",
            "text": "Ordered through Uber to my hotel room expecting fantastic vegan Chinese, but what I got was nothing but salt. The wonton soup was super salty, and overpowered by sesame oil. The other items I ordered were fried, so my bad, as they don't travel well, but still. Each was pretty tasteless. For the prices charged, I expected better."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWVU1uQmZOSGRoVXpsNWVVSm5Zek5VTlVsTVdXYxAB",
            "text": "Very good food overall, just not excellent. Drinks were mediocre.\n\nBut worth a try IMO."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKSVQzcFVUVUY2ZVdnMGFIRmZWelJHY2pCaWVHYxAB",
            "text": "Great vegan Asian food option!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0RGQycDRRMlZDYlRJNVFuSk1NVnBPUm5KNU1uYxAB",
            "text": "Don’t sleep on the dan dan, sesame noodles, and mapo! The vegetable dishes are done so well too. Incredibly authentic flavors and impressive consistency across the locations. One my favorites. And I’m not even vegan!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZNGFUZDVRekJSY2pocVZrRXdOaTFuWWpWcWRGRRAB",
            "text": "Great food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RFUySXpkWEYwUjJSTVVYa3lPVUpDV0Y5cGJuYxAB",
            "text": "Spicy Moon did not disappoint! The flavors were bold and delicious — I truly enjoyed my experience here. It’s a cute, cozy space with a great vibe. The host at the front was extremely kind and welcoming.\n\nThe food? So good — as you can see, we basically cleared the plates! I did have one issue with an eggplant dish that was unfortunately inedible for me, but the server handled it gracefully and took it off the bill right away, which I really appreciated.\n\nThe energy of the space was everything. It started pouring rain after our meal, and they kindly let us wait inside — we chilled out and enjoyed their playlist, which was soooooooo GOOD. The ladies working there were absolutely fabulous. The men in shirts? Let’s just say they could use a touch more Junoesque charm 😄.\n\nOverall: amazing food, great vibes, and kind service. Would definitely return!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVmEweHVTWFpoVVRZMlNtbDFkbkpUVFVkWVJuYxAB",
            "text": "Before coming here, I was slightly apprehensive about going to a vegan restaraunt, primarily since I'd never been to one before. I'm very glad my partner recommended it because I as someone with no restrictions, I absolutely enjoyed everything we ordered! I couldn't get enough of the mapo tofu when we went. The food that we got didn't pretend to be non-vegan, which I very much appreciated since it owned what it is and did it excellently (if we wanted non-vegan food, we'd get non-vegan food).\n\nVibes-wise, I'd say it's a pretty good place for a date night. What we did was order a few small plates and share them between the two of us, and it worked out perfectly. I don't remember what specifically we ordered since it was a while back, but given I remember the tofu, I'd say that's probably a good bet.\n\nDefinitely recommend, vegan or not."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sa1drVkJUSGw1VDFkWGJsaHdUbEZZYmpGNFFtYxAB",
            "text": "Katie was the best hostes and waitress I’ve had in years. She made great recommendations, was patient in moving us to a more spacious table, and never stopped smiling. I would back to only this location just for her!!! I was in food heaven😇"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wNU1EazJkVzk0VmxsVmVIcGxiVGREYkRneE1XYxAB",
            "text": "If you’re looking for vegan Chinese food in NYC, this is the place to be! The dishes are flavorful, fresh, and beautifully presented. The ambience is perfect—cozy and inviting inside, with a great vibe outside as well. Truly a must-try spot"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KblMwSm1OR0ZDYWxORVVXeHNTMVZOYWxJeVltYxAB",
            "text": "Waiters make you feel valued while offering plenty of choices. The restaurant's title, Spicy Moon West Village, drew me in. These people working here are respectful and quick-thinking. You'll leave with a full stomach and most of your money. Visit this place and you'll appreciate the experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214a1ZHUjBhbDlEUld4b0xXTTVjRzl6TVdSbWNrRRAB",
            "text": "Very cool spot with plant based meat options that actually differ in texture. Food tasted good, service was super polite but a little slow, location is great!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1RGN6RkZTRU5LZWpSVFVuZHBUa1ZGT0VwcFVFRRAB",
            "text": "Dan dan noodles were tasty. Perhaps could reduce the ratio of noodle to other stuff"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZeU1VazNaMkZpVjE5dU0xUlVORTUyUWtJMFRuYxAB",
            "text": "Has decent expectations from this place but never going back here again for the vegan food. It was chewy and overcooked. Did not enjoy even one out of the 8 dishes we ordered. And the prices were ridiculously high for that food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRlpqbHNTSGxLVjJGYVYyODRNbUpqUjFCc1ZWRRAB",
            "text": "All food is spicy"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201QlNtZERRVmxoY25KWWQwRnJTM0pQYkRWcWRrRRAB",
            "text": "A very decent Vegan Korean cuisine restaurant with extremely friendly staff."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SaGJYWXdVMGt6VEVoblRGbExVRXB6Y2t4MVZYYxAB",
            "text": "great vegan menu, lovely service from our waitress kaydeen and wonderful cocktails from the bartender khalil"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SalUxTk1TbXBVZDBkTldqUXphV2wzTkVaNVJVRRAB",
            "text": "The host was super nice and helpful when we showed up without a reservation at 10 on a Saturday night. He got us a table right away, our drink order was taken quickly, and everything came out in no time. We were starved so it worked perfectly. We had scallion pancakes, fried dumplings, duck roll, then gf drumsticks and gf peppercorn Brussels sprouts. Everything was good, except the BS were really very salty. Other than that, they were crispy and wonderful. I considered sending them back, but decided we were too hungry to care. It was with the mains that Spicy Moon really surprised. The gf cumin tofu and gluten free Dan Dan Noodles w/vegan beef were really addictive. Also tried the NA ginger lychee drink - really glad I did. My daughter liked her cucumber mint drink as well. We will definitely be back to try more. Those noodles are like a siren song."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twaFRVaHFTVGRoZGxKNU5UQnZRMmxQVlZwNlZtYxAB",
            "text": "Poe was the absolute BEST server. Our ten person group was served so quickly and all the food was fabulous. This was the best way to celebrate a birthday because Poe made it so so so special."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWlRuVnBUWFpRV0ZBMVpuWmZWbEYxWW5wb09IYxAB",
            "text": "The food was fantastic, but honestly the thing that made this experience so amazing for us was our waiter, Mr. Sayeed! Thanks for being so professional and sweet!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214V05FWjJOazlGYW01S1l6SlVkMFZVZGtaRGFHYxAB",
            "text": "Had a great meal at this place. Everything was delicious and the staff was super friendly. Our server Kaydeen was fun and friendly. Our food got to the table so fast! I think i liked the cocktails even more than the food! Compliments to our bartender Khalil."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GMlpVUTBOblJoVmsxbmIwMXBZMk5JVXpKVE5XYxAB",
            "text": "Great food and a cool vibe. It was a bit loud when we went because we were right next to the DJ but it was good music. Food came out quickly and there was a cute patio as well. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsSlVWTldhblk0UVdaTlUxRlhTRXB3UkdFeGNYYxAB",
            "text": "Very loud place , was not able to have any conversations while eating.\n\nFood wise , very average food nothing special. Dan Dan noodles were okay, chill oil wonton were good, other than that everything was really average."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TFZtNW1TVGcxU1VjMlp6RTJWQzFKYTNaRE5uYxAB",
            "text": "I’ve been around the world to probably 100+ vegan places, this is easily top 3. Incredible food, excellent texture, presentation, mix of flavors and spice. Will definitely return when I’m back in NYC!! 😋"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNE9VMXBZMEl5ZVZCNmVrZDBhMDk0VURsNGFGRRAB",
            "text": "Way, way overpriced, even for New York. Tiny portion sizes. A disappointment."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWVoyY3daRk5OYzBSSGRraDZjRU51ZDBSeE5XYxAB",
            "text": "All vegan and it was delicious. A bit pricey but isn't everything?"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4a3NyNF9RRRAB",
            "text": "맛있어요! 다만 음식에 마라맛이 강하고 소스가 짠 편이니 참고하시길!"
        },
        {
            "date": "10달 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cXVpT193RRAB",
            "text": "맛있어요. 근데 음식을 다 먹자마자 앞에서 기다렸다가 바로바로 빈그릇을 가져가요. 좀 서두르는 것 같아서 먹다 체할거같아요."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SU1VWXdXSHB5YmxGWFUzUjFYMWd4YzBKallrRRAB",
            "text": "I had high expectations from the place but it was a let down. I was excited about a vegan Asian restaurant but the food wasn’t great for the price they asked. The veg spring rolls only had 2 pieces.  The chopped cheese rolls were okay. The wonton soup was too salty and not balanced. The moon bowl tasted weird, it was a lot of raw veggies without any broth like I was expecting it to have. The Schezwan rice was nice and spicy but very very oily. All the food came together in one go, and the table was tiny for 3 people to keep their plates and the food. General Asian places are much better, even if they have just 2-3 vegetarian options."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJU0x1TG1ncFkyMUt3EAE",
            "text": "Our expectations were high and honestly we didn’t enjoy the food much due to the crazy spice levels.\nThe szechuan rice was so ridiculously spicy 🥵 I couldn’t even taste any other flavour. The spice in that thing was insane. I ate it bc I didn’t want to waste it but boy was I dyin.\nThe dan dan noodles were alright but the flavour wasn’t fully there either - something was missing with those too. We had to mix the rice and noodles to bring the spice level down.\nHonestly my bad for not inquiring about it, also the waiter didn’t mention anything about spice levels at all but I now understand with the name of the restaurant being literally spicy LOL\nOtherwise, the ambience was great and the staff were really really nice. Appreciate the vegan activism in the resto.\n\nMaybe we chose the wrong dishes.. 🤔\nI was so sad because I really wanted to enjoy this meal. We had minimal days and we picked and chose the vegan restaurants to visit in the city, and when it’s not up to par, it’s a little disappointing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wMFYxcHpRMmRXVkdsVlVrUmljbEp1T0ZwRllsRRAB",
            "text": "I found this place via online recommendation when I searched for vegetarian restaurants and I have to say that I was delightfully surprised at the flavors I got to experience here. The dishes are typically cooked with tofu and mushroom and you can have vegan add ons for a little extra . I bought the chicken and broccoli and the chili glass noodles with vegan beef. The chicken and broccoli  sauce was a bit sweet but my favorite part was the crunch of the cauliflower and the dish was still very tasty. The chili glass noodles were not as spicy as I expected them to be but they packed a slight punch and highly recommend this dish if you want something spicier. I can’t wait to come back and try out more of the dishes here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMVRrVmlVbE13VmtSM1N6QXpWRWhGUzFCcE1HYxAB",
            "text": "Spacious place nice vibes. It is one of those ultra dim moderate music place where it is difficult to read the menu.\nThe food was decent. The general tso chicken was great. The shitake bun was too sweet. Schezuan fried rice grows on you but the initial taste is a bit tangy and flowery.\nAlso got the green beans, they were simple sauted but wouldn’t really pay $18 for it next time."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWcFpsWjZaMTlFVVY5bWFXVjRNbWRvVEZod1QyYxAB",
            "text": "Amazing flavors, it is addicting. The dry pepper style and mapo tofu have a slight numbing sensation as it is Sichuan style cuisine. The flavors and spice are absolutely delicious, highly recommended."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwNk9WZFRkVEZhU1dKWk4zaFRiV3RHVDNwUFdYYxAB",
            "text": "# Restaurant Review: Spicy Moon\n\nSpicy Moon offers surprisingly authentic Chinese cuisine in a modern, club-like atmosphere. Located in the upper SoHo area, this restaurant delivers on flavor while catering to a younger, trendy crowd.\n\n## Food Quality: ★★★★☆\n\nThe Dan Dan noodles were exceptional - perfectly balanced with excellent pickled mustard, scallions, and just the right amount of peanut flavor and spice. Not greasy at all, with clean flavors that would satisfy even the most discerning Chinese food enthusiast.\n\nThe Mapo Tofu was impressively authentic with strong doubanjiang (black fermented bean paste) notes that highlighted its traditional preparation. Both dishes featured generous portions and well-calibrated spice levels that provided heat without overwhelming the other flavors.\n\nThe only critique would be that the dishes were slightly over-salted, particularly the Mapo Tofu. Additionally, the Mapo Tofu doesn't automatically come with rice (which needs to be ordered separately), and the rice-to-tofu ratio provided was insufficient for the saucy dish.\n\n## Ambiance: ★★☆☆☆\n\nThe restaurant features a modern, \"clubby\" atmosphere with loud music and extremely dim lighting. Most of the illumination comes from windows, creating inconsistent lighting throughout the space. The colorful dining accessories (green chopsticks and pink napkins) add a playful touch, but the overall darkness makes navigation challenging.\n\nThe environment clearly targets a younger crowd seeking a trendier dining experience, which creates an interesting juxtaposition with the authenticity of the cuisine.\n\n## Value: ★★★★☆\n\nAt a price point of $$, Spicy Moon offers excellent value. The portions are generous, and the quality of the food exceeds expectations for the cost. Two main dishes were sufficient to leave two diners feeling completely satisfied.\n\n## Final Thoughts\n\nSpicy Moon presents an interesting dichotomy - extraordinarily authentic Chinese cuisine served in a modern, club-like setting. The quality of the food is the standout feature here, making it worth visiting despite the ambiance potentially not appealing to all diners.\n\nFor those seeking authentic flavors without the traditional restaurant setting, Spicy Moon is an excellent choice. Considering the excellent food quality, take-out might be the ideal option for those who prefer a quieter dining experience.\n\nRecommended for: Young diners, date nights, and authentic Chinese food enthusiasts who don't mind the vibey atmosphere."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJak15a3FRRRAB",
            "text": "A funky place with spicy vegetarian/vegan options.\n\nAs a vegetarian, I’ve been seeking restaurants that adapt normally meat-full dishes into vegetarian options, and this place fit the requirements.\n\nI got the calamari which was actually made of mushrooms. They were crispy, and the spices were awesome. Full of cumin and I love cumin.\nThe rice cakes were saucy with hints of ginger. The rice cakes themselves were chewy, and I liked how many vegetables they added. The vegan sausage was also quite tasty. The crispy, almost burnt bits were the best."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbXRuTGxBRRAB",
            "text": "Ok so I went to this place because of the 4.5 rating 🤷🏽‍♀️ it looks pretty cute and is in good area.\nBut the food was serious let down. I tried the dan dan noodles with “vegan beef” which the server recommended,it smelled weird too.\nI think the high ratings are from people who are vegan and dont eat regular noodles.\nI tried adding the chili oil which diner on other table recommended after he probably saw my disappointed face.\nYou can find way better noodles at any regular place in china town 🤷🏽‍♀️ not worth the $25"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLTzN6Sks4aTZUNHVRRRAB",
            "text": "Solid Chinese food - think elevated Panda Express with a DJ and a cool vibe, bar and great staff - food was all good - got the General Tso and Kung Pao - watch out yo not get Veganized!! Fun cool spot"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KSVREVXpNa2gwYlRoTGRIY3laRk5ZZFZwdVNuYxAB",
            "text": "Spicy Moon has become one of my favorite restaurants. As a person who recently began eliminating meat from his  diet, Spicy Moon is the best example of pure Vegan delicious food options. Spicy and nutritious, you will not leave hungry. And, they have a bar. Go check them out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNycmRYRGtRRRAB",
            "text": "The only place that could turn me vegan! Love the dandan noodles so much! The wantons do not disappoint every time. Spice levels are great and do not overpower the dish. The mango cocktail is amazing and delicious.\n\nIt was my second time here and unfortunately they had a power outage that disrupted operations causing a hold up in orders. Staff was apologetic but quickly got our order as soon as everything was fixed. Food came out swiftly which was great!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKMmp0THZmMW9qSml3RRAB",
            "text": "Truly phenomenal food, though a bit pricey for the atmosphere. Cannot express the joy of a fully vegan Chinese menu!!! Can’t wait to go back and try everything else. (The herbal iced tea pictured here is listed as “lightly sweetened” - but even as someone who loves sweet drinks, I had to water it down a lot because it was extremely sweet.)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIeGRUUjVRRRAB",
            "text": "Delicious! If I lived in New York I’d be a regular. The menu is very robust and the food tastes so good. The food did take a little while to come out but worth the wait. My favorite was the DanDan noodles. The spice was perfect."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2OFBUYkl3EAE",
            "text": "Dec 6, 2024\n\nThe Dan Dan Noodles are among the top 3 greatest noodles I've had in my life - I will be searching for that noodle flavor everywhere now. I was warned by my cousin that these noodles were good, but was still left astonished when I actually tasted them.\n\nThe Spicy Pot and the Buns (dpicy tofu and another I can't recall) were as good as I expected them to be."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5eDR2bVRBEAE",
            "text": "Spicy moon was a wonderful experience overall. The food was fantastic and we can’t wait to have it again! The drinks were creative and the bar staff was very attentive. Our server at our table was a little harder to get a hold of and always seemed to be in a rush whenever he was around, but overall we had a wonderful time. We recommend the Dan Dan noodles and the Kung Pao Tofu! We are looking forward to returning!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMklQcHpnRRAB",
            "text": "Amazing super spicy mapo tofu with rice. Everything vegan and delicious. The Ube cake tasted somewhat of artifical sweetener though but the texture was great."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQX1pma0R3EAE",
            "text": "Great foods! The ambiance was energizing and tasteful. The menu had a ton of options and the food came out fast. The food was hot and delicious!  The waiter ignored us the whole meal though, but other than that. Great food! Hope this helps!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDMmNhV0RnEAE",
            "text": "Absolutely LOVE this place. The west village location has more space imo and cute outdoor seating!\n\nI am not vegan, am in no way vegan, and never will be vegan, but this place is THAT good that I’ll recommend it to anyone who will listen.\n\nGreen beans are a MUST. The best green beans I’ve ever had. Their kung pao mixed veggies is also incredible. Cumin fries are also a must. Mapo tofu is delish and reminds me of my time in China. Everything is just really authentic and super flavorful!! Please go, I promise it’s worth it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqd3FETFZ3EAE",
            "text": "Pure vibes here. Had a great dinner before a comedy show nearby. Good service and atmosphere were amazing, 10/10. Wish we had room in our stomach to try more menu options but the portions are big, so we shared one main and a side and were stuffed! Made for an inexpensive dinner out which was perfect!! Will return."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfenFuOUVREAE",
            "text": "Possibly...no, definitely the best scallion pancake I've ever had. Very comfortable and lots of space for solo diners to eat at the bar on an otherwise fully booked Wednesday night. Can also recommend the cocktails (having more than one increased the price of an otherwise reasonably priced meal.) A good place to bring non-vegans/vegetarians to introduce them to what a good meatless meal is like."
        },
        {
            "date": "4달 전",
            "language": "it",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swNFNWbFlRMGxvZWtvd1ZETnZOa1ZYZDBGblEzYxAB",
            "text": "Assolutamente consigliato! Un ristorante asiatico vegano dove mangiare che siate vegani o meno, resterete assolutamente soddisfatti, consiglio in particolare di aggiunger il vegan chicken nel vostro piatto, ottimo aggiunto al Vegetable Ramen.\nAlcuni piatti sono molto piccanti perciò se non siete amanti del piccanti assicuratevi di non prendere piatti piccanti.\nQuesta sera all’interno del locale cera della musica molto alta, perciò consiglio di sedersi fuori. Il personale è estremamente cortese e disponibile, molto amichevoli pronti a spiegare dettagliatamente gli ingredienti dei piatti.\nInsomma davvero consigliato da un italiano all’estero!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURENXJXWmFBEAE",
            "text": "Had to sit in the cold because they didnt have space inside even though we had a reservation.\n\nFood was Really spicy, I only was able to eat the wonton soup, scallion pancakes, and dumplings which were all good.\n\nDrinks were delicious except for some had so much garnish and we barely were able to have the actual drink because so many seeds of fruits in the inside of the glass\n\nNot sure i would come again to this location"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQbTlEeHBBRRAB",
            "text": "Spicy moon maintains its consistency. Have been to the one in bowery earlier and this one matches the expectations and raises the bar. Stired fried rice noodles, spicy tofu bun with chilli oil are the must haves.\nThe staff is very polite and attentive, special thanks to Ole and Jorge at the bar! Will visit again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiX3Z5MHdBRRAB",
            "text": "One of the best Szechuan and Chinese Vegan restaurants near NYU. We went on for lunch on a weekday, so the restaurant was almost empty, but I would recommend reserving on the weekends.\nThe staff is very good and attentive.\n\nWe ordered -\n1) Vegetable Wonton in Chili Oil (5/5)\n2) Dan Dan Noodles (5/5)\n3) Ginger Lychee Refresher (5/5)\n\nWill definitely visit this place again the next time we are in the area."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBOVkyQkVBEAE",
            "text": "I was dubious at first a) it’s all vegan b) the food came out the fastest I’ve ever seen. Boy what a surprise. I kept ordering till we could not eat another thing. Brussels sprouts , scallion pancake , vegan duck wrap , crab less Rangoon, char siu Shiitake bun , hen of the woods mushroom bao bun, general tso vegetables. We’re out of this world. Service was friendly and fun. I highly recommend this restaurant. Do it !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6dEw2ajd3RRAB",
            "text": "The pink and green theme gave off such a cute, sexy vibe - felt like I was at a bar.\n\nThe vegan dishes were shockingly delicious without any overpowering bean flavors, really showcasing their ability to capture flavors well. For me, the food packed a nice kick of spice that was addictively tasty, not overpowering. The friendly staff topped off a great experience💖"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIeTdQRWhRRRAB",
            "text": "Had such a fun time going here with my cousin who knows all the best places and as a vegan this was superb. Love the atmosphere and aesthetics! Next time will need to get some spicy vegan mayo and pickles and red bean or moon cake. We had the fried mushroom bao, shared the dandan noodles which were mildly spicy but perfect and I’d never had dandan noodles before and the kung pao"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyaHZYUERBEAE",
            "text": "This restaurant is a Szechuan vegan restaurant. I went into this restaurant with high expectations, but I was let down overall. This restaurant is mediocre at best. So when we first went into the restaurant, it was packed to the brim, and the only available seats were outdoors. No problem. We ordered the Dan Dan Noodles, Vegetable Chili Oil Wontons, and the Dry Pepper Style mixed vegetable+tofu. I thought the prices were a bit expensive compared to what I usually ordered for the same items in lower Manhattan. The Dan Dan Noodles were good, but I would have liked a bit more flavor within the noodles. Also, my accompaniment and I were highly disappointed with the Vegetable Chili Oil wontons, it did not have much filling inside, my favorite part of that dish was the chili oil honestly, I used the chili oil in that dish to mix in with the Dan Dan noodles to add more flavor :) I think I enjoyed the Dry pepper tofu/veggie dish the most. The fried tofu definitely feels like a crispy chicken when you first bite into it, but just with a hollow inside. I am not vegan at all, but I still thoroughly enjoyed the food fairly. I have a fair spice tolerance, and the food was not spicy at all in my opinion, so don't worry about it if you can't handle spice that well!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoakszb19BRRAB",
            "text": "A must-visit vegan place!!!\n\nIt's really cool next to Washington sq park. It's super crowded even on weekdays and has a really cool vibe.\n\nThey have both indoor and outdoor sitting and I highly recommend you make reservations ahead of time.\n\nThe staff is very friendly and was able to customize all the changes. We loved the food and is decently priced. Also, the position is great and is enough to be shared with your friends.\n\nDefinitely, a place I'm visiting again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kc2VYa3lkamgyY3preGVXbzNkVGcwYmtSalNsRRAB",
            "text": "We went there around Lunch Time we’ve order Dan Dan noodles and chilli oil dumpling was testy staff was good friendly and quick very good place for cute date"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPbmQ3bW9RRRAB",
            "text": "We tried coming here once before but the wait was too long. We were lucky this time to get there when it was fairly empty & it did not disappoint. I'm not vegan or vegetarian, but I like to try the options when they're available. We got the spicy wontons which were delicious. I wouldn't say they were too spicy, but just perfect. We also got the general tso's cauliflower and it was my favorite! The sauce on top was amazing and I like that they drizzle it throughout the portion (there's a lot) so that every piece has some on it. We also got the dan dan noodles which were good. My boyfriend loved them, but I personally didn't love the texture of them. The sauce was kind of gritty but the taste was good. I think the prices were great for the portion sizes and the fact that it's vegan food in the city.\n\nOverall, I loved it & look forward to going back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4dlBTdDFRRRAB",
            "text": "It was my first time & I can't stop raving about it to my friends. The wontons in chili oil was my fave. I tried Dan Dan noodles based on the other reviews. They were delicious but rich; I wished I had something pickled or raw to balance it out. The mushroom bun was good though I would try a different dish next time. Server was quick and friendly. Cute interior and plating. 1 tiny but clean restroom available for patrons. I love that it's vegan!! Wish they would offer non-plastic bags for leftovers but it's ok to go without. The Dan Dan noodles were great as leftovers and did not leak in the container!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1LUtuRnlBRRAB",
            "text": "Walked in for lunch on Monday afternoon around 2:30 and we were seated right away. The place was packed to 60% capacity and still had some indoor seating available while the indoor area was fairly empty.\n\nService felt a little slow this particular day, and the 2 beers that I picked from their list weren't available. While the staff was apologetic, the recommended replacement wasn't really great (no wonder they still had some in stock)!\n\nFor food, we ordered a couple of things which included Crabless Rangoon ($11.95), Vegetable Wonton in Chili Oil ($9.95), Fried Vegetable Dumplings ($8.95), Dan Dan Noodles ($12.95), and Peppercorn Brussel Sprouts ($10.95). What felt like too much food, was easily consumed by the 2 of us, and we are light eaters.\n\nFood was ok, nothing exceptional about it, but good enough to try it again one more time! Service improved towards the end of our stay, and overall, we had a pretty good experience. We will return again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQYmx2LVN1b2ZUVTRRRRAB",
            "text": "Best Chinese vegan dishes I ever had. My vegan Queen loved it especially the egg plant and veggie spring rolls. The prices are reasonable and had a super dessert heaven cake recommended by Travis the host and it's undeniable delicious. We definitely will be back for a great romantic evening. Highly recommend this restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWMV9pbDR3RRAB",
            "text": "For appetizer and drinks, we ordered vegetable wonton in chilly oil and Thai iced tea. Both were amazing. One must try the dumplings.\nFor the main course we ordered Dan Dan noodles and Mapo Tofu. The noodles were very flavorful. Coming to Mapo tofu, the tofu was as soft as butter. It was dissolving in our mouth. But the gravy was very bland and salty. So didn’t like it much.\n\nThe serving portion is huge and the service is quick. We ordered everything at once and they brought all the items together within 10 mins.\n\nOverall, I would recommend this restaurant and would definitely go again to try other dishes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtb2I2dXF3RRAB",
            "text": "This is the best vegan restaurant and one of my favorites, and I’ve only tried two of their items - the Dan Dan noodles and the chili oil wontons. Both are incredible, unique flavors. The food is such a standout at this establishment. I’ve brought multiple people here with me and they’ve all been so amazed by the food as well. I will definitely be coming back. The service is also very kind, they brought us hot jasmine tea refills which was fantastic!\n\nYou must try the dan dan noodles!"
        }
    ],
    "reviews_count": 88
}