{
    "name": "Morandi",
    "place_id": "ChIJ_UahM5RZwokRBtHbK9TH_z0",
    "grid": "MN2",
    "address": "211 Waverly Pl, New York, NY 10014, USA",
    "rating": 4.3,
    "user_ratings_total": 1568,
    "phone_number": "(212) 627-7575",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toblltZzRkamxFZFZCVlRYZE9lWEZXU0VNdFMyYxAB",
            "text": "Poorly prepared food. Undercooked and over seasoned. Paste was served cold Cheap and sour wine. We had different red wine both tasted sour and old"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GM1dFaFdOa2xNVWpnd1VsWnZjWEpoWkhkSk5YYxAB",
            "text": "Another great place to dine in NYC!  Can’t go wrong"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sVmRIY3RiMkl3Um5CdlUyNUNkRFpzVTJKamJGRRAB",
            "text": "Beautiful and Fabulous\nAs I always known it to\nBe for Year's ❤️🙏❤️🙏\nAmen 🙌🙏🙌🙏🙌🙏🙌"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CS0xXRnVVRGhpY2sxck1YaHBWSGhPTm5relEzYxAB",
            "text": "The food was very good but I really want to highlight the exceptional service. These people were ON TOP OF IT. Felt like we had an entire team of people taking care of just us. When I started dabbing water on a tiny spot of sauce I got on my shirt a guy that wasn’t even our waiter appeared immediately and offered soda water. Start to finish they were all awesome."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsbVZrRkZMWE5KUVZSd2NrZEhiVmhsYlVOQ01YYxAB",
            "text": "Everything was exceptional- from the food to the service to the ambiance. I had the Pici al Limon (hand-rolled spaghetti with lemon & Parmesan cheese) & it was the best pasta I’ve ever eaten. The Insalata di Carciofi (marinated artichoke salad) was zesty & bursting with flavor. The coffee & cream superb. The staff were so sweet & went out of their way to accommodate us. Even the temperature was ideal - we sat outside under the heated lamps. Just the perfect way to spend a fall evening."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0VGMyUlRjbTlaUkRCWFpEWkdiWFpRVFUweVVIYxAB",
            "text": "Great service and food!  Authentic and tough to beat!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCQk5UZzFXa1pNYmt0a05FMWlOa0ZuWVU1eFMxRRAB",
            "text": "Pasquale and the wait staff at Morandi’s are unbelievably kind and welcoming.  We had a phenomenal dinner and can’t wait to return!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGelFsazJNbWMyVkhOWE5IaHZWVEF6VjAxbFIwRRAB",
            "text": "First the positive. The place is gorgeous, really a beautiful space. Service was attentive and friendly. The fried artichoke dish was really excellent, I've had it Rome in the restaurant that's supposedly perfected it.\nBut for the bad! Oh boy. The Puttanesca sauce was not a sauce at all. It was a couple of cherry tomatoes on top of some actually overcooked pasta. A few olives and some watery olive oil thrown in. That's it. Anybody with a jar of tomato paste could have done better.\nIt claims to be Venetian cuisine, and possibly in Venice this is how puttanesca is served. But I really doubt it. In any event it should come with some sort of warning on the menu!\nJust as disappointing with the gelatinous mess called eggplant caviar with yogurt.\nOvercomplicated and still somehow bland.\nI don't mind expensive restaurants, but when they can't get the most basic things right they really shouldn't be charging those insane prices."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ORE5FNHRlR05vVTFWMVFVeHZlV05ZUkdsUlJsRRAB",
            "text": "Have been coming here for well over 10 years.\nThe shishito peppers & cacio pepe never disappoint"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oWGQweFJXVzE0U0hwUFNHZHlRVEZKUW5Gd2NYYxAB",
            "text": "There’s nowhere else I’d rather have my Italian meal when I’m in New York City. I go here on every visit. Location is in such a cute area of the West Village. The food is incredible. The vibe is fire. I just love it so much!!! We started with the delicious margherita focacce. Next up was the best calamari and the artichokes. We all ordered different pastas, but I had the pappardelle alla siciliano. I got a clean plate medal for this dish. We ended with the cannoli di ricotta and tiramisu for dessert. Both are incredible!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205T1dWbHVkVFp4VFdWR2NUTjNaM1JWYmpSVFMwRRAB",
            "text": "We were a group of eight celebrating a birthday, and William delivered the best service we could’ve asked for. He was attentive without being intrusive, had great timing, and made sure every request was handled quickly. Our drinks, food, and little details were spot on the whole night. Thank you, William, for making it such a special celebration—we had an amazing time!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxNVNuQlZOQzFwY0RsaFoweHFTbkZzV2sxSVRGRRAB",
            "text": "Great service fantastic staff\nFabulous food\nTreated like family"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kNlJVdDJaelk1VEdVMU5qQjZaMDFDUmtRNVFsRRAB",
            "text": "Morandi manages to stay at the top. The food, the vibe, the service - all makes me love this place. I will be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMFdEZ3dTazk2UlhCWFlrazNPRGRCVHpaWmRFRRAB",
            "text": "Nicely done! Early dinner for 3. In and out with plenty of time to catch a train uptown for a show. Very helpful waitress assisted with wine choice. Keith Haring wine really good. Salads, pastas, chicken all spot on. Bread was great w oil and herbs."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5T1VYTXlkRGRDYmw5UU5XeGpSRE5IU1RFNWRYYxAB",
            "text": "William made our night here. If you come here and get him as a waiter you will be very lucky. The atmosphere and food is also amazing"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xVmVHMVRURlV3WmtzMGJHcHplWGhHTUhScFZuYxAB",
            "text": "William is the best!!!!!! Best recs and energy. Love him. Made our night!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMFgzZGpYMVpJYm5sbFVYcEVabk13YTNGUWVGRRAB",
            "text": "Worst service ever!!! Don’t waste your time!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21veWVtbElRVzFTVlRjelVtRkNkV0oxWXkxNWJYYxAB",
            "text": "The absolute worst service ever!!! Don’t waste your time when there’s way better places in NYC. There was barely anyone in there and it took 45 minutes for our 3 plates of pasta to come out!!! They also forgot a component in my dish and when I as talking the manager walked away from me!!! No one checked on us and we had to ask for the check otherwise we’d still be there. If you don’t care about your customers, don’t work in a customer service industry. Absolutely terrible!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201U2JuQm5WRzFXVTAxMGRIWklMVXRMVWpocVJXYxAB",
            "text": "Even though it was crowded, the while decorum was magnificent! I had a date here and it was excellent and the food and service was great too"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOc01XUTRUMjh5YUVOWWFuTkhSV3hQVVRCdVptYxAB",
            "text": "One of the worst steaks i’ve had in recent years. Over salted, the sauce was blunt and heavy. The potatoes and onions were nice, but I would never eat here again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMlZXMW9hakJHZEc5V1MybEpSbTV2VW5oU04wRRAB",
            "text": "Went here for me and my partner's 10th anniversary, and had one of the best anniversary dinners of our lives. The service, food/drink, and atmosphere of the whole place was perfect. We also received a lot of very thoughtful gestures from the staff for our anniversary. Very romantic."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWMjZLdGdnRRAB",
            "text": "Food and table service is consistently good.  Lots of traditional Italian dishes to choose from we well as unique specials.  Great outdoor seating in the warmer months to people watch while enjoying your excellent meal."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoc1JrNXhVRTlpWHkxeWFFTmlURkp2VERCRlZGRRAB",
            "text": "The food was awful. We order 2 antipastis 2 pastas and 1 lasagna. The octopus was burned, chewy and flavorless. The carpaccio was extremely thin and dry. The pastas flavorless as well they almost tasted like if they were warmed up and then the waiter said they didn’t have any lasagna so he was gonna surprise us with a dish and if we didn’t like it he’d take it out from the check, he ended up bringing tortellini pasta filled with cheese which was ok but definitely not what we wanted.\nThe service was poor and effortless. Honestly one of the worst experiences in a restaurant from nyc.\nNot coming back again or recommending it either."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VM1oxcFBlVWQ1VjBodmRVUmxNRFJaY1dsVk1tYxAB",
            "text": "Great for outdoor seating and if you have a larger group it can be a better option for Italian in the area."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kweWNVOXNRbXR6WTNkRlpGOHRlamczYURWa00wRRAB",
            "text": "FFF Morandi!\n\nThey add extra items in the bill you did not order !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVFZqTlJUR3B1VVRWU2EyaDBVMWw1TVdaVlFYYxAB",
            "text": "So delicious. It was a first incredible experience. And everyone who works there are so lovely."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214NVIwRnFMV2x3YW5KUWQwMW9WSE51ZUdKNGNGRRAB",
            "text": "Excellent food!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FM00xRlBNVGs1V0U5amQzbEhabHB6VEdadWRHYxAB",
            "text": "My friends and I love this place! Highly recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUk5IQlNka3hRYXpFMlIwSnhka0ZpTUdKR1EzYxAB",
            "text": "Amazing food, amazing service, amazing vibes. Antonio was awesome. Highly recommend for the start of a great night"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSalR6TkpibFV3U0ZaT05HVkxhVkJvYTA1MWFGRRAB",
            "text": "Great food & drinks"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25keWNuVXRWMjFKV0RKd2RYVXhWbE4xUjFKMlZsRRAB",
            "text": "Thank you for a great dinner experience. Thank you Antonio and William for your hospitality. Coming back soon for more delicious pasta.  Keep the good job guys!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Oa1lrUXpiVlpXWkVkWE9FOUJWVFJ1Vm1oNFYxRRAB",
            "text": "Cozy, charming, delicious. My favorite\nneighborhood spot"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psR1pVUTRhbkJuWTJ0WFRVMU1aMDh3VlUxcE1WRRAB",
            "text": "Los platos muy chicos y caros\nLa atencion muy desorganizada"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kSVpIUnRjSGQ0V0cxNlQyRlBaVnBzUzFCbWNtYxAB",
            "text": "Was looking forward to returning to one of my favorite restaurants in NYC..... Last time we came here was in September 2009.  This time, on a beautiful Saturday afternoon, the experience was much different.  We arrived at 3:45 pm and immediately placed our order upon seating.  Our waiter was pleasant and courteous, but somewhere along the line, dropped the ball completely when it came to common sense communication.   While our appetizers and one entree arrived promptly, we had to ask a few different servers where the remaining entrees were almost 35 minutes later.... These other servers must have informed our waiter because he came over and told us it would \"be another 2 minutes.\". However, that was not the case.... The next entree came about 15 minutes later and then the final entree arrived about 45 minutes after we placed our order.  Keep in mind this was on a late Saturday afternoon, when the restaurant was basically completely empty.  When the last entree finally arrived, I had to ask our waiter what was the reason for this delay and he replied that it was due to \"a change between the lunch crew and the dinner crew.'. That was a good reason, but why didn't he tell us that during the 45 minute wait?  Lack of common sense .. He was smart enough to see that we didn't touch that last entree, so offered to remove from the bill, which we appreciated.... But the lack of communication dumbfounded us....2 stars for the food, which is still good, even after 16 years... Plus 1 star for the out-to-lunch waiter... Courteous, but no awareness of time.  The service, or lack of communication,  prevented this from a 5 star review."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxVVNWcHJRV0pPYzFrd1puRnlRVnBwTW1SUVRFRRAB",
            "text": "Everything was perfect. This has always been my favorite spot in nyc"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NVFXcEtOWFEyTVVFNFdHOHpWRWxNYjFaNk1uYxAB",
            "text": "Morandi strikes again. The pasta arrived limp, lifeless, and, how shall I put it, embarrassingly overcooked. It had all the charm of a rushed Tuesday night dinner in Queens, made with boxed Barilla and a distracted hand. Nothing al dente, nothing inspired, just a warm, soggy heap masquerading as rustic Italian. If this is what passes for cucina povera in the West Village, then we’ve all been had. The sauce? Serviceable. The bill? Criminal.\n\nKeith, do better."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paak5reFJiWE52TkU0MWNWUjFZWEp2Vmsxb2RVRRAB",
            "text": "Walking into Morandi's felt like I was back in Italy. The atmosphere is warm and cozy. From that moment on, I knew this would be a great experience, and I was not disappointed. The staff were all amazing! I have never been to an establishment where I felt like I was at someone's Nonna's house, serving delicious food and offering joyous hospitality. I highly recommend experiencing dining at Morandi's. The food was a 9.5/10, the drinks 10/10, and the service was an 11/10."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21scFRFTkZkSE5SUlZBNFpURm5kMHh5WWpsSVpsRRAB",
            "text": "GF options lacking a bit, but grilled octopus was delicious. Pasta Peperoncino Calabrese and branzino fish were excellent. William our server was very good."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMWFqWjRVbVJ2VjNCWkxYbFZabU41VG1zNGEyYxAB",
            "text": "La comida es increíble, si quieren comer bien vayan ahí. Me da pena que la competencia le ponga bajas estrellas solo por envidia. Este restaurante se merece lo mejor"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psSlYxQTBVbFZrWTFObWNuVlRjR0pYV1ZvdFluYxAB",
            "text": "Quality bad & food is super small size and price through the roof.\nWaste of money."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SUlRIbExPV3BPZUVOeVpUTXphMlpLWWxwRE1uYxAB",
            "text": "William is hands down my favorite server ever. The service was amazing, the quality was amazing. I can not recommend him or this restaurant enough."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWd2NEQm5NWGRvUzFCTU5sbDNOMWRmUVhCT1NGRRAB",
            "text": "El mejor restaurante en Calidad atención servicio y costo 😍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KM1dWZFBOblpaTlRWdk1saHNhbEpwVVVVM2VHYxAB",
            "text": "Truly a New York experience - none of those wanna be “hot restaurants” that dare to say, “your two hour of reservation is up” - they actually appreciate it when you have your dinner the way you enjoy"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsWVNuWTVaV3hFY1VJeGQxQlFjRGswU1dOSFdIYxAB",
            "text": "Food was delicious and cocktails were great. I went for after work dinner and drinks. Service was accommodating as they were kind enough to move an umbrella to block the sun. They even gave us a limoncello on the house for dessert! Be prepared to wait for your dinner as it took some time but we enjoyed our cocktails in the meantime."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNMFdHOVBVbTFZTVU1d05WZzVTa1JRYnpaNlozYxAB",
            "text": "My friends and I frequent here. I was here last night and enjoyed the cacio e pepe. The food and service is always up to par. The staff is always welcoming and hospitable. The rustic look inside gives the atmosphere a warm, relaxed and cozy feel. Perfect for a date night or with friends."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0MFUxaDBNelpHUmpsT1RsVmFVelZSYTBRNWRVRRAB",
            "text": "Overall not a bad place. The menu is short, and it’s almost disappointing the low variety of entrées. Unfortunately all of the fish dishes contained olives, and when asked if those could be skipped, the answer was no.\nThe staff is well-mannered and overall, not a bad place to hang out, even when sitting outside. But with so many options around, it would be hard to recommend this place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ka2FtbE9hbXBZYURKaFlXMTBRVkZPTUZvMGFVRRAB",
            "text": "The food was delicious, but service was amazing.  Luis was so attentive to details and made our dinner better."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOd1pqTlBjMkZ0WW5aMk9GUlJVRlpNZUhFMFNsRRAB",
            "text": "Great food and excellent service! The manager was super nice and attentive. Definitely recommend!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SRmNpMVNVazV5ZG5rNGRXSklSV2cwVjJVM1gxRRAB",
            "text": "La pasta al LIMONE es increíble, y el trato de los camareros también!\n\nEl tiramisú también buenísimo"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xVUxUZERjVlpqUlhaR1EyZEpZbTU0YTBGUlpXYxAB",
            "text": "Wonderful terrace great service unbeatable local trendy location"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kNllVVkxNM1l4Wm1VMVJtNXlXbWxDWVVOdU5FRRAB",
            "text": "William our server and Antonio attended us beautifully and showed us so much hospitality, from the runners to the manager everyone was wonderful and greeted us and made us very comfortable. The food is amazing and tastes delicious and we missed coming here. There was no special event but we were treated like if it was a party. We thank you for your service very much and look forward to coming back for more!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxaFFuTTJjelZuTjFWRWN6Rm5ja2RrTkdjdFJWRRAB",
            "text": "Soooo, my friend had her birthday here last week. She was excited to indulge in some quality, authentic Italian food, and quite frankly, so was I! I’ve never been before, so was excited slash nervous because, well, I’ve had “Italian” food from “Italian” restaurants where the food was less than mid, sadly. So when it’s a place I haven’t been, I have my guards fully up! I arrived for my friend’s birthday gathering, and it was such a lovely setting. This place is great for group dinners! Lovely atmosphere, decor, and the staff is wonderful! Everyone was so accommodating and friendly! Our waitress was great! She was so knowledgeable of the menu, and made some great recommendations! I needed a boost in energy and so I ordered an espresso martini, which turned out to be delicious! They are not easy to make and believe me, I’ve had some bad ones. This one was perfect! For my starter, I had these puff pastry things that had prosciutto on them. They were stuffed with cheese, and honestly, I could’ve eaten a dozen of them, they were so.good! Chef’s kiss! Our waitress also brought out some bread and olive oil, which is always one of my favorite parts of Italian restaurants lol. I was pretty hungry, so I needed that bread lol! For my entree, I really wanted some good, housemade spaghetti, so I ordered that with bolognese. Once it was served, the waiter came and grated some fresh Parmesan cheese over it, and it truly just made me so happy. This was authentic Italian food at its finest, and my friend couldn’t have been more happy! She loved her food as well! I need to get back here ASAP because I need a round 2! I highly recommend! You will not be disappointed!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOUC13ZXVBeklHcXhRRRAB",
            "text": "I went at this place for my anniversary dinner and I felt so welcoming since the person who served us knew it’s our anniversary she served the dessert and gave us a small postcard for memorandum. The place has best ambience overall. Highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWWRXRkphbkJJYlhoWFVGVlJjbkZCVVU5YWMxRRAB",
            "text": "My husband and I went to Morandi for dinner, the food was absolutely delicious and what made our dinner extra special was our waiter, William. He was attentive, kind, and knowledgeable about the menu and always came to us without hesitation or delay when we needed something. The seasonal drink menu was sensational, highly recommend the Rosemary Gimlet.\n\nWe look forward to continuing to come to Morandi year round, and with the exceptional service, we hope to introduce Morandi to more of our friends!\n\nI would 100% recommend Morandi to anyone who would like a window into Italian cuisine. The ambiance was busy but still personal enough to have engaging conversations. William really did make our night, and a special thank you to Antonio for making our dinner even more special by welcoming us to the restaurant."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmamFMQlBBEAE",
            "text": "Very nice, good food. Quite loud lol. The truffle pasta was excellent and so was the bolognese. For appetizers, the fried artichokes and ricotta cheese with anchovies toast were both excellent. Drinks: Apple Daisy (tequila based)! Friendly staff. Loved the look of this restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMbU02eEx3EAE",
            "text": "In the realm of West Village Italian restaurants, Morandi has been a staple for many years. The atmosphere is quite charming, and the interior is classic wood and stone. The restaurant is quite large, with extra seating outdoors; that being said, you will need a reservation. The staff were always kind and efficient, and that being said, they never went out of their way for anything.\n\nThe food is quite good. I’ve tried a few different dishes. The focaccia bread is more of a flatbread; I don’t know why they would take all of the air out. The pastas were delicious and I recommend trying those. Overall, you can’t go wrong with the food here."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKM1htcUMzZ2ZmZHh3RRAB",
            "text": "On a gorgeous spring afternoon, this is a perfect place to enjoy great pasta. Sit at a breezy sidewalk table and watch the world go by."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNk0zV3l3RRAB",
            "text": "Everything about this restaurant is a 10/10. Service, atmosphere and food quality.  You can tell that the chef and all staff are happy. The food so tasty without having to use so many ingredients. Antonio and everyone were over the top nice, always checking in on you making sure you were satisfied and drinks always filled. The restaurant was so pretty, cozy and bustling!!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxd05MQnlBRRAB",
            "text": "Excellent pasta here. Highly recommend the agnolotti, which is delicious. The focaccia was great. We loved our waiter.\n\nDaiquiri is very sweet so be careful with that one. The Tree House is delicious, perfect balance.\n\nTo be honest I wasn't thrilled with the table and chairs. Everything looked nice but the table was sticky no matter how many times they wiped it down. The chairs were also not very comfortable. The food and drinks definitely made up for it though! Which is why I gave 5 stars and would definitely come back here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNid2ZYN0p3EAE",
            "text": "This place has an old school charm about it. We walked it on a quiet night and were seated without reservations. The decor of the place is so charming and so were the folks. We ordered the focaccia margarita & Cacio e Pepe and they were incredibly nice! Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuX3RYN1NREAE",
            "text": "Nice atmosphere, good wine list. The cooking oil needs to be changed. The bread was sooo good. The cacio Pepe was meh. The potatoes were excellent. Often a line for the bathroom. Service was professional but a little rushed."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBOTRMakJREAE",
            "text": "Very nice place to have a great Italian meal. I like the atmosphere as well as the dessert. Great place to take your significant other on a date."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmM3ZYTG1BRRAB",
            "text": "Nedra was a very attentive and friendly server. The Bruschetta was amazing and the Lasagna and Pumpkin Ravioli were phenomenal! The seating is a bit cramped, and I appreciate music that is more relaxed. Overall, the restaurant is wonderful and I would definitely recommend it if you are in SoHo."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYaktYOWx3RRAB",
            "text": "Overall this restaurant averages a 3 in consideration of 5 star service, 3 star ambiance  and 3 star food. Funny thing is that Google reviews from NYC foodies placed higher at 4.6 stars. My boyfriend ordered rigatoni and I ordered the Bisteca (steak). The rigatoni was tough like either the pasta dough wasn't made in right proportions or it was cooked too al dente. Even fresh grated Parmesan sprinkled over it couldn't save it. I ordered the steak medium well. The beef was tender but the temp was off with a little too red still. It came with about 3 radicchio leaves and a small serving side of potatoes, which was probably the best part of all that was ordered. Service was great though the food was not to par, the waiter kept on refilling our glasses with NY finest tap water."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1aU9MT09REAE",
            "text": "Authentic and fun vibe! Incredible service and beautiful restaurant. Nice wine list and the food was delicious, although the cacio Pepe wasn’t the best I’ve ever had.. The tables were a bit small / tight. It’s a very loud room which makes it fun. Fantastic bartenders and drinks. The hostesses were also extremely accommodating and they have coat check."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQbWh2N0x5a01tVFJ3EAE",
            "text": "stopped for a quick lunch and everything was excellent. Service was great. The branzino is phenomenal!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0eXBEaDdRRRAB",
            "text": "Great atmosphere, perfect service, and delicious and innovative food! First sausage stuffed olive! Lobster pasta special on Friday was spicy, rich, and filled with perfectly cooked lobster. Great wine list and a beautiful decor."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOYjB0c3VEbV9tSHJBRRAB",
            "text": "We had a great experience! The pasta was absolutely delicious and the bread was amazing. The appetizers were tasty but a bit small for sharing. Overall, everything was great—our only suggestion would be to make the portions a little bigger"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPXzd5NkxWOXRqRHFRRRAB",
            "text": "My girlfriends and I met after work on a Tuesday night for drinks and ended up being welcomed by the loveliest host Antonio. We stayed much longer than anticipated and ordered the best food:) great spot and will be our new restaurant spot in West Village. Love love !!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWTlRuSlhPR0pyZFhkNGVVWldWMFZtTTBkalJrRRAB",
            "text": "Great all around experience here. Really solid spot. Antonio was extremely accommodating and made us feel right at home. We got the meatballs, mozzarella & prosciutto, and the lemon pasta. Will definitely be back to try more of the menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkaFBicm9BRRAB",
            "text": "Great atmosphere and service! Food is delicious.  Have the perfect pairing of wine and freshly crafted pasta at this charming Italian restaurant.  I specifically went to try the Pici al Limone  and it wasn't on the brunch menu.  Excellent bartender inquired with the Chef and they made it for me!  Wine pours are not stingy. Don't leave without trying the Torta torinese.  The hazelnut gelato was rich and creamy with the perfect amount of nutty flavor."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1aHVUSWlBRRAB",
            "text": "What a beautiful restaurant. The service was phenomenal. Never had to wait for the waiter. He was on the ball and very friendly. (Ismael). The dinner was delicious.All made by scratch from the noodles to the homemade sauces. But the ambience was very relaxing. Dimmed lights to the wines adorning the walls. I can't say enough about the staff. Everyone was courteous and very helpful. From the hostess to the cook. Can't say enough about this place. You just have to give it a try. You won't be disappointed. I promise. My go to from now on when I'm in the city. Definitely recommend. 10/10 👍🏼"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNocFpfeWtnRRAB",
            "text": "This was a beautifully decorated place! Atmosphere was super cute, wait staff was very friendly and attentive. The food was pretty good too! The drinks were good as well."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMlYzbEhNVUl6VWtoR1dDMUVVR1V6TjNCaE5tYxAB",
            "text": "We were there this weekend from Alabama. We tried several appetizers, we had drinks and entrees. I had the Tagliatelle Alla Bolognese and it was chef's kiss perfect. The atmosphere was festive. We ate outside. The staff was very attentive and friendly. We ate at several restaurants while there, but this was my favorite!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNeGNpS3JRRRAB",
            "text": "Lunch was good, pasta had great texture. Flavors were a bit bland but overall enjoyable. The bread they bring to the table was very, very good, always nice paired with olive oil. Prices are pretty expensive for a bowl of pasta and sauce. Sat outside which was nice. Our server seemed really “overworked” even though the place was pretty empty for the 1.75 hours we were there.\n\nOverall is was good enough but price alone would prevent a revisit, plenty of other spots to try around town"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURweEx2YzdBRRAB",
            "text": "Sitio con mucho encanto y gran ambiente. La comida es excepcional pero el servicio es aún mejor. En nuestro caso nos tocó un camarero italiano que se llamaba Antonio que hizo que la noche fuera mucho mejor, empezando por sus recomendaciones de la carta, siguiendo por su profesionalidad y simpatía y acabando por sus recomendaciones para NY ya que veníamos de vacaciones. Totalmente recomendable parar a cenar en éste restaurante y pasar un rato agradable y degustando su propuesta culinaria!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDMHVQSF9RRRAB",
            "text": "Loved the food, this is a very good, chill Italian restaurant. Not a fancy Italian place, but overall solid.  Great to just have a tasty, regular meal. I enjoyed the burrata, focaccia with prosciutto, pastas, and that delicious hazelnut cake dessert."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREcW9MS213RRAB",
            "text": "I went for my Dad’s birthday. Good food. Our waiter, Antonio, was wonderful. I really like the interior decoration of the space. The hostess was super nice too. Everyone was down to earth, friendly, and attentive. And in trendy spots it’s not always a given."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXXzhfX2pRRRAB",
            "text": "Terrific Italian dishes in a buzzy Village bistro with great service, nice wine list, attractive shed and fair prices. Obviously a hot date night spot thanks to a big cocktail menu and cozy bar. It's been a neighborhood favorite for years, but new to me. So glad we found it!"
        },
        {
            "date": "1년 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUNzdXWWlBRRAB",
            "text": "Prawdziwy włoski klimat, gwar głośno pyszne jedzenie i wino. Spędziliśmy cudowny rodzinny wieczór. Wnętrza i obsługa na poziomie, ceny umiarkowane. Polecam cacio e pepe"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENnZLT2hnRRAB",
            "text": "We had the foccaccia margherita, which was really good, I like the portion and the cheesines of it.\n\nWe also had the mafalde alla pugliese and the costine di maiale. The meat portion of the mafalde was quite small and although the pasta texture was good, I thought it was too salty. the costine di maiale aka the pork chops was good, but again, small portion and tooo salty.\n\nWee tried 3 drinks: the ilegal, the dark and stormy, and the sbagliato —didn't like any of them tbh\n\ntiramisu was decent!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPMjVDaDJnRRAB",
            "text": "Great atmosphere and very friendly staff. The portions are a little smaller than what you’d might expect so you’ll have room for either a shared appetizer or dessert! I really liked the ravioli for the main course and focaccia with prosciutto for the appetizer. Would recommend outdoor seating if the weather is nice!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaNWNuVE53EAE",
            "text": "I recently dined at this restaurant and was thoroughly impressed with their drink selection. I highly recommend trying their espresso martini ☕️🍸– it's a delightful concoction that combines the richness of espresso with a touch of indulgence. While the lasagna didn't quite live up to my personal expectations, my friend thoroughly enjoyed it. For me, it was just okay. However, the real standout was the Burrata e pomodirini dish; the taste of the burrata was exceptional and truly made the meal memorable. If you're a fan of burrata, this is a must-try!🤩"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXcXNTV0pnEAE",
            "text": "I was traveling in NYC for the week and was recommended to try this place! I was not disappointed. I got a delicious raspberry drink and fried artichoke to start, a perfect appetizer choice. The atmosphere was very lively. I recommend the cod as an entre. I also recommend the hazelnut cake as a dessert :) delicious! Very satisfied + great service"
        }
    ],
    "reviews_count": 84
}