{
    "name": "Bodhi Kosher Vegetarian Restaurant",
    "place_id": "ChIJ9zpnPidawokRdhxyso6KXKw",
    "grid": "MN2",
    "address": "77 Mulberry St, New York, NY 10013, USA",
    "rating": 4.6,
    "user_ratings_total": 2126,
    "phone_number": "(212) 233-2921",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3MlNrOTBOalYwY2xWc2NrMUNTamxpVWtkRU5GRRAB",
            "text": "I’ve been coming to this favorite spot in Chinatown for a while, but what happened this time was horrible. I even brought a relative who was visiting New York, and a light-skinned Asian waitress with glasses treated us terribly — she was practically yelling at us while taking our order. She was extremely rude, and it was obvious she was judging us because we spoke Spanish. What a terrible experience — my guest was shocked."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGU09WbENNMTluWVcxWFVqTXpRazFrY0c1UmVXYxAB",
            "text": "Great food, loved the sesame chicken. Waitresses were nice, but once it came to the tip, it got weird.  I wrote down the tip on the receipt. One of the waiters rushed to see it. Her eyes on the number amount. She went up to another waiter and showed her the receipt. Then she came back as we were packing our things and told us to write a different tip amount. She said it's the minimum. There was no typed statement on the receipt that there was a minimum. There should be signs announcing what your minimum tip is for transparency across the board for all customers."
        },
        {
            "date": "수정일: 2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wVWExaHFUa2wyVkUweFdEUkpSRlptVkc5a1dWRRAB",
            "text": "Cool place to eat fusion-healthy, gluten free and vegan."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poTlowdFNaVTVqVkVSeGFqTm9kWFZwYkVWUVgyYxAB",
            "text": "The best Chinese food I've ever tasted in my life"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOR1JFaFdOMVowYkV3NU1IWmFYM05hWDJ4bVRWRRAB",
            "text": "My toddler daughter and I have been coming here for a few years now. I grew up in Brooklyn but moved about a decade ago. I wish I had been going here longer but now its a new tradition between her and I.\nI'll be honest as a NYer a chef and a vegetarian since 2012, this place is amazing.  It is extremely hard to find a restaurant that makes outstanding food, while keeping it affordable and authentic.  And since I know how hard it is to make fantastic things happen (so many chefs are against it because they don't know how to cook) I can say, I absolutely love it here. We got the sesame chicken which is reminds me of sweet n sour chicken and of course our favorite,  the roast pork buns!\nThe service is always outstanding!! My toddler behaves because of how well the staff treats her. This is a huge plus!\nYes, there is a service fee, which all of Chinatown has been doing for at least the last 20 years but the service is so great, that I always make sure to tip on top of it.\nWe will be coming back next September.  Looking forward to it. Highly recommend!\nI would add photos but they have my daughter in them."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sNlZtWndTREk0ZDFKNGRIQXpTakpOWldSQlpIYxAB",
            "text": "I'm sorry but this place is way overrated. My friends and I went yesterday for lunch and the sesame chicken was a big disappointment. We expected it to be breading with soy or tofu in the middle to replicate chicken but instead it was all breading and no fake chicken. Everything else we tried was mediocre. We are never coming here again"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUWJtNW5aMGg2T0dzeE1VSlpMV1p1UWpNeWQxRRAB",
            "text": "LOVE this place! I’ve been there a bunch if times and tried different things and the food is sooooo delicious. I can’t even believe that everything is vegetarian. This restaurant is honestly a dream for vegeterians!\nWould totally recommend"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnM2J6ZG5RVk5EUVRkMWNtVmpTWEJXVldsU1QwRRAB",
            "text": "I am born and raised in Brooklyn and my mom has been bringing me here since I was little and now I go with my friends! I love the food and service and am happy to see familiar faces always. The girlies and guys that serve here are close to my heart 10/10. Be patient and respectful when you come here because this place still exists FOR A REASON!!! 🤎🫂🥹"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oRlMwMHRRamN3YW1JNVVVbHJOWFpZTFVkV00yYxAB",
            "text": "One is not low enough by any measure.\n\nThe staff was rude,\nThey forgot the drinks,\nThe food was the definition of \"mid\". The restaurant was dirty, we left without eating almost any of the food, left a 10% tip and they came back to argue to tell me that 18% is the minimum. Avoid at all costs."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCYVRrYzFaeTFDYm05T1EyVmhMVEpKWjFJNFMxRRAB",
            "text": "Horrid experience, bad service, people rushing you, awful food, oily, just plain bad, and a DEMAND for an 18% tip - you say no, and they don't let you go until you tip. The worst place"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oMVZEWm9kVkpsY21sWlNFb3dRMU5pU2t0SmJYYxAB",
            "text": "THE TRUE ORIGINAL! GO HERE!\n\nThe other similarly named location on Mott St is the original physical location only. The landlord there took over the place and tried to keep the name to fool people into going, but the original chef left and opened this Mulberry location. So this location has the original GREAT food and menu.\n\nThe staff is so friendly and the menu has so many options! BBQ Ribs were amazing and reminded me of the ones when I used to eat meat, but these are vegan! Dumplings and dim sum are huge so be aware when ordering or take some home.\n\nHighly suggest this spot for all vegans and vegetarians who want some great NY chinatown food!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVlVsQnZWalJWY1dsS05IWkdNMHhNUW5vM1VtYxAB",
            "text": "It is a great vegan restaurant in NYC. There are so many options. It is always hard to choose. Excellent service and delicious vegan food. I highly recommend it."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKSE1HMU1WVWxCTVdkeGRITlFZVGgzVERoQk1rRRAB",
            "text": "I love the way they packed the food here to go. It was very thoughtful and well done. I appreciate the service. Even though it was busy we seated within 10 minutes and the food came quickly."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tocE0zUllaMDFTVlhWV1VYZHhVVTEyYmxwWlVFRRAB",
            "text": "The complimentary herbal tea is medicinal and is a Buddha's blessing to deal with NYC's weather. Vegetable fried rice and veggie rolls were amazing."
        },
        {
            "date": "3주 전",
            "language": "iw",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGMVExSm5jWFl4TFZOZlF6aDNPREp1VUd0elUwRRAB",
            "text": "מסעדה טבעונית נהדרת עם מגוון רחב של מאכלים, שירות מעולה ואוכל שיחסית לאוכל טבעוני....ממש ממש הפתיע לטובה.\nאכלנו 6 אנשים מבוגרים ארוחת צהריים נהדרת במחיר ממש סביר.\nממליץ לנסות"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4NE5VYzNjV014Tmprek9WSllNbmhRTXpKek4wRRAB",
            "text": "Really good authentic food. There are coming local"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21adWVqZFlWMEZuUlU1MFEwMDBaVUZpT0RNd1RWRRAB",
            "text": "Yummy food, very reasonably priced, fast service. Recommend."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRFRsaDVNV2M1U0MxU1ZXRTVWVVpFZWxGVGIyYxAB",
            "text": "We were rushed from the beginning of our meal to the end; my partner was still deciding and the server rushed him to hurry up. They made us pay $2 extra for white rice that should have come with the dishes like in any other restaurant. They brought us the bill halfway through my meal, rushing us faster to leave because they wanted to close early (none of the other tables were being rushed out or treated in the same way). They also tried to make us leave a tip before even charging the card, refusing to take the card or to take \"no\" for an answer and debating us and arguing with us. And the worst part is that the food itself was mediocre, we've been to other vegan places with much tastier food and far better service."
        },
        {
            "date": "1달 전",
            "language": "zh-Hant",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kweVZtb3paMjQwUzNkdlVIQlRWSEZ0U2tGVlgwRRAB",
            "text": "服務員好想快一點趕你走！堂食．．非常之不自在！但一定要比20%小費！用化學成份製作假的素食：例如齋燒鵝。食後感到非常不舒服、"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aa2QzWTRhbXRZWkhWcVdsQmtTSGx6VlhwbVMyYxAB",
            "text": "So so good!! Great place with a wonderful service and wonderful food!!! Very good prices too"
        },
        {
            "date": "1달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWWIwSm9VelozY1hOVWRUbERTSGxhYm1KcVpsRRAB",
            "text": "Sehr lecker sowie sehr aufmerksame und hilfsbereite Bedienung."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NMFltNUJWa0pGUmtWcVZVeGlPV290WkZWS1lWRRAB",
            "text": "I am so happy that this wonderful restaurant exists and that I get to exist at the same time as it- that is how utterly great this spot it!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQta3NIcDNBRRAB",
            "text": "Yum, so many good dim sum dishes and all vegan. Must try! I will return to try the lunch special next. The best."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Galp6SkJPRFZOY2pSZmRDMUVjVWRRVmxvNGEwRRAB",
            "text": "Really good!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkNGJURTBkWGN6WVZaeFNqWmpNM0ZVVURRMVdFRRAB",
            "text": "Excellent all vegetarian food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JeVVqWmZUVnA1VFZwbWQxRm1RM1p4WVRVMFptYxAB",
            "text": "Taste is good and the serving portion is good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trNFkxRnNRVVE1T1RZM1VtUllSSFJzVVhGWVVXYxAB",
            "text": "I LOVE LOVE LOVE THIS PLACE! The food is delicious! The Lotus Seed Bun is mine and my wife's favorite dim sum! The food is Great too! All Vegan too!\n\nI keep on coming back for More!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWaWFISkdNamQxWkhWR2RWRkNZV1J2Vm5Gb1JXYxAB",
            "text": "I came here over the weekend with my friends. We waited about 10 minutes to be seated. It was a moderate group—five people. The food was delicious. I’ll come again for lunch."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZNE1XcDBjVWRhWjNwM2RYcG1SQzFPYjFCU09GRRAB",
            "text": "Years ago, I used to go to Buddha's Delight, but it closed. This place hits the vegetarian spot real good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJM2JHSktiR2huZFhsRVpGTkJjRGRIVlRGRGJHYxAB",
            "text": "The food was typical Chinese. The waitress spoke a very poor English and was difficult to understand and make an order."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25adGJtOXBYMFZuZW5ReFpHVndSWEZJT1ZCc1NHYxAB",
            "text": "Some of the best vegan food in the city at very reasonable prices. Very respectful of gluten allergies. Everything is tasty but my personal favorites are the fried taro dumplings and the veg ribs."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WNmVWTmliVmR5ZG1seWVqTnZWRkJGVGw5bmNsRRAB",
            "text": "Delicious dumplings and Dim Sum and all were vegan or vegetarian! The gluten free menu is also super helpful.\n\nOne big note: Do keep asking about which items are safe for your food allergies.  Staff were wonderful. I had to take off one point for service because the plates weren't marked as gluten free, the staff didn't announce which plates were gf when they delivered food and it became hard to keep track after a while. It would be helpful to add allergen toothpicks to their dishes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cdk9ETk1hMVo0WlUxRmFYaEtSVzlpV21weVVuYxAB",
            "text": "dity place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkbVp6aHJjbTF2Y2pCdFRtUm5kRFJvYkZRMFRuYxAB",
            "text": "It's all fake meat and so delicious. The noodles, fried rice, and fake meat dishes were great. The staff there is very friendly and accommodating."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKcVVXVjRkblpEYkRsZllrZHBZazVmWlZOWExWRRAB",
            "text": "honestly, would go back every night for the bbq \"meat\". you'll be served very quickly, delight in the variety-centric dim sum menu, and leave with buzzing taste buds. makes for an awesome date night or family outing!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCeVFXMUNVVTFRUlRKM2J6aGFWM0l5Yms5b2JGRRAB",
            "text": "This restaurant came highly recommended, which is why we decided to visit. Unfortunately, my experience was far from good. First, we had to wait a long time before we could place our order because no one noticed us—we were seated in a corner near the window to the left of the entrance. The initial welcome was underwhelming. Eventually, I had to approach a staff member myself to ask if we could order.\n\nThe food did not arrive at the same time; I had almost finished my meal by the time my mother’s dish arrived. The service was neither fast nor particularly friendly, and I did not feel welcomed.\n\nWhen the bill came, we noticed that the restaurant had already added an 18% tip, without giving us any option to choose our own tip amount. This felt very forced, and I felt pressured to pay a tip I hadn’t decided on myself, even though tipping should be a personal choice based on your experience. We paid for the meal, but one staff member was still upset that we hadn’t given any additional tip and confronted us, asking why we hadn’t tipped. She defended herself by saying, “I bring you the food and drinks.” Firstly, that is just part of her job, and secondly, the food and drinks were not delivered quickly or in a friendly manner. That’s why we chose not to leave any extra tip. The woman walked away angrily without saying anything further. Very rude! I will not be returning to this restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbUxUTjZTR0k0Y210bFpHMHRkaTFyV0ZFelpGRRAB",
            "text": "Great food with options for everyone! We had dim sum and it was so nice to have so many options!!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4dXEtc3J3RRAB",
            "text": "Fav spot"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZd1NYUkNUazFHTlVOWlRYcG5TME5wY0MxeWQxRRAB",
            "text": "Was in the Big Apple for a charity event for a long weekend. Reddit users highly recommended this place, so I thought I’d give it a try. We were seated immediately and the restaurant felt very clean, albeit a bit dated/tired. Who cares, though, right? So long as the food is good. That’s my usual motto.\n\nThe service throughout the entire meal was very good. Servers were incredibly attentive. We had dumplings and the servers would open the baskets already on our table to serve us, so we didn’t have to do it ourselves. Very kind and hospitable.\n\nThe food was good overall. This is an all vegan menu of different Chinese classics. The sesame chicken with broccoli and rice was the best thing I ordered. The dumplings were also good, but the dough was a tad gummy, or glue-like. Not my favorite to be honest. The menu is HUGE so it helps to look ahead of time if you’re the type to be indecisive or overwhelmed by option lol.\n\nIf you’re vegan or just curious, I’d recommend you give this place a try!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RemNrSmZja0ZRVGpOVlEwUmlYMVpUYjBwaGJIYxAB",
            "text": "Shoutout to Kira who will always remember this story (don’t forget about the microwave). We ended up ordering way too many dishes so if you want to see the whole menu be sure to check out the pics below. Our only regret was not having enough stomach room to take it all down."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKa1NscFVkRzl2VlVORk1rbE9hbTlmTXpSeVNXYxAB",
            "text": "One of my favorite spots for vegan and vegetarian food in the city. The staff is always warm and welcoming, and the food is consistently fresh, flavorful, and delicious at very reasonable prices. They are also happy to cater to the Jain diet, a rare and thoughtful option in New York and perfect for visiting guests. Could not recommend it more!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210TVExUnlMWFZsWjJOR2FIVkJjRFF4ZGtaR2ExRRAB",
            "text": "The food was blend and not pleasant.\nIn my opinion. We were disappointed in the taste and the whole ambiance is\nruns of the mill local Chinese restaurant. We won't be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZNWEyZEJlVXRDVGt4VlRtMURORUkxZVRkd2MyYxAB",
            "text": "Been here a few times, and it’s a hit and miss place. Definitely no frills, good for vegetarians but the service leaves a lot to be desired. You’re rushed out rather quickly, and the staff could learn how to smile!\nWent recently and got the green beans. Mapo tofu, dumplings (3 kinds), some drinks and a couple more appetizers\nEverything was over salted to the point where we could not eat the tofu and the string beans at all. Also the tofu was sooooo oily, it was impossible to eat.\nThey were not happy when we pointed it out and refused to acknowledge it. It was kind of surprising because we went around 4 PM and the restaurant was not very crowded, but we had quite a disappointing experience.\nAt other times, the experience has been better, so go at your own risk. They do add a tip without telling you and that’s a little annoying because you automatically think and give an additional tip and they don’t point it out."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsc2RFOTNWVFk1Wlc1Uk9UaHJObTUxZHpRNGRHYxAB",
            "text": "Really unique flavors and textures all made using vegan ingredients. I was surprised by the tofu texture.\n\nI don't know if this is something I'd try multiple times, but for sure try at least once."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWb1YxTndZVnBuYmtkaFNVcEdObTlZYW5STE1HYxAB",
            "text": "Food was pretty okay. Service was very rushed as well. We got the noodles and soup dumplings and regular dumplings. Soup Dumplings were very questionable and had a very off taste. Dumplings were very good, noodles were quite good as well.…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5MVQwMXlXV04yVW1KcVpVZENaekJEYW5OWlJuYxAB",
            "text": "Excellent 👌 for vegan/ vegetarian\nI highly recommend this place in Chinatown on Mulberry road and Canal.  I was with 3 others and we ordered at least 7 dishes and shared all of them, house special mixed vegetables, dim sum, vegetables fried rice, curried noodles and more.  Everything was excellent, and delicious 🤤\nI went back a second time and when I return to my acupuncturist at 139 canal by Manhattan Bridge and next to Buddist temple I will go here every time I visit NYC from MI"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0d1VVTkxkR1pOZEhaMVdYVnphR1l4YVVKQ2VWRRAB",
            "text": "Wonderful"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRFNVRjZSbk4zWVdsTVpsbGxTWFEyUzNSSWVYYxAB",
            "text": "Great vegan kosher Chinese food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jNGFHcEhTbWhqY0ZCeWVqSTNZV055YjJ4Nk9FRRAB",
            "text": "Since my Bnai mitzvah my family has been attending here. Mostly Chinese people and a few American Jews like to frequent here or its sister location. One of the waiters speaks 8 languages including Hebrew. Everything on the menu is yummy witj a Hasgacha from VAAD of Brooklyn."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdGVYaERlVzU0VWpaQlIwTnphbU5WY0hKWGIyYxAB",
            "text": "Best hot pot ever, it's a bit spicy but I love it, the dumplings are really good too and I love their spring roll, and it's very affordable, i love hanging out here with my friends."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNM3lrcXFEODhDODNBRRAB",
            "text": "So I seen this restaurant review on righteous eats and bookmarked it on my IG until I made it to the restaurant. Yesterday night was the day that time and space opened up to allow me to take my husband here.\n\nWe had the vegan general tsos chicken which was my favorite dish of the night and I am absolutely aware that “tsos” is Americanized Chinese food. Maybe when I make my way back I’ll have the courage to try something more authentic.\n\nI love bok choy and I especially love them braised in a white garlicky broth and this was not as potent and aromatic as I’d like it to be but it was good.\n\nMy husband did not enjoy the shiitake mushrooms and broccoli as much bc it definitely did have a distinct ocean flavor so I’m assuming they used some type of seaweed. I enjoyed it more than he did.\n\nThe vegetable rice is PACKED WITH VEGGIES and you get your full dose of fiber with this plate for sure.\n\nThe vegan ribs were very interesting and I should have got them tossed in sweet and sour sauce. The darker part gives pork flavor and the middle piece might be tofu.\n\nI absolutely loved the complimentary black tea they give you at the start.\n\nWe had to wait to be seated which took about 15 minutes but it was nice to see everyone enjoying their food.\n\nI’m interested in coming back to try some dim sum bc I could not make a decision bc the options were too vast.\n\nI hope to come back with my mom and my kids at some point.\n\nThank you for having me."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNMi1nOEhnbWNqcWR3EAE",
            "text": "Authentic vegan Chinese food in Chinatown. I had the mapo tofu and chicken chow fun both of which were amazing! The lunch special comes with an appetiser and a side of rice for $8.50, a great deal! Amazing food at a great price point.\n5/5 from me!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKMlluSlBRMEp3UWw5dVdEbE5UV3A2ZW5wQ2IyYxAB",
            "text": "Yes, this is the full name of the restaurant. Yes, everything on the menu really is vegetarian and kosher, which has a really nice change if you’re that person always looking for the vegetarian option on the menu because everything is safe—it’s all made with meat replacements like seitan. This place has been one of my favorites for years, and it’s the perfect place to go with friends because of the dim sum menu: just check off what you want on the dim sum menu (which conveniently categorizes the options as small, medium and large plates), and you’ll have your food quickly with ample refills of green tea. Consider this place your sweet retreat at lunch if you’re called for jury duty in Manhattan, but it’s also a very popular casual dining spot for a low-key dinner at a good price."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcjZqVkNnEAE",
            "text": "The lunch menu provides incredible value for money! Small soup, main and green tea. All superb. Friendly service, good portions and so many interesting vegan options! I had the veg meats and basil sauce with brown rice as my main and loved it.\n\nIt was very busy but there were a lot of spaces and service was very quick despite the popularity."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNbngzY1hNM3R2Yk1REAE",
            "text": "This was a really good vegan place with lots of dumpling options as well as many other things that are typically hard to find vegan. Reasonable prices and really good tasting"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xTFlXMVJYMUE1TVZkWVpUbG9UMUpNTW5CWE1YYxAB",
            "text": "Their lunch special has incredible value for $10. Comes with choice of white/brown rice and a soup.\n\nI got the Kung Pao chicken with tofu vegetable soup.\n\nKung Pao chicken: ‘Chicken’, peanuts, bell pepper. 10/10\nTofu soup: Broccoli, tofu, cabbage. 10/10\n\nGreat place to get a vegan/vegetarian lunch"
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdjhISGNREAE",
            "text": "Nous sommes venues à 7 manger un midi. La nourriture est très savoureuse et copieuse. De plus, quel plaisir que tout soit végétarien ! La cuisine est bien travaillée. De plus, le service à table était rapide et très bienveillant. Je recommande !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMdnZ5eHR3RRAB",
            "text": "8.5 out of 10\n\nHighly recommend this place to everyone, I’m\nvegetarian and I appreciate having a great variety of dishes to choose from. My boyfriend is not a vegetarian and he also loved all the food here.\n\nDumplings were delicious, and both main courses positively surprised us. Very good price considering the quality of the food and the size of the dishes.\n\nService is good and quick. Definitely, I would come back to this place."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dlBYekZ3EAE",
            "text": "Delicious food &’friendly service! Our servers made great recommendations and the food arrived quickly. The portions were large enough to share. Great value for cost. We seek this place out every time we are in town. Highly recommend the string beans & “spare ribs”. Perfect options for vegan diets and shellfish allergies!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNka19peHJ3RRAB",
            "text": "Awesome experience! Everything is completely vegan and delicious (even for the nonvegans). We had a group of 7 and they took us to a really nice table in the back. Portion sizes are really big and great prices! Easily split by 2 people. Free tea on the house and plenty of good options. Definitely recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfaUlYa2hnRRAB",
            "text": "First time encountering a vegetarian spot in Chinatown. Completely blown away by the flavors of each dish. The BBQ meat will wow even the biggest critics of vegetarian/vegan food. Whole time while eating the group kept saying If vegetarian dishes this tasty were available everywhere we'd never eat meat again!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmamVEcHFnRRAB",
            "text": "Loved this place! Service was expectional, friendly staff, helpful in suggesting what to order, as they have a variety of great options. We ordered some dim sums, dumpling soup, bao buns. Everything arrived soon and it was delicious and filling. The restaurant was packed but we got the table in 5 mins.\nWould definitely come here again with friends/family. Keep up the great work!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsRFdWVlpVMkpyVVRCeE5Ha3RWMm8wY0dWNGVuYxAB",
            "text": "We had an overall okayish kind of experience.... we were excited to find numerous veg options on menu.. however most of them tasted like soya nothing more than that. They served tea as complimentary beverage which was extremely soothing! Helpers were in a hurry to serve and clean, they didn't let us finish and started cleaning up the table. The ac on top of our table started leaking 😳 amidst of the meal! Not to forget the cheque consisted of pre added tip with no prior notice..."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcnZmMlJnEAE",
            "text": "Uploaded a photo of the kosher certification because it can’t be found anywhere online. This place has been my favorite kosher vegetarian spot for many years. My favorites are the baked vegetable meat buns, mushroom rice roll and Szechuan hot pot. The staff here are incredibly nice and sweet and the food is amazing. This is a classic spot, don’t skip it!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdVB2UDBRRRAB",
            "text": "It really is very good option to try if you like Chinese and looking for something veg, the price is reasonable and the food quality and quantity both are good. I highly recommend this place. The staff is humble and nice too ☺️\nPs- We ordered steam veg dumplings, chicken veg rice along with house red wine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkazVqSU93EAE",
            "text": "The place was very busy when I got in at around 3:05pm on a Monday. Not too bad. For Dinner, I had the BBQ Veg Meat with Fried Taro Dumplings and both of them were Delicious. The servers were very Nice and Friendly. I spent under $20. That was a Smash! Definitely stop by this place because they have a wide variety of Vegan and Gluten Free Options. 50+ of the Item Menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3MnBhLXVRRRAB",
            "text": "I loved this place. Food was delicious, so many options, too! If you’re looking forward to trying out some good Chinese food while in this part of the city and you’re also vegetarian / vegan, this is a great option. Prices are very cheap, considering how good it is (we ate in a Chinese restaurant in Brooklyn two days ago that was a similar price range, but the quality was way lower in my opinion) - we even ordered from the special lunch menu, so it was even cheaper! In the lunch set you get a soup or a spring roll and a main dish. Portions were quite large, too. The service was kind, professional and quick. The place seems to be popular with locals and tourists alike."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNjRIdVlREAE",
            "text": "i love this place. it was one of my lifelines/favorite “cheat” day spots during the years i switched to a full Vegetarian diet. even now after i’ve switched back to an omnivore diet, i still come here every few months because their BBQ meat is very close to indistinguishable from real meat. the puff pastry dim sum option is good too— all of their dim sum options are good. highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMza0puaVh3EAE",
            "text": "Food is good! Very crowded on Friday night, but we managed to seat by walk in. Food is good, be careful with spices, order them on side, they are very strong! Complimentary tea is great☕️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxMGVfejdRRRAB",
            "text": "Love this place. I’ve been eating here for years and the food is great and dependable. Their eggplant with garlic sauce and Buddha’s delight are delicious. I always have to order the turnip cake, but also really enjoy their veg char sui steamed buns. It’s the best vegetarian Chinese restaurant in the area. Good prices and generous portions. Need I say more?"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5aElIWGl3RRAB",
            "text": "I subsisted on the vegetarian cha-shu for a solid two weeks. SO tasty. The lotus buns, Sichuan beef, and hotpot, sweet sour soup are also fantastic. Just such spectacularly flavorful, delightful dishes and lovely people. PS. Lunch specials are great deals!"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aXAtSDlBRRAB",
            "text": "Amazing food and decent prices, plenty of options. Everything I tried was delicious.\n\nI’m editing my review since I’ve been to this place so many times past the year and a half and it’s one of my favorites restaurants in New York. The food is always tasty and the staff is always friendly!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSemRUdzVBRRAB",
            "text": "I love bringing people to this place. It always blows them away that everything is vegan. I suggest going with a group of people and ordering a handful of different dishes to share family style. You absolutely have to get the shark fin congee and shrimp rice rolls for appetizers! The sesame chicken and broccoli also never disappoints for mains. The staff is always kind and the food is always brought out fast!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNleUt5RjZBRRAB",
            "text": "This place is a gem! The BBQ meat is my ultimate favorite.  I like to go during the week 11a-4p for the lunch special price!  The service is always quick and friendly, I love this place because it’s so yummy, quick with great service and the best prices!  I usually can get in and out in twenty minutes, which is perfect when I’m hungry and rushing to work in midtown!  Highly recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMdTA4TG0xMEk3ZGlRRRAB",
            "text": "Great prices and portion sizes! A huge selection of vegetarian Chinese food.\n\nThe mock jellyfish was my favorite."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYc3FmcHZRRRAB",
            "text": "I first visited this restaurant in March 2023 and really enjoyed it, so I came back in October 2024 to try it again—and it was just as good! The service is fast and friendly, and the menu is large and diverse. I highly recommend the peach boba (though it comes with a lot of ice) and the plant-based sesame chicken (it tastes amazing—coming from a non-vegetarian)\n\nThe interior could be a bit nicer, but it’s perfectly fine for dinner. I’d definitely return if I’m in the area again.\n\nOne thing to note: all appetizers come in the quantities shown on the menu, which caught the table next to me off guard, so they ended up with more than expected!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqNXFMRi1BRRAB",
            "text": "One of my favorite restaurants in NYC!\nAll vegetarian, with great chicken imitation (and other meats too).\nI have come multiple times, and everything I have tried is delicious. I have brought non-vegetarian friends who also loved it.\nMy favorites are the steamed buns, the veggie \"chicken\", sesame balls, and coconut balls. But really anything on the menu is amazing."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNnByTVZREAE",
            "text": "great experience! came with my vegetarian / vegan friends and everything was so delicious😊 highly recommend the chicken"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtLUpyaElnEAE",
            "text": "My wife and I walked in to Bodhi on a Monday afternoon around 1 to a relatively quite restaurant to try out some vegan Chinese food. We were seated right away and given 4 different menus, one where you could simply mark your Dim Sum order.\n\nWe ordered Steamed Curry Dumpling ($4.75), Steamed Veg Shrimp Dumpling ($4.75), and BBQ Veg Meat ($8.75) - all were amazing especially the BBQ Veg Meat where they somehow managed to give, what we felt Tofu Skin, a very roasted duck kind of a taste. The Veg Shrimp dumpling also had that \"fishy\" taste, with no animal protein what so ever!\n\nFor mains, we ordered from their Lunch Special menu and got Chicken Lo Mein Fun ($8.50) with Hot and Sour Soup, and also ordered Lamb in Garlic Sauce with Spring Roll as our side. Both were excellent and the \"Chicken\" in our Lo Mein which was fried Tofu, was the best Tofu we ever tasted. So flavorful and for a change, Tofu did not feel like consuming cardboard! The Lamb too was excellent where lamb pieces I think were replicated by Soy and the sauce was very flavorful.\n\nService was excellent, food arrived quickly, and probably one of the most reasonably priced Vegetarian restaurant I have been to in Manhattan. Will definitely visit again with friends and family and will also highly recommend this place for Vegetarians, recently converted vegetarians, and vegans!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMVBqSlJBEAE",
            "text": "I’ve been to the other location and have been dreaming about the siu maai since then. I love that it’s all vegetarian and makes me want to try making some of the items at home (sticky rice siu maai maybe?)\n\nI got 3 items since I was just one person.\nThe siu maai was still awesome with the fragrant sticky rice.\nThe haam seoi gok wasn’t super crispy, but the inside was flavorful and had texture with some crispy bits (vegetable, not fried I think).\nThe sesame ball was also good with a crunchy, crispy outside and gently sweet filling.\n\nOverall, a great place for fully vegetarian dim sum!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4OWM3OW5nRRAB",
            "text": "Dined here several times many years ago and just returned yesterday. The experience continues to be great if not better! Especially shout out to the short hair lady with glasses who was amazing. She really made sure the food fit my husband's dietary restriction of no refined sugar which is challenging for most Chinese/East Asian restaurants. She even brought us tamari soy sauce that's sugar free.\nAll the dim sum options were great and the best in my view among all the vegetarian dim sum restaurants. The vegetable dumplings had tons of fillings. Taro dumplings both steamed and fried options had great savory flavors. Only the lotus pancakes were a bit greasy and less interesting.\nHighly recommend this place!"
        }
    ],
    "reviews_count": 81
}