{
    "name": "Cecchi's",
    "place_id": "ChIJwbiIbj1ZwokRQxLK96ov07g",
    "grid": "MN2",
    "address": "105 W 13th St, New York, NY 10011, USA",
    "rating": 4.5,
    "user_ratings_total": 255,
    "phone_number": "(212) 931-6335",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KR1QwNUhOV05RYUdwbFZtOWlMVGRPVkhoelIyYxAB",
            "text": "Now this is a special restaurant that deserves a visit.I was very pleased with all that of what the restaurant offered. Bravo !!!!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1V1V5MUJOekJoY21kM01WVmZjekphVW05dlFrRRAB",
            "text": "I had a wonderful time at this restaurant celebrating my friend’s birthday. Christian, who was our server took great care of us and the food tasted amazing as well"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvd1lreERVa1ZQYjBkYVlVOXBNbmhRUlUxSVQwRRAB",
            "text": "Amazing place, food drinks everything is awesome"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOVE4wbzRlRWRNY25WYU1VVjFhaTFNVHpKYVdsRRAB",
            "text": "I am not someone who normally writes reviews, but what I witnessed at Cecchi’s last night was serious enough that it must be made public. I was invited by friends and arrived with high expectations. The evening started well—good food, a knowledgeable server, and what seemed like a classy atmosphere. But that changed quickly.\nThe manager, \"Naomi\", repeatedly interrupted our table with intrusive, inappropriate comments that made us uncomfortable. Instead of improving the experience, she became a disruption. But what truly concerned me—beyond the ruined dinner—was her abusive treatment of staff in front of guests.\nShe spoke to one of her team members in a degrading, hostile, and aggressive tone, publicly humiliating her while we were eating. It was shocking to witness, and it showed a complete lack of leadership, professionalism, and basic human respect. No employee should ever be mistreated or verbally abused.\nWhat was supposed to be an elegant and enjoyable environment instantly turned hostile and low-class because of her behavior. The atmosphere went from “fine dining” to chaotic and uncomfortable, making it impossible to enjoy our evening.\nThis is not just poor management—it is a toxic work environment and a violation of human dignity. If this is how Cecchi’s management treats people in front of guests, I can only imagine how employees are treated behind closed doors.\nI will absolutely not recommend this place to anyone, and I truly hope ownership takes action and reevaluates who they allow to represent their brand—because no establishment with this level of disrespect should call itself “upscale.”"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKNU5IUXhaSEkyYTFaTU0xbFBaMDAzVUhKWU5VRRAB",
            "text": "Very NY classical style. American food with great cocktails! I brought my kid and was not a problem. Nice staffs."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GaFVVOURSalUxVlZsQlUwVXlZWGRwUld0bVQzYxAB",
            "text": "The worst experience I had in the city. Don’t recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRldqbHhhMFJHZHpoTE5YWjVUR1ZGU2tkVlpIYxAB",
            "text": "Excellent food and service, Sebastian made our experience 💯"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJeE5VMUNaSEpaUW5SNVJ6ZFhlamhXVERsTWFXYxAB",
            "text": "Cecchi’s tires too hard, it comes off really intense"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NllrTmtRelUzWkMwd2MxaFliVnBoYld0V2IyYxAB",
            "text": "Is it pretentious? Yes. Is it loud? Yes. Is the food amazing beyond your expectations? Yes. Fresh oysters, great caviar, one of the best burgers I’ve ever had, the list goes on. You’ll be thankful you put up with the wait and the cramped bar once you sit and taste the food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oMGVHcFlNbmh3ZUZGRE1VWmpWakZmU1hKbldsRRAB",
            "text": "The best of the best ribs, burger , pork chop.  Not a wedge salad"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5SWRIb3haMEpPZWxaUFNIWlBkVWs1Y1ZGcldtYxAB",
            "text": "Class acts! Took my mom visiting from out of town here and the crew here treated us incredibly well. Everyone from the staff at the host stand to our main server to the additional server helping keep our waters filled were incredibly kind and accommodating. My mom likes a lot of citrus in her water, and the waiter happily obliged her requests for lime wedges. When he noticed she was squeezing them into her water, he proactively brought over a warm washcloth for her to wipe her hands off with and a tiny pitcher of lemon juice to save her the effort. My mom felt very well taken care of and could not stop talking about how charming everyone was--win in my book!\n\nAs for the food, the steak and fries were fantastic--best fries in the city! Paired very well with the Côtes du Rhône red. My mom got the calf liver and thoroughly enjoyed that. Market salad was refreshing but otherwise unremarkable--think the \"wedge\" is the way to go here. Chocolate cake with espresso cream to finish was heavenly--not too sweet and just the right amount of rich.\n\nWe finished dinner and my mom wanted some photos, to which another member of the crew happily obliged by snapping a pic of us by the bar and following us outside to snap one outside as well--just too accommodating. Has been one of my favorites in the city and this night galvanized it for me. You guys really run a fantastic operation. Cheers!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KWmRWVjRZMTlZU25WSFNXaHBOblUwYWxoU1VuYxAB",
            "text": "Great Ney York dinning experience. Sit at the bar for fantastic service and chat"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkb1NVUldORmw2UjE4MFZ6VXRWVXB2ZEdoa1FXYxAB",
            "text": "It’s refreshing to experience a restaurant where amazing service is clearly their North star. The food, drinks, and atmosphere were all fantastic but it’s the focus on exceptional service that really stands out from the moment you arrive and are being seated to the very end of the meal. In a side note, the market salad was amazing, as was the black cod."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201RU5IZEZTVmg0U1Vrd1lWZzFkblF0TFZCNVZWRRAB",
            "text": "Noise level wat high"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKNGRrVm9ZVFV4WW1kSFdGaFRUM1pmYm1wUGFrRRAB",
            "text": "Cecchi’s is amazing. The design and vibe of the place are on another level, so unique and iconic. The staff are super nice and welcoming, and Josh really stood out, he was great. Overall just a dope spot that feels special and worth coming back to."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKeWVHTmhSMTloYjNwc1ZuZG1Ua0ppU2sxNlpHYxAB",
            "text": "Wonderful place, service, ambience, and food. We very much enjoyed ourselves and will be back. A hidden gem."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2preVEwWTJWa2xEYTBRNVowUkdaVzF3YW04dGNIYxAB",
            "text": "A Gem in the West Village: A Truly New York Experience at Cecchi's\nTucked away unassumingly at the start of West 13th Street off 6th Avenue, Cecchi's presents a modest facade that belies the absolute gem waiting within. The moment you step through the door, you're enveloped by an electric and vibrant atmosphere. The buzz of conversation and energy is palpable, yet it's perfectly balanced, creating a lively and welcoming environment rather than overwhelming chaos.\nFrom the outset, the service was nothing short of professional and genuinely cheerful. While waiting for our table, the staff kept us informed of the status with reassuring frequency. They thoughtfully consulted with us on our preferred seating, all while we ordered drinks. Despite the bustling crowd and the clear demands on the staff, every interaction was handled with an energetic grace and a sincere smile that made us feel truly welcome.\nThe cuisine is American, executed with a precision and flair that elevates it to something special. Each dish was beautifully presented, and the flavors were simply outstanding. If I were a Michelin inspector, I would not hesitate to recommend a star for this establishment.\nThis was my first visit to Cecchi's, but it certainly will not be my last. I wholeheartedly recommend it to anyone seeking a lively atmosphere, impeccable service, and delicious food. Whether you're in the Chelsea or West Village area, or even making a special trip from another neighborhood, Cecchi's is well worth the visit. For tourists, it offers an authentic and unforgettable New York dining experience. This is the place to be."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FNGQyZGlTVVZKV2prNFYxOUZibE5VZVhNMExVRRAB",
            "text": "We were looking forward to eating here but we failed to noticed the fine print on Resy that there is a no baseball cap rule, which is not something you consider (as a New Yorker) as a factor for a downtown restaurant. My admitted fault. We checked in, and they didn’t ask my husband to remove his MoMa cap until they were ready to seat us (10 mins past our reservation time). My husband was not going to remove his hat bc it was a part of his outfit. Also, they could have let us know at check-in and we would’ve just left then. I work in fashion, and we were both wearing designer clothes; we weren’t coming from the beach. We decided to leave bc ultimately this policy is discriminatory and archaic. My husband is PoC, so being in an all white atmosphere is already uncomfortable. We’ve eaten at Benjamin Steakhouse w a cap and they would lose a lot of clientele if they had a no cap policy. The loud and casual atmosphere of this restaurant does not demand such a policy, which should be outlawed - we don’t live in the 1950s anymore. It’s a shame bc we were really wanting some steak and a martini, and we’re excited to discover this place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTExXZzFXVGh4V25RNVJFVldkR1l5ZWtJemEzYxAB",
            "text": "Everything about Cecchi's is great.  The decor is beautiful, the food is amazing and the staff is top-notch.  We had a great time and will be back every visit to NY."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xveFQxSndlR2RUYUd4dVNEVk1ibXBFTW1WaFJHYxAB",
            "text": "Michael and his team are attentive, kind and professional. The food is outstanding. Cecchi's is ALWAYS on our list when staying in NYC."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNkxUY3RhV2hpWVVsT2RVWmpYM2hIZFd0S1JIYxAB",
            "text": "Beautiful place with such a fun vibe. Amazing food and even better service - would definitely come back again! Pork chop and burger were 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wM1dHdHJkMVpvVWpKUmRXRkhWblJqTjBGdldtYxAB",
            "text": "Perfect spot for an intimate dinner - welcomed as old friends, delicious food and amazing cocktails"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvNGRFMUZaMUZHUkhwVU5YZDVlbWxJUTBkSmVrRRAB",
            "text": "One of the best service experiences I have had in years. And amazing food!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKR2VsSnhSMWhuU0daQ1dVeDZWR1Y2U1d4M1YxRRAB",
            "text": "this is a late post but my teenage daughter and i went here for thanksgiving 2024 and had the most incredible experience. it was only her 2nd time in nyc and 1st time at the holidays. from the time we walked in we were impressed not only with the staff but the atmosphere and ambiance. fast forward to the food. wow. just wow. from the caviar appetizer to the MAC AND CHEESE (best i've ever had), turkey and of course incredible dessert and cocktails. we will be back during our next stay in the city."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOVWQwTjNSbTlZZUZwVk1WRlBOelpGYjBjNVQxRRAB",
            "text": "My boyfriend made a reservation for my birthday. The reservation was for 9:00 PM. We arrived 10 minutes early and waited, but by 9:20 PM the table still wasn’t ready. What disappointed us even more was that we saw several available tables without any reserved signs. We decided to leave the place feeling really disappointed, especially since it was a special occasion"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNLS02S2lLcEpuU25nRRAB",
            "text": "One of the best restaurants, the art, the owner, and the food. It feels like what the real old New York used to feel like."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJLV96dW0zc2JiQkF3EAE",
            "text": "Delicious! Highly highly recommend!!! Everything I had from food to dessert to wine was impeccable ✨"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNZlc3Xy1kMHBYRld3EAE",
            "text": "Went here when my daughter invited me to celebrate my birthday at her favorite restaurant.  I now understand why it's her favorite place.  The staff was incredibly friendly, the food and drinks were outstanding and the atmosphere just had a fun vibe.  The owner was gracious and appreciative of our business and actually greeted us and stopped by at our table twice to be sure we were happy, which we we were.  Our dinner included some starters for the table (pickled vegetables and the not wedge salad).  The salads were incredible with just the right amount of dressing and a generous amount of blue cheese mixed in that made it almost too good to stop eating.  The special of the day was a 32 ounce ribeye which three of us split and it was cooked perfectly.  My daughter had the pork chop with a horseradish fused mash potato that was the best I've ever tasted.  For desert we shared a strawberry shortcake which came to me with a birthday candle and some singing staff which was a nice touch.  Although I personally don't drink, all of the rest of my family raved about the drinks they had so I assume they were great too.  All in all I would highly recommend this as a place to go with a small or large party as they have a wide variety of entrees that will suit all palates.  In a city that has so many choices to eat and drink, IOne of them should be this one!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPN1kxdWF0cWZMR3NBRRAB",
            "text": "The food, drinks, and staff are all 5 star. We got to meet the owner told him he did a great job hiring everyone that works there. Even the patrons are 5 star. Cecchi's is special place that embodies what makes New York incomparable."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPU2t2YXk1dXM3emNnEAE",
            "text": "El lugar perfecto y la comida deliciosa."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNUoySmZ3EAE",
            "text": "Great spot for a lively dinner with excellent martinis. We were able to get a normal time reservation on a Saturday night a few weeks in advance. It's a very loud atmosphere so it's great for a small group or a fun date but maybe not for parents.\n\nThe cocktails are delicious - a martini order is a must. And we loved all of the food. We have the Lobster Salad Lettuce Wraps, San Gennaro in a Blanket, the Striped Bass, the Pork Chop and the Chocolate Cake. Service here was great - not too overbearing but attentive.\n\nOverall I would recommend Cecchi’s for a fun dinner or for drinks and snacks at the bar."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbUp2cGJ3EAE",
            "text": "Beautiful place with nice vibe and great atmosphere. Love art deco murals. Service is remarkable.From entering the door we were greeted by friendly hosts. Then we had nicely crafted drinks by the bar. When we were seated our waiter was friendly and helpful. Every dish was tasty and flavorful"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvX1BxYkZ3EAE",
            "text": "Great experience! The staff were amazing and very helpful. Just walked and luckily we got a seat within minutes! Def coming back"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMHA2d25RRRAB",
            "text": "The tables were really close together and caused difficulties coming in and out or having servers and guest walking past."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJd3ZyMHRBRRAB",
            "text": "Chips and caviar were great. I enjoyed the NY Strip too. The staff were lovely but there was an issue with attention in the beginning. We were sat at the front entrance so I think the staff couldn’t see us. After we were given water it took about 30 to get someone to come back to take a drink order, then a food order. This was disappointing but it was a busy Sunday night."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRa1plcmZnEAE",
            "text": "New York has so many great restaurants and this is definitely one of them. Beautiful ambience, outstanding service, and excellent food. Would recommend highly for anyone looking for a special occasion dinner in the East Village."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRZ1kyYVZBEAE",
            "text": "Very attentive yet laid-back servers who seem like they really want to be there. Food and drinks were excellent, I had the cucumber gin martini and steak frites. Dinner, drinks, and dessert for 2 was $200 which felt very reasonable for a great Saturday night out"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncmFuNjl3RRAB",
            "text": "I originally went to Cecchi's by chance the first week they opened. The food and service was great, but as with any brand new restaurant, you could tell there was a little bit of chaos and kinks that needed to be ironed out. Coming back a couple of years later after I finished reading owner Michael Cecchi-Azzolina's memoir, I was not disappointed. The food (I had the pork chop, side of creamed spinach & onion rings) was fantastic, the service was wonderful, and the vibe is quintessential New York. I was lucky enough to introduce myself to Michael as well, and he was more than gracious and friendly. I will continue to recommend this restaurant so that it becomes a staple, and I wish the Cecchi's team tremendous success"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndE95RHN3RRAB",
            "text": "Could not have had a better time.  Food was fabulous and we got to meet the owner and get a signed copy of his book.  Will definitely be back !!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBMXN6X2JBEAE",
            "text": "Cozy place, good food, well decorated\nVery packed though, I would recommend going there as a party of 4 to be seated in one of the booths"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcWZISmRBEAE",
            "text": "Everything was perfect. Food was amazing. Service incredible. I can't wait to go back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBa01TMnRnRRAB",
            "text": "My husband and I went for a date night and had an amazing time! The restaurant is beautiful and our waiter was charming and helpful. The food was delicious as well. Can't wait to come back"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfajlqcHN3RRAB",
            "text": "Cool vibe.  Great food.  Had a snag at beginning of night as we were late for our reservation but Josh (manager) stepped up and completely turned things around, making  our night perfect.  The pigs in a blanket and pork chop are musts!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfZy0zUVZBEAE",
            "text": "The woman who checked us in was super rude and the place was terribly loud."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dlBPMlNBEAE",
            "text": "This restaurant was recommended to us. I wanted to try their famous burger but was terribly disappointed.  We asked for medium well and the burgers were very well done. The burgers seemed to be cooked well ahead of time and maybe just reheated as after we ordered them, they came out in under 5 minutes.  I’m not a chef but big burgers like they served don’t cook in under 5 minutes.  The burgers were Luke warm and definitely not hot as they should be. The burger was extremely dry with little flavour. I would have probably sent the burgers back but didn’t see the waiter for some time after the food was delivered. The coleslaw was  very dry like the burger. The fries were hot and crispy but with a high end restaurant you would anticipate freshly cut potatoes. Perhaps first and foremost the meal including drinks and meals were done very quickly. (35 minutes tops).  Not sure if their mandate is to get people in and out quickly but it seemed that way tonight. Service was excellent but if you want a burger no need to go here, go to 5 guys or somewhere else. The ambience was great as well. Perhaps the rest of the dinner menu is outstanding, just don’t get the burger."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmamRTdmdBRRAB",
            "text": "4.5 Stars!!\nGreat food, great service, fair price for both.\nI had the steak and fries.\nThe meat was superb,tender juicy and cooked to perfection.\nI had dirty martini and it was delicious.\nI totally recommend this restaurant to bring a friend or a loved one in a special occasion!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdV9xZ1JnEAE",
            "text": "Cecchi’s – The Best Martini in NYC\n\nCecchi’s is a true gem. Elegant and timeless design set the tone. The martini –  the best I’ve ever had and was perfectly smooth, and balanced.\n\nMichael Cecchi himself was there, an incredible host who made the experience even better. His passion and the exceptional service from his staff made it clear why Cecchi’s stands out.\n\nA beautiful restaurant"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbHFHVjlBRRAB",
            "text": "Gonna say this is my favorite dirty martini in the city. Perfectly cold with shavings of ice left in and a great olive ratio.\n\nOn top of that, it’s a beautiful interior, reasonably priced food for what it is, and there’s a kind of local vibe with clearly a lot of regulars coming back.\n\nThe not a wedge salad was a standout and I’d eat 3 plates of those fries."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2czYtck9nEAE",
            "text": "Loved the food and the non alcoholic drinks, my favorite was the mushrooms. Bartender Ben was very knowledgeable and friendly, definitely coming back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bzZ5WmtnRRAB",
            "text": "Love this place! Went last night and had the best time. Josh and team really take care of their guests and make everyone feel special. It’s always a great time to come to Cecchis - and so glad we chose to pop in last night for an annual holiday get together! Food and wine were great as always but nothing beats the atmosphere!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYb2REcXd3RRAB",
            "text": "Great bartenders, Jonathan, Roman and Jorge always provide a fun time there! The burger was glistening when it came out but really, the welcoming and friendly crowd made the night. The atmosphere there was one that I haven't felt in a while. Everyone I rubbed elbows with, was looking to have fun and enjoyed each other's company. Truly a special place, and the bartender states that Thursday nights are busier than Fridays! Get a seat at the bar and you’re in for a great time!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkeG9uYmZBEAE",
            "text": "Where have you been all my life?! Came to Cecchi’s on a Friday to celebrate my girlfriend’s birthday and was blown out of my mind! We enjoyed perfect Belvedere martinis at the bar and ran into our old friend Josh…the night was certainly off to an amazing start! Once seated, Josh and Tommy took great care of us and did a fantastic job explaining the menu. The loved everything we had! The ribs were so tender and flavorful, the wedge salad was the best I’ve had, the burger and fries were delicious, and the onion rings were perfectly battered, not greasy, just absolutely perfect! Since I was trying to be “good,” I opted for the St. Emilion for dessert. Thank you for offering an excellent wine by the glass! So rare to find that in majority of restaurants, so my vino was much appreciated! The evening was such a beautiful and memorable experience. It was perfect. Thank you to the team at Cecchi’s for a warm welcome, amazing meal and wonderful time. We’ll be back soon!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQdy1TY0t3EAE",
            "text": "We loved this place. The food (burger, and lamb) both were fantastic. As were the fries. Weird to shout about those but they were perfect fries. The atmosphere was great, dimly lit with classy decor. It was very busy on a Tuesday evening but service was still personable and friendly. We’d go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuXzVlNVdREAE",
            "text": "WOW. My new favorite restaurant in the city.\n\nI stumbled upon Cecchi’s tonight. (by accident) Friday night is busy and sometimes a table for one is hard to come by. Not here! I didn’t have to wait and was seated immediately. The staff is EXCELLENT.\n\nThe food was truly outstanding. The oysters were beautifully presented. The steak was so good. Jeez—better than most steakhouse steak. The steak was NOT salty and was so juicy yet perfectly cooked.\n\nI don’t drink alcohol but they had a delicious mock-tail mojito.\n\nLastly, such a beautiful interior. Yes, it is LOUD. But, I don’t consider that a negative given that everyone was respectful.\n\nTop tier yesterday without a doubt!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwa3QySzFnRRAB",
            "text": "Highly recommend this place! We got the tomato salad, ribs, 2 burgers (one with fries, one with onion rings), the strip steak, cheesecake, and more onion rings (The onion rings were the best onion rings we’ve ever had and so my partner had to order a side of them for dessert!). We also had a few cocktails. The mezcal one was my favorite, but I feel like you can’t go wrong with any of them! Everything was just so delicious from the appetizers to the drinks to the meals and desserts!\n\nThe atmosphere is lovely with perfect lighting, custom murals throughout, and nice furniture. In addition, the staff is warm, welcoming, and attentive. Our water was never less than half full! You can tell the staff and the owners put a lot of thought into this restaurant. I’m looking forward to returning!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3aFBXS3l3RRAB",
            "text": "Just dined at Cecchi’s (pronounced like “check-keys”) recently (twice) and what a fabulous supper club in the neighborhood! Loved the food, ambiance and outstanding service! And a book to go with the restaurant? — Simply delightful! The Sunday clam bake special is a must have! Heavenly seafood comes in an iron pot that melts in your mouth, one cannot resist but to enjoy it to the fullest! And the stuffed mushrooms are delicious, I could’ve had two orders to snack on before my main dish! 🥂❤️ Above all, the friendly staff never missed a moment to take care of its customers. -Mimi"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcWRmSFRREAE",
            "text": "Cecchi’s\nEst. 2023\n\nLayout/atmosphere\n*Stylish bistro; bar area and tables then back room with more tables; painted murals; tables on sidewalk\n\nService\n*Bartender (Jorge) was superb\n\nFood/drink\n*You’re So Cuke (gin, cucumber, basil, lime) - delicious\n*Pickle Bowl - fine; something different; featured tomatoes, carrots, and cauliflower\n*Steak & Fries (Brown Butter Bearnaise) - steak was solid (appeared to be the strip steak cut); wasn’t a fan of the sauce that came on the side; fries were good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3N3BfUnh3RRAB",
            "text": "Cecchi’s is hands down my favorite spot in the West Village, and it’s easily in my top three across all of NYC.\n\nFrom the moment you walk in, the attention to detail from the hosts to the managers sets the tone. The bar has an incredible vibe, where the bartenders truly take care of you. Whether you're flying solo, with a friend, or on a date, it’s a place where you feel safe, comfortable, and ready to have a great time.\n\nThe food is nothing short of amazing. The short ribs, chicken liver mousse, and green salad are my go-to dishes every visit. Seriously, who knew a green salad could be this delicious?\n\nIf you’re aiming for a spot at the bar, get there early—especially on weekends. You won’t regret it! And for tables, I highly recommend making a reservation because this place gets busy for a reason.\n\nWithout a doubt, Cecchi’s is the place to be in the West Village. Cheers!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMDVTTXNnRRAB",
            "text": "Amazing spot in the west village. Exquisite trout! World’s greatest onion rings (and I don’t even like onion rings!) French fries a must. Little pigs in blankets too. It’s a vibe. Owner personally came over to check on us - now that’s hospitality. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWbExlMlJ3EAE",
            "text": "If I could give Cecchi's 10 stars, I would. From start to finish, everything about this restaurant was perfect. We started with the Tickle Me Prickly cocktail and it was incredible! The puree was the perfect cut to the spice of the habanero, and the drinks came expeditiously. For appetizers, we had the San Gennaro In A Blanket, the Not a Wedge salad, the Truffle Stuffed Mushrooms, and the Apricot Glazed Ribs. Everything was outrageously good! The san gennaro pigs in a blanket were decadent--they took an existing concept and enriched it with more flavor than I ever thought possible. The ribs were cooked perfectly and delicious. Even the cole slaw that accompanied them was fantastic. The wedge salad was a treat, and the russian dressing made it unique. The best, though, was the white truffle stuffed mushrooms. I have never had a stuffed mushroom so delicious--the truffle flavor was pronounced but not overpowering, and the sauce that accompanied them was lick-the-plate type good. For my entree, I had the Cecchi's burger and it did not disappoint. The meat was cooked perfectly and very flavorful, the bun was delicious, the pickles and cheese were the perfect compliments, and the fries were just how I like them--thin and crispy with just the right amount of salt. We ended the night with the NY Cheesecake and the chocolate cake. Both were to die for, especially the NY cheesecake. I'll be thinking about this cheesecake until the next time I eat it! Our server was very friendly, knowledgeable about the menu and with recommendations, and personable and quick. Our waters were never less than half-full, thanks to the wonderful busboys. One of the highlights of the night was the owner, Mike, standing up to share a restaurant review from NY Magazine in true New York City fashion. It gave the restaurant a sense of community, and was the perfect touch on an already wonderful dining experience.\n\nThis in the top 3 restaurants I have ever tried--for the food, the service, the atmosphere, ownership, and NYC flare. I could not possibly recommend Cecchi's enough!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNId29HZFVREAE",
            "text": "Very New York vibes. Good martinis. We split the prime rib steak and shrimp cocktail. Steak was excellent and I really liked the crispy fries. Next time would want to try the burger and sit at the bar as the place had a lively vibe inside.\n\nEasy to get a reso for same day. Much bigger on the inside.\n\nAlso got espresso martinis for dessert. There’s something about the sharp martini glasses that just make everything better."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5Z0tlQklnEAE",
            "text": "Ambience, food, decor, all of it was wonderful on my first visit. But what made the evening a real standout was the service.  The staff/management have mastered the art, which makes Cecchi’s a truly great destination."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUa3FlUUF3EAE",
            "text": "good vibes & good service :) we sat at the bar and the bartenders were so fun to talk to.\n\neven on a saturday night it wasn’t overly crowded which was great; i could breathe & not yell to talk to the person next to me which was not the case with many other bars we went to that night"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMzl5bmtnRRAB",
            "text": "Wonderful dinner! Kitchen and staff were impressive considering it was week 2 of being open. The burger is sure to be on future burger maps as best in the city. Chicken a la king was a sleeper hit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubGZqSTN3RRAB",
            "text": "The entire staff is incredible - everyone we interacted with was SO good at their role and made us fall completely in love with Cecchi’s. Another guest was reading Michael’s book at the bar and was such a fan he bought me a copy, which Michael signed for me. A very sweet and memorable NYC night and we will definitely be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwNzh2YXFBRRAB",
            "text": "My husband and I had dinner with 2 friends last night and had a terrific experience. Cecchi's version of pigs in a blanket was creative and astounding, olives were delicious and not too salty, pickled veggies were delish. Regretted not trying the dinner rolls. Bartender's drinks were spot-on and the burger was worth all the hype! The design and ambiance of the restaurant is stunning, hospitality is unparalleled and we will definitely be back!\nThe only complaint we had was the noise level, which I understand they're addressing. (Waiter misheard sauteed greens for onion rings which was understandable given the noise, but they made it right promptly.)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxZ01YbEhBEAE",
            "text": "I like the stuffed mushroom the most. Very satisfying. I like Calf’s liver. Is a special. Trout is not good as like. Dark chocolate cake is good. Apple crisp is ok."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiOGJXaEhBEAE",
            "text": "Such a great place.  We had last minute steak (bone in rib eye) dinner with grilled clams as appetizer and cheesecake for dessert.  Every bite was to perfection.  And the service is professional and friendly and beyond.  Love to discover this place in the neighborhood."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMG83TkRnEAE",
            "text": "Truly a 5 star experience. So accommodating from the moment we arrived. Excellent service, excellent food. The Maitre d’ also came over to ensure we had a good experience. Will definitely visit again."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwc2JfTUZREAE",
            "text": "We were excited when a reservation opened up early on a summer, Saturday night. We were greeted immediately by Michael and his wife, Nina, supported by an army of smiling hostesses waiting to seat us. It immediately felt like family. The warm, masculine, art deco interior immediately soothed. We were seated in a corner booth, soon to be surrounded by a full\nDining room. John was an amazing steward of hospitality, never making us wait to ask for anything, and allowing us to drink our first round before ordering our meal. Our water glasses were never less than half full. The “Not a Wedge” salad surprised us as one of our favorite choices, not to outshine the beautifully executed Steak Frites and transformative Burger. The menu has something for everyone, and we can’t wait to go back and bring friends. From the bottom of our hearts- thank you for  wonderful time!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkMF8zcldREAE",
            "text": "Cool mix between a \"sceney\" and classic neighborhood restaurant. Food and drink selections are great! The staff will take good care of you.\n\n... and just when you think you're done...\n\nAfter coming here a few times and getting to know the staff, they went out of their way to bring me the \"Apple Crisp\" dessert and a wine refill. They went above and beyond! So much that I had to update my already glowing review above to say thank you."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbjlxb3dRRRAB",
            "text": "Gorgeous place. Met a friend for drinks and dinner. We were seated up front, which was perfect because we wanted a quieter spot to catch up. Got busy with many coming and going as the night went on. I was surprised when I finally went to the bathroom, to discover just how big the place was. Front or back, it’s gorgeous and very well designed. We each got great cocktails, wine, appetizers and the burger for dinner. We loved it all, weren’t rushed out, and stayed from 7-10:30pm in the same spot doing our thing. Perfect establishment. 5 stars."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaek5MUTlBRRAB",
            "text": "Made a reservation at Cecchi's for my birthday. Seated immediately in a cute and cozy corner. Ordered the Chicken a la King and my husband had the burger. Both were delicious! The pomegranate cosmo was good too! Olivia was a sweetheart. The general manager greeted us and stopped for a chit chat. Everyone seemed to really care about service and seemed like they enjoyed their jobs. Would definitely return on another visit to New York."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsazVmeEVREAE",
            "text": "Love this American Bistro!!! We are always looking for a new, energetic restaurant in Manhattan that has good vibes, and delicious food. Cecchi exceeded those expectations!!\n\nBest evening lighting in a New York City restaurant!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUMllQTTh3RRAB",
            "text": "Omg so overpriced. I ordered the half a chicken. It was more like a half a pigeon that was anorexic.  And the waiter looked surprised when I said, “really that’s all you serving me for $35?”  He told me I could’ve ordered the $62 chicken. chicken really for $62 ?And what the what?  It was packed !!!  Save your money go to a really good restaurant that will serve you something substantive so you don’t have to go somewhere afterward for a slice of pizza."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUNnRIQUhBEAE",
            "text": "After reading, Your Table Is Ready: Tales of a New York City Maître’ by Michael Cecchi. I was eager to get to this restaurant. They did not disappoint! The food and drinks were absolutely incredible! The staff was a breath of fresh air. I unfortunately was in a rush and couldn’t stay longer but the appetizer and entrees came out fast so I was able to taste and enjoy everything before I had to leave. I also ended up taking my dessert to go and enjoyed it once I got home. I can’t wait to go back and celebrate my anniversary there! Keep up the amazing work."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdmNfdnBRRRAB",
            "text": "We had dinner for the first time at this place and the experience was unforgettable\nIsrael, our waiter, was incredible with all his recommendations and was very helpful\nAll the dishes were delicious, we loved the bordeaux blanc and the chesscake🧡"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKb2ZxVGJREAE",
            "text": "Everything was great! Had the sea bass, fries, mushroom toast and the olives for dinner. An appletini and wines for drinks.\nThe staff was really next level…. We accidentally dropped a glass of wine and they could not have been any more polite about it even though he was mortified 😂"
        }
    ],
    "reviews_count": 78
}