{
    "name": "Yoodon",
    "place_id": "ChIJW4gQImthwokR6N9t87v5LWM",
    "grid": "QN7",
    "address": "216-19 Northern Blvd, Flushing, NY 11361, USA",
    "rating": 4.8,
    "user_ratings_total": 194,
    "phone_number": "(718) 819-8468",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWGQwOVBOR1pLYlVKTGFHOXBjMVpVV2pJMGExRRAB",
            "text": "Food is bomb here especially for the price point. Pork and chicken cutlets were fire as well as the beef udon and the beef ramen."
        },
        {
            "date": "1달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWmVERldhREpQZUV0TGRsaEtZblJQWHpOSVdXYxAB",
            "text": "All foods my friend and I ordered were very delicious...\nSpicy shrimp tempra 김밥 and 돈까스 랑 정말 맛있었어요. Their soups are good too.. 👍"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkelRYQnNVa0ZtWWtKcFZVRlNNRFpVYXpOcmFrRRAB",
            "text": "No complaints. Came with my brothers and had a great meal. Food came out fast and was tasty."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GR01IUk1WVzV1YlZkWldYTk1UalJOY2pkRVIxRRAB",
            "text": "The gimbaps they have are the best in the area. Any of the gimbaps they have is top notch. Highly recommend coming in a small group since the dinning area is small"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1Q2EyYzVjMVJwZVRkblJ6TjFjRGhzYVhoQ05WRRAB",
            "text": "This is my go to place, food is excellent, I tried multiple things on the menu and they're all great.  I mostly do take out.  I would love to eat in but this place is like a hole in the wall small.  Place itself is very clean, cute and cozy, it just that it is really small so there are like maybe 3 tables, so you would have to be lucky to walk in when it's slow so you can get a table."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kdlRscHJURW8xUVVSTE5rMW5ZV2RVV0dGVVVrRRAB",
            "text": "I usually get the chicken or pork cutlet, the cutlets are fried to perfection and the salad and soup are also delicious! It also isn’t too expensive, so highly recommend for lunch or dinner."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWVk5Hc3RjWEJ3TkVoMWRHOUhNM1JoVFRSWFZGRRAB",
            "text": "This was so amazing my friend and I demolished everything in 20 minutes!!! It’s made by a sweet couple and I’m so grateful they take the time and care to make such delicious food\n\nWe got the spicy crab kimbap, chicken cutlet sandwich, and yoodon cheeseburger\n10000000% will be returning im sold !!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNWR6TTBTR1Z0UW1WdE5rdFNkM1ZSV25RelIzYxAB",
            "text": "Sweetest business owner. She's so patient and kind. She treats you like her own children"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPREtvX25NNVpXczl3RRAB",
            "text": "Very nice place. The wait for food is a bit long, but it is worth it. I got the pork cutlet which came with a soup. The pork cutlet was phenomenal, it was tender and juicy inside with a perfectly crispy shell. The pork itself wasn’t that flavorful but it came with a creamy sauce that tasted vaguely of bbq. The soup it came with was very light and not overwhelming with a taste of miso soup. Everything was warm and fresh when it arrived. Overall, the experience was very good. Would recommend! :)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMnZ2WE5BEAE",
            "text": "Great food and awesome service. My favorite spot to go whenever in bayside."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvc2JqZXZnRRAB",
            "text": "Super yummy. Home style shop, best type of food. Went with family will take a date that loves good food"
        },
        {
            "date": "7달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3Z0tqaGhBRRAB",
            "text": "맛있는 우동 여러가지 스타일\n맘에 든다 좀 더 맵게 부탁드리니 요구사항을\n정확히 해주신 사장님 맛있어요 👍!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOHJHeFp3EAE",
            "text": "I happened to be in the area and was looking for something to eat when we came across Yoodon on Google. We decided to give it a try, and I’m so glad we did! This small, hole-in-the-wall spot truly delivers big on flavor.\n\nThe food here is absolutely delicious and packed with flavor. We tried the chicken stir fry, the spicy shrimp tempura kimbap, and the chicken cutlet—all absolutely amazing. The chicken ramen was also rich, flavorful, and comforting. Honestly, I can’t even pick a favorite dish because everything was so good!\n\nThe lady at the front was so sweet and welcoming, which gave the place a lovely, family-owned vibe. For the quality of the food, the prices are really reasonable.\n\nThis spot is more of a grab-and-go kind of place, even though they have seating available—it’s a bit small for dining in, but perfect for takeout. I’ll definitely be back the next time I’m in the area. Highly recommend!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmdEwyZWtBRRAB",
            "text": "Total Score: 5.00\n\nBathroom: 0/5\nActually zero bathroom ☹️☹️\n\nCustomer Service: 3.5/5\nNot much to comment on. But we got our food and they gave us plenty of water!\n\nAmbiance: 3.25/5\nCutesy Korean cafe vibes. Christmas is still right behind the corner. Bench was kinda uncomfortable tho\n\nFood: 3/5\nGot the pork cutlet and was a bit plain. Kinda dry and the salad didn’t really help. The sauce was good though!\n\nWow: 0/1\nNormal Korean Restaurant\n\nTotal Score = BR + CS + 2*AM + 5*FOOD + WOW"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bWZmMGVREAE",
            "text": "The spicy chicken sandwich is off the chain! My kid had the Bulgogi Kimbap which was excellent as well. Will definitely make this a regular spot."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2LTRxRWhBRRAB",
            "text": "Ordered the bulgogi kimbap, it comes with soup, food was tasty, great customer service, cozy place would definitely recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNHJPRG9RRRAB",
            "text": "I had an amazing experience at Yoodon! The atmosphere was warm and inviting, with a cozy, clean environment that made me feel comfortable right away. The staff were incredibly friendly and attentive, always ready to help with any questions about the menu. They made sure everything was perfect, from the presentation to the service. Their genuine care for customers really stood out, making the dining experience even more enjoyable. I highly recommend Yoodon for anyone looking for delicious food in a great setting!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNudjd1aTFnRRAB",
            "text": "Here are some restaurants where you can enjoy a simple lunch of kimbap, udon, or hamburgers."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIal9IaTVnRRAB",
            "text": "리뷰가 좋아서 갔습니다. 솔찍히 실망을 많이 했습니다. 햄버거 고기는 다 타서 딱딱했고, 우동은 평범 그 자체였으며 , 다른 메뉴들도 그냥 그냥 지극히 평범 했습니다. 제가 너무 기대하고 갔는지 몰라도 나올때 별로 기분은 좋지 않았습니다 . 뭔가 특별히 맛있는 강력한 메뉴가 필요한듯 합니다"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIcllLcWtnRRAB",
            "text": "Sooooo good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dDZiQnZRRRAB",
            "text": "Great food, fast service, fair price, relaxing atmosphere.\n100% recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNExDUzdRRRAB",
            "text": "A cute husband & wife korean cafe restaurant with great Katsu meals. Katsu is fried on demand, crispy outside and juicy inside.\n\nOrdered Katsu pork with rice & salad, came with 2 pieces of fried pork for $16 including tax."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMdmZfNVd3EAE",
            "text": "A small mom and pop shop that sells great food at a reasonable price! My partner and I got a Yoodon cheeseburger, a shrimp tempura kimbap, and a bulgolgi kimbap. The patty in the burger is charred and juicy and the bulgolgi was flavorful. The spicy mayo on the shrimp tempura is a little too spicy for me, but most people would think it has a nice kick. Each customer is given a warm bowl of miso soup.\n\nIt should be noted that it's a very small restaurant, so there is no bathroom."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMZ01qSTNnRRAB",
            "text": "A small place that produces excellent food! The kimbap was is really good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcHFQZVNBEAE",
            "text": "udon is very flavorful :-)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMMk5TX3pRRRAB",
            "text": "It’s nothing short of spectacular. Every dish is a celebration of flavors and culinary expertise. Whether you're craving classic favorites like kimbap, sandwiches, bulgogi or eager to explore lesser-known delicacies, Yoodon has something to satisfy every craving.\nEach dish is prepared with care and attention to detail, ensuring that every bite is bursting with flavor.\nBut what truly sets Yoodon apart is the authenticity of its cuisine. The chefs here are masters of their craft, using traditional techniques and the freshest ingredients to create dishes that are true to their Korean roots. Whether you're a longtime fan of Korean cuisine or trying it for the first time, you'll be blown away by the depth and complexity of flavors."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6dVAyUWx3RRAB",
            "text": "Small establishment serving simple Korean food. Udon was well balanced with a mild dashi broth."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUOVBpblNBEAE",
            "text": "Food is fine.  Reasonably priced."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUNC1uQ3hRRRAB",
            "text": "It is good and the place has lots of different cultures"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUNDU2aGR3EAE",
            "text": "Very tasty and super affordable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqNmVMa0J3EAE",
            "text": "I walked in to order takeout. I was a bit put off that the lady - very nice, but curt, seemed intimidated by my hulking presence of 5'6\" 175lbs. I was hoping she wouldn't run away. No one else was there in the dining room. It was just the two of us on a Friday afternoon in broad daylight, 5/3/24. I got the fried pork and asked for noodles instead of rice... \"NO CAN DO!\" (My words, not hers, but the result is the same.) So, I went with what they wanted me to eat instead of what I would have liked, and settled for the rice. I would have happily paid a little more for the substitution, and being I was the only one there my guess is they were no too slammed to accommodate my request. It was simply a steadfast rule of some sort, but the perfect opportunity for her to upsell me. Anyway, the pork was OK and came with a sauce, a salad and soup, which were also OK, and rice is rice - white rice, nothing special. That said, I'm prolly not gonna give them a second shot, although the Yoodon Cheeseburger looked like a great idea. But I would have wanted it without cheese. Perhaps that too would have been a \"NO CAN DO?\" Again, my words, not hers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqdXJTQWV3EAE",
            "text": "Simply amazing food quality and presentation, plenty to eat well priced and deliciously made. The soup was a perfect compliment to the Kimbap we got, and the pork cutlet was just so juicy and crispy at the same time, must come again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqLU55X2l3RRAB",
            "text": "It's a real great place. The flavors are amazing. We had the cutlet and kimbaps (all of them) and you could taste the finess.\n\nYoodon highly recommended"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEM3VEcUFREAE",
            "text": "Came here on a cold rainy Thursday for lunch. Looks like a mom and pop restaurant that seats a total of 13 comfortably. We ordered the Combo Ramen and the Yoodon Kimbap. The Combo Ramen (medium spicy) wasn’t that spicy, but good enough for me. It definitely hit the spot on this rainy day. The Yoodon Kimbap is a kimbap that is wrapped in a thin sliced pork cutlet topped with a sauce that they made. This combination worked really well and the soup that it came with paired perfectly with it. I hope to visit again and try their other dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEcHQ3b0hREAE",
            "text": "Their bulgogi kimbap can be a bit pricey compared to other kimbap spots nearby on Northern but I think it's definitely worth the few extra bucks. Great portions and extra meat served on the side with soup. Great all-in-one lunch option."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5OGVHRUxREAE",
            "text": "Rude staff. No restroom. Small place with small tables."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5N3VfNXRRRRAB",
            "text": "my favorite restaurant in Bayside! Fish cutlet is my favorite!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5cm9hUzJBRRAB",
            "text": "After eating, when you ask where the bathrooms is, owner will say \"go use the bathroom of the other restaurant\""
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5MkxTWjl3RRAB",
            "text": "The best kimbab I’ve had."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5NWY3cGh3RRAB",
            "text": "매운 볶음 우동 추천!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXdU8zSThBRRAB",
            "text": "우동  전문점인데, 사장님 친절하시고유..\n음식맛과 양두~ 모두, 만족혀유~~^--^♡"
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjeVlhLTJRRRAB",
            "text": "음식 퀄리티도 너무 좋고... 사장님 부부도 너무 친절하시고 샐러드바도 있어서 너무 기분좋게 먹고 왔네요~~"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCNS1yc1JBEAE",
            "text": "야채우동 👍"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdDVUYVRBEAE",
            "text": "I visited with my family and was blown away by their exceptional customer service. Not only that, but the food was absolutely delicious!\n\nThe Bulgogi Kimbap was particularly outstanding, with its tender meat and amazing flavor. I also loved the Spicy Crab Kimbap, which was full of flavor and had just the right amount of spice. The Yoodon Kimbap was crunchy and tasty, and the ramen was rich and flavorful . Another standout was their Grilled Chicken Sandwich, which was juicy, tender, and generously portioned.\n\nKeep in mind that due to its size, it can get busy during peak hours.\n\nOverall, I was extremely happy with my experience at Yoodon and can't wait to come back!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzcktiMGJ3EAE",
            "text": "The food was awesome!! Chicken cutlet was full of flavor.. the vegetable stir fry was so delicious, noodles cooked to perfection... and the kimbab so fresh tasting. The place is so clean. It’s family owned, they were super nice and sure know how to cook!\n\nCame back for another superb meal!!\nBurger is a must try.. along with the stir fry! You will not be disappointed with anything from this place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSaDktMWdBRRAB",
            "text": "The best beef kimbap I have ever had. They give extra bulgogi with the kimbap as well. I had the beef ramen and the beef in the ramen wasn't that great but the flavor of the soup was great even though I got it mild. I asked for extra broth and they gave me a whole bowl of extra broth which is exactly what I wanted. The staff is so incredibly friendly and spoke to my table, making sure we were alright. Great restaurant, I highly recommend it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2ekxPYUJREAE",
            "text": "Having a bad day and coming here is the best remedy.  My smile was from ear to ear because of the presentation, quality, and quantity.  I really enjoyed having a seat and relaxing in this atmosphere.\n\nThe food is delicious.  The fries were crispy and tender in the middle. The cheese burger was HUGE with awesome flavor that didn't over power my taste buds. It also includes a salad!\n\nEvery dish was created from the heart you can really feel and taste it. my stomach is growling while I write this review... Will be coming here more often. Thanks so much!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHX283TkNREAE",
            "text": "Everything about this place was amazing! My husband and I went here for a quick dinner date\nThough this restaurant is known for being more of a take out restaurant they do offer indoor seating. However, the seating area isn’t all that probably enough space for 4-5 small groups of 2-3 people.\n\nThe food was absolute perfection and the staff/service was amazing. I could literally go into full detail on how amazing the food it but you’d have to go and try it for yourself. All I got to say is if you take 1 bite you’ll see what I mean. Other than the delicious food, The pricing for everything is very affordable.\nIf you haven’t tried this restaurant out before and you’re reading my review at this very moment please give this place a try. This place is definitely 10/10 and I definitely 100% recommend"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4eS1hS3B3RRAB",
            "text": "I had to try Yoodon based on the stellar ratings. Some dishes I ordered based on the staff’s selection which included the Yoodon kimbab and Yoodon burger. The Yoodon kimbab is delicious. Cooked with fresh vegetables and pre-packed shrimp meat, the outside is fried giving the kimbab a crunchy texture. Overall, everything was nicely balanced topped with a brown sauce that gave it a slight sweetness. I would reorder the Yoodon kimbab. The Yoodon burger was very big. It came with fries and a side salad that was topped with shredded mozzarella cheese and ketchup. The burger was mediocre. Not something I would reorder. I could barely taste the meat even though it was a decent size. The pork cutlet Katsu was also just all right. Pork was over cooked in my opinion and also topped with the brown sauce giving the pork cutlet a sweet flavor. It came with a side salad as well ... with ketchup to top. Lastly, the shrimp tempura udon; soup is tasty, not too oily, and shrimp tempura was more tempura than shrimp though. I wouldn’t mind reordering the udon but I think I would try a different kind. I will come back to try other dishes though."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaanJQVEtREAE",
            "text": "Very nice people work in this beautiful place🙏\nAnd of course so delicious Ramen 🍜🌶\nUnless you are an expert in spicy food, choose no spicy or medium spicy Ramen :)\nI ate very spicy.\nIt was HOT 🔥\nEnjoy! :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocTdmUlBREAE",
            "text": "Small restaurant serving simple fare like ramen, upon, stir fry upon, fried dumplings, Kimbap and burgers.\n\nThe chicken cutlet burger was the best. The meat had a nice snap texture to it and the ingredients in the burger were fresh. The yoodon burger was good too just not as good as the chicken imo. The fries were slightly disappointing because we went off a previous photo of the fries where they were crispier (battered fries??). The ones we got were good, however, and reminiscent of mcdonald fries.\n\nThe bulgogi kimbap came with a side of bulgogi in addition to the rolls!\n\nFast attentive service and good quick good made this a solid option in the area!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1dk9fdUpnEAE",
            "text": "Kimbaps and cutlets are really good. Ramens are ok and I won’t recommend. Definitely try the Yoodon kimbap. It is very hot (temperature), so give it a minute before you eat.\n\nThe lady who runs the place is not rude but lacks customer service skills. She can work on that.\n\nWill come back for the food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCMnJ5Mk5nEAE",
            "text": "Great quick bite if you are craving Udon. We ordered Beef Stir Fry and Beef Udon, both were very tasty and came in a large portion (the Stir Fry came with soup as well). Overall would go again and looking forward to trying the chicken cutlet next time!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtNnJpUVdnEAE",
            "text": "Such a cute and cozy restaurant that serves delicious food!!\n\nI placed an order over the phone for pickup. Food was ready when they said it would be ready and it was delicious!\n\nI ordered a fish katsu for me and a shrimp tempura udon for a friend. It was packed well and survived the drive to my friends place.\n\nThe katsu was crunchy and a big serving. I was so full I couldn’t finish my meal. The soup on the side was flavorful and had a little kick of spice.\n\nMy friends’ said her shrimp tempura udon was really delicious and perfect for the cold weather.\n\nI will definitely come here again!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtLThldlVBEAE",
            "text": "This place is AMAZING. The food feels so hearty and it feels like I am eating a home cooked meal. The ingredients taste fresh and the food is just always on point. And the owners are very nice and accommodating people! They always want to make sure that their customers are satisfied. I’ve been here 3 times in one month!!\n\nP.S. do not underestimate the spice - I was very humbled by it"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2dnM3VW5RRRAB",
            "text": "Amazing, fresh, home cooked food.\n\nYoodon cheeseBurger  10/10\nFish over rice 10/10\nChicken sandwich 9/10\nYoodon kimbap 8/10\nBulgogi Kimbap 8/10\nUdon stir fry with beef 8/10"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxbmN6WVlnEAE",
            "text": "I came in hangry after a long morning. Anything with this many good reviews makes me very curious. I ordered the beef stir-fry noodle after chatting with the very nice host. It came with a very flavorful soup. I gotta say, best udon I’ve…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhNm9PcS1RRRAB",
            "text": "It's a nice place for lunch, we had the spicy beef ramen as well as the chicken cutlet. The ramen was alright, I was hoping it would be a bit more spicy though haha. The cutlet was really nice along with the sauce that came with it. There was also a soup which had spinach, green onions, and tsuyu sauce in it. Overall it was a really nice experience and the person who served us was really kind and made the experience amazing. Giant portions, so definitely worth the money."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtMjh2NzZnRRAB",
            "text": "Hands down the best ramen in the area!!\n\nI've probably had about 20 to 30 different types, styles, and flavors of ramen but the combo ramen from Yoodon is at the top of my list. The noodles were the right consistency, the broth was steaming hot and fresh, and the abundance of meat and veggies was overwhelmingly surprising. There was so much packed in to this huge bowl, I'm surprised I finished it. What was great too was that you got such a mixture of taste and texture between the beef, chicken, shrimp, fish, octopus and veggies.\n\nThe restaurant is small but very welcoming and the woman who took my order was so polite. Thank you for the great food and for the great service!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtcnZTQmh3RRAB",
            "text": "This is my 3rd time having Yoodon and it’s amazing! I brought my friend there since I was craving their Kimbap and at the end he got another Bulgogi Kimbap to go. He also stated that its The best Kimbap he’s ever had. We both got the Bulgogi and Yoodon Kimbap. The portions are just fantastic and filling. The owners are so nice and caring, the food is definitely made with care and love. Definitely a great spot to check out."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtek9lSDFnRRAB",
            "text": "Amazing little place for homestyle korean comfort food, run by the chef and his wife. You can tell the chef takes pride on his creations and uses only fresh ingredients, everything is served with a smile. Definitely worth a try!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHMmVpSmRBEAE",
            "text": "Foods are here very clean and light. Especially I love the udon’s deep mellow flavor!! I would like to come here again. Thanks for the food!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1MzRqb2xnRRAB",
            "text": "This place is so overpriced. Spent $10 for 3 shrimp that taste like eggs. Ramen bowl was ok."
        }
    ],
    "reviews_count": 63
}