{
    "name": "Veranda",
    "place_id": "ChIJeQ7OPtxhwokR0NbauaysWDM",
    "grid": "QN7",
    "address": "208-01 Northern Blvd, Bayside, NY 11361, USA",
    "rating": 4.4,
    "user_ratings_total": 812,
    "phone_number": "(718) 281-2233",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0M1NtZEtXbU0wYUVkd1UwZHRTQzFsYUVkdVNuYxAB",
            "text": "Best place in Town"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTVJTMUZjV1JKYm5OclR6aElXVVJSUkdvM2FrRRAB",
            "text": "Fantastic restaurants space both indoor and out. Greg, our waiter could not have been more courteous and giving great service. The food is very meticulously prepared and the taste is absolutely delicious. Definitely under utilized in the neighborhood but what a a find"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5a2VubG5SMWxQTmxKdmJ5MVBSRjgzTURkcFVtYxAB",
            "text": "Our group of 5 just had a great dinner .\nFood was delicious and our server, Gregory, was amazing.   Thank you all for your hardwork and hospitality."
        },
        {
            "date": "2달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkMFVUZzJUSGRaT1doNU0ydGxUamROV1MxU2JWRRAB",
            "text": "맛있었어요 전체적으로 ^^"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSSmNHZG1TVXhKZWtkUVJWRXRURVl3UW0wMGVXYxAB",
            "text": "Close to the neighborhood, nice brunch options. Very classic decoration and staff are super friendly!\n\nThey also have indoor and outdoor spaces which you can choose from ~\n\nPlus the free valet parking is great 👍"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kcVJEbEtWRzlNZFMxeWJXRldVRVp4ZGxWUWRVRRAB",
            "text": "I ate dinner there as well as just had a birthday party with 35 people. The staff is amazing!! Food was great. Didn't rush us."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSldIaGpjV1k0TVc4MFlreGhRWEZXVGpscVdWRRAB",
            "text": "This restaurant is consistently good! The food is delicious. The atmosphere is private - perfect for business or leisure. The service is excellent. I have attended parties here (birthday parties, baby showers, etc) and I have had business lunches and meals with friends. They knock it out of the park every time. I highly recommend it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaclZWa3pWbFp3Y3pGa1l6Qk5OMDVuY0RGSU4yYxAB",
            "text": "It's great place for family  celebrations"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMFZIUlpPRXhGVTBST0xYVmthMVpITkdGblNIYxAB",
            "text": "Beautiful place, good service easy to drive to location.  Food is always good here but the spinach and feta pie is extra nice."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUmRrMUhXVGxOTFc1alMwUlFhVVJPWTNkaU0wRRAB",
            "text": "Friendly waiter, chill atmosphere, delicious cocktails and fresh food!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRVluVTRZbnAyUkUxVWEwcHBXR2MxWXpoU1EzYxAB",
            "text": "Really love their pancakes, pad thai!! bacon could be less crispy but overall my friends and I love this cafe to a point we came here twice!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMYks0ZHZrNU5tMnlnRRAB",
            "text": "Welcoming, spacious Greek brunch restaurant. Excellent service with friendly waiters.\n\nDrinks:\nPeach mojito is sweet and refreshing with a little alcohol 8/10\nBloody Mary is strong and includes some veggies and olives 9/10\nRaspberry mojito is lightly sweet 7/10\n\nAppetizers:\nZucchini chips are the perfect starter with enough for the table 8/10\nOctopus is a few slices but the aged balsamic is tasty 7/10\nTuna tartare is savory 8/10\nFried calamari is standard 7/10\n\nMain Courses:\nCrab cake burger had good texture but lacking depth of flavor maybe needs some hollandaise sauce 7/10\n\nDesserts:\nGalaktobureko 7/10 it's made like an empanada 🥟 it's decent but not the best. Custard was creamy but light. Shell was flaky.\nCheesecake 7/10 dense, heavy cheesecake\nChocolate cake with ice cream 8/10 basic but it works well"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VORGE1ZVMwcXNBYRAB",
            "text": "Wonderful Mother's Day brunch! Food was delicious and staff was excellent."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPQ0ExT204MGJya2JnEAE",
            "text": "Good food. Not a huge burden on the wallet. Great service and attentive"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0OU9fTTB3RRAB",
            "text": "The zucchini chips are outrageous! Nice atmosphere. Had salmon. Good"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZLWRYYlJREAE",
            "text": "Great Mediterranean cuisine! The steak was perfect."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxX3VycTR3RRAB",
            "text": "Best experience ever.  Better then ever before.  Delicious Thai Mussels and Filo wrapped Feta with honey.  Whole bronzino amd white clam sauce pasta delicious.  And yes try the chocolate souffle that is fesh made with real dark chocolate.  Try the black port wine.  Love this place."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHN0wzVDBRRRAB",
            "text": "This is an honest review no fluff.\nIwaited for over an hour for brunch on Ester Sunday! Not complaining i just love the place. I ordered an Avo toast. They literally threw an avocato cut in half ovee two slices of bread and two thick tomato slices it was discusting and tasted blah.  Tbe waiter was sweet amd kind and apologized for the time. So im not a fusser it was ok. Will I go back YES! but something has to give.\nI love the setting, the location, and the ambiance. I also want to support the neighborhod busnesses we lost a few dinners alreavdy but people get it together. Make us wanna come back!! I cant show a pic due to poor presentsion from the estsblishment\n\nThey are also a bit cosgly!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMU0zOFJREAE",
            "text": "Our server Jason was so sweet! Nick the manager friendly.. I'm looking forward to my next visit. I was able to order off the menu with no problem. They were so gracious!!!#pastaandgrilledchicken!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJd3NLYUN3EAE",
            "text": "Clean and professional"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVNDl5ZDFnRRAB",
            "text": "I have been here nunerous times for dinner and brunch.  The food and service are consistently good. Beautiful atmosphere inside and out!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRM1B5MlNBEAE",
            "text": "Sandra is the best"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNW9PVVJnEAE",
            "text": "Celebrated Valentine’s Day here. They have only Valentine’s Day menu for $85 per person. I was upset at the very beginning because I expected order dishes my own but then we can only choose main course from a set menu. However, after enjoying the service here, I think $85 was still valuable. It contains one appetizer, one main course and one dessert.\nThe service was really good here, staffs were caring and polite.\nAppetizer we choose salad and Coconut Shrimp. I really recommend the Coconut Shrimp. The Shrimp was giant and very crispy. Only 3 shrimps per dish but I think it’s still good portion for appetizer. Main course we choose steak and Scollop Risotto. The steak was tender, which was out of my expect. Risotto was also above average.\nWe were mostly full on the half way of main course, since they also provided free bread. Dessert we choose Chocolate Lava Cake and Cheese Cake. Both taste really good! And we packed the left over home.\nOverall I had a good experience celebrating Valentine’s Day here.\n————————————\n店名：Veranda Restaurant & Cafe\n208-01 Northern Blvd Bayside, NY 11361 United States"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNzRHNkt3EAE",
            "text": "Veranda is an excellent Italian/Greek restaurant. The food is consistently good. Try the baby lamb chops. They are the best!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfXzZyUGNnEAE",
            "text": "This review is about a week late but I couldn't miss the chance to say thank you! we celebrated my dad's 70th at Veranda planning was fairly last minute and from the moment I called to the day of the dinner they were so awesome and accommodating. We reserved the wine room with Nick he was AMAZING. Truly a man of service I felt so welcomed and he took care of everything beforehand. On the day of he was also there and our waitress was great and patient as well. Food was great we ordered a bunch and did it family style. Had the Sangria pitchers for drinks everyone said they were so good and nice and strong. Incredible value and experience booking with Veranda. Thank you so much we will be back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOGJLa1lBEAE",
            "text": "Hi we went to the restaurant today for lunch my wife’s a  fish call a branzino she really enjoy it I had a pork chop very good Service very good we will be back"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnNUo3eVhBEAE",
            "text": "Great food"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MU5yVkJnEAE",
            "text": "Went to La Veranda for lunch today. l had the very reasonably priced pre fixe lunch, a great French Onion soup to start, a shrimp/linguine diablo, and a greek yogurt fruit dessert. My mom had the crab cake burger. Everything was great. You know when it crosses that, 'yum line' on a French Onion soup done right, then the large and plentiful shrimp w linguini was fabulous. Crab cake was so good with a nice homemade style tartar sauce.\n\nThe service also was excellent. Friendly and  very polite.  Attentive without a hint of intrusiveness. Felt like a very genuine, welcoming environment. Had been looking for a go to place when l visit family in Bayside.  Found it."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzc1lIak53EAE",
            "text": "Great food"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzLU03ZzlBRRAB",
            "text": "Come here for the outdoor space. The food is ok if you order right. It's really just for a nosh and a drink and enjoy the fresh air because realistically, there are not many great outdoor options in this neighborhood."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwM1BUOGhnRRAB",
            "text": "11-3-24\n\nRe: brunch\nVeranda has quickly become one of our favorite local spots. It's truly a hidden gem, as we've never seen it packed during Sunday brunch. We hope it stays that way, given the trend of Asian restaurants taking over closed businesses in the area.\n\nWhile the brunch menu isn't extensive, the quality is top-notch. Every dish we've tried has been consistently delicious. The frittata is a standout, and the lemon ricotta pancakes are simply divine. Even the bacon was cooked to perfection, crispy and not greasy at all.\n\nThe service is equally impressive. The white tablecloths and uniformed servers create a refined atmosphere, and the attentive staff ensures that your coffee and water are always full. No need to flag them down! Did I mention, inexpensive as well? You can’t go wrong.\n\nOverall, Veranda offers a delightful brunch experience that's worth seeking out.\n\nA small suggestion for improvement: It might be helpful to tone down the strong perfume worn by some of the staff, as it can be bothersome for sensitive customers.\n\nUpdate-\nBrought my son who is visiting for the weekend.  There's a big party going on and yet stellar service remained.  They even accommodated us when they saw my husband and son were watching football on their phones. They moved us to a table closer to the television and changed the chancel to the game we were watching.  Yes,  in spite of a big party going on,  they paid attention to us.  We were very happy with the service and always felt the VIP treatment.  Of course,  we always take advantage of their Fix Pre Menu again .  The soup for the day includes pumpkin soup which imo was delicious.  My husband had the chicken soup and he said a bit on the salty side otherwise it was good.  So request less salt if you are considering to order the chicken soup.\n\nPrevious review- What not to like?  Great atmosphere,  clean,  good food and excellent service.  We met with friends and requested for an outdoor seating .  It was perfect.... we did the fix pre and was the perfect decision.  A lot of selections to choose from. Grilled or pan seared branzinos with fresh grilled vegetables were amazing. Same with their tuna piccata pasta.  The recommended red wine was very good too.  I love the virgin passion fruit mojito.  Gregory , our server was awesome.  Everyone ordered the baklava for their dessert and I opted for the Greek yogurt mousse ... which was delicious. It wasn't sour at all .  So highly recommended.  Great experience.  If you will order the Greek coffee,  it wasn't the same as my friends expected.  They said it was weak for their taste .  I am not a Greek coffee connoisseur so I can't speak for them.\n\nThis was my second time at Veranda.  I enjoyed their weekend brunch  and decided to come back for dinner.  I wasn't disappointed."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYOGVMSzZRRRAB",
            "text": "I absolutely love this place. The atmosphere is very elegant. Feels like your in a high end restaurant."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvazhXUHF3RRAB",
            "text": "Nice atmosphere  good service\nJust ok menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuakxUMkNBEAE",
            "text": "My guest was happy with her mushroom ravioli!\n\nThey served me a nice-sized grilled Bronzini with perfectly cooked veggies.  We were seated at a semi-booth in a quiet nook and not rushed.\n\nThank you!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNucElmV29RRRAB",
            "text": "I'd like to give kudos to Nick and his staff at Veranda Restaurant & Cafe. We held my daughter's bridal shower brunch  for 22 people there today under the pergola. The food was excellent, and the waitstaff led by Daniel was impeccable! I highly recommend this venue."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIa2JPVW93RRAB",
            "text": "We just had my daughters baby shower 9/14/24\nAlthough it had to be one of the hottest September days no one complained as it was outdoors and Nick promised it would be a beautiful day!  He was right. The food was outstanding, drinks delicious and the appetizers just kept coming out. The service was impeccable and everyone agreed the guys did a fabulous job.\nThank you again Nick for such a great party\nYou are a fabulous host. Can’t wait to plan  the baby’s first birthday party.\nAgain thank you for your generosity and kindness\nLoved every minute and no complaints from the momma to be\nSincerely\nSusanne Miller\nAnd family and friends"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3NklmNVN3EAE",
            "text": "The good first... The atmosphere was really good and welcoming. Our server was really, really good. We enjoyed our interaction with him. The bronzini was dry and lacked flavour. I was unable to eat it. My husband enjoyed the seafood and I loved the vegetables and the platter of dips. Because I didn't eat the sea bass, we were given free desserts which were delicious - cheesecake and a drink."
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDX3B6MDZRRRAB",
            "text": "양이 적은편이지만 브런치로 즐기기엔 분위기 괜찮아요."
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNbjdTTHFBRRAB",
            "text": "평범한 미국 음식점. 많이 짜지 않고 담백하게 음식을 한다. 느끼기에 따라 밍숭한 느낌이 들수도 있다. 내 입맛에 딱 맞진 않지만 나름 건강식 인것 같은 음식들이 있음. 친구들과 방문하기에 편안할듯 함."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHc05xa3JnRRAB",
            "text": "음식 고급지고 분위기도 좋음"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMckp6NlhREAE",
            "text": "We came by for brunch and it was great. Love their outdoor seating area. A perfect place to enjoy meal on warm sunny day. Food was good and service was good as well.\n\nEverything we ordered was good. Just the hash was under salted."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqX1pycEFnEAE",
            "text": "Server was very friendly and attentive.  I appreciated his positivity and energy with my family.  The restaurant overall had a nice Sunday brunch vibe.  Food was very good.  We ordered 3 appetizers: octopus, calamari and Tuna tartare.  They were great except the Tuna was a bit salty.  No sure if someone slipped with the seasoning since the calamari and octopus were perfect.  Our entrees were very enjoyable as we mostly ordered Sunday breakfast / brunch items."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUbllQT1RBEAE",
            "text": "This restaurant is casual chic. You have a choice to sit outdoors, which is very relaxing or indoors, that is modern contemporary. I like that the tables have tablecloths. The staff is friendly and knowledgeable. The food was delicious with a variety of choices. I especially enjoyed the guacamole with crispy tortilla chips that were homemade. The Caesar Salad was delicious. My dinner choice was Shrimp Diablo to die for with fettuccini and a tomato sauce that was spicy. Another wonderful dish was grilled lamb chops. Lastly, the salmon was very fresh. We were all very satisfied with our choices . I look forward to returning."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6dHU2cUF3EAE",
            "text": "The prix fixe menu is a pretty darn good deal! My partner and I are big eaters and the portion sizes left us wanting, but we still left feeling mostly satisfied. The service was good, if a bit slow, and the outdoor eating area was delightful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbHI3TFBBEAE",
            "text": "This is a nice neighborhood \"Diner\"/restaurant.  It has a really nice dining room, along with a nice outdoor sitting area.  The servers are really professional and friendly.  The food during lunch is nice with a good selection of salads, burgers, and pasta dishes.  Overall, this is a nice place to meet friends and colleagues for lunch or dinner."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3dlpQWEV3EAE",
            "text": "AMAZING 10/10!!!! The service was perfect. The food was amazing, I got the mushroom omelette with extra cheese it was better than I expected. The french toast was also really good. The food portions are big which is also a huge plus. Two…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoeDhQajJ3RRAB",
            "text": "My family and I had a great experience; we came for brunch. The service was excellent the staff was very accommodating. The food was terrific."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2dk55N19nRRAB",
            "text": "Always friendly and very attentive staff you will find at Veranda. I have not been disappointed coming to this restaurant. I love their outdoor space with the waterfall. The food tastes delicious and the drinks are on point. This family restaurant is a place to visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyc18zNHdnRRAB",
            "text": "Bday dinner w/ Mom. Had the early dinner special. Honey glazed roasted pork and mash potatos. Mediterranean salad and greek yogurt dessert. Mom had the shrimp linguini diablo. All were superb. Service was astounding."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKOTZ2Q3FRRRAB",
            "text": "Went there for Saturday brunch, food were amazing, I work in food industry, so satisfying me is kind of hard, loved it."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwN1pPWHJnRRAB",
            "text": "Great ambiance, delicious and fresh food, waitress are very nice. A lot of space in and out, you feel like you are in another country. Clean to perfection. Prices are according to what you get,Big plates.  better be hungry."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCNXFLdGpBRRAB",
            "text": "Their food is amazing! I love the ambience. The customer service is awesome. They are a bit pricey but worth it. My favorite dish was the appetizer called risotto croquettes (lacto-ovo vegetarian friendly). Their magi avocado salad and spinach pie were phenomenal! Best spinach pie I ever tried ❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNUxucFB3EAE",
            "text": "I had the pleasure of celebrating my birthday here the food was amazing and the staff are very courteous friendly - I looking forward to my next visit.   Thank you"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwM3ZXdDdnRRAB",
            "text": "The weather was perfect for being outside. Everything was beyond my expectations. Wish I was there now. You must try the zucchini chips and the risotto balls."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhXzUzVmtRRRAB",
            "text": "It was my first time dining at Veranda for a birthday celebration. The food  from the appetizers to main course was absolutely delicious.  The ambiance was calm and relaxing,  decor taseful and clean. Our server Gregory was wonderful, attentive and patient.  I definitely recommend Veranda and will visit again."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBb2R5SmN3EAE",
            "text": "Love this place!!\nThe servers were on point always came around to ask if we were ok and filled our glass up every time it was near empty.\nThe food was exquisite, a little expensive but worth it.\nAnd even though I didn't take any pictures of the food, it looked beautiful and the drinks were really good and not watered down, which is great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkcVBfUWR3EAE",
            "text": "Food was delicious, portions were 6 our server was very professional. Nice and cozy atmosphere!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpeTd2VXh3RRAB",
            "text": "Went to Veranda on Labor Day Weekend for a birthday celebration. Sat outdoors and it was beautiful! Their outdoor decor is so pretty. First time we went I ordered the pita dipping platter, lamb chops, creme brulee and the baklava. Everything was fresh and flavorful. If you're a fan of Greek/Mediterranean this spot is for you! I came back to this location a second time in October for indoor dining. Social distancing is taken seriously and it's a nice quiet ambience. Ordered the spanakopita and pita dips platter again. Spanakopita serving is two big triangles with a bed of arugula on top. Really filling! Blackberry mint mojito was also really good. We also ordered a bottle of Greek white wine for the table that was a hit. Service was quick and professional. Hopefully will be back soon possibly for takeout."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxcUt5bVBnEAE",
            "text": "Visited this place after dinner and called to check in advance whether we could do just drink and dessert and they were like “of course”. As soon as we ordered some desert and drink menu, the waiter told us “This is a restaurant. You guys…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoMy03UmpnRRAB",
            "text": "Attentive staff and good tasting food. Definitely try their octopus. It sounds like they only serve brunch on Sundays."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDanZpRkJ3EAE",
            "text": "Excellent service, The Seafood Orzo was perfectly spicy 🔥. We ordered just about all the appetizers. My favorites were the pita dipping tray and the grilled octopus. They make a wicked red wine sangria so order the pitcher. During the…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMOG9hRVlREAE",
            "text": "Have eaten here for brunch and dinner and food is always good! Outdoor seating is nice as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aElTVWtBRRAB",
            "text": "Wonderful hidden spot with an unexpected nice outdoor dining area. Once seated inside you forget that you’re on northern Blvd right near the clearview expressway. They don’t skimp on the alcohol in their cocktails and food portions are generous and always good."
        }
    ],
    "reviews_count": 63
}