{
    "name": "The Sweet Sap",
    "place_id": "ChIJDemOuDRhwokRHZSIAhFqVl8",
    "grid": "QN7",
    "address": "189-11 Northern Blvd, Flushing, NY 11358, USA",
    "rating": 4.4,
    "user_ratings_total": 721,
    "phone_number": "(718) 225-1000",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wc1JYbGFkVXd0UWpaR1ZFUlZUM0ZrUW10cFZVRRAB",
            "text": "1st time here. It was great place. All the food was so taste. Hope to go there again."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxa0xVTmxaaTExWDFOTk0xOVFWalo0TWpOc1FrRRAB",
            "text": "The pork cutlet had a very sweet sauce, and the chicken sandwich was very fresh and delicious. And this place has delicious coffee."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMVNHcGZhVVpyU1hsUFQxODJURVZrV0VSdGFGRRAB",
            "text": "I had no idea this place was a restaurant from passing by. It's not prominent on the street so it's hard to know it's a place of business or what business. But I saw it on Google maps and read the reviews and the menu. That's what attracted me to this place the most. It has the perfect selection of foods for mixed generation Korean customers. It has traditional Korean/ Asian flavors and western flavors that are suited to Asian palates. My pickyeater group all loved it. The decor is cozy and pleasant, the staff was very helpful and nice, the food was great. We had the cauliflower tempura, penne ala vodka, pancakes, curry chicken katsu over rice and the buffalo chicken burger. Definitely recommend and will come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSWmNVNWpXbWxvT1RKNFNHNDJRMUpIVFhCcWRGRRAB",
            "text": "Each dish I try from here somehow manages to be better than the last. Their penne ala vodka is amazing, as well as the soy garlic wings. Staff is so friendly and food is always consistent (:"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4b1gwSlFXa3RxWTI1ellrWm5ZV1l5YjNKc00xRRAB",
            "text": "I've always had a great experience dining in with Sweet Sap. Their fusion menu is delicious, and they've always improved on their menu items since I've dined with them.\nI highly recommend the Brussel Sprouts and Bacon and Tempura Cauliflower for starters. They also make excellent breakfast items, namely their French toast and pancakes.\nIf you dine outside, the service takes longer as it seems there's only one wait staff running back and forth, and up and down the stairs tirelessly. However, the outside patio is dog friendly! Feel free to bring a well behaved pupper to dine with you.\nBut my review garnered three stars because with their take out, you can significantly smaller portion sizes, and I was missing an order of truffle fries. The boxes were sealed, so I didn't think much of it. However, when we opened the boxes, we were missing the one order of truffle fries for dinner. We were disappointed, but luckily we had made other side dishes to nake up for it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xweFZUQnZMV3RCVEdaRlpWaHFhWEJIU1MxeVRWRRAB",
            "text": "Delicious food, great prices. Free street parking. Great little spot."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xNGFURkNYM1pwWmtscWNtbzNRekZTU2t0cVpuYxAB",
            "text": "Nice intimate settings. You have a choice upstairs or downstairs.  Thanks New York!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sZlNUSlVjV3RCU2pKcU1scExjelV5YVc1dVdsRRAB",
            "text": "Good food, good service, good vibes , good times. My go to place. Always can tell the quality of the fries are good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JMWVGOXdWblY2VFU4M1UxVTVTVmhzU0c1eldGRRAB",
            "text": "My cousin chose this place for her 21st birthday dinner and the experience was 10/10 for me. From the ambiance,the service and the food. I had The Sundance alcohol drink, if you enjoy nice sweet drink this is a go to. I also had the tangy chicken as a starter. The flavor was amazing. As my entree I got the fettuccine carbonara and it was delicious. Overall it was a great experience"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kamNteHhSa1JYTUdGNGRXcHpWalpMVERkcmVIYxAB",
            "text": "Lovely vibe. Staff was decent but it seemed like he was the only person taking care of entire outdoor seating area. Took a while for services. Wished there was an additional stuff. Food was bomb. Delicious with a good twist. Love that there are options for Asian and non Asian food as my friend was craving pasta and I was craving Asian cuisine"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paUFIwcDNSbTFITjFkRmF6aGFlbmRQWlZOR2IyYxAB",
            "text": "The Cesar salad on the menu states there is garlic croutons included (see screenshot). Mine did not come with croutons, I asked the waiter (with tattoos) about this. He was very rude and said it didn’t come with it and I can’t buy it as an extra side order. I swore I saw it but didn’t want to make a big deal.  It was 13 dollars for lettuce with dressing. They somehow messed up a three ingredient salad (dressing, lettuce, croutons)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kNVVVNVhNMnRhYkhCMVltdGFlak4zY0RONU9IYxAB",
            "text": "Wow! This one of my family's favorite restaurants. Has the best entrance with stairs lined with beautiful plants. What comes after that is way way better...the food is just amazing!!! We go there often, YOU should, too!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMmNFbDBZV3hXVUY4MVZHY3hNMWt6TWxkc1pXYxAB",
            "text": "Great place for lunch and dinner. They have many choices. Soy garlic wings were great"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sweWRXWmFMVTVTYVVaMWFYRkVUVE5YY25wdE5YYxAB",
            "text": "Absolutely love everything about this place… the drinks are always amazing (try the Sundance) it does not disappoint! The poppers - finger licking good and those ribs fall off of the bone and melt in your mouth!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0SWVVSk1TUzF4V25wMlZYRmtNa0kzYTFkSlpVRRAB",
            "text": "Had an amazing time. The food was delicious very family friendly"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSSE1FRnhVMFE0VFhCRmRYVk5TMVp6VEdKaWIwRRAB",
            "text": "Atmosphere is great, with above average food. Chicken wings were really crispy would recommend, buffalo sauce had a kick. Brussel sprouts came out so fast and was good. Sweet potato fries weren't special, a little soggy if anything, can skip. Chicken burger used tenders\n\nServers were friendly and polite, but not enough staff."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xacmExVmtlVE5RTFhSMVZqTXhNbWxqZGpnMmRtYxAB",
            "text": "Javier played hostess, bartender, server, and friendly provider in Sweet sap and did a great job taking care of us and everyone else. The drinks were great, food was decent but service was great. Come see Javier at Sweet Sap"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SeFJYSXlUMFEwVlc1cUxYcFNjMnA0Vkd4amVIYxAB",
            "text": "Friendly server"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wd1R6RmpPRE5GWlZWb05tMUtaVGxmZGtGbUxWRRAB",
            "text": "It was nice coming back here as it’s be awhile since I came here when it first opened. I ordered the teok-galbi burger and it hittt. The beef/pork patty was nice and juicy and the bun toasted with the edges crispy. I was so into my dish I forgot to take photos, but nonetheless it was so, so good. The decor was just as I remembered w. a beautiful outdoor patio."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SRFIyTkVMVU5pVmtaSFZHWnZhVzFKU1ZsRFFtYxAB",
            "text": "This place use to be good but service now is slow and the food takes forever to come out when it’s not busy."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214RGVVOUZjbHB4Vkd0Nk1UWjZNamhaZWpnMGNYYxAB",
            "text": "Love everything about this place! Have never been disappointed."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SSVJrWk9jVTU0TWxCV1ZXaEliWFpIWDIweWFHYxAB",
            "text": "Very pretty exterior and calming interior atmosphere! The pasta was pretty good for the price ($14). I would recommend it for going out with friends or a date."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMVQzTnNOR0k1WlVkalpWbGFRblpDVEdZNWNuYxAB",
            "text": "Very nice restaurant. Very nicely laid out. Food was delicious. Service was great and very accommodating"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMVRWWXlUR3Q1UzBaa1VWTTRMVmxsUWpkb1VYYxAB",
            "text": "Consistently good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25neGJWQjVkVGd0Y210V1JIQTBWbTUzYlZsd2FVRRAB",
            "text": "When I spilled water they cleaned right away and gave us free food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNNWIzaGFMVVpZWlRoT2EwVktibkJ4VkdKelVtYxAB",
            "text": "I went there with my hubby for date night, we sat downstairs in the outdoor area, we waited so long to place our order. I went upstairs to get the WAITER, he MADE A FACE , I found that very rude and unnecessary. The food isn’t the best tried the fried manicotti and the tempura cauliflower it had NO FLAVOR. No one came and checked up on us, we needed a few things. Waited a long while to try to get the check and had to go upstairs again. At first I thought maybe they’re under staff but I saw many waiters upstairs. It was DIRTY as well when we walked in couple of tables were UNCLEANED. Would definitely NOT RECOMMEND."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWQmJWZzBhMFJQZGtWaldqSlRXV1ptZEcxMlFYYxAB",
            "text": "Had an early dinner at The Sweet Sap with a party of 7 and we all loved it! The food was delicious, and the downstairs dining area is stunning. With so much greenery, it feels like a hidden gem. The staff was friendly. Service could’ve been a bit more attentive, but nothing that took away from the experience. Definitely coming back for more wings and to try more from the menu!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSQ2JXUnVlbVV4UkZGMFRYUXpWMjlJZEU1cWNrRRAB",
            "text": "My family will not be returning. They brought out the fried appetizers (wings and calamari) and all entrees for our table of 4 at the SAME TIME. This is obviously bad practice and should never be done. It essentially makes you choose which dishes should get cold first and defeats the whole purpose of an appetizer.\n\nWhen I asked why they did it, the server said \"Too many tables today\". Our section of the outdoor/tent seating was more than half empty, so either they were severely understaffed or it was an excuse for mismanagement (or both).\n\nThe food was mid at best and a bit overpriced, but that's about the norm for this area on the border of Bayside/Flushing.\n\nOn a positive note, our busser was very professional and kind; the timing situation was obviously not his fault."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0T1JEZDBSakV6TlhOd1RHbDBjV1V5VURGUllrRRAB",
            "text": "The food here is disappointing. My coworker ordered the katsu over rice, but it didn’t taste fresh at all—it was stale and tough to chew. The chicken wings were tiny, especially compared to other Korean spots nearby.\n\nOn the plus side, the restaurant has nice decor with fresh flowers out front, and service is quick. However, the staff wasn’t very attentive—we had to flag them down to order, and they didn’t note my request for less rice. Prices are on the higher side for a local place, and unfortunately, the quality doesn’t match."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRWNEUTNSV2MxVG1sWFdtdEhUSFpRYmpkUk1GRRAB",
            "text": "Food was sooo good! Staff was great! Place is welcoming and a whole vibe! Will be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0c1ZFMTJkekZZV0U1WVNtUmhjM1ZSVGpKUFEwRRAB",
            "text": "The food was pretty decent, we got the tteok-galbi burger and the buns were crispy and sweet. The meat was well done and well seasoned. Though the tomato slices were huge and the lettuce was clumped together. For the fettuccine carbonara, it felt like the noodles were a bit on the harder side and the chicken was thin slices? But other than that it was pretty good. I was hoping they’d ask if I wanted extra cheese on top but they don’t do that. For the truffle fries it was okay, nothing special.\n\nAs for the service, when we first sat down, a guy with glasses took our order and told us he was about to clock out. He got our order and then somehow forgot to put in it? Which is a bit interesting to me. My friend and I sat there for 30-40 minutes and no body really checked up on us and I just figured the food was just taking long. I only realized after the tables who sat down after us had gotten their food but we didn’t. We then had to ask if our food was ready and they had asked us “did you guys order?”. We waited quite some time after we ordered but the staff after the first guy were really nice. They made the experience way better and even gave a discount for messing up. I appreciate them understanding the mistake and making up for it.\n\nThe atmosphere is really pretty and they have a little bar area inside the restaurant along with a lot of outdoor seating as well. The place has some street parking but you might have to drive around a few times."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKM0tET0V3EAE",
            "text": "음식도 너무 맛있고 조용하고 로맨틱한 분위기가 좋습니다.\n오붓한 가족식사장소로 추천합니다. 야외테이블도 이용가능해서 붐비지않고 느긋하게 식사할수 있습니다. 또 방문하고 싶은 레스토랑입니다."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJbHVYQml3RRAB",
            "text": "음식맛이 참 괜찮고 생각보다 비싸진 않아서 만족스러웠어요.\n실내 인테리어도 예쁘고 나이대와 상관없이 누구나 즐길만한 분위기였구요. 전 개인적으로 포장마차식 야외 테이블이 준비 되어 있어서 강아지와 함께 갈 수 있다는점이 가장 좋았습니다.\n일하시는 분들도 모두 친절해서 기분 좋은 식사를 할 수 있었습니다.\n한식 양식 다 맛이 있는편이지만 전 개인적으로 양식이 더 맛있었어요. 아무래도 외국손님들 취향도 맞춰야 해서 한식이 좀 마일드한 느낌이더군요."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyM1BiYmZ3EAE",
            "text": "다시 오픈 했다해서 찿아갔는데 일하는 분들이 매우 성의가 없고 불친절하고 손님들한테 신경을 안쓰는 느낌을 받아 기분이 안좋았다\n다시는 가고싶지 않다"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1c3FtTTN3RRAB",
            "text": "분위기가 좋고, 음식도 아주 맛있고 너무 친철했습니다."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZX0xHTllREAE",
            "text": "분위기 좋고 음식도 맛나요.\n와인 한잔하러가고싶은 장소."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVdzVMaGhBRRAB",
            "text": "너무 좋아요\nFantastic"
        },
        {
            "date": "4년 전",
            "language": "ko",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLOTR5QkJnEAE",
            "text": "돈가스가 맛있다고 동생이 데리고 갔는데 실망했다 동생도 돈가스양도 줄은것같고 맛이 너무없다고 바뀐것 같다고 도저히 다먹을수 없는 형편이 없었다 누구에게 추천은 못하겠다"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvdXNXSzF3RRAB",
            "text": "아기자기한 이쁜 분위기에 맛도 감미롭다. Very Good!"
        },
        {
            "date": "수정일: 5년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpMnZ1U2NBEAE",
            "text": "너무맛있고 친절해서 좋았어요^^"
        },
        {
            "date": "4년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLcjluX3dRRRAB",
            "text": "가격 양 맛 전반적으로 다 괜찮음."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHeGFEdVl3EAE",
            "text": "맛잇어 맛잇어. 퓨전음식점.. 싸고맛잇어."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJcXRLYlB3EAE",
            "text": "싸고, 맛있는 집"
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDNmJlOHl3RRAB",
            "text": "이색분위기와 맛"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdXRLVlh3EAE",
            "text": "This place for Brunch was absolutely amazing! Me and my friends loved it. We got the Chicken and Waffles, Chicken Curry Katsu, and the Spicy Chicken as well as the Chicken Poppers for a starter. Everything was delicious. Would definitely recommend coming here with an empty stomach as the portions are quite generously large. The Lemonade and Fruit Punch drinks were also incredibly delectable and tangy! Will definitely come back here again and with even more friends!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcE5fMTN3RRAB",
            "text": "Checked out this Korean spot and was impressed by the variety on the menu—plenty to choose from. I went with the wings, which are always a solid choice here: crispy, flavorful, and reliably good. My partner had the chicken katsu, which was just okay—nothing particularly memorable. The real standout was the setting: great atmosphere, stylish but comfortable, and perfect for a casual meal or a night out. Definitely worth a visit, especially if you’re craving Korean wings."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzaDQzbVVBEAE",
            "text": "We held our baby shower here last June and it was the perfect venue! Our guests really enjoyed the food and the service provided :-)\n\nWe contacted Pauel to reserve the large tented event space for a party of about 40-50 people and he was prompt with responses and extremely helpful with any questions we had. They provided printed out menus of the entrees and appetizers we chose ahead of time, which was a lovely touch! They also let us arrive an hour earlier to set up all of our decorations.\n\nThe servers were so kind and provided efficient service for such a large party. We have since come back and ordered takeout many times, as their fried chicken wings are now family favorite! Their pastas are also highly recommended!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndHZhejNRRRAB",
            "text": "Ive been coming here for years now. The food is excellent and the prices are even better! Come in the evening when the ambiance is the best. Great date spot.\n\nI recommend the Hot honey wings and salt & peppercorn wings. All the pastas are delicious and the appetizers are excellent. My favorite appetizers are the Bulgogi quesadilla and bulgogi flat bread."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJNy1pdXJtcWFUX3BBRRAB",
            "text": "This restaurant exceeded all my expectations. The flavors in every dish were outstanding, and the cocktails were perfectly crafted."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cGUzNWRREAE",
            "text": "Such a cute restaurant! I can't believe I didn’t visit sooner! So far, all the food I’ve ordered has been great. Definitely one of my top favorite spots, and I highly recommend it to anyone in Queens!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRemVtNGxBRRAB",
            "text": "My friend and I I went today and it was such a nice place we will definitely be coming back. The calamari was delicious the  crunchy bulgogi quesadilla was amazing and she ended up having the Caesar salad Mac and cheese and the kickin shrimp poppers which was fantastic . We ended it off with a pineapple and passion fruit mimosa which tasted good . Next time we want to try brunch ."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzanN1RUFnEAE",
            "text": "What a gem! This place is so cozy! Inside is much smaller then it looked, but there’s two sections outdoor to dine. As well as on the patio. I can’t wait to return!\n\nThe service was phenomenal! The food was delicious! There’s so much I can’t wait to try. And the drinks were yummy. Everything was very affordable. I love the vibe :)\n\nGreat date spot, or with friends and family!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbFpteExBEAE",
            "text": "The food was delicious and the service was wonderful. My mom is super picky about food but she loved the food and talked about how kind the waiters were. I had been craving pasta, and theirs hit the spot! I’ll be coming back soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEX0xPNjlRRRAB",
            "text": "I went to the Sweet Sap today with my mom. We were having a lunch for her birthday. The restaurant’s beautiful, spacious, and clean. My mom drank a Sprite. She ate Chicken Katsu with Rice. Whereas I drank a lemonade and ate a Fried Shrimp Burger. Overall, I paid under $60 (including a $10 tip)!\n\nDefinitely coming back one day."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMHVXYVpREAE",
            "text": "Came here with a friend from Brooklyn. It wasn't too busy. Got seated right away.\n\nWe ordered eggs Benedict and chicken & waffles, and sweet potato fries. They have $7 Mimosas with 3-4 flavors.\n\nSo the mimosas were pretty good. Tried 3 different flavors: passion fruit, lychee, and pineapple. We both really liked the lychee one. Although it was a touch sweeter than I would have liked.\n\nMy friend liked her eggs Benedict. Basically licked the plate. We chowed down on the fries. Although neither of us cared much for the sauce that came with it. So we had them bring us ketchup. It's hard to find a place that makes a good chicken & waffles. Their waffle was good, balanced with flavor good texture. The chicken was good too. Breaded nicely, tasty and moist inside. Wish they gave maple syrup with it though or just honey. They gave me some over processed syrup like log cabin but it was fine\n\nService was great too. Our server was on it. She always appeared at the right time. Just when our drinks were getting low or if we had a question. Food also came out at a nice pace. Looking forward to our next visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6aTZ1YXpRRRAB",
            "text": "A great brunch spot! There’s good ambience and atmosphere great for grabbing food with friends or a date. I had ordered the fried calamari for starters and the spicy chicken sandwich, fettuccine carbonara. The food was decent but not anything special. There are lots of drink options too. I’m glad i tried it out!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOLXJHdHFnRRAB",
            "text": "I took my boyfriend here for his birthday because he was craving baby back ribs and I just want to say how AMAZING this place is. Beautiful entrance, kind staff, delicious food. We have a baby and the staff were so friendly and accommodating to him and us. They have high chairs, gave him water and we gave him the linguine pomodoro and he loved it!!! We had the baby back ribs and Brussel sprouts along with Mac & cheese bites and I have no complaints. Please support this business and try their food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWN1B1YXN3RRAB",
            "text": "Foods here are amazing!!! We always order the truffle fries it’s taste crispy and you can taste the truffle. The wings takes 30 mins and we love the soy garlic. The brisket burger is toooo die for!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXMmQyMXVBRRAB",
            "text": "Really delicious food and appetizers. The atmosphere is great inside. They also have 2 separate areas downstairs that are heated should you not want to climb the stairs or just want a different atmosphere. I've sat in both places. The portions are plenty. The french toast dessert was delicious! Try them out!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxaWVEWWJ3EAE",
            "text": "We came for brunch on a Tuesday and there was no wait for a party of 4.\n\nWe ordered the sweet potato fries, bulgogi quesadilla, tteokbokki, arugula prosciutto flatbread, tteok galbi burger, and omurice. The quesadilla and burger were amazing and the sweet potato fries were good. The omurice and tteokbokki were solid. We did not like the flatbread.\n\nOverall it was a good experience with good service and a pleasant atmosphere. I highly recommend stopping by. I want to come back again and try their sweet dishes!"
        }
    ],
    "reviews_count": 60
}