{
    "name": "Bourbon Street",
    "place_id": "ChIJHTgcB-BhwokRX4X5whEgijg",
    "grid": "QN7",
    "address": "40-12 Bell Blvd, Bayside, NY 11361, USA",
    "rating": 4.2,
    "user_ratings_total": 2373,
    "phone_number": "(718) 224-2200",
    "reviews": [
        {
            "date": "16시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sd2NqZzFSRU5tYlVsSldqWlJZVXhYYzFCV05HYxAB",
            "text": "Went to rooftop monday night. Not one person was seated. Ordered food 2 soups and meal. First soup came out and were told they didn't have the other soup so I ate and my partner sat waiting for his soup. Meal arrived at least 45 min after soup was done a long time. The shrimp was cold and so salty coult not eat it at all. Partners hamburger and fries were cold. Not my first bad experience there. Wanted to go to lobster bake they is on tues. Went one time and they said they ran out. It was just 5:00 when its supposed to start. Ok for drinks on roof but never going back to eat for sure. Yes they did take meal off tge bill which of course they should have. Excuse was regular chef cut his hand. Who knows who was cooking but sure doesn't know how to."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVVQyRjBaMnBhWjNBdFlrZEtObEozU1haUloxRRAB",
            "text": "Bourbon Street\nBourbon Street is a lively restaurant and bar inspired by New Orleans’ famous French Quarter. It offers Cajun and Creole-style dishes such as jambalaya, gumbo, po’boys, and blackened seafood, alongside a variety of cocktails, beers, and signature drinks. The atmosphere is festive and energetic, often with jazz or live music, giving it a fun, party-like vibe. Service is generally friendly, and the décor reflects the vibrant, colorful spirit of New Orleans. It’s a great spot for groups, casual dinners, or anyone looking for bold flavors and a lively dining experience."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNWNWWlZhRWhzYTJKbFgxbEdjRTltU1ZKa2EzYxAB",
            "text": "Wonderful dinner delicious prime rib. Eleanor was our waitress. She was amazing."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJMVJpMVhZak5oTm01d1YybGZMVU0xZEhrNVduYxAB",
            "text": "Great atmosphere for watching sports, especially the rooftop area."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5a1RWVnNTMU40YzB4dlZVNDVOVWRTWjFWblNHYxAB",
            "text": "We stopped by Bourbon Street for a family night out and had an amazing dinner! Our waitress, Sophia, was awesome—friendly, knowledgeable about the menu, and gave us great suggestions that didn’t disappoint. The blackened chicken wrap and Bourbon Burger were both delicious and filling portions. The cocktails were strong and tasty, and Jeremy the manager made sure we felt welcome.\nWe really appreciated the hospitality and will definitely be back next time we’re in town!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRExXcDNjbDlvUVVkNFkxTjJhRk0xT1dkdlJGRRAB",
            "text": "Good service, even better food. Generous portions for the pasta, especially for lunch. Really wanted to try the gumbo but that was for dinner only so I will have to be back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaWWVVdEVWMlpJT0c1VVFUWjRlbFZ5Wms5NVNsRRAB",
            "text": "An excellent spot for a superb meal!\n\nInitially, I was not expecting much. The prices seemed a bit high and I was skeptical. However, each dish exceeded expectations!\n\nEach dish was richa md decadent. A mouthful of flavor and surprises in each bite.\n\nThe service was excellent and the atmosphere was interesting and comfortable.\n\nWould recommend!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkblowcFplbFJOUWpNNE1UVnRPRUZVTmxkTVUwRRAB",
            "text": "Went for the pizza making class. So much fun! Food was delicious and the staff was amazing. Very friendly, attentive, helpful, and made you want to come back again. We left full! Meatball appetizer, salad, the pizza you make, dessert, and drinks included in the price"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsck0wTm9NV0ptTTBKRU5uTXlaVEl5U2xScGQzYxAB",
            "text": "OMG this place is perfect!!  And Wednesday make your own pizza with Genaro is amazing!!!  Trust me!!!"
        },
        {
            "date": "4주 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOaldtVXdMVEUyU0RKcGFGZG1kazlLYUZCNlRVRRAB",
            "text": "Tutto buono, dal pane all'aragosta, al servizio e al prezzo. Abbiamo mangiato un'ottima aragosta, preceduta da un'altrettanto ottim soup. Nel menù speciale del martedì, Insieme all'aragosta viene servito pure un piatto di cozze e vongole e per finire il dolce una sorta di cheesecake al lime. A me è piaciuto tutto. La prossima volta che tornerò a NYC ci ritornerò ma per la bistecca."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMk1teG9VV05FTjJWQ2N6ZGtSREZsY0VsTVQwRRAB",
            "text": "Best salmon I ever had. Amazing!!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGNlJFRlJhMDFSWjB4TU0zQlhTMVpUV1VVeE5VRRAB",
            "text": "Always a good place to grab drinks. The first floor needs a bit of remodeling. The rooftop is the place to be. Good drinks decent food."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhc1Ata2xRRRAB",
            "text": "Always good food with a great atmosphere."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wTGRsVXhVVll6UTNVMmFUVklibnBYUmw5b1NIYxAB",
            "text": "The food was delicious, portions were generous, and the prices very reasonable. I also loved the weekday promotions such a great deal. Definitely coming back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xveWJFSlRZMnRtUTNCM1dUUXlWVFZsTkVkdVZWRRAB",
            "text": "I organized my husband’s pizza birthday night here and from Ellen, Genaro and all staff gave us an extraordinary service !!! The food was beyond delicious!!!! The experience was wonderful, we loved everything.\nThank you so much !!! Every body loved the place.\nDefinitely will be back and we will celebrate again here for sure\n1000% happiness 🙏"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wd1NEYzJiRUZTYTFGS1JGWTRlaTE1TXpKRFUzYxAB",
            "text": "Food is amazing, so is the service and atmosphere"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVVRVRXplRGMyZEc1WVUyazBVMmcwZVV4d1IyYxAB",
            "text": "Yummy Cajun food, decent prices. Take out is sketchy (always seem to be missing one item or another) but dine in is great."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xNkxVTkhNbnBLTWtKRU5GWlFUeTA1U0hkSlJtYxAB",
            "text": "Nos encanta volveremos"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kaWJrODJPRlJHYXpkSU5rMWFTVlp2VlZwT1NXYxAB",
            "text": "Friday ,saturday night such wonderfull place at Bell blvd bayside Queens.New York."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25weWEzUkZXa1pTYUVOeWFsbHhabkkxVUhaVlVVRRAB",
            "text": "Great food and service. Had calamari appetizer. Blackened chicken wrap and buffalo Mac and cheese. All were delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205alkxbGtVVlU1TW1Wak1FeDNlVk5yUzE4M2EyYxAB",
            "text": "On behalf of The Center for the Women of New York, I want to extend a huge thank you to Bourbon Street for their incredibly generous and delicious donation to our Taste of the World at Fort Totten gala.\n\nThey provided a large tray of seafood jambalaya with cornbread that was an absolute showstopper. The jambalaya was packed with bold, authentic Creole flavor and plenty of fresh, tender seafood. The cornbread was moist, slightly sweet, and the perfect complement to the spicy, savory jambalaya. It was a true taste of New Orleans that transported our guests and left everyone thoroughly impressed.\n\nIt is because of amazing local businesses like Bourbon Street that we are able to successfully raise vital funds for our mission of supporting women in the New York community. Their commitment to giving back shows a deep dedication to supporting the community they serve, and it is exactly why I make a point to support businesses that care.\n\nWe highly recommend Bourbon Street for their outstanding Cajun Creole cuisine and their tremendous generosity. Thank you for your kindness and for making our event an unforgettable success."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWU1qY3llVkZHVkZFdFQxTlhaVzF5Ymt0MWEzYxAB",
            "text": "Amazing food and drinks.  Great place for a night out with friends or family!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONFkwdFBla1ZKZDBWdGFXeDBTWFU1VmxJNVlrRRAB",
            "text": "Our waitress was amazing, she was polite and attentive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMlgyeEpNbmhUVHpkYVJFRlZWRmsxY25sVVZVRRAB",
            "text": "Beautiful place great crowd music and folks. Food plentiful"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkeGNuUnZZVlJCYld4aVVrSjFia0ptYVVsTWFtYxAB",
            "text": "Worst experience ever. Just finished attending a city event through queens chamber of commerce and when asking for our credit card back, the bartender stopped caring for the fact that he would no longer serve us, he called the bouncers and the bouncer literally dragged us out, ripping my shirt, without hesitation or having the decency to ask what was going on, and literally didn’t even provide us with our credit card back. The staff there was all horrible and didn’t even care for the fact that we were getting served all night. Horrible place, as soon as we got dragged out people outside were telling us how bad it is inside. Attended a queens chamber of commerce event, definitely not going back even if I was paid to go back & best believe I will be telling everyone about how bad they were there. -100/10 horrible experience don’t go here unless you want to be unattended and would like to get kicked out for no good reason."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0UE9EaHNiVmRRU1haYVQwbEZTMEZvU0dJNVJtYxAB",
            "text": "I’m writing this review in hopes the owner will read it. This is my 1st time here tonight and was very excited because a good friend of mine recommended this place. I Drove all the way from Brooklyn heights with my family to try  Bourbon street. The  Decor, vibe, comfort and food are all there. Definitely above average. However, The killer was the waitress. She took our orders close to an hour and still nothing came out while tables who came in later than us were all served. I just couldn’t understand that. I finally had to flag down another waiter to have him check in on my food. Not even sure if she even placed our order in. Our Waitress appear easy on the eye, not mean, just don’t know how to take care of customers unlike Eleanor the other waitress whom I learned her name on my way out. Now Eleanor stays on top of all her customer’s orders and extremely engaging. I should’ve sat on her side if I only knew.  Food finally came and my waitress apologized blaming kitchen being busy. If the kitchen was so busy, everyone’s food would’ve been  delayed not just mine. Anyways, she really dropped the ball and it dampen my mood tonight. I still gave her 18% tip despite everything. I hope she’ll do better in the future."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGVWFFeEhhbTloUjNCT2QyazJWRXByYmxWT01FRRAB",
            "text": "Came here for Saturday lunch and was the 3rd table in the main dining area. Ordered one appetizer and two entrees which came out at the same time and clocked in at 50 mins. Not sure what was going on that day but no one checked on us and I had to literally wave down help. Food itself was average but the service really sinks the experience."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPei1TaVBnEAE",
            "text": "Hello Bourbon Street Restaurant. Today is there 10 Year Anniversary and everything was complimentary from 5pm to 7pm and we didn't even know, just happened to doing some resturant hopping. Aren't we glad we hopped on in. We where there before the festivities started. Ordered some drinks and dollar oysters. The party was on the rooftop, and oh man it filled up quickly. Would you like yo see, but hold on, let me finish telling about what they had. They had popcorn my favorite, a raw bar with shrimp, oysters, pizza and yummy cocktails for everyone. Everyone had a great time i had the Cucumber crisper so good. Ok! I let you wait long enough here is the good time. One of my top 5 restaurants on Bell Blvd in Bayside NY. Happy Anniversary."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205QmRrMW1UbU16T0dSSVlWbEVUUzFJTWxBNWNFRRAB",
            "text": "My wife's 40th birthday was an absolute triumph, and a huge part of that was thanks to Bourbon Street restaurant in Bayside! From the moment we walked in, the staff made us feel so special. They had a table ready for our party, and the atmosphere was just perfect—lively but still intimate enough for a milestone celebration.\nThe food was incredible. We started with some appetizers to share, and everything was bursting with flavor. I had the skirt steak, and it was rich, and perfectly cooked, while my wife raved about her penne la vodka dish. Everyone in our group was delighted with their meals, and the cocktails were fantastic—strong and delicious.\nWhat really set the evening apart was the service. Our server was attentive, friendly, and went above and beyond to make sure my wife felt celebrated. They brought out her birthday cake and even led the table in singing \"Happy Birthday.\" It was such a thoughtful touch that made her feel so special.\nBourbon Street isn't just a restaurant; it's an experience. The food, the drinks, and especially the amazing staff made my wife's 40th birthday a night we will never forget. We will definitely be back and highly recommend it to anyone looking for a fantastic meal and a great time. Five stars all the way!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGdmJHSk9Xa1pyYzJGTGVHRnhRV1pwV2pKTlVtYxAB",
            "text": "Stopped here for drinks with friends to celebrate a birthday. We had a nice time and the service was pretty good. Their rooftop is pretty nice but it’s a lot of stairs to walk up."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204elNUWk1RMVJqVlRsdU0wc3hRalZ5UkVaZlRWRRAB",
            "text": "Fun place good food.. A fav.."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KT2FtWnVZM2wyVlZaMFJTMU9VWEJUV20weFkxRRAB",
            "text": "Pizza and chill on the rooftop was an amazing experience! My friends and I genuinely had such a great time, and Gennaro was the absolute BEST. You can tell he truly prioritized and cared about giving everyone a nice and fun pizza-making experience. He was very attentive, and you can see the passion he has in his work. The food was declicious, and so was the sangria. I would 100% recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkTFRsUTBNVTkyY25oelFrdzBXbGx1VDNnelRFRRAB",
            "text": "Last night was everything! I went to a rooftop pizza-making class with my girlfriends, and it turned out to be one of the most fun nights we've had in a while. The vibe was so cute—warm summer air, string lights overhead, and laughter all around. The theme of the night was all about hands-on pizza making, and we were guided by the absolute best instructor, Gennaro.\n\nGennaro was a total gem—personable, funny, and genuinely passionate about pizza. He didn’t rush anyone and made sure we all felt like pros (even when a few of us got creative with our toppings). He walked us through the dough, sauce, and perfect baking tips with so much care and patience.\n\nI went all in with my pizza. piled it high with toppings like spicy pepperoni, roasted veggies, fresh basil, and extra cheese. It turned out amazing! We each made our own unique creations and then got to enjoy them hot out of the oven.\n\nFor $50, we got such a great deal: delicious sangria to sip, a fresh salad, a juicy meatball that was chef’s kiss, dessert (yes, please), and of course, our own custom-made pizzas.\n\nWe had such a great time that we’re already counting down the days to the next class in September. Honestly, between the rooftop vibes, the food, and Gennaro’s incredible energy, it couldn’t have been a better night. 🍕✨"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWVlFYWnlZbUkyZGsxTk5rSkRVR2RJTlZReGNYYxAB",
            "text": "Mr. San Gennaro was the absolute man! I had the best time here, I was early on the 6pm time slot and he was super accommodating especially with us being the first people here. I personally had the Shrimp Scampi pizza, (definitely would recommend) and my wife has the pepperoni pizza! We both gave my pizza a 10/10 (no lie, it was THAT good) and we gave the pep slice a 8/10. Phenomenal pizza, I ruined my dough but Mr Gennaro gave me a new dough on the house. He helped me shape it and it came out amazing. 10/10 would reccomend, and would come back for the next event on Sept 17!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxaE4wczRTRm8yZGxKamFqUnNObk0zUm5KdFZHYxAB",
            "text": "Came here for lunch in the dead of hours around early afternoon. I got a chicken wrap which tasted pretty darn good I have to say. UNTIL my stomach started hurting the entire rest of the day. The next day I had the other half that I didn't finish and again the same process, my stomach was also hurting the rest of the day. I really hope their food is fresh but something was off for my body to have reacted like that. Also a note to the chef, the wrap was pretty much half tortilla, folded and folded into layers and layers- where I thought it was actually sliced cold cut chicken that's how much there was. Only later realizing that it was the wrap. So, not sure they really know how to make wraps- would not get again.\n\nAs for the service, we were the ONLY ones in the restaurant being helped and the waitress didn't even come to our table ONCE after taking our order. The waterboy came about three times but she couldn't even come one once. He's the one who deserved the tip not her- And next time I 100% I'm going to give it to the person who did the most work regardless of who our server is. But this was of course reflected in her tip regardless."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TVQwMVVPRmxqWlVScmMwWjVTVE5XWmtGeFZrRRAB",
            "text": "Had so much fun and good music last Friday night"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcUlyRmtRRRAB",
            "text": "전에 가족들하고 분위기좋은 곳에서 너무 맛있게 먹었던 기억이 있어서 오늘 또 다시 재방문한곳 헌데 음식 나오는 시간이 너무 오래 걸림"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMHZMb2x3RRAB",
            "text": "루프탑 빠 좋습니다. 직원들도 친절하고 라이브하는 가수도 있습니다. 원래 1층이 핫하다는데... ㅋ"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPM0Y1NHVUaV8zT2pRRRAB",
            "text": "We went there for a small dinner party for 13 people...we had a wonderful time, delicious food and very good customer service.  We had a few bumpy interactions with our waitress Eleanor but she apologized, corrected her attitude and was great after.  It was also a Saturday evening and she was overwhelmed.  I cut her some slack.  The manager (male) was great, and the treatment was superb."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvM2FyaXpnRRAB",
            "text": "Visiting from Baltimore for my birthday, had a great experience, the sever was great, for was amazing even the busboy and the hostess (loved your silver pants by the way) was amazing lol he even took our pictures. Right as we were leaving the Manger (I’m guessing) gave us 3 shots of deliciousness  this is the only way I can describe it on the house. I don’t even think he knew is was my birthday so thank you to all the staff that work  in April 26 in the evening. When I’m up that way again I’ll definitely be back"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJb2FYa3lBRRAB",
            "text": "Food - Great and fresh. The french toast and cauliflower are great.\n\nService - Excellent.\n\nAtmosphere - The rooftop is very pleasant to dine in, especially for Wendell’s events."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnM2RMaVRBEAE",
            "text": "I dined with a group of friends and enjoyed the place and the food. It was a rewarding casual experience. The food was good but nothing out of the extraordinary. The service could've been better, some of the staff looked like they were daydreaming and we frequently had to ask for our server. There were way too many drunk teenagers around some wobbling and vomiting on the stairs so it made me question the restaurant’s policy.. I'm not sure if I want to visit again…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2aWRuaF9nRRAB",
            "text": "Cute place with GREAT customer service. The food however did not live up to the \"very spicy\" comments on the menu and did not taste like authentic New Orleans cuisine. The drinks lacked alcohol, but the restaurant was affordable and worth trying at least once. The ribs were definitely top tier, but I had higher expectations for the specialty dishes. I'm used to a lot of seasoning and spice and expected the same from a NOLA spot but if that's not what you usually go for, you may like this place a lot more."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsV1l6WlNXa00yVkc5aExVODBiRzVpU2poRFRrRRAB",
            "text": "The rooftop bar was an amazing place to spend a summer night. The open air design created a perfect atmosphere to enjoy the music and the city lights. The DJ was mixing Freestyle and dance music all night long, and everyone was on the dance floor. The vibe was so good, I could have stayed there all night."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmd2JIal9BRRAB",
            "text": "We went for a quiet weekday lunch and the food was ok, but the atmosphere was nice and spacious. Our server really wasn’t around much but just enough for me not to complain about it. The manager did come and ask how everything was but this was after we got the check already. So my husband mentioned the undercooked burger and he did apologize for not coming by sooner.\nThe tuna appetizer I ordered tasted slightly watery like it was quickly defrosted and I didn’t enjoy the watermelon with the red cabbage combination, the burger was slightly raw in the middle but if you ate around it, it was fine. The fried mozzarella was pretty good but how can you go wrong with fried cheese. The French onion soup wasn’t bad but didn’t have that deep onion flavor. The ribeye sandwich was the best thing we ordered as that was tender and delicious. Their fries were also really good. Note- I bought a Groupon for this meal so it was worth it, but had I paid full price, I’d have a lot more complaints."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NGFQQ3FnRRAB",
            "text": "Visited last Sunday service downstairs excellent. Upstairs was ok nothing special. The shrimp in cream sauce and garlic bread was so delicious. Jambalaya was huge my friend ordered need the to go box for it. I only gave 4 stars because the music for sunday lunch was so loud we wasn’t able to have a conversation. Otherwise it’s a great place bring back my memories for New Orleans."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNidlBXaUNnEAE",
            "text": "If you want to experience a rooftop bar in Queens, this is a good spot. It's great for meeting up with friends or having happy hour with colleagues.\n\nThe food here is mediocre at best, but the drinks are good. If you are seated at a table, they try to rush you to leave (at least that's how we felt). I'm including pictures of some food, but I'll be honest and say that they weren't that good. Also, they aren't cheap either."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXdC03cmtBRRAB",
            "text": "The food was good, so far what we had has been tasty. I really enjoyed the wings, quesadillas are good. The sweet potato fries are really good. My mom had the buffalo shrimp Mac and cheese. Very cheesy tastes good 😋.  We come here often the drinks delicious. I recommend the hurricane just the right amount of alcohol. Whoever is making the drinks never fails 👍🏽💪🏽"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcXFfME5REAE",
            "text": "Service was awesome. Drinks are great. The Mac & cheese balls with pulled pork, so good. The blackened catfish and mashed potatoes were delicious.  Corn bread bread basket and butter is  yummy."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPd2YydFpREAE",
            "text": "I haven't been to this fine establishment in years. I'm so happy they've survived the pandemic and they upgraded! It was great dining on their rooftop. The atmosphere was nice, the drinks were awesome and the food was great! Had to take a star away because of the wait (waiting for drinks, food, etc...). Other than that, it's a great place and would definitely come back!!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cU5UWVlREAE",
            "text": "Came here the first time on night of July 4th; it was a blast as the DJ in the house  and guest could dance around.\n\nThe second time in freezing early December; sitting at the same rooftop as cold as Himalayan mountain. No heating whatsoever.\n\nThe foods are fine: taste good. We got nachos salmon and blackened crab cake. Tasty!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbDRDbHV3RRAB",
            "text": "I celebrated my son’s 15th birthday yesterday (1/18/25) at Bourbon Street Restaurant with a group of 20. The restaurant is beautiful and spacious, providing the perfect setting for our gathering. The staff was not only polite but also extremely helpful, ensuring that everything went smoothly throughout our visit.\n\nUnfortunately, we were seated under a leak in the ceiling, and it landed on one of my guest’s meals. However, the staff was immediately attentive and addressed the situation, even going above and beyond by removing the meal from our bill.\n\nThe food was absolutely amazing, and despite the small hiccup, the overall experience was fantastic. I will definitely be returning and highly recommend Bourbon Street Restaurant to anyone in search of great food and exceptional service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwLTZTS05nEAE",
            "text": "Great local place which we have been going to for drinks for years. First time in a long time we came for food and I was pleasantly surprised. Food looked and tasted very good. Nothing was outstanding BUT there was nothing I ate that was even remotely disappointing. I love Cajun food which is their forté and they do a very good job!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidjRIRUpBEAE",
            "text": "Beautiful NOLA theme restaurant. I loved their rooftop. The rooftop menu seemed to have more vegetarian options. The watermelon feta salad was delicious (the dressing could have been more savory) and their Cajun fries were the best! They had mocktails as well. Great and friendly customer service upon entry, during the dinner and exit. They have a private room for events as well. I hope they can host live jazz music one day."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJcko2YlRabTVuTXNnRRAB",
            "text": "I’m leaving this review because I’m upset by the treatment we received from bourbon street. We booked a rooftop table a month in advance for 16 people, for my daughter first communion.  My wife even called the day before to confirm are reservations was set.  A hour before are reservations time and 5 minutes before my daughter communion, the restaurant calls us saying that somebody booked the whole rooftop and that they didn’t know why we had reservations or when they were made.   We were told that they could make room for us in the main dining room if we chose to keep the reservation.  Having no time to make other arrangements I agreed to the change of venue.  The person did apologize for the trouble, but I felt it was halfheartedly said.\n\nWhen we arrived at the restaurant are table look slapped together last minute. One table was smaller than the rest and none were the same high.  But what got me really upset was the fact the manager or someone didn’t come over when seating me at the table and to shack my hand, and giving me a sincere apology.\n\nMy daughter and my family had a great time and the food was great and the waitress was good at her job.  And I understand a person that books the whole rooftop is more important then my 16 guests, but what I don’t under is why they didn’t informed use earlier in the week, when we still could have made other arrangements, or saying something when my wife called the day before the appointment.  I also don’t understand why they wouldn’t make a formal apology after putting a customer out so badly."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTWJVRnVVMUptZW1GcFZERXhWbTlTTkZWRWVXYxAB",
            "text": "I am in town from South Florida. I am staying at the Adria Hotel and Conference Center around the corner.\n\nI woke up late and decided I wanted a steak. Most places, especially restaurants with steak were closed. Blair, the front desk receptionist, recommended that I come Bourbon Street because of the good food and atmosphere.\n\nWhen i first sat down, I had to wait a few minutes, but Gennaro, asked if I have been helped, and served me right away.\n\nGennaro recommended the Ribeye. The ribeye came with a salad, mashed potatoes, and mixed vegetables. It wss amazing.\n\nDid I mention that the steak was 20 ounces! Wow! I couldn't finish half of it.\n\nI asked if they could cook my steak a little more and cut it in slices because I was staying in a hotel. They said, NO PROBLEM!\n\nI'm going to eat more in the middle of the night. Lol. If youre in Bayside, Queens, NY, this is a place you MUST visit. I will definitely come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSd05qNWhRRRAB",
            "text": "TL;DR: Amazing place, fantastic food, good vibes.\n\nFULL REVIEW: Came here after a trip to the beach. Only visited the rooftop but I can tell you the place was fantastic.\n\nIt's called \"Bourbon Street,\" and although I've been to \"the real\" Bourbon Street a few times, this was NOT a 100% Bourbon vibe, simply because of the music (I would have expected more cajun or jazz).  It was more chic NYC vibes with a Bourbon Street APPEARANCE.  The decor was awesome.  The retractable roof let in just the right amount of sun vs. shade.  Our table was VERY wobbly, but the chairs were comfortable.\n\nShawn, our server was super awesome.  He was quick, polite, and always checked up on us when drinks were low. He made sure to keep us updated on the status of our meals, which I would say took an average to SLIGHTLY longer-than-expected wait time, given how busy the restaurant was.  Overall, very pleased with speed of service.\n\nThe food was AMAZING.  I had a classic hamburger and fries.  The burger was cooked to PERFECTION. I requested medium and it was spot-on. SUPERIOR beef flavor and VERY juicy. The lettuce and tomato were fresh and crisp.  It was by far one of the best hamburgers I've had the pleasure of enjoying in my lifetime.. at least top 3.\n\nThe fries were excellent.  Freshly-fried, crispy on the outside and soft on the inside.  They were a grade somewhere between frozen and fresh-cut.  At first the quantity looked small on the tray, but by the time I was done I was very full.\n\nPrices were average for this type of fare in this type of establishment.  I had a great time at Bourbon Street, and will definitely be back in the future."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXajhfUlRnEAE",
            "text": "We came here to celebrate our anniversary. It was an excellent choice. The food was delicious, the ambience great, the server and service wonderful and the flood delicious and plentiful! I would definitely come back here! The meal began…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLZ05XNTlRRRAB",
            "text": "The service was kind of slow, at first. It took a long time for someone to even come over to our table, but after that, all our food came kinda fast. The staff is friendly. The drinks were nice, and strong. The honey bread was a little…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MUlqeXJnRRAB",
            "text": "I went on Sunday for the brunch. It was absolutely delicious. The bottomless mimosas were Divine and I had a really good time. They played live music which was great. It wasn't too loud and it was appropriate for the atmosphere."
        }
    ],
    "reviews_count": 60
}