{
    "name": "Pascalou",
    "place_id": "ChIJaZdHxaNYwokRC5nuEnKTBeM",
    "grid": "MN8",
    "address": "1308 Madison Ave, New York, NY 10128, USA",
    "rating": 4.4,
    "user_ratings_total": 467,
    "phone_number": "(212) 534-7522",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205cWRtMVhlVVZyY0VSdWNYaDZXakJLTlU5bGIzYxAB",
            "text": "Charming little place.  Loved the Thai Vegetable bowl added shrimp and with a Loire white.  Yum!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSWFNEUjBkMmRDUW1sNFNYWk9kWFpoT0dOTlZVRRAB",
            "text": "It was one of my best food experiences ever!\n\nEvery meal we tried was gorgeous and was above our expectations every single time.\n\nSmall, cozy, charming inna nice location. Creates an impression you are indeed in Paris in one of its very nice and secluded streets. Only occasional nyc firetrucks disturb this serenity at times\n\nDeserts.... So amazing. We tried Grand Marnier Souffle and chocolate mouse. With a bit of cog iac and rum inside. Delicious"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JeWVGQklPVW81YlVnM1lYcERkRUp3UTNGSmJVRRAB",
            "text": "Had a reservation for 4 Saturday at 7:15. When we arrived, no table available. Very disappointing."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKeGFGQkNTMFZuTTNSU1dtc3dTMUoyVFdoUlpuYxAB",
            "text": "Loved it! Will definitely come back! Good prices, too."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjMFYwWlVRblpNY0hKalFrbzVRVU5tUkRoM2FIYxAB",
            "text": "I have heard the name Pascalou a few times in the past years but have never had chance to explore the restaurant myself until last week when I had to pick a restaurant near the Guggenheim.\n\nIt’s a lively small space. I enjoy reading on their website about chef Pascal’s love story in result of this restaurant.\n\nThe Grand Marnier Soufflé was a master piece. We had the Lamb Tagine and some other dishes from the day’s specials.\nThe servers are ok but we have no complaints.\n\nIn general, it’s a nice neighborhood restaurant that worth trying out."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMmNHWXlVVmhwYWtzM1ZXMW5lbTFMWW14cGFFRRAB",
            "text": "The salmon on my Caesar salad was undercooked and tasteless. (I had requested fully cooked.) On the plus side the Grand Marnier souffle was wonderful. The service was good. Sitting on the sidewalk was fun. Beware- bathroom is up steep steps."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKQ2NYbFlZbWhoWkhvMmF6SjZURXhIVkVkeVNsRRAB",
            "text": "What a charming and cozy French spot! The atmosphere is intimate and inviting, and if you head upstairs it feels even more authentically French than downstairs – almost like a little escape to Paris.\n\nThe staff were genuinely friendly and attentive, adding to the warm experience. The food was excellent: the lamb was perfectly prepared and full of flavor, and the chocolate soufflé was simply exceptional – worth the visit on its own. I was also pleasantly surprised to find they offer proper coffee options like latte, cappuccino, and even decaf, which rounded out the meal nicely.\n\nIt is a bit on the pricey side, but for the quality, atmosphere, and service, it felt worth it. A wonderful place for a cozy evening out."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KZlNIZzFSM0JPVFdOWE5UUXdhMng0UkV0Q1JVRRAB",
            "text": "We were a couple that came in for dinner. A cozy place with a good atmosphere. Food was delicious, service a little bit slow, but the place was very busy, so understandable. The French onion soup and the lamb chops were the best."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdGFYUlhZM2xvY1d0VU1Ua3dlVXRNVEd0emMzYxAB",
            "text": "I have tried this place in the past, mostly breakfast,it was excellent\nIt's probably under new management now,and it's a disaster\nAfter tonight dinner I'm done for good\nWe have waited for our order for over an hour,and when I asked the waitress, what caused the delay,she simply said: \"they lost your order ticket\",no apology, nothing\nThe food is less than average, service is below \"0\".\nIt's not worth trying, because they just don't care and they don't even try to make it right, their response to negative reviews is \"I'm sorry\", nobody offers the solution.\nNot recommended at all"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toaVkyVnJWekEwYVdRemRYUndTa0ZsVkhwaFVGRRAB",
            "text": "Outstanding small French restaurant in the upper east side. The place is cozy, the service is friendly, and the food is outstanding. Pascal is a very dedicated and talented chef. My wife and I go there for dinner regularly, and always leave with a smile on our faces. Highly recommended."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxNVRsb3RiMmRpTVVSNFptTmtjSGh2UVhSemNYYxAB",
            "text": "So good! The duck confit was better than any I tried even in France. The new pear and Roquefort salat are as delicious too."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOR1FreFRielZDWldSYU5YUXdlbU5EVWpWNlEzYxAB",
            "text": "Had a great lunch and cocktails with friends.  Wonderful wait staff.\nI'll definitely be back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKV1pGTjRRakJuY25BMlJETkpZMHRrY1cxSGRrRRAB",
            "text": "Nice cute street seating, watermelon special was great, really like their Greek salads. Brunch was more average but still a good place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUlVtOXlSMU5PTkVOT1dsRmhTMkp5VG01V1QzYxAB",
            "text": "I felt like we were in Paris for the night. Very cute and authentic French restaurant with especially good seafood! We had a small baby with us and they were so nice about it"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxaWVGUmpZM0V3U1UxT1JYVnlMWG8yWTNadlRVRRAB",
            "text": "Good food. Seafood risotto was excellent. Beef bourgingon was good, not great. Excellent espresso martini. Prices are very moderate."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKR3kzTFRlNnBtZVdBEAE",
            "text": "Flawless filet of sole, incredible salad to start, and perfect key lime pie for dessert."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLaTAtZlRONHVMMEpBEAE",
            "text": "I have many fond memories of this restaurant, as my father was a cook here. The atmosphere is warm and inviting, the food is consistently delicious, and the staff are exceptionally kind. I’m truly grateful for the memories this place holds, and I look forward to visiting again one day. Thank you for creating such a special experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNX3kxWURJamEzTjd3RRAB",
            "text": "Incompetent hostesses and average food. This place is not worth visiting"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvX0kydC1BRRAB",
            "text": "I was surprised to see that one can still find a restaurant (Pascalou) in the City that offers excellent food and service at very reasonable prices. I had mussels in white wine sauce, lobster ravioli, and Grand Marnier soufflé. They were all delicious. Portion sizes are huge. Four of us had apéritifs and shared a bottle of lovely French wine. Including a generous and well deserved tip we paid just over $100 per person. I recommend you stay in the main floor, upstairs is a bit too tight."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbklMOGdnRRAB",
            "text": "Great little French bistro."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOUx6dGN3EAE",
            "text": "I stopped by today in the rain for what I thought would be a quick bite. The lunch turned out to be one of the best I have ever had, and I lived many years in Paris. The carrot soup was incredible and a simple croque madam was sublime."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3aUl1MlJREAE",
            "text": "It's such a cute, authentic cafe. Great atmosphere,  delicious food, and amazing service!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdTZma3lBRRAB",
            "text": "front door is open, so if you dine in first floor, there can be a cigarette smell. but expect that, everything is good."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnX3RQdnF3RRAB",
            "text": "Food was fantastic but they’ve gotta hire more people for dinner service cuz service was slow and it wasn’t the servers fault."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMHZqTFdREAE",
            "text": "Small French theme restaurant with decent price. My appetizer is mango pear and prosciutto is pathetic. The presentation is so bad , I can do it myself at home, they cut fruit in big slices and place on top of a bed of lettuce, prosciutto on top. No sauce no nothing, and it wasnt cheap, $20ish, “Bro i can do it myself at home better than this”. But I love the main entrees duck breast and lamb chop, well seasoned, tender with amazing sauce. I like the Italian red wine too. Our raspberry melba is great, fun texture."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBOGRHWm9nRRAB",
            "text": "Review: We had an incredibly shocking experience at Pascalou on February 7th at 5:30 PM. Upon arrival, the staff first claimed they couldn’t find our reservation, then suddenly changed their story, saying there was a \"mistake\" and our reservation was actually for 6:30 PM. Despite this mix-up on their end, they told us that since we were \"too early,\" we could only have a table for one hour (5:30–6:30 PM) because they had \"so many people\" coming—yet the restaurant was nearly empty, with only one occupied table.\n\nWhen we questioned the reasoning, they dismissively said, \"You don’t need more than an hour for drinks anyway,\" and \"the longer you talk, the more time we were wasting from the reservation\". At that point, we decided to leave.\n\nI have never encountered such rude and unprofessional staff. Their attitude was dismissive and condescending, and the lack of basic customer service was appalling."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBOHBfdEZBEAE",
            "text": "We made a reservation but were refused a table and than forced to leave within one hour, worst service ever. Waiter was aggressive and rude (feb 7 2025). I used to love this place and have been here many times with friends, the people working here used to be very friendly but they hired new personnel."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfaGJ1ZUt3EAE",
            "text": "Fantastic local, neighborhood place for great food, fantastic service, and great atmosphere. A real gem."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOE5pZXJ3RRAB",
            "text": "French onion soup simply delicious.\nYou’ll really enjoy the smoked salmon deviled egg appetizer. The presentation of this plate can be improved, but the quality of the ingredients truly stand out.\n\nHost was friendly and welcoming.\nLoved it."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbF83R253RRAB",
            "text": "My wife and I are new to the neighborhood and we’re looking for a good local restaurant. Fortunately we stopped in for lunch one day last week. Lunch was a real treat!  The food and service  was excellent and we look forward to returning to Pascalou."
        },
        {
            "date": "수정일: 10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdTRmdUx3EAE",
            "text": "Excelente lugar es una comida muy especial la atención es espectacular. Si quieres ir a un lugar con comida francesa este es uno de los mejores De esta zona aunque yo no tomo mi esposa Sí y el pino estaba espectacular. Postres entre lo tradicional y lo moderno, pero exquisitos."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBamVqYWFnEAE",
            "text": "We've come here for years and never been disappointed. The food is delicious. Period."
        },
        {
            "date": "10달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dWJQQnpBRRAB",
            "text": "Meilleure mousse au chocolat du monde et je m’y connais\nÇa donne le moral\nUn petit endroit bien sympa"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQOHJiMDRBRRAB",
            "text": "If I had to compare it only to American restaurants, it might be 5 stars. However, I've definitely had better experiences in this price range elsewhere.\nTo begin with, I was offered the complementary \"bread and butter\" experience. It was a single piece of Baguette and plain butter. It reminded me of Italy, because the bread was pretty stale and I wasn't sure if it's just a gesture or for actual consumption. A disappointing start.\nI ordered a glass of wine, grilled asparagus, and duck confit. The asparagus was spot on - perfectly cooked and combines well with the pastry. The duck confit was too American for me. Once again, perfectly cooked, but too much of what tasted like sweet BBQ sauce, and too little mustard (which was excellent) on the side. The mashed potatoes were OK and the sauteed vegetables were a kind of bland afterthought.\nThe service was good, and I almost gave it 5 stars, but once again not perfect.\nOverall I must say I had a good time, but I expected more. Might come back to try again."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzOHEtVExREAE",
            "text": "Excellent service and food.  I would have preferred better acoustics so that conversation would be easier."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzLV9LOWZREAE",
            "text": "Have been going here for years.  My favorite upper Eastside restaurant.  An off the grid local place that feels special.  And not noisy like most restaurants these days.  Very relaxing & cozy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdlB5OUdBEAE",
            "text": "Three of us met for dinner. I had made a reservation for a specific table which they honored. Very nice!\nMy friends chose Duck Confit and Lamb Chops for dinner, while I enjoyed my favorite, the Seafood Risotto. Everything was cooked to perfection and was delicious. For dessert we wanted to try their special Grand Marnier Souffle, but it takes 30 minutes to make. Instead we chose the Chocolate Souffle, an outstanding dessert. It is served with whipped cream on top of coffee ice cream on the side. Would highly recommend it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYeGRhb1VREAE",
            "text": "Great place to go for dinner - small spot but with great atmosphere, food was great during my first visit there yesterday. I had fantastic french onion soup 🍲 and for main dish beef bourguignon with mashed potatoes and vegetables which was also great culinary experience.\n\nMusic played was also fit perfectly for this place 👌 will be back soon to try some other french dishes 😋\nMerci beaucoup 👍👌😋✨️✨️✨️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuci1ma093EAE",
            "text": "Pascalou has delicious, authentic and unpretentious food. The food, coupled with the warm and responsive service and the relaxed atmosphere, both indoors and outdoors, are what have brought us back over and over again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuck9xQjNnRRAB",
            "text": "Very good food, not expensive, good service, I liked it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueEtiZ1J3EAE",
            "text": "Service was extremely slow and food was average at best. The price is decent for a nyc restaurant. I think the rating is on the higher end because it’s not exactly an accessible location for food reviewers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIeXF1ZWJREAE",
            "text": "The food and drinks were really good and friendly staff. I will return 👍🏾"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIXzlleW9nRRAB",
            "text": "Variety, value, voluminous, and Very, Very good. Do not miss!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3b3ZqUWtBRRAB",
            "text": "Food was bland, I wouldn't come back. We were for lunch; I had an asparagus soup and short ribs."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiNk1DZkl3EAE",
            "text": "This was a charming authentic French restaurant. The best of well prepared, delicious food. The chef came to our table and asked “What do you like?”tp make personal recommendations. Can’t wait to go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMdHVxT01REAE",
            "text": "It is a lovely neighbourhood spot. I had the Polenta with a crisp top and with tomato pesto with prawns and it was delicious."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxN1BIRFNREAE",
            "text": "A lovely little gem with thoughtfully prepared, delicious food, and terrific service in an atmosphere that can help you imagine being on a French Rue."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcXF1QUNBEAE",
            "text": "I had a great dinner here with friends. It felt like a cosy neighbourhood bistro, the waitress was really good and the food was delicious. Overall it was a highlight of the trip to nyc"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMeXFQNGdBRRAB",
            "text": "The food was superb! We had roasted duck au poivre and beef bourguignon as entrees with escargot and asparagus bearnaise, and it was really quite delicious. I would absolutely eat here again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6aGR2RGZ3EAE",
            "text": "I was part of a birthday party so didn't order but it was nice and friendly."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVamR6eml3RRAB",
            "text": "완전 맛있고!!!! 가격도 적당하고!!!! 친절하고!!!!"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHMGNIQ0ZREAE",
            "text": "시푸드 팟파이, 에스카고르"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4eWZYRmF3EAE",
            "text": "French fusion with a bit of Indian twist,  super delicious food. Scalops had a great flavor and texture. Lamb in curry was savory. French onion soup was great, a bit unusual flavor, but it was really good, as was duck confit. The owner is a sweetheart and very courteous."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwaTdQT3R3RRAB",
            "text": "We came here for my mother's birthday and we loved it. The food was amazing. The employees were friendly and the place was cute. They had seafood, meat, vegetarian meals and more. My family loved it. I would defeniatly recommend this place if you are looking for a cute place to meet up with friends or family."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5aHNuOFhBEAE",
            "text": "The place is a little small but the food was really good. We did a full course and everything hit the spot. We had a lovely conversation with the couple next to us and we will return to order what they got."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlN29YOE5BEAE",
            "text": "The chocolate souffle is to die for!! I didn't have anything else because I was in the mood for something sweet and boy did this hit the spot! The staff was very friendly and the ambiance of this French restaurant is so cute. I also had an espresso that tasted wonderful and perfectly complemented my dessert."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVc056VFBBEAE",
            "text": "French restaurant. The food here was absolutely amazing, and tasty. The staff was courteous and attentive the entire time. We arrived just before the lunch crowd and got our seats but the space is intimate. I loved the place and would…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4cXFLU1lBEAE",
            "text": "Great restaurant. The food was really great I had a vegetarian ravioli which had a great taste.\n\nThe dessert was a browny with ice cream. It was light warm so your could immediately enjoying it.\n\nThe service was great and friendly, felt welcome there.\n\nI gave only 4 stars because they have limited vegetarian and vegan options"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsazl1NzB3RRAB",
            "text": "Food was absolutely delicious, the atmosphere is romantic yet homely, and the staff is incredibly kind. I highly recommend trying the beef tips here they are so delicious and we can’t wait to return in the future. My girlfriend tired the scallops and said they were also very delicious. Desert was also so good."
        },
        {
            "date": "5년 전",
            "language": "ja",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzcE5xSV9BRRAB",
            "text": "ブランチのセットを頼みました。\nバケットがほんのり温かく美味しかった。\nブランチにはミモザやブラディーマリーついてお値段良心的。\n料理は期待していたほどではなかったのですが、フレッシュ素材を使ってちゃんと調理しているのが伝わって来ます。\n子供メニューもあります。パンケーキが表面パリパリ中ふわふわで美味しいと思いますが我が子は半分以上残してました。\nサービスが良い。"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVdF96dGRREAE",
            "text": "Very cozy. Service was good and food was great. I had the crab cake and I was very happy with it. It was mostly crab meat (many places uses too much filler). It cam with an arugula salad that went very well with the crab. My husband had the shrimp Verde and was pleased. For dessert, he had the Tiramasu... Nice way to end the meal."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhOUp1WEpBEAE",
            "text": "Lovely place and within walking distance of many museums. Stopped there for a quick lunch - there is outdoor seating. The service was a little slow but not too bad, the food was good (I didn't like the side of potato chips) and it was overall a good lunch."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaa0otcUdREAE",
            "text": "Went for dinner, everything was lovely. The service was OUTSTANDING though. The food was very good. Will definitely be back when I’m in the neighborhood."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxaE5QNmJ3EAE",
            "text": "Beautiful neighborhood restaurant with an atmosphere that transported me back to my time in Paris pre-COVID. Stopped in for lunch and the food was incredible!  The employees were friendly, welcoming, and knowledgeable about French cuisine.…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbDhpQ2VREAE",
            "text": "I had high hopes for this place, given other reviews. However, my choice of a Croque\nMonsieur turned out to be a grave mistake.\n\nPerhaps the chef thinks a Croque Monsieur is a toasted sandwich with ham and cheese. In which case...wrong. (photo evidence of what they served me included.) Everything about their creation was wrong.\n\nIf you are claiming to be a French bistro, get the basics right."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBenRQZnR3RRAB",
            "text": "If you're looking for the authentic charm and amazing food of a cozy Parisian restaurant than this is your place for sure. The chef is a master and the ambience like stepping into Paris."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJM0lYZXJnRRAB",
            "text": "My mum took us for dinner here and it was fine. It wasn't extraordinary, but it wasn't bad either. It was pleasant and food was good."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZaEt5WmpRRRAB",
            "text": "As we're enjoying our fabulous dinner something catches our eye at the next table. We ask what it is. It's a giant Grand Marnier Souffle, if you want it you must order it 30 minutes in advance because that's how long it takes to make. We…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcnNtQUt3EAE",
            "text": "Small but really nice restaurant. The lamb is super good."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHbWZfVWFREAE",
            "text": "This place is very cute! I've tried the chicken milanese through Mealpal and is just very bland. I'll need to try out the other dishes to see if they're more flavorful."
        }
    ],
    "reviews_count": 70
}