{
    "name": "Lusardi's",
    "place_id": "ChIJVdduFL9YwokRGn2EFWZDLBs",
    "grid": "MN8",
    "address": "1494 2nd Ave, New York, NY 10075, USA",
    "rating": 4.6,
    "user_ratings_total": 316,
    "phone_number": "(212) 249-2020",
    "reviews": [
        {
            "date": "18시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSS1pWWnhWVlpvVG1GNlNEVkVSSHBpZEhsTlNtYxAB",
            "text": "This is by far the best Northern Italian Dinning outside of Northern Italy."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poVlQyRkdZM1ZtTWt3ME0yTm1SVjl3UzJObVlVRRAB",
            "text": "An Upper East Side institution. Always there and always reliable."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wb01IVnZVemc1YjFOTmMyWkJZVk00VlRNeFdFRRAB",
            "text": "Excellent in all phases"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21scmFtSmhZMHh0TjFOa1VFWnJVMkpSWW1ZMmNtYxAB",
            "text": "Superb Italian food and a great wine list."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcXRfOWFBEAE",
            "text": "One of my favorites Italian restaurants in the UES…..and there are many to choose from!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GR1NVdEtYMVZsUVhaME5uUlFkaTFzYlZWV1ozYxAB",
            "text": "Had a great time celebrating a birthday here. Attentive service. Food was delicious. Private comfortable setting. Will return"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aUlpFMXpZekJLUkhscU9VbE9hRXBhY1doMWVXYxAB",
            "text": "One of the best pasta that I have ever tried"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVGVDMVRTWEJtZW5scE4zSnpiVFZmYkZnMlVsRRAB",
            "text": "This is the best Italian restaurant in NYC. I’m a second generation Italian and this puts most restaurants to shame. Also affordably priced for the value. This is where my family comes for birthdays, anniversaries. My number one restaurant."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWbE9VbFdUbWRUYURod2EzZFpabEJqY0hkV1RtYxAB",
            "text": "Lusardi’s is a true gem on the Upper East Side — the food is exceptional, from perfectly cooked pastas to fresh, flavorful seafood. The warm, welcoming atmosphere makes it feel like a neighborhood staple, and the management is incredibly friendly and attentive without being overbearing. Whether you’re stopping in for a special occasion or a relaxed dinner, you’ll leave feeling well-fed and genuinely cared for."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJN292OFRpaFp1ZlBREAE",
            "text": "Our friend suggested we join him at  Lusardi's for dinner - what a great suggestion. This brother-run restaurant has been in business for 44 years, and they know what they're doing. Seemed like mostly regulars. Great service, food, and ambiance. Nice wine list. Lots of specials to supplement the menu. Everything our group ordered was great including appetizers and desserts. Fair prices. Highly recommended if you're in the Upper East End."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJMXV5N2NBEAE",
            "text": "Delicious food and outstanding service overall a great experience I'll definitely be back again"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJZjVvSUNFN01mVGxBRRAB",
            "text": "Atmosphere was lively and waiters were attentive enough.\n\nThe bill was around ~$240 with 4 drinks, a salad, a soup, 3 pasta dishes, and a chicken dish. The food was very disappointing."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOSElsSWYzNzcyWGJREAE",
            "text": "Really good food. Got the arugula pear salad was incredible and so was the spinach and mushroom ravioli and Mediterranean Sea bass. The smooth jazz Muzak or whatever lobby music they play really doesn’t fit the vibe"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZeHBfaFZnEAE",
            "text": "Friendly staff, but the food was mid (especially considering the nearby alternatives)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvXzZqelZBEAE",
            "text": "Food was good,"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3c3NxczN3RRAB",
            "text": "This is our go to place for celebrating or just a nice dinner. The food is excellent and the service is top notch. Cacio e Pepe is a must - home made"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRazk3dW13RRAB",
            "text": "Great experience! Food was delicious and the staff were extremely attentive. I had a large group for a birthday celebration and everyone truly enjoyed themselves. Thank you!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnd2FISVhREAE",
            "text": "The best service and food.  A neighborhood gem."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBdnFpa09BEAE",
            "text": "The best! Delicious! Our favorite! We love Lusardi’s and come here not just to eat dinner but to celebrate all of life’s moments. We choose Lusardi’s over every restaurant in NYC. Every time we are welcomed so warmly. We love Luis, our…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfNV9ySi1nRRAB",
            "text": "Cannot go wrong on any order.  Excellent Italian food. Wonderful staff and atmosphere."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfazRDdnpBRRAB",
            "text": "Very good food, great service, great wine menu.  Enjoyed it."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdVpxRm1nRRAB",
            "text": "We were very excited to go to Lusardis, as we read positive reviews.  What a disappointment!  The food is horrible.   The pasta is mushy and without flavor. The appetizers were inedible. The prices are inflated and the atmosphere combines stuffiness with arrogance.  On top of this, the servers were all rude and uncaring.  They all exude a feeling of superiority, while making sure that one feels unwelcome. No one even bothered to check on us, or ask why the meal sat uneaten on our table.\nWe finally left our uneaten food, paid the bill without discount and found another restaurant that understood customer service.\nI am not one to complain about restaurants, but my advice on this one would be to avoid at all costs."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdHJId3RBRRAB",
            "text": "Excellent Italian food that feels like it’s always been here and has never needed to change. Consistently delicious and superb service. Great for a special night out - doesn’t try to be “hip” - is just straight forward and good! Highly recommend the Rigatoni Cipullo, Tortelli In Salsa Tartufata, and the Pollo Tartufato (can you tell we like truffles??). Enjoy!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQaXE2Qm1BRRAB",
            "text": "There are so many amazing Italian restaurants on the UES (L’incontro, Italianissimo, Antonuccis, etc) right now, so don’t make a mistake and waste your money here. This review is late but I went here a while back and as our food was served, a huge cockroach crawled out on the table by my pasta! Instead of the manager apologizing, he simply had the staff remove the dish and thought that would be enough to make up for the ‘issue’. He even said ‘this is NY’…essentially, what do you expect? We were flabbergasted. Needless to say, I will never return. Eat at your own risk…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzOGJMcXJRRRAB",
            "text": "I believe the front house person and the majority of the staff are Italian, so good starting point.\n\nWe had the shrimp and butter beans appetizer, seafood pasta, special of the day which was branzino in white wine sauce. All was well-seasoned and just tasted great. The pistachio tart for dessert was chef kiss.\n\nThe staff was attentive without being annoying. Cozy atmosphere. Dimly lit.\n\nI would definitely come back here."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUdHFXb0Z3EAE",
            "text": "Simply the best! They make everything on-site. The staff and food are excellent! The atmosphere is charming. We go here whenever we are in the city, which never disappoints us."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcWNTd1VnEAE",
            "text": "Excellent food and atmosphere; service great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYaVlQYnhRRRAB",
            "text": "Had dinner w some friends, they remembered me from some time ago. Food was great, great drinks and friendly owners and waiter. Age in place was a little older but food was good and enjoyable. Need to replace the chairs as my butt was sore"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2LU8tTlpBEAE",
            "text": "So tasty Our reviews had over 36 million views this year.  super Great UES Italian that has been here forever.  Loved the meatballs and they had a ton of specials.  All of it was awesome. Especially the pastas.  The desserts were spectacular as well.  Check out the photos to see how great the food was.  She loved artichokes and said hers were divine.  Check out all of our reviews.  If we do not like it we do no review it so all of the ones you see are places that are fantastic.  Follow us if you like.  We had over 7 million views in 2021 and we thank you for that.  We don't get paid, we just love to eat.  Be sure to click on \"RobH\" at the top of this review to see all of them and to follow us if you like good food and shopping"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbG9PLVF3EAE",
            "text": "I found the atmosphere to be  gloomy and the food expensive and mediocre."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIMkstcFZ3EAE",
            "text": "Best place in NYC WONDERFULL PEOPLE\nWINDERFULL FOOD"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIb1BXSmZBEAE",
            "text": "This is my favorite restaurant in NYC\nThe food, the service is fantastic.\nI just love this place and recommend it to anyone who asked.\nKeep up the great tradition that you have thereon the upper east side.\nLove you guys 👍🍸"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3eWZPWXZBRRAB",
            "text": "Don't miss this place. The food was outstanding and the service supreme. Luis, the manager, treated my kids with enormous affection and care. They now speak all the time about wanting to go back there. It was just magnificent. Can't say enough good things about Lusardi's."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiaGFTY2RnEAE",
            "text": "Great restaurant, the food is always good and consistent. I highly recommend the endive salad.\nThe service is excellent starting at the door.\nIt’s the best restaurant in the city!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNkliSjNBRRAB",
            "text": "If you follow my reviews you know I am tough.  This was a pleasant surprise.  Ok. The waiters were a bit obnoxious BUT the wine, food was great.  The veal martini was very good but could have used more white wine.  The lemon brûlée was unusual and terrific.  This is definitely on my NYfavorite list.  FYI if you don’t want seniors+++dine after 6;30😉"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkbWZmWDNnRRAB",
            "text": "Wonderful place! The restaurant is like a well-oiled machine and has a warm and intimate ambiance. Servers always notice what you need even before you realized it. The dishes are delicious and impeccable — I opted for Linguine All' Ammiraglia, and the seafood was fresh, overflowing my plate.\nMy friends also praised the food highly. The Tiramisu was delightfully soft and creamy. Kudos for accommodating us during the busy Saturday night rush; however, booking in advance is highly recommended due to the bustling dinner hours."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUZ2MyV1p3EAE",
            "text": "Delicioso!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURENDUydVlBEAE",
            "text": "Great date spot. Good mix of folks here and some of the best service in New York.\nGet the pistachio tart!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREbllMTUx3EAE",
            "text": "cozy atmosphere, great wine. appetizers were also good, but pasta dishes were pretty bad. we tried three different pasta dishes and all three were dissapointing to say the least. cacio e pepe was legit terrible."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREb2RxVENBEAE",
            "text": "Great food, great service, great atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOOGR5dWJnEAE",
            "text": "Showed up early for an 8:00 pm reservation but the maitre'd made us feel very comfortable as we waited. Mushroom soup puree, sole in a prosecco lemon sauce and lamb chops were all on point. Meaning, they were exactly what they were described to be and tasted great. Our waiter was attentive and polite. The atmosphere was very nice as well.\nI'll be back!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3c3IzaG9nRRAB",
            "text": "A great place for classic Italian food, as well as a reliable neighborhood place.  The staff have all been there a long time and they are competent and friendly.  The food is reliable and tasty and the prices are, by NYC standards, moderate.  One of my favorite places in Manhattan - reliable and not pretentious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWcWNXc0p3EAE",
            "text": "Excellent food, good variety, service is very accommodating and cozy atmosphere."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURseTdmNVhBEAE",
            "text": "I love how warm and cozy the restaurant is.  It was extremely comfortable.  The wine menu is extensive and there are many choices.\n\nI had veal and it was good.  Not great, but good.  There was so much cheese on top (and not melted), that you really couldn’t taste the veal.\n\nI felt that the bill was a bit high, but that’s NYC."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsbnV5TEdREAE",
            "text": "This is the real deal for upper east side Italian\n\nYou will not be disappointed"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURseUp1YnVnRRAB",
            "text": "Took a friend here for her bday a year ago and have been dying to get back here. Just went tonight with my parents and it did not disappoint. I literally inhaled my lemon sole and tarfuto dessert. Staff is top notch! In a nyc world where experiences are not always consistent this experience is and was. I cannot wait to eat here again soon. Top Italian in NYC! A must go!\n🌟 🌟 🌟 🌟 🌟"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGemY2eGhBRRAB",
            "text": "Well established classic atmosphere with old-school character.  Food was good.  I had the veal meatballs for appetizer and rabbit stew dish for main.  Great group of people.  Active owner with Italian roots."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5N3VqeDZnRRAB",
            "text": "Love the service, host, food. Specials are a must to have."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1OE1uTFl3EAE",
            "text": "Quiet, we went just before their evening setting. We were treated like kings and queens with food deliciousness...\n\nThe house Cab was delicious as well.\n\nGotta go..."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNacXBfNkpBEAE",
            "text": "Finally I found a pet-friendly restaurant in Manhattan. Thank you guys for being there for us who need to be with the family and can not leave a 5 months old puppy. Good food, good wine list, perfect ambiance, super friendly staff. See you soon."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCcnF1RC1BRRAB",
            "text": "Excellent time over our relaxing dinner. Large And Delicious Appetizers, Meals, and Dessert. Worth the price to get hot food that was delivered hot! Full Bar and Many Reasonably Priced Wine Selections. Very comfortable and accommodating wait staff."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtNjZLdlR3EAE",
            "text": "Che Bello!\n\nMy wife and I found ourselves around the corner, bewildered, struggling to wrap our minds around the sudden and unexpected loss of our dear aunt.  We wandered in and this restaurant, the food, the atmosphere, the people - especially Dino - it all helped to heal our hearts and minds for just a little while.\n\nThere's no getting around the truly tragic backdrop of our visit, but this restaurant will forever hold a dear place in our hearts.  They treated us so wonderfully.\n\nIf we lived closer, we would be here every week."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNveUxDV2NREAE",
            "text": "What a tasteful and enjoyable experience ! The personnel was very welcoming and polite, and for once I felt like I was back in Italy. Menu is complete and everything looks delicious. I choose the seafood pasta and it was absolutely amazing.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpalp1cGZnEAE",
            "text": "Love the White Truffle Pasta and Tiramisu!! The pasta reminds me of Japanese ramen noodles (which is more chewy than regular Italian pasta I have tried).…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwOUlTVHlnRRAB",
            "text": "Good food, good service, the veal is amazing come try it out. You won't be disappointed."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnZ3BhX0hREAE",
            "text": "Best Italian restaurant on the Upper East Side reopened after the Covid-19 shut down, and we're very excited to spend the night there! Excellent service, atmosphere, & food and drinks! My absolute favorite Italian restaurant on the Upper East Side, if not all of Manhattan. Love the friendly staff. AA+++"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNaDcybnR3RRAB",
            "text": "The place is very nice a great place for a nice date or a night out with family and friends. Everyone was very friendly and the service was great! The food was very delicious. I would definitely recommend this restaurant.  I will be going there again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxb2NfczRBRRAB",
            "text": "slightly better than average italian restaurant, not up to nyc standards, did we catch you on a bad night?"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcGZEcXlBRRAB",
            "text": "Had a good meal and great service but I could not give 5 on the food as it was ok to good."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVcDYtSFJ3EAE",
            "text": "Delicious martini!!\n\nMy wine, butter, salt, pepper, spit, and ergergetated bread was truly fantastic! I highly recommend this restaurant. 10/10 would drink again.\n👍👍👍…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtaWR1NVZREAE",
            "text": "It was such an incredible experience. I have lived in the upper east side for 5 years and finally went into the restaurant and wish I had sooner. Our waiter, Louis, was so kind and funny! When my sister couldn’t decide on an entree, he said…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwaUx1YTVBRRAB",
            "text": "Lusardi's is my favorite NYC Italian restaurant and I've eaten in most of the highest rated. Whether I choose to sit at the bar or at a table, the service has been excellent. Over the last 20 years, I've probably eaten half the items on the menu. I keep going back because of the consistent quality of the food and service. I've never been disappointed."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZbWF2bG9nRRAB",
            "text": "Traditional Italian food in an updated setting.  You feel like you are stepping back in time.  The service is pretty good and the food is delicious.  The wine is very reasonable.\n\nThey are strong on pasta.  You can order it for your starter or main.  We had it for our starters and ordered mains.  Gotta say, the seafood pasta was delicious! Skip the duck, the fat was not rendered properly.....  The sauce was good though.\n\nThe prices are pretty reasonable too.  Give this old standard a try."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaEw2ZlVnEAE",
            "text": "Lusardi’s is a Wonderful, Intimate Dining Experience. Recently moved to New York and happened to stumble upon this Jewel of an Italian restaurant. Mauro made our dining experience extra special! We were so impressed that we ended up having them Cater our first party in our New York apartment with ten of our friends. They were punctual with the delivery, the food was AMAZING and every one of our guests were raving about the food. I would highly recommend Lusardi’s for anyone to try, you will most certainly not be disappointed. Nelson and Karen"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXbnJpTjhRRRAB",
            "text": "Elegant atmosphere where you can actually talk in a normal tone. The food is fabulous and there is plenty of variety. Portions are generous and well priced. It's ideal to dine with someone you care to actually converse with while enjoying great food and wine. The staff are totally professional with just the right amount of attention and they are able to offer great suggestions."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyLTdmR1l3EAE",
            "text": "The restaurant itself, the ambiance and food were great.  We were three friends out on a much needed night out.  One had pasta with truffles, the other a veal dish and I had the breast of duck.  We all raved about our dishes.  At end of night the waiter, as we're getting our payments together, some paying cash others CC, he rushes by table and grabs the credit cards.  Doesn't ask us anything, like: If we're ready? Do we have any instructions?  I had to call another waiter to get him back to our table ASAP.  He comes back in a huff, drops everything on table and rushes off.  We are completely shocked at his behavior.  I call this idiotic person back and tell him his attitude was uncalled for as he didn't wait for charging instructions.  I could go on about the rest, but I will end by saying management were lame as well.  What started as a nice night with good company and food, was overshadowed on a sour note, thanks to the waiter!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdE8ydzZnRRAB",
            "text": "I like Lusardi’s. I’ve been going there since the 1980s. Last time I was there however my mother ordered a glass of champagne, yet the waiter brought her Prosecco. She didn’t say anything, and should have. I ordered a glass of Chianti and was given some type of Tuscan blend that gave me the worst headache I’ve had in a long time. Our salad, however, was pristine and delicious. The veal was also very good. Lusardi’s is a nice neighborhood place. We just had a waiter that made some unfortunate assumptions that he should not have."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwaEl6QnJnRRAB",
            "text": "I was hosting a dinner party at my apartment and decided at the last minute to order food catered in. We are new to the area and didn’t have an idea where we could order a meal to serve that wouldn’t disappoint. I started researching the restaurants in the area and came across Lusardis. Based on the positive reviews we called and asked could we order a menu for 10 people to be delivered for the dinner party two days later . The manager , Marro (sp?) said to come over to discuss what we might want.  When we arrived at the restaurant he met with us and made some recommendations , specifically the spinach ravioli, the zucchini in marinara sauce , the veal and the salmon served over a spinach cake.  We decided to have dinner that night and the manager allowed us to order half portions of each dish to test.  The food was amazing! We ended up ordering a meal for the dinner party which we had last night.  Everyone of our guests complemented the food and asked “who catered the meal”?\n\nLusardis instantly has become our favorite restaurant! Great food, attentive service and an elegant atmosphere . Definitely the best Italian food I’ve had in Manhattan."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKLS1hUWFREAE",
            "text": "Food was alright. The whole dining experience here was spoiled by an arrogant waiter making us feel like he was doing a favor by serving us. Short responses, odd facial expressions and talking about patrons behind the bar. Please teach your wait staff about hospitality. What a disgrace. Will not be returning."
        }
    ],
    "reviews_count": 69
}