{
    "name": "Zabb PuTawn",
    "place_id": "ChIJ5-uwd7lYwokRW-Ib5rBBL-w",
    "grid": "MN8",
    "address": "1584 1st Ave, New York, NY 10028, USA",
    "rating": 4.7,
    "user_ratings_total": 420,
    "phone_number": "(212) 988-8800",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkSVpuaE5OazB0TUhka09GUk9ZVmRRVDNWRFNHYxAB",
            "text": "They have the most authentic Thai dishes that I have ever had. Their food never fails to impress you and I highly highly highly recommend Putawn for any Thai food cravings."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWFgxWXpOWEZMYmpKU1RtUnpZVlJCTlMxdGFsRRAB",
            "text": "Festival de sabores !\nUn ambiente tranquilo, relajado que tiene comida tailandesa de verdad. Nada pretencioso con precios que oscilan entre los 9 y 30 dólares. Mis favoritos : pollos con curry de coco y las costillas con jengibre y ajo\nTotalmente recomendado."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjNFRIbFhkbmhCVmxOc1JGUm5aMDVuUkZCRFNVRRAB",
            "text": "My worst meal in NYC so far. Several of us ordered the duck pad sea ew and were disappointed not only by the portion size, but also the duck. When I asked the waiter if the crispy duck was bone in, he said no, but unfortunately there were bones... and it was incredibly dry to boot! Definitely not worth an extra $8! Still giving two stars because the flavor was good. Overall quite disappointing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKU2RrbGhUaTF4UTBveVoyVlhiSHBNY0dkWE4xRRAB",
            "text": "Really tasty food and also great lunch specials. Service is also very friendly - grat place in Cobble Hill."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kM2NsSlNTSE5qVEd3MFkzTmFiVzU0Y3pGVGNrRRAB",
            "text": "Great Thai on the UES.  The chef has a Michelin star from their place in Queens. Consistently crowded, high-quality food."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzc2JXcFB3EAE",
            "text": "Another amazing meal where i feel like i am back in Thailand. Excellent array of northern Thai dishes, can't wait to return!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRGFXUTROMmRPVVdOQk4weG5ORTA0V1V4NVJtYxAB",
            "text": "Amazing authentic food, it's so much different than any other Thai restaurant that I ever had before. I'd come back to this restaurant for real authentic Thai food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0SVRDMURkR2R3VUdsNk0xZFhhRFZRWmxOU2FsRRAB",
            "text": "Everything I tried was delicious! Definitely coming back again soon!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPelV5LVB0dnVTR1R3EAE",
            "text": "Best Thai ice tea I’ve had!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLWERxdHFIc2U3bnpBRRAB",
            "text": "This Thai spot delivers excellent food with bold, authentic flavors. The papaya salad had the perfect spice level and was incredibly fresh. Service was outstanding—friendly, fast, and attentive. A great choice for flavorful Thai cuisine and a welcoming atmosphere."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZb2RLZHl3RRAB",
            "text": "Great Thai food!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZa3V2ZHdBRRAB",
            "text": "Tao was your sever, when was great ant really nice. The food was incredibly delicious — this is the true taste of Thailand! I ordered the som tum (papaya salad), and it was absolutely amazing. I really want everyone to try it. Also, I highly recommend the kuay tiew moo nam tok (Thai pork noodle soup). It’s definitely a must-try!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcFlXX0V3EAE",
            "text": "Solid neighborhood spot. I’m sure great for takeout."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvc2Q2Rkd3EAE",
            "text": "Quick service delicious food would come again"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMnBMZi1RRRAB",
            "text": "Came here for dinner and I could say that it’s one of the best Thai places I’ve been to. The staff is very accommodating and attentive. It was indeed a pleasant experience dining in Zabb Putawn.\n\nAlso, their Thai Iced Coffee is a must try!! 😋"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJb1lQakN3EAE",
            "text": "Read the reviews and was really excited to try. I got the pad thai, spring rolls, and karipap(curry puffs). Overall the food was not bad and did not make my stomach hurt. The karipap was very bland and I needed to add some salt to it. The spring rolls were amazing. The pad thai was mid. Would only reorder the spring rolls."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbjVpSEx3EAE",
            "text": "Amazing Thai food, highly recommended"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cWE3c1FnEAE",
            "text": "Truly a neighborhood gem! Delicious food, affordable prices, friendly service, comfortable environment. All my friends who I brought here enjoyed the food too."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfejdpaUtBEAE",
            "text": "Great food and good service. Had a big bowl of savory stew with some curry puffs, definitely coming back for more."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfajlleDVBRRAB",
            "text": "Wonderful meal. Highly recommendes!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNjVhTjd3RRAB",
            "text": "Fantastic food, great vibes, and super nice staff. Highly recommend!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2c2FldjRnRRAB",
            "text": "Came here last night and was so impressed by how delicious every dish was. I got the northern style pork rib stew and I swear it’s my new favorite comfort meal. The meat is so tender, falls right off the bone. The sticky rice with the stew was unreal. The service was amazing. Water was refilled as we sweat through the spice 🤣 If you can’t handle spice, I recommend getting mild. We were too ambitious and got medium. OH and the pork jowl. HOLY. It was life changing. Please get both. Thank you for such a great experience! My boyfriend and I enjoyed it a lot ❤️"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQNGVUUkV3EAE",
            "text": "I really liked everything i tasted and look forward to trying more of the interesting menu.  Much better than the average Thai place, cobble hill is really getting some outstanding restaurants lately, and this is another."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdDhHQzJ3RRAB",
            "text": "The best Thai food I’m recommend.I got Moo Ping , Tub Wan , Som Tum Zabb and Special drink the place very nice and cozy if you love Thai food come to check this Thai restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcEx1RmpnRRAB",
            "text": "Authentic, delicious Thai cuisine. Exceptional service. My favorite spot on the UES. Check it out!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcHZ2MkZBEAE",
            "text": "The pork skewers were excellent and the panang had the perfect amount of spice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYaW92OVBBEAE",
            "text": "Ordered the spring rolls, grilled beef and chicken over basil and rice. The grilled beef seemed to be cooked in a previous time, missing seasoning. The chicken plate was not tasty. Spring rolls were good. Service was good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudTRQS2lnRRAB",
            "text": "First time here was so much impressive, FOODS absolutely amazing every single dish I ordered was delicious can’t complain. I felt like I’m in THAILAND my country. All staff were very polite and friendly. Good atmosphere at the restaurant, it seemed hard to find delicious Thai food for me but this is the best place and best Thai food I will definitely be back to Zabb PuTawn whenever I miss my Thai Food. LOVE"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURueTZ6QWp3RRAB",
            "text": "This small neighborhood Thai restaurant is a hidden gem on the UES. Each dish is authentic and bursting with flavor—hands down one of the best Thai spots in Yorkville."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuZ05TV29BRRAB",
            "text": "This restaurant was amazing! It’s a little on the smaller side, but don’t let that deter you! The waiter was incredibly nice and attentive.\n\nI’ve had Thai food across NYC many times, but each time I’ve left feeling a little disappointed, like something was missing. However, this restaurant is easily one of the best Thai spots I’ve visited in the city!\n\nI absolutely loved the tom yum soup! Not only did it warm me up on a chilly night, but the flavors were impeccable. The soup was so flavorful with a wonderfully complex profile. At first, the citrusy sourness hits you, and as that fades, the umami and savoriness kick in, creating a delicious balance. The soup leaves a subtle hint of sweetness at the end, making me crave more!\n\nThe beef was a little dry, but the sauce more than made up for it! It was absolutely delicious, with a hint of citrus that cut through the fattiness of the beef, elevating the dish to another level. Normally, I’d get tired of eating beef over and over again, but the sauce kept me wanting more!\n\nThe green curry was also fantastic! The coconut milk added just the right amount of creaminess, not too heavy, but still rich and satisfying. There was a subtle sweetness that tied the curry together, balancing out the dish perfectly.\n\nOverall, this place is a must-visit! I truly believe it’s a hidden gem, and I’ll definitely be coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIeGVDTDhBRRAB",
            "text": "Zaab PuTawn is awesome. They have a fantastic lunch deal - pretty much any main on the menu for the regular price, but you can order two apps and a drink as well. I had a three course meal with a drink for eighteen bucks (plus t&t). That’s pretty much unbeatable.\n\nAnd the food was banging - hot and spicy. Had the pork rib soup (pic is not so pretty but you don’t eat photos, am I right?), with a small papaya salad, some veggie dumplings and a ginger lemon drink. The soup was tangy and spicy and meaty and delicious. I got sticky rice on the side which was a perfect complement to the soup.\n\nAnd the service was on point. The server had the kind of smile that just made you happy inside. I will definitely be back!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKN09Uc2lnRRAB",
            "text": "Follow-up review after 1 year: The lunch special at Zabb PuTawn remains a great value ($16.33, tax included). The soup and the crispy tofu were a good start to the meal. The gaprow (stir fried Thai basil with tofu) had a real kick to it. Drink was included and the iced green tea was delightful and refreshing.\n\nOriginal Review: This is a go-to, no-fuss place for flavorful Northern Thai dishes. The Pad Kee Mao (drunken noodle) is actually spicy, not pseudo-spicy as in other Thai restaurants. The Chinese broccoli was crisp and fresh, though the $5 up-charge for crispy pork belly is a bit much. Less successful was the Kanom Jeeb (fried pork and shrimp dumplings) which seemed a tad oily."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3X2JuNFp3EAE",
            "text": "YUM!!! Definitely recommend. Great service, fast, and beautiful restaurant! The food is delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3ek5MXy13RRAB",
            "text": "A delightful little restaurant with delicious food and amazing service. I got chicken liver skewers and Lao style soup - both of which were really quite delicious. I'm not usually an eggplant fan but the Thai eggplant in the soup has made me reconsider my stance on it. My waiter was very sweet and efficient, he even packed the to-go bowl for me. Very affordable as well - two drinks and food for under $50.\n\nDefinitely a different experience from the traditional central Thai food you typically see in restaurants in the US - give it a try!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bU5pdFFBEAE",
            "text": "Wonderful experience. The food was amazing and Poom and Luck, the waiters, were so kind. They gave great recommendations for what to order and the food was DELECTABLE. 10/10 recommend. The food came out quick too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUQ3bU5oRxAB",
            "text": "so good i love poom and luck they’re so nice they have the best service ever and they give me great recommendations on what to order. the food is top tier and i love this place. i will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMjhPSXdBRRAB",
            "text": "Love the northern food.  Very delicacy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiek1EM2dBRRAB",
            "text": "Food was really good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyeDlyRUlREAE",
            "text": "We tried a variety of vegetarian dishes and we very much enjoyed them.  Panang curry, pad Thai, spring rolls, and fried tofu all tasty and fresh. We'd get it again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMdjR6UkV3EAE",
            "text": "Best Thai in the UES.\n\nThe chef of this restaurant worked at a Michelin-star (2015) establishment in Jackson Heights. It's original location in UES just rebranded to Zabb Putawn. I didn't know this until I saw it posted on the wall.\nAmbiance (5/5): The establishment is pretty snug but there was plenty of choices for dine-in on a Friday night.\nService (5/5): The server was friendly and checked on us often. There's a 10% discount if you pay in cash!\nFood: The food was extremely affordable! But i think their online vs in-person menu is slightly off (more expensive now)\nPanang Curry (5/5): The chicken was tender and broth had loads of flavor!!\nKow Mun Gai: My friend had this and it reminds me of Hainanese chicken rice. The taste was identical. The chicken pieces were tender but overall expected for the type of flavoring."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMMV9fbTl3RRAB",
            "text": "Zabb PuTawn has turned into my first option for Thai cuisine, from the price to the quality is all worthy. One of the best Thai restaurants in New York City"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMMXVIekhREAE",
            "text": "Exceptional. Order the northern specialties."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROMEx5b2l3RRAB",
            "text": "Update: I’ve been eating here every other week for months.. and I’m so disappointed today. I ordered dinner which was crispy rice with soured pork. There was some stony substance in there. I’m not sure what it is.. but I couldn’t eat it. It was like sand everywhere.. This was disappointing. More than half my order was just lettuce.\n\nThis is the first time I’m leaving a review for a restaurant.\n\nThe first time I visited this place was a week ago.. We ordered quite a bit and every single thing was spot on! I am very picky about eating at places and this spot has to be the best Thai food in NYC.\n\nEverything that I had here has great flavors. The spice levels were fantastic!! Unlike most restaurants, they don’t cater to a white populations tastebuds.. the food is spicy but can be adjusted..\n\nI travelled from New Jersey to get here last night and even though I reached late, they still served me and patiently waited for us to finish the meal. The people are exceptionally kind here. I would 1000% recommend this place. I know good food and good flavors and this was definitely worth every penny. I think you ought to try this spot at least once because you’ll definitely keep coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6NlB1bzNBRRAB",
            "text": "Incredible, incredible food! The menu is a little daunting but there's something for everyone and staff is SO NICE they'll help you with any decisions and they were very attentive. Had a great dinner and will assuredly be back many times"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUeV8yczJRRRAB",
            "text": "Awesome food! The marinated raw blue crab and grilled liver was amazing. Fantastic, authentic flavors! The mango sticky rice was also super solid.\n\nGreat service, super welcoming, and pretty quick as well. Definitely stop by if you’re in the area!"
        },
        {
            "date": "1년 전",
            "language": "th",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqazhyeWRREAE",
            "text": "Ordered the following appetizers and entrees:\n\n- GRILLED PORK SKEWERS  หมูปิ้ง (Moo Ping)\n\n- DEEP FRIED FERMENTED PORK RIBS แหนมกระดูกหม (Naem Gradook Moo)\n\n- CHICKEN WINGS  ปีกไก่ทอด ( Peck Gai Tod)\n\n- BEEF NOODLE SOUP ก๋วยเตี๋ยวน้ำใ (Guay Tio Num Sai)\n\n- SALMON w/ TAMARIND SAUCE มะขาม (Ma Kham )\n\n- BEEF PAD THAI ผัดไทย\n\n- CRAB MEAT FRIED RICE  ข้าวผัดปู (Kow Pad Pu)\n\nEach order was flavorful and just the right amount for a group of 4-5 people and is a very nicely decorated restaurant!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMVpMUXVRRRAB",
            "text": "Absolutely amazing experience, I loved everything I had papaya salad, spring rolls, curry puffs, chicken curry noodles & mango sticky rice.  Service was excellent and love how calming the atmosphere is. I would recommend anyone that loves great food to come in. 10/10 will be coming back asap."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbGZIVlFBEAE",
            "text": "this place is amazing! the mango sticky rice is the best. the drunken noodles were so savory and the noodles were cooked to perfection. will definitely be back soon"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNqaHZjcRAB",
            "text": "How do you participate in Dragon fest and run out of product at 3:30 PM? With a commercial bowl full of sticky rice telling people someone prepaid for it. If you’d rather cater, don’t come to Dragon fest."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMjllVnhRRRAB",
            "text": "I’m so glad I found this spot on the UES! I’ve tried multiple Thai restaurants, and this one is the best! Food is delicious, fresh and authentic. The staff are so welcoming. Big plus - the restaurant is the perfect size. It’s cozy and intimate but still big enough to get a table. You can actually have a conversation with your friends and hear yourself think! 10/10 recommend checking this out for a great dining experience!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNk5XdXNBRRAB",
            "text": "Visited this past weekend twice and this place did not disappoint! I love Thai food and have eaten the real deal in Thailand. This is one of the most authentic Thai restaurants I’ve been to. The spice level and flavors really hit the spot. When the server brought out the 4 mini side chili powder and sauces, I was in heaven. 😍 The chef special papaya salad was phenomenal! Everything was delicious. Only minor negative was no meatballs in the noodle soups. Otherwise loved this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxc0tyQzJBRRAB",
            "text": "Just came here a day ago and absolutely loved it! So reasonably priced and the flavors are great - definitely worth checking out if you want a more authentic Thai menu and a nice variety of spice levels! Absolutely loved the papaya salad, curry puffs, spring rolls, and panang curry. We were too stuffed to try dessert but would've loved to! Well definitely need to come back. The restaurant is cute and cozy though maybe a teensy bit cramped. The noise level when packed is very tolerable so it still feels like you can have a nice intimate dinner with your group!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4Z3RUUjZnRRAB",
            "text": "A great authentic Thai restaurant in UES's restautrant row. Chef from Michelin kitchens bring you this great taste. The skewer were tender and juicy. Shrimp cervice with spicy salad a very interesting dish, along with the papaya salad. The crispy duck and khao soi really hit the spot. Mango sticky rice ended the meal in a sweet note. It's a small spot, but definitely worth a visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0MEpia25nRRAB",
            "text": "My dining experience at Zabb PuTawn was truly phenomenal. The food was delicious, each dish served was very fresh, flavorful, and had an excellent presentation. The staff were great, they were welcoming, friendly, and super helpful. The atmosphere was absolutely beautiful, it felt very comfortable and clean. Highly recommend!!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHX0l2NmpBRRAB",
            "text": "We came by again and I will upgrade my rating to 5. I think the Pad Thai was incredible with chewy noodles and long, seared strips of deep fried tofu. The pork jowls were crunchy and juicy, served with a fish sauce with a bit of a kick. It saddens me to say, but the dinner has incredible value, $54 for two entrees and an app, which is an indictment of how we are being fleeced elsewhere.\n\nWe had the fried fermented salmon and the pork belly rice. I think the food overall is close to being great; the salmon was amazingly crisp yet tender and juicy on the inside (cooked to medium ish). Overall, the food just seemed to be a bit on the dry side, and some of the garnishes like the cucumber slices were old and parched. For its supposed heritage, I think it can do a bit better. The Thai iced tea was excellent, with strong tea and not too sweet."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGeHV6SGtnRRAB",
            "text": "Cannot recommend this place enough- I LOVE Thai food and they have one of the most authentic flavors in NYC, the best in UES. Food delivery has always been smooth when I order from their website. My favorites are their pork skewers, curry puffs, crab fried rice, pad thai, pork laab, papaya salad, fried chicken, pork moo dang, iced tea, sticky rice! Everything is good can’t wait to try the whole menu.\n\nAnother thing that sets them apart is their service! I asked them if I can spend my birthday there and everyone is amazing, their service is top notch. They go beyond what is asked and they really enjoy helping. They ordered quality balloons without me asking them and decorated the whole place to make it look more festive. Very easy to talk to about food allergies etc. The whole place fit about 20 guests. Thank you so much I had the best birthday in Zabb PuTawn!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPeU9qRWZBEAE",
            "text": "I came here with a meetup, and the host host ordered the food for us. I. Loved. Every. Dish. The spice is perfect. Just hits the spot! The photos posted aren't even all of it. My favorite would be the Khao soi. Because that mellowed all the spicy dishes we had so I recommend having that after having a spicy dish. I like the crackling with jackfruit. The crackling compliment the spiciness of the jackfruit. Desserts! You must order dessert after having your spicy dishes! Again, I love the coconut with jackfruit. These two fruits go well together in ice cream! Lastly, the duck. I don't like duck as much but this dish blew my mind. I like the crispness of it. I didn't taste the gamey flavor so I was ok with it. If your in the Upper East Side. Have Thai food here. I heard they get packed so be sure to be there before they get busy."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzbWVmaDlBRRAB",
            "text": "All around an average Thai restaurant. They offer a value lunch deal but none of the additional options stand out. The teas are very sweet and definitely taste like there was extra sugar added. The papaya salad did not have very spicy sauce…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtZ29QSU5BEAE",
            "text": "One of the best Thai food in town.\nThe food is packed with amazing flavors. The spices are just perfect. From Somtum papaya salad, larb, yum, to all types of noodles (especially khao soy) and rice dishes  ( crab meat fried rice ) everything on the menu brought you to Thailand, and left you with such great happy feelings. A wonderful place for a hearty meal.\nThe staff is very nice and friendly. Can’t wait to come back again soon !!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHMHZqeXBBRRAB",
            "text": "very good and authentic thai food. we ordered medium spicy to accommodate people in our party and it has a good kick already. if you want the real deal and can tolerate it, definitely go full spicy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoX3JhRnVnRRAB",
            "text": "If I could have this every day, I would! My friend and I came in for dinner when I moved to the UES 6 months ago, and it was so good I had to come back to review. We ordered the Crispy Spring Rolls to share, and I ordered the Kow Soi Gai dish for main ($30 with tip). It was so delicious and I took leftovers home so made 2 meals of it! The service was also so incredibly kind and welcoming, made us feel super comfortable and were super attentive. Thank you!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbXZPS2hnRRAB",
            "text": "Had an early dinner with my niece who was just visiting from Canada and she loved everything we ordered ( So do i 🥰 ) the papaya salad  and the sweet rice with coconut for dessert were my favorite,  it’s phenomenal. Reasonable price for a such delicious dishes. Will definitely come back and recommend  👍👍👍"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKMHRLb3JnRRAB",
            "text": "Small restaurant with high quality food!!! Very authentically spicy. Also not very sweet (some Thai restaurants tend to go too sugary but this place is very well balanced!!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0aVktZUlBEAE",
            "text": "Upper east isn't known for restaurants but I can say there are decent thai selections.  And this place is by far the best one although it's more pricey. Don't go here just for standard dishes like padthai but try their specialty dishes.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2cU9pRkh3EAE",
            "text": "Zabb Putawn is rebranded with a new menu and reopened for indoor dining this month. They used to be a decent thai restaurant but now they are definitely one of our favorites. Their menu is now focused on northern thai dishes, similar to larb ubol.. one of our favorite places before they closed.\n\nWe ordered:\nMoo ping - a generous portion of 3 marinated pork skewers with a delicious dipping sauce\nSom tum kai khem - a variation of papaya salad with a salted egg. This was really good.\nPad thai - above average\nPork jowl - we liked this but we liked the moo ping better\nKrapow basil - ground chicken over rice. This was really good. I would have like my little egg to be runnier but still good.\n\nIf you can handle spice, go for thai spicy.\n\nWe will definitely be back to try other things on the menu. I would put this above a lot of the thai places in hells kitchen"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0cU82bVJBEAE",
            "text": "The food here tastes great and the service was stellar. The host welcomed us in and had some amazing lunch specials. The place is nice and cozy with a good quiet atmosphere. Definitely recommend the Pad Katiem Over Rice with any toppings, the fried Tofu Appetizers, and the Kow Soi Gai noodle soup."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtcHBPQ3V3RRAB",
            "text": "Definitely a true authentic Thai Issan restaurant. My family is from Laos & their food is close to home & delicious not salty like most Thai place where they overwhelm every dish with fish sauce. Zabb PuTawn's dishes were perfectly seasoned. I'm definitely going to return for some more tasty dishes. Zabb Zabb was wondering if they can make me thum tang - I would pay extra Lao style! Korp Chai\n\nSpring rolls - Delicious\nPapaya salad Lao style - Zabb Zabb\nChicken wings - delicious\nBamboo salad - Zabb zabb\nPanang chicken - delicious\nDrunken noodles- Zabb Zabb\nSweet sticky coconut rice - delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtdzlmS2dRRRAB",
            "text": "Friendly Thai hospitality, cute little store for a more casual meal.\n\nFood packed with flavors, the Pad Kee Mao and the award winning Pork Ribs Stew were the winners!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2a2JmNEp3EAE",
            "text": "My friend was totally insisting this is \"the\" best Thai ever. It was even better than eating in Thailand where I have been to so many times. Amazing flavorful authentic 5 stars taste with lovely service. I would totally recommend to all the foodies."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZMDhIM3NBRRAB",
            "text": "Their MANGO STICKY RICE!!\nGame changer!!\nIf you are crazy about Thai food like I do, you will notice only few places in New York does traditional mango sticky rice. Most of the Thai places in California have it. But This little place they nailed it!!!\nThis is the best Thai food I’ve had ever since I moved to the New York, it’s as authentic as it can be and super fresh.\nI’ve been having fever for three days and my nose/mouse are not functioning (you know what I’m talking about) but omg this is too good to be real!\nI actually ordered from seamless so I didn’t expect them to be excellent, but holy cow they are just too good to be missed!\nPlease enjoy your meal there and order the freaking mango sticky rice! (Mango has a function of stop bleeding so if you are a girl in your period please don’t eat it)"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrMDhUZ2lBRRAB",
            "text": "We had Pad Thai and Pad Kee Mao and we thought both were great. We could tell that the foods were made with healthy ingredients and appropriate recipes in contrast to many Thai restaurants in town that are often quick to merely put extra…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwN2FMM0lnEAE",
            "text": "Very reasonably priced and delicious. 11:30-4:00 you get complimentary appetizers and drink with purchase of entree. I ordered panang curry with beef and it was a great portion with the complimentary sides of veggie dumplings and tofu with veggies soup."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodUxLUDBnRRAB",
            "text": "It’s offensive how good their food is. My only regret is that I didn’t try them sooner. I’m very cautious about trying new nyc restaurants b/c there are so many duds (especially ues) and beyond that I’m extremely picky about se Asian food…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVeFoybDFnRRAB",
            "text": "Food was decent. Though the server got my order wrong and I ended up getting a more expensive order."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1OHN6aFd3EAE",
            "text": "Stopped in for quick lunch. Very very nice staff. Lovely meal. They co Vince’s me to try something new and I wasn’t disappointed!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcnNxVUpBEAE",
            "text": "Hidden gem in NYC. Making my mouth water. Original flavor. Love this place."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMybkl6MkJBEAE",
            "text": "Tailandés bueno en el Upper East de NYC.\nNos pedimos Pas See Eew y un Pad Kee Mao. Este último con un toque picante pero aceptable. El primero lo pedimos con pollo y el Mao con gambas."
        }
    ],
    "reviews_count": 77
}