{
    "name": "Boqueria UES",
    "place_id": "ChIJYwAAe79YwokRAzRYCHUFTJY",
    "grid": "MN8",
    "address": "1460 2nd Ave, New York, NY 10075, USA",
    "rating": 4.6,
    "user_ratings_total": 2071,
    "phone_number": "(212) 343-2227",
    "reviews": [
        {
            "date": "2일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aT2JHWkpWbXhQV2xGT2EwcHVkRXBUV1hneFIyYxAB",
            "text": "Boqueria Un destino gastronómico de alto nivel que ofrece cocina espanola\ncontemporánea con énfasis en menús de degustación, presentando interpretaciones creativas de ,  paella y platillos distintivos"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNlNWWk1aM1JDUjB4MVdscGxSRGR0U25kMGVuYxAB",
            "text": "Delicious food! Great service! Fantastic music!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUldqUTFiemxRY2tOR1pESk9aR0ZzYjNoVU0wRRAB",
            "text": "Derrick as our waiter was amazing! The food was good!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tScVYxbzFTMkpHVUVGMVNVRlFjbGd5V1ZkTWMwRRAB",
            "text": "JP was great and made my friends birthday extra special. Thank you!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxQmJYbHdZMEpNUjFvdFRHSjJNa2MzWDFKdVdGRRAB",
            "text": "Great food, can get crowded and loud at times"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcnVuZEh3EAE",
            "text": "There is just something so off at this location. I've been a few times before deciding to make a review. Boqueria other locations are some of my favorite spots, because food is consistently good, cocktails always good and attentive service that make you feel welcomed. This location somehow seems to not execute those things every chance I've given them. From the lack of service, to the bartender who doesn't even look at you much less speak to you, to the food being sloppy and cold most times. Won't be coming back and spending my money at this location anymore.\nREVIEW UPDATE*****\nIts the bartender during the day. He's terrible, have to beg the guy for a glass of water. I'm done."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ScWIxVlhSelp3VnpGWE5tazBhazlWV0dRM2NWRRAB",
            "text": "JP is an attentive, friendly, wonderful waiter!  Oh, ya, and we loved the food!"
        },
        {
            "date": "1주 전",
            "language": "bg",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wNE9VZDFkSEZTTUY5MFZWUnRia1pqVVhwQ05tYxAB",
            "text": "Awesome place!"
        },
        {
            "date": "1주 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FNFFXNVdlRkE1YjNkSGJqSnNaa3Q1YWt4eVpsRRAB",
            "text": "Service impeccable, ambiance chaleureuse et plats délicieux. Tout était parfait du début à la fin. Je recommande vivement cet endroit — une vraie belle expérience à New York !"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BM1lsOUZSRFpTUlcxME56SnNUMU5CYUhZME5rRRAB",
            "text": "Get them Brussels sprouts…. Actually get 2"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxV1NURk5aM2xRWjNaak5VbHpRaTFRYW1oSGVIYxAB",
            "text": "Very nice Spanish restaurant with variety of tapas."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205R1MxUkdSM1F3ZEhwR1pVOXVUakJvYkdkcVpuYxAB",
            "text": "Had an amazing time here with my friends"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SbmFtRmZZMlZ4U1VKdk5FaGtPRmhWVVVGb1JsRRAB",
            "text": "Solid Spanish tapas,  just wish the booth was more comfortable.\n\nSome of our food items were delayed because they had been sent to the wrong table.\n\nOur server was nice and attentive, maybe the runners were having a bad day."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRM1MwWTVPV1JMTnpCd1VFZFlOMGwyTjBzeFJuYxAB",
            "text": "Amazing service 👌"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKa05IUm9PVTVQVmw5b2NEQlNkVTQ1UkZOZk1HYxAB",
            "text": "Best tapas since Barcelona!\nThe lamb skewers were my favorite"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWmVVSXRiRmRQUkRWbk9HOTRhR0o0UkRKT1ZGRRAB",
            "text": "Their patatas bravas, bikini, and montado de bistec were amazing! I wasn’t a fan of their chorizo, but still a great tapas restaurant. Would definitely come back"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCYVEzbENVR1ZqVFZoWll6RjRXR2d0WVhneFFuYxAB",
            "text": "First time being at Boqueria Upper East Side, I loved the food and the ambiance. The service was excellent and I was well taken care of. I would definitely visit again more often, thank you!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwM1N6WndNMnBFUlVZd2RYWkZkMHhLTjNBd01IYxAB",
            "text": "So glad to find this charming restaurant! Great food, service, and ambiance"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKNVFsaG1SRzl6WW5OdlUzTlZVbUpHVVMxaVExRRAB",
            "text": "Fast and efficient service, delicious food and drinks."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GSUxVRXpNakYyV21GdE0zb3phVzVyTTFod1ZYYxAB",
            "text": "This is a restaurant where you get good service and food at the same time! The manager is very nice, and each dish is delicious. Happy hour menus are perfect!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxeVdqSTNiRWs1VFd4Rk5XdFVZVVJVVlRRMlJGRRAB",
            "text": "Would definitely come back!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pscVl6SnJlV2Q2YVdvNFJDMWthbTAyT1VOUVozYxAB",
            "text": "Best patatas bravas in all the land"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWlprSm9hako0ZERjeVdVdG9WVTl3WDBveVMwRRAB",
            "text": "Great meal"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFeWFWbEdiMEZ1YzFkT1pFdHRXakkzVEROUmRsRRAB",
            "text": "BOQUERIA is amazing!!!! I love them and dining at the upper east!! Best service. Such good care and such good food:)!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taSE5GcHJRbGxpZEc1M1VXZDVRVFJoWm5oNmRsRRAB",
            "text": "Amazing!!! Loved dining in, staff very friendly"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201ZlZITkhRMjFzWVRSb01uTTNZVGxHY20welpsRRAB",
            "text": "Good service, great food."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzemFGSkNVelZqV0ZvdFVHSlBZVzFyZEhZNWRHYxAB",
            "text": "Great spicy margarita and tapas! Great Spanish restaurant on Upper East Side!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CWE0zSmljSEYyTjNwV2EwdFFiRzgxVEVFeE9XYxAB",
            "text": "Best bar in the ues - food, service, ambience...everything is five stars"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWWRFTnlTRUYxWHpBd2VGQm9WMWxOZUVab2NrRRAB",
            "text": "My taste buds were so happy with everything I tried. The food was cooked to perfection. My reaction transcended language. The service team showed both politeness and careful observation. This place offers a special menu."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcHZiSGZBEAE",
            "text": "분위기는 나쁘지 않아서 연인들이 가기 좋은 거 같고 음식도 보통 서비스도 보통이었습니다."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWFNIUmxSM0Z4UzIxWmNsQlNhbFJvVlhkTldsRRAB",
            "text": "I have nothing but good things to say about this classy, elegant restaurant!\n\nFrom the preparation and presentation of the food to the fantastic Rioja and friendly, courteous and highly accommodating staff --  and A PLUS experience!\n\nYou HAVE to try it and won't be disappointed!\n\n(On a side note, but important one, the restrooms are very clean and beautiful.)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZd2QzSXZnRRAB",
            "text": "It's been awhile since we've been to this branch of the Boqueria chain {possibly before the pandemic) and food-wise it seems better than I remember it being.\n\nWe had the brunch feast which consisted of picking a total of 6 dishes for $29/person. Which, given the portion sizes of some of the dishes, is actually more than reasonable.\n\nI don't recall it being offered before but I'd definitely recommend it if you're here for brunch as it's a nice selection of tapas.\n\nEverything we had was excellent, the only minor quibble is that we asked for churros with hot chocolate, but they gave us Nutella instead. Hardly a problem though!\n\nOur server was nice and when we first entered the front desk lady overheard my wish to be seated at the front, which was great as it allowed us to be seated in a quiet corner away from the other patrons, allowing for a quiet experience. Always a plus!\n\nThe food certainly reminded us of our most recent visit to Spain. 😋"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSd2FXeHBUbmR2V2prMFYwWkJhakkwYjNZNWVHYxAB",
            "text": "I love Boqueria.\nI first discovered it while I was in Nashville for work and ended up going so often I basically became a regular for a month. When I got back to NYC and realized they had a location here too, I had to go, and it didn’t disappoint. Same great menu, same amazing quality, and the staff really know what they’re doing. So happy I can keep enjoying it here too!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJV0h1dVRhcWVUTnpBRRAB",
            "text": "Ordered a variety of tapas and every single one was excellent. The place offers great value for the quality—good prices and a solid standard across the board. I absolutely fell in love with their stuffed dates, highly recommend trying them. The atmosphere was relaxed and pleasant, and the service was friendly. I’ll definitely be coming back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjemJHRlZiWEkxTlZseVFuZE9kRVJEY1U5Q1dFRRAB",
            "text": "Camilla made our experience the best ! She is a true gem. The food as well as her recommendations were excellent."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLX3BsZHJMaE5teUFnEAE",
            "text": "This is a great spot for Spanish tapas.\n\nAtmosphere: the UES locations feels lively and fun. They have comfy booths and I really enjoy the bar seating if it’s just two of us.\n\nFood: they have a good selection of veggie dishes. I really like the pan con tomate, the bread is perfectly toasted and the tomato puree tastes fresh and simply seasoned. I also enjoy the croquettes. They don’t feel oily and I really like the filling.\n\nThey also have great sangrias.\n\nInsta: @TheShahLALand"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmenBhbnBnRRAB",
            "text": "This is my second time coming to this location. The FIRST time I went here last year, they \"placed my order\" through their iPad and we waited over an hour for our paella and tapas, neither of which came but we thought it was because the paella takes 45 minutes to make! turns out, our order never went through. Our server apologized and offered to bring out what we ordered free of charge, but we didn't have any time so we stayed a bit and got our tapas and drinks on the house. We let it go and still wanted to give them a chance in the future.\n\nOn Friday my partner and I came by again, and the tables were still too small for all of our dishes, made it feel a little cramped. Service was good, our waiter was kind and diligent, and checked in on us at the right times. However, the food was very disappointing, we got the $65/pp Boqueria experience, and the seafood paella was too moist and didn't have as much seasoning as I hoped it would. 2/6 of the tapas they gave us were enjoyable, but generally the food experience was very mid and felt whitewashed. Not to mention the \"dessert\" which was two tiny churros (one churro per person) and really watery chocolate dip. What is that? Why would you serve that? Overpriced food and experience that wasn't great. Won't come back here again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxVWRIRjVkWGcxVjE5WVJHTTVia0Z0ZFhsTFVXYxAB",
            "text": "This place is incredible with standout service! As soon as you walk in, Peter warmly greets you at the door with nice conversation. The food was absolutely incredible. So tasty and the cocktails were just as delicious. JP our server was also incredible and so knowledgeable. JP was on top of everything and provided outstanding service. I highly recommend this place. The food was paced out so nicely and nothing took long!! Must try spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyazdXRW9RRRAB",
            "text": "This place had an amazing deal for brunch! Got three person’s worth of food with $36 and it was more than enough variety.\n\nGood:\n- Every single dish was so tasty! Liked the sliders, the croquettes, and the churros a lot and French toast\n- really good variety and price value\n- Solid ambiance, very good for catching up in a semi private booth\n\nBad:\n- A little slow on service\n\nOverall would come again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFemVIbG1XbGxoUzJ4MlR6azNiM0F3UVVOeE9YYxAB",
            "text": "What a phenomenal tapas experience!  As you walk in you feel the warmth of the venue with the beautiful soft lighting, thoughtfully placed high-top tables and benches, and the open kitchen concept. My friend and I each ordered an Aperol Spritz.  The drink was flavorful, but a little sweet for my taste.  We then feasted on a spread of seven tapas. First came the Croquetas de Setas which were filled with a warm and delightful burst of chopped mushroom filling.  The Patatas Bravas are my old favorite: they are perfectly crispy on the outside and soft on the inside with a delightful aioli and tomato-based sauce.  The Ensalada de Tomates was the most refreshing dish with a delicious sherry vinegar reduction which added beautiful acidity to the dish made savory with the sheep’s milk and fresh herbs.  The Escalavada  was a wonderful nod to the Mediterranean culture of Spain , similar to a dish you might find at a Greek or Turkish restaurant, but instead of being served with pita or Turkish bread, served with perfectly toasted focaccia. The Zanahorias were very tasty, delicately cooked to tender, with the almonds as a nice touch of texture for the otherwise soft dish.  We then got another round of drinks.  My friend was pleased with his Dirty Martini, and I love the heat in my Shishito Margarita.  Our last set of tapas were the play on American bar food - the Iberico Mac n Cheese and Mini Hamburguesas. They were cooked well, but they were not special, only made Spanish by the addition of a lot of Manchego cheese in the burger or tiny little bits of Iberico to the Mac n Cheese, which were nearly indiscernible.  I understand that they would like to have something for everyone, but I wish I had saved my appetite for more of the other dishes which I had so enjoyed. We enjoyed top notch service led by Peter, the general manager, himself.\n\nOverall a fantastic experience at Boqueria that led to conversations of praise into the next day.\n\nNote - I have previously tried the seafood paella, and really enjoyed the seafood which was cooked to perfection, but found the rice greasy and soggy, and have happened to also have overhead others speak of the inconsistent rice.  Please see a picture of the beautiful presentation of it here."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmX1l5ekZ3EAE",
            "text": "Good vibe, nice ambience and delicious food.\nI’ve been to different Boqueria locations in NYC, but this is my first time at UES.\nWe went for brunch during Xmas week, had a pleasant experience and enjoyed our food very much.\nService was good, it’s definitely a reliable joint for tapas/spanish food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poZmNIcHRXbVUwVDNCeVZYRm5aVGx4T1hkUmNuYxAB",
            "text": "The restaurant ensures that each dish lives up to their name. You get excellent value with low prices and good food. The employees sense exactly when to offer recommendations. Their meals exceed normal standards. I want to come back before long."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOUlXa3RRRRAB",
            "text": "Our recent brunch at Boqueria UES was a mix of highs and lows, offering a fantastic ambiance and service but a food experience that left us feeling underwhelmed.\n\nAmbiance & Service:\nBoqueria truly excels in creating an inviting atmosphere. The decor, lighting, and music set the perfect tone for a relaxed yet vibrant brunch. The comfort and noise level were spot on - lively without being overwhelming.\nThe service was impeccable; our server and the entire staff were professional, courteous, and attentive without being intrusive. It’s always a pleasure to dine somewhere that prioritizes hospitality at this level.\n\nThe Food:\nThe Good:\n•\tChoripan – The chorizo, garlic allioli, and salsa verde were flavorful, and the combination worked well together. However, the brioche roll was a bit dry, and the toppings leaned towards the oily side.\n•\tMatrimonio – A wonderful mix of boquerones, salt-cured anchovies, piquillo peppers, Kumato tomatoes, and sherry vinegar reduction with fennel pollen. Served on toasted sourdough, this dish improved with every bite and was one of the highlights of the meal.\n•\tTorrija – A showstopper. The crispy French toast, stuffed with sweet mita crema and topped with blackberry compote and maple syrup, was a hit with everyone at our table. Rich, indulgent, and perfectly balanced.\n•\tPatatas Bravas (from Dos Huevos y Más) – Crispy, well-seasoned, and satisfying. A solid execution of this classic Spanish dish.\n\nThe Not-So-Good:\n•\tDos Huevos y Más – I ordered my eggs sunny-side up, and they were cooked well. The patatas bravas and salsa verde were enjoyable, but the bacon was disappointing - reminiscent of supermarket quality, which detracted from the overall dish.\nSimply Disappointing:\n•\tHuevos Estrellados – This dish fell flat. The shoestring fries, truffle potato cream, Jamón Serrano, and fried egg combined into a bland and uninspired plate that lacked any real depth of flavor. The Jamón Serrano tasted like it came from a supermarket, and the truffle potato cream not only lacked truffle flavor but also unfortunately caused my wife significant stomach issues afterward.\n\nFinal Thoughts:\nWhile the atmosphere and service at Boqueria UES were top-notch, the inconsistency in food quality, especially with dishes that should shine in a Spanish tapas setting, left us disappointed. Given the wide array of Spanish tapas options in New York City, I don’t see myself returning anytime soon - there are simply too many other places to explore that may offer a better balance of quality and experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3cWNyMGRnEAE",
            "text": "Ordered from the tapas menu for Sunday brunch. The place wasn’t all that crowded. Except for the reed-y asparagus, the plates were great. The surprise of the day was the orange seasoned anchovies on homemade potato crisps. (Yum!)"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNHNHd3FnRRAB",
            "text": "Great place for happy hour, singles and couples/parties! The food is amazing and the drinks are tasty.  Very easy to come in and just hang at the bar eating happy hour tapas. Would definitely come here again"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214eVZuRjVkbEp1Y0dGNlVXaFpkbVJYZUZCa2JGRRAB",
            "text": "We come here at least once a week and we love it. Food is amazing and so is the service. JP is awesome. Also Peter the manager is absolutely so nice and makes us feel like home every time. I strongly recommend you come in a try. They have nice lunch specials and amazing dinner menu. Also wine list is very well written and has some hidden gems."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzLUpISmdnRRAB",
            "text": "Bottom line: OK food, good vibes, not super well run, but could be much worse. Could do better for the price\n\nFood: Average, nothing special: every plate we tried tasted a bit like home cooking, very one-dimensional, but not bad.\n\nPaella was below expectations: bit soggy, not quite crisped on the bottom, but still tasted burnt. Very light on the saffron. Shrimp was not fresh. Paella is treated (and priced) almost like their specialty, but executed carelessly\n\nDrinks: not well made but seems to use high quality ingredients\n\nService: Below average\nOur waiter may have been overwhelmed by a large party and forgot to take our order, but one of the managers(?) noticed and ended up picking up the slack. Service noticeably dropped off when the manager's shift ended\n\nOverall: food had some chain-like qualities, service may be dicey, atmosphere is on the loud side, dark and moody"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tscVdITXRkSGN0WDFONmFGVktSSFZLU1hoSFJVRRAB",
            "text": "When you find yourself in the upper Eastside of New York there are many choices.But this is a fun one.They have good food the service.Was very nice and very attentive.It's a little bit crowded but then what is not in new york so it can be noisy 😀 but I think it's part of the ambiance.  I went there with my aunties that are older and they were treated like queens , which obviously they love. The food was pretty good, nothing I would say remarkable about it but good!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sU2QwMXhOVEJOUnkxTmFuQm1WMDh4TjBSTldVRRAB",
            "text": "Boqueria is amazing—this was our second time, and it did not disappoint. Cozy atmosphere, with elegant high tables, and the best way to try a variety of dishes is the Chef’s Menu. Everything we tried was incredible, including the red sangria. The staff is friendly, attentive, and makes the whole experience seamless. Highly recommended!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBcmJ6YzRRRRAB",
            "text": "This was a good meal! The shrimp, lamb skewers, and the eggplant were my favorite dishes! The olives were super salty which I actually liked but could see it being too salty for others. Service was good. It was busy on a weeknight so I definitely recommend a reservation."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WbE1XUm5PVkYyVGtseVIycFRaRlpoTkZOdlpsRRAB",
            "text": "Was looking for lunch - found based on rating.  Place feels like a chain - like Cheesecake Factory for Spanish food.  The tortilla Espanola was very sulphary and the dates were skimpy - thin bacon - and had very little flavor.  Service was good - people seemed to care.  This a place I wouldn’t go back too. So many great option.  Someone needs to tell them to leave the management consultants behind and go back to making good food.  This is all for the profit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubmQtQjV3RRAB",
            "text": "We stopped in on a rainy Saturday afternoon on our way to an opening at the MET.\n\nSeated immediately at the bar.  A few glasses of red wine, tomato bread  and sautés shrimp.\n\nPerfect to hold us over until dinner!\n\nFood was great, we’re coming back for a full dinner!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNid3ZHOUpBEAE",
            "text": "Pete the manager is an amazing person when I first walked in he greeted me asked me if I needed help with menu and introduced himself this is why in about 2 months I have been there 7-8 times I love this place for lunch they have a killer happy hour Monday through Friday 3-6pm and weekend 4-6pm. He even as a great staff there Ricardo Nelly and jimmy are fantastic. Must go"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVVprVlRiRFZLVkdwVWVEUkZXa3hDV0hnNFRHYxAB",
            "text": "Their attention to customers ensures a pleasant visit. The serving proportions show good judgment. I question if I dined at the same Boqueria UES as other reviewers. Workers showed kindness alongside knowledge. This spot has earned another visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydnVhVmhBRRAB",
            "text": "It was a great place to eat and just to have a romantic dinner. Our server was great as well. We started with the appetizer which it was mushroom croquette delicious and creamy. Then we have las patatas bravas. Nice and cruncy with the amazing sauce. Then we have the amazing gambas, the shrimp and the sauce were so delicious. My boyfriend wanted more bread to eat the sauce. Then we have the flat bread with with onions and manchego cheese and goat chesse. That was so delicious. Then we have the thin noodles with squid a la tinta. That was really good definitely recommend it. Overall great place to eat and the drinks were also good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4ckllQTJ3RRAB",
            "text": "Everything was really good. The Vermouth wine was excellent. One of them was less sweet and we ordered that again. The staff were friendly but the tables were too close to each other! We have to move the table to pass by! I know restaurants in New York pack people like cans of sardines, but this one was too packed!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJMk5WTk9WM1pDV205S2NsUjNZVTVFYWpjNGJWRRAB",
            "text": "The restaurant's decor adds value to the dining experience. The workers delivered exceptional assistance. Their dishes showcase culinary expertise. Boqueria UES never lets quality standards drop. May this place meet your needs."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlMWQySUNREAE",
            "text": "Eh. Not impressed. I came here after reading all the great reviews and the food was nothing to rave about. Maybe I’ll try something else next time. But the food I got was not that great. Portions were very small. Patatas Bravas was completely burnt to a crisp. If you are looking for a good Spanish restaurant, I would go elsewhere. There are many other great ones in NYC.\n\nAlso, seating was very very tight. At one point, I was shoulder-to-shoulder with the other guests next to me.\n\nAnd on top of that, service was slow."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyLW91LXl3RRAB",
            "text": "OMG! I had the absolute best dinner here. We had called last minute and they said they had seating at the bar or looking over the kitchen. We went with the seating overlooking the kitchen and wow were we in for a treat. We both got the tasting menu, and they were extremely accommodating to my dietary restrictions. We were able to see the food being cooked from start to finish by the team. Then the best part of it all - the entire meal was served directly by the !! executive chef!! and explained every meal, what was in it, and the modifications that were made. I had the absolute best time here and I cannot wait to go back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTWVGUmtSek5GTVVSVFpVcGpNRVJmTlVSTVRtYxAB",
            "text": "Food is terrific and service is excellent. The waiter comes to your table and recommends ordering a paella early as they take ~45 minutes, so they recommend you order the paella before the tapas so you don’t have to wait an over an hour between tapas and the paella. The paella can feed ~4 people."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtd28tdTZnRRAB",
            "text": "The service was great & the server gave great recommendations. They had a special where you could get an appetizer, two plates and a dessert for $35, so one of us did that and the other one got small plates. The lamb skewer was by far my favorite. The bread literally melted in my mouth. The patatas bravas were well seasoned. Would definitely love to try more in the future!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pndFQza3RTMUJFTTBjM2JrVnllV2xvVVRCWk5rRRAB",
            "text": "My husband and I have been coming here for over a decade. Its our favorite! Its like they cut a charming part of Barcelona out and stuck it right here in SoHo. So truly authentic and fun and delicious. The Paella is insane!!! Better even than some places in Spain. An excellent time- EVERYTIME.\nSo happy to know you"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxa05QSFdREAE",
            "text": "Amazing food, atmosphere, and service! First time having tapas and loved it. Would highly recommend the salad and the dates with bacon. The paella was good too, the seafood on top was delicious, but the rice could have been more flavorful and crispy. But otherwise had a great time"
        },
        {
            "date": "2년 전",
            "language": "it",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSd2RLSEdBEAE",
            "text": "Alcune tapas molto buone come patatas bravas e tortilla o pan con tomato. Le porzioni sono abbondanti, due tapas bastano. Purtroppo invece la salsa sulle croquetas de jamon peggiorava il piatto e le polpette erano molto pesanti. Il locale è carino ma l’aria condizionata è fortissima. Servizio cortese e costo corretto. Se andate a pranzo consiglio menu pranzo."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTlRYVlhRa3RYUVdKR2VuSnJZbE5zYm5wblIwRRAB",
            "text": "Love this place! Donny, Jose, and all are wonderful! Food and drink will make you want to return as we have!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkNWJXdFdWbHBTZUdScGIzSmZZa2xyT0ZwVFRuYxAB",
            "text": "Ceasar salad was amazing - Christy was such a great server!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kMWQzazRjemw0VTFWQ1lVdENkbXhGVkd4RFpHYxAB",
            "text": "Our second time here.  We tried several new dishes this visit and, like last time, the food and service were superb.  As I said in my previous review, I feel like I am back in Barcelona when I dine at Boqueria.  Highly recommended."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1MDdDQ1dREAE",
            "text": "Came here again with a friend this evening and it was terrific! If you can get in for the happy hour pricing (it goes until 6pm) it's a great deal on food and drinks and I loved my seasonal sangria (it was a pineapple mezcal situation). The food was great! Obviously easily-shareable portions and a delicious medley of flavors. On the main menu, I'd highly recommend the bacon-wrapped dates and the lamb skewers. That being said, there's so much more to try for the next time I'm back! Highly recommend the churro split - delish!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURab2FDSnZRRRAB",
            "text": "I’ve been to the other locations, but this UES location lacks in comparison. It feels like the decor/ambiance was an afterthought and it’s not as clean as the other locations. Their high-top chairs are too narrow and we kept sliding off. The food and service were good, though. Their pitcher of rose sangria was horrible—do not get it. I highly recommend their gambas al ajillo, seafood paella and both croquette’s."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNeTdxa2p3RRAB",
            "text": "Very delicious food! I was the first time here and I definitely love this Spanish place! Sangria and the shrimps were amazing! But actually I liked all dishes we ordered 😋…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXcHJQcE1nEAE",
            "text": "It’s a cute cozy spot for a intimate night out. We really liked the paella- seafood was cleaned correctly, rice was cooked just right (not mushy), and seasoned well. The clams we got were also wonderful! We got a side of broccoli but didn’t…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdjRhMWdnRRAB",
            "text": "Unfortunately it was really loud and crowded, the tables are really small barely fit two plates on it, people are seating literally next to each others, we heard an entire conversation from the couple that it was seating next to us.. the food wasn’t that bad, but wouldn’t recommend the Fideuá."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHajdtcmhBRRAB",
            "text": "We walked in around 6pm on a Sunday and got sat almost immediately. The place was packed! We ordered “The Boqueria Experience” and were super pleased. The white sangria was okay. We put a small shot of simple syrup in it to balance it out.…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXekticG9nRRAB",
            "text": "Rose sangria was delicious. We had the patatas bravas, croquettes (I preferred the mushroom over the ham), roasted eggplant flatbread and the lamb meatballs were all very tasty. I wasn’t crazy about the brunch paella but the others really enjoyed it. We got the small paella size and it was just right for 3 people. The churros con chocolate was very good, but the churros were skinnier than I expected.\n\nWe sat inside, but there is a small enclosed outdoor seating area with heaters."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBNk9hTWFBEAE",
            "text": "food and service is below average. Lamb skewers were undercooked. Shrimps were swimming in fat and tons of garlic. Bread served with shrimps was old. Service was horrible. Three people were taking care of us. Nobody knew what we were eating…"
        }
    ],
    "reviews_count": 75
}