{
    "name": "Flex Mussels",
    "place_id": "ChIJt901K7xYwokRDN0HETz2x3s",
    "grid": "MN8",
    "address": "1431 3rd Ave, New York, NY 10028, USA",
    "rating": 4.5,
    "user_ratings_total": 1143,
    "phone_number": "(212) 717-7772",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5b1YzUmZZVnBTTlZkaVRHTmpVM0Z5V0RobWVsRRAB",
            "text": "Fantastic Oysters and Lobster roll! The fries were perfect, hot and crispy! Highly recommend this place for the food and exceptional service!"
        },
        {
            "date": "수정일: 5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGV2JGQkRUelkxT0Y5dlNWQnRaemRQY0RkUlRHYxAB",
            "text": "Absolutely delicious! The mussels are incredible, and the fish crudos are so good and so fresh. Lots of gluten free options."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSTVJGbzBZME40YjJSc1MyRTFSRkV4VlUxWFlVRRAB",
            "text": "Unreal happy hour for martini and oysters"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pad1VuTkdlRUpLV0hCcFEwTnVPSGxQWTNkRGNYYxAB",
            "text": "Great Atmosphere, service is good and very good Mussels.\nHappy hour time you can get oysters for $2"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWSlRtbE1hVUZ1Y2tWSlZEVnJiRlIzWjNWME4yYxAB",
            "text": "Kids friendly, Happy hours! The restaurant offers $8 small martini and $10 spritz. If you love to drink, you can go here all the time.\nCheeseburger sliders, fish tacos, and and creamy mussels were very yummy. They have plenty of spaces on the ground level and second floor which I both visited. I see small kids all the time here!"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLR2t4cTJzMHNqeW93RRAB",
            "text": "As always delicious every Saturday’s we try to go 😋😋"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVE5VcFVRMk41UXpOalZHbHBabmRIT1hReVFWRRAB",
            "text": "Miss the downtown location,  but worth the trek uptown.   Excellent mussels great drinks,  and if the wreaths is nice,  great indoor/outdoor seating.   Perfect for people watching,  mussels,  and a nice crisp white wine or two."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnemVYSkxWM2h2YW5KSGREZEJkRFJETVd0dVgwRRAB",
            "text": "One of our go-to spots for weekend brunch! The lobster roll is perfect - my wife loves their mussels. Great ambiance. I love that they offer a \"teeny tiny\" version of their Martini, for when you're not up for a full serving! $10 does not get any better!"
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5VFh6aFRaV2RTWmxwSVUyZHZOVVZCTkU5V2NXYxAB",
            "text": "La comida fue excelente, el servicio también. La comida salio rápido. Es un ambiente con una buen energía. Me encantó"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taaGEwNHhWM2hDWTNaclgyODBWRzFQWWpKb1ExRRAB",
            "text": "Absolutely the worst service I’ve had in NYC for a restaurant of its price range and “reputation.”\n\nTo be specific, my best friend and I took our girlfriends out for what we thought would be a lovely dinner, but it was far from that. They served our drinks first, then took over 30 minutes to bring out their wine bottle. Our food took more than an hour to arrive, and every time we asked for something, I had to physically get up from our seats to remind the staff of what we’d requested.\n\nMy favorite part (not really) was when I asked for a side of chipotle mayo, and the server responded, “Your burger already has it.” Nice.\n\nAs our terrible experience continued, a new server took over our table and didn’t even acknowledge what we’d been dealing with.\n\nI’m an understanding person, and if our original server was new or inexperienced, I can completely understand that. However, to be treated the way we were, and for no one to acknowledge it, shows a serious lack of awareness and class.\n\nI can confidently say I will not be returning."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5UWMySlFURFJSWkRaMmVXbFdVMlZaTm5ZeFdHYxAB",
            "text": "Underwhelming Experience at Flex Mussels UES. Visited recently and left feeling the vibe didn't quite match the hype. The food, particularly the Bangkok mussels, was flavorful and tasty, but honestly, nothing extraordinary or show-stopping. Portion sizes were on the small side, and at $32 for the Bangkok mussels (plus an extra $11 for Old Bay fries which, by the way, great on their own but not worth the premium, especially when solid moules and frites are available citywide for around $28), it felt overpriced. Lack of personal touch during our visit added to the underwhelming experience. Worth a visit if you're in the area and craving mussels, but maybe not a must-visit destination. Just something to consider."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KRlUwYzNNM2w2YVRSdGFsaHVhVFEzWm1OTmQwRRAB",
            "text": "The mussels and bread were divine! I would skip the fish dishes. A bit annoyed we were charged $35 for a kids burger…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SUmRHbFNlbWh1TTI1TFEzTXhhMjFVVUZkeGJFRRAB",
            "text": "Flex Mussels prepares, and serves the very best Mussels in New York City."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsbk0xRjRNVGQxU1haM1R6aFFWMFEzVVVsTk1rRRAB",
            "text": "This place is very good. The mussels were delicious as we're the fries. The only issue I had was the seating. I asked for inside and the hostess who seated me insisted I chose outdoor seating when booking. Then she sat us half in and half out at a very cramped table in the corner while there was plenty of alternative seating.\nVery frustrating."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWM2FYUlRTbEo2VTJob01TMXhVamt3YlVoQlRWRRAB",
            "text": "Lovely neighborhood spot. Haven't been back in years but the mussels are still as good as I remember them! The donuts are always fun to have at the end. Pretty good oyster selection as well.\n\nTheir Benedict is a sleeper hit. Most places don't make them that well but theirs is on point even though this is a mussel place lol"
        },
        {
            "date": "수정일: 1달 전",
            "language": "ja",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrelMwRjJYME5JY2pKUFYweFRXRXR6TUZaUFptYxAB",
            "text": "とってもおいしかったです。\nムールやアボカド、卵　素敵なブランチでした。また行きたいです"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKYU5tbDZhR1pqUVVocE1VWjFOVzlLVWtwMFNYYxAB",
            "text": "I had mussels, they were extremely chewy, and I choked on one. I had to pull it out from my mouth with my fingers. It was a disaster never had such a terrible meal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMlR6bExORGRUWlc1ME5HdFpVMFZ4WkV0clJGRRAB",
            "text": "We went for dinner on a Friday night and the restaurant was packed. Our drinks were good (glass of Albariño and a hibiscus spritz) but our mussels were extremely mediocre. The sauces were decent- the classic marinère would have been improved with shallots and the fra diavolo was tasty— but the mussels were overcooked (many were chewy and shrunken) and not terribly fresh. For a place that has mussels in their name, they certainly do not take much care for their signature product."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xR2MwbFdiSGt0UkdOMlEyZGhlWE54YnpJMWJsRRAB",
            "text": "Should have doubled-down on the Happy hour menu!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wNVNFRnhUWEYyU20xSVpEQktlWGR4V0MxQlRuYxAB",
            "text": "We ate at the bar because it was so crowded, and rightfully so. I had the Bibb lettuce mango salad and fish sandwich. YUMMM. Also some oysters. My mom had scampi mussels and Caesar salad, but they brought a kale salad by mistake…no problem they fixed that asap. Sitting at the bar was fun, the servers worked together like something you see in a TV show. They were fast and fun and they knew their stuff, especially the oysters. 10/10 will go back, this is my third time here and it’s always been good :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZeFJHOUthVk5UUVdkM2RWbG5NVUZvV1RWTlpWRRAB",
            "text": "Okay, when you make the decision to feature gourmet donuts as your main dessert…you had me at donuts…\nThe service is non pareil and the oysters and mussels are devine"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjME9XVnFRMnd5V2xKa2Iwb3hTbGh1U210WFRuYxAB",
            "text": "Delicious. Our table of 6 got an assortment of different dishes and everyone loved what they got!\n\nTaking a star off because when my entire table ordered an alcoholic drink except me, I was pressured not only by the waiter (“are you sure you don’t want anything?”) but also later the host or bar manager (not sure who) came by to specifically point out that I hadn’t ordered a drink. When I told them I was fine with water because I’m pregnant, they advertised their “delicious mocktails”. No thank you, if I wanted to pay close to $20 for a juice I would have already ordered one. If I was intentionally sober due to addiction, I probably would have been even more offended by it being pressured into ordering alcohol and feeling outcasted. It didn’t feel like gracious service, like someone checking in to make sure nothing was missed - it felt patronizing and embarrassing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wd1dYUnZlRGxDVTBOT1QzaFBiRVZyU1hWd1gxRRAB",
            "text": "DONT GO TO THIS NASTY PLACE.\nOne of the worst restaurants I’ve seen in my neighborhood.\nOverhyped and underwhelming — don’t be fooled by the glossy photos or fake “it spot” reputation. The staff are rude and self-important, the food is basic and dressed up to look fancy, and the whole vibe only fools people who don’t know better. UES is full of incredible restaurants — this is absolutely not one of them."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWFpreDFjVUZWTkVoWE4zRXhhRWQ0TlVacFZsRRAB",
            "text": "Dined here earlier this week and had a lovely time. Arrived during the transition between lunch and dinner so had limited menu options but it was fine. What was available was delicious. I liked that alternative options to mussels in white wine sauce were listed, that was a nice change. This version of mussels had a nice kick. Bread had to be requested, it wasn’t included which was fine. Just could let all that yummy broth the mussels were sitting in go to waste. I’m a bit particular with French fries and these were perfect. I recommend checking this place out. Perfect for solo eating, a date, yap session with friends, etc. I’m not on the UES often but I definitely want to come back and try more of their menu."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTVZUWlpZVlZaUzNCVmNFMUlNVWxvZGtwT1ZrRRAB",
            "text": "Great food, and amazing service. Can’t wait to come back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUVdGZDJURVo2Tmxac00wZFZkMDR6ZUVOUVNGRRAB",
            "text": "I came here last night and had a wonderful time. We had a reservation and was seated early. The food and drinks are amazing. I am already thinking of when I can go back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5RWQxRjJTMWQxYmpKTFgzWTVPREJHUmtkVWRIYxAB",
            "text": "Came to the restaurant on Friday during lunch time. The restaurant has been pretty empty. It is not my first visit, I know they get very busy during dinner time. I have been at this place on multiple occasions.\n\nIn an empty restaurant the hostess took us to the table in the corner where you can't seat facing each other but have to seat side by side with a wall next to both of you. Restaurant: that table is very uncomfortable! While the hostess started giving us instructions on how to sit at that table, I asked why wouldn't we sit at the table right next to it. The hostess responded \"Of course, I cant give you this table, its for 4 people\" . I still requested a different table for 2 people and she sat us at a different table, but she was not pleased. We ate our lunch and the restaurant never got busy and most of those 4 people tables were never occupied. Why put people at uncomfortable table when the restaurant is two thirds empty???\n\nOn a separate note, our server was attentive and otherwise excellent.\n\nMeal: we spent 200$ for lunch of 2 people. We had oysters, drinks and mussels. Oysters were fresh but pricy (I prefer crave fish bar nearby for oysters). Mussels were Ok, but I noticed that they were not great as they have been in the past. It feels like the quality of food in this restaurant have gone down over that past year.\n\nThe encounter with hostess and declining food quality left an unpleasant feeling. I don't think I will be coming back. There are other places for both oysters and mussels nearby where friendlier stuff greets you at the door."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKQ01sUXphMWxGWmtaclEwMU5TMng2TFRsb2RsRRAB",
            "text": "Very good mussels !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkc1JrNHlObFZIY0ZFelVrdElTbVF3WmtoclJHYxAB",
            "text": "Extremely rude and disrespectful staff arguing with customers. Food took over an hour to come out and was horrible. Avoid at all costs."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Nd1NYWlJTV1p1U0hob1NqVkdaVzl5TVVWTldXYxAB",
            "text": "The new location was great for an impromptu dinner on a Friday. The evening happy hour mini timis and mini flex platter made a good first course before the excellent parm moules. Wish they would toast the bread."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SUmNqQmZTbGN6TjFaVFJFOUdTMjV1V1V3eVIyYxAB",
            "text": "Awesome outdoor dining and cozy date night spot or fun night out at dinner with friends. Great food and drink!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pocGIxUnlTR2x1YTJveFFXOVVRVnB3VlZaS2QzYxAB",
            "text": "For many years I have enjoyed everything they have to offer, whether it’s their happy hour specials, some delicious dessert donuts, or a big pot of mussels. Last night they blew us away with their summer lobster special that our whole family enjoyed. Such a treat!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsSk5tZGhkM2xSUkhCdE4xazVTM0pqTFMxM1ZuYxAB",
            "text": "Delicious! 10/10 🌟✨"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aT05qTXlMVzFVUlZFeVJ6SjNhVmhWYlhNMU1sRRAB",
            "text": "Dijeron de Happy hours y no especificaron que la cerveza que pedimos (  estrellla Galicia ) estaba incluida en el Happy hours . Debieron de decirlo y no lo hicieron. Aparte que la comida no es nada especial."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Bek4yeHBNVmxqWjJ3MVREZ3dMV1JUU1c5SVYyYxAB",
            "text": "Always love going here! The Thai mussels are my favorite."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paUGRXeGlTRGhSTmpOd1YzbHpSMEZOVjJOa2VYYxAB",
            "text": "Very good. Service was great, food was great. It was a little bit in there but not their fault. They mostly face the west and the sun was blasting. Highly recommended though"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trMWJFY3lOMFJyV1dsNGRuSmpZMnhhVFdSS2FrRRAB",
            "text": "One of my favorite spots in the upper east side. Really nice outdoor seating, and good happy hour deals too (pictured: a smaller order of their parma mussels and frites for $25. comes with great bread too). Their salmon entree (ordered medium) is also great and melts in your mouth."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Oa2RVUlBha0ppT0ZsTmEwd3RiR0Y2VERWWmFWRRAB",
            "text": "Great spot. Really friendly warm staff (I believe his name was Dan?) And seafood was fabulous. We got lobster roll, mussels and oysters all delicious."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTFgwZG1WbFJIY1RWU04yRlFXV1ZsVkdRMmNYYxAB",
            "text": "Went for happy hour and had such a great experience. The oysters and mussels were so good — super fresh and full of flavor. I tried a few different mussel sauces, and they were all amazing.\n\nService was on great too. Our server was really friendly and everything came out quickly, which made the whole vibe feel relaxed and fun.\n\nI also tried a fish taco, but that was the only miss for me — just wasn’t anything special. But honestly, with how good the seafood and service were, I didn’t mind.\n\nDefinitely a solid happy hour spot. I’ll be back for sure!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kaVdFVTNhMHRCWDFkdWRGaHFaRFZLUTJKTVJFRRAB",
            "text": "Curtis has exceptional customer service,\nImani gave me the best recommendation!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCSFZ6ZDJlRkJFZUdwUFExcHdYekJSVlUxUWJsRRAB",
            "text": "Delicious Bibb Salad, lobster roll and well priced cocktails and wine were unfortunately experienced in an overly noisy room. Tables are packed in so tightly you can hardly get into your chair. You can overhear the conversations around you. Loose a few tables and I may return."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TWQzZGxhMHBLUWxob2JrbHJWSFJOY25kUWRsRRAB",
            "text": "Great atmosphere, really friendly staff and service, and great food! They do a few things and they do them well. Every mussel is perfectly cooked, no duds in the pot. Even the chicken was well cooked and seasoned. The standout is the donuts honestly I think people should come here just for dessert. Incredibly soft and fluffy and every one of their wide array of flavors is delicious. Refreshing to see this kind of lively restaurant in a neighborhood that has too many overpriced, staid offerings."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMGJITkdhRXMxVG5vMVNHaHZUVU56UTBod2RsRRAB",
            "text": "Walked in on a Sunday and we were taken care of by Aidan in a super-courteous and warm manner.  Food was fresh (obviously gotta get the mussels) and fairly-priced.  A new go-to for seafood for us in the UES!"
        },
        {
            "date": "4달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOa1kzQTVXVEZsUVUxTU9FWjRaVXR2TVZWUWRtYxAB",
            "text": "Ótima experiência.\nÓtima comida e atendimento.\nAmbiente legal, pessoas bonitas.\nCaro? Sim, principalmente se você não ganha em dólar mas é uma experiência gastronômica interessante."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KVmRtOXlSamwzUmpsVU5VWk9OMWxDZUd0M1kyYxAB",
            "text": "Friends dinner at Flex in March and I'm still thinking about it!  Lots of choices in mussels and really great service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdlFWTjNiR2xHWWpjemFqVTNRMnhYUW05SlJrRRAB",
            "text": "Where do I start?! My experience from beginning to end was nothing short of amazing. It was the highlight of my day. Curtis and the staff really went above and beyond to give us the best experience. Very attentive! I didn’t have to call anyone for anything. They were so on top of it making sure our drinks were always filled, the bread was always filled and making sure we were enjoying everything. Now the food, wow. I couldn’t stop talking about how good everything tasted while I was eating. The Bangkok Mussels Pot special was so good, I went to sleep thinking about it. My friend tried the Parma and it was so tasty. We also got the Red Snapper ceviche and my goodness, so tasty!! The Parmesan truffle fries with that aioli was to dieeeee for 🤤 our drinks we so yummy we definitely repeated! The doughnuts, oh my goodness. Those were probably the best I’ve ever had. They were so fluffy and each one was different. 100/10. Very happy with my experience! Thank you!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKbTQ2SnVadmVHZ1l3EAE",
            "text": "Love this place. Have been going to all Flex Mussels locations in the city for 15 years. Never disappoints."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xORFJIbEZZMjl5V25SbGVXcDBSbEJTUkdsNU5tYxAB",
            "text": "Great restaurant, wonderful meal, and lovely staff."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPZnhqZGFneU9mNXNnRRAB",
            "text": "Strong drinks, the Thai moules-frites were spot on & the vibe you would expect!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swNVQyVm9hM0Z0YkRseFVFWmZPSEZXVHpSMmMyYxAB",
            "text": "They basically threw the food at us and the minute a plate was almost clean, they took it away. Get um in, get um out is not how I’d spend $85."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4Z0lfSmFREAE",
            "text": "홍합탕과  깔라마리 만족스러웠음\n슾에 빵 곁들여 드세요~"
        },
        {
            "date": "수정일: 6년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNveUlXVGtBRRAB",
            "text": "금~주말은 예약 필수인 것 같아요. 랍스터롤이 넘 쥐콩만해서 놀랐어요ㅜㅜ 바닐라빈 소스에 찍어먹는 디저트 도넛 맛있어용!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMT3RsT1R1eklMOWRBEAE",
            "text": "Tried Flex Mussels for the first time and the vibe was absolutely spot on—inviting, lively, and the perfect setting for a seafood feast. We kicked things off with a solid lineup: fresh oysters, a flavorful fish dip, perfectly crispy calamari, and a side of fries to get things rolling.\n\nThe star of the show? The mussels. Each sauce was bold, rich, and packed with flavor—perfect for soaking up with the bread, which honestly became its own highlight. We also sampled the fish sandwich and some burgers, all of which were cooked just right and left us wanting more (so naturally, we ordered more fries).\n\nTo top it all off, we wrapped the meal with fresh, warm donuts that sealed the deal. Service was on point—our waiter was friendly, attentive, and knew the menu inside out.\n\nAll around, an incredible food experience with great energy and even better flavors. Definitely looking forward to going back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvX2FDM1BnEAE",
            "text": "Amazing place. Crab guacamole, whipped ricotta were delicious. Scampi mussels, omg. Sooo good! And the doughnuts, YOU HAVE TO TRY! We order strawberry, lemon, pb&j and salted caramel. Spectacular!!! 👏🏼"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQLUMwTGlfM042R2pRRRAB",
            "text": "Absolutely delicious seafood dishes at this uptown restaurant. So many options for mussels but we loved the filet of fish sandwich and the raw bar the most.  Next time definitely want to try their burger !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaE1yOHlRRRAB",
            "text": "It seemed like a hidden gem I stumbled upon by chance, yet clearly a local favourite.\nThe mussel dish had no unpleasant smell, and the Wagyu burger—if I recall correctly—was bursting with juicy flavour as I cut it in half; it truly tasted as good as it looked.\nThe male staff member provided impeccable service and appeared to be a person of great tact and charm.\nAlthough the ambience and interior design left something to be desired, the quality of the food more than made up for it.\nI intend to return next week for another visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYekw2QzN3RRAB",
            "text": "What a wonderful brunch experience!! Entire staff was wonderful. Professional and polite, they are entirely dedicated to the work they do. Clearly they're a great team. The food was delicious! The donuts are a must try! They were like nothing I've ever had before. The bacon, egg and cheese was fantastic! Not to mention the very tasty coffee! The establishment was cozy with a terrific brunch vibe. Can't wait to go back for the mussels."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJX2JfOTZBRRAB",
            "text": "Walking into Flex Mussels and you can’t help but notice that this is a bustling neighborhood hotspot. We had a 6pm reservation on a rainy, cold Friday night and the downstairs was already completely full (outside seating included). The ambiance downstairs was chique and buzzing with lots of chatter and music playing. We were taken upstairs to our table where the two of us were accommodated in booth seating for a two person party (will never complain about extra leg room especially in NYC). The upstairs was far more quiet, modest and had more of a kitschy vibe to it- more catered to family diners (which tracked with the clientele largely being sat up there).\n\nWe ordered wine (of which they have a great selection by the glass and bottle) and ordered food for the table. Our meal consisted of: the burnt fingers, kale salad, far diavola mussel pot, dozen oysters (they have 8 locations to chose from), truffle fries, and housemade donuts.\n\nThe lows: our oyster ticket was lost somehow and ended up coming out last (more on this later). The kale salad was bright and citrusy, but lacking a bit of umami for me. Perhaps needing more Parmesan or a touch of sweetness to balance the acidity (my GF loved it however). I thought the mussel pot was good, but could have used more herbs and salt. The San Marzano tomatoes were sweet and acidic, but require salt to bring out their true flavor.\n\nThe highs: I first want to point out the service. Our server checked in on us consistently, especially keeping us updated on the oysters. Once they realized they had lost the ticket, the manager comped half of them and the server offered us wine on the house. Mistakes happen, but it’s about how you respond to them. They handled it perfectly. The donuts and truffle fries are worth the price of admission in their own, and I would go back just to sit and the bar and order them. The oyster variety was diverse and the 4 choices of sauce accented the different varieties well.\n\nWhile not a perfect dining experience, there were things to love and definitely worth going back to. Extra points for the service and the donuts."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3b0xxQk1BEAE",
            "text": "Great mussels and oysters!\nI definitely recommend booking a table in advance for weekends. The restaurant was super packed on Saturday evening. The parma mussels with fries were SO delicious, very creamy and cheesy. I savoured and devoured everything including the sauce. My friend enjoyed the classic mussels as well. Also, we shared oysters and they were fresh and yummy.\nAbsolutely worth visiting during the happy hour"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBd19Id3ZRRRAB",
            "text": "This place is a must if you like oysters and mussels. They have different flavors of mussels, we had the Parma which came with a parmigiano cheese cream, shallots, lime, garlic. They were so good. We also had a tuna tiradito which was good too. They have a special menu for oysters from around the Us and you can see and taste the difference. The donuts are also really good specially the salted caramel one. Also they have 2 happy hours, the first at a normal time and one late happy hour which is nice. The restaurant is very nice and the ambiance is very cool, perfect for a night out with friend or a date. Thanks for everything!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNydHFEc0hnEAE",
            "text": "Ended up at Flex Mussels around odd time between lunch and dinner, desperate for foods after visiting the MET. We had happy hour foods, including guacamole, deviled eggs, fish tacos, and regular french fries.\nWe initially ordered 1 taco for each person but ordered 1 more each again, as it was so delicious. One of the best fish tacos I have ever tried.\nThe guacamole was ok - our kind server brought us more chips. Deviled eggs were unbelievably soft - my kids enjoyed them.\n\nThe restaurant has a fairly cozy atmosphere, with surprisingly adequately distanced seating. Located in a 10-min walking distance from the MET. Our server was friendly and decent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbUtTZktREAE",
            "text": "I visited this spot for brunch, and I was immediately drawn in by its lively atmosphere and warm lighting. The decor is vibrant, with a playful combination of light orange and green hues.\n\nWhile the space is a bit cozy, the tables are adequately spaced apart, allowing for comfortable conversation without excessive noise. With both indoor and outdoor seating options, there's more breathing room available outside.\n\nNow, let's talk about the food - it's simply fantastic! The everything donuts were a delightful surprise, coming out fluffy and bite-sized, topped with scallion cream cheese reminiscent of classic New York bagels. The curry mussels were a standout dish, boasting generous portions perfect for sharing. The creamy curry sauce had just the right amount of spice, and I found myself enjoying the truffle fries even more when dipped into it for an extra burst of flavor.\n\nGiven its popularity, I highly recommend making a reservation in advance, especially for weekend brunches. I'm already looking forward to returning to try more of their unique mussel and donut flavors - they all sound equally enticing and fun."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdkxlU2JREAE",
            "text": "Everything was perfect . The food is great the service is attentive and quick . The atmosphere was just right for a Sunday brunch with friends . The noise level was ok and the place was just the right temperature. My coffee was excellent as was everything we ordered . Good price and perfect portions . Quality ingredients and excellent preparation ."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbUwtLUh3EAE",
            "text": "I really enjoyed this place. The food was really good. The waiter wasn’t overbearing, provided great service."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmM0k2eXh3RRAB",
            "text": "Nice flex at $2 Happy hour oysters! Excellent quality oysters and a bunch of other items included for happy hour including $25 moules frites ( mussels and fries, their speciality ). Highly recommend the oysters, Thai mussels and shoe string fries 💪🏽…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfc05uLTV3RRAB",
            "text": "Thai & Parma mussels were our favorite. The lobster mussels were probably our least, surprisingly. Passion fruit crudo was amazing. Complimentary bread also great! Great service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJX2NpZDJBRRAB",
            "text": "Flex Mussels is a unique restaurant with a pleasant eclectic atmosphere great for gathering friends and after work get togethers. Food was superb keeping in mind food is mostly seafood. But the non seafood eaters have a few choices too. The crab guacamole was fantastic and the deviled eggs were so tasty and rich.Services is great, friendly and courteous and drink menu is different with exotic drink recipes to stimulate your palate sensors. I highly recommend this restaurant and will definitely be back!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBallDdjl3RRAB",
            "text": "Sad to say but it's quality has dropped a lot since our last visit. The atmosphere is totally different since they moved. The service is less professional and it's a much more casual place now. They charged $42 for a lobster roll, and that was much more than the roll deserved. The Hake Sandwich was very interesting and tasty, along with a huge pile of French Fries."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3dDl2ZEhREAE",
            "text": "The decor is very attractive, but did make up for my disappointing meals. Unfortunately, I have eaten here twice when the mussels had no taste of their own. In those cases, when I had their \"classic\" mussels ($28), it was only the white wine sauce at the bottom of the pot of mussels that offered flavor. The sauce was most beneficial when bread was dipped in it. I found that their \"big sister\" oysters (6 for $24) were too salty for me."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM2VDVFNBEAE",
            "text": "had an extremely disappointing experience at your restaurant on April 27, 2025, at 5:00 PM. I have visited this restaurant multiple times before without any issues, but this time I faced an unacceptable situation. I was with my service dog, and the staff, including someone who was temporarily acting as a manager, treated me disrespectfully. My service dog was quietly resting on my lap, and I was within my legal rights to have her with me. However, instead of following the law and showing professionalism, the staff acted in an ignorant and hostile manner.\nAt the end of our interaction, when I paid my bill, the employee actually told me, ‘I hope you never come back here.’ No manager in New York City would ever behave this way. This was a clear violation of my rights and a complete lack of respect for customers. I will not return to this restaurant and strongly advise others to avoid it as well. I expect you to respect federal and New York laws regarding service animals."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMbUlPNXNnRRAB",
            "text": "Good to visit once. Atmosphere and area is wonderful, I love mussels so I came here. Can’t say I’m satisfied 100 percent. I tried 4 different mussels and Thai and Parmesan were my favourite."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaG91c0dBEAE",
            "text": "Came here on a Tuesday evening to celebrate my birthday with family and friends . I made the reservation for 6 but had an extra person they did not give me an easy and were accommodating. We also brought a cake there is a $5 cake fee per person, a little pricey. The service was amazing the staff helped us to understand the menu and order the right about of food for the table. We did three pots of mussels, scampi, parm, and thai . That was definitely our favorite, we also had the lobster roll, fish sandwich, fish tacos, calamari, lastly we also tried the whipped ricotta. Everyone thoroughly enjoyed absolutely everything. It was delicious. Fulfilled my mussels craving ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6dHBINU53EAE",
            "text": "Multiple choices of mussels favors, we tried Thai favor and classic favor, both are very good.  The truffle fries are delicious.  The kale salad is a bit too salty.  There are plenty of outdoor seatings."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4bWRpSXBRRRAB",
            "text": "Very nice restaurant..we chose to sit inside because it was cooler than outside. Our server was friendly but kept forgetting things. She offered us bread but never brought it. The table next to us got two servings before we got one. My BF had to wait extra long for his drink to come. The mussels were ok. Not as tasty as we have had. French fries are excellent..grilled oysters and burnt end calamari and shrimp were also outstanding. We got six doughnuts to go, three different flavors. They brought us a box in bag and thanked us for coming. I opened to check and there were only 4. We told the waitress she said she would take care of it. A young man came back, apologized and said for our troubles he gave us two extra doughnuts. He didn't. There were only two in the extra box he brought that we paid for."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMXVpYUVBEAE",
            "text": "5-star meal, until they pulled a bait-and-switch charging me $42 for a cocktail that was $20 on the menu.\n\nWe sampled a good chunk of the drink and food menu, and it was quite good - especially good quality oysters. Bar was clearly overloaded but they handled well.\n\nGreat experience, I was planning to come back with more people that I know, until I got the bill and was charged $42 for 2x Tito’s when I’d ordered the $20 Flex Martini. I asked the bartender what was going on and he asserted that it was the correct charge, so I paid it.\n\nGreat meal, and $22 is small, but the little scam leaves a really bad taste in your mouth."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJam9TN0lREAE",
            "text": "Everything was amazing! The food was absolutely incredible, and our server Lisa was wonderful. Thank you so much!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbDY3ZjhnRRAB",
            "text": "Just finished a 38th wedding anniversary brunch at Flex Mussels. The food, drinks, and service were all amazing! But the best part was the staff: from beginning to end everyone made us feel welcomed and made our day even more special! This was our first visit to the restaurant but it certainly won’t be our last."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNleWNMbDFnRRAB",
            "text": "Newly opened location, after the sad fire that closed the original UES location. NOTE: NO happy hour yet. Reservations recommended. Go early or late for a quieter time.\n\nCome here for energetic dinner in a gorgeous spot: the atmosphere is VERY loud, buzzing and tables are very close. People bumping into each other guests and staff alike, which I didn't find comfortable. The bread, truffle friends and the mussels broth and flavors were excellent, the lobster roll scrumptious. The actual size of mussels were small and disappointing. Friendly and attentive service. Save room for the made to order donuts."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3a05mTjhBRRAB",
            "text": "We came for a bite after visiting The Met, everything was super delicious and the atmosphere was perfect. Great vibes and great music. We ordered the latkebenedict and the chicken club."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPT1h0OTdSeU9uMnF3RRAB",
            "text": "I took my wife on a date before a candlelight concert, and starting at Flex Mussels was the perfect choice. We caught their happy hour — great prices and a solid selection. Two dozen fresh oysters, crab guacamole, and parmesan Flex fries hit the spot. The drinks were great, and the service was friendly and attentive. A fantastic way to kick off a romantic evening!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkMVBtY3RBRRAB",
            "text": "Flex Mussels is a good spot for a casual neighborhood dinner on the Upper East Side.\n• The staff is very friendly.\n• The food is delicious.\n• It can get quite noisy later in the evening, but if you go before 6 pm, you can enjoy the peaceful ambiance."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bWZ5d2RBEAE",
            "text": "Pretty good food and service. The spacing of tables can feel a bit crammed. The food was great with a small but nice selection of oysters and a bunch of appetizers and mussel flavors to choose from. Very friendly and attentive staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxMnN6Y0RREAE",
            "text": "There is street side parking but good luck getting it.\n\nI was never much of a mussels guy, I thought the pinnacle of mussels is butter garlic.\n\nI was wrong. This place has introduced me to new flavor combinations which were amazing.\n\nI had the scampi, it was great. My wife ordered Thai. The Thai was a new mix of old flavors. The Curry goes very well with the bread.\n\nI would absolutely come back again dragging my unbeliever friends.\n\nThe oysters there are fresh, and I just wish they had ginger salt with wasabi for the oysters. It would absolutely complete my night."
        }
    ],
    "reviews_count": 83
}