{
    "name": "Fumo Upper East Side",
    "place_id": "ChIJoROsW35ZwokRMylDdu4EwQo",
    "grid": "MN8",
    "address": "1626 2nd Ave, New York, NY 10028, USA",
    "rating": 4.3,
    "user_ratings_total": 320,
    "phone_number": "(646) 429-9887",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKRlZXOVFlWGd3WW5KeFJHcFRiVVJYTURCYU1YYxAB",
            "text": "Mr. Luigi was super friendly and made our time worth spending! He was super funny! The waiters and hostesses were so sweet and really were attentive to detail as well. Food was awesome; the mozzarella sticks were so good & my pizza was amazing ! Will be back again :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ca1EweEhiM1pGTW1weFFsWkNUelpuTjJOcFptYxAB",
            "text": "It is spacious! This is a kid-friendly restaurant where you can bring your big family. We sat in the back of dining area where the skylight is. Food was quickly came out without a problem. They were delicious. Staffs are nice!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxQ2FVVmZZbk5TTjNSdFRYQlliakJuVkRaQ1pIYxAB",
            "text": "We had an AMAZING meal at Fumo. Everyone was very kind and attentive. I had the vegan pasta and it was probably the best pesto I've tried in years. The atmosphere is also beautiful!!! Can't wait to be back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbmZUZkxREAE",
            "text": "Vegan and gluten free diners, you’re in good hands! My mom and I had dinner here on Friday night - we put our name in and only waited about 15 minutes, though I’d suggest making a reservation. Ever the hungry patrons, we ordered immediately and received excellent service (from Daneille D. and an additional server). We opted to share the Garden salad with dressing on the side - it was light, refreshing, and hit the spot. For our mains, we both ordered the vegan pesto with gluten free pasta (mezze rigatoni), alongside a side of gluten free flatbread (brushed in egg). The pasta was cooked to al dente perfection, the sauce was one of the best I’ve ever had, and the flatbread was the ideal accompaniment. Highly recommend this spot for a date night or friend meetup. A bit noisy but good vibes. And if you’re on a budget, head there for their $12 lunch pasta specials."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMGNYc29RRRAB",
            "text": "Fumo – Happy Hour Done Right!\n\nI stopped by Fumo for happy hour and was pleasantly surprised. From the happy hour menu I ordered a glass of Pinot Grigio and the truffle fries — perfectly crisp with just the right amount of truffle flavor. I also tried the shrimp from the regular menu, which were juicy and full of flavor, served with sautéed spinach and cherry tomatoes.\n\nBut the highlight of the evening? The lemon cake — absolutely delicious! Moist, rich, and beautifully balanced with whipped cream and fresh berries.\n\nThe vibe at the bar was relaxed yet classy — definitely a spot I’ll come back to!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oWWJYSjBTa0ZEWXpWUmFURmpTV0ZCTWsxRFIyYxAB",
            "text": "The food in this restaurant is very good, the price is correct especially if you do not take any drinks.\n\nFor me the atmosphere was a bit disappointing, not because of the service, but because we were in the middle of other tables.\nIt was difficult to talk, a lot of noise, for a small space.\n\nHowever, if you do a reservation, I recommend this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taSmFWTkJiMUZUUTFkYVRIUjBiVlpLVEhGTGVHYxAB",
            "text": "It’s a really cute place to come for lunch with great specials. Their pastas are huge portions- the mushroom pasta is especially good! Very tasty, creamy and a good variety of mushrooms.\n\nService is friendly and fast. I’d like to come back for dinner to see the ambiance as it was a bit too light and bright for me and I do like a dimly lit establishment in the evening.\n\nRegardless, do stop in if you’re craving some great Italian food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRX1BMTUhREAE",
            "text": "Fumo on the Upper East Side is a gem. The ambiance is light, bright, and stylish—clean without feeling sterile.\n\nDrinks are well-made and reasonably priced, which is always a plus. The staff has a lot of really great recommendations and they don't rush you either.\n\nThe eggplant Parmesan was fantastic. rich, flavorful, and perfectly cooked! No soggy eggplant to be found! The baked ziti was equally delicious, and the tiramisu? Honestly, the best I’ve ever had. It was light, fluffy, and not overly soaked.\n\nEverything was spot on. Definitely worth checking out."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJeWNHMDBPVFY2ZVhWaU9IQmtSM3BwYVd4dGVrRRAB",
            "text": "I wanted to write about how wonderful this place is. I had heard of it, when I lived in NYC. I needed an urgent catering order for my friend whose father passed away. I called and spoke to the owner, who was the kindest, most helpful, and lovely person. Even though there is notice needed, he helped anyway, for a family in need and grieving. Within 5 hours, he delivered the most wonderful food and my friend and his family were \"so touched and blown away\". He even included a note for us and made sure the vegan dish was known (my friends sister is vegan). What a lovely and kind owner, restaurant, and they really helped me be there for a friends family that needed help. They said the food was delicious. I just want to say thank you to the owner and the restaurants employees. Please go support this lovely and wonderful, local establishment. Additionally, my other friend said the restaurant is super cute and nice (as is seen in all the photos). The food looks delicious and has rave reviews from others who dine there. I will be visiting NYC soon and coming to dine here! THANK YOU SO MUCH. You are good and kind people who care about customers and people. AND your food is amazing. I truly appreciate the kindness you extended and the love and care you put into your customers needs. What a wonderful place. —Erin"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OUVFuVXRVVlV6VWpGTVVFWXdZalJRU1VNNWJuYxAB",
            "text": "Delicious and fresh food. We had lunch at the bar, ordered Parma pizza, baked ziti and kale Cesar salad. Everything was very delicious. The best kale salad I ever had. Staff great and friendly. Will be coming back a lot."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncXAtaHhBRRAB",
            "text": "While on the upper east side I came across FUMO an Italian restaurant. It looked charming from the outside so I decided to try it out. I was not disappointed in my decision. The bar area was spacious and attractive. I began the meal as I usually do in Italian restaurants with an order of meatballs. The meatballs were tender and were accompanied by a very flavorful pomodoro sauce. I next went for the rigatoni bolognese.  It was comfort food at its best. I finished the meal with a light and flavorful olive oil cake. I must also highly  recommend the tasty garlic bread. As far as the service staff, they were friendly and efficient. I later discovered that that there are a few FUMO restaurants spread around Manhattan. I can definitely recommend this one."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5cm9UQVdnEAE",
            "text": "I've been there twice now and the food the second time was even better than the first. The quality of the food is amazing, particularly for the price at lunch when pastas are $12.\n\nI was worried that the portions would be small, but they are most certainly not. The salads are particularly a good size for sharing.\n\nI think for a pasta lunch, this is the best deal in the area. I will definitely be back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjMFozcFVWbTh5YkZSa1pXWlFNVlZ1TUdneldWRRAB",
            "text": "Incredible experience! Had the eggplant parmiggiana and the truffle fries with a beer. Everything was so rich and delicious. The staff is amazing also. Highly recommended!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWeVpFWllhMnN3UjFoTlZWUlBSaTEyWVRWcmFtYxAB",
            "text": "Love Fumo! It’s a super underrated gluten free restaurant in the city and this location always has a table available and super friendly staff! I’ve eaten at a few of their locations (both in person and takeout) and have never gotten sick - the staff is always super knowledgeable about gluten free :) The pizza is probably one of my favorite gluten free pizza crusts in NYC - surprisingly soft which I did not expect! Highly recommend and always feel safe eating here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNieDU2WjBRRRAB",
            "text": "This spot is such a great find! I was looking for lunch specials in the area since I work by here, and I was attended so quickly by the staff at Fumo! The waiters and staff are so friendly and attentive, as well as knowledgeable. They offered expert opinions for me when I asked what they personally liked from the menu, and I will definitely be a returning guest. 10/10.\n\nThe lunch special is $12 for any pasta or salad. They aren’t cheap with the portions either; I ate half my dish and saved the rest for later."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dmVISXpUbE5vUldNMVMxcDBiRlV0TkcxTGMzYxAB",
            "text": "Fantastic Italian cuisine on the UES. Casual yet stylish setting and more than accommodating staff. For fans of red sauce, try the Rigatoni Bolognese."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiX05LYW9BRRAB",
            "text": "I recently had the pleasure of dining at Fumo and I must say, their Rigatoni Alfredo is the best I've ever had. The pasta was perfectly cooked and the Alfredo sauce was seasoned to perfection. The service was outstanding, with attentive and friendly staff. To top it off, their espresso drinks were excellent. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KME9FaGliMWhtYjNGRlRXRk5WMlpWZW05UlNHYxAB",
            "text": "Came here during the half off wine night. Tables are tiiiiny and pretty close together but it is a beautiful restaurant. The pizza was really good but the entree and app fell flat for us. Service was okay our waiter was very nice but we waited long for our food and other tables that ordered after us got their food first? If we were to come back it’d be for cocktails and a pizza and definitely sit at the bar."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBM0ttX2RBEAE",
            "text": "We personally had a great experience. Service was super attentive and food was good. We had the burrata, the spaghetti a la vongole and rigatoni salsiccia. The portions were good and at lunch pasta is $12 which is a highlight."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdXBPUEl3EAE",
            "text": "They have a really wonderful lunch special with $12 full sized pasta or salad. I've been there several times to try different pastas. Their portions are generous and their presentation is great but all  pasta dishes  are always too al dente, even after I ask them to cook it longer."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kU2NtOXFhWGd6Wm5kNVJXMUphMlF3TkRWNk1sRRAB",
            "text": "Best fresh pasta and salad deal for $12 in the city. Highly recommend the penne vodka, funghi, and pesto pastas. The spring salad with avocado is also great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMczV1UnJRRRAB",
            "text": "Modern setting with comfortable seating, warm service and high end presentation. Excellent vegetarian vegan and gluten free options- loved the cauliflower crust vegan pizza and the eggplant parmigiana with vegan cheese!! Wow!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdVpENmhRRRAB",
            "text": "Absolutely loved this place! Food was amazing, I had a Vegan Pizza on Cauliflower Crust, Truffle French Fries, and a Chicken Milanese. Plus, the service was great and the atmosphere beautiful and clean. Manager was so kind as well. Will be coming back for sure!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnd1lfcDV3RRAB",
            "text": "Came here on President's Day. Food was good, cocktails were excellent.  Appreciated the professionalism from the moment you walk in.  Great ambiance, lively and adds to the experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cck0wRk9RV1pvVGxCNVUySnZZVXB3UVd0MGJYYxAB",
            "text": "Just visited Fumo with some friends from church! We Had Fried calamari, Meatballs and baked clams as an appetizer and ordered the Fungi pasta for myself.. it was really good! Dexter our server took care of us while really attentive and friendly. Sure will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNidk9hMzRRRRAB",
            "text": "Nice lunch special!\n\n$12 for a pasta or salad. Good portion too!\n\nWent with the penne ala vodka with chicken (extra 8$ charge) and the spaghetti with clams.\n\nThe penne ala vodka with chicken was great. I added crushed red peppers at the table (asked if they could make it spicy but they couldn’t) and that added a nice kick that I was looking for.\n\nThe spaghetti with clams was good. It’s not a flavor that I like but the table was happy with that purchase.\n\nLunch time was quiet and easy to get a table. The promotion is good until 4pm which is pretty good for a lunch special. I think right after they have happy hour which also had some nice deals on it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdnVyWHN3RRAB",
            "text": "I just ordered from here for the first time. I ordered delivery and I got a Kale Caesar salad, penne vodka and sautéed spinach with garlic. I don’t know about y’all, but when I order food, especially when I’m spending this much money I expect my food to be prepared fresh. And there is absolutely no way that happened last night. From the time I clicked the button to place my order to the time my food was in a bag and on its way to me, It was five minutes. There is absolutely no way any of this food was prepared fresh after I placed my order. pasta cannot be cooked that quickly, sautéed spinach cannot be prepared that quickly.  So I literally spent $24 for pre-cooked pasta. $11 for pre-cooked spinach. There was absolutely no flavor to anything. The sautéed spinach, The only flavor I could taste was when I got a clove of garlic in my mouth. The pasta was subpar. I will literally never be ordering from here again. This is an absolute joke that they think they can charge money for pre-cooked food. I think it took 10 minutes from the time I placed my order to the time my food arrived at my front door. This is an absolute disgrace and an absolute joke. So many better places to get food that is actually freshly prepared for you in this neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydm9Ma25BRRAB",
            "text": "I’ve not found a better place for a classic Rigatoni Alfredo anywhere else in the city! It is seasoned to perfection - you eat as soon as it’s served without having to add anything to it. The vodka sauce pasta is also a must have!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxdlJtYzBOWEZNWm1ZM2MzWXdabXRNY2xob09YYxAB",
            "text": "Got takeout from here and was very disappointed. Chicken cutlet tasted like it was frozen and microwaved. Baked clams were doused in garlic, microwaved and tasted spoiled. I was unable to eat even one of them. Plenty of great Italian spots in the neighborhood. This is not one of them."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqLU5IRkZ3EAE",
            "text": "We ordered spaghetti carbonara and barata. For spaghetti carbonara itself is $12 but what shocks me was the salmon that we add on for $15. It was very tiny the size is like your pinky finger and kind of salty. But we are happy with the barata."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWE16QlVTMDFDTVd4S1dIaGtkSEowVGtJM09FRRAB",
            "text": "Wow, greatest lunch special in NYC. Pastas are phenomenal, homemade and perfectly cooked. Portions are large. Service was great. Can’t recommend this place enough. Will definitely go back soon for dinner."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1eXFYSVZBEAE",
            "text": "We were pleasantly surprised. The vibe, food & service were all excellent. Perfect spot to grab dinner with friends. They were playing R&B & hip hop music which we really enjoyed. You never get that music in restaurants. Drinks were outstanding as well. Fun, casual, delicious, nyc spot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMXVyQmZnEAE",
            "text": "The food was pretty good. One dish had to be returned to the kitchen because the salmon was undercooked but the waiters took it back and fixed it. Service was reasonable. The back area can get crowded as it is not a large space but it was manageable. Would definitely return for brunch again."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ak1iSjVRRRAB",
            "text": "Both pasta and salad are $12 during lunch and the restaurant is right by the Q train station. That’s why it’s a great spot in terms of both location and price. This is something very rare in the UES."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKdE1iZ1R3EAE",
            "text": "Fumo is a welcome addition to the upper east side, even in a neighborhood teeming with Italian restaurants and pizza joints. The interior with off-white walls and light wood looks fresh. The $12 lunch specials include salads and pastas. The spinach salad had just the right amount of dressing. The candied walnuts and avocado gave crunch and richness, respectively. The spaghetti carbonara was perfectly al dente with a creamy dressing. Because it’s newly opened, they’re still waiting for their liquor license. But the food alone is reason enough to visit."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxRFJWUmtWM1V0ZHkxSGJHUmxhSGczYm1sYU5WRRAB",
            "text": "The food was great, better than I expected.  The service was excellent as well.  I will definitely come back.  I don't know why I walked by here so many times before without making a point to stop in.  I was missing out...but not anymore!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dGRLc0h3EAE",
            "text": "Simple, yummy, casual Italian food with the pasta being a highlight. The rigatoni Alfredo was especially good. The restaurant didn’t knock my socks off but it’s a great option in the area."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZcnJfV1F3EAE",
            "text": "Fantastic neighborhood find. We’ve been now 2 years to celebrate my bday and it’s become a fun tradition. They’re well accommodating for large parties, food is delish (especially their kale Caesar), service is great, and prices are reasonable. Thank you again to the Staff and Meagan for making my day so special. See you again next year!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1NFlmSXdnRRAB",
            "text": "I’ve been to their Harlem location, but this was my first time at their new Upper East Side location. I think it opened sometime between June and July. They haven’t added the Upper East Side menu to their website yet. We made reservations on Resy. I ordered the Rigatoni Bolognese, and it was delicious!!! The sauce tasted amazing! I’ve had their Chicken Parm before, and it’s my favorite chicken parm I’ve had in NYC. Someone else in our group ordered it, and they loved it as well. We got a bottle of wine, and for dessert we had a slice of cheesecake. The cheesecake wasn’t listed on their menu, but we asked if they had some and they did. It was excellent as well! My only complaint is that the dining room is a little too dark after the sun goes down. You seriously can’t beat the food here, and I’m excited this is here on the Upper East Side. I highly recommend this place!"
        },
        {
            "date": "4달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJaV9pWmV6d3BiWUZREAE",
            "text": "Jedna z najlepszych pizz jakie kiedykolwiek jadłam! Również pozytywne  zaskoczenie jak spytano jak chce mieć wysmażonego łososia...będąc z Polski tam nigdy sie z tym nie spotkałam. Łosos wyśmienity (medium), kubki smakowe pobudzone. Polecam jak najbardziej ! Bardzo przyjemny klimat i jedzenie na 5!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOS1dFWmFiMnhZWVZkQ1NXSk5kMWRYZDJwVk5XYxAB",
            "text": "Pasta was insane ! Drinks were just as good, atmosphere is beautiful, a nice modern touch to italian cuisine. Dexter was an amazing server, will 100% be coming back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJR1QxNi05bWNyQmNnEAE",
            "text": "Really nice happy hour! 4-7pm, lovely chianti red for $8, and a really nice staff.. I haven't eaten here yet,  but they have gluten free options, but not for happy hour.. only reason for 4 starts instead of 5 is the loud music and relatively bright lighting for my taste in such a cute space. I'll def be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNObDluYVB3EAE",
            "text": "Bright, minimalistic, modern decor,  offset by wide plank farmhouse flooring and tasteful bits of faux greenery emitted a happy warm atmosphere.  This was reinforced by the upbeat retro disco playing softly.  The smiley staff, were knowledgeable and attentive.  When I mentioned I preferred Italian style ricotta cheese cake to the NY style they offered, I was assured the matter would be brought to the attention of management.  Spaghetti with white clam sauce was an UES 12$ lunch special home run. The al dente spaghetti was as the translation suggests, 'to the bite', perfection.  For some time I have felt many establishments offering Al dente just want to put my teeth to the test.  The clam sauce to pasta ratio was also perfection, the flavorful sauce coated my noodles and I was left with a yummy bit to dip my bread.  Presentation was lovely as the plate was adorned with a generous quantity of cute and sweet little manila clams placed in a ring to proudly display the intrinsic Italian flag on each shell.  Kissed with a bit of crushed red pepper and baptized with fresh parsley made every bite better than the last.  A traditional double espresso was served hot and strong with  the expected froth from a well maintained high pressure machine giving me the energy to write this."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMZmVpc2JxcDRPR3VnRRAB",
            "text": "Start to finish great experience.  Walked in on a Saturday night and Danny took great care of us and each course was on point.  Eggplant parm perfectly cooked, pasta (gluten free - they’ve got a lot of those options) and branzino made perfectly.  Great decor and vibe too. We’ll be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbV83d1ZnEAE",
            "text": "Italian chain in New York with various locations! We found one a few blocks from the Central Park. Shared the Roni pizza and mushroom one! Big 12 inches and good ingredients!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbjRhaDFnRRAB",
            "text": "(4.8 rating) went for brunch. there food was very good, the service was good but no liquor… yet! Lol spot was very good, I’d go back and try more options !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWQ2JXNUtSRE0yT0dSeU5qRkVOMHBMTjBacmVXYxAB",
            "text": "I absolutely love this place. The service is impeccable & it is a very welcoming environment. 10/10, it won’t disappoint!! Make sure to make it in for their $12 pastas!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTGJFWXhPVzVSZDFSMGJFUmxXRVp5ZEhvMWNVRRAB",
            "text": "Great food and service, the music too laud, and dogs all over , didn’t know they have an area for humans only.😂 I’ll definitely come back and will request to seat in the human side!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNybHRpVVl3EAE",
            "text": "Our favorite place near our home. We come a few times a week. Sometimes we like a table and some days we love wine and steak at the bar. We love it all, their busy Saturdays, best Neapolitana pizza, pasta specials during the day for quick lunch grab, amazing crem brule and panna cotta and surprisingly amazing NY Strip when they have it as a special. And always good wines by the glass. Our favorite pasta is vegan pesto, Bolognese, Vongole and meatballs. The staff is so hospitable and always make you feel like at home."
        },
        {
            "date": "1년 전",
            "language": "ja",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYZ3FYaTh3RRAB",
            "text": "くたくたの日にどうしてもボンゴレが食べたくなり、Uber eatsでオーダーしました。\n日本人感覚からするとかなりの大容量でびっくりしましたがアサリもたくさん入っていて美味しかったです！"
        }
    ],
    "reviews_count": 50
}