{
    "name": "BLUE MEZZE BAR (ZOI)",
    "place_id": "ChIJYwKGx6lZwokR05rPsphAWVE",
    "grid": "MN8",
    "address": "1480 2nd Ave, New York, NY 10075, USA",
    "rating": 4.6,
    "user_ratings_total": 1579,
    "phone_number": "(646) 718-3609",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201aGVtRkNWMU41WkZSa2VUbHVlRWRsWjFoNFRIYxAB",
            "text": "We went for brunch. We were sitting there at least 15 mins before a server had even come up to the table. And within that 15 minutes, the owner or manager had the audacity to come up and tell us we only have 90 minutes from our reservation time to sit there. We hadn’t even been greeted by a server or put in drink orders yet but our time was counting. My friend and I did the $50 bottomless brunch with an entree and “bottomless” mimosas, bloody mary’s, or sangria. When we both went to order the sangria as our drink they tell us it’s not available that day, so we had to do mimosas. We get our first mimosa and it’s mostly OJ. The service was so unbelievably slow that within our “90 minutes” we were only served 2 mimosas each when we requested refills multiple times. So much for bottomless! Food was mediocre. It was marathon Sunday so i really tried to give them the benefit of the doubt, but it didn’t even appear to be over crowded in there so I really don’t know what the deal was. Other tables had carafes of mimosas on the table for their bottomless."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOV1VFNU9SelZuT1d4RVdHNHpZWEJsUWxCV2EyYxAB",
            "text": "When I came in here on Saturday, I was greeted by Josner who ended up being my server as well. He was extremely kind and the service was very attentive, he took the time to answer our questions and checked on us. The food was absolutely delicious and the restaurant atmosphere in general was extremely lovely for my family!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBNE5WQndNa1V5TjNFM09IUndjVXhzV0ZNNE9IYxAB",
            "text": "I dined in here last night to celebrate my mother’s birthday. I made the reservation for 10:30pm because online it said they closed at 12am. Come to find out that they were closing at 11:25 pm due to renovations, which we were never made aware of when being seated. When we arrived we were greeted by the host, which ended up being our server as well. We were seated and was then greeted by the buss boy who was a gem and made the experience worth the while. From accommodating us to a warmer table because my mother felt cold, to being extremely attentive to us and the rest of the restaurant; something we didn’t really get to experience from our actual waiter. The fact that the bill was dropped off by 11:10pm and were told we had to close out and were rushed out due to such renovations didn’t sit well with me and specially with an overall $320 bill that we didn’t really get to enjoy. Aside from the lack of attentiveness from our waiter and being rushed out of the restaurant, the food was very tasty. It would of definitely been a 5 star if the waiter experience would of been different."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SUmVsbzVOalZpVmpsdVpFTnpjR1JDT1Uxek9IYxAB",
            "text": "Kaya was the BEST!!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trMlEySlVTWGxXTUdSWGFrbHFRM3BRVlZobGMyYxAB",
            "text": "Sean was absolutely amazing very knowledgeable about the menu… the customer service from Angel was top notch , he made sure everything was up to our needs! THANK YOU GUYS so much!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGMlZFUTFNbEJ4ZFRaTk5XY3hkV042VVhKbE1tYxAB",
            "text": "Food was absolutely delicious and Sean was so great and attentive!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxYWVVUnNia3BFTTBKbFJVeHlNRWRaYzFRdGRYYxAB",
            "text": "Sean was such an attentive waiter! He helped us with all our requests and the dining experience was 10/10"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xneFNrVTFPSG96TXkwMlZYY3RWVkUzVkhGaWExRRAB",
            "text": "Sean was attentive and the salmon was amazing!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrM1dtNW5MVVY1UkVsT1VHNUJURXhNT0ZKSmMwRRAB",
            "text": "The food was amazing, and the service was so intimate and perfect! Not too pushy, and left appropriate time between each course! Would recommend!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwd2JIWk5WSEpqV1ZvMk5uUlpRVmc1Um1nelRsRRAB",
            "text": "Very slow"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzNVpIZEZaazVUZUc5U1kyZG5aMWxTWkhod1RFRRAB",
            "text": "The food is absolutely delicious, and the staff is nice."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KeVoxSk9VMjkyVWxseldsRXdabTVrT0ZkQk4xRRAB",
            "text": "The best octopus appetizer and avocado feta spread appetizers! Simply delicious. Attentive service, seated and greeted by Rest Manager was a nice touch. Our server Josner was on point and the his support staff as well. Attentive service and terrific ambiance. Music level was perfect and we had phenomenal time. Thank you!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOM1UxaHdkbTU2U2pWdWRreGxSR1JQWkd4V1pFRRAB",
            "text": "Best date night ever! The food was filling and the drinks were delicious! Okan was so attentive and friendly. Big shout out to him."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWTGFHWktjRGgxZFVkRGVURlJiMDlRTWpGQ1ZGRRAB",
            "text": "Lots of options on the menu and above average food and service."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMU1YVkVPWFZqTmxkQmVUUkNXQzFvWkVkSlltYxAB",
            "text": "Our waiter was amazing and so attentive, we received great recommendations from him, and the food was delicious"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0ek1tNXhjME53Y0VoeGVXMVVSVlozYUZONVQyYxAB",
            "text": "Great atmosphere, lovely food, excellent service"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201a2NWTnpWbEE0Y0hSbFVrTkRjVE0yZEc1S2NsRRAB",
            "text": "Delicious!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ock5YaElWVEZ4VG5Sb1RUQk9PVEpYTUVwVVRYYxAB",
            "text": "The Veggie burger with zucchini pancakes was yummy and unique. The filet mignon was nice too. But the baklava- now that was perhaps the best in the city! Definitely have to come back for it! We really appreciated our waiter too, who was very nice, friendly and polite."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JNVoyWk1XRnBVVGt4TllUUkZRVXhWTVRaM01rRRAB",
            "text": "Delicious, really unique restaurant!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkbGVXWnRkV3QyVUZNeGFXOU1PUzA0TjJkUUxXYxAB",
            "text": "Awful service, if you have food allergies don’t order here"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSWIwUXRORWx0U0dORWFXVXlWREE0YXpsalRuYxAB",
            "text": "Very delicious dips and extensive menu but it seems overpriced for the portion size. The interior is really beautiful."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkcVVHTmhiRFJ3WmtGSU1XVnNNMFp1YjNOelptYxAB",
            "text": "Everything was great! Kaya was super sweet and attentive. The bottomless mimosas were strong and the food was amazing as well. It can get a little busy but felt the servers were doing their best and wanted everyone to have a good time. The jazz music was a great addition (if you are hard of hearing or prefer quieter brunches maybe skip out on this.) Will definitely keep this in rotation for brunches and had a great time!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVVduUXhiMnc1Y2tWeU5rcElhbkkyVm1Jd1pWRRAB",
            "text": "The food was great, but waiters and waitresses service was so poor and unfriendly. Got ask to split our table when we were having meal, said they are 6ppl wanna come, took our order without saying any words. Overall the food was okay, but wouldn’t come back"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4dE1uRlljMGRTTUVsQk1qaE1iakp1Wm5OUmMxRRAB",
            "text": "Really great spot for an impromptu early dinner out. Sean was a fantastic server - thanks Sean for the amazing service!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVU9WUnliVXhzZUdaWUxYTnhWRWxITTFrMGNGRRAB",
            "text": "So my husband picked this spot for our anniversary it was amazing.  I had the prime rib with risotto.  It had so much flavor.  Worth every penny.  My husband had lamb kabob special it was delicious.  He got a salad baboganosh and variety of vegetables.  Epic also we had calamari and baklava. Would 100 percent come back."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Nd1lYVlVNbFZyYld4WWQybENlakl0VWpSdFQwRRAB",
            "text": "Food is okay though portions have gotten smaller but I understand  in this economy it’s inevitable.  However, the wait staff especially the women are so rude, curt and condescending I have started to dine elsewhere. There is a reason why this place is almost always empty compared to other places in UES."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSdWQyeFdSa3huWldSS1lsZHpPRWh1UzJOcU1YYxAB",
            "text": "I was there during brunch time, but it was with group of people taking almost half of spaces. I love their food, but very loud I couldn't hear myself. nice staffs!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4MWVGQldlbTFXU1hWd1puUllRM3ByTkcxUGEwRRAB",
            "text": "Tasty food and good atmosphere. Sean, our server, was friendly and knowledgeable. Would definitely return!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWeWVqTnZVMnQwVW0xYU1sbEZXV1pUYVVGSFpsRRAB",
            "text": "Every dish was very delicious and well presented. Service was impeccable and very reasonable wait for food. The highlight of the meal was the baklava dessert which was like a perfect blend of baklava and tres leches. Incredible. We will definitely come back for a repeat visit."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKVmJteFhTVzlDTVMwM1FuRlFjazlMZG01SWRHYxAB",
            "text": "Came all the way from California to have dinner here. The food is phenomenal! Every person in our party cleared their plates (truffle pasta, alla vodka pomodora, lamb kebab, lobster, watermelon salad, cigar feta). Even though we were all pretty full, we wanted to try the desserts because of how great dinner was… and they did not disappoint. Would come back just for the baklava, chefs kiss! Thank you!!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wTFl6RjBNVTQyVG5wVVNtRjVSR2c1UzFoelpsRRAB",
            "text": "Kaya, our server, was very kind :) and food was good too!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJd04xRTVjazFPYjFKVWNHOW9ZbTFZVG1oTFpWRRAB",
            "text": "Grilled octopus was wonderful! Our server Kaya was so friendly. Thank you, Kaya!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkd05ETnpla0ZhUkhGYVptdEVXR3RyTW5SRU0yYxAB",
            "text": "The food here was meh. I got the lettuce veggie burger. It was mushy and not that flavorful. Wouldn’t recommend. The fries that came with the dish were decent though.\n\nI also thought the bathroom was not the cleanest."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUVQycE9RV1IxTlRBd2ExTlhUV3R0TVV3MVVtYxAB",
            "text": "Incredible food, and really accommodating for my two toddlers. Will definitely be back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201SGNHNVJTRWhtY25sdGRrOHdlVlZLTUdkblNXYxAB",
            "text": "The waiter Josner and bartender Adela we had was incredibly nice. Amazing food and dessert"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoZmVXRXhTRlIzU1Y5ZmJWOWZlSEpuZVRBMlNXYxAB",
            "text": "Amazing experience. The food was great. The bartender Sela and our waiter Josner were outstanding. What a great hummus!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NTdIc0JBEAE",
            "text": "I was looking for a new place to try and found this great restaurant the food was good I had the lamb chops, but definitely service was great, the bartender Elif was great, friendly and Attentive."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ObmRtMWlXSEJHZVZWeGN6ZHlXbXB1WWpSME5XYxAB",
            "text": "Our waiter was tremendous - excellent ambiance!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGaFp6UnNUR0k0Y0ZFeVMybHJkbGN4V2xJMmJsRRAB",
            "text": "I went for dinner with my husband and had such a lovely time. Josner was an excellent server, very attentive and kind. I highly recommend trying the Lamb Shish Kebab — it was absolutely delicious!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5UGJFRkNhVmRmWkhKVVFXZEtUakJoVldoVlYyYxAB",
            "text": "The live show is absolute amazing. Their non alcoholic drink surprised me."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kT1JscFBUWEJ4WVRBeFgxaDJibWRSUzBWSk9FRRAB",
            "text": "The baklava is delicious and the service is eggselent"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMza0xfQkJnEAE",
            "text": "Our server Josner was amazing all his recommendations were really good I’m definitely coming back, thank you so much for the hospitality. I went above and beyond with the food recommendations, was my first time here and I’m sure it’s not going to be the last. I love the old good hospitality and Josner gave us that and more. Thank you again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210eWIzcFlNRTUxYVhGaWNIWXlSVTVmU1VjeFgxRRAB",
            "text": "Amazing"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaQmNWUXdZVlp3Y1VONGQxQjZZVE5KWTFKNFZuYxAB",
            "text": "friends birthday dinner was here, such a vibe and great drinks/food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbU5rWjBMVmQwTUdjdFpqUk9ZMTlJWm5Jd1gzYxAB",
            "text": "I went here for my birthday and had such a great time! Beautiful atmosphere, great service, and impressive food! So delicious!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxaFpqQnpkWFp2UmpnM1ZuSmlha1E0TFZkalNuYxAB",
            "text": "Great experience!! 10/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0eVJWZGZielJPWDBrdFF6ZFdTRXBHVGxRNFFtYxAB",
            "text": "My friend’s birthday dinner was here and it was amazing!!!! so much fun!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rMVJWWk5YMjV0YUVsb1lqUkZXbFpMVFVKaVpGRRAB",
            "text": "Overcharged our party.\n$20 a glass of rose while it was order after 4pm happy hour.\nDidn’t want to make a scene since we were treating friends but will never return."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSWVRYQndjbGhZYkU5MGFXSnJORnBDWDIxYWFGRRAB",
            "text": "From the moment we walked in, we were in great hands with Okan, the manager.\n\nHe has a natural for hospitality, warm, professional, and incredibly attentive.\n\nHe managed every detail with ease, made sure allergies were handled perfectly.\n\nThe food was great. The Greek salad was crisp, fresh, and seasoned just right.\nThe Branzino was excellent, flavorful, and somehow both light and filling at the same time.\n\nThe atmosphere is lively and inviting and the service is good\n\nI recommend Blue Mezze Bar (Zoi) and if you are lucky enough to have Okn take care of you, you are in for a fantastic experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KNlNYSlFMWFJxV2toQ1NETnVkazh3WDFsWmNFRRAB",
            "text": "Main entreeFood orders for our party arrived over a 45 minute period even though the menu was limited.  Food was not cooked to proper temperature and some items had clearly sat waiting to be delivered.  Would not recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjMVVWaFRZVmQxZVV3dE9IaExNbUpqVURCZlpGRRAB",
            "text": "I recently dined at this Mediterranean restaurant and had a wonderful overall experience.\nThe ambiance was excellent — elegant, modern, and very clean. The decoration felt refined and fancy, creating a welcoming yet upscale atmosphere.The food was truly the highlight of the evening. The tuna tartar was absolutely delicious, fresh and perfectly balanced. The octopus was tender and flavorful, while the salmon was simply outstanding. Every dish showed great attention to quality and preparation.The only disappointment was the limonada. It lacked the freshness and flavor expected and didn’t quite match the otherwise high standard of the menu.The service was attentive and friendly, making the experience even more enjoyable.While the restaurant was spotless and beautifully decorated, the bathroom did not live up to the same standard as the dining area. This is an area that could definitely be improved to better align with the restaurant’s overall image.\nDespite a couple of small drawbacks, I left very happy with the food, the service, and the environment. I would definitely return for another meal and recommend it, especially for the outstanding dishes."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkQlFWRk5MV2xTYkdJek4ycHVTR1p5TXpKVFMwRRAB",
            "text": "We had a reservation for six on a 95° day and weren’t told the AC was broken until we arrived. There was one tiny unit barely working, and the space was unbearably hot. We ended up staying only because we had other plans afterward, but it felt incredibly inconsiderate both for guests and for the kitchen staff to stay open under those conditions.\n\nThe food itself was tasty, but I would never recommend this place to anyone because of the portion sizes. The prices are extremely high, and the servings are laughably small. When I make meze at home and have that little left on the plate, I usually just toss it… that’s how little they serve. We ordered sarma, and they brought out two sad little pieces. For a table of six, we had to order three just to feel like we got anything at all.\n\nTo top it off, the service was terrible. We spent the entire evening trying to get our server’s attention with no luck. Between the heat, the portions, and the lack of service, I honestly don’t know how this place is still in business."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbXZQN2RREAE",
            "text": "Went for dinner on the patio last night and it was the perfect night! Despite being very busy, the staff was kind and welcoming. We had a few dishes to share and everything was delicious — no complaints whatsoever! But the standout was actually the brussels sprouts, which we ordered last minute, and was incredible!! Highly recommend and lots of appreciation for a wonderful night out!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJMkYxT19Bd04yTzJ3RRAB",
            "text": "The food was great with the unlimited pita is such a steal. The dips were interesting. The octopus appetizer was really good, it’s cooked at a perfect tenderness. The fish was okay, nothing really special. Overall good experience! Would come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SalJuRmxNMWRmWDI5dlluaHhjbWxLYWxwSk9FRRAB",
            "text": "I live on 71st and 2nd Ave and I have been in a few times and it’s always a pleasure. The staff are friendly and are quite attentive to detail.  The hostess Veronica is awesome - my friend left his umbrella last time  and she saved it and remembered that I had called about it ! Quite an impressive memory I’d say.\n\nI always sit at the bar when I come in , the seats are comfortable and the drinks are solid. They serve a Sancerre by the glass which I greatly appreciate and enjoy. The bartender Elif is excellent. She knew the food menu and made great suggestions.  I’m in the restaurant business and she cranked out service drinks to the busy tables all night and didn’t seem to break a sweat.\n\nOverall it’s definitely worth giving a shot if you live in the area,  I am always more than willing to pay whatever it is if the quality is there - Blue Mezze Bar delivers."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPVGtsc0RKdEtMbVFREAE",
            "text": "Dang this was a good meal. Food was stellar, drinks were great, dessert left me satisfied. Sorry I didn't get a picture of my dessert me and my partner ate it to fast. Just make sure not to forget to pair your dessert with a wine or else you will regret it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkbWJEQjNaMFYyYVUxME0wSnJZMFo0Y1d0YVpuYxAB",
            "text": "Oksana was fantastic with us eating at the bar. Great food, and beautiful martini matched by the service.\nNice little upper east side gem convenient to the NYC crowd. Will come again"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeXVqdEpREAE",
            "text": "Loved our experience here! An affordable Mediterranean restaurant in Upper East with good vibes, friendly and swift service, and great food. We had the babaganoush and greek salad to share, then we each got a mixed grill plate, grilled octopus, branzini fillet and laval lokum. Then we shared the baklava for dessert."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBOWJUZE5nEAE",
            "text": "Excellent! Excellent! Excellent! The staff, ambiance, of course the food was outstanding , but the attention to detail, the dishes and gorgeous onyx tables, walls & bar area. Even the cutlery is gorgeous!\nNicest server, Yasin, made wonderful suggestions & the kitchen was able to accommodate a food ingredient allergy. The artichoke avocado salad was delicious as well as the octopus, scallops & lamb kebab!\nVery GENEROUS portions!\nCan’t wait to come back!\nThank you for a memorable meal!\nYou’re the BEST!\n❤️🙏😘"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NVRsbHdNMFkyWDB4YWRtbEhTMEV3ZERCT1JGRRAB",
            "text": "Solid neighborhood place, there are not many places in the UES, this one hits the spot everytime.\nGrape leaves were interesting, had honey on them, calamari was dank, salad was excellent, cauliflower was also good. Healthy light and fresh option, service was nice and easy and the ambiance inside is enchanting."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dmJpc2RBEAE",
            "text": "Sometimes reviews are deceiving! I was highly disappointed by the appetizer filet mignon. It was not cooked right and the quality of meat was low, drizzled with balsamic vinaigrette which made it weird. We tried to replace it with chicken but they charged us for both. Very strange and disappointing cause the chicken was not any better and seemed fried not grilled. The artichoke avocado salad was decent. Not returning"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wamJXVnRNRUpHUzBoeE5GWm1Wa2xrTldKdFkyYxAB",
            "text": "Stopped by for an early dinner/late lunch. Delicious food, beautiful ambiance, terrific service! The mezze options are all phenomenal and the baklava was absolutely amazing. I’ll definitely be coming back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJamNESkFREAE",
            "text": "Amazing service, ambiance and food was top tier! Staff were really nice..im not sure but i think our server’s name was Josh but he was really nice with us and made our uncle’s birthday unforgettable…thank you all very much"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMGF6cHJBRRAB",
            "text": "Lovely restaurant for dinner. The service was efficient, warm and professional. The food was delicious with adequate portions. I had the lentil soup which was excellent and my lamb was exactly how I enjoy it. The restaurant is small and the tables are very close to each other, however to my surprise it didn't feel as close as it looked. Would recommend b"
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kSE9FUmpSelJ3ZEc1Vk5uVndlVXd4ZG5GdVoxRRAB",
            "text": "Migliore di gran parte dei ristoranti italiani... in Italia e una spanna sopra alla media di NY. Well done!\nSolo i dolci sono migliorabili (almeno il baklava)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MEtTVTZBRRAB",
            "text": "We ordered five appetizers as a tapas course and they were all great! Greek salad, zucchini pancakes, the shrimp, the filet mignon and the calamari. The service was fast and the waiter was polite and answered all questions. The atmosphere is great; the restaurant is not too loud and the decor is stylish. I found the backlit marble facades really interesting."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeE5YaXFnRRAB",
            "text": "Sat for Christmas dinner and did not disappoint! Live saxophone 🎷 complimented the entire night. The food was incredible, the portion sizes were perfect to satisfy my stomach and taste buds ✨\n10/10 will be returning!\nGreat for a night out with family/friends/date."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLbkN0Ykc3a2FDRTVBRRAB",
            "text": "Meat eaters and vegans will find delicious options to eat. Fabulous selection of wines.  The sirloin burratta and honey roasted eggplant stand out! Daniella our server was great. The illumination of the marble tables was magical."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MjlhNFNREAE",
            "text": "Solid greek spot! We had the avocado feta dip (8/10), the cigar feta rolls (8/10), the filet mignon tomato burrata (8/10), the lobster tail (7/10), the lamb chops (7/10) and the chocolate dream for dessert (8/10). Nice vibes and good service. There’s definitely better greek food in the city but by no means is this not a good spot."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrMU1HMWpjSFZSUzFWT1QyZ3llRXRWTmtGSU1HYxAB",
            "text": "Beautiful place. Our server was EXCELLENT!!! Definitely would recommend trying this place!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYdnBmY1BBEAE",
            "text": "Excellent and friendly service! Beautiful ambience. They had live music serenading us! They had outstanding brunch - the truffle fries are absolutely worth ordering! They were also very accommodating to hosting us with our dog in their covered patio. Definitely worth coming here!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzMk1mN2RBEAE",
            "text": "Went there for a Birthday celebration dinner. My friends and I like to order family style this way we all get to try more dishes..\n\nAbsolutely everything right down to the sparkling water was great 😁.\n\nOur waitress was the best!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNmRQN2VBEAE",
            "text": "Pleasantly surprised - to say the least - with this cosy little spot.\nFirst of all, hats off to our amazing and super sweet server Adrianna 👏👏👏. We came in on a heavy raining night and she made us feel like home.\nTo the food now, we had the avocado feta (with spinach) spread which was superb. It’s the first time trying that combination as a whole.\nFor the main we had the truffle theory burger (pic) which was extremely light all around. Patty cooked exactly to our liking…All ingredients fresh and the signature sauce gave the extra kick!\n\nAnd to the highlight…dessert : Milk Baklava.\nOMG.\nDon’t ask. Just order. Thank me later."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4T1VrWjVhak0xTFRkV01GTmhaSE5aWkRSU1JHYxAB",
            "text": "Amazing experience! Food was incredible, great service and love the environment."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZellURlRObEZZVW14cFpqbE5hMlpGTjA4MVJGRRAB",
            "text": "What a beautiful outdoor cafe! My salmon w the risotto and asparagus was SO tasty, and the waitstaff was super nice. The chairs outside were comfy / padded but a little faded / worn, so those could use an update, but all in all, 5 stars and when I’m in the UES next I’d totally come here. Very pleasant experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4cHRtT2pnRRAB",
            "text": "The food is really good, anything you order you won’t be disappointed.  The hummus, delicious, falafel is also really good!  I’ve eating brunch here also and the brunch is great!  The outdoor patio is amazing to sit out on.  They have really cute signs and places to take pictures on the inside.  Also, the staff is really nice.  Definitely a must try restaurant on the Upper East Side!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJd0x6SXNnRRAB",
            "text": "We had a lovely Turkish breakfast at Blue Mezze Bar, and everything was fresh and flavorful. The menemen was especially delicious! The cozy atmosphere, friendly staff, and relaxing live music made the whole experience even more enjoyable. A perfect spot for a laid-back morning!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kU1MzcDNTRFIxTmtzeVYzSlhRMU5hVG1wR0xYYxAB",
            "text": "Great food. Great service. Can’t wait to return."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGSWNFVlZUMU5UVjFOVGJsVjZkRVp1VDJNMGJVRRAB",
            "text": "Was there a few weeks ago for a Saturday evening dinner.    Everything was excellent.   We tried going for brunch on Sunday with a very different experience.      I made a reservation for four people at noon.     When we showed up for our reservation it was really raining hard.     They told me that my reservation was for outdoors and we could sit outside if we wanted.     Other than that, they would not honor our reservation.      In my 60 years of making reservations,  I have never had someone do that!  So very rude.   It’s a shame because the food is good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkeEo3QnF3RRAB",
            "text": "Went there for brunch while just walking by.  Must say, will definitely be back.  Great quality off food and service.\nMy daughter had the Nutella pancakes which were delicious!  Had the hot falafel platter which tasted so fresh.  The staff was great.  Really attentive.  Highly recommend."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyaElIRE9nEAE",
            "text": "No live jazz but nice clean upscale ambiance.  Attentive service. My burger was a bit dry but I did ask for medium well after watching a food poisoning documentary."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWdl9iZ3NBRRAB",
            "text": "Went there for a birthday party and we were a party of about 20 people and got the space outside in the sidewalk which was very nicely decorated, cozy and heated and nicely lit, felt like our own private party as we were not mixed with any other guests which was great. The service was great, the menu was very nice and once the dishes came out ever hung was very tasty. I ordered an avocado and spinach feta salad which was absolutely delicious with the garlic olive oil and lemon splash, it was refreshing and I loved the texture since it was more of a dip but I love that as you can see from the picture alongside some bread which was also delicious and fresh and dipped into that and then we also had babaganush and I opted not to order it thinking of how it tastes store bought and this was far from it with great texture and taste and smoked paprika to add a new subtle smoky taste which was a very nice touch. I also order a lamb kebab to go which was a nice portion and tender and very tasty and juicy, highly recommend all these dishes. I would definitely go back there again to try other dishes and they also had a great choice of wines and other cocktails. It would be lovely to go there for a nice evening out for delicious food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNGRqd2NREAE",
            "text": "Amazing place. I had steak egg benedict; it was delicious. Service was great too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdE1uRTV3RRAB",
            "text": "I had an amazing dinner experience with my friends. Our server, Yasin, was incredibly helpful and friendly as we tried to figure out what to eat! We started with a few appetizers and drinks before the main feast, and everything was absolutely delicious. Yasin frequently checked on us to make sure we were enjoying ourselves and asked if we needed anything. It's a 10 outta 10! Can't wait to go there again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NmJiY2ZREAE",
            "text": "We came here for a dinner of 4 and I was surprisingly disappointed considering the high reviews this restaurant has recieved. We're locals and were looking forward to another great restaurant but Blue Mezze didn't live up to the expectations.\n\nFood: The best item we had was the watermelon salad. It was refreshing and the tomatoes were a nice touch. The falafel felt dry and under seasoned. In our mezze we got the Muhammara, Hummus, and Tzatziki. They were okay, nothing too memorable about them. The pita bread that came with it was delicious. Freshly made and well seasoned. The only main entree they had that was vegetarian was the truffle pasta. It was okay.\n\nService: Service was rude and abrupt and impatient. I understand that they are busy but less than 5 minutes after we were seated they kept trying to rush us to order and once we ordered we didn't see our server until it was time to order our main entrees. It was so hard to get our water filled or even catch someone to order more food/drinks.\n\nAmbiance: It's got a great vibe. I love the decor and definitely feels like a fancy restaurant. They also have a live DJ which I think is really cool.\n\nPrice: Given the service and quality of the food, this whole meal felt very over priced. Despite it's great ambiance, it is not worth the price. The food portions for the pasta was not big at all, it could barely fill one person and was costing more than $20.\n\nInsta: @TheShahLALand"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2aHJpd1NBEAE",
            "text": "We had girlfriends brunch here. Food delicious. We enjoyed saxophone music. Service was great.\nGirls loved mezze trio and eggs benedict. I loved shakshuka. Want to come back to explore more from the menu!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taTGJreDVXVTVMUlU5RGJHOWlNa2cwTFdwaExYYxAB",
            "text": "⸻\n\nAll the dishes were absolutely delicious. Having mezes served at breakfast was a lovely surprise. We came as a group of four and left very happy. The waiters were kind and attentive, and the service was excellent. The only downside was that it was quite warm inside — if that gets fixed, everything would be perfect. Thank you!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPYTZ5NnJZc19qbGNBEAE",
            "text": "Our server Yassin excellent..everything is good !! Don’t hesitate to try..you’re going to love it!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwN3JTWjV3RRAB",
            "text": "The good thing is they have brunch till 4 pm on weekends, the bad thing is it's only brunch! Not lunch! We ordered a burger and avocado toast. The burger was fine but the Avocado toast was bland at best! It didn't even have salt I feel. I didn't finish mine!\nI am not sure if I will go back again. Probably! Their Turkish foods should be better as it seems that it's their specialty."
        }
    ],
    "reviews_count": 89
}