{
    "name": "QUATORZE",
    "place_id": "ChIJ8XDAKr9YwokRHkja-tYpvOY",
    "grid": "MN8",
    "address": "1578 1st Ave, New York, NY 10028, USA",
    "rating": 4.3,
    "user_ratings_total": 216,
    "phone_number": "(212) 535-1414",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5Q1lXcG1hemRMTkdnM1drZHlkazVvVTJoclJGRRAB",
            "text": "Three things to recommend: the half chicken, the salad with goat cheese and the French fries. After that, skip it. The salmon was a bland, overcooked and unseasoned nothing and the coq au vin was a gloopy dark mess. Only one person at our table of four found their meal worth eating."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KWGNXOXZWbXBoWkZoUWNrOVFTa0ZKTmt3MVdVRRAB",
            "text": "This was our first time dining and we will definitely be back! Beautiful atmosphere, kind and attentive staff, and excellent food. The duck confit, french onion soup, oysters, and apple tart were standouts but everything was delicious. Can’t recommend enough!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4ek9VNXVhR2xKUmt3emJsOU1XRVpuUXpjdGMzYxAB",
            "text": "This was one of the most horrendous dining experiences I’ve had. The bartender was horrific. He put the olives for a martini directly on the service bar mat, which is disgusting. Those mats are filthy and dirty cups, shakers etc are placed on them. He was inattentive and helped another patron who sat 5-7 minutes after us before even considering acknowledging our existence. He was incredibly rude, I was the only person of any type of color and by that I mean tan from the summer and I can’t help but feel it was a result of that he purposely chose to give us bad service. I will NEVER COME back and caution anyone I know to pass it along. The Sancerre he poured was terrible."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aSVprUjNaV1U1VFMwdGFEVTFVMkpUWVRWU2NuYxAB",
            "text": "Romantic night out with my boyfriend. We had a heavenly meal. Quatorze has a laid back, but classy atmosphere, and the food is divine. Highly recommend the duck magret, as well as the boeuf bourguignon, which is SO tender it melts in your mouth. I had foie gras for the first time in years when I learned it was ethically sourced from farms that do not force feed their ducks. Also enjoyed their roasted oysters dabbed with pesto. Fave dessert is the apple tart. Service is friendly, the chef came out to say hello. What a fantastic date."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMmRsTXlPWFo1WVVOcExUVlNTR3hxVlRoclRVRRAB",
            "text": "This place deserves the highest ratings!!! From happy hour oysters at $1.50 to the perfectly crafted soft shell crab…cooked to perfection. The dessert special last night was a Myers lemon tart topped with blackberries…outstanding!! I’m going back tonight!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KdWIwaFFTRFpWY0Y4eWRVZ3djMVZUWjBoMFlWRRAB",
            "text": "Love this nice French restaurant/ bistro. The menu is point on, a good variety of wine. Have been there about 4 times and I believe that the steak as well the duck are must try."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25reU4wb3dibTlSU0VJMFUyaGtSWGxUVWxKT2FuYxAB",
            "text": "Very good and delicious food. Love the atmosphere. Very kind staff"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sa1Z6ZHBPSEkzWDI1RmRWQlBXWGQ1ZFd4SU1rRRAB",
            "text": "The reason why NYC remains the food capital of America—if not the world—is because of gems like QUATORZE and the masterful touch of Head Chef Adam Ben'Ous.\n\nYou don’t need to endure a 7.5-hour flight to Paris to savor the best Beef Bourguignon, Duck Confit, or French Onion Soup of your life. Instead, skip the $600 round-trip ticket and simply make your way to QUATORZE. Every bite delivers that soulful, comforting elegance you’d expect from a tucked-away bistro in the heart of France.\n\nFor dessert, don’t miss the Hot Apple Tart, Chocolate Hazelnut Mousse, or Crème Caramel. The caramelized butter sugar on the apple tart is a work of art—crisp, golden, and just the right balance of sweet and savory.\n\nWhether you’re on a romantic date, celebrating an anniversary, or simply treating yourself to something extraordinary, this is a place you’ll walk away from already planning your return."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWQk9VMUpYelF3T0RaeGMzZDZXVkYzYTB4dWNGRRAB",
            "text": "Incredible place! Executive Chef Adam Ben'Ous is a first-class chef and wonderful host. Made my sister and boyfriend feel right at home and so welcome.\n\nThe Apple tart desert was amazing and my absolute favorite. Wonderful venue for date night and celebration. No wonder why Quatorze has been around for over 40 years.\n\nMay Adam deserve all the success in the world! And a nice raise to boot!\n\n-Sam D"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paSU0yaEllbmhOVGtWNmVWTndRbFJYVTI1WmRtYxAB",
            "text": "Really great place!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdlNXbDNOMGxoV1UxS1h6ZFZNMUZYV1dzMmQxRRAB",
            "text": "One of my favorite spots in the area to frequent. Great ambiance and great food & drinks!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VNYUprb2FCbFpTcGJnEAE",
            "text": "This place was recommended by Resy.  The service was great and the food was very good, with the saucisson du Lyon and the escargot proving wonderful, but the duck confit and the haricot verts were somewhat tasteless.  The drink menu is very poor, they only had one single malt scotch offering in the bar.  And the place is ok but unremarkable, filled with children at 9pm on a Friday night."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveDlxQlFnEAE",
            "text": "Everything was absolutely delicious."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdHRmRkRREAE",
            "text": "Easily my favorite restaurant on the UES. Imagine growing up loving grilled cheese and finding a restaurant where the chef serves up the best grilled cheese you’ve ever had every single time. This place is that for French standards. Timeless, consistent, no need for frills just incredible cooks on every dish every time. Get the duck confit and the bacon/leek/Gruyère tart, you will not regret it."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJd3BTbWJnEAE",
            "text": "Great spot to frequent. Sit at the bar, get a martini, some oysters, the chicory salad and the steak. Thank me later."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dDZEUlpnEAE",
            "text": "Been a couple of times, always solid."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dzlpN1B3EAE",
            "text": "Same old boring over priced menu for decades, even their rotation \"specials\" are worn so you would think that they would get it right after all that time but as numerous reviews state they continue to botch it far too often.  As far as the atmosphere, WAY too cramped of a space even for a bistro. The original Quatorze was a broom closet, this is a pantry at best.\nAnd the original owner is a rude, elitist, bitter old boy which in turn has trickled down to the staff over years and this informs the general negative culture of the place. If you draw a lucky night and this approach doesnt fully fall on you then great, but if it does well, my humble suggestion is to just sidestep the potential for abuse.\nNow after reading all the other negative reviews and godawful responses/excuses I'm going to bet the response from the owner to this review will be flippant at best and that is to be expected but do yourself a favor before taking a chance on this place or even my review...READ THE (lowest) REVIEWS. There is certainly enough content there to go by even from long standing patrons.\n\n**  NOTE from what I've gleaned from the snippy responses by the owner to customer criticisms the response that will follow will tell you all you need to know as it will most likely illustrate much of what I outlined above and will also support all the other numerous negative reviews as well!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3OElPNEdnEAE",
            "text": "Bienvenue to Paris! There’s clearly a reason this place has celebrated 40 years. If you're on the Upper East Side and looking for a French bistro that checks all the boxes, Quatorze is the place to be. From the moment you walk in, it feels like a cozy Parisian getaway, and the team here makes every visit feel special. Alex, one of the managers, is always on top of things, ensuring everything runs smoothly with a warm and welcoming vibe. He’s definitely a big part of what makes this place feel so personal and inviting. Adam, the chef, always has something up his sleeve but keep the flavors true to a French bistro.\n\nNow, let’s talk about the food—the steak frites here are out of this world. Perfectly cooked, juicy, and tender, with the crispiest, most addictive fries in Manhattan. No exaggeration, they might be the best fries you’ll ever have!\nThe tarte de pomme is the perfect dessert to finish off your meal—it’s light, delicious, and just the right balance of sweet and tart. Maybe a Roquefort and a Sauternes to really round out the experience. But the day they make a crème brûlée I will be ordering dessert with every meal.\n\nThe staff here makes all the difference. Carlos is always there with a smile, ready to lend a hand if you need anything. Justin is another standout—this guy can carry more drinks than I thought possible, and he does it all with a huge smile and effortless style.\n\nAnd of course, Gabe and Fernando, the bartenders, are a gem.\nIt’s the perfect spot for great food, amazing wine, and a team that makes every visit memorable. It makes you feel like you’ve taken the quickest flight to Paris possible."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3Z3R2RVpnEAE",
            "text": "Perhaps the worst host in New York City. They will not only talk about you behind your back, but they will practically spit at you as you walk into the restaurant. Our family loves the food and live down the block so we dine there at least 10-15 times a year, but every time we go it’s amazing how rude and aggressive a person who is the face of a restaurant can be.\n\nThe servers also seem to hate the host, as evidenced the knowing glances we always get when we mention how awfully we are treated, and the turnover of servers. No one wants to work in that uncaring an environment.\n\nThey owners have a wonderful restaurant if they could only find a way to offer just basic service to their customers."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dElpeWZ3EAE",
            "text": "Extremely unwelcoming. It’s basically a private club, if you have never been before it’s really not worth your time because you won’t be served the same food or given the same service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3aE1DUzNBRRAB",
            "text": "Decadent, rich food. The duck was fabulous, however the recommended main (sausage and kraut) was a bit disappointing. The service was fine, but not focused on the attention to detail or polished. The decor was cute and had the desired French feel. It was obvious they were catering to an older clientele, so it makes sense that the lights were bright, it was very very warm, and there was no background/mood music - I felt very sleepy by the end."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNFlMT2lBRRAB",
            "text": "Located in the UES, this restaurant offers traditional French cuisine with specialties such as Foie Gras and Onion Soup. We also tried the Escargots but were not something to write home about. The Duck Confit was crisp and tasty. The Apple Tarte for dessert was very good. Service was attentive and the ambiance was classic bistro."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbkpXX0VnEAE",
            "text": "Great food and always good service!\nThe Profiteroles are insanely delicious.\nIt’s a true favorite"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnazczVENBEAE",
            "text": "Fancy, white table clothed UES restaurant. A little old school but there’s a reason why it’s been around for so long. Wait staff was attentive and the food was delicious. Would definitely recommend the French onion soup."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndUlfSGFREAE",
            "text": "We had the best night in the private room downstairs. Food, service and the space were incredible. Would highly recommend to anyone looking for a private dinner room!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfbGJ6RTlRRRAB",
            "text": "I came here after reading an article in the Financial Times about Eric Ripert's favorite restaurants in New York City. Ripert's favorite Choucroute garnie did not disappoint. The sausages were delicious as was the sauerkraut. The restaurant's name derives from Louis Quartorze, as also demonstrated by some nice artworks in the restaurant."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOGNqNlJBEAE",
            "text": "Service was great. Very nice dining space. The food was just OK overall for me: bread and butter 5 out of 5, French onion soup 2/5 (tasted watered down), escargot 3/5 (nice flavor w the mushrooms but the presentation was rough), mixed salad 4/5, beef bourguignon 3.5/5 (starter out very good but when the sauce ran dry, so did the meat. Good flavor nonetheless.)  Has the meal not been as expensive, I’d have probably been more forgiving. Still worth a visit to try out a new place and give ‘em a shot."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmay1pOHN3RRAB",
            "text": "My visit was on a Saturday with my relative the food Delightful and Delicious.  The staff was very kind and show great customer service.  Chef did a EXCELLENT job on everything.  I will be back again,  to try other foods."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2OU92aE53EAE",
            "text": "Noisy"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQeFlLRC1nRRAB",
            "text": "Very nice place on the UES. Unfortunately the best dish was the dessert! Out of this world. The chicken tasted like it was reheated from the previous night and the steak was tough."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQZ2JLbVVnEAE",
            "text": "It’s hard to believe you can get a food this bad in NYC! Steak was so hard and chewy! Roast chicken was so dry that we couldn’t eat it. Escargot dish was pretty much mostly mushroom. Definitely overpriced for the quality of food. The baguette was the only thing that was great. Overall very disappointing specially after all the reviews we had seen online."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzOGVMdWt3RRAB",
            "text": "So happy this French restaurant is in my neighborhood. Love coming here for lunch/brunch. Generous portions. Friendly, welcoming staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuLWJHbFJnEAE",
            "text": "The food is great here. Love the onion soup among all the French restaurants at UES love the one from here. Duck is fabulous, I did not love the apple tart, the crust is so thin that tastes burn when reheated. Staff is friendly and chef is super nice, he touches the tables."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucnZUWmpnRRAB",
            "text": "SHAME on  them for charging a precent to use CC"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIbU9HZUd3EAE",
            "text": "A wonderful restaurant with amazing duck dishes. The service is excellent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNibW9TR3ZBRRAB",
            "text": "Perfect place for a nice, delicious dinner. I love their boeuf bourguignon and wine selection. They also have wonderful profiteroles. Very nice service at the bar."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6MEwzRGNREAE",
            "text": "The food and table service were great. The reason for the one star review is based on an incident that occurred when I dined this past Sunday June 2nd.\nI had overheard the hostess or the maitre’D  Belligerently making references to a customer that she just hung up on. I was so thrown off I thought it was a one off thing but as I payed closer attention to this person further,  it continued with multiple people and scenarios. To quickly summarize you can’t constantly be negative even if things frustrate you because it throws off the whole dining experience and made me question what this person would say about me if I upset them and it really ruined my dining experience. I will return when this hostess has a better attitude and appreciates that without customers there will be no restaurant and even if things frustrate you can’t loudly take it out on others."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6OWY2QlBBEAE",
            "text": "The waitress came by and took the time to explain what options my vegan girlfriend had along with some different modifications she could make to the dishes to fit her dietary restrictions. I had the duck confit along with the gruyere tart. The duck was the highlight for me, it was the kind of meal that leaves you feeling warm and relaxed at the end.\n\nWonderful service and excellent meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUeWNIVk9nEAE",
            "text": "Walked in with friends on a weekday and got a table. A nice place to eat, good atmosphere to chill with friends. Service is good and attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUeksyT3RBRRAB",
            "text": "We had an outdoor table that was wonderful. Service was impeccable and prompt. Had the grilled bronzino it needed some butter sauce. The duck confit was excellent. Appetizers of artichokes and a mayonnaise side was excellent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbmFmYXp3RRAB",
            "text": "My friend and I just had the most horrible experience at this place! They dumped the food all at once, soup, salad, 2 appetizers, just because they were rushing us at 9pm that we had the reservation for,  so then DONT take people at 9pm if you rushing out! They bought us a steak imposible to chew, and when we complained the lady was so rude basically said if we wanted a second steak we will have to pay for it! Please do yourself a favor and don’t come to this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUekpxaldBEAE",
            "text": "I love quatorze! The service and food is great! I recommend the lardons salad, the grilled chicken and the profiteroles."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqOVphRjBnRRAB",
            "text": "We went n our first night in town and returned for our last!\nYelena(sp?) was an incredible server, and everyone was beyond expectations. The food is too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqdGJ2YkRBEAE",
            "text": "A place for grownups.  And the next best thing to Paris."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqbEtqX1pBEAE",
            "text": "Lovely space for a martini and fries at the bar or a delicious dinner on the Upper East Side. Staff is so welcoming and the owners are around to shake hands and greet tables. This place is a gem ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREeUl2TXF3RRAB",
            "text": "Bad experience, do not eat here.  I ordered rack of lamb, medium.  Came so well done, was not edible.  When I told them, they were annoyed and said it would take ten minutes.  I  said ok, then they bring it out again totally raw.  By now my group is done eating, and they bring another and now I don’t want it.  They act like I did something wrong.  Sorry I don’t deserve that treatment.  Stay away!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURObVB2ZU9REAE",
            "text": "Quietly the best burger in the city, only served at the bar.  All the staff is so friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxaHByU3N3RRAB",
            "text": "Great atmosphere and service, recommend sitting at the bar! The steak frites are pretty good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1bk02blhnEAE",
            "text": "A classic Paris brasserie with a modest menu selection of perfectly prepared foods. Absolument delicieux."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1MDgyc0ZREAE",
            "text": "The food was excellent, the staff on point, and the atmosphere couldn’t be beat on an Saturday night!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoejhyd1BnEAE",
            "text": "A solid performer in our UES French Bistro rotation. We’ve only ever dined at the bar and the service is professional, friendly and entertaining.\nThe Steak Frites is always top shelf and the Cassoulet special did not disappoint."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtOE1tNXVBRRAB",
            "text": "Quatorze feels like a warm hug from your chic French aunt. As soon as you walk in you feel at home and totally transported at the same time but without any pretentiousness that can come with NYC French restaurants. We were there to celebrate my husband’s birthday and had an amazing night.\n\nThe staff was wonderful and our server Abbey was lovely and there when we needed her but didn’t hover or rush us even though our reservation was late. Everyone that came by our table wished my husband a happy birthday which was such a thoughtful touch.\n\nThe wine list is great and I loved the cote du rhone by the glass. My husband judges restaurants and bars by whether or not they stock fernet branca and obviously they do which made him very happy.\n\nThe food was fantastic. Fresh, briney east + west coast oysters, a goat cheese salad with an herby dressing that I wish I could make at home, and perfectly cooked duck magret. The standout for me was the short rib with potato purée which was incredible.\n\nWe hope to be back soon, or whenever we want to feel like we’re in Paris for an evening."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPc3ZucUxnEAE",
            "text": "Our favorite French restaurant in NYC. The food is incredible, the room is beautiful and charming, and the staff is wonderful. A true UES staple.  Highly recommend!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCOG9fZjhBRRAB",
            "text": "The chicken was really dry and inedible. Beef tasted very weird. The food was awful. Avoid. The deli would have been better on a Saturday night."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyX01QTmFnEAE",
            "text": "Lovely, quaint, and family-owned classic French bistro on the Upper East Side. Our feast consisted of oysters and Pol Roger Brut NV Champagne to start along with sauteed chicken livers, mushrooms, and sage. The main courses were savory and…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaMHFEV1JnEAE",
            "text": "The oysters were so fresh, and the east coast west coast combination was delicious. Can't wait to go back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyOXZ2RG1BRRAB",
            "text": "New location on 81st. The escargot a la bougogne hit the spot. The cassoulet left me craving for more."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbnBpWjZnRRAB",
            "text": "This was an authentic french restaurant. Such a warm and inviting decor.  Staff were top notch. Food was perfectly prepared from appetizers to desserts. Great quality ingredients.  I had the smoked salmon appetizer and salad.  Then salmon main course and the apple tarts for dessert were amazing!! Great wine selection. Highly recommend for an intimate dinner with good friends."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtXzVqSlVnEAE",
            "text": "Very nice french restaurant, the food is fine and the service is great.\nI liked the vibe and the location"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtN2F5QjRBRRAB",
            "text": "An excellent meal at this beautiful French  Bistro. The decor is clean and crisp with beautiful French posters everywhere. The service was excellent and very attentive. Our meals were excellent! My wife had the roasted chicken and I had what was possibly the best duck confit I have ever had. We also got a side of brussel sprouts that were great! We will be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtX2ZidVh3EAE",
            "text": "This restaurant is absolutely delightful! The servers really pay attention to detail and are genuine and lovely people. It’s really wonderful! The food is outstanding. By far some of the best boeuf bourguignon in NYC. The dish is dreamy! They can sure roast a delicious chicken as well. Wine pairs perfectly with everything. Such a gem!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCbTV6VHl3RRAB",
            "text": "Very nice French bistro atmosphere and appealing classic menu. But they could do better in the kitchen. Oysters were ok but not that fresh. Their signature dish steak frites was very good on the frites and a decent bearnaise sauce but steak itself was over cooked when asked to be medium rare. It could have been good and should have been at that price. Endive salad was good. None of these dishes require much preparation so it’s a bit surprising the kitchen struggled so much. Redeeming feature was wine by the bottle where they had some good selections at a fair price.  That said wines by the glass seemed more hit and miss - champagne had been opened a few days earlier so flat and uninteresting."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCbkxfTXFnRRAB",
            "text": "Quaint little french place in Yorkville. Prices are on the higher side, but their food and service is excellent. The manager and owner is always there on weekends, and it has a very personal vibe. The bar is always very lively and it is a great place to hang out and get dinner if you are eating alone. The standing menu is a bit limited, but there are frequent rotating specials and the quality is excellent all around."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlOHBiUVpREAE",
            "text": "Quatorze is an elegant haven of excellent French cuisine. You really cannot go wrong with anything on the menu. Portions are generous and with high quality ingredients. When my entrees came out, I was absolutely floored. Boeuf bourguignon and calves liver...wow. Two classics I highly recommend. The restaurant itself has a peaceful ambiance, sometimes very lively on weekends. The staff is wonderful, and you can tell the chefs and cooks really put a lot of love and care into the dishes. Want to experience Paris in NYC? This is it. A wonderful spot to take friends, family, or just to have a quiet solo-meal at the bar. I've sent my French foodie friends here and they've become loyal customers. I'll definitely be coming back to this neighborhood gem."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbWJtOEx3EAE",
            "text": "Decor and our server were great. The beef bourguignon and pomme frites were also very good. What missed the mark and reason for 3 stars was the profiteroles. This is a classic French dessert and it just was not good - the puff tasted stale,…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaanNQRWVBEAE",
            "text": "We’ve been eating at Quatorze for over 20 years. Goat cheese salad was one of my favorites tonight it was not edible. I sent it back because I couldn’t even cut it. It came back again the same way. No adjustment on the bill. I asked for a better knife to try to cut it. No luck very disappointed.  Poor service, and attention."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyeXN2cEZREAE",
            "text": "Update 6/22    I love this place: an attractive, welcoming room, not too loud, with a lovely vibe; well-prepared French bistro food with inventive weekly specials; professional and friendly service.  As eating out gets more expensive, this neighborhood spot offers a dependably satisfying experience.\n\nHolds up, a year plus in its attractive new neighborhood location.  Delicious bistro food and friendly servers. Quietest early in the evening."
        }
    ],
    "reviews_count": 67
}