{
    "name": "Bigoi Venezia",
    "place_id": "ChIJgdnYQcBYwokRDEGzKagrEfE",
    "grid": "MN8",
    "address": "1415 2nd Ave, New York, NY 10021, USA",
    "rating": 4.8,
    "user_ratings_total": 775,
    "phone_number": "(917) 262-0680",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JNFZEVkdkV1Z6V2xkbk9GUnBXR2hPT1ZBeFJFRRAB",
            "text": "The best homemade pasta and sauces in NYC."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKQk0xQlJTR3R2YjFsNVRHVm1NVkoxTW1sSVZIYxAB",
            "text": "The mushroom pasta was so delicious!! 10/10 Recommend"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOR2FETkNkV3hQTXpsVFRuZFdabVpvZGpGNU0yYxAB",
            "text": "Sebastian's the man! Super sweet guy - Authentically fresh pasta, quickly made to order. Recommend the Oil/Garlic + Puttanesca .. will be back again!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Bd1pHRjZXSEJyWkZwdFpFeHlNakI0U21zeWMzYxAB",
            "text": "Proof that you can have quality and affordability at the same time"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WQ2FUbFZYMlJIUmtsWFJFc3lkbVE1YzB0alQxRRAB",
            "text": "I can’t remember the last time I enjoyed so much a freshly made pasta 🍝 with such a delicious tomato sauce that brought me back to my childhood, and enhanced even to higher levels of flavor!!\n\nMe and my partner were surprised when the chef and owner of the business came to our table to ask us our opinion about the dish, such a lovely humble man! You can tell he loves what he creates and does, and his passion about cooking and of course Venice!\n\nHe told us about where he came from and had a very lovely personality.\n\nThe girl on the register is very very sweet as well as the other man helping in the kitchen.\n\nThe pasta is thick and reminded me of udon noodles, which we loved!\n\nThere is so much variety of dishes! I loved that!\n\nWe can’t wait to go back to try a different dish!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kd05EVlVlbmRwZDFFeE5HUTBRemt3YlZSWFYzYxAB",
            "text": "Delicious, generous portions"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxeFREUXdOemhvZVhobFZFVlVVV2hQYmtsbFpHYxAB",
            "text": "Quick, easy, and delicious! The staff is incredibly nice as well."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swd2VVNDNNbXR2VW5keVFUaGxaMjAxY0VKSlJuYxAB",
            "text": "It’s the little things … ended up just eating my MealPal lunch in their space, and the person working the register thought to bring me a cup of ice water. Great service and great food!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKU2FXOVBkbll3YW1OWU0wWnNYelJhYTBkMmRYYxAB",
            "text": "Awesome house-made pasta dishes at a reasonable price. Don't think you can wrong with anything here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214bVdrbFRlbkZMYURWZlV6QlNMVzV4YTJOamNrRRAB",
            "text": "Carefully prepared food, good portions, very kind staff."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwV1oxOWZNbll6ZWpGeWNXdHNjbU56Y0ZwV2JtYxAB",
            "text": "I'm born and raised in Italy, I tried pasta here for the first time and I can tell you: this is the spot!! Pasta is fresh, al dente (I had puttanesca) and tasty. Prices are affordable and service was fast, I ordered and after 3 min it was ready to go.\n100% recommended."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsdmREaGFXRXB2VmtSV1VFVTRRVjlQVFRCR00zYxAB",
            "text": "One of my favorite Pasta restaurants! I no longer live in the area, but still come up to the UES from Astoria often for Bigoi Venezia. Sebastian and staff are always so warm and friendly. Will always recommend their pasta to friends and family✨"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSlMwRm9WVXBIYm5wNU5VcFBaRU5wTW0xSVFuYxAB",
            "text": "I love pasta as any normal human would. I had this for the first time and I'll say the Pepe was amazing, I have short memory so I don't remember what I really had. The pepper was really strong and the cream was delicious, although the amount of strong pepper was a bit to much for my low spice tolerance, otherwise four stats. It was 3 minutes of waiting and just felt really cute and hidden."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rNVNXTnNjSFZ1ZWpFeVpVWlJUM001Wm5VMmIwRRAB",
            "text": "Very good pasta. My pasta was a bit too spicy though, make sure you ask about spiciness."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214NlgyaHJORFY0UWkxUFFWWkdXVU5RWlZOaFZHYxAB",
            "text": "Ideal place to come in and enjoy fresh pasta for a quick lunch or dinner. Clean and quiet.  As someone who is often overstimulated by the sounds of New York, I was so happy to sit inside and eat somewhere without music playing over loudspeakers. The food came out very quickly but that doesn’t mean quality was compromised— it was delicious. It came with a side cup of real grated parmigiano. When I asked for the rest to go, they provided another side cup in the bag without having to ask.\nThe woman at the register is wonderful. I couldn’t decide what to order and she offered to get me samples. While I was eating, she stopped by to offer a water refill for my cup and my reusable bottle.\nIt’s clear that the owner is passionate about providing clean, good food to people juggling busy lives in New York.\nIn summary, a small shop where every aspect reflects genuine passion for providing excellent food and service.\nTruly a gem, wish there was one closer to me!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsdE4yMUpiWGwwZFZCc00wd3ROMlJxT0hwV1RGRRAB",
            "text": "I LOVE BIGOI VENEZIA! First of all, the owner is the kindest man in the world. Sebastian is from Venice (hence the name Venezia) and he and I had a whole conversation about classical music in Italian because I speak it a little. He told me that the pasta he makes, Bigoi, is a Venetian pasta that you can’t find in America. His Al Tacchino is my favorite and the pasta is chewy but has a bite to it- perfectly al-dente. I would go back over and over again for the pasta and the conversation."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWcWQyaFhhbFJ2UW5ObmFuTnllVzlIYmpsMlNXYxAB",
            "text": "Super tasty & generous portions! I had the ragu and my boyfriend got the aglio e olio and both were great! i think our fave was the latter though. the employees were super sweet and the chef even came out to talk to us! love the texture of the noodles too"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rNFgwRkxMVWREVlVaWFZHTXRWMkkyYWt4aFkxRRAB",
            "text": "Food is really good here. Best for to-go, but we did eat here once."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0U0xXaFNUVlIwZHpJdGJXOUhSRkZ4VjBWME5IYxAB",
            "text": "The food was amazing! Fresh pasta with great texture, super tasty sauce, and generous portion sizes for a very reasonable price in the city. 100% recommendation!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Ka01rVTNXVUo2V0dsUlRYbG5OMWRUUjJWNVJXYxAB",
            "text": "This place truly deserves the high ratings. Superb pasta that took us back to Italy.\n\nThe Puttanesca was pure perfection. Pasta cooked al dentale, a sauce that was so deeply flavorful and well balanced with a generous serving of olives. Absolute bliss.\n\nThe Galion Olio was a great rendition as well and a garlic lovers dream. Again the flavors were spot on and the garlic, red pepper and parsley were in perfect harmony.\n\nThis level of pasta out of a quick service restaurant is very impressive. High quality ingredients at an excellent price point and a perfect portion.\n\nHighly recommended and can't wait to be back to try some of their other flavors."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGS1RFSTFSM1I0VGs1bFZqaFpZbTB5ZVhOeWJGRRAB",
            "text": "Good portion sizes with affordable prices. The texture of the noodles is perfectly chewy and I love how firm they are, just like the ones I had in Italy.\n\nThe owner/chef is kind and provides excellent service. Even though this is more of a takeaway place, they still offer dine-in service which is a nice bonus."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oME0ycHNXSEo0Y0ZGQ1lUUTJSek5RWTNJNWFVRRAB",
            "text": "This place deserves far more than 5 stars! We recently discovered it and absolutely loved the experience. The food is unique and delicious, with pasta freshly made right here in the restaurant. I also had the pleasure of speaking with the owner—such a wonderful person. I wish him all the best with his passion!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1ZmNXNXJXbEpLYTA4NU4xSnVTemRWT1ZkYVJXYxAB",
            "text": "Fresh pasta!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sd1VXMW9ZMnd0Wm1aNldEUnpaamd0T0VaT1IzYxAB",
            "text": "Such a great place! Service and food is always on point! 🫶❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWVVpFNHdlRWd3T1haWldEbHVkMUJoWmw5dGRIYxAB",
            "text": "Delicious food fast! The chef Sebastian is very friendly and passionate about his food. We will be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWExXMTBTbVJzUW5kM1EwWkJOM0ZuVDJGVVluYxAB",
            "text": "long ago, i survived CoVid lock down on 3 restaurants, Mcdonalds, indian resturant, and this one.\n\nalways fresh and always on point.\n\ni have left nyc long time ago, went around the world trying pasta, but i always want to come back and taste the Ragu here, maybe the survival instinct is kicking in/talking, but this place never disappointed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wRGMycGFRMVk1Tkc1S1lWcGFXSHBzVkZsWFVrRRAB",
            "text": "The best and most authentic pasta in upper east side! Especially for the price! The service is so fast and everyone in the store is so lovely. The pasta is fresh and so chewy! Definitely will be back to try more sauces."
        },
        {
            "date": "2달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxelRrSkdWWFZoYlc1T1JFWjFhak15UkVvMGNGRRAB",
            "text": "Lieu chaleureux à découvrir dès que possible !\nLa jeune femme qui m’a accueillie était souriante et adorable, et le chef cuisinier également. Il est venu me demander si la Clim n’était pas trop forte, si les pâtes étaient bonnes et si tout allait bien pour moi. J’ai choisi des bolognaises, elles étaient délicieuses. J’ai même pu charger mon téléphone.\nDes personnes adorables et un service d’une grande qualité. Je vous les recommande vraiment. Encore merci ! ☀️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WVVgyOUVTMjFZZFRCblR6WXpYMkp5UWpoU1kxRRAB",
            "text": "$15 plate of handmade pasta. Taste like you are in Italy. The workers are so kind. 10/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kclYyZFNVMkkyY2tGUlZXeG5RVzVUUjI1bFpXYxAB",
            "text": "Absolutely delicious fresh homemade pasta. Have it on the go, have it on the spot always. They are absolutely great. You don’t need to fork $40 for this and they are superb: Aglio, Olio e Peperoncino - Garlic, Extra Virgin Olive Oil, Red Pepper & Fresh Parsley & Bolognese Classica - Ground Beef, Pork &\nTomatoes. are my favorites ❤️❤️❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjemNsZG5TVGhwYkdSd2NXMTNhekJxYkVGVlZVRRAB",
            "text": "Hommade pasta and a lot of meat inside."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMdjB2NF9oa2YyTElnEAE",
            "text": "Excellent food, friendly service! Outstanding-we go every time we can! Grana E Pepe dish was exceptional!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oYVkyVndhVXRwTTFFd09IRXlaR3N3ZUVOVFZXYxAB",
            "text": "The pasta was very flavorful, delicious and the price is reasonable. Will definitely be back and try other pastas on the menu!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNlVFZDFhMGN3VUhkd01qWkxha2RMV1ZWdmMzYxAB",
            "text": "Such a lovely place! Hand made pasta in the highest level I’ve ordered. Very kind staff, amazing experience"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnMlIyRkphblZQUkVzMUxWOXNVa2RGVjI5TldYYxAB",
            "text": "The pasta was absolutely delicious! Everyone here is so kind, especially the sweet owner who prepares all the pasta himself! I highly recommend making a stop here for a great bowl of pasta."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdGRXMUdUMHBxVUdaUVJXUlBSMUZzUzNkUU9WRRAB",
            "text": "The noodles were really thick and nothing like authentic Italian food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OdmFVMDVORTF6VldOZkxUSTBTVlp5YWxwa1dXYxAB",
            "text": "As an amateur of Italian, “Al Dente” pasta, this restaurant did not disappoint. The sauces are delicious, the Parmesan cheese is tasteful, and the pasta perfectly cooked. The staff is also wonderful! Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUlltOXpabGhuWjJjeVJsaDRSWGxTYUhsQk1WRRAB",
            "text": "Io e le mie amiche siamo andate oggi per pranzo; servizio ottimo e personale cordiale. Piatti buonissimi e che rispecchiano al massimo i bigoi veneziani, portando un po’ d’Italia anche a New York. Super consigliato"
        },
        {
            "date": "3달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOSGJXcHlaR3RpZFVNNVZrRkxVRnBFWDFBNVpFRRAB",
            "text": "Esperienza ottima! Sono venuta oggi con le mie amiche e siamo rimaste davvero soddisfatte. Piatti buonissimi che rispecchiano quelli italiani. Il signore gentilissimo e disponibile. Servizio veloce. Complimenti👏🏻👏🏻"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poVFpHbHpNRWgxVWtGTlJIbFJiVFpWVDI5bE5HYxAB",
            "text": "literally the best service ever! the girl with pink hair is soo sweet and the pasta is very filling"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCTGVFMUZSV2g1V0VOQ1NuTmphalp3UkVaRlZGRRAB",
            "text": "A tiny slice of heaven was found when my daughter and I went to this restaurant. We walked 40 minutes to get here and boy was it worth it! The food was delicious and we finished every last drop. Generous portions and very friendly people. We met what we believe was the owne, and he is a gem.  I have been to Italy and this pasta was better than anything we experienced in Venice, Rome, Positano!   Thank you for a wonderful experience. I only wish you had a bigger restaurant closer to where we stay."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOVFNVMTZUSEJLTFRFM1kxUXRkVUY2UzFwMFRHYxAB",
            "text": "Everything was fine, but the al pomodoro did not taste good. I’m talking absolutely zero salt, canned sauce with barely any of it, and thick hard pasta. It gave me very airport/middleschool cafeteria vibes, and for $16 that’s absolutely unacceptable"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wck5IRm9iR2hyVlhkYVNGWkpPREpSY2xsYVIxRRAB",
            "text": "Fantastic spot for gourmet quality food in a fast casual format. Perfect spot for a delicious post-workout meal if you go to the gym on east 74th."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSdk1XOHlRMnczUzNGTWNGSmpRM2hvVjFOSFRHYxAB",
            "text": "actually good food. restaurant is a bit unassuming but otherwise perfect"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NNVkwNXhlRW93Y1ZNdFZpMXhkbHBhVW5FM2RuYxAB",
            "text": "Very quick and delicious meal"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwQ2FWZzNURUZHVVVSb2NqQk9kWEp1VlVWeVgwRRAB",
            "text": "As a tourist I am really impressed. Very affordable, the pasta texture is something that I never experienced but is quite pleasant, and the sauce was really rich with flavor. Definitely coming again to check other menus."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OTVdqZFRjRVF0V1ZKV1UybDZOa013V1hGRVkxRRAB",
            "text": "So frickin yummy. Big thick chewy spaghetti. Very sweet staff - savory and hit the spot just right"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OdGFERndha3d6YUdGdE0xOUNZMHBsU0RoVWIxRRAB",
            "text": "Super bien de precio y riquísimo!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJM1FzNHVIelphWjh3RRAB",
            "text": "Amazing pasta! Immediately could taste how homemade and fresh everything was.  Easily the best pasta I had in nyc, and perhaps ever.\n\nThe owner is also very sweet and was lovely to talk to, I had to go back and tell him how delicious the food was.  Will definitely make this my go-to for pasta!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubHZMcndRRRAB",
            "text": "Pasta and only pasta! in a variety of flavors that are prepared on the spot. Everything is fresh and delicious. Big portions and really reasonable prices. Of course I will return at the next opportunity. I saved the place😀❤️🙏🏻"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNy1hVXRBRRAB",
            "text": "5 stars all around! A neighborhood staple fresh pasta joint. A simple menu, food featuring the same fresh perfectly cooked pasta with your selection of sauces! The pea prosciutto sauce is my favorite! The bolognese one is also a classic go-to. Eat on a stool at the small tall counter (with a real plate and fork) or take it to go. Such kind and friendly service and a clean place. They are quick, and the pasta is fresh and hot! Enjoy!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOGJhOW1nRRAB",
            "text": "Lovely Pasta, the Flavour is Authentic\nAnd Pasta is Freshly homemade at the place 💛.\nPrice is reasonable, When i am there crowd customer.\n\nFor sure the Owner Mr Sebastian is really Friendly\nStaff Ms Aping is Cheerfull, also Chef Mr Filipe \"Aglio Olio\" is Delicious..."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMVzBpZExUaWRHd3FRRRAB",
            "text": "Everything was excellent. Fresh pasta, homemade tomato sauce, and the chef himself brings the dish to your table. Quick service and fresh dishes. I definitely recommend having a plate of pasta with Chef Sebastian."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdHEzWUhREAE",
            "text": "Excellent pasta, perfectly cooked with rich and generous sauces. Love this place. Sebastian (the owner) is very nice, we had a great chat and enjoyed our time at Bigoi.  His staff are warm and very helpful. Highly recommend this place. Excellent food and value for money!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdGFQZGRnEAE",
            "text": "Mama Mia! The best pasta I have ever had, many simple and complex sauces with homemade pasta. The owner was also there and he made sure we were enjoying our food and loved to talk about his home made pastas and sauces, amazing NY water, Italy, and life! Amazing"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdDQ3STFRRRAB",
            "text": "A gem! We loved our fresh pasta!! It came out within a couple of minutes and was steaming hot. Cute little spot too with a few bar stools to sit at."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbTktSktnEAE",
            "text": "If you are looking for the best pasta in the world- you found it!!!🤩 Definitely the best you will ever get.\nThey have a smaller selection of around 10 pasta meals but each of them is pure perfection. You can decide if you want some for take away or eat right there. They even gave us tap water without even asking but you can also get fresh drinks! (Also they have a lot of vegan and vegetarian options🌱)\nAlso you could not get better service…they are definitely the nicest and sweetest people ever and will check if everything is alright or love to tell you everything about the fresh self made pasta and the idea behind their little pasta restaurant.\nI have visited last year for the first time and have eaten there 3 times in 7 days. It is really the best spot in NY and one of my absolute highlights in the city. Best price, best service and the absolute best pasta ever!🍝"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNROTdPakdBEAE",
            "text": "Amazing experience, owner personally came out to explain his genius and his story. Everything is made fresh with the freshest ingredients AT AN AMAZING price! Definitely will be returning."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3OVlMUElnEAE",
            "text": "Lo encontramos por casualidad caminando por el barrio. Nos sorprendió el concepto y decidimos probarlo. El local es pequeño y acogedor, muy limpio y cómodo tanto como para comer alli o si pides para llevar. Es un lugar mas para un bocado rápido. Pedimos un plato para compartir porque no teníamos mucha hambre, pero el tamaño de la ración normalmente es para una persona con apetito. Pedimos Ai Fungui, con champiñones crema y perejil fresco. Fue una muy buena decisión, la pasta estaba muy sabrosa, el sabor bien logrado, los champiñones cortados en trozos grandes. Muy buena relación calidad precio. La atención fue muy buena, especialmente por el chef que fue muy amable y sonriente :)! Volveremos y lo recordaremos. Gracias"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqNVpmN1dBEAE",
            "text": "WOW! The food is absolutely fantastic! Huge portions at a great price! The service is spectacular, with staff checking in on you as you enjoy the pasta. You see them making the pasta for each dish and I cannot recommend this place enough!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bkpTUkd3EAE",
            "text": "When I visit restaurants for the first time, I normally go with a classic menu, but this time, I somehow made a different move and tried In Salsa Antica, which is one of the extension menus.\n\nIt tasted  unique and wasn't my favorite. Plus, the bucatini was too thick (not sure how to express the texture...)\n\nI will update my review if I get to try a classic menu sometime... :)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNWG91NFQyeDk3M2R3EAE",
            "text": "Amazing! We ate grana e peppe and bolognese, its the same feeling we had when we ate pastas in Italy. Prices are good also"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcklLWDNnRRAB",
            "text": "We love this place!! Pasta is great and not expensive and the attention is wonderful. The owner is always greeting us and talking to us. Its an UES gem!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzZ0xtZDNnRRAB",
            "text": "Delicious, organic pasta made from scratch with great ingredients. Easily my favorite food in NY so far. Really hope I can get back.\n\nThe owner is from Venice, and makes the pasta with thick noodles. I originally wasn't sure how good that would be but they had great consistency because they are all made fresh. The sauce was so good and the ingredients are very high quality."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKODZQR2lBRRAB",
            "text": "The owner and chef, Sebastian, was outstanding. He spoke with us about where and how his ingredients are sourced, where he gained his knowledge of pasta and was friendly and kind. We got the Ragú and Grana e Pepe -  it was delicious and perfectly cooked. Sauce to noodle ratio was devine and the fresh pasta made all the difference."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfazduYXBRRRAB",
            "text": "My office ordered lunch from this restaurant, the pasta is far from authentic pasta. I ordered the prosciutto pasta, which was basically ham sliced and the sauce tasted like ketchup."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOFk2ZVpBEAE",
            "text": "Fresh pasta.  Authentic flavors.  One order is enough for two people (unless you're really hungry.) Great service."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREeF9pN2hBRRAB",
            "text": "Bigoi Venezia: Un pedacito de Venecia en Nueva York\nSi estás buscando una experiencia culinaria auténtica y deliciosa, no busques más allá de Bigoi Venezia, ofrece un menú de platos tradicionales venecianos elaborados con ingredientes frescos y de alta calidad. Es una pasta gruesa, se hace fresca todos los días y se sirve con una variedad de deliciosas salsas. En general, mi experiencia en Bigoi Venezia fue excepcional. La comida fue deliciosa, el servicio excelente y el ambiente era encantador.\nP.D.: Gracias a su chef Sebastian por su amabilidad y hospitalidad."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoMmFQaWl3RRAB",
            "text": "What a joy to dine here today! Came in for a quick lunch and did not disappoint. From the cashier to owner, they are both friendly and make you feel like you’re visiting a family’s home for a meal. After order at the counter, you will be given complimentary water and cheese on the side. The owner, Sebastian, made it a point to come around the counter and greet customers making sure that they are happy with their meal and have everything they need. My favorite part is attention to details - Sebastian noticed that I use up all the cheese and bought out complimentary cheese block for tasting to go alongside my pasta. The pasta and sauce is made fresh daily and good value for the price paid. I was so impressed I ordered to go as well for another meal. Look forward to visiting again in the future!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNHFpQnNnRRAB",
            "text": "We came here for dinner one night and dined in. We ordered 5 different pasta dishes and all of them had really hard noodles (as if the noodle weren’t cooked all the way).  The pasta didn’t have much flavor and didn’t taste as great as we expected.\n\nDishes that we tried included:\nBolognese Classics\nPiselli e Prosciutto\nRagù di Manzo\nGrana E Pepe\nFiletti di Prosciutto al Chardonnay"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHc0l2dHFnRRAB",
            "text": "Average home cooked pasta for good price.\n\nProbably one of the cheapest handmade? pasta you will eat in the city but for what it’s worth, it’s  ok.\nThe flavors are very mild and watery, creamy pastas are not as creamy and the tomatoes pastas taste like canned tomato pasta.\nThe noodles itself are slightly undercooked but has a good bite.\n\nI would go back to try other dishes here but if you’re into savory, flavorful pastas, this place may not be for you."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKN2RUN3lnRRAB",
            "text": "The pasta is delicious. I had the mushroom with basil in cream sauce.  I never had  such good pasta and I have eaten fresh pasta at other restaurants in Manhattan and on Long Island. The chef came out to say hello to us and inquired if we liked our dishes. He was very pleasant and friendly and explained that is a type of pasta from Venice.\nThe atmosphere is warm and friendly. The young lady that took our order was professional and sweet. The chef gave kudos to her for making the pasta.\n\nThis place a definitely worth 5 stars."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfeGZpU09nEAE",
            "text": "Best Pasta I've ever had.  Shared a dish and the portions were still great. Extremely welcoming and friendly. The owner even brought out cheese samples. His passion is very evident!!10/10"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzM2F2WG9RRRAB",
            "text": "omgggg this place is just amazing😍 i found it just walking the streets looking for good pasta at a good price and i felt in love!\n\nwe ordered piselli e prosciutto and ai funghi.. we dont know yet which one was better. they both were very flavorful, good portions and the staff are very nice.\n\nthe perfect comfort food 🫶🏽"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaclAtcmtBRRAB",
            "text": "Where can one get exceptional Italian pasta in the setting of casual dining (or take away)? Bigoi Venezia, that’s where.\n\nDescription: I’ve only had the bolognese (I love it so much).  Bucatini (long, thick spaghetti-like noodles), cooked perfectly al dente every.single.time. Generous amount of flavorful bolognese meat sauce.  Add a little of the  parmagiano they offer and 🤌\n\nPortion size: one bowl is likely more than enough for one but def not enough for two.  (Admittedly I eat the entire thing in one sitting- it’s too dang good not to)\n\nService: Excellent. If you order there- prepare to wait ~7 mins or so whilst they make it fresh! You can order ahead on their website to limit in store waiting. Delivery is also a popular option.\n\nVibe: Light interior. Warm temperature (from the kitchen).  Small interior for sitting- bar top with maybe 4-6 stools (potentially originally designed for waiting rather than eating). They do offer eat-in with proper bowls and cutlery. Perfect for solo eating. Or up to 2 people in a group.  Not ok for groups of 3 or more."
        }
    ],
    "reviews_count": 75
}