{
    "name": "Supper Club By Le Petit Parisien",
    "place_id": "ChIJ3fa7yrhYwokRQJLZKpT1uig",
    "grid": "MN8",
    "address": "355 E 78th St, New York, NY 10075, USA",
    "rating": 5,
    "user_ratings_total": 85,
    "phone_number": "(917) 262-0910",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wemVGSlpWMVZQVTJvd1YyeHhRUzA1WlV0ME4wRRAB",
            "text": "I came to Supper Club by Le Petit with five of my friends and we were blown away from start to finish. The food was exceptional , especially the duck confit, which was one of the best I’ve ever had. Every dish was perfectly prepared and beautifully presented.\n\nThe service made the night even more special, our waiter was so warm and attentive, and the owner personally checked on our table, which made us feel so welcome. The entire atmosphere felt cozy yet elevated, the kind of spot you can’t wait to tell your friends about.\n\nTruly a gem of the Upper East Side. Can’t wait to come back!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205aFlsQnRNMFpDZW5FM1EzRXpVbVZYWmxjMFZXYxAB",
            "text": "Thanks so much to Supper Club for helping us host the \"Night Before\" dinner for our wedding!\nManager Sakis and Chef Bruce helped us put together a fabulous menu and gorgeous tables for our dinner party.  The food, drinks, and service were all excellent and our guests loved everything, as did we.\nWe will continue to make this neighborhood gem a regular date night spot."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSa2FHeDVhRlk0ZWxwWFlVOUVkbmxLUTBWb2ExRRAB",
            "text": "We had a private party for over 15 in September and we were extremely pleased.  The manager was extremely helpful, proactive and accommodating to our specifications.  Our guests were impressed with the menu and excellent service.  We will continue to frequent the Supper Club given their high quality food and service."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wc1dVZEZZbTQ1VkVFeWFFeGZXRkZvUTJoT1VsRRAB",
            "text": "Small and comfortably spot that feels like home. Our waitress was super helpful and the duck was possibly the best I’ve ever had. Do not miss out!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKVVRsZEdjM2wyYjJGUGVrUkpWMkkxTmkxNlpHYxAB",
            "text": "Everything was amazing!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWQ1FqRnljVFpSZUhkVVNtaHphRVJZYTE5VmJFRRAB",
            "text": "Supper Club By Le Petit Parisien took dining to a level I wasn't prepared for. The staff offered fast assistance with respectful and helpful attitudes. This spot deserves your immediate patronage! Each plate shows care. The place delivers consistent quality."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5a04wdEpaRFZOWDFWbE1HNHdNR1Y0ZG1wRU9GRRAB",
            "text": "Not just the best French cuisine but the best restaurant in the UES! The food is fantastic, with a seasonally-changing menu. Great service, charming ambience. A very welcome high quality spot in our neighborhood!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pocFdIRjFWWE4zWWxobFZIVmpkVGRUVm5walZIYxAB",
            "text": "What a gem off 1st Ave! Service was attentive and friendly. Ambiance was cute. The food was excellent. We had the chicken liver pate toast (9.5/10), the special shrimp w parsley puree (9.7/10), the cod (10/10), and the apple torte (9.8/10). Wines were well priced and delicious. It wasn’t too crowded for a Thursday 6pm so we were able to talk without shouting. Would definitely return."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxRVQyazJPVWRzTmw4MGVIZEJNMjQxV25Sc04xRRAB",
            "text": "Food is very good and the lady, who I assume is the owner, is very nice."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pacFFsZGxYMkZvZGpKd04waFRWMU5IU1ZwSVZFRRAB",
            "text": "Wow the food was so good! I had the burger. It was amazing! So juicy. My partner had the duck à l’orange and he said it’s the best he’s ever had. The service was also excellent. We will be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQWHk3UGlNNXM3eTlnRRAB",
            "text": "Delicious. Best duck in the city."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNVlpdHRBRRAB",
            "text": "Came here for a dinner date and really enjoyed my time! Atmosphere very cozy French bistro and the food matched the vibe. Owner was so nice too! He saw me looking at their bags of chips and gave me one to go after our meal ❤️ a gem in the neighborhood! Will be coming back again no doubt"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdVpEUlJnEAE",
            "text": "Our best dinner in NYC\nIt was the best dinner we had in New York City. My wife, me and a friend enjoyed everything: the starters have been extraordinary, the fresh main dishes delicious (duck, salmon, steak), and the French wine perfect. Perfect place to be at the East Side."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3ejhQTy13RRAB",
            "text": "Great ambiance, food, and service! Everything we had was so tasty, including the caramelized onion tart, poached shrimp, duck a l’orange, the salmon and the crème brûlée for dessert. Such a gem in the neighborhood and we will definitely be back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3bjZLcGl3RRAB",
            "text": "I’ve dined all over the world and eaten at multiple Michelin starred fine dining restaurants before and this place is legitimately the best food I’ve ever had in my life. Wandering in on a random weekend trip was the best choice I’ve ever made. The food is so thoughtfully considered with amazing flavors that are perfectly balanced. There’s so much intentionality behind every dish. No ingredient is misplaced and everything carefully curated to enhance the flavors. I dream about the meal I’ve had here. Have I intentionally selected longer layovers in JFK just to pop over and dine here? Absolutely. And I’d do it again. This chef deserves all the flowers. Please consider opening a restaurant in Los Angeles, thank you. I would sell my right and left kidneys for this dream. There’s a reason this place has five stars. If you’re reading this review just go now and order anything off the menu. It would be the best thing you’ve ever done for yourself"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNReE83OS1RRRAB",
            "text": "Excellent place, food was great and so was the service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN0pQWWF3EAE",
            "text": "Love this place, food is extraordinary and such a friendly atmosphere!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzeXBmUHdnRRAB",
            "text": "Really lovely dinner. Food was delicious, ambiance was cozy, and the service was attentive and warm. The kitchen truly knows what they’re doing—ordered the salmon carpaccio, the beef tartare, the broccolini, the duck, and the oyster mushroom, and there wasn’t a single miss. Great ingredients cooked well. Still thinking about the desserts.\n\nThis is a true (hidden?) neighborhood gem. Will have to come back for the live jazz."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuXzhQNExBEAE",
            "text": "Amazing. Great meal, lovely service and a nice ambiance. Would definitely go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuc0xuM1ZREAE",
            "text": "My husband and I absolutely love this spot! It’s charming and the food is always phenomenal! There hasn’t been a dish we haven’t loved. One of our favorites is the chicken liver toast - so good that we once got it again for dessert! The staff are friendly and the service is great! Highly highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbmUtaGRnEAE",
            "text": "Le Petit Parisien is an absolute delight. The ambiance is enchanting, and the food is simply delicious. It's such a romantic little spot! We were treated to live performers who played beautiful music, adding to the charm of the evening.\n\nThe music is just the right volume, making it easy to enjoy lovely conversations while soaking in the beautiful melodies.\n\nI highly recommend it at night for dates 🍷🎂🎊\n\nTout simplement magnifique.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIaW9tZ1FnEAE",
            "text": "Was blown away by how excellent this place was. Duck was one of the best I’ve ever had. Service was great. The live music was a great addition. A legitimate hidden gem."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIOHZMV0N3EAE",
            "text": "The duck was great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3emU2MGlBRRAB",
            "text": "This is the best meal I’ve had all year. Ordered a glass of wine (which to my surprise was half off on happy hour) and the burger and fries. Truly unbelievable. French restaurant in NYC, and better than the meals I had in Paris. 10/10 can’t wait to go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURycXBLWlNnEAE",
            "text": "We came here for the $60 prefix dinner, and the food is definitely amazing —— from appetizers to desserts, all beyond our expectations."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyb0ppM1FBEAE",
            "text": "What a surprise! We were really in NYC not Paris! Couldn’t tell by the food or the atmosphere which were so Parisien. Superb service, classic bread, bistro food perfectly made. This is a sleeper and the chef is American! We went for dinner, but breakfast and lunch are available  and this is a bakery so the bakery stuff should be tried as well. No liquor, but the wine selection was good and not overpriced.\nDon’t miss out!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMdmRHdE1nEAE",
            "text": "Supper Club By Le Petit Parisien is a hidden gem! What an amazing place for French on the UES. Cozy, fresh and delicious food, kind service. You can feel the passion of the chef on the plate."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMajk3UjFnRRAB",
            "text": "Great food. Great service. Live music Wednesday and Sunday"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMMnJISUNBEAE",
            "text": "Put this exquisite dining experience at the top of your list for NYC! From the snacks to small plates, entres and desserts, each bite was scrumptious to taste. The wines were the finest. And the soft jazz filling the atmosphere made our evening most memorable. Bravo to the Chef and Owner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMOUlYQm5RRRAB",
            "text": "Wonderful food. Wonderful atmosphere. Absolutely delightful staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6ZzlLZWxnRRAB",
            "text": "Wonderful neighborhood spot for date nights with really good food and a low key but romantic vibe. The baguette that they serve before the meal is 💯"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6MmNXMzZnRRAB",
            "text": "We went here for my niece’s bday on Saturday. We ordered bunch of appetizers. Each one was delicious. Our personal favorite was endive salad. I ordered cavetelli pasta with vegetable. It was excellent but little bit salty. I would highly recommend.\nThe atmosphere is beautiful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUM2ZqUzFnRRAB",
            "text": "It was so nice experience we order the duck and steak\nthe duck was amazingly done and delicious"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUaFlxOXVRRRAB",
            "text": "I’ve been twice and the food is so delicious here. Beautiful presentation and unique flavors while still being classic somehow: the standouts are the bread and butter (looks unassuming but it’s fantastic), onion tartlets, burrata, carrots, cod, and steak frites."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMXJHdmNREAE",
            "text": "Excellent food! Best dinner I have had in NYC in a long time. The cod with the peas & bacon was phenomenal. Plus 1/2 price wines at happy hour and jazz on Wednesday nights!!! Very nice service too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbXE2NnRBRRAB",
            "text": "Absolutely incredible! Highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqaU55Z093EAE",
            "text": "We were a party of six\nfood was excellent. The red wine very good\nendive salad very delicate and enriched with nuts (?). Amazing steaks\nAll in all highly recommended"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEcXFtNE9REAE",
            "text": "This restaurant deserves a Michelin star . The food is phenomenal. Every time I’ve been I fall in love with something new . The Duck is truly divine and I’m obsessed with the Gnocchi. Please try anything on the menu and you won’t be disappointed. The staff is impeccable and the ambiance is very quaint ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbEpLTWZBEAE",
            "text": "Beautiful French dishes to try at le supper club restaurant in uws😍!!\nRoasted duck, rose wine, steak & fries, Caramelized onion appetizer, Chicory Salad, cotes de Provence rose wine, French bread and butter, roasted long island duck breast , creme brulee dessert, Steak Tartare, Charred Carrots, and  Pommes Fondant. Everything was delicious and beautiful!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5NTZ1d3F3RRAB",
            "text": "Excellent food and hospitality goes above and beyond!! I’ve gone twice already, all the dishes and presentation of them are incredible. My guy really wanted to try the seafood cavatelli; they were out the first time we went and the second time we asked before we sat down just to make sure. They ended up running out by the time we ordered, needless to say my guy was disappointed he was thinking about it since we saw it on the menu the first time. Regardless he ordered the steak and loved it. We were speaking with the manager about how much my BF wanted to try the cavatelli, he then told us they were removing it from menu since they change menus seasonally. The last day to try it would be the next day! The manager seeing how much my BF wanted to try it, asked me for my address and hand delivered it the next evening with a bottle of sparkling wine!! Top notch service!! Rarely is there hospitality like this anymore. This restaurant and its staff are an absolute Gem!! Thank you for making our day!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsbGFmODZnRRAB",
            "text": "Elevated and flavorful dishes with perfectly cooked protein. Worth a visit and very reasonably priced for quality. Service at times choppy but overall experience was stronger than many other more expensive French restaurants in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkNlBpdERBEAE",
            "text": "What an extraordinary experience we just had. The food is top notch ! The duck is a must have and the endive salad reminds me of France . Super friendly service. Highly recommended"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROdWJtZDBnRRAB",
            "text": "I stumbled upon this little spot again on the Upper East Side, and man, it's still a diamond in the rough. The vibe is just so cozy, it's like eating at your grandma's, if your grandma was a gourmet chef. We dove into those mushroom tartlets, and they were out of this world! The steak frites? Cooked just how I like it. And the duck, well, that was the star of the show. Portions hit the spot - not too big, not too small. Just perfect. Can't wait to drag the gang back here next month to see what's new on the menu. This place is a keeper, no doubt about it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxd3BTMHdBRRAB",
            "text": "Supper Club is a continuation of the exquisite excellence of Le Petit Parisien.\n\nThe dishes are carefully selected according to the season, the menu is varied with the ability to satisfy all tastes. The filet au piovre was exceptional, as was the cod. Innovative dessert, too. Warm, fresh French bread and salted butter to complement.\n\nThe atmosphere takes you to a Parisien bistrot, within the warmth of the Upper East Side. Service is great, Sakis (the owner) is an absolute jewel!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWNDlhUVJREAE",
            "text": "Every dish was executed so well. We started with the caramelized onion tartlets that tasted like onion soup in a mini puff pastry! Then we got the duck breast and seafood cavatelli, which were both delicious.\n\nThe restaurant exterior looks unassuming, tucked away on a cross street. This is definitely a hidden gem!\n\nWe cannot say enough good things about the food, the staff members, the enjoyable and cozy setting. Our meal felt perfect from end to end."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsbWVlX09nEAE",
            "text": "I absolutely love this special place! It feels like being in Paris. The concept of an after-hours supper club is so fun and they execute it so well with the vibe, lighting, and atmosphere. The food is incredible, we especially loved the onion tartlettes and mushroom pie. The winter citrus dessert was so delicious, would order again and again. And the service, so friendly and perfectly paced. Can't wait to come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsdG9qa1R3EAE",
            "text": "My second dining experience at the supper club and it is really amazing. I had the chicory sales which was surprisingly good. The food tastes fresh and authentic. The ambience is also really good. Definitely a good date spot. The music level is medium. I recommend this place as a good night out dining spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdHZETWl3RRAB",
            "text": "Amazing. Love this new neighborhood French Bistro. Ordered the onion tartine and cod. Amazing. Also the wine was great."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1ME5YYnR3RRAB",
            "text": "A delicious meal with a classy atmosphere. Chef Josh Newman is truly putting together classic french dishes that warm the soul. If your looking for a date night, birthday celebration, or just a quality meal you have to come by."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbjZlSmpnRRAB",
            "text": "The warm, intimate staff transport you from the hustle and bustle into a cozy cafe that serves sublime food. From the moment you arrive, you are treated like more than just a regular - you are in your adoring aunt’s home."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURad3N1dFZREAE",
            "text": "Attending the Supper Club was truly a culinary journey. Nestled in an intimate setting, the atmosphere was reminiscent of a Parisian evening, with dim lights, soft jazz music, and vibrant chatter.\n\nThe curated menu was exceptional. Each course was delightful, meticulously prepared, and presented with great attention to detail. I ordered Caramelized Onion Tartlets, Roasted Long Island Duck Breast, Asparagus Side, and Strawberries and Cream for Dessert. The flavors were authentic, and every dish showcased the chef Josh Newman’s prowess in using the ingredients.\n\nThe wine pairings were spot-on, elevating the dining experience to a new level. The staff was attentive, knowledgeable, and added to the overall charm of the evening.\n\nIn conclusion, Supper Club is more than just a supper club; it's an experience. Whether you're a lover of French cuisine or simply looking to try something new, this is an evening well spent. Highly recommended!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwa3NtSzlBRRAB",
            "text": "I recently dined at The Supper Club by Le Petit Parisien and was thoroughly impressed by Chef Josh Newman's culinary expertise. The experience was a symphony of flavors and textures. The gem lettuce salad was a refreshing start, balancing crispness and tenderness flawlessly. The Montauk sea bass and Long Island duck dishes showcased an intricate play of tastes, leaving me amazed by the harmonious blend of flavors.\n\nThe dessert selection was equally exceptional. The strawberry and cream dessert was a delightful finale, with the sweetness of strawberries perfectly complementing the creaminess. And let's not forget the chocolate tart, which was a rich and indulgent treat.\n\nChef Josh Newman's ability to achieve such a balance of tastes and textures throughout the meal truly showcased his skill and creativity. The Supper Club by Le Petit Parisien is a gem that offers an unforgettable culinary experience. Can’t wait to try his other dishes which constantly change with the seasons"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbl91UFdREAE",
            "text": "At the risk of never being able to get in here again, I write this rave review. Dining here is akin to a rendezvous with a long-lost French kin. The culinary offerings are a revelation—steak and cod, meticulously cooked to perfection. Noteworthy were the peppercorn-laden sauce accompanying the steak, rendering a delightful burst of flavor, and the subtly seasoned frites. The unequivocal stars were the beet salad and butternut squash side, a harmonious dance of ricotta, sage, and sheer culinary affection. A hidden gem, and a pleasure to indulge before everyone in NYC catches on to this complete gem of a restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1aUlQYThnRRAB",
            "text": "The chef Josh Newman is Culinary institute of America trained and the supper I had represents his commitment to Excellence!! All I can share is WOW, the food is delicious in this bistro like restaurant. It’s special cause you can dine casually for Michelin quality suppers. I had the cod with Cauliflower that had a brown butter sauce and slivered little almonds for a crunch with the perfectly cooked fish that’s hard to describe. French bread was warm, French wine( cote de Provence)was amazing! I guess you can classify this as a Bistronomie! Just a perfect dinner. Great chocolate deserts as well. I highly recommend food that is healthy and perfectly cooked and truly delish!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGamN6enNRRRAB",
            "text": "Absolutely delicious food created and artistically presented by Chef Josh Newman. Spend an evening in a delectable and intimate Parisian cafe sans the travel time. Highly recommended!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwZzVmN2VREAE",
            "text": "Stopped in for a spontaneous Saturday evening dinner, my husband and I were craving French food but also seeking a bit of a low key vibe.\nWe were warmly greeted into a cozy French bakery turned pop up in the evening.\nWe shared a delicious melon and tomato salad to start and I had the sea bass as a main, both excellent. The menu is small but I still had a hard time choosing as everything sounded so good.\nThe wine list was very reasonably priced and I love that they offer classic French aperitifs. Our server was attentive and warm.\nDefinitely plan to return, I think this could become a neighborhood gem! 💎"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwczhXV3d3RRAB",
            "text": "The food is honestly phenomenal! Not what I expected when I came inside and saw a cozy French bakery turned restaurant by night! It was truly delicious. Everything from the bread and butter and ricotta and smashed peas to the salads and the entrees. Everything is done with intention. All the flavors work so well together. And the desserts are a perfect end to the meal. A refreshing strawberries and cream and a decadent chocolate and caramel tart with chocolate crisps. I hear the chef plans on changing the menu fairly often so I’m going to for sure be coming back to try the new stuff!\nDon’t walk, run here. You won’t be disappointed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaM0xhMER3EAE",
            "text": "A new local gem for the upper east side! Discovered the supper club through a friend and love to try new local places and this did not disappoint. Went with friends and we shared gem lettuce, ricotta , duck snd bass-and deserts( yum) . it was all delicious, unique and special. Love the relaxed low key atmosphere, good service, wine selection and all for reasonable prices. Highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdy1fT0RBEAE",
            "text": "Went with friends last night, and we all ordered something different. (It was our 2nd visit.) Each dish was perfectly prepared and delicious.  The bread was delicious, especially with the whipped ricotta with smashed peas and mint oil (you have to try it!).  Salads were bright, and my black bass was both light and sumptuous.  Not a crumb was left on anyone's plate. The dinner was well-paced and relaxed.  This is a place for innovative food in an unpretentious, relaxed setting--a wonderful addition to the neighborhood!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1NmFyMXN3RRAB",
            "text": "Do yourself a favor and check out this hidden gem of a French restaurant on the upper east side. This compares favorably to any place that I ate at in Paris a few months ago. Josh Newman Is a lovely guy and an excellent chef. The staff are absolutely charming. This supper club Is housed in a bakery. This is reflected in the excellence of the baked goods and desserts. The small ingredient driven menu changes frequently. The food is uniformly outstanding, but my favorites have been the pate, the onion tartlets, the steak frites, and the mind blowing chocolate tart. This place is worth your serious consideration."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaX09Idk13EAE",
            "text": "Truly a welcome surprise! Dined here in the early days of of the Supper Club so there seemed to be a few kinks in service they were working out.  I understand from the owner the decor was also in transition. The food however, well it was innovative and delicious. The gem lettuce salad resembled ocean waves and was a complete palate pleaser with a thin layer of whipped goat cheese on the bottom. The appetizers were novel too like caramelized onion tartlets. I had the Montauk Black Sea Bass and loved it.  Going back to see if they have notched up the service (wasn't bad, just a wee bit slow as they were new) and the decor improvements."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1dllIMmlBRRAB",
            "text": "We had a wonderful dinner at the Supper Club. We walked in, and they were able to accommodate us that evening. The service from the greeting at the door to the final pieces of chocolate was wonderful -- as was the food and wine. Really can't wait to go back to this great addition to the neighborhood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNad0xiZ3JnRRAB",
            "text": "Dinner here was excellent. We were excited because the menu changes with whatever is in season, so we got to try fresh and prime ingredients done in some beautiful dishes. Highly recommend that you stop by for a meal, great addition to the UES!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaektXalZBEAE",
            "text": "Went to the supper club @ LPP and I had a blast. The food was delicious, the atmosphere was amazing. Everything was made upon order and you could taste the freshness. I couldn’t stay for desert but my friends who stayed said the it was decadent.\nLPP supper club is definitely worth experiencing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGX2RyWEl3EAE",
            "text": "Must check out new spot on the UES! Chill vibes, great music, amazing food, and lovely staff."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwNFpEZnBBRRAB",
            "text": "Wonderful innovative French dining experience just popped up .  By day a French sandwich shop and patisserie, by night transformed into a cozy  bistro.   Apparently the young Chef has an incredible background from the CIA, Hidepark, to Michelin starred establishments.  He brings his training and raw talent to our corner of Manhattan.   Come now before folks catch on and book up.   It’s a smallish  space.  We start with sliced fresh baked baguette (le petites signiture) and house made tarragon butter;   then ordered The gem salad with pistachios, orange and ricotta;,  smashed pea apppetizer; , the perfectly cooked sea bass, (I asked for a spoon to get every last drop of the sauce; roasted duck with cherry jus, and the asparagus with basil hollandaise  were among my favs.  Desserts to die for get 1 of each.   Bon appetite.  New dishes just added to the menu so I need to go back and try."
        }
    ],
    "reviews_count": 66
}