{
    "name": "Avra Madison",
    "place_id": "ChIJK_nYHfBYwokR03Tv5S3dW1s",
    "grid": "MN8",
    "address": "14 E 60th St, New York, NY 10022, USA",
    "rating": 4.6,
    "user_ratings_total": 2601,
    "phone_number": "(212) 937-0100",
    "reviews": [
        {
            "date": "10시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJd1NDMUhWV1pFU1dWT2RtZ3lSVmhHTldKb1YwRRAB",
            "text": "Food service and atmosphere well done"
        },
        {
            "date": "14시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMVNqQkVaVU5zVld0MVRtbHZNMlpSTkZvMmNrRRAB",
            "text": "Dishes good for sharing."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTVltdG9UVlJZYTJOU00wOVZURUYyVURkU1kzYxAB",
            "text": "Very busy and bustling most of the time, during lunch or dinner. Reasonably tasty and healthy food choices. Good level of service considering how busy they were."
        },
        {
            "date": "수정일: 1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WUFZHRkRVbDlJT0VKSlJHWk5VbWhDYzJJdFZuYxAB",
            "text": "Excellent choice. Upper east!!  Highly recommend. But I really love Avra Rockefeller."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSV2J6RkxYM0ZuVlVGd1ZqSTFjMHRCWlhoeFUwRRAB",
            "text": "I went to Avra this past weekend with family and it was such elegant dining and amazing customer service! The waiter was extremely kind and kept checking that we had a very good experience . I ordered a Shirley Temple. The Avra chips are DELICIOUS! I also had the calamari with aioli sauce. So exquisite! Definitely going back next time"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSSFdGQllTbVZDVGpCRU9XczBWMVJ4Y3pOblRrRRAB",
            "text": "We found this place by chance when planning my sister's birthday. Any born/raised New Yorker would agree that the number of new quality places that possess a certain ambiance, much like the old Tao Group places of the 2010s are few and far between now. But Avra is like dipping into older New York - amazing quality food from renowned chefs within an epic and beautiful setting that really makes the meal feel special. And without any young tiktoking crowd that cheapens it (we were celebrating a higher age). Truly hard to find and I am so glad we did. Now typically places like this can be snooty or service can be lacking. TBH that's what I was expecting making this last minute change for a large birthday dinner group and I was dead wrong. The service was impeccable, respectful,  personable and attentive with just the perfect bit of coddling (they had security come to my car and take the cake to their fridge without me asking). In a city that used to be kind, but not nice, Avra upholds the true standard of dining as a New Yorker. It's not try-hard at all, the other patrons were energetic, but not obnoxious, the lighting and trees and general scene was gorgeous, the steaks and seafood were perfectly cooked and they made it an amazingly special night for us. We can't wait to go back. I am not sponsored or paid (though I could be persuaded) and truly I'm a hater in general, but I don't think I've had such a good time at a place in awhile and it's worth noting. Thank you to the Avra staff."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toQ1JEUkNXVmMxV0RKSlMzaEJORUoxVkRjNWRtYxAB",
            "text": "Second time that Avra over charges by double debiting my card for \"wrong amount\" double the price. The first time I had to call for a manager 3 times to get this reversed and credited back. Now again. It is now clear they are doing this on purpose hoping customers wont notice."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNmFtUXRWalpoWWpoWWVqZHJlbmx0Wld0dVEwRRAB",
            "text": "I’ve eaten at Avra many times. The food is delicious but the service was terrible."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsbVYwOVZWWE5TTXkxMkxXcFNOazlTTWtkcVYzYxAB",
            "text": "Lunch today was disappointing. Our server, an older gentleman, was dismissive and unfriendly, making the experience uncomfortable. One item on the mixed appetizer plate had a spoiled, fishy taste like and was inedible."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMmVURXdWMHA2VEUxa2FscGlSVzFETm13dGRGRRAB",
            "text": "We came for drinks and dinner. During dinner they expanded our table and it was a little bit tilted. We then ordered after dinner drinks and one fully spilled since the table was tilted.  Not once did they offer to help or try to clean.  My dress will need to be dry cleaned, and maybe my belt. At any other place they would have comped something or apologized. They did not and it was very disappointing. They also added sides and appetizers that we did not order."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCaGZxT1FBEAE",
            "text": "Avra Madison has Been my “Go-To” in my Uppereastside neighborhood since they opened. The main diningroom has a foliage collection to create a warm-welcoming environment. A diverse representation of cultures comprise the waitstaff team. Managers experienced in shadowing guest’s needs roam the tables. I arrived to a Spectacular presentation of a large whole branzino encrusted in a salt covering: Gorgeous! Gorgeous!!\nGuests select from the fresh fish displayed on a bed of crushed ice. We selected starters of tender crab cakes & tuna tartare followed by jumbo tiger prawns & a whole lavraki. Desserts to delight: Greek yogurt drowned in honey, walnuts, whole cherries. There was a quiet buzz in the diningroom as locals & tourists launched their weekend activities. Food, Environment & superb service by Sean created big smiles! Looking forward to returning! Bonnie from NYC."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkbFVuUklNakJVVFhGVk1FSjNUM2xqTURSTFlWRRAB",
            "text": "Excellent food and a beautiful setting in a prime location. The dishes were perfectly prepared and the ambiance elegant yet vibrant. However, the experience was somewhat let down by the disorganization at the entrance. Even with a booking and on-time arrival, there was confusion and only one host trying to manage a large flow of guests.\nOnce seated, the service team appeared overwhelmed-water glasses went unfilled, and it took about 45 minutes for my main course to arrive. The restaurant clearly suffers from its own popularity. With better front-of-house coordination and pacing from the kitchen, it could easily deliver the flawless experience the food and venue deserve."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odmJVUlhkRWhWV1d4WldVaEZVbGx2ZGpSbVpYYxAB",
            "text": "We just had an 11 person party ranging from my 8 year old son to my parents in their 80s, for my sister’s birthday dinner. I cannot say enough nice things about Avra.  Their service was impeccable.  The staff from hostess to waiters and all table staff were unfailingly polite and *warm*.  They were friendly and kind in a way that so many Manhattan restaurants simply are not anymore.  We brought our own cake.  There was no fee for cutting.  The table was ready early so we could set up some decorations we brought.  We had a large bouquet of flowers.  They graciously held onto it for us during dinner.  Even with such a large party, the gratuity was not automatically added.  We happily gave extra.  The food is fantastic, especially if you enjoy seafood.  All the seafood was fresh and tasted amazing.  The atmosphere is light airy with a lively environment without being loud.  We were able to talk to each other easily though the restaurant was packed.  The music played at a tasteful volume in the background.  This was my second experience at the restaurant after having come for a work lunch. The service and food were likewise impeccable on that occasion as well.  Whether it’s dinner or lunch, large or small parties, I simply cannot recommend Avra enough."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGMmN6bEpPRmxNYjJWR1kwa3hhMHd5WVVGaVEzYxAB",
            "text": "Had dinner outside a few weeks ago and the service left a lot to be desired…. Ordered 2 mocktails that never ended up showing up and the server definitely had too many tables to serve everyone as promptly as you would anticipate when paying over $200 a head without drinks. Seafood was not as fresh as one would have thought for the pricing, shrimp was a little fishy…."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSFpEa3hWWGhrZWtVNFIwTldOamhDVEVNNGRYYxAB",
            "text": "Awesome"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkRE9EWnNORTVEYWxNMFlVTnhkbGs1TFRGR2JFRRAB",
            "text": "Quality, sevince and atmosphere all are great. A must visit in New York City."
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MV9DTVJ3EAE",
            "text": "Very bad recent visit.  The sea bass, their best dish, was quite bad, with definitely not fresh fish.  The filet was ordered medium rare but came medium well, still tasty, but not juicy.  And then the same wine switch that keeps happening, you order a glass of wine and it’s fine and then a second glass is from a terrible bottle. Very tacky. Constant harassment to take the plates and a bill with ten minutes to go on the drinks. Rushed out of a $300+ meal? Not going back for a very long time….\n\nPrior visit a year ago:  Really amazing dinner. The sea bass is just incredible, and the seared tuna was excellent.  What is especially nice is the amount of food you get and the bread, you really get fed here. At Milos another seafood place you barely get anything. The cheesecake dessert was excellent. Great selection of wines by the glass - try the burgundy it’s worth it. Great service and kudos to the manager for finding us a seat at the bar.\n\nThe only question is why this Avra is so good and the one on Sixth Ave so bad?  It’s the food…."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pscFRYUnZRWFZvYjBKNGJUZEpSM1ZMUkhNMWNFRRAB",
            "text": "Had such a great time here! Thank you!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTU5qWlFTbk5PZHpGdGFWcDJZbkZqT1RKbU1VRRAB",
            "text": "My favorite place to have lunch! I love the zucchini chips, the hummus and the greek salad, the seabass too is everything"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toUWRuaEtNa1ZUY0ZWQ1gxWkdVWEp3VVhaWGFXYxAB",
            "text": "Great place for dinner and drinks!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSU1ZVTjRSbUU0VFZCbU1GSnRPSGRuTFc5RU1tYxAB",
            "text": "Not happy with the service.  My fighter wa allergic and her steaks was the last one that came to the table.  Unacceptable. Everyone already finished eating and then they to g her her food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214VFFqUkZXakJPTFVOUFNGcEpRM1JNTlhVeGRIYxAB",
            "text": "Love this place. Try to stay on the top floor."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5elkyOW1hSFExZGxaYVQySlpWV1ZPYWpoT1EzYxAB",
            "text": "Food expensive but mostly dishes doesn't worth it. The atmosphere is amazing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JeVVXbHdVR0Z5VkZGdk0yVTRiR2RSU2xwaFEyYxAB",
            "text": "Had the prix fixe menu\nSwordfish\nBrazino\nSpanikopita\nGreek salad\nBaklava"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSZlVUQkdSMEp0T1hkVU16QmtWa3RpZWpCMFJGRRAB",
            "text": "Nice experience"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSVdUZDNRV2Q1WmsxaGNUSnRXR1V5UWpOQlRYYxAB",
            "text": "Lovely restaurant with very good food and excellent service. I wouldn't hesitate recommending this restaurant to anyone."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psd1VtbFFlVzFOVTJWbmJsOWlNRTF6VVU1TU9HYxAB",
            "text": "Came here for my birthday brunch and was blown away from the food, the service and the ambiance!\n\nSuper special thanks to Osman for taking such lovely care of us and to Milan, Statavia, and Sasha for everything!\n\nWill be coming back and adding to my go to list for favorite restaurants in NYC"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twMVNraHdlRFE1WjJjeVVVSnNVa1JFYVV4RlNuYxAB",
            "text": "Amazing service from Stefania, Milan, and Sasha! Beautiful restaurant and will be returning!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tweVdtNWpUbVpoY21OWmJUVnZTbTVCYzNGVlluYxAB",
            "text": "Had the most amazing brunch ever! Food and service was top notch! Shout out to Milan, Stefania, and Sasha for adding to the experience with their wonderful energy! Can’t wait to go back again 💖…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aSVpUTnZaVFZJTjIxUmJXRmhSMXBNTVdOS1YzYxAB",
            "text": "This place is amazing. Sebastian served us and he is quite special. He’s so kind, helpful and courteous and we are fortunate to have had him. I would remiss if I didn’t also mention Doanny, Stephanie, Joan and Ruben. They are all exceptional at what they do. They are a nice reflection of their superiors and the Avra brand. Avra you are fortunate to have them on your side. Besides all of this, the crab cakes are the best in the city."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psak9VRllUbmQzVVdFMFlrNVZiMnR1UTA1RU5tYxAB",
            "text": "One of the best bar scenes near the Park. Service is friendly and attentive. I try not to go above 14th street …but when I do this is the place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oMFFXdGxSMnhwVFhGa1VVZDBOMTlOTUMxQlpWRRAB",
            "text": "Best place ever it’s so delicious and the service was exceptional"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZMWNIaDVRbXBMZEVSRGNFSldRMFEyVkhsdlRIYxAB",
            "text": "Amazing!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSVlrczVRMk5STFZSb1gycG9NVkpTV1dGQmIyYxAB",
            "text": "Usually always good. Always a scene. Like a movie but IRL"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KSlJrYzRjelZUWm5VemNWZElMWFIxTTJkQ1ZFRRAB",
            "text": "Beautiful outdoor setting with great food and extra attentive staff."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZNGF6aGtURWt4YW1zNWJGQXpObWhxWm5GaWNWRRAB",
            "text": "I thought that we would eat perfectly deliciously. But no. The first thing that surprised me was the absolutely unpleasant taste of the zucchini appetizer. Then we started on the main dish. The pasta with lobster was good, although for that price they brought me a couple of pieces of lobster, and its entire huge shell. I saw that my friends did not finish the oysters, which was very surprising. I don't remember the other dishes, but my friends finished them. I definitely don't recommend the strawberry cream cheese and ice cream. It wasn't worth our attention at all. The service was good, fast, and the cream cheese was removed from our bill. The atmosphere was very pleasant, lots of familiar faces. A sort of cigar lovers' cube. Friendly pleasant atmosphere.  One unpleasant moment. Men in black suits constantly approached us and invited us to go to another establishment. When we started to get ready, one of them was right there. We even got scared. We didn’t think to ask if they were restaurant employees. We just politely refused.\nIf they are restaurant workers, then approaching guests with such offers is at least indecent and intrusive. And if they are strangers, then I am surprised how the security and hostel do not pay attention to them."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdGNWaEliSGd3ZVZwYWVrRllYMGRSVjNCV1lsRRAB",
            "text": "We stopped into Avra Madison for a light bite and only ordered two appetizers — the grilled octopus and the shrimp. Both dishes were very fresh and nicely presented. The octopus was tender with a good char, and the shrimp were flavorful without being over-seasoned. The atmosphere of the restaurant is beautiful — bright, elegant, and perfect for a special night out. Service was attentive and professional, which added to the experience.\n\nThat being said, the prices are definitely on the higher side for the portion size, so it’s worth keeping in mind if you’re just coming in for small plates. Still, for quality seafood and a chic Midtown setting, Avra Madison delivers."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poTVMybG9ORFZPWVZwbU9UQTNXbkZZTW5GM00zYxAB",
            "text": "One of my favorite spots in NYC. Food is always so fresh and perfectly balanced! Thank you again for the excellent service and hospitality."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCbFkxcFNhbkUxVVV4TFRERmFWbE5FWWpkM1dtYxAB",
            "text": "Get the lobster linguini"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pScFNIRklhR3R1WVVwU2JXMWlTa1p4WDFZeGNFRRAB",
            "text": "I love Avra—the food is always fresh and delicious. They even treated us to a complementary pistachio gelato, which was perfectly balanced and not too sweet.\n\nThe only disappointment was seeing “Israeli salad” listed on the menu. As a Palestinian, that felt uncomfortable and disheartening. I would highly recommend keeping the menu authentically Greek, which is what Avra already excels at."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCd2RXSllNR1pQYkZoUWFHTllaM2hxWkhGbE5WRRAB",
            "text": "Good place for lunch in city"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxR2RtUTRXV1pMV1VVNGVHbHJUSFpZU0V4MlExRRAB",
            "text": "Amazing food and service great wine selection"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1bVFXWkVaWFozWVdWTlNXVnhWbGR4YzJ0R1MwRRAB",
            "text": "We had a nice dinner, with a very good and friendly service.\nVideos products with really high quality and that brings up the taste. The tomato in my Greek salad what's one of the best I've had in a very long time.\nWe're looking forward for our next visit!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZemFtVmxibDlYYkc1U1FXNURaMlJCTUZkRk9IYxAB",
            "text": "Wonderful atmosphere and great service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kcVNGVjFiMmRwYlc1SVRuVmFVRTVuTjNSTFdHYxAB",
            "text": "You must come at least once in your life"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsNlREaEpSRFZhY0VRMFVIRlROVU54V2psVFlYYxAB",
            "text": "BEST happy hour place in town!!! Chic, sexy, sophisticated crowd. The restaurant is beautiful. I have eaten there many times and the food is great, I just personally like more authentic Greek food. So I rather go to the bar for drinks and to meet people. Great ambience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONE9HOTBiMHBIVlhCVmVrTjZTRk5DTUd4cFltYxAB",
            "text": "Great atmosphere and amazing selection of dishes"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxS2EyWlRlakJ0U2tZMlRWWnNlVFkyY1hvelpFRRAB",
            "text": "We came to celebrate two birthdays, which was not even acknowledged by the way. The servers were not personable nor friendly. We waited over an hour for the main dishes and were not discounted anything! While we were waiting, they did not offer us anything, so we even had to ask for extra bread. On top of that, the fish we ordered was cold when it arrived and made one of us come home sick. We usually never complain when we go out to eat because my family is also in the restaurant business, but this experience was not enjoyable."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBd1dEQnZVV293ZGs0NFNISmhVWE41VGpOV1dsRRAB",
            "text": "One of the most flavorful Sauvignon Blancs we've tasted, wonderful food, great selection, generous service. Decidedly better than Avro on 48th, although that is also highly recommended."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsdGQwYzFjVFIzUW5KQ2VGUnFSa2RRYjBremJYYxAB",
            "text": "My husband and me had a dinner in Avra restaurant on the 25th of August; everything was superb! We ordered traditional Greek spreads for appetisers, tsatziki and egg-plant salad were wonderful; for entree we had a salt-crust whole fish (branzino) for 2; the fish was to die for - fresh, juicy, of natural flavour… The Greek white wine was very good, too. The service was attentive, sweet and hearty. It is a great place! Worth every penny."
        },
        {
            "date": "10달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dXJYTk5REAE",
            "text": "California의 Avra Beverly hills에서 좋은 기억이 있었는데 New York Avra Madison도 멋지네요. 주문전에 크래커와 같은 딱딱한 빵과 올리브등을 먼저 가져다 줍니다. 오후 4시 30분까지 3가지 종류의 요리가 셋트에 $38입니다.  Soup of the day, grilled Salmon, strawberry cheese cake으로 한 set를 주문했는데 만족했습니다. 지하에는 흰색 대리석위에 물이 흐르도록 실내 인테리어를 해서 공간을 화려하면서도 답답하지 않고 아늑하게 만들었습니다. 크리스마스 장식도 아름답습니다. 관광객 뿐만 아니라 현지인에게도 인기있는 모임 장소 같아요."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiMFoydUtnEAE",
            "text": "그리스식 해산물요리전문점. 38달러에 3피스 런치가 제공되는데, 맨해튼에서 이 가격대에 먹을수있는곳은 없어보인다. 맛 또한 훌륭하다. 감자칩에 연어가 곁들여진 전채의 맛이 좋다"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkM1duWnpZMnhoY2kwdGFERTFUa1ozTlZwMFVYYxAB",
            "text": "My wife and I stopped by for dessert and a drink. The staff was excellent. The atmosphere was lively. It is an astetically beautiful space and huge with a full basement area as well. The baklava was the best I ever tasted. My wife and I will definitely return for dinner and the full experience.  Overall an awesome experience!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205MFMxTjVSV2hLZVZWVVZHVTVhVEpvZGtGVVpYYxAB",
            "text": "We had dinner downstairs at Avra and it was vibes. The setting was stunning and honestly? Total gossip central in the best way — everyone was dressed, fabulous, and whispering secrets over cocktails.\n\nFood was fresh and flavorful (the seafood especially!), and the service felt elevated but still warm. Will definitely come back again!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNU5hd1RBEAE",
            "text": "My friends recommend this restaurant and I decided to take my mom on a date.  Omg, the food is delicious. And the cocktails, yummmm.  We tried 3 different dips for appetizer, swordfish was my main course.  It was so tender, juicy and tasty I am still dreaming about it. Great service and nice ambiance.  We booked table in advance. Don't know if they take walk ins."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVNWREZHRNVEZqVlZaWU4xWlpTbUZ1U3poblFVRRAB",
            "text": "Beautiful Greek restaurant with delicious, refined food and outstanding service. We truly enjoyed the variety of fresh, flavorful dishes, each one better than the last. A wonderful dining experience all around. 🫶🗽🇬🇷"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMGIyb253RRAB",
            "text": "We celebrated our first wedding anniversary here with a lovely lunch.\nThe appetizer, a bean-based sauce served with freshly baked bread, was incredibly nutty and flavorful.\nThe fish for the main course was cooked in a Mediterranean style and was tender with deep, rich flavors.\nThe service was outstanding.\nOur waiter, a middle-aged gentleman, was especially sweet, attentive, and full of charm.\nThank you for making our special day even more memorable with such wonderful food and service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLZTA2Wl85OGRPdkxnEAE",
            "text": "My friend invited me to her favorite Greek restaurant for a get-together. Reserve in advance as it fills up quickly at dinnertime (we were there on a Monday night). Great interior. It was a bit too cold on the main floor due to air conditioning. I liked their signature zucchini Avra chips and Jumbo shrimps moussaka."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twMmVXMVljVlV5ZVhacmNVaDRSVjkzV1hSclozYxAB",
            "text": "I had an amazing dinner here with my family. Everything was fresh. The service was great. The atmosphere matched . Good cocktails the lobster pasta was a bit over cooked make sure to ask for it Al dente 🤌🏼🍝 enjoy!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSb1IyeDRNVWh0U3pSYWNXaFVMVzFNTVU1VlZHYxAB",
            "text": "As everyone may know, the food and service and atmosphere here is wonderful. I love the crowd and I always feel very pretty and very welcome here.\n\nThe layout of the restaurant is super pretty as you can see everything. The decor is really pretty and it always smells nice especially when you go downstairs to use the bathroom. There’s a huge mirror for Great full body pictures and always a very elegant discreet bathroom attendant.\n\nThe staff are very professional, classy and personable, and it is truly the epitome of fine dining while also feeling welcoming and friendly.\n\nCome here for any occasion, whether it’s casual for a drink or an elegant business meeting or a first date or with a group of friends after Broadway.\n\nEven something simple like the Israeli salad was super tasty.\n\nThe people who own and manage this place do a very good job at maintaining It’s elegance and great quality everything and I’m sure it’ll continue to be around for decades to come."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aaVgzZE1UVGx2Y21sa2FYWTJVVTU1TjJwNk1IYxAB",
            "text": "We made reservations at 3:15 pm on Saturday when we get to the restaurant we felt all welcome. Its beautiful atmosphere on my birthday foods and service were amazing.  It’s lovely experience we had"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGdFFWbE1iek4yYlZwYU9VODRRbGt4V0VWTFFsRRAB",
            "text": "I celebrated my birthday lunch at Avra Madison and the experience was truly phenomenal. Our table of eleven was treated with such warmth and care throughout the afternoon. The food was excellent, and the service stood out as exceptional. Our servers, Ozzy and Nicola, surprised me with a spectacular platter filled with all of the desserts for the table and birthday candles! They even gave my aunt and uncle a thoughtful tour in the back, which made the celebration feel extra special. Every detail made us feel welcomed and celebrated. Thank you to the wonderful team at Avra for making my birthday unforgettable!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNamExWWVHa3ZXdm53RRAB",
            "text": "Always a Favorite – Great Vibe, Excellent Food\n\nAvra Madison never disappoints. I love the energy and upscale yet relaxed vibe – it’s always buzzing, and the service is consistently top-notch.\n\nThe food is excellent across the board, but I highly recommend the lobster pasta – and make it spicy, trust me. It’s rich, flavorful, and absolutely delicious. From start to finish, it’s the kind of place that makes any meal feel like a special occasion.\n\nOne of my go-to spots in the city – can’t wait to go back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSeWRYcDRTMGN4WkVKTGFsQklVemR5TFhCbVNVRRAB",
            "text": "I would like to thank our server Alex so much. He was very friendly and helpful and smiley . Also very patience with us. The restaurant itself was really nice. Very clean and food was very tasty. Plus for the service price was not high at alll. Had an amazing time being there with my cousins."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dlJVeDFWa1Z0U1VjeVZrNTZabXB6WlV3NVIxRRAB",
            "text": "I had the chance to have lunch at this modern Greek restaurant that stood out as one of the rare examples of true Greek fusion cuisine. You often see fusion styles with Chinese or other Asian cuisines, but Greek fusion is much harder to come by. Here, the concept was executed beautifully,  a contemporary interpretation of Greek flavors served in a space that was vibey, energetic, and tastefully decorated.\n\nThe service was equally impressive. The servers were not only professional and respectful, but they clearly took pride in their work. They were gracious, attentive, and genuinely engaged z forthcoming with information, elaborating on menu items, and offering thoughtful advice and selections for both food and wine.\n\nThe food itself was outstanding. I had the octopus, salmon, spinach, and baklava. The octopus was a highlight,  traditionally served grilled in one piece, but here elevated with exceptional seasoning, sautéed with plenty of white onions and chopped vegetables, and finished generously with olive oil. The fact that it was served hot made it even more memorable, adding another dimension to the flavor and texture. The salmon was perfectly cooked, the spinach dish was fresh and flavorful, and the baklava was a sweet and satisfying finale.\n\nOverall, it was a thoroughly enjoyable lunch,  a perfect blend of modern creativity, authentic flavors, and top-tier hospitality."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OS01rNUhZUzFSVUZSVGNVbGFSVGw0UkVWdU9HYxAB",
            "text": "First time there, and I enjoy myself. The only thing I didn't like was that the single tables by the bar were too close together. Another guest came to sit at me and rubbed his butt on my food, which I couldn't eat, but besides that, I had a nice time"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOZk9XbzJiRXRMTWtOb1RIWkxWSEJNYmpST1RrRRAB",
            "text": "Soooo delicious! Came out with friends and it was worth it. The hummus and tuna tartare...so good. I ordered the Salmon with grilled veggies and no regrets!!! And the dessert platter....yes yes and yes"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeWVqYklnEAE",
            "text": "Had a great experience at Avra!\nI’m a big fan of pasta, and the special rigatoni in tomato sauce with shrimp did not disappoint, it was absolutely delicious.\nThe Avra chips were a surprising highlight, super addictive! Will definitely be coming back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKaklwUEdvczQtamhBRRAB",
            "text": "This was one of the best dining experiences my family and I had during our trip to New York. The food was fresh and tasty, we had a variety of plates and everyone in my party enjoyed their meal. But the true beauty of our visit was the service. A glass never remained empty long and our plates were cleared quickly. Every staff member was kind and helpful. Our server, Georgios, was absolutely amazing! He was personable and obviously cared about wanting us to enjoy our meal. He was not pushy and answered any questions he had. He truly exemplified above and beyond service. I watched him assist a woman with her luggage, offer another table a seat pillow to be more comfortable, and check on tables that he wasn’t actively serving. I hope he gets the rightful praise for making our experience so enjoyable!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1QlZ6ZEdhMWhLYkRNek1rSnVXbTk2TVhrME1tYxAB",
            "text": "Todo riquísimo. El hummus con pita soberbio, los langostinos con musaka espectaculares, y el BAKLAWA tope de gama. Un poco ruidoso con mucha gente.\nMuy bien atendido por parte del personal"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psMWJXWlpUa2N0YkVoU1VWSXdTMHN6ZUVKMU5rRRAB",
            "text": "We were  late for dinner. We  ordered their starters along with signature fish. I must say  it is one of the finest restaurants, and the service were absolutely amazing. The taste of the fish was also amazing ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNM2NraDROVlZ1VlhwV1dHbFpSR1ptTFROUmExRRAB",
            "text": "Dessert may be an odd place to start a restaurant review, but don’t sleep on the desserts at Avra!! Make sure to leave some room in your dessert stomach for impeccable fresh fruit, flaky baklava, or the lemony olive oil cake.\n\nThe freshness of all of the foods is what makes Avra such a standout. Gorgeous greens, ripe and flavorful tomatoes, and briny olives and capers are paired with fish flown in from all over the world. Food is prepared simply, yet packed with flavor.\n\nOne of my go-to restaurants when I feel like eating out, but don’t want to be weighed down with cream sauces or fried foods."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbnVuX21nRRAB",
            "text": "We’ve been coming to Ava for many years and always have wonderful time here.\nDecor is gorgeous!\nThis time we went with lunch prix fixe at $38 and it’s the best deal you can find. We added some items with surcharge but it was worth it.\nI had a special for the day which was branzino. Grilled calamari was cooked perfect. Dessert is nothing special though.\nTheir food quality and service are superb.\nDefinitely coming back when I’m in the city."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdUpfVnl3RRAB",
            "text": "Best to make a reservation for dinner as the place gets crowded even on a weekday evening. The Avra chips are really good and so is the calamari. Fish is their speciality but the lamb chops were very nicely done too. Save some space for dessert and get the chocolate cake. Was a great dining experience."
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYenNuUVlREAE",
            "text": "Ristorante particolarissimo. Ho passato qui il mio compleanno e non sono rimasta delusa. La cucina è ottima con delle chicche come il polpo tagliato e arrostito che fanno davvero gola. Il posto è ben frequentato e si trova davanti a radio city hall."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOEktVmp3RRAB",
            "text": "Lovely ambiance reminiscent of the Mediterranean Sea. We ordered a lot of dishes to share but couldn’t finish most of them because the portions were huge. The salmon tartare was served with potato chips that looked cheap, like they were from a grocery store, though the salmon itself was good. The Greek salad was made with high-quality ingredients and cut into large pieces. The cheese was a bit too salty for my taste, but overall, everything was well-balanced. The pita with a set of dips (traditionally called meze) was interesting and tasty. The branzino ceviche was good as well, but the presentation was messy, with too many unusual ingredients. My favorite dish was the zucchini chips with tzatziki. The homemade ice cream was served with peanuts and melted chocolate — probably perfect for sharing among 5–6 people. We were three and couldn’t even finish a third of it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyeXVpUmhnRRAB",
            "text": "Overall a pretty decent meal, with questionable pricing. The standout dish, bar far, were the lamb chops. They were very well seasoned and delicious. I thought the swordfish was a bit over cooked and could’ve used more acid. And you can definitely pass on the desserts."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRX3N1LTNRRRAB",
            "text": "AMAZING Mediterranean food and vibes. Went during the lunch hours and the 3 course meal is truly indelible. From the; Tuna Tartare, Branzino, & Baklava each dish was rich in flavor and presentation. To top it off the ambiance & service was also incredible.\n\nEach time I visit New York this restaurant is must go to!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIX3N5Uml3RRAB",
            "text": "Very nice place. I think good for meeting with friends and gather with family. Service was excellent. Food tasteful. Seafood fresh. Cocktails were just average not special. Chocolate cake was well and big portions bc one is enough for two people. Only thing is prices are high maybe due to location yet for the price that they have little overprice."
        },
        {
            "date": "1년 전",
            "language": "ja",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3amFQRlNnEAE",
            "text": "たまには良いかと思い、少し高めのお店に入った。\n堅苦しすぎないけど、少し格式の高い雰囲気のレストラン。\n赤ちゃんが寝てたから落ち着いて食べることができた。赤ちゃんには別で取り分けてお持ち帰りさせてもらったら、喜んでほぼ完食してた。\n特にオーガニックのグリルチキンというメニューが味付けが濃くなくて繊細な味わいで好きだった。"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYeWQ2Y3BBRRAB",
            "text": "What a wonderful find. It was across from our stay @ the Metropolitan and we had a late dinner. We sat outside and it was sooo enjoyable with their heaters. The food & service was wonderful! We enjoyed it so much we went back on Sunday for brunch. Again, wonderful food & service. Fun fact, it’s in the location of the famous NYC Copa Cabana."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSbllrRmlSakp1YjIxa01WQnZVamxIVmxnek9VRRAB",
            "text": "Love Avra & right next to Bar Penelope.\nThe bar doesn't have enough seats.\nThe Yellowtail was better than the hamachi.\nShe got the swordfish & potatoes. it was good, I wouldn't order that next time. Loved the fries & complimentary little hummus.. so good.\nThe skinny marg with blanco was delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMNlkyTVp3EAE",
            "text": "The service, decor, and food were exceptional. For a large restaurant,  the ambiance is warm and welcoming. Plus, the menu was excellent yet unpretentious.\nI met up with family for dinner on short notice. It's my brother-in-law's favorite restaurant, and he returns again and again with friends and family.\nWe made late reservations, and the staff allowed us to linger past midnight.\nIt's a great place for large and small gatherings. Highly recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMjRuSmVREAE",
            "text": "Avra doesn’t miss a beat - all the staff are smiling, restaurant is cozy yet elegant, lunch prix fixe is beyond reasonably priced and so good. Lots of healthy options and hearty options so good for a wide variety of appetites. Complimentary hummus and pita/cracker is super yummy. Pictured are calamari, salmon tartar, branzino, and a breakfast platter for the kid."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxaGNEYzBRek5GUmpadVNHeDZkMHRZUVhWeVdrRRAB",
            "text": "The octopus, salmon and pistachio ice cream were amazing!!! Our waiter was so sweet too!! Great place!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSGQyRXdiMll0Wm14RFVqVlJOMUpTV0dKeVIzYxAB",
            "text": "I had the most wonderful late afternoon lunch at Avra . The ambiance was beyond compare. The fixed price lunch served until 4:30 was $39. We were treated like royalty from start to finish. The waiters a tall gentleman with a Greek name starting with a \"T\" [ forgive me as I wrote it down but can't find it] . He was so lovely and accommodating. Louis took over and was a true example of the perfect waiter though I would like to call him more than just that. He was personable as well as warm and inviting. He added to the experience with a genuine sense of real people. The food was excellent. We were treated to all of the desserts on the fixed price menu. Avra is the perfect place to enjoy a Sunday afternoon lunch. Thank you for an incredible experience for myself Lori and my sister in law Susan for everything!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0MnAzNmZnEAE",
            "text": "All the food was really enjoyable. We had the lunch menu it it was fantastic. The branzino was fresh and delicious. Also, the lamb chops were perfectly cooked to medium rare. Staff were very professional and service was on point  through the whole meal. We'll definitely be back for dinner to enjoy more of the fish or seafood dishes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214VFlYVlZjbWRwWHpFMmJ6ZEVXazlGY2twUlJGRRAB",
            "text": "Very cozy place, friendly staff and good service. Delicious food and a nice atmosphere! You always want to come back to such a place again!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzaDk3aC1BRRAB",
            "text": "Great place. Lively atmosphere. Gets really busy in the evenings so reservations recommended.\nThe beet salad was really good. I was hesitant about the almond puree but it was amazing. I also had the swordfish which was delish.\nThe drinks were great as well.\nThis is a great spot for Friday after work. Gets really busy for a little cocktail hour."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdzhIX21BRRAB",
            "text": "Everything about this place is top notch from the hostess to the servers they never disappoint with their 5 star service even walking to the bathroom waiters coming with full hands of plates will give you the right of way the food is incredible the wine is delicious highly recommend for that high class new York dining experience what's better than walking off your incredible meal with a walk through Central Park! Tonight we had the calamari with this incredible basil pesto type sauce and the lobster linguine omg it was incredible! Also nothing beats the hummus platter they bring as your bread basket I am enjoying savoring every taste my entire plate was satisfied!"
        }
    ],
    "reviews_count": 90
}