{
    "name": "Le Botaniste",
    "place_id": "ChIJXbvPKe9YwokRroLArCwh2LY",
    "grid": "MN8",
    "address": "833 Lexington Ave, New York, NY 10065, USA",
    "rating": 4.6,
    "user_ratings_total": 1144,
    "phone_number": "(917) 262-0766",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BNFVFSnRjekZvTFVGMWRWSlZNV0pLYVdkdlozYxAB",
            "text": "If healthiness and ethics is the ultimate criteria to choose food, then this restaurant may be a reasonable choice. However, we are after food, which beyond healthiness provides a good and inspiring taste. This is not a contradiction, but that's why we were very much dissapointed from this one."
        },
        {
            "date": "4일 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkTVZVZ3dZbkp2ZFdKb2IwTTRTa0p2WDFKU01HYxAB",
            "text": "Bien goutu.  Bien servi ! A taille humaine !"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FNGIxaGhPV1J5TkZwb1h6ZEhiRVpwVDJSck5FRRAB",
            "text": "Each course brought new reasons to be impressed. Their menu items are properly executed. Our party had a good experience at this restaurant. The team recalling past conversations builds relationships. This spot showed excellence throughout."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GR1pYQmFNMEZQTVhWUFoxZFNWSEpCWTJacGFtYxAB",
            "text": "Place is super nice and food is amazing. Just be super careful about their neighbours Resveralife who are targeting women with extremely expensive cosmetics which you can’t return (they use extremely aggressive sales tactics)."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCSGMwVkNhMlpzV0hkRlpHRnlUblZZTlRodE0yYxAB",
            "text": "So happy I finally dined here! The food was so flavorful and nourishing, the service was attentive, and the vibes were lovely. Will 100% return soon."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNFYzWjNVMVZYVDJseE0wbDFWbXgxU0daS1dHYxAB",
            "text": "Very good lunch here. Their dishes satisfy completely. Straightforward food prepared skillfully satisfies me. Employees combined promptness with real kindness. I'm ready to come back for more."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sNFVFZG1hVm96VGtwVVVsVXhRamhEYjJkcWJtYxAB",
            "text": "The value quotient here exceeds most restaurants nearby. The feeling is upbeat and the servers are competent. I've tested several menu items and found decent quality. Speaking of service standards, all workers are remarkably pleasant. I want to come back without much delay."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTU9ESlNTSEE0WldkUVkwbEtSRGRWTWtoUFQwRRAB",
            "text": "Don’t …. Haha. The food quality is terrible and I’m not sure why they exist"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201T01reHdSa1ZLUkd0SFJrTjFNREJYUjJablUxRRAB",
            "text": "Really tasty and healthy food and atmosphere 🤩"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4all6TmxVbkZKWDA5bU0xQlVWVkp0VGtWMlRsRRAB",
            "text": "Delicious food, people welcome you warmly, atmosphere is very cute"
        },
        {
            "date": "4주 전",
            "language": "tr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NFozWk9jSGhDWHpOR1MyWmFjV0l0YW0xTk1WRRAB",
            "text": "Çok güzel mekan lezzetli 👌"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNlExQlRTblIyY1hwWU1HeGFlR2MzWVdsNWFrRRAB",
            "text": "The food is very fresh. You can order prescribed meal, or make our own bowl. The atmosphere is cosy."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjdFJVcEVWbGxVV1VWb1NrSkxZVkIwYkhFNGRWRRAB",
            "text": "We stopped in after a nearby evening event. They were only 30 minutes from closing, but they had no shortage of all of the menu items.\n\nWe chose the botanical therapy, 3 half-portion bowls to share. The bowls were prepared to order and each one was packed with flavor. Sometimes vegetarian meals are served with too much pasta or rice. This was not the case. The bowls were full of vegetables and sauces. Very tasty!\n\nThe decor looks like an old apothecary or pharmacy. Simple, clean, and welcoming. The staff were all friendly and helpful.\n\nAs vegetarians, this type of restaurant is a great addition to the New York food scene. Wish there were more of them and more similar choices of places to eat."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SR2FUSlliazFCUjBsTlJsQjNjbWg1VVMxaldXYxAB",
            "text": "Most of the mains are very garlic heavy. In contrast the \"lemon hummus\" I had was practically tasteless, no tahini or bean flavour, no acidity from 'lemon', very strange.\n\nAfter ordering the meal I asked for a receipt, and entered in my email for a digital version. However I never got my receipt and instead only get spammed by their loyalty program.\n\nWould not go back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWlMycENORVJPVVhKTlV6azVjRW8wV1V4VWVsRRAB",
            "text": "Every visit feels uncomfortably hot and humid—almost like eating inside a cloud. Warm stews only add to the heat, which makes dining a challenge. That said, the staff are wonderful—consistently friendly and welcoming."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3dFkwUTFObTA0Y1c5clFXOUthbnBSTkRSNFZYYxAB",
            "text": "Went in for the wine and dine."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkbk5YSmpOMFZ6YUZWUVFrNU9UVEZxYzNReWNYYxAB",
            "text": "You pay more for meals that satisfy completely. Not one thing falls short here. Employees were approachable and friendly. Totally tasty and they give large servings. My favorite option. I appreciate this place genuinely."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201R1NpMVhXR3RvY21WWFlteEdZMFZNZGxGdk1GRRAB",
            "text": "Great selection of food with a cute atmosphere, plenty of seats to sit and dine"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WVFkwbFBWMDF0ZVRCWE1tZG1UV1EyVTFaRGMzYxAB",
            "text": "Cozy apothecary themed ambiance, soul warming whole food plant-based delights. Yum!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOb09IUlVhalJ0WDJOck9IbEVRbEpGVmpkU05WRRAB",
            "text": "La Botaniste offers delicious, well-prepared food in a beautifully decorated space. Even as someone who isn’t vegan, I really enjoyed the flavors. While the atmosphere and food were great, the staff could have been a bit more welcoming. Overall, a tasty and visually pleasing spot."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURldnQyUV9nRRAB",
            "text": "We were walking by this place and decided to stop by for dinner because it looks cute from outside. Pleasantly surprised upon entering by the warm welcoming staff, ambiance, spacious sitting area and the nice food options. The meal was delicious and plant based which is huge plus for us."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pReVprVk9kVlZCZFVwZlRHUjRWRnBaVVRKT2QwRRAB",
            "text": "When I am in NYC I go to Le Botaniste, love this place, seriously good value, really good healthy food in a warm welcoming atmosphere."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkMlpWWmlZMnhJT0ZrdFJGUkJSa1JXZDJoWVFsRRAB",
            "text": "What a fantastic little spot!! Worth going, the food is amazing & delicious!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psRVdtdGZOMnRsV2kxS1pIZEJjVlozYTFSWmRHYxAB",
            "text": "Wow 🤩…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sb2MyMTRVbVJqV1c1a2JFaDZhbmQxT0hWR1lrRRAB",
            "text": "The food here is simple yet healthy, and hearty. When I walk in, I love the smell of it and I always feel welcome. I’m not sure how they do it, but I love it.\n\nI especially love grabbing something right before a movie and sneaking it in. The aroma of everything always makes me feel good.\n\nIs definitely worth the money and your body will thank you for giving it such healthy filling food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkRGFFWkNaRTgwWXpObU4xWmhTbkZVYkRoaE1XYxAB",
            "text": "The salad was super fresh and delicious. I absolutely LOVED the seedy avocados!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xalEzUkdZVlYyWHpGNVVreFNWbVpNUTA5NVJVRRAB",
            "text": "Amazing experience! Healthy food could be delicious too: that’s the place to experience that!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMVFtOW9SSFp2WnpjMllqaE9kMnR6TjJWMFNWRRAB",
            "text": "I love this restaurant! I’ve gluten intolerance and when I tried this place I couldn’t stop coming.  People are nice and the place looks gorgeous!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aaVp6Tm5XSGxYTmtWR2RuUkVlVmR1T0ROR2IzYxAB",
            "text": "Really loved the food - so fresh, healthy, clean and delicious. PERFECT for lunch or an easy dinner!! The staff are very friendly and will answer any and all questions about the food. I wish the seating was a little bit comfier, but since the food was so good I don’t really care :)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTFZXRjFNbUUxUldsQ1FqVlpjMG8wV2pWSk1tYxAB",
            "text": "This time I had the Tibetan Mama, added the avocado and a lemonade. Perfect comfy and real food."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGaVZ6VnpNalJRUjFWTGVFcFZSR0ZIVlc0Mk1HYxAB",
            "text": "Irresistibly delicious. The Full Therapy: a half bowl of three different dishes (Pasta Bolognese, Chili Sin Carne, and Mediterranean Pasta) was incredible. Thoughtfully composed so every ingredient had its moment to shine.\n\nTheir refreshing lemonade and black tea, along with two desserts: the omega-3 chocolate raw brownie and the raspberry raw cake were sweet, filling, and richly flavored.\n\nThe ambiance is lovely.\n\nFlawed service but the staff clearly do their best to ride the wave of occasionally difficult Upper East Side customers with grace."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGb2NtaGZNRTVPVGpCUFkyVlNTMnRRTlRZNWNrRRAB",
            "text": "Fix the A.C, is hot inside, and the employees look sweaty."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLNzVnTDNnbzVYME9nEAE",
            "text": "It is soooooooo good 👍 and the Bathroom 🚽 is 🤔 nice work and good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205QkxYUXpPVkIwWDBsTUxUSkdaMGd0VlRCd2VsRRAB",
            "text": "I’m not a vegan, nor am I particularly interested in vegan food, but I ended up at this restaurant because someone in my group is. Since I generally love vegetables and eat them a lot, I was actually looking forward to trying some delicious vegan dishes. Unfortunately, I was quite disappointed. While the interior and presentation were impressive, the food itself was very dry or bland. The table, dishes, and silverware were noticeably dirty, it didn’t feel like the staff really cared about the customers. It was disappointing that, despite using a variety of ingredients, there seemed to be no real attention paid to the flavor."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204NGVrVkdOVzlxV0ROdldrVmxZaTE2UWs1aVRsRRAB",
            "text": "Lovely establishment, food was delicious ingredients were on point. Will be a frequent visitor whenever I’m in town."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taUmIxOW5SRjg0ZWpjM1FVTTBZa2N4TFU5WlFtYxAB",
            "text": "If you’re looking for a meal that’s entirely plant-based, Le Botaniste is a great choice. The restaurant was thoughtfully designed, creating a calm and welcoming space that’s perfect for dining solo, with friends, or even catching up on work with your laptop.\n\nThe staff were warm and friendly, and the food presentation was beautiful. I ordered the Pasta Bolo and Tibetan Mama bowls—both were excellent. The Tibetan Mama, in particular, was full with flavor and very filling.\n\nThough I’m not vegetarian, I enjoyed the meal and appreciated the organic ingredients. There’s plenty of comfortable seating, and the peaceful interior makes it easy to relax and linger. Highly recommend whether you’re plant-based or just looking for a clean meal!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBdGFtMW1TblpvYVhKck5GbDZTVkppVjFFMGRtYxAB",
            "text": "Food is always really great but this location is specifically lovely! The staff is super friendly and seating area is beautiful."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gek1HbE5abWRsYUZwZlFXMW1jVUY0VjBOZmMxRRAB",
            "text": "This was my first visit to this beautiful place, and I had a great time. I would definitely go again.  The cuisine was excellent.  Additionally, it tasted amazing and left me feeling full (yet light) while having all the healthy ingredients (check the boxes).  It appears that the delusion of feeling full after eating a really healthful meal is just that—an illusion.  Even though I eat a lot, I was unable to finish this lunch in one sitting.  Additionally, it was reasonably priced. I don't want to seem too critical, but their filling meals are a fantastic deal.  Thus, my pocketbook and stomach were both satisfied."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VMclNrOURSN1pHNER3EAE",
            "text": "Food was excellent but no working bathroom and you do not find one until after you eat. So if you plan on stopping by before a day around the city keep in mind you would have to pay for a coffee somewhere nearby to wash you hands, use the restroom and freshen up afterwards which is a bummer."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOenM5OUdaM3JuMThRRRAB",
            "text": "The set-up here is really cute, with a little garden-like area in the back and plenty of seating inside. You order up front and you can see all the ingredients laid out etc. I enjoyed my peanut noodle salad; the baked goods (cookie and chocolate cake) were definitely underwhelming, though."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPci1nTVdrbXNTYlF3EAE",
            "text": "Vegan Brownie with cashew cream must try! 👌🏻"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPU0RyZGpaMmY2MEpREAE",
            "text": "Wow!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMZjJydm1OaDhUYzV3RRAB",
            "text": "So fresh! Their use of spices to add flavor really brightened the salad."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXdTZiMG9RRRAB",
            "text": "Great place for vegetarian!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMdlczSWVZMzluanFnRRAB",
            "text": "I had a terrific time, at this lovely spot; it was my first visit there, and I'd definitely return. The food was delicious. And even though it was all of the healthy things (check the boxes), it tasted so delicious and left me feeling full (while also light). It seems that the illusion of not being full post super healthy fare is just that -- an illusion. Tbh, I eat heartily, and I still couldn't finish this meal in one sitting. Plus, it was affordable -- sorry to sound so granular, but their satisfying meals are a great value proposition. : ) So, both my tummy and wallet left happy.\n\nThe young people who served me there were attentive and sweet, and gave me a warm welcome. Last but not least, the physical environment was nearly as nourishing as the food itself; it's an aesthetically beautiful space, in which to gather one's self, refuel and take on life again. And Lord knows, we need plenty of such spaces in busy NYC! With Thanks & Love, Katherine"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VLR2R3Snpfd2J6TGRREAE",
            "text": "The food was good with healthy vegan options, and overall it was a nice experience. However, there was no tap water available unless requested. When we asked for water (twice), it took about 10 minutes, and by then, we were nearly finished with our meal. It would be great if they could offer water carafes for customers when they pay for their meals."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNbll0YmpyN05DZ3lBRRAB",
            "text": "A good option for healthy food, you can make your own dish all with organic ingredients, they have a good atmosphere, great attention, if you are done with the typical fast food in the city, I absolutely recommend Le botaniste"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNWG9fSWkwNmFYa0NBEAE",
            "text": "Wonderful health conscious vegan eatery in the heart of manhattan! I ordered the botanical salad and was blown away by the quality of the produce and the vibrant flavors. Additionally, the staff were incredibly pleasant. The atmosphere of the restaurant was very inviting with the walls featuring mantras of the “food as medicine” school of thought and floral designs. Best of all, the food was served in fun colorful bowls (if you eat in). The food is reasonably priced (for the quality) on top of all this! That being said, this restaurant definitely is not for everyone! You have to really like vegetables for this restaurant to make sense for you. The food is minimally salted as well."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOakhzTmJhdU1MT1VREAE",
            "text": "Delicious! The best vegan bolognese I ever had!"
        },
        {
            "date": "6달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZanJPN1dREAE",
            "text": "Mal was anderes als Pizza und Burger. Sehr lecker gewesen. Macht weiter so 👍🏼"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKeWRxVXNRRRAB",
            "text": "맛있다\n채식은 풀만있을꺼리는 편견이있었는데\n뮬론 풀이랑 야채지만 소스랑 조리법 드레싱등이 조화를 이루어서\n거의 육식주의자인 내 입맛에도 아주 맛있게먹었다\n양도 엄청많다\n가격도 꽤나 저렴한편이다(뉴욕기준)\n첫 채식식당이였는데 매우 만족한다"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURReC1uZDRnRRAB",
            "text": "Delicious. I had the chili and it was really good! I had it with the tofu and the seed covered avocado. It was a great portion and I enjoyed every bite. I also had the brownie and it was tasty as well. It was easy to find. Very clean with lots of searing and a great atmosphere. The staff was very pleasant and offered a lot of advice as well as a warm welcome. The ambiance in the store was really nice and I liked the back seating area with its natural lighting. I’ll definitely be back the next time I’m in NYC."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJN1Bqd0VREAE",
            "text": "Amazing fresh vegan gluten-free food with outstanding service. I enjoyed the Vegetable Tajine, and my husband enjoyed the Pasta Bolo, Iced Green Tea, and 2 chocolate chip cookies. Great for our body and soul. I can't wait to go back so i can enjoy something new."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbjZiNERBEAE",
            "text": "Love this chain! I’m not a vegetarian but am always open to new experiences. In Le Botaniste (this is the second location of theirs I’ve been to) the food is always fresh and exciting: a lot of the time I have no idea what I’m eating (I usually go with premade bowls and don’t always read the ingredients) but it always tastes delicious. They also have really good organic wines at very reasonable prices."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdHN2MWlBRRAB",
            "text": "I’ve visited several Le Botaniste locations, and the food and service are consistently excellent at each one. I appreciate that the restaurant offers organic, plant-based dishes that show how simple, healthy food can truly be delicious. It’s a fantastic spot for lunch, and their desserts are incredibly tasty! The staff is always friendly and welcoming. It's also rare to find a restaurant in NYC that focuses on organic ingredients like this, making it a true gem!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURubjY2OU9nEAE",
            "text": "Although I'm not a vegan, I DO love food. Period. The dishes at Le Botaniste are fantastic and flavorful. Plus the decor is 💯.\n\nI had the Chili Sin Carne bowl which definitely hit the spot. My colleagues and I also shared a bottle of red wine which paired well with our dishes.\n\nHighly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaXJmQUVREAE",
            "text": "Been here twice now, 2 days in a row and this place is lovely. The menu is fully vegan and they have lots of different options. One could go for flavorful food like chilli or simple salad. Love the vibe and the servers are nice. Quaint little spot makes it even more perfect"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNReHZDYjhnRRAB",
            "text": "I’ve never heard of this chain before, but I went here today for my solo birthday lunch while exploring the UES. The food was so yummy, and tasted fresh and healthy. I’m so glad to have discovered them! If only they had a location uptown, I’d be a frequent customer. But I’ll definitely remember them if I’m ever near one of their locations again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NnN2OEhnEAE",
            "text": "My coworker convinced me to come here during lunch, and I was hoping the food would be “good for vegan food”, but it was honestly “really good PERIOD”. The portions are on the smaller side, but it’s a good lunch spot if you’re looking for a lighter meal. I also tried the crackers with a hummus dip and it was not very good, so I’d suggest avoiding that. Service was great; everyone was so friendly and welcoming. I’ll actually be back soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqelBIRmFBEAE",
            "text": "I loved everything about this place.  The wines are from France (I’m allergic to American wines 🤷🏽‍♀️)and organic and were delicious.  All the dishes were delicious!  Also the power flower latte was awesome!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxM3JtSW1RRRAB",
            "text": "A really good vegetarian restaurant offering salads, pasta bowls, and herbal items. Service was great and the food is amazing. The garden decor inside is very pleasing. Portion is quite small for the price. Only paid street parking and garage available nearby."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSaHFXbkZnEAE",
            "text": "A beautifully decorated, and extremely detail oriented atmosphere. They have a lot to offer - natural wines, bowls, soups, dessert etc. found the prices to be reasonable for a bowl + all natural organic food. I had the miso bowl which I…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbzlxOHhnRRAB",
            "text": "I had an incredible dining experience at Le Botaniste in NYC. The plant-based menu was not only delicious but also creatively crafted. Jesus and Justin provided exceptional service, making my meal even more enjoyable. The food was so good that I've become a loyal customer - they have gained a 'chromer for life'! I highly recommend Le Botaniste for anyone looking for a unique and flavorful dining experience. I highly recommend this place!!!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNScUxpTVp3EAE",
            "text": "Amazing little place, with super delicious vegan food. No animal products whatsoever. I am not vegan, but went there with my friend and was blown away by the quality and deliciousness of my meal. It is not overpriced. The staff is chill and will explain everything to you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MnZqYTFBRRAB",
            "text": "Really lovely place for a healthy, delicious meal. I’m gluten-free so I appreciated that that was the default (instead of having to parse through the menu to find the GF options).\nMy partner and I ordered the Tibetan Mama and Saag Bota. Both were flavorful and we loved that they were filling but didn’t leave us feeling heavy afterwards. The staff were also friendly and welcoming, and helpfully walked us first-timers through the menu.\nWe’ll happily eat at Le Botaniste again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKNjZ1NFFBEAE",
            "text": "Food:\nIt was alright. We were a party of 5 and everyone’s feedback on taste was more or less „okay“. I myself was not amazed at all. The food was healthy. If you are in the mood of having a healthy meal, this is definitely the place to go! I would almost call it the exact opposite of junk food! You can feel good about yourself having consumed natural, vegan nutrition. In the pictures you will see what I have ordered. I guess, my favorite was the avocado.\n\nService:\nFirst question of the employee was „have you ever been here?“ when answered no, she started to describe all the different options and rattled down the complete menu. Literally everyone in our group was even more confused after her presentation than before. She explained the entire menu, very fast with no time to ask inbetween questions. This resulted in all of us pointing at things and saying „I want that mixed with this and that. Rather than choosing from the menu she just presented.\n\nAtmosphere:\nThe place offered indoor and outdoor seating and had bathrooms. What I liked was the location being so close nyc center and all the plants for decoration.\n\nHave a look at the pictures and videos."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0Z0tLeEVREAE",
            "text": "yummy food in an intimate space. lots of choices too so you can customize based on what you're craving. fully plant based too and the menu is full of feel good food. I got the Tibetan mama with quinoa instead of rice. it was heavenly!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzaGVhNnFRRRAB",
            "text": "I was walking by and I was browsing to eat somewhere new. Until I came across this restaurant. As soon as I entered, I was welcomed, acknowledged, and had a friendly attitude from the employees. Especially from, Ingrid, the person who provided options for me and recommended what to get as a first-timer. It was the best decision to try and eat the ‘chilli sin carne.’ I would recommend this place 10/10. The quality of the food is perfect, and the portion is also 10/10."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dmNhNFRnEAE",
            "text": "Wow! the food is amazing! a gourmet vegan food. it’s so delicious and great recipes! i recommend the bowl and soup combo. they also have natural wines"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURncnIyeUdREAE",
            "text": "Nice vegan place! 🌍Made my own bowl  for 17$ with Quinoa, coconut peanut curry ( you’ll like it if you like Thai dressings)\nJust make sure you pre-decide your toppings"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpeVBUMG13RRAB",
            "text": "As someone trying to eat more plant based meals, I love Le Botaniste. The restaurant’s aesthetic is beautiful and the staff is both friendly and knowledgeable. Everything I ordered was delicious and fresh. Everything is vegan and they have…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXeDVXMUpnEAE",
            "text": "Excellent 👍, delicious, yummy, Healthy, clean, the service is excellent, quiet place to share with friends. The employees have excellent service for the customers, Gadniel is one of this employees 🙏. Thanks for understand my English, they have one employee that can help me in Spanish  thanks too, I  recommend 💯 mand I will be back soon. Nice place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNktLS2dBRRAB",
            "text": "The service was as good, if not better, than the food - and I love the food here! The server thoughtfully walked me through the menu, helped me with allergy accommodations, and let me sample the stews. I also was graciously provided with a generous side of the coconut sour cream. I felt so welcomed and cared for."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtaUo3ZFd3EAE",
            "text": "Great hangout place!!! All vegetarian, but it is flavorful and delicious. It is also affordable compared to other Vegetarian restaurants in nyc\n\nHighly recommended to Try the Moroccan stew with quinoa or cauliflower rice. The miss soup noodle is not bad\n\nA fun hangout place for dating and group hangout"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvX1pDVnhnRRAB",
            "text": "Tasty plantbased menu, with lots of flavors and textures! I always eat the chili sin carne and it’s perfect. Good size portions and you feel good after. Also have to say that I love the apothecary, homey style of this place, makes it a good lunch spot and they even have a bar with organic wine which is a big +"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRcXZldjJ3RRAB",
            "text": "Gorgeous little gem of a place, and this comes from someone who normally doesn't love vegan food much. This place proves it can be excellent. Simple yet comfortable and nice interior, styled like an old apothecary, and gorgeous, tasty,…"
        }
    ],
    "reviews_count": 76
}