{
    "name": "Le Bilboquet",
    "place_id": "ChIJdQhd5e9YwokRCqi-NNF8vkU",
    "grid": "MN8",
    "address": "20 E 60th St, New York, NY 10022, USA",
    "rating": 4.2,
    "user_ratings_total": 786,
    "phone_number": "(212) 751-3036",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWYVJVWnFaRkpvVEZkVVpETkNhVnBpYjFGa2FrRRAB",
            "text": "Very unique restaurant. My party had a blast dancing and eating. My only issue was the music was louder than the last concert I went to and I thought my ears were going to explode. But we danced like horses and left like crows. We will be back with earplugs though. If you are coming to have a conversation with someone, you can forget it"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psblFtVnJiVTlJUVdwUExYbzFWMEpDVEZkUVptYxAB",
            "text": "Double charged my wife’s card last Friday. Get with modern times and invest in a normal card machine that takes payment immediately."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSGMzWXpRMjVIZFVWU1pXcEdibXB4WW5SWFJIYxAB",
            "text": "Had dinner last night and was looking forward to a fine dining experience .\nI do live in Las Vegas and have been spoiled by the exceptional restaurant choices so my review is a direct comparison to other fine dining restaurants.\nDinner reservations was set for 7 and we arrived at 6:50 and were sat immediately.\nThe wait staff was very attentive and timed the meal perfectly .\nWe choose the recommended items Hamachi , Dover Sole and  a menu Skirt steak .\nThe Hamachi was cut too thick for my liking but was covered in a delicious sauce .\nThe dover sole was cooked beautifully and a very large portion . Could easily feed 2 . The Skirt steak was undercooked , tough and chewy . The frites were over cooked and starchy .\nOverall great atmosphere, staff but the food did not live up to my expectation.  With a $170 bottle of wine the bill was $498 ."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210aVNWZEtTRjloU21KbmJqTm1UVFE1UkZWT1UwRRAB",
            "text": "Very cool vibe and good value food!\n\nBonus: they sell goodies from Maxime’s!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4d1kySlJZMVpoWm1sWlpERnhiMHQxWlV0dVNIYxAB",
            "text": "Had my birthday there and while I asked for us to be in the middle of the party they gave us a table just outside of the energetic area. They also made a bad mistake on the bill adding more items which was corrected upon review. Some attendees didn’t respect the dress code outlined. It was also very tedious to give credit card details on the phone. Good to try at least once. Food was good. Bottles were fairly priced. Music was good too. Must book in advance (best by at least a week)."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFemVuSnlaR1ZEV1VwaE9XRldSVGxTVEc5MlFrRRAB",
            "text": "Highly recommended"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwSmNGUlBSelZPYWpKRE56TkJZMVpzUjA1ME1GRRAB",
            "text": "Really enjoyed this place. Great balance between a New York and a Paris bistro.\nFun and buzzy but not too loud. Nice and very good service but not stuffy. Had the veal, which was very good, and the desserts were better. I’ll go back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVWRFOWplRlJXYnpSU2IwbFpNM0UzU1dGSllXYxAB",
            "text": "Terrible service and RUDE employees"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toeFdXRjZhSGRpUTFWRVNVVk5ha1pVZDJGcmMwRRAB",
            "text": "Be very careful in this place. We just ordered one bottle of water, they brought the check and it was perfect. However, when we gave our card for the payment, they mysteriously changed the check making it 50 usd more expensive, they didnt even told us about the change. When we saw the change, they added 2 more bottles of water of 1 liter (17 USD each), and we were only 3 people.\nWhen we told the waiter that we didnt drink three one liter bottles and we just had one, he was very agressive almost shouting to us. After a heated discussion, they accepted to take off those two bottles we never drank. Guess what? the check without those two bottles was the first check they brought us! But thats not the worst part, they charged us twice, the first check and the mysterious second check that they placed in secret when they returned our card.\n\nDelicious food, but be VERY careful with the check and with the amount of water bottles they charge."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RlZqTnNUQzFvVlhGTGVHUnRWRFIzVkhGUlpIYxAB",
            "text": "Food was ok but overpriced. We experienced sub par service from the main waitstaff, unfriendly and disinterested. The help waitstaff was more attentive. Wouldn’t recommend or go back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twbVp6WmlSVTVCUzNaZmEwUk5VREJPY21SSWNXYxAB",
            "text": "Great service and amazing food. Highly recommend the Cajun Chicken and the Steak Frites and definitely save room for the chocolate mousse."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FdFduZzRibUZ5TlhCTU5HVllVME40WDA5elYyYxAB",
            "text": "fell off"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KMFlYTnBObTh6Y0RRNFlsWm1VVEZLVldad1ltYxAB",
            "text": "I dined at Bilboquet in New York and was shocked to see a rat moving through the dining area. This is completely unacceptable for any restaurant, especially one at this price point. The experience was unsettling and unhygienic. I will not be returning"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toclVXdDJhRWh6YlY5dFZXVXRURGN3VWpGVGRuYxAB",
            "text": "Outstanding French Bistro food.  Superb wine selection by bottle and by glass.  Friendly and very efficient service.  Go there every time I am visiting NYC !!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OUldpMXNVSEprTkcxdWJuWTRNRTFZYkRCUk9VRRAB",
            "text": "The smug attitude from the front-of-the-house staff is outdated. Dover sole special was terrific though.  As were bus boys and food runners. Low noise levels also a plus."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNkthZHZRRRAB",
            "text": "First time. Liked the atmosphere, the crowd, the bread, liked the mussels -they were fresh, refreshing, filling. Service was earnest and had flourish. We ended the lunch with a crepe Suzette and that was a good little spectacle. All is well except the signature chicken.\n\nI would think a $44 signature chicken differs in some technique or flavour or presentation. This tastes and looks like prepacked chicken breast, seasoned with tasteless flavoring, and expertly sliced. We didn’t get as much sauce as in some other pictures I might have seen but that was not the dealbreaker. It was as juicy as a good supermarket chicken breast (aka dry) and the seasoning isn’t amazing (aka bland). I was quite disappointed with that. You can keep it for your own reasons I don’t know, but don’t call it your signature.\n\nFries not too crispy, many soggy."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRFVFUlJhWEJJVFVwcFdFOVFkbXRMUVVZNVMyYxAB",
            "text": "You get the feeling they want you out quickly. Food was good but the pace was too fast. Slow it down man!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KSVdYUjVTMWhoWW1KM01pMVpXVEo1VDNSMU0yYxAB",
            "text": "Thanks for a great evening"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psTWVEWjBjUzE1TTFOUWFFZ3RaVkZZU1Mxa1JXYxAB",
            "text": "celebrating friend's birthday......we ordered bellinis but they didn't have the peach puree...odd for an upscale restaurant....the A/C wasn't working....it fell as though the stove was on right in front of us....the lump crabmeat was shredded and looked like salmon..it was not good to say the least......main courses were ok, however, they brought them while we were still trying to eat our appetizers...they went back to the kitchen.  .service was poor as they just didn't care about the heat, the poor crab salad or us.....we will not be returning"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMWGJsZkxmazdEYkx3EAE",
            "text": "Had a reservation for a mid-week lunch. Superb atmosphere, and great food! A completely packed restaurant was still a very peaceful and elegant setting. I recommend it to my friends! I’m also pleases me that there is a “dress-to-impress” recommended dress code"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPbjR5WXY4X09YT1VBEAE",
            "text": "Spectacular food and service.  Their chicken pallard Cajun style is fabulous."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKNmE2ZGJwN0t6TFdnEAE",
            "text": "Take out. Only one item packed. Charg d for 2. Lousy quality for price"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOREZsTTZqcF9qbDZBRRAB",
            "text": "Our New  favorite  place!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJZUZ1YmZqc3B1c0Z3EAE",
            "text": "Always classy, always delicious, always the best."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VMWFN5TWY0dzh5aUhnEAE",
            "text": "Food is delicious and it’s a fun vibe. However the service was not great. we ordered appetizers and entrees. They brought all the food at the same time cluttering our table instead of timing it properly. We asked them to take back one of the appetizers since there was no space on the table at this point. After finishing our entrees, we asked for the final appetizer to provided. At the same time we asked for the check since we had another event to attend. It took over 25 minutes to pay the bill. After 40 minutes of waiting for the final dish, it never arrived and we proceeded to leave. Upon telling the waitress, she made no gesture to remove it off the bill we paid or to offer a future credit. She barely even stopped to acknowledge the delay. They seem to be a spot that’s regularly busy for brunch so it should not be such a mess in timing of food delivery, especially at the price point they charge."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPWGJuYlRvdTc3WTNBRRAB",
            "text": "Food is amazing and service is second to none! Could not recommend more highly! A must visit in New York! Gregory is the man!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJMmQzYVR3cTlUWld3EAE",
            "text": "Fun to be seen, good food , great service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaWN2SnF3RRAB",
            "text": "The ambiance was great, passed by here for lunch. It was a little loud so I would recommend the cafe bilboquet for a quieter lunch, we ended up sitting outside so we didn’t mind either way"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZLXVtNU9BEAE",
            "text": "Amongst the favorites for a fun Saturday brunch. Service was amazing thank you - Arcadio!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOTRyUlBREAE",
            "text": "Terrible experience — Avoid this place!\nWe had a reservation for 9 people, and they gave us a tiny table meant for 6 — in the waiting area, no less! Completely unacceptable. When we asked to be moved, the manager was incredibly rude and unprofessional. Instead of trying to accommodate us, he demanded $2,000 just to seat us in the section we originally requested. I’ve never experienced anything like this before. Total disregard for customer service. Save yourself the trouble and take your business elsewhere!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcTRMcFp3EAE",
            "text": "I made a reservation for a party three weeks in advance for a birthday celebration, clearly noting the special occasion. Despite being a loyal guest who has celebrated my own birthday there in the past and spent generously, we were seated at a table right by the exit. It felt like an afterthought, especially given the effort and advance notice.\nNeedless to say, we left and went to Maison Close instead — where we had an amazing time with a great show and the best DJ. Service and ambiance made all the difference."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJLU5YLUZREAE",
            "text": "Fabulous food. Wonderful service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeUkyZjlBRRAB",
            "text": "Great service and chic vibes. Good for groups or date night. Classic French dishes"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dmFTVFhnEAE",
            "text": "Consistently indifferent hosts, decent but unremarkable food—the main draw here is the service and atmosphere. I’ve been multiple times out of convenience and proximity, but today’s experience reinforced the poor management. An hour before my 3 PM reservation, they called to inform me that the kitchen would be closed—something they had just “realized.” Their solution? Move my reservation to 6 PM, as if my schedule revolves around their kitchen. No apologies, no acknowledgment—just another example of how bad management can undermine a brand."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cXUyb2xBRRAB",
            "text": "A NYC experience MUST! No matter how busy and crowded, trying the delicious treats and feeling that energy of the patrons is a wonderfu experience. THE place to stop for a  great croissant and coffee."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRemV1SE5nEAE",
            "text": "Always a great meal and fun brunch!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRX0lTSDV3RRAB",
            "text": "Wonderful French restaurant for a romantic evening."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbmJiUjJRRRAB",
            "text": "Very expensive prices.\nI understand.  You need maintain a standard in upper west side. But still…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBeWZmR3N3RRAB",
            "text": "While the food was enjoyable—especially the Cajun chicken—the overall experience felt rushed. Despite our server being great, the rest of the staff seemed eager to clear our table before we were finished. They asked multiple times to take away our appetizer plate while we were still eating, and a guest in our party experienced the same issue with their main course. Additionally, right before dessert, the staff abruptly changed the paper covering the table, which felt disruptive. We had hoped for a more relaxed dining experience in line with traditional French service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdGRpU3l3RRAB",
            "text": "If I could leave less than a star I would. Although I've been here in the past, there's been a change for the worst. The air of contempt and classism is palpable. Especially, from the Hostess, that despite there being numerous tables open and it was 6:15pm, she wouldn't seat my party. Then to add insult to injury the seeming \"manager\" walked by and spoke with her in French and then proceed to \"recommend\" places close by for us to go, as if we need to be elsewhere. Mind you, I'm from NY and know this area pretty well. Maybe they don't like people of color anymore, who knows.\n\nNeedless to say, we left. Don't plan on being back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfamRpN2lBRRAB",
            "text": "Get the Cajun chicken! So good. This restaurant has the classic upscale dining aesthetic that New York is known for: Clean with a pop of color from art. Nothing outlandish or try hard. 👌🏾"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfbnNHZ1hnEAE",
            "text": "Very high and and not much room between tables"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaE8tcWtRRRAB",
            "text": "Great mousse!!!"
        },
        {
            "date": "9달 전",
            "language": "pl",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaExuMDNnRRAB",
            "text": "Le Bilboquet w Nowym Jorku to miejsce, które z pewnością zasługuje na uwagę zarówno mieszkańców, jak i turystów. Położona na Upper East Side, ta francuska restauracja łączy elegancję z przytulną atmosferą, co sprawia, że jest idealna na romantyczną kolację czy spotkanie z przyjaciółmi.Wnętrze jest urządzone w stylu francuskiego bistro, z przyjemnym oświetleniem i starannie dobranym wystrojem, który tworzy ciepłą i zapraszającą atmosferę. Obsługa jest niezwykle profesjonalna, a kelnerzy chętnie dzielą się swoją wiedzą na temat menu, co sprawia, że każdy gość czuje się wyjątkowo.Menu Le Bilboquet to prawdziwa uczta dla zmysłów. Dania są starannie przygotowane z wysokiej jakości składników, co widać w każdym kęsie. Warto spróbować klasycznych francuskich potraw, takich jak tarte tatin czy coq au vin, które są nie tylko pyszne, ale także pięknie podane. Dania sezonowe również zasługują na uwagę, a ich smak potrafi zaskoczyć nawet najbardziej wymagających smakoszy.Nie można zapomnieć o winie – karta win jest bogata i różnorodna, co pozwala na dobranie idealnego trunku do każdego dania. Sommelierzy są doskonale zorientowani w winach i chętnie doradzą, co wybrać, by podkreślić smak posiłku.\nCeny w Le Bilboquet są wyższe, co może odstraszać niektóre osoby, ale warto pamiętać, że jakość serwowanych dań i ogólne doświadczenie kulinarne są na najwyższym poziomie. Dla tych, którzy chcą uczcić specjalne okazje, Le Bilboquet oferuje również wyjątkowe desery, które z pewnością staną się słodkim zwieńczeniem wieczoru.Podsumowując, Le Bilboquet to miejsce, które łączy w sobie francuską elegancję z nowojorską energią. Jeśli szukasz wyjątkowej kolacji w przyjemnej atmosferze, ta restauracja z pewnością spełni Twoje oczekiwania. Warto zarezerwować stolik z wyprzedzeniem, aby cieszyć się niezapomnianymi chwilami przy wyśmienitym jedzeniu i winie."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfc01lSG1RRRAB",
            "text": "Highly over priced for decent food. At this price point ($110 for sole) waiters should be trained not to clear table until all diners are finished. We had to ask for drink order to be filled three times. It’s an unfortunate aspect of Manhattan dining - high cost with mediocre service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdnFLUVdBEAE",
            "text": "Very cramped and people falling over each other."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNkxxYW9RRRAB",
            "text": "Very good restaurant, highly recommended"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmb1l6U0VnEAE",
            "text": "It was a biblical experience. The god said don’t touch the apple . So I came here completely not hungry. Wanted to eat very little in anticipation of a big dinner in a different restaurant. Then my wife ordered. I touched the apple!!!! I couldn’t stop. Everything was unbelievable. The chicken, the fish , the salad, everything, and dessert was amazing. Worth every penny. Will come back every time when we are in NY . Amazing food and service!!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2eTZ1MVlREAE",
            "text": "I recently dined on a Thursday evening with my partner and my experience was far from satisfactory. I had to wait 15 minutes just to place my order and had to ask for the cocktail list myself. The service felt intentionally slow unless you were a regular. Overall, the lack of prompt service and attentiveness was very disappointing. I hope they can improve for future guests, but based on my experience, I wouldn’t recommend"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2M19tWWlBRRAB",
            "text": "This restaurant has an excellent reputation so it was interesting to see what that was all about. The drink menu wasn't that enticing as far as the ingredients in each drink however the names of the drinks are very cool. Decided to try \"The Private Jet Group\". It didn't taste that great so I added fresh lemon and lime to it which helped. The menu has many options so it was difficult to decide what to order. I chose the beef wellington 2 ways. It was delicious. We ordered the escargot as an appetizer which was ok... The red sauce was average. I prefer escargot more traditionally prepared in garlic. My companion ordered the Wagyhu beef burger. The burger is prepared and served with liver which wasn't ideal and therefore the burger wasn't the greatest. The people next to us ordered the tuna tartare appetizer which was a very small serving and seemed to have an awkwardly oversized chip on top. Can't say much more since we didn't taste it but the presentation wasn't tempting. The apple dessert was very good but the creme fresh was too sour cream based for my liking. The souffle was very good as well as the mango sorbet. The service was very good. Very attentive and friendly servers. The temperature in the restaurant was way to warm the entire time dining as well. We were also in a nice quiet corner and although there was plenty of room across on the other side of the room they seated a party of 4 right next to us which was less than desirable. The woman closest to me continuously blew her nose throughout the entire meal so that was a downer. They should've most definitely sat them in a better place instead of cramming them next to us. The decor was decent. The wallpaper wasn't very nice and the lighting fixtures design styles weren't cohesive. Probably won't go back but not sorry we tried..."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQbHZyZjFRRRAB",
            "text": "Le Bilboquet in NYC is an absolute gem! From the moment you walk in, you’re greeted with an air of understated elegance and a vibrant atmosphere that sets the stage for an exceptional dining experience. The attention to detail in every aspect -from the chic décor to the impeccable service -is truly remarkable.\n\nThe menu is a masterclass in French cuisine with a modern twist. Their signature Cajun Chicken is a must-try: tender, perfectly spiced, and accompanied by the most flavorful fries. The caviar selection is exquisite, offering a luxurious touch to the dining experience -perfect for a special occasion or simply indulging. And let’s not forget the Wagyu burger -cooked to perfection, juicy, and topped with just the right balance of flavors, it’s easily one of the best burgers in the city.\n\nWhat sets Le Bilboquet apart is not just the food but the ambiance. It’s lively without being overwhelming, making it perfect for a celebratory night out or an intimate dinner. The staff is attentive, knowledgeable, and genuinely invested in ensuring every guest has a memorable experience.\n\nWhether you’re a local or just visiting, Le Bilboquet is a culinary destination that deserves a spot on your list. It’s not just a meal -it’s an experience that leaves you counting the days until your next visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIM2ZiS1JnEAE",
            "text": "The Bilboquet delivered an extraordinary brunch experience with its vibrant ambiance with exceptional cuisine. Every dish we sampled was a testament to culinary finesse, from the perfectly crafted classics to the inventive, flavorful specials, and the desert was spectacular. The combination of great food, impeccable service, and lively beats made for an unforgettable brunch that leaves you eager to return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUaF95LVV3EAE",
            "text": "Honestly, the highlight of this place was the exceptional service, everyone was friendly, polite and very attentive. In terms of food, the beef tartare lives up to the hype, followed by the roquefort salad, these were quite full bodied and savory. The risotto and the skirt steak on the other hand leaned more towards the insipid side"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtb2JiUEdREAE",
            "text": "Le Bilboquet delivers on its promise of an upscale French meal with very tasty food and attentive service.\n\nThe chef wowed us with the duck. We loved the rich flavors and perfect texture. One of our party ordered the steak and proclaimed it as the best steak he’d had all year. Of course, he didn’t give me a bite, so I can’t confirm.\n\nWe enjoyed the steak tartare, but it feel in line with what we’ve had at other restaurants.\n\nMany other reviews complain of the service. We had nothing but good things to say about both the host and the waiters. They acted friendly, efficient, and spoke with perfect Parisian accents."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURFbkpTcllBEAE",
            "text": "Actually this place is super cute and everything we ordered was delicious. The only downside was the service that took forever even though we were almost the only ones there. If you are not in a hurry I definitely recommend this charming place. The design is beautiful and there are so many great options on the menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWcmVTWlRREAE",
            "text": "Fabulous restaurant with superb food, extremely polite attentive service and great ambiance. Very old school but cool chic. I always love coming here for my Birthday in December the best time of the year and it’s always packed. My favorite is their famous Cajun chicken, so moist and a huge portion and side salad. Delicious wines and deserts too. Lovely time."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBdHR5UzRBRRAB",
            "text": "Great place to enjoy dinner with friends under the disco style music. Entrees are extraordinary, good size and high quality. Appetizers a bit small and wine is extremely expensive. The place is always super crowded. Chicken is a must and steak tartar is  also one of their specialities."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3M29XdU5REAE",
            "text": "Sitting outside is great. Inside is crowded and cramped. We found out the waitress speaking in French to us was a bit funny and maybe a bit demeaning too. Service was overall not kind except for the host, who is fantastic.\n\nAlso, the Socca is definitely not French style. It’s much thicker and made us feel a bit unwell afterwards. The salad is great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSa1BxZDVBRRAB",
            "text": "It was a terrible experience. No one asked me how rare my steak was, but I can imagine that my steak was so hard that I couldn't cut it with a knife. In the second photo, I was given a medium-rare steak after replacement. Here, I am very grateful to the girl who saw me cutting my steak hard, and she helped me change it into an edible steak."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1MHFXYmNREAE",
            "text": "Truly lovely! We sat outside in a private pod, and the whimsical lighting made for a wonderful dining experience. The cocktails were delightful and the mussels were delicious. Highly recommend!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKdjg2VVpBEAE",
            "text": "I am (was) a regular customer at Le Bilboquet and have frequented the restaurant for both work, since my office is two blocks away at the GM building and with friends, since I live three blocks away. I had a very disappointing experience today with the Maitre d, which compelled me to write this review. I arrived alone at the restaurant and asked for a table outside for a party of two, my friend arrived shortly thereafter. We were greeted nicely by the waiter, placed a drink order, got a couple of beers, then placed our dinner order. While we were enjoying our beers we were abruptly approached by the Maitre d, who proceeded to tell us that we had to leave immediately since I “hadn’t told him my friend was wearing shorts”. He then proceeded to bring the check. Fully understand that the restaurant has a dress code, and while I don’t think my friends shorts were offensive (he was on his way to a tennis class), believe the situation could have been handled more respectfully and tactfully. The Maitre d was condescending and made the situation a lot more awkward for us (and the couple in the table next to us) than what it had to be. Naturally, I objected to paying the check, seeing as he was hushing us out and we had barely taken a sip of our drinks. He was then quick to blame me again for “not telling him my friend had shorts” as if I was supposed to know the dress code of every restaurant in the city, which I found pretentious, especially since we were sitting outside on the street (?). There were several waitresses and bus-boys who served us and could have informed us of the dress code as soon as my friend sat down, so unsure why he had to make such a scene out of this. To sum it up, we felt very unwelcome, will certainly not be returning and will make sure my assistant removes it from our preferred list of restaurants near the office. Pictured are the Belgian beers we were not allowed to finish."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5azdPMHBnRRAB",
            "text": "It was our first time at Le Bilboquet for a birthday celebration, and we were beyond delighted with our dining experience! As a downtown New Yorker, some UES establishments can feel a bit stuffy, but this was not at all the case at Le Bilboquet. Our server, Ion, and his supporting team were warm, attentive and made our evening extra special and memorable. In addition to the great service, the food was spectacular! Must orders: endive & roquefort salad, sunchoke salad, scallops, cauliflower three ways and their cheese plate is exquisite. Merci beaucoup et à bientôt!"
        },
        {
            "date": "6년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVaDVQZGF3EAE",
            "text": "Um lugar encantador, exuberante por seu maravilhoso café, servido regiamente acompanhado de guloseimas indescritíveis... Sinceramente, a pausa para o café tornou-se imperativo e conceitual, pois nos remete a momentos prazerosos por seu aroma e, notadamente, pela companhia neste lugar exuberante. Vale muito a pena conferir..."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlXzYtZlJ3EAE",
            "text": "Food 3/10\nThe duck came out cold and they didn’t even bother giving us the right knife to cut it. I had to ask for a sharper knife. The charcuterie board was just plain sad. Overpriced. I’m very disappointed.\n\nService 1/10\nI came after going to the gym, and the place did not say they had a dress code, but the host was clearly judging me he looked at my fit up and down. It was extremely disrespectful and rude.\n\nAtmosphere 4/10\nIt was a nice space, but I felt suffocated in there."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxLVBTU0V3EAE",
            "text": "Had my birthday dinner here and it was great. From the service to the food, my friends and I had a great time. They even made some virgin cocktails for my friends that don’t drink. I’ve been the other Bilboquet locations and this one didn’t disappoint. Merci!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1cnRIN3JRRRAB",
            "text": "Went there with a friend for lunch. Sat outside. Food was INCREDIBLE. I had Cajun Chicken, and my friend had Tartar something.  Pics speak for themselves."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3X3ZxbHpnRRAB",
            "text": "Excellent food, though very loud. Took a while before they turned on the A/C, so it got a little hot, but it's a place that I would definitely go to again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLNnNfQ19nRRAB",
            "text": "Very delicious and beautiful upscale place. Nice atmosphere and friendly staff. Outdoor and indoor seating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNieHMteDFRRRAB",
            "text": "By far - my FAVORITE little spot for coffee and French treats in NYC. Kindest staff and superb food. If you’re lucky, Erick is there!!! Sweetheart!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5eko3ZFBREAE",
            "text": "We came for brunch. Food and service was great! The DJ had a great list of music."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtaU1xaDRRRRAB",
            "text": "My experience at the restaurant last night was terrible! My friend and I walked in and the hosts were nowhere to be found, so we went inside and was asked to go back outside to speak to the host. The host wasn’t really friendly and had quite an attitude. Hence, it was busy inside we were sat down in between a table of a family and a couple. The tables was so close together that I felt uncomfortable. I remember the last time I was there the service was so much better and they did follow covid protocol and didnt have the tables too close to each other maybe because it was a company lunch? Anyway, I’ve seen the staff so busy and so in a rush that I didn’t feel like I got the elevated customer experience especially at a restaurant like this. When it was time to get the check and to pack the food, one of the waiters (didnt get his name but bald with an accent) was extremely rude said we couldnt pack the mussels to go along with the bread that was on the side. I’ve never heard of that so I was flustered and asked to speak to the manager. The manager Baptiste came over and apologized. He was the only person that was friendly and helpful. He told me not to get upset and gave us a complimentary dessert. He then asked the rude waiter to pack our food but he made a mess. The container he put the mussels in wasn’t correctly sealed and spilled everywhere which made the containers wet. I am beyond disappointed especially it was my friend’s first time there to celebrate my engagement. I definitely would not return or recommend any of my friends and my family to go. Overall the food was mediocre, it definitely did not taste as good as the first time I was there. They added to much sauce to the Le poulet chicken. I would prefer going else where that would provide better customer service."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1aWYtWjd3RRAB",
            "text": "It was great; the almond croissants were perfect and pricey, But the coffee was not excellent. The staff was amiable, and the place was cozy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKLW9fRl9BRRAB",
            "text": "Ordered a lobster roll and an avocado salad with salmon. Saggy bread, over cooked lobster. How can a person mess up lobster roll?? For salad the salmon was really slimy and there was no good flavor which means its old salmon. Nice interior but overpriced, not french, and bad ingredient quality"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPeGFMR0NBEAE",
            "text": "Wonderful food and exceptional service. Highly recommend the mussels, it's a huge plate! For dessert, you can't go wrong with peach melba."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtdnZhSzJRRRAB",
            "text": "One of my favorite restaurant for the past twenty years almost lol . U gotta have the fois gras and for sure the Cajun chicken"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzN0t5Wml3RRAB",
            "text": "This joint is so much fun.  Food is always well prepared. They have kept their classics in perfect presentation for years. Staff is friendly and always interested in throwing a party. Lunch is oobviously serious but in the evening for dinner and Party Brunch, she let's her hair down and morphs into a dance party. Must have the Dover Sole, Cajun Chicken or Steak for 2. Also chocolate mousse."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtb1kyc1B3EAE",
            "text": "Very beautiful upscale french restaurant! Food was so delicious! We had a great time!"
        }
    ],
    "reviews_count": 77
}