{
    "name": "Tang By Mr Sun 唐",
    "place_id": "ChIJBbw5N5lZwokRNPlNOvCQFaw",
    "grid": "MN8",
    "address": "1442 3rd Ave, New York, NY 10028, USA",
    "rating": 4.6,
    "user_ratings_total": 183,
    "phone_number": "(646) 590-2910",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWGVHRmtUbFZIVVcxelFWaHhhbmR4TTNZelpXYxAB",
            "text": "I had such a wonderful experience here! The food was amazing but what really made it special was our server Nicole, shes got such a warm smile and positive energy that makes you feel welcome plus she genuinely cared that we had a great time. Easily one of the best dinning experiences I've ever had In a long time!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMWRqWndVR0pJZEMwMU1VUkNjblpGVGpGMVVWRRAB",
            "text": "I had such a magical experience celebrating my birthday at Tang. Everything exceeded my expectations. The atmosphere, the scenery, and even the menus were thoughtfully curated. I especially loved the presentation of the lychee shrimp appetizer.\n\nWhat truly made this a 10/10 experience was Oscar, the host! He was personable, attentive, and always willing to hear feedback to make the experience even more enjoyable.\n\nI can honestly say I actually had fun! I don’t think I’ve ever described dining out as “fun” before. I truly wasn’t ready to leave! I can’t wait to go back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOdngwWU91enJTNjd3RRAB",
            "text": "Excellent food, especially the savory dishes. Each of the five flavor soup dumplings had a unique and intense flavor, and they were quite plump. The passion fruit prawns were perfectly cooked and delicious. The veggies in curry all kept their intense flavor, the curry was addictive, and the scallion pancake was crispy and very enjoyable. The cheesecake for dessert was good, but unremarkable, in fact the sauce was a bit too sweet and took away from the cheese. The staff was very attentive, and the decoration is simple but very pleasant."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kcFZHVkVSbVp0YTBJMGVVSmFMVEJ6WVRCb05tYxAB",
            "text": "The elevated cuisine and presentation make Tang by Mr. Sun one of the nicer Chinese restaurants in the neighborhood. Their happy hour menu (3 generous courses for $30 plus tax) is no ordinary lunch special. The Tang salad had a lip-puckering brightness. The rock shrimp tempura and the crispy hot and sour beef were both scrumptious. The duck spring rolls are a must-try. The only blemish on this rating is the inadequate air conditioning in an otherwise sophisticated space."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcDRuTHR3RRAB",
            "text": "Outstanding experience dining here! The restaurant itself is gorgeous with beautiful details like the menu and settings.\n\nThe drinks are amazing - beautiful presentation and tasted delicious!\n\nThe presentation of the lychee shrimp balls is so fun! The lobster shumai was also a yummy appetizer.\n\nReally enjoyed the medallions and broccoli and the fried rice!\n\nTopped it off with the chocolate lava cake! The service is very attentive and kind. Highly recommend trying it!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNReFBTaWx3RRAB",
            "text": "I went with my teen daughter for lunch and EVERYthing was amazing! Great food, atmosphere & service. I highly recommend the sweet & sour chicken, veggie fried rice & the guava mango flute was better than delicious! Special thanks to Chris and Ahmad for great service."
        },
        {
            "date": "4달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJek1FaFFUVFJXWTBkU1FWWTRTRlpQWWxCVWRrRRAB",
            "text": "逛完大都会路过，结果意外惊喜，环境和味道都没得说，前菜和烤鸭都非常好吃，推荐！"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOWJpazlBRRAB",
            "text": "Tang by Mr Sun was a great experience of Asian cuisine. The flavor mixture and texture were among the best I’ve tried. Michael, our server, was very kind, willing to help and gave great, sincere recommendations."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5MFJHWnhUakE1UVUxSE1XZHVNWGQxWWxKVFZIYxAB",
            "text": "Very sweet and attentive staff.\n\nThe honey spare ribs were incredible as were the lychee shrimp appetizer.\n\nWe also had the salt and pepper tofu and bacon fried rice and yes…we gained a few lbs lol"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoNVRWTkxkblJOY1d4dlZVUm5Sa3R5VWtOTGIyYxAB",
            "text": "The food was delicious! We really enjoyed the service and atmosphere. The presentation of the lychee shrimp ball was stunning! It is super pretty inside! Really loved the duck and short rib bao. Will be back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xONVdIWnROaTFTT0dkZmNXdEhaVGxDWlRkRE1YYxAB",
            "text": "Tang by Mr. Sun is a great spot! We were seated quickly, the staff was pleasant & attentive. The ambiance was really nice and welcoming. The food was delicious, fresh, and well made definitely worth the visit!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxeklQbkZBEAE",
            "text": "Wow!!! Where do I start? The hostess, the entire waiting staff.. each and every one of them- awesome! Ahead of you every step of the way. Incredibly professional. The food and presentation..nothing short of outstanding.  Best margarita I've had, by the way. The shrimp balls are a must try! The hot and sour soup, fried rice, Peking duck OMG you will be blown away by all of it! Don't skip the cheese cake! The decor- simple and elegant. Every detail thought out. Bravo to all! Definitely on my favorite list!!\n\nRevisited 9/25! This time around I tried the ribs, and they were absolutely outrageous—so delicious! I also had the tiger prawn satay again, and the sauce it comes with is just extraordinary. The barbecue lo mein was fantastic, and the hot & sour soup remains the best I’ve ever had, hands down. The lychee shrimp balls are always a hit. On top of the incredible food, the staff is consistently excellent, which makes every visit a pleasure. Tang by Mr. Sun never disappoints!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCNk16aDFRWFpxY0dFM09YcGFSRFpEYmtSWFNGRRAB",
            "text": "Delicious curry and spring roll duck. Service is exceptional and everyone are so friendly"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Obk9HUjZOMWxMTXkxWFl6TnpaM2xLWDJaRVZIYxAB",
            "text": "Just had a delicious dinner at Tang. A very comfy round booth was perfect for our group. We chose a nice white wine then ordered family style. The food is top notch and the service is great. Can't wait to go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaZzZ1UkpnEAE",
            "text": "Really delicious food. The fried shrimp had these crispy noodles that are delicious, when served with an edible orchid it look beautiful. The soup dumplings are very good too. The Peking Duck was a tad pricey but really delicious, the buns were a different style and were quite interesting. Love the Peking Duck display and the venue was beautiful."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbDhiRUVREAE",
            "text": "We came to meet our friends for dinner at this amazing restaurant!  Oscar, the manager met us and sat us at a wonderful table. We proceeded to have such creative and delicious drinks. I highly recommend the China doll martini. Fabulous!  The presentation of the shrimp balls was amazing!! I shared the legendary Peking duck and it did not disappoint!! The final creation was the Limoncello Tartufo! Spectacular!  If you are looking for great food a wonderful atmosphere and fabulous experience then you need to come to Tang by  Mr. Sun!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURadnZDa3JRRRAB",
            "text": "Had a good time with my friends at the place. The food is good, but the portion is not as much as we thought, the Peking duck we ordered is half duck, the taste is fine, but it’s definitely not enough for 4 people, as well as the other dishes we ordered.\nBut the service is good, and the vibe also.\nAlso the surprise part is their tip% option! Almost every restaurant in NYC are asking for at least 18% tip but their starts with 15%, which is reasonable!\nWill come back in the future :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KNk5uZEVlRkV6Y1Y4eVVtTlVSemRMVm5SNUxYYxAB",
            "text": "Absolutely delicious.\nWe had peking duck.\nString beans w/ blk bean sauce.\nShrimp with spicy mayo\nFried rice w pork and chicken.\n\nA real surprise on the Upper East Side.\n\nGreat service!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGcnBIOGFnEAE",
            "text": "Food presentation was absolutely beautiful!\nService was prompt and polite.\n\nMy favorite was definitely the mushroom pancakes! Then the lychee shrimp balls (outside is shaped to look like lychee), the Peking duck for two, the mango dessert and pineapple dessert.\n\nI would not suggest soup dumplings. Skin is too thick and broth could be way better.\n\nThe lobster dish with crunchy noodles was not the best because the lobster had a tender and chewy (not tough) texture but I understand it was to complement the crunchy dry noodles."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMkozSmp3RRAB",
            "text": "This upper eastside restaurant is a Gem, from the decor, to the food presentation just pure excellence. The Cocktails are stunning the food has so much flavor. The staff was very friendly and made great recommendations. Love this place."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQX3JxandBRRAB",
            "text": "So far this has been my favorite Chinese restaurant on the UES. The ambience has a high-end feel and I found the prices to be very reasonable. I love the short rib Bao, black paper beef and Peking duck of course. They innovatively put crispy apply in the short rib bao made a very nice blend of sweet and fresh taste with pork. Even the vegetable dishes are very tasty. Very happy with our dining experience. We didn't take many dish pictures. But everything was delicious."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWOUp5MW9nRRAB",
            "text": "Came here recently for a Saturday dinner with my gfs.  Overall the food was good!  They really do make an effort with their food presentation too.\n\nMy recommended dishes: Lobster Crunch Noodle ($54), Peking Duck ($50/half duck), Salt and Pepper Tiger Prawn ($32) and Creamy King Crab Udon ($40).  The Lychee Shrimp Ball was the most creative presentation of all—served on a gold tree-like tray with dry ice vapor from the bottom—however this dish was just okay to me, not sure I liked the flavoring.  The Five Flavored Soup Dumplings was good, however, it’s not the best dish to share with others because each dumpling is a different flavor, so if you share, you (like myself) only got one flavor to try—the crabmeat one was good.  For cocktails, the Tangtini (lychee flavored) was delicious—$18 a drink.\n\nPrices are a bit expensive, compared to the portion.  But service was great!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUmMydG9TazlRYVVSd1VEQlJVVnBEUzBaV1JGRRAB",
            "text": "I have flown to New York twice this year and have visited here four times admittedly. The greatest food. The greatest drinks. There’s a young guy who worked as a waiter there, always kind and fast and asks to take our photo when it’s a date. An amazing establishment. Considering flying from london just to eat there over a weekend."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdjZ2Q2VnEAE",
            "text": "I had a wonderful  time for my birthday ! All my guest including myself were impressed by the presentation and food . Everyone enjoyed their meals and the drinks were packed with a punch . Our waitress and the manager were very hospitable . Looking forward to coming back again !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsc2NYZHBRRRAB",
            "text": "I really enjoyed this place! I came for lunch and it was pretty empty. But the staff was really nice and helpful to me. I ordered the potstickers they were so good, and the lychee shrimp is a must have! It’s pretty cheap for a great appetizer and amazing show! The one thing i would have wanted was a separate mock-tail selection. But the bartender was nice enough to put together a drink for me"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMGZyVXBnRRAB",
            "text": "New Asian fusion spot in UES. There aren’t many Chinese options in this area, so we were excited. They just started soft opening last week.\n\nInside, the restaurant is beautifully decorated, and the plating and cutlery are all very tasteful. We ordered the black pepper beef, shrimp curry, lobster with fried noodles, fried wontons, and wonton soup. Everything was delicious, but my favorites were the wonton soup and the curry shrimp.\n\nThe service was also excellent and staff were very friendly. The manager came by several times to ask how we were doing. I’d definitely want to come back to try the rest of their menu."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnN05HNTNRRRAB",
            "text": "If you’re looking for a spot that has great food to back up the pretty IG moments, this is it! My experience here was amazing from the food to the service and the presentation. I will definitely keep this restaurant in mind for date nights or a small get together with friends. Oscar and Aman were so attentive and made our experience so wonderful!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ablV6RjJWRU5aWm1GNVdYUlZjbEoyYWtsVlkxRRAB",
            "text": "Food is delicious! The lychee shrimp balls and the 5 flavor dumplings are amazing. The staff are attentive and friendly. Food came out in a timely manner."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQZ19tb3lnRRAB",
            "text": "The ambiance is really nice, you’d think it was an extremely expensive restaurant when it’s actually VERY affordable. The portion size was GREAT and the food was actually really tasty. The presentation of dessert (crème brûlée) was really nice and it also taste great!!! I definitely recommend 1,000% and plan to go back!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oWlFVeE5TbEJNYzFGbmFXaHJVRlo2Ym14Uk5HYxAB",
            "text": "Stopped by after a walk in Central Park, and this place hit the spot! We had the duck spring rolls, the short rib bao, Kung pao chicken and black pepper beef. All the food was delicious and well presented, the ambiance was so pleasant, and the service was exemplary."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwX3Z2U0VREAE",
            "text": "We came to Tang by Mr. Sun for dinner tonight and we had an incredible experience. The atmosphere was extremely elegant and aesthetically pleasing. The food was fantastic and the presentation of the food was so unique and beautiful! The service was efficient and the staff was so sweet and helpful. We enjoyed speaking with the manager, Melissa who gave us great suggestions for what to order. We will be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1NTVXTldnEAE",
            "text": "Great ambience. Will be back for the crab udon and soup dumplings - all halal and pescatarian friendly. The lychee shrimp was a tik tok fav and equally delish. Be warned though - the portions were tiny.\n\nOverall, even the desserts were not too sweet"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdU5uaHFkbEE1Wld0c1YyODRVR2Q0WDNkM1ZIYxAB",
            "text": "Wow, the best hot and sour soup I ever had !!! Every dish we ordered was perfect.  My gf loved the desert… naturally."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kcGJ6Rk1RVjlyZFcxVWVVdEdPVlJYZFRsQmJtYxAB",
            "text": "Was celebrating my girlfriend's birthday this past Friday and I can say that it was nothing less than amazing 🤩 the service and ESPECIALLY THEE FOOD 😋 when I tell you, those chefs are truly blessed and CARE about their craft. Everything was GREAT and I will definitely be returning!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVemNsbDFjMmhDTWxwU1ZVWldRa1phWVhKTmFuYxAB",
            "text": "Amazing food. Beautiful presentation and fantastic flavors! Loved every morsel!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWQ2VHeE5TV05mWkdSb1JYcGxaRjlmT0RWRlZXYxAB",
            "text": "First time here. My wife and I were in the area and we are so pleased that stopped in. The food was all amazing and carefully prepared and plated. Our server was great. The restaurant is also very clean and well decorated. Everything we ate was delicious: passion fruit tiger prawns, filet mignon, vegetable fried rice and a side of green beans."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GS05XRkhhbmRUUjNOcWVVdDVZa2d6ZUVKTWJIYxAB",
            "text": "Tonight we ordered the crab udon and the passion fruit prawns which were phenomenal! The staff were impeccable and treated us like royalty. Cannot wait to come back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3anU2UzdnRRAB",
            "text": "Food was amazing. The passionfruit shrimp 🍤 were super tasty. The manager Alejandro was nice and a great host. He was gentle and happy to give me recommendations."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBXzhfdVNREAE",
            "text": "The food is really good, i recommend the yuzu ribs, sweet and sour chicken  and the chicken fried rice. Service was a 10/10 waiters were very attentive and the atmosphere was very eloquent. Definitely coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsc2J1RzRBRRAB",
            "text": "Highly recommended!  The beef ribs is so tender and tasty. The creamy king crab udon is my favorite! It has very rich flavor, give a try! You won’t regret it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwa3FxcGlnRRAB",
            "text": "The food was amazing! My husband can’t stop talking about the Peking duck! The presentation is phenomenal and the service was exceptional. We can’t wait to return and try other items on their menu."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScFRqTjVWSE5hTlhGd1VYQm5OR2ROTmpkSmJtYxAB",
            "text": "Hidden gem! The staff clearly puts so much effort into every detail of the customer experience - from the ambiance, to the food, to the service. We’ve dined here twice in two weeks because we were so impressed the first time!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfelphUDB3RRAB",
            "text": "This was a fantastic dining experience, from the food, to the ambience, and the attention from the staff, particularly Ignacio! I would highly recommend this restaurant for a lovely night out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNseXNDb0NnEAE",
            "text": "The food was amazing. The king crab udon was rich and peppery, the passion fruit walnut prawns was sweet and large. Bokchoy was buttery and flavorful and pork fried rice was amazing. The hot and sour soup was one of the best soups Ive had."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5eVVFbE5WRkZPUTBnMlJrWjRkVXN0Ulc4eVQxRRAB",
            "text": "Very nice aesthetic and super tasty. Staff was nice and they were very accommodating to allergies. The men's bathroom was also a push door to exit which is nice"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsbzhyc213RRAB",
            "text": "The chef shows great technique and attention to detail with each dish presentation. It is hard to find Asian restaurants with authentic flavors. This one truly hit the spot. The ambiance was adequate and pleasant, and the service was attentive and warm. Definitely a gem of the UES."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTGVWUmlOVll6VmxwdFRtcEtVbTFyVkhOM1dIYxAB",
            "text": "Food, service and presentation are top notch.Tang is you first class on every way.⁸.  My companionand II shared every dish in order to broaden our cçctaste"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdzg3TmpnRRAB",
            "text": "Absolutely loved loved loved this place! From the service to the food and presentation was excellent! Cannot wait to go back and try other things on the menu I didn’t get to order!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGdGZYbDN3RRAB",
            "text": "Unfortunately I didn’t get anyone’s name to give a direct review, but everyone there was so nice from start to finish. The food was great! I got lobster lo mein and my boyfriend got the beef fried rice. The rice was so good. Drinks were also great. The atmosphere is relaxing! Will definitely stop by again."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oNlpTMUtUVGhoVm5CNlZGUkxSVXhJU0dOMk5FRRAB",
            "text": "Christian waited on us. He was very nice and personable! His recommendations on the menu were spot on, amazing night!"
        }
    ],
    "reviews_count": 50
}