{
    "name": "AOC East",
    "place_id": "ChIJx0CjgrlYwokRhIETr-qxrZQ",
    "grid": "MN8",
    "address": "1590 1st Ave, New York, NY 10028, USA",
    "rating": 4.3,
    "user_ratings_total": 378,
    "phone_number": "(646) 998-4220",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tobFRsRlZObFJzYmtGNk9YUnNTV1ZIWmxCNmRsRRAB",
            "text": "Wonderful meal and even better ambiance. From the first appetizers of escargot and French onion to classics of couscous royal and muoules frite I was transported back to Paris."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0UGQyWnFSMmxaUkZoRlZqbG1ZVlZ3U0hsMWRuYxAB",
            "text": "AOC East is the neighborhood gem. Been coming here for years and every time I feel right at home. Everything is delicious!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURONy03SUpBEAE",
            "text": "Great series and  amazing food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNlZHRldkMjlxTFY5eWVUQkJhbGxYVkZKaE1XYxAB",
            "text": "My favorite French bistro the upper East side.  I highly recommend the Sirloin steak, the burger.\nA very solid list of wine.\nYou enjoy an outdoor seat while sipping in  a refreshing cocktail and enjoying some small plates."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pscVZYQTFlR2swTlRObWIzbFRkMjlpZVVSV2RuYxAB",
            "text": "AOC has the best burger in all of NYC (get it with the Roquefort and pair it with the Beaujolais). Our favorite neighborhood spot—we come here at least a few times a month. Classic French spot with friendly French owners (Jerome usually waits on us), amazing food, and great wine and atmosphere."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJcXk0OVBuN3E2Vl93RRAB",
            "text": "Ate here on 2 occasions. Service is very good, attentive without rushing or left waiting. Food is very well prepared. Hanger steak and duck are very good."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJcS0yZXpZMFpQU0VnEAE",
            "text": "Comfortable neighborhood bistro with excellent wines and food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPNzQtdlRhbXFEX3NnRRAB",
            "text": "I really like AOC and was very upset when the West Village location closed. But I’m happy to say that the Upper East Side one is just as fabulous as a French restaurant can be. The mussels were great, the wine was delicious, and the service—above and beyond!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQdlRub3VUcUwtR013EAE",
            "text": "Best Risotto I’ve ever had in America! I am dreaming about returning."
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZM04tNTNnRRAB",
            "text": "Bonne ambiance et bonne cuisine, je recommande"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvZ2FHR2JREAE",
            "text": "I tried reaching out to the restaurant via email but I got no response so I figured I should spare another person a poor, expensive meal that will not be remedied.\n\nMy husband and I dined on March 7th -- We sat down, and it took 10 minutes for anyone to come take our drink order, we got our wine (which was great), and placed our orders. The escargot and frisée salad were good but my entree was inedible. The steak was so overcooked and dry and not once did anyone come over to see how we were doing or ask if we wanted another bottle of wine, dessert, nothing.\n\nThe busboy cleared our plates, and I told him how terrible it was and all he asked was “could I wrap it for you?” I said no, it was bad, and that was it. No one apologized, no one offered me another meal, no one came over until we flagged the server down for our bill. We paid and left but honestly, I am so bothered by the lack of attention and how nothing was addressed. We have been dining here for years and now I feel undervalued and have no reason to ever return."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJZ01tQlFBEAE",
            "text": "This place is my favorite restaurant in the neighborhood! They have consistently incredible food with an amazing wine selection, plus the staff are always friendly and help me pair the perfect wine for my meal. This restaurant is perfect for date nights but I also go here with my friends, especially on nights with live music. Definitely recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOHNmY2hBRRAB",
            "text": "Placed delivery order which never arrived"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbWZYdG1RRRAB",
            "text": "This place is so cute! We have eaten here twice now, once with just my husband and I, once with a crew. Both times the food was great, the service is attentive and polite, and the place is just warm and cozy. What a fun find. I have allergies, and they have managed them well both times. Not easy to do. Lovely wine list also."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneXBMWThnRRAB",
            "text": "The atmosphere is charming with live music that adds to the experience. The service is friendly and attentive. The food is flavorful, and the warm, fresh bread with the rich sauces are particularly memorable, making the meal even more enjoyable."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndk9LSEVnEAE",
            "text": "The food was phenomenal and the ambience was great for Valentines Day"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURma3BQVUpREAE",
            "text": "Not impressed. The $40 duck tasted like it was reheated and or over done."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmck5QbDVBRRAB",
            "text": "Loris is the best!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmOXRlUEl3EAE",
            "text": "I’m wondering if these reviews are legitimate. We had the ratatouille as an appetizer, wasn’t too bad except the bread was hard as a rock. For our main course we had a lamb burger and lamb chops, which was the special. Lamb burger and the fries were ok, but the lamb was very tough. We ordered the apple pastry for dessert, definitely not impressive. The coffee was pretty good. They weren’t very busy but the service was terrible. I hope they get things straightened out because I do like to see small businesses thrive."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeXVqamxRRRAB",
            "text": "I ordered my steak medium rare it came medium well and they pack fries together with a steak for a delivery, so obviously fries get super soggy by the delivery time."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2cjVxdzl3RRAB",
            "text": "The vibe is French Bistro. The place is bijoux. Tight. I enjoyed the foie grass but my friends didn't like the crabcake. Wine selection is good. Dessert is good. I like the place and plan to go back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2aGFYZkVBEAE",
            "text": "A fantastic French restaurant on Manhattan's East Side with the added bonus of great Reggae music on Wednesdays! I had the salmon with ratatouille and couscous, and it was absolutely delicious. The atmosphere is wonderful—a perfect spot with great food and a great vibe!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQcmVmaTZ3RRAB",
            "text": "The food at AOC is spectacular. Easily my favorite Bistro. They serve what is one of my favorite burgers in NYC. Flame cooked to perfection. I have had too many overpriced lame burgers to ever take this one for granted.\n\nIf you are looking for more than a comforting burger the duck confit and duck breast are worth leveling up for."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucmJ1ZlhnEAE",
            "text": "My gf had a hamburger there, it was badly undercooked, she ended up getting food poisoning. Service wasn't good either, they weren't polite, do not recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuOE1hTnB3RRAB",
            "text": "We discovered this place few months ago and it became one of our go to places. Amazing food with true French atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINl9tMDJRRRAB",
            "text": "I love this bar.  It’s my favorite place in the neighborhood.  The bartenders Loris, Jerome, and Ayoub are so friendly and welcoming and always recommend the best wines. The food is excellent, especially the escargot and my favorite, the duck magret.  Wednesday reggae night is the most fun place to be on the Ues.  Jazz on Sundays is also awesome, especially Alfredo’s band.  The crowd is always friendly! Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdGIycS1BRRAB",
            "text": "I love this place. I am hesitant to write this review only because I don’t want to share my secret favorite spot but they absolutely deserve the praise and the business. Everyone is so incredibly nice here. They’ve always been accommodating (when I wanted to sit down just for dessert, when my mom visited and she is… very particular) and they are gracious and kind every time.\n\nThe food is as good as the service. Everything is delicious. I’ve come here only and specifically for the crème brulee. Dinner was delicious.\n\n10/10 would recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6cklfbEVnEAE",
            "text": "Incredible food and service, strongly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUa3JPai13RRAB",
            "text": "Though we are from the neighborhood, never heard of the restaurant. Literately picked it from Google map and made a reservation for two. Rarely been so right in picking restaurants. The menu is small but versatile. We ordered shrimp croquettes and vegetable risotto as starter. Both terrific, especially veg risotto. Trued escargot and was delicious. So was the burger. Ambience is really cute … a narrow area with an elegant wall decor. Our server Kionna was very helpful in recommending the dishes and what’s the restaurant is known for. Now that we know the place, will come back again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREOUpMWXlRRRAB",
            "text": "Special thanks to the staff for making our visit memorable"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbFlISDhnRRAB",
            "text": "Always great. A hidden gem. Amazing french food, great service, great prices. Celebrated my birthday there and was amazing as always."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5OGZiN0FREAE",
            "text": "Be patient and relax"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5b2RhRmxnRRAB",
            "text": "Best escargot around, always order it! Walk-in for a casual Sunday night dinner & jazz trio was playing in bar … made for a romantic evening just steps away from our UES apt. Solid French food, everything is delicious & ambiance sweeps you away to classic Parisian bistro."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5aHJxOUFnEAE",
            "text": "Truly on the mark French bistro style! Great menu choices with generous helpings that don't sacrifice quality for quantity, an appetizers can be a meal! Many points added for serving carbona with an egg yolk to mix in. Old school! Try the vegetable risotto with truffle oil. It is life-affirming. The drink pour is also generous."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5MU9xaFJ3EAE",
            "text": "AOC East is a nice place for dinner, came here on a Friday night without reservation and was easy to find seats. There are few tables but they have a long bar with tall chairs. This restaurant is a bit pricey considering the plates are small and quality is okay but I just went for a glass of wine and some small bites, so would need to try more things in the menu to make a better judgment. They have tablets with the menu so you can see pictures and descriptions of each item.\n\nFirst I ordered a glass of BEAUJOLAIS which I quite liked, light body and fruity, good for some appetizers. Then, I ordered the FOIE GRAS TERRINE that comes with a little salad, and a little piece of toasted bread. The flavor of the foie gras was actually quite good and the portion is big, they could just give more bread since the amount of foie gras is actually bigger.\n\nThe RATATOUILLE was a bit dissapointing, it needed more flavor and was a bit small . It comes with some Crostini to pair.\n\nESPAÑOL:\n\nAOC East es un buen lugar para cenar, vine aquí un viernes noches sin reserva y fue fácil encontrar asientos. Hay algunas mesas pero tienen una barra larga con sillas altas. Este restaurante es un poco caro teniendo en cuenta que los platos son pequeños y que la calidad está bien pero tan solo fui por una copa de vino y algunas tapas  así que necesitaría probar más cosas para juzgarlo mejor. Tienen tablets donde puedes consultar el menú y ver fotos y descripciones de cada cosa.\n\nPrimero pedí una copa de BEAUJOLAIS el cual me gustó bastante, cuerpo ligero y afrutado, bueno para acompañar aperitivos. Luego pedí el FOIE GRAS TERRINE que viene con una pequeña ensalada y algunas piezas de pan tostado. El sabor del foie gras era bastante bueno y la porción abundante, per podrían dar más pan para untarlo ya que la cantidad de foie gras es incluso más grande.\n\nEl RATATOUILLE fue una pequeña decepción, necesitaba más sabor y era un poco pequeño, viene con crostini para acompañar."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5eE5iZktBEAE",
            "text": "I used to go here a lot before Covid when their prices were good and the manager didn’t yell at me. Then they raised prices and the manager got yelly. Would love to return when that guy goes away. Great place great concept. They have music… idk when. Probably good. I miss their mussels."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoMEpxRmpRRRAB",
            "text": "An upper east side institution. Full of colorful regulars, thick French accents and a lively playlist that encourages the good vibes. A bar stocked with not only Gin but a beautiful and value driven selection of wines by the glass and bottle. The menu does not disappoint - try a tray of local oysters with a sidecar of merguez or their foie Gras terrine served the only way it should be, with toasted baguette and a well dressed salad. Live music on Wednesdays livens up the middle of the week and barrels repurposed as tables are a perfect summer happy hour destination. And don't forget the chocolate mousse."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROenFUQ3FnRRAB",
            "text": "Had dinner here with my Mother and Father last week. chef Romains is doing it right. The ratatouille, potatoes Au gratin, and Cassoulet were delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbS1MNE53EAE",
            "text": "The Duck Magret was hard like shoe sole, the escargot was to salty for my taste , the charcuterie and cheese was up to par , I will give them another chance in the future if my wife wants to go."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxMFBfOTFRRRAB",
            "text": "The food was excellent.  Great service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWNV96NXV3RRAB",
            "text": "Have been here many times the last 6 months.  Great food, wine + fair prices.  Don't understand the iPads & menus.  One or the other- tables too small for 2 giant menus and BRIGHT bulky iPads."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsaTdqdWFREAE",
            "text": "Cute spot in the UES for some good wine and French bistro style eats. Simple but tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsNDdEZXV3RRAB",
            "text": "Disappointed. The onion soup is watery, and the duck confit is overcooked. The escargots don't taste good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsLXIzUThnRRAB",
            "text": "Decent food but I’m not sure I would call this a “French” bistro."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadDc3cURREAE",
            "text": "Great wine list and decent food! Questionable ambiance"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaeGRMNUpBEAE",
            "text": "Love this place- a neighborhood gem! Definitely get the cheese plate and you will not be disappointed.  I always do chef's choice."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMFpmdWFnEAE",
            "text": "Great wine selection and happy hour specials for food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdTlTc3ZRRRAB",
            "text": "As comfy as a pizza oven in outdoor shed with just one fan on other side. I actually got sunburned. Sliders were tiny but good. 2 for $15 plus credit charge surcharge."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaHQzUlFnEAE",
            "text": "This is the new location of the old AOC in the village neighborhood. It's run by the same chef owner, so the French-inspired menu is still really good. I recommend the duck confit."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwelBycnN3RRAB",
            "text": "Those fried oyster sliders with brioche rolls are yumm!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZeE1XdE9REAE",
            "text": "Love France? Love Food? Love oysters? Love wine? This is the place to go! Although we had a small issue with the water, that our waitress took care rapidly. Food was AMAZING fresh and delicious! Felt like you could travel to France in one dinner! Would recommend to go and choose the mussels!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4MzdXRldREAE",
            "text": "Was very disappointed because this restaurant was recommended to us by friends who know that we love French food. We’ve been going through all the French restaurants since moving to the Upper East  Side and this one really fell short. My husband and I love escargot and that was really the only dish that stood out. The frisée salad was okay, and the tuna tartare was fresh. However we requested fried oyster sliders yet they brought out plain fried oysters. Once sorrected, they were the tiniest sliders I’ve ever seen. Then both of our our entrees were a disappointment. The pictures of the hanger steak but nothing like what we were served. Not only that, but I asked for my steak, medium rare and it came out medium well. The waiter who had already gotten our oyster order wrong told me that he Ordered it medium but I had asked for medium rare and insisted that that’s what I had asked for. So now the waiter and the kitchen got it wrong. When the manager came over and offered to re-cook my steak, he then asked if I’d like another glass of wine in the meantime. I thought he was offering it to me complementary for the error but he did nothing. On top of that my husbands duck was chewy. I don’t see what there was to rave about here. One would think that with only two tables filled, our orders would have been perfect but the server was outside socializing and leaving tha manager to have to attend to us."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlckpTZ0RREAE",
            "text": "Great French neighborhood spot with eclectic decor. Started with VEGETABLE RISOTTO WITH WHITE TRUFFLE OIL and TUNA TARTARE. Followed by TAGLIATELLES À LA CARBONARA and a Friday special, VEAL CORDON BLEU. The food was delicious, especially…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKNGVlemZBEAE",
            "text": "The vegetable risotto was delicious, with just the right amount of truffle. A little pricey for an appetizer, but a lovely spot for a drink"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxbzVqSUVBEAE",
            "text": "Great moment in a genuine french place where waiters speak french..(and they're very nice too! ;)\nWe enjoyed big time our stay, from very, very good oysters to a great steak…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURodTdiYkF3EAE",
            "text": "Cute French bistro slash wine bar on UES. Very friendly, familiar atmosphere with laid back servers and bartender with the appropriate French lilt.\n\nGreat selection of wine (of course) and a menu full of tasty french dishes. Their version of a risotto was incredible and they didn't skimp on the truffle."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1b19TSzRBRRAB",
            "text": "The restaurant is nicely decorated with a great vibe. The food was delicious, well worth the wait. The wine choices was extensive and some of the best tasting ones. The staff really knew their wine and recommended excellent ones based on your taste pallet."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdGRQdFpnEAE",
            "text": "Really nice vibe. Would be great if I lived in the neighborhood and could drop in for a drink from time to time. We ordered two desserts, tarte tatin and crème brulée, however, and they were simply terrible. We took two bites and pushed…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldDZ5bU13EAE",
            "text": "Escargot 10\nEndive Salad 10\n\nThe service and ambiance are wonderful. Order the chocolate fondue cake over the crème brûlée"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnaWJQX3VRRRAB",
            "text": "LOVE IT! Great happy hour $1 Oyster. On a hot day, it was still fresh, creamy and tasty.  I went on French Restaurant week so our prix fixe meal was only $17.89 includes a glass of wine and an entree. I had cab and 6oz hanger steak with…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2dlByZ3V3RRAB",
            "text": "A UES hidden treasure and quite possibly the most romantic restaurant in the neighborhood. And, the food is to die for! Six Stars."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLM3BDZFRREAE",
            "text": "We Stumbled into this restaurant. Was really craving for raw oyster.  Due to covid bar $1 oyster deal is off, only $2/ oyster is offered. We had half dozen, very fresh and clean. Ordered Brussel sprout, mushroom spinach risotto and mix match 3 sliders with white wine. Foie gras flan is not Available, bummer, will revisit next time to try. Risotto is so amazingly good, sliders were made to perfection. Beef sliders got sour pickles and Mayo, juicy and tender. Fried oyster slider paired with pickled onion and tartar sauce, seared tuna matches with mashed avocado. Everything was simple but balanced well in taste palette. Well French really know their sauce, even reflects in this American tavern dish. I will definitely come back for pasta and duck confit in the near future."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxem8yUEx3EAE",
            "text": "This place is a neighborhood gem. Food is delicious, wine pairings are usually spot and the staff is friendly. Sometimes service is slow but probably because they’re always so busy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtLXB5WWFREAE",
            "text": "Great French bistro, with excellent friendly service with all the menu items you would expect!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aWZPTV9RRRAB",
            "text": "This a always a really lovely place. The food is great and it's options are ideal for a light evening bite or such. For me, this place has been great because I come here with some of my favorite people.\n\nSo that's my honest recommendation, this is a great place to come with people you love and whose company you enjoy.\n\nThe food is tasty and you can manage with small bites and drinks. They don't necessarily have an expansive liquor selection but they cover wines fairly well so you'll never go thirsty.\n\nAnd as with all good restaurants, the service makes them stand out."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHcV8ySUpREAE",
            "text": "AOC has outstanding french food. Really love the food. Lovely restaurant at upper east side."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyaXViQm5nRRAB",
            "text": "A friend had a birthday party there. They served appetizers out side in the covers seating area. We had fried calamari, French fries, grilled sausage meat and cheese tray and veggie dip. All were very good. Service was good too.\nEvery one enjoyed."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHcHFUWVRBEAE",
            "text": "Excellent French restaurant with old and new dishes. Everything I had there was truly superb and high quality. Love the staff is all French too -- shows they are legit. Ambiance is cozy and romantic too. Definitely a favorite now if I'm in the Upper East Side!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHbk95dWF3EAE",
            "text": "Cozy little wine bar on the avenue, complete with an outdoor structure in the road plus sidewalk seating at wine barrels. I've also sat indoors in the past at the bar. This weekend afternoon we revisited for a relaxing hour or so of…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwcGI2RklBEAE",
            "text": "I love coming here! French bistro style but not pretentious. Their entire menu is great and their wine pairings are on point! Service is top notch, from the bar to the tables! Always a treat to visit, hang and chill!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5NS1pemFBEAE",
            "text": "Cozy and romantic place to dine. Be mindful of what you order and you'll have a great time.\n\nThe charcuterie, cheese plate and ceviche are regrettably underwhelming.\n\nThe oysters taste fresh and are well priced. The wine is good, and they are willing to accommodate drinks to your tastes.\n\nThe best thing was the seafood entree with the fried wrapping from the prix fixe menu. It was phenomenal, and I couldn't get enough of it. I don't think it's on the regular menu, but I highly recommend it when it is available."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobjdyYVNREAE",
            "text": "Old-school NYC warm Parisian-inspired bar/ restaurant. Was there early on a Friday at 4pm for drinks at the bar and so happy as many restaurants around the same area weren't open yet. Bartender and all were super congenial and attentive. Highly recommend."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2MEozMjRRRRAB",
            "text": "This place has such a vibe. Very cool spot. Great wine selection. We also had oysters and they were perfect. Will definitely be back for a full dinner because all the food coming out the kitchen looked great"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQycFBQbXZnRRAB",
            "text": "Great atmosphere. Great food. Great wine list. Great, friendly service. We're frequent customers. I've loved everything I've had. Lamb burger with Roquefort bleu cheese is a delicious recent addition to the menu."
        }
    ],
    "reviews_count": 74
}