{
    "name": "Antonucci Cafe",
    "place_id": "ChIJmQKjfr5YwokRxETZofFe5hc",
    "grid": "MN8",
    "address": "170 E 81st St, New York, NY 10028, USA",
    "rating": 4.5,
    "user_ratings_total": 412,
    "phone_number": "(212) 570-5100",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WdGJsUTBURkZJWDFKdFQwaDRMVlZOTm1NMVJWRRAB",
            "text": "Great place, food and service. Tony was an amazing server. We felt at home, everything was wonderful..\nThank you to all team of this restaurant."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZMmIzUlNkRGQxYldodVozTjJkbnA1Y1RKSGJXYxAB",
            "text": "One of the best neighborhood bistro I know...Great food, service, and atmosphere...please note the Murano glass light fixtures created by one of Murano's great artists."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205eUxURk5XR1JGZFdoYVVqaDNWSEJKVjFKYVVFRRAB",
            "text": "A bit small and noisy, but the service and food are great—so if you’re just looking for some delicious food every once in a while, the noise is easy to overlook."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnME9XVjNRVVV6YVROaFRHZ3hhMUJ6WTJKSlptYxAB",
            "text": "Great service and atmosphere. Food portions are not big - perfect size for 1 person. Gluten free friendly pasta!! Loved it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWlZWZEZibmRWWmsxYVFUZERVekJoVUdVNE9GRRAB",
            "text": "Service and kindness of people working here is top! Food is done to a high level, which might be why their portion sizes can sometimes be very small (quality not quantity). My only criticism is that I’m not sure gelato and sorbet can be served in quarter scoops based on quality. 3 scoops of each of these were less than one scoop in most places. But still a great way to celebrate a birthday and we really like going here!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pocmR5MHpPWGt3T1Vablp5MVVObm90Tm5CUlNHYxAB",
            "text": "Came here for drinks and they don’t disappoint at all. Lovely place, I’ll be back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kZmNYbFJiMHBsU1drM2FteFphRzgxU0dSMU5GRRAB",
            "text": "Delicious local spot, seemed authentic, the sage tortelli and saffron rice cake with mushrooms were perfect for an early dinner. The white tablecloths, red leather booths, and considerate service completed our relaxing meal. Great marinara."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4emJISklRMFpNVVRRM1EwaEVRMDVMYUdKeFJXYxAB",
            "text": "Buena atención; excelente comida, lindo para sentarse en una mesa afuera en verano"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkaVJuTmZRalV5UkZWblJuVnJVVmhoUW5kamRYYxAB",
            "text": "A great find and a good spot for lunch after a visit to the Met."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWblN6Wm9XVTUyTm1SRlNEZHFUV2czTmpFMU1sRRAB",
            "text": "I started off with their meatball appetizer ($24) which was very mild in flavor. My main course was their pan cooked salmon ($41) which was mild in flavor. I ordered it to be cooked medium, but it looked to me to be medium-rare. Their assorted biscotti cookies, for the most part, had little flavor. One of the exceptions was a crunchy coated nut bar, which I did not like the flavor of. They have a picture of singer Madonna on the wall. I was told that she gave them that picture after she dined there. They said that she lived in that neighborhood at that time. The restaurant is on 81st street, just off of 3rd Avenue."
        },
        {
            "date": "3달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMFl5MXNOa2RoY201WlR6WmFhRGRhVVZCWExVRRAB",
            "text": "Vou sempre. Clientes da regiao. Cozinha italiana tipoca de Veneza. Tortelli, caneloni e pastas excelentes Reserva so no telefone"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xobWNsWjNXVmRrZW1waVJ6VkhZWGxpYVZkdlUzYxAB",
            "text": "Pleasant concerning providing booth backed seating. Food & service is zero stars. My daughter wanted me to try restaurant she dined with friends a few times and she was shocked how bad the food’s quality and service was. She ordered truffled pasta with asparagus and mushroom. I ordered pasta W/lamb ragu. I got a tiny portion with a few strands of lamb. My daughter looks at me and says, this does not have any truffle flavor. I call over waitress, “doesn’t her dish come with asparagus and truffles?” A discussion ensues over tossing her dish and IF we wanted to reorder. Waitress blamed the order not taken properly. NOPE! They provided fresh order to go and when we got home…no asparagus or fresh mushrooms, it was an act of spite. If they were out of asparagus why not admit it? Why not offer something else? The dish was bland and even the dry black truffles didn’t save it. My daughter will not be returning with her friends."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OWlVXbENhemhsTmxvNFMyMXlOa2xRZVY5aWRtYxAB",
            "text": "Very poor service. It took 45 minutes from the time we sat down to get our wine bottle. The waiter could not answer any questions about the wines. They did not have a Sommelier or wine manager. The waiter told me he would get the bartender, but in reality, it was just another waiter who had no idea what he was talking about either.\n\nWe had previously let them know when making the reservation that it was our daughter’s birthday. We we even mentioned to our waiter that was her birthday. They did nothing; no candle on her dessert, nothing.\n\nThe food was fine, but there are plenty of great Italian restaurants in New York City with outstanding service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dk1tdHdkM0p1Y1c5eFJIVlhWRzlXVFhOYVNWRRAB",
            "text": "Went for the first time today, tried the meatballs, fries, and also the filet mignon. Meatballs and sauce, fries were great, steak was not impressive. The waiters were alright who brought out the food but all the waitresses were ignoring our table and we made several attempts to get their attention for a water refill and to try and order food. We were one of only 3 tables occupied in the restaurant. Noticed they were mostly chatting amongst themselves and they also seemed much more friendly with the other customers and smiled at them, but met us with a not so great demeanor. No hellos or goodbye and weren't friendly at all. They seemed bothered to have us. We were a table of 2."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200ek5GOVVkekZDTjBsWWJqYzRka1JyTTI5eFJXYxAB",
            "text": "Great food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxNFQwTnNTM0J5Y3kxQk0wcEdka0ZSZVhsMWNuYxAB",
            "text": "Great food. Loud place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTFdYTjBWbTF1T0VoT2VVRjBNblJZZWpkbU4xRRAB",
            "text": "Excellent food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOS3pnczdycVk2U0NBEAE",
            "text": "Lovely service and great food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VPNm9zcC13aXFDSFNnEAE",
            "text": "Wow. Overcooked and tough swordfish sent back and the scallops that I then got were refrigerator cold inside! Major disappointment. Rather nonplussed manager. Pasta was good though…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOanJxZXI3enFlMnh3RRAB",
            "text": "Excellent Veal scallopini w/ delicious sautéed Brussel sprouts that come with it. I asked for extra garlic and they were very kind to add it in! They served delicious bread with tomato sauce and ricotta dip. Everyone here is so nice. A very sweet restaurant with really good food!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPUFdtOUNlMktpUW5BRRAB",
            "text": "Good but not great. The service was fast but friendly and the bread service is excellent. Caesar salad was very fresh and light. Linguini with clams didn’t have the clams with the shells on, which is how I prefer it. Feels very classic upper east side NYC. It’s overpriced, but so are most of the restaurants in the area. I’ll probably go back and have a different pasta."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZX0p5Wi1RRRAB",
            "text": "The best little small hidden gem of the UES - run don’t walk there! The bread plate followed by fresh pasta and don’t sleep on the martini!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MTctT3JnRRAB",
            "text": "Good italian meals overall, not excellent but good."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnZzdiUjRBRRAB",
            "text": "Absolutely wonderful neighborhood cafe. Great atmosphere and delicious food."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURncmZPT0hREAE",
            "text": "Cozy place with lovely art and top notch service but Caesar salad was not great and the tiramisu piece was so tiny, company was good so enjoyed otherwise."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnLVBfZ2hnRRAB",
            "text": "Such an incredibly welcoming venue! Recently there to celebrate a wedding. The staff was so attentive, but at the same time you hardly knew they were there. I write Antonucci’s a glass full and flowing over."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnM0ppUjhBRRAB",
            "text": "Lovely small upper East side bistro.  More or less Italian menu.  Very good food."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBbGVMVlpBEAE",
            "text": "I love the atmosphere and the food was delicious."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcnNxeUZnEAE",
            "text": "A lovely little Italian place with the best liver.  I highly recommend the liver."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbEpIZ1RREAE",
            "text": "Good"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQbzhlb2tRRRAB",
            "text": "A true NY gem ❤️💎✨…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQMWUteEZREAE",
            "text": "Homemade chicken meatballs is my favorite. Might be able to skip the entree and stick to this appetizer."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaWJyWE13EAE",
            "text": "This restaurant (not a cafe) *used* to be a real great place to eat but the quality has significantly declined and our last experience was dreadful. The mozzarella in the appetizer order was tasteless and subpar - for $30! The grilled vegetable entree was without any discerning flavor- unseasoned and served cold. The vegetarian lasagne was deflated and overcooked, yet served lukewarm. The soup was decent but for $30 it was a ripoff. True story the owner had sat down at the table next to us and looked completely miserable and checked out as if he didn't want to be there at all - that told us all we needed to know."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvamJfMHB3RRAB",
            "text": "Great food and great atmosphere. Very NYC UES."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNheC02LWd3RRAB",
            "text": "Wonderful Venetian restaurant. The liver Venetian style and the Lugana wine were perfect. Great ambience indoors, fabulous artwork, and perfect service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzd3YyMjZRRRAB",
            "text": "Wonderful restaurant. The food, service and location are great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuck8yNEd3EAE",
            "text": "Lovely little Italian restaurant that I’ve been wanting to visit for a while and I’m glad I did. Everything from the bread, the marinara sauce to the pastas and the tiramisu were delicious! I’ll be back for sure"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNubmVhckxREAE",
            "text": "I love this place. Prix fixe ultra reasonable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIOUtTaFZBEAE",
            "text": "What can I say but wonderful on all fronts!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3MTZHendBRRAB",
            "text": "The squash blossoms were amazing and so fresh and clean tasting. Eggplant Parmesan appetizer, sweet and full of flavor. The rigatoni à la vodka had an underlying tone that is a outstanding addition to the overall profile of the dish. The clams with linguine again absolutely perfect. all of the flavor profiles could only be skillfully executed by a MasterChef The tartufo was the best I’ve ever had. additionally, the weight staff was attentive and friendly. we also enjoyed two perfectly prepared old fashions with Woodford reserve"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURycDRfWjJBRRAB",
            "text": "Had the pre fixe menu. Reasonably priced. Food and service were both fantastic."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybklXb253RRAB",
            "text": "Tasty Italian food with a variety of menu options, attentive service, and a refined atmosphere. Definitely a good place to impress a date. The prices are quite high relative to portion sizes tho. You pay for the atmosphere I suppose."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMc2FXLWtRRRAB",
            "text": "We had the loveliest summer evening at this restaurant. Blue loved it because he could observe the world passing by from his “balcony” and I loved it because they serve amazing homemade gluten free fettuccine! The clams pasta was amazing and the gavi white wine was the right choice to go with it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MW9xdGp3RRAB",
            "text": "Veal parmigiana was amazing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqM2VtaGlnRRAB",
            "text": "Best prefix lunch for the money.\nExcellent calamari and veal pasta dish\nGreat desserts too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqOHFHdm9RRRAB",
            "text": "Overpriced for mediocre food and inattentive service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbS1lVnZBRRAB",
            "text": "Old world, Italian restaurant with some of the best Italian specialties in New York! Eggplant Parmesan, stuffed squash, blossoms, pappardelle Bolognese, orccechietti with veal and Tartufo! The wine selection is very good and the cocktails outstanding"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEaW9fV0NnEAE",
            "text": "A good simple Italian and French cuisine menu. Easy atmosphere and cool cozy place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtNnFDU3B3RRAB",
            "text": "Stopped by this place after visiting the MET and it did not disappoint. Right after you get seated, they serve you a complimentary bread basket with this marinara and ricotta bowl. Needless to say, these alone were amazing. We tried their Chicken Milanese, Carbonara, and meatballs and everything was pretty good. The Chicken Milanese was a bit underwhelming but when we paired it with the marinara, that was much better imo. Overall a great experience but it is a bit pricey tho!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROZ3RmNWJ3EAE",
            "text": "Homemade carbonara was delicious.  Chicken milanese was satisfying, but the cutlet could have been thinner.  Appetizers were minuscule and the olive oil cake was dry."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3MFBpbmNnEAE",
            "text": "If you are looking for a traditional Italian eatery patronized by locals (most of them retired UES Italian Americans) then you’re looking at the right place.\nMenu is very extensive and the meat and pasta options outstanding (I have heard mixed opinions about the fish). The wine list is also extensive, and a little pricey.\nOnly issue with the place: it is too narrow which means that it it also very loud."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnOW83cUZBEAE",
            "text": "Supposedly the baseball player Ichiro used to go here to eat Carbonara. Carbonara is my one of my favorite and their carbonara was pretty delicious. You can tell this is little high end when you see who’s dining when you enter. Very cute decor inside :)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpa2VTOTh3RRAB",
            "text": "I loved this cozy little cafe. The food was really good. They have a decently priced menu for appetizer/main course/dessert (with slightly smaller portion sizes, nonetheless quite filling) apart from the regular menu which is a bit on the pricier side. The pasta was cooked to perfection - el dante.\n\nThe staff is warm and friendly.\n\nI also found the perfect affogato in this restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSa19uU25nRRAB",
            "text": "Did not feel like cooking so order out , was very disappointed and displeased with the salad I received, call and explain that the salad was not fresh and it was plain lettuce like they just put it in the container the same way they received it from the market,wanted a different salad manager they they will not replace it because the chef checked the inventory and the salad is fresh .Just spend $128 with them plus tip the delivery guy $10 and this is how they treat me . I told the manager that was not nice but I know I will never spend $1with them again."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4MXYzSVFnEAE",
            "text": "Very good Italian foods with homemad fresh pasta.\nOne of the best Lasagna i had in Manhattan.\nHighly recomended."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCX2R2Sk53EAE",
            "text": "One of the better Italian restaurants in New York. A true hidden gem on the ues. The food is fantastic, the service was good, and the vibes in the place are very nyc in the best of ways. Highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtXzg3QXJBRRAB",
            "text": "One of my favorite Italian restaurants in NYC. The food is always fresh and delicious. Great atmosphere, too."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZMko2VHhnRRAB",
            "text": "Lovely atmosphere, service, and food. Reasonably priced.  Yep, I'd go back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhNll2OTVnRRAB",
            "text": "Loved the ambiance the most! The food was delicious and the service was above and beyond."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlNnFYQW9nRRAB",
            "text": "Just had lunch here today with my spouse and older friend. Wonderful food. You can't go wrong. The calamari is heaven, I ate it from my husband's plate since I ordered a salad which was delicious as well. The fish is yummy, done perfectly…"
        },
        {
            "date": "1년 전",
            "language": "pt",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxZ29LWWlBRRAB",
            "text": "Nao é gostoso, há lugares bem melhores em NYC!\nViemos neste café por estarmos perto deste local e então a pontuação não era ruim.\nMas sinceramente é um lugar que eu não volto. Comer Pasta aqui foi decepcionante.\nNao é gostoso. Ou tem sal demais. Nada cremoso…. A comida ficou no prato.\nInsistir em comer pra valer a pena meu dinheiro gasto … mas não… foi muito difícil\nO lugar parece abafado também.\nEnfim, se quiser pagar pra ver ….\nJá estive em  lugares melhores aqui\nPor exemplo, se você for no Carmines vai comer bem melhor ! E muito mais gostoso e com o valor mais justo 🙌🏻\n… bom e sobre aqui Em relação aos atendentes , todos parecem educados!\nInfelizmente só não gostamos mesmo da comida. Talvez haja outras opções melhores , mas pra pasta 🍝não gostamos."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCd29xZHVBRRAB",
            "text": "This is my favorite Italian restaurant in upper East side, maybe the whole city. They have a very solid lunch prefix menu, which includes starter, entree and dessert. I love their squid in the starter, which is grilled to the right level and it comes with a salad. Meatball is magnificent. I also love their pasta with chicken meatball. Very tasty indeed. All of their desserts are good! Highly recommend it!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvbnY3aHFBRRAB",
            "text": "Great place for a home cooked Italian meal. Very cozy and friendly services."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlOXNldkdBEAE",
            "text": "Amazing staff, delicious and authentic Italian food and a cute place! Love the meat lasagna and Orecchiette pasta and if you have space for dessert make sure to try the  profiteroles– simply amazing! Also a great selection of wines. :) Would totally recommend it. I had a great time and a great dinner!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWLXBxemlnRRAB",
            "text": "Large menu to choose from. I am Italian and very particular about Italian food. You won’t be disappointed. Try the stuffed zucchini flowers and artichokes. Pasta is delicious also and the dessert choices are many and yummy. I had the tiramisu. Enjoy!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2dnNIN3ZnRRAB",
            "text": "A true slice of Venice...\nthe food is amazing & delicious.\n\nThe staff was friendly & knowledgeable.\nThey have an immaculate wine selection (that you can taste before purchasing)\nI ordered Merlot and I ended up ordering a margarita just for a goodbye away kick.\n\nDelicious pasta authentic handmade bread you can taste the effort in each bite.\nVery cozy for a date whether it's an anniversary or first time impression I would give it 6✨ if I could."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0bGZMYm9nRRAB",
            "text": "Their lunch prix fixe menu is an outstanding value. The portions are really dinner sized and excellent. This may be the best restaurant deal in Manhattan."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxc1lQTjVnRRAB",
            "text": "Not a cheap meal, but a good one. Very high quality food, also for vegetarians. The pasta is homemade and so are a lot of other of the products.\nThe profiteroles were exceptionally good. The service too was great. For…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKOVplTGpnRRAB",
            "text": "Had such a wonderful dinner here the other evening. Everything was top notch. Each food course was quite tasty (especially the zucchini blossoms); and the service could not have been better. Looking forward to the next visit!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaDhmMGlRRRAB",
            "text": "Wonderful restaurant with good food and service, but what really stands out is the decor.  They have filled the walls and shelves with a great eclectic collection of artwork. Paintings, prints, photos, masks; even boat models.  Even the bathrooms are filled with eye-catching items, including posters signed by the artists!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsMXNIU2JnEAE",
            "text": "The experience of delicious food, first class service and a pleasant ambiance made this a perfect after-museum date. Every dish we had was perfect and elicited a silent \"wow\" reaction. The list of wines by the glass offers superb choices. Ok, the tab gets a bit steeper as you sample the super tuscan and truffle pasta. The tables are as close as the Blue Note, but just as Blue Note offers some of the best jazz, Antonucci offers a top dining experience while remaining cosy and welcoming."
        }
    ],
    "reviews_count": 71
}