{
    "name": "Crave Fishbar Upper East Side",
    "place_id": "ChIJ39p8pu9ZwokRrVZUR4REV00",
    "grid": "MN8",
    "address": "1462 2nd Ave, New York, NY 10075, USA",
    "rating": 4.8,
    "user_ratings_total": 66,
    "phone_number": "(212) 688-8886",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTFNYcHRiWE4wU0VwUFVYTm1kQzFoT1VKRldrRRAB",
            "text": "Much better choices around."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCNmNGZHpTemhST0hOSVNqWTBUMFZNUTBWVVdFRRAB",
            "text": "Don’t let the scaffolding outside deter you like it did us! This restaurant is amazing. A Mexican twist to seafood in the best way. We don’t repeat restaurants often, but we will be coming back here! We got the oysters, crispy rice (incredible), salmon tostadas, and yellowfin tuna entree - all were outstanding. Honorable mention also for our drinks- the Fireside Old Fashioned and some sort of Gin Sour with cinnamon. Everything was so good!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xab2FHRkdlVFJTUWsxUWNESlNkM3B4YVY5NFlrRRAB",
            "text": "We took my aunt here for her birthday and it was delicious. The service was amazing. Favorite dish:  Seared Yellowfin Tuna with coriander adobo, mexican corn, smashed fingerling potatoes, queso fresco, pickled onion, guajillo salsa."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZdGJrSmlPRzVOYzNoYVRWUjNZVGhKYTFKNldsRRAB",
            "text": "We went for restaurant week, but we will definitely be back! All the food was amazing. Our server was so sweet and thoughtful."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VeVNsbHdVVzE2UkVkVFUyMUdUMDVaU2taR1VXYxAB",
            "text": "Excellent seafood! The blackened branzino was amazingly delicious! Oyster Heaven with a wonderful bar."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214aVJWazRZbkpUZVU1cVZEQnZaRmxrUVdGTmJYYxAB",
            "text": "I am a huge fan of this restaurant, ever since the Midtown opened up. UES was lacking oysters for a long time. The restaurant offers huge selection at a great price point.\nThe restaurant offers great menu outside of raw bar. Selection of fish is best in the neighborhood. Lobster curry is absolutely amazing. However, if you are not into fish, you will find something to eat as well.\nService is always so quick. Shoutout to the best server there Cami, who is always friendly and personable."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTFdtbEJVRXAyVVMxeGFrTTRlVkpDY2t4NlpVRRAB",
            "text": "The food was very enjoyable and tasty every dish was a surprise..."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMU0s4ZGI1a2NmLWFnEAE",
            "text": "Great food and atmosphere on the upper East side.  Hostess was very helpful and got us a table for 5 on a busy Saturday night with an hour of notice.  That was greatly appreciated.  Seafood is very fresh and the appetizers are delicious."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJT2Fpckd6eE9EY3lBRRAB",
            "text": "Good variety of seafood in the menu , prices are fair , the service is outstanding - the waiter and the manager were superb , suggesting and explained each dish , the fish and spaghetti were excellent . I will certainly return . Good atmosphere ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQSERuWnVmbGMtOG1nRRAB",
            "text": "Enjoyed the oysters, oyster shooters, grilled Spanish octopus, and the honey glazed barramundi."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbHJTNU1BEAE",
            "text": "Outstanding in every way. Go you will not be disappointed"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNjV5XzVnRRAB",
            "text": "Had such a lovely experience dining in on a busy Easter weekend.  Regan, the bar manager was a total sweetheart and really kind to our 10 year old.  The food was lovely and thoughtfully prepared but the service was a cut above the detached and impersonal energy of most spots in the UES.  We will definitely be back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdFptZG5nRRAB",
            "text": "Everything was very tasty, great decor and vibe, beautiful bar."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJc3N5OTFRRRAB",
            "text": "Love this little Upper East side gem! Excellent seafood and everything else looked great too."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cnBPcjVBRRAB",
            "text": "It was great i loved it it is so nice there. the lobster curry it is pretty good. and the oysters  it is so good great food 5/5 and the cocktails. are just amazing they have the best service and the atmosphere is such a vibe sit at the booth if you can get a seat there or the bar and get the oysters and caviar it’s more on the expensive side but it’s still very very good. and for get the yellow fin tuna tostada and for entrées get the Black Angus strip steak so yummy😍"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdTlxR2VnEAE",
            "text": "If you're on the Upper East Side, Crave Fishbar is a must-try! Cami, our server, was awesome—super friendly and made the experience so enjoyable. We went for the happy hour and everything was delicious: the Hugo Spritz was refreshing and the Bloody Mary with colossal shrimp was amazing. We also got calamari and fries, both were crispy and tasty. I have a severe gluten allergy and the team was very accommodating and provided lots of information regarding ingredients/allergens/etc. It was so nice to feel so taken care of! Great spot for fresh seafood and drinks, definitely going back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMXZ6M2h3RRAB",
            "text": "I arrived at 6pm for dinner and drinks with a friend. We had oysters, fish tacos, and the crab roll- along with some martinis. Everything was delicious. Taking off one star for service because the server did not tell us it was happy hour when we first ordered so we had full priced drinks unnecessarily. At 6:25 she did mention that happy hour was about to end, and allowed us a moment to look over the happy hour menu and put in a last minute order, which was appreciated. We had a good time and I would definitely recommend."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbE1mSDhnRRAB",
            "text": "This was an okay night out. The staff was friendly.  The table were cramped. The food was just okay. The wine was redeeming."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRb0pEaXVnRRAB",
            "text": "Food and service so good. Fish fresh and healthy. Really recommend. Also loved the service they aren’t on top of you but they check in. Super good."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnNHFYY1dREAE",
            "text": "This is one of the best seafood restaurants we've had the pleasure of dining at—anywhere. The happy hour is fantastic, offering a great selection of options. The Bloody Mary is top-notch, the oyster slider is flavorful, and the crudo is incredibly fresh. We’re obsessed with the thick-cut fries. But the real standout? The bolognese, served over perfectly fresh pici-style pasta—simply outstanding. The kids’ menu is exceptional, so good that we’d return just for that. Add in the warm, attentive service, and this place is an absolute gem."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncTVMVnR3RRAB",
            "text": "Great food and service. A very nice local restaurant."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNXJhOWxnRRAB",
            "text": "Menu is pricey, but they have so many great dishes and the seafood all tastes so fresh and high quality. The seats by the kitchen can get a bit warm, but the back room is a great vibe. Good happy hour as well."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfbE1yaVdBEAE",
            "text": "Excellent neighborhood spot with the best Oysters in town. Love the Oysters Happy Hour!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQaDcyNjh3RRAB",
            "text": "Fantastic oysters, bevs, and fish - and service by Ashley H. Really excited about this new restaurant in our neighborhood."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQeGFMVm9nRRAB",
            "text": "Emma was the best server ever! She suggested oysters for us and they were all fantastic. Our favorites were the wavelength and the st simon oysters. She even shared a fun fact that we thought was a nice cute touch.\n\nNow on to the entrees they were amazing 10 out of 10. The spicy squid ink spaghetti was so delightful and smelled delicious. My fiancé had the grilled barramundi and it was the best fish I’ve ever had.\n\nWe ended the evening with a red velvet cheesecake. Two of my favorite things in one. Definitely will be back for a date night or even a “let’s get some oysters for dinner” evening.\n\nAlmost forgot to mention the oyster shooters which was our “appetizer” would have done a second one but we wanted to pace ourselves."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQeGF5SEN3EAE",
            "text": "Just wanted a walk-in evening, post work with my finance… an appetizer, 24 oysters, 2 entrees, and a dessert, and 4 recommendations to my friends(via text) later we realized this place is probably our regular date night! Everything was amazing.  So happy to have just happened upon Crave Fishbar.  We will definitely be back!\n\nPs- Emma is amazing!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQeXBlR2RBEAE",
            "text": "We had a wonderful dinner with friends! The service and dishes were excellent. Although we encountered a slight issue with one spicy dish, the staff went above and beyond to address it promptly. The atmosphere is very comfortable, and the cozy design adds to the charm. We’ll definitely be back!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzZ0t5RjNRRRAB",
            "text": "Literally obsessed with this place. Service is amazing - Emma and Evelin were great :)\nYou HAVE to get the octopus, truly one of the best dishes I’ve ever had and the barramundi is equally delicious"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzczUzUHd3RRAB",
            "text": "Gotta try the happy hour Oysters. $18 for a dozen Blue Point oysters."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdk5PZUhREAE",
            "text": "Amazing spot for happy hour oysters and such friendly staff! Eric, Ricardo and Cami were awesome!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYXzRlUlNBEAE",
            "text": "Walking up, the exterior was lovely, draped with floral arrangements. Inside was cozy. I started with the warm crab sushi roll. It was just ok. The Maine Crab roll wasn’t the greatest. I like my roll buttery and it just wasn’t that. The crab mix wasn’t my favorite either. I also got the Fusilli Pasta. Aesthetically it looked amazing. However it was bland without the spicy sauce that they give you on the side. Not the best fishbar experience but also not the worst"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuLThuQ3RBRRAB",
            "text": "Delicious food. A little pricey, but great atmosphere and service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudUtQUVBnEAE",
            "text": "I was super impressed with Crave. The cocktails were great, service good, and oysters and all of our other food was super fresh. We loved that we weren’t rushed to get in/out which happens so often at restaurants these days - we were able…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNE9XZ0NnEAE",
            "text": "Great new spot. Lobster roll is a little light for the price but everything very tasty and good service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIeDhqWVdnEAE",
            "text": "The new location on the upper east side is absolutely amazing. The space is beautiful, the service couldn't get better, oysters as fresh as they get, and martinis stirred to perfection. Heather and the whole staff have made our experiences special every time we've visited. THANK YOU!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIenNERFVBEAE",
            "text": "It offers a solid happy hour experience, with a great seafood selection. On weekends, happy hour runs from 4-6 pm, and during the week, it’s from 5-6:30 pm.\n\nThe oysters are definitely a highlight—fresh, briny, and served at a great price. The atmosphere is inviting, and the staff are attentive and friendly, making sure you have everything you need.\n\nWhile it delivers a satisfying seafood experience, I personally prefer their Upper West Side’s sushi quality."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIcjhyR1V3EAE",
            "text": "Fantastic addition to the neighborhood. Excellent food and service, we can’t wait to go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIb29fZ1hnEAE",
            "text": "Such a gem in the neighborhood, truly amazing and fresh tasting food + cocktails. Will be back. Thank you!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNId3VfSVBREAE",
            "text": "Best happy hour in the area with the freshest oysters and seafood. We also ended up staying for dinner and had an excellent meal. Shoutout to a fire mocktail list too with a spicy margarita. So good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3NS1LQ3N3RRAB",
            "text": "I have been a fan of the upper west side location for years. So happy this is now open on the upper east side. Make sure you get the chocolate chip cookie skillet after your meal. The cookies are baked in house and incredible. Also just a wonderful vibe with friendly service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3eWIyMjJRRRAB",
            "text": "It's a fine addition to the neighborhood with quality food and great service. Like other reviewers have already noted, the spicy tuna roll is really excellent. I think other dishes were very good, but I didn't feel any stood out. The flavor was a little flat and were missing depth or complexity. I also didn't find a lot on the entrees on the menu that I really wanted to try, especially at the menu price points. Still, I'm glad we have great establishments being added to the Upper East Side."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3LXMyQXZRRRAB",
            "text": "I took my family to check out this new spot on the upper east side, and it’s phenomenal.   The food is amazing (I got the squid ink shrimp pasta…. Highly recommended), the atmosphere is sleek but with a warm feel to it, and the oysters are super fresh.   The oyster sliders are also dangerous…. Once you start in, good luck stopping.\n\nCan’t say enough about the staff; everyone was super friendly and accommodating, which is refreshing because I have a 2 year old and a 4 year old that can make dinner at restaurants difficult.   But the wait staff in particular was keen to help me entertain the girls and keep them happy during our meal.  10 out of 10."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3N2FEelFnEAE",
            "text": "Stumbled by this new fish spot in NYC on the UES. The menu was eclectic but intriguing. As I walked through the door I was pleasantly surprised at the tasteful decor and the zen-like fixtures and furniture placement. I had never seen a fish bar before! In the back there is a skylight, so if you’re lucky enough to secure a table in this fantastic new restaurant ask for the back. The salmon tostados were straight out of an authentic Mexican restaurant like you would find in Cabo. The sushi was among the freshest I’ve ever had. The salmon appetizer was so good I ordered salmon for an entree as well. The fish tacos while spicy, felt like a fiesta in your mouth. The zaatar salmon was perfectly cooked on a bed of Mediterranean feta salad with a tahini jalapeño sauce that complements the fish, rather than overwhelm. The barramundi was something special, as I don’t normally see this in other NYC fish restaurants. The desserts were great, the banana pudding was perfectly mixed, but make sure you get their signature pan cookie with ice cream. Lastly, if you feel like relaxing try the saki 😉. 10/10 I’ll be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3eC1Id09REAE",
            "text": "Great oysters and cocktails"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cmFlbkdnEAE",
            "text": "Amazing ambience, incredible service and the food is spectacular. My family attended the soft launch and were so impressed. We will be regulars."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3emRyQ09BEAE",
            "text": "I can’t even begin! Amazing menu. Amazing service. This is a staple of wonderfulness! The menu is Devine and the drinks Superb! The staff makes it all over the top! Love!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3emJMVTB3RRAB",
            "text": "Just wow! So grateful Crave is on the UES! Check out the “Happy Hour” for amazing oysters and drinks. We will be back- over and over again! Everyone that “works” there is just wonderful. Best experience. Sharing a secret!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3MWY2bk9nEAE",
            "text": "Amazing meal. The restaurant is absolutely beautiful inside. The staff is amazing, so friendly, walking into any of Crave's restaurants always feels like being welcomed home. Best calamari ever and the brussel sprouts are fantastic. We had the lobster curry and tuna entrees. Both were delicious and gorgeous. Don't leave without trying the giant chocolate chip cookie.\n\nCan't wait to go back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bVlPOFlBEAE",
            "text": "The food here was excellent. The fish was fresh, the cocktails had range, and the service was excellent. We’ll definitely be back, especially for the spicy tuna roll!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiMElPQklnEAE",
            "text": "Very disappointing!  Cauliflower soup had no taste, fish tacos very dry with no flavor but loaded with white pepper. The lobster roll had a good amount of meat but served in a very spicy green sauce again hot but no flavor! Asparagus was interestingly prepared and very good. Service good."
        }
    ],
    "reviews_count": 50
}