{
    "name": "Bua Thai Ramen & Robata Grill",
    "place_id": "ChIJq6o-8btYwokRAnPeXDLe9bM",
    "grid": "MN8",
    "address": "1611 2nd Ave, New York, NY 10028, USA",
    "rating": 4.8,
    "user_ratings_total": 9082,
    "phone_number": "(212) 879-7999",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OaVVtdERiSFJxYld0NU4wVlBaRVZ2ZDJjM1pIYxAB",
            "text": "I dont understand how this place is highly rated. The host wouldnt show me to my table he just said follow the crowd. They also had no idea where I was to be seated. The waiter was not friendly and honestly was not attentive. The food was ok. Nothing superb. A bit dry to be honest. I would not recommend or go back.\n\nI do agree with other reviews the actual restaurant is very pretty."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNMlZXOWFNWGhCWVVsaFpqWXhNMnhoVG5CYWMxRRAB",
            "text": "We had a wonderful time! The staff was very attentive and friendly. The food was great as well :)"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4eVUyZEZPRVZhT1hGWE1FVjRSRFJ5YVhwRVNtYxAB",
            "text": "The service was great. The food was amazing and a great selection. Will definitely be back soon."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0d2FVZHROazAzZG1GR1NrUkljME55TFVwQ2VYYxAB",
            "text": "Everything was delicious!!! Friendly staffs!!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVGFrOVVVMjV0TlRkQldIcHlTMjh3YUdwQ1EzYxAB",
            "text": "Tom Kha Gai was stunning. Pad Thai had a rich flavor, not spicy. Definitely will visit this place again."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKMFdFVmpTVWR3WDJSSVV6SlRiRE5CTFZBMlNIYxAB",
            "text": "Food and service was great! Really tasty vegetarian options, drinks and awesome service!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psTlpVTlZOazk0Y2tWYWNYWkViVnBPZERCQmFXYxAB",
            "text": "Highly recommend eating here. The food is great, especially the Chiang Mai Curry Ramen Noodle. The service is great, and the food is good. Will definitely be back"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwSlIwSllSMU5KYldwV2IyNTRTbXRyVGtaNFFVRRAB",
            "text": "Love this place. Try the clay pot fried rice. It's amazing."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMGQzWndkR05mVjNaSFV6SlFNVk4zWkVSelRFRRAB",
            "text": "Love the food! Will be coming back!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oVlFsaG9Wa3R1UVZCeFRWRXdhblZtUW5KV1NIYxAB",
            "text": "This place is so pretty and lively!  It could be a club if they took the tables away; we came on Halloween night and it was extra festive.  Year-round, if you wanted a place that felt like “yesss, a night out with fun huge drinks and tasty foood!” this is just the right place.\n\nThe chicken curry puffs were excellent, down to the cucumber relish.  The seared garlic tuna spinach salad was quite fresh and I especially liked the yam, a buried autumnal treasure amid summery, light food.\n\nI will say that if you want to remain alcohol-free, you get much more drink for your money with the soft drink menu vs. the mocktail one.  Spring for a cocktail, though,  if you drink; they are gorgeous and huge, sometimes served out of a small pineapple, watermelon or coconut!!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWVRrcEJiR2haVGxaRFUyczBRMjR4VFVGUFUzYxAB",
            "text": "Excellent food and amazing decor, including seasonal touches for Halloween. Make sure to try the enormous drinks in whole fruits!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMmR6WXlMV0ZYT0doVllYTXRORGhIY0hVMFpuYxAB",
            "text": "The sushi was absolutely delicious and the decoration for Halloween was phenomenal. Definitely recommend!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VNFpWTTFPUzFvVmxWRFNHTmtSREEwVERSbFQyYxAB",
            "text": "very nice customer service and food is amazing! definitely recommend coming here!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dlRVWjBkVFJNTUdkMVlWWTFOa1JrVUc1Rk9GRRAB",
            "text": "Beautiful restaurant. Love the decor. Food is fantastic. Been coming here for years, and it is one of my favorites in the city."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poMlQzY3pVbGxLVldOek9VNTViV1pXWTBNMWRYYxAB",
            "text": "The food was absolutely delicious. The presentation was on point and very nice. The service was also amazing. Overall a great place to visit."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxa1NESlBaVXQyUWtwR05rbDZRMUZyUlhoa01sRRAB",
            "text": "Great dinner. Amazing drinks and wonderful service."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOTmIxSTFkakI2VUd4WFpuaHNWVzE2WDJvM1MwRRAB",
            "text": "Delicious food, great service, pretty place with decorations, music etc. Definitely recommend a try"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kQmJETm1hQzEwTmxsRllVUnJRamh1UWtwcmJsRRAB",
            "text": "Fantastic atmosphere, food and drink."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNFQwSXRia3BoUjA5bU9VUjNUVVpGUjB4aWVXYxAB",
            "text": "This is my second time coming to this place. Services is speedy and very attentive, and the food is flavorful. I got the crispy duck salad, and to me this was a satisfying portion and very flavorful; the duck was cooked to perfection. My partner got the ayudhaya noodle soup, and he (a very discerning ramen aficionado) said it was delicious and just the right amount of spice. I definitely recommend this place!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SSmNYbFhVMFZMU0dsc2JGVkZSbXBTTjFSVE5IYxAB",
            "text": "Best broth"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRFRsTldYMkpIYm1rMGFWTjJOemxIV2tONmQwRRAB",
            "text": "The atmosphere is super lovely and lovely to be in. The waiters are also super lovely and were kind enough to take photos of our group (brought a whole soft light to make sure the photos came out nice!!). The food is super good and the wait time were pretty quick. Overall I'd definitely recommend to try out this restaurant if you are nearby !"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kb2RXOWxielZMTFZaMWRHTTRlRUoxV0RKSFNFRRAB",
            "text": "Love the atmosphere and deco! Had the pad see ew- super good and flavorful."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sdk5VSnVkakZFTmpOdVFuaDNkV1pwUkRSTFdIYxAB",
            "text": "Food portion was huge, really well seasoned food"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWmFVZGxNbEpYVEdsUUxUaE1TbTFwTm5aalNWRRAB",
            "text": "Excellent food service. We enjoyed the basic fried rice, crispy shrimp bao, and the other foods. We came here for a birthday party and the lighting is very pretty. Great customer service. Definitely recommend"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paa1QyMVVSVUk1UjFWaWRrcEpWMDF0VVRSSWNYYxAB",
            "text": "The atmosphere is exciting, romantic, and colorful (bright with flowers and decor). The service is extremely attentive, double checking everyone's safety with allergies and providing any suggestions. As for the food, adore their jumbo shrimp pad thai, definitely would go again!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SVk1VSXdRV2xFUjNKWk9EVkViakE0TWtSNE5YYxAB",
            "text": "Great place, friendly atmosphere to hang out with friends or family. The staff was very welcoming as well!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SRE0yVnFaMVpRWldWdWJGUjBZblZmUlhGUFkyYxAB",
            "text": "Very good food. Recommended for everyone"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOZmVYbEtVbkp0YTBJelQySjJlVWt5TlRsaFIzYxAB",
            "text": "Great food and atmosphere here! The presentation of the food and drink was lovely! Defo recommend."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSclQxVlZZMkp5TUV0bmRtZzBWazh0VTBwTlIwRRAB",
            "text": "very delicious food!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kblVUZEJkMFZmWkdkck5qUXdVME5sYzBkd1ZVRRAB",
            "text": "we had about 4 plates and everything was great! the vibes were eccentric but the food was homie. Came for my sister‘s birthday and it was awesome. I will definitely come back with a party."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOdExXbFVUQzE1VGxSRWJXTXpXazEzYkZsamVYYxAB",
            "text": "Thank you so much!!!!\n\nVery tasty food and excellent service."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdWRrcGtVRTkzVmpCaVVFSnNhazlSYkdKM1ozYxAB",
            "text": "I like everything! Amazing dishes and stuff!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRellrUkVUek5QVm0xWGJHSk1iR0YxY1ROT1FsRRAB",
            "text": "Great for a date! The service and atmosphere were incredible!! I would recommend 100%!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twc1FucGtiek5QVFZJeVQyNUVjMnhUVlVKdGJIYxAB",
            "text": "I don’t understand why this place has a high rating. The restaurant was noisy, the server didn’t understand what we wanted, and the food was overpriced than its quality. They used noodles that were obviously not freshly cooked. When I complained about that, they just rinsed the noodles to unstick them… The fried ice cream was almost a fried bread than ice cream. It again felt it was not cooked fresh. I was really looking forward to visiting this place, but I was very disappointed. I’ll never come here again."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMmNtWkxPVzFyYzJSeVNrMVZZMEpGVUZGTVZYYxAB",
            "text": "Pad thai was overly drenched in sauce. Was practically a soup of sauce. Also I ordered it with shrimp and they put jumbo shrimp instead of regular shrimp (despite the fact that jumbo shrimp is at the bottom of their list of add ons). it was also cooked separately from the pad Thai so it was fishy and unseasoned. and then they charged 15$ extra. Classy. Will not be coming back. This isn’t the first time they’ve tried scamming me and if you’re smart hopefully you’ll know better than to come here and WASTE your money on mediocre food and even worse service. The last time we were here they told us they were overbooked and the place was literally empty inside. And then they proceeded to seat us outside where some guys were doing construction and nearly dropped a hammer on my dad’s head. Horrible. Fishy food, poorly cooked, terrible service. I wouldn’t bring a dog here. save your money and go literally anywhere else.\n\nOnly redeeming quality is the place is very beautiful inside. But the charming exterior does not compensate for the abysmal food and degenerate scamming activities going on inside."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGS1ZWOURVVFZITjJkcVFWSnZNV05VU1VodVZVRRAB",
            "text": "Great appetizers!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200Mk9UZHlVbWxmY21SWVJEQjNkRTh6WDNaNGNtYxAB",
            "text": "great food and great ambiance"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdFNVSXpiblI0TkV4SFZ5MUVlVEJwVHpFMGJFRRAB",
            "text": "First off, this place is cool in the decoration department. I love all the floral arrangements and lighting. It's pretty without being too overwhelming (to me at least). Second, everyone needs to come here. This Thai/Asian cuisine is seriously some of the best I've had! I'm never disappointed when I come here. The sushi rolls are large and worth the prices, the soups are delicious, the fish is fresh—nearly everything on the menu is a good choice. The presentation is also gorgeous. Food pics are a must haha. Overall, this place is such a win and I love coming here whenever I'm around UES. 10/10."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxUFEzSmlUa3c1UTJadmNUSllabWx3TWpkd1dHYxAB",
            "text": "I recently had the pleasure of visiting Bau Restaurant in NYC after traveling all the way from Nashville, and I was absolutely blown away! The experience was nothing short of amazing. As someone who’s used to southern cuisine, trying something new like halal food was an exciting venture, and Bau exceeded all expectations.\n\nThe dishes were bursting with flavor, and the attention to detail was evident in every bite. It’s rare to find a place where halal food is prepared with such creativity and finesse, and the blend of traditional flavors with modern twists made for an unforgettable meal. The atmosphere in the restaurant was equally fantastic, with a cozy yet vibrant vibe that made the dining experience even better.\n\nOverall, I highly recommend Bau to anyone in the NYC area or visitors like myself looking for something extraordinary. Whether you’re a halal food enthusiast or new to it, you’ll be treated to a delightful culinary adventure. I can’t wait for my next visit!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxYVRHOWpabTh0TkVKYVNEVk1WWFE1ZW1OR1psRRAB",
            "text": "So fun"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201WFpWcHRRa1ZyYzBOWmNYbzRSMm8zWkV4R1drRRAB",
            "text": "Service is good atmosphere is great and good food ."
        },
        {
            "date": "1주 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Jd01TMXZhM3BHYjJkT1RubDBlVFY2VGs4M2VWRRAB",
            "text": "Très bonne adresse !! Excellente carte beaucoup de choix et beaucoup de goût en plein centre de Manhattan . Je recommande fortement :)"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxaVUzaGphMEZQYW1kMmFqUm1ZbXgyZDJKcWRIYxAB",
            "text": "Don't believe the 4.8 star review - it's obviously gamed by them. The food here is not worth paying for and is like something you can microwave. This place is built for Tiktok/IG and the bridge-and-tunnel crowd but not for quality. There is no reason to go here except maybe as a place just to get drinks. Just another NYC gimmick restaurant where you give them your money and don't get anything of value in return"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tneGJWUllaVmRhUnpsdWIyaGFZWE50WnpCbVlrRRAB",
            "text": "Awesome place! Always having a great time here!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWYVNIRndRelpJVDJsV1FYVXRjV3d0VjI1V05GRRAB",
            "text": "Super cute food spot! Loved panana curry and mango sticky rice!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNmVHMDBZa0Z4YldoVk5UVTRabG90UW1STlZYYxAB",
            "text": "Loved the service  came here on my birthday and got bubbles and lights loved the atmosphere"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201Q2VFVnVjRXBMYldSc2MyRjFaMlEwYXpsdlZWRRAB",
            "text": "Such a cute spot perfect for photos! We celebrated a birthday here and everyone was kind and even sang for us!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKd1gxUkZSelZCVldaSlluVkVPRFl5UmpaaGFrRRAB",
            "text": "I like the vibes it’s very pretty and perfect for pictures. Food is uniquely displayed and the portions are worth it for the price."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taWWNUQTRXV0ZyYnpGQ2JWUlRPVzh0ZVdGV2JrRRAB",
            "text": "I ordered pad see- ew. It was the worst l ever had and definitely not worth the price I paid. They shouldn’t even be selling it. The little I ate made me feel awful because it was full of MSG or whatever they put in it that made my heart race and made me feel fatigued. The food was like a drug. I will never go there again. How could they have a 4.8 rating. Buyer beware!!! EAT AT YOUR OWN RISK ⚠️"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xReFFtRXlUa0U1ZUdSQlExRlphVkExZW1GYWNFRRAB",
            "text": "Pretty good food, and the coconut was a real coconut!!"
        },
        {
            "date": "2달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GcVpsbHhjMUpKVUZkWFJIUkhORU5aZGsxYVEzYxAB",
            "text": "구글 리뷰가좋아서 메트로폴리탄왔다가 방문했습니다 태국에서보다 더 화려하게 플레이팅되서나와요 직원분들두 친절하구 음식들도 맛있었습니다 망고밥꼭먹어보구싶었는데 맛있네용"
        },
        {
            "date": "3달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoUFFrTmlWelJMZEhodWVtRldZM1JSUzJadE5YYxAB",
            "text": "메뉴 양이 많고 맛있습니다 직원들도 친절하고 초등학생 아이들 입맛에도 맞아서 맛있게 잘먹었어요 ㅎㅎ"
        },
        {
            "date": "5달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNbjFxYUczaVlha1NREAE",
            "text": "메뉴판에 타이 음식 일본 음식이 둘다 있어서 약간 의심했는데 진짜 대존맛입니당\n타이음식 점보쉬림프 팟타이랑 크리스피 삼겹살 볶음밥으로 주문했어용"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVME5YbmpRRRAB",
            "text": "메뉴가 엄청 많습니다.\n전 그린카레 라면 시켰는데\n맛도 좋습니다.\n가격대도 부담스럽지 않아 추천드립니다."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyX19MYVJnEAE",
            "text": "여기 맛있었습니다. 다음에 또 올 것 같아요 :)"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5cmF1Y0d3EAE",
            "text": "팟타이 맛있고 구글 리뷰 남겨주면 디저트 공짜로 아무거나 줘요!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OS1N6WlpUWG8zTW5wcmVESkVTVVpLVW5GT1VIYxAB",
            "text": "Really enjoyed dinner here. The space itself is beautiful — especially the floral room, which makes the atmosphere feel fun but also cozy. Service was friendly and the food came out at a good pace. The menu has a lot of variety, and everything we ordered tasted fresh and well seasoned. Prices are fair for New York. Definitely a good spot for a date night or casual dinner with friends. I’d come back to try a few more dishes."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxb2VHOUNRMUZYZUZKcWJpMXpjRkJ3TWtkQmIwRRAB",
            "text": "Second time coming here, and after ordering the same exact items, I can say the experience is consistently fantastic!!\n\nThis restaurant is an ideal date night starter. The music is tasteful and upbeat, but not too overwhelming. The atmosphere is very photogenic, with so much beautiful decor. Every drink and food item, down to even a simple shot, is presented with lovely accoutrements. While the seating is close to other guests, it is still very comfortable.\n\nHighlights for me include the beautiful drinks in fruit (my favorite being the Piña Colada, they can be with or without alcohol!), the fried calamari, chicken curry puffs, pad kee mau with crispy duck, pineapple fried rice with crab/shrimp, and massaman curry with beef belly.\n\nA couple reviews mention improvements to service, however as an Asian American the style of service seems, for lack of a better description, typical of Asian restaurant service.\n\nHighly recommend eating here!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kVE1DMTZSRU0zTnpWYWVWTm5SRXh4WDI5d2NIYxAB",
            "text": "The lychee ice tea was really good, and the drinks looked fantastic but the ramen was to so so. And the California rolls tasted like mostly mayo it was weird. We didn't dare order anything else to eat. Definitely a place for drinks though. The decor was pretty"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxa01tWllhMmMzWkMxa2FEbFFkVzVGWWpoV1RVRRAB",
            "text": "My fiancé and I were very excited to come and eat here, especially since he has a severe nut allergy and because Thai food is something he’s always had to avoid. We both loved our meals, and while the service could be a little better, it didn’t take away from our experience. The restaurant also has a gorgeous interior. Would definitely come back with friends and/or family, and is definitely a really nice date night spot!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201RVZsOUtUMlE0T1haRU5XOVNhRlZoTW1aMlRFRRAB",
            "text": "I went to Bua tonight and had such a fun experience! The food was a little above average—not the best Thai I’ve ever had, but definitely tasty. What really stood out was the service—our server was so attentive, friendly, and made the night feel special. The vibes are absolutely immaculate: great energy, stylish decor, and the kind of atmosphere that makes you want to linger.\n\nThe drinks are definitely a highlight here. They’re over-the-top in the best way—colorful, creative, and perfect for celebrating. Whether it’s a date night, girls’ night, or birthday, this spot makes the evening feel festive.\n\nI’d definitely come back for the ambiance and cocktails, and to enjoy another fun night out!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGeWVYSkVTaTExY3pSMFgzQnFjMlJIUVhBd1RYYxAB",
            "text": "I visited this Thai restaurant for the first time last week, and the atmosphere was even more beautiful in person filled with flowers and such a warm, inviting energy. The presentation stood out too. I loved that the pina colada was served in a pineapple, such a fun touch and perfect for photos.\n\nThe food was delicious my top picks were the sriracha fried crab and the crunchy rice with spicy tuna. Both were flavorful and memorable. The service was excellent as well, with friendly staff who really added to the experience.\n\nOverall, I had a great time here. It’s definitely a spot I’d recommend for date night or just a special night out."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201Tk9HMHlVa013TmxaNE9HNDRiRWxKUzBNMGFVRRAB",
            "text": "This restaurant was amazing! The food was so delicious. Definitely get the super crispy rice, the crispy duck buns omg and the pineapple fried rice with the crispy pork belly!!! Everything on the menu is delicious, you can’t go wrong! Also the drinks come in fresh fruit??? I felt like I was on vacation. The restaurant is beautiful and in a great location. Check it out!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJMWVuSlJVVkV6WDFadFpXZDJYMDlLWXpoa04yYxAB",
            "text": "This was my first time coming here and it was very cute out and insids the store , but my favorite was the insides seating because you get to see how beautiful inside is set with all the flowers on the wall while you walk through the restaurant. The drinks taste soo good. I loved the wings and the fried shrimp lache. I will be coming out again. The service was great and friendly."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGYVoxQlZkMUJTWDB4TlVVUnpjMjVMVm5reFdGRRAB",
            "text": "Bua Thai was absolutely delicious! Every dish was bursting with flavor — perfectly balanced, fresh, and so satisfying. The ingredients tasted really clean and vibrant, and each bite felt both comforting and refreshing. You can tell everything is made with care. Definitely a place I’ll be coming back to!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVd1MyRktlbWxaWnpGcVpGUm1VV3hsYUdGa1UwRRAB",
            "text": "I came here to celebrate my friend’s birthday after she found it on TikTok from a content creator featuring and recommending it. This was genuinely some of the best Thai food I remember having in my life, and I’ve loved Thai food for as long as I could remember. I enjoyed their take on Thai iced tea, where half of it is frozen. The chicken dumplings with the sauce were phenomenal! Then my pad kee mao with tofu did not disappoint! Everything from the sauce, noodles, vegetables, and protein were delectable."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psdk9UTm1Va3c0Y21wNFRWTk5NV2hyUVZGTVNuYxAB",
            "text": "Went to bua Thai Ramen and Robata grill for lunch with my family and trust me it’s a must visit place to go in New York\nRestaurant is beautifully designed!\nAmbiance is cozy and intimate!\nThai and Ramen dishes, a perfect blend!\nFood is flavorful and authentic!\nService is attentive and friendly!\nA great spot for a night out!\nVariety of options to choose from!\nBua Thai and Ramen, highly recommended!\nWill definitely come back for more!\""
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJV3k4Sm5mN18yVm93RRAB",
            "text": "We visited on a Thursday evening, and although the restaurant was packed, we were still able to make a reservation and get seated without too much of a wait. The space is quite small, so if you’re planning to come with a group, definitely plan ahead to avoid a long wait.\n\nThe decor is absolutely beautiful—charming, stylish, and thoughtfully put together. It really creates a great ambiance for dining out.\n\nAs for the food, it was just okay. If you’ve had really good Thai cuisine before, this might not stand out. We ordered the Tom Yum soup with shrimp and the Bua Thai fried rice with chicken. The flavors were decent, but the dishes were a bit too oily for my liking.\n\nOne area where they really shine is the drinks. The cocktail menu is creative, versatile, and the presentation is top-notch. They also have a sister restaurant in Brooklyn, which could be worth exploring.\n\nOverall, a visually stunning spot with impressive drinks, but the food was more average than exceptional."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOa1NWZHpZWGN6ZUhBd1RHbGxkR1ZEYmtGUWFHYxAB",
            "text": "Really good food here! Nice atmosphere and nice people. Higher priced items but so many different ones to choose from. Our party unfortunately did not buy any drinks because of how high the prices were, but they looked good.\n\nTheir presentation of the food is also really amazing aside from drink presentations. Everything you order tastes delicious. We liked the Calamari, Bao buns (shrimp particularly), shrimp pad see ew, and crispy rice with spicy tuna.\n\nTheir service was very slow for dessert unfortunately. It took way too long for us and it was about the same length of time as it took for our appetizers and meals to come out and be eaten. I would rate this altogether a 4/5. If we wanted to spend a lot and didn't mind, it would be fine."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SclQyVlRUeTEyVW5wWldubGZjbVV4T0ZSUlNtYxAB",
            "text": "Great Thai spot! The soups are absolutely delicious—flavorful, fresh, and authentic. They also have a unique cocktail menu that pairs perfectly with the food. Friendly service and a cozy vibe make it a must-visit. Highly recommend!"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKelRsOW1XbVZIV2xFMmJHZHdTbFJoUmtOMlpHYxAB",
            "text": "I had a bridal brunch here for my sister. The ambiance was soooooo good. The food was good and the service was pretty good. I made a reservation but there was still a little wait but all in all i was very impressed. Definitely will be visiting again"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUlNrMTNWWGRoTUdGUk4yZGljVk51V1ZvMFRHYxAB",
            "text": "Honestly, rating this place only a 5 seems like an injustice.  The atmosphere is absolutely amazing, so many fun details all over this establishment, and the food was just as incredible.  I stuck to the Thai food options, but they also offer sushi and ramen...so I'll have to return to sample more of their menu."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trMk4wZGFaMUpyZFhjMFlrMUdSRko2UW5WdE5sRRAB",
            "text": "We came on Sunday night. There was no wait today because it is raining today.  We always wanted to try this place, since it’s across the street from the subway station .  We had beef clay pot fried rice and thick noodle ( paw see ) and pork belly bun. Everything was very flavorful ,  but  my favorite was the clay pot rice.  It was so so flavorful and there was tons of beef.every bites has beef. 😂 My daughter loves the beef clay pot rice as well. I would definitely come back to try the rest of the menu.  We didn’t try the drink this time.  I would probably try some of the drinks as well, so the pictures on yelps looks very nice ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kc1gyWmxNMFZYTTJGcWNFZGFNbGwyY1V3MlEyYxAB",
            "text": "We had such an amazing experience at Bua! I ordered the Thai curry ramen 🍜 and it was absolutely delicious! My husband and I couldn’t stop raving about the spicy crispy tuna appetizer, seriously hands down one of the best we’ve ever had!\n\nThe drinks here are also next level, very creative, refreshing, and so yummy you’ll want to try them all. The vibe is warm and inviting, and the staff made us feel so welcome. Highly recommend this gem in NYC!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNWJtaGlOM2xHVDI5SFMwRmhNakZOTVRoV01XYxAB",
            "text": "This place is absolutely amazing. The service was very good. They were attentive and extremely patient when it came to ordering. As well they gave some very good recommendations on what would be good according to what we liked. Drinks could’ve been a little stronger for me. All in all though, this place has a very soothing ambiance and relaxing atmosphere. The food was 10/10. You wanna take your lady or date some where. This is the place to do it!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMT0xvOFhJaFBhQzhRRRAB",
            "text": "If you’re a Thai food lover, it’s a much visit experience.🥢🔥\nThe flavors are bold, the presentation is absolutely stunning. From the moment the food hits your table, you’re in for a treat — both visually and taste-wise.\n\nDon’t even get me started on the drinks… they pack a punch and hit fast! 🍹😉\nWhether you’re going for a chill dinner or a fun night out, the vibe is just right! 😍🇹🇭 (one time experience)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GeFYwOXZWa05HU0dWSmExRjNSM290UmpRemFtYxAB",
            "text": "I love my experience here. The servers are attentive and the food was amazing. I love the Claypot. Serving size are decent and the taro rules. My sister had pokpok papaya salad and it was perfect along with the pad see ew. Will come back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZOFBpcmhRRRAB",
            "text": "My husband and I recently visited Bua Thai Ramen and Robata Grill, and we absolutely loved the experience! We started with their signature mocktails, which were not only delicious but also served in real fruit cuts—so eye-catching! I had the Pina Colada served in a pineapple, and it was hands down the best drink I’ve ever had.\n\nThe food was flavorful and beautifully presented, and the ambiance was just as impressive. The spring-themed decor was bright, floral, and totally Instagram-worthy—it genuinely touched my heart. We ended our meal with their mango sticky rice dessert, which was simply divine.\n\nThe staff were attentive, friendly, and made sure everything was perfect throughout our meal. I would highly recommend Bua Thai to anyone looking for a delicious, memorable dining experience with great vibes. Can’t wait to go back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aVlFVZDNWMjFKYURJMmNIUkpPVmxUUTBGek1VRRAB",
            "text": "This restaurant is beautiful at first glimpse. The aesthetics are amazing and inviting. The food is prepared to perfection and is so rich in flavor. Everything was savory and made fresh to order. The server and rest of the staff were very kind - and knowledgeable and assisted in ordering the right entree for us. Next time I visit the city I can’t wait to come back here!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5R2IwSjRSa3hXVW1sNWVHOTFhWGgzU1VOUlJIYxAB",
            "text": "This place is hands down one of my favorite Thai spots in NYC! Everything I’ve tried has been amazing — especially the spicy crispy rice tuna (so flavorful and perfectly balanced with a kick!). The pineapple fried rice is a dream — sweet, savory, and beautifully presented — and the pad Thai with tofu is spot-on every single time. I also love drizzling a little Sriracha on top for that extra heat.\n\nTo top it all off, the fried ice cream is the perfect ending — warm, crispy, and creamy all at once. 😋 The service is always friendly, the vibe is cozy, and the food comes out fresh and fast.\n\nIf you’re looking for authentic, delicious Thai food in NYC, Bua Thai is a must-try. I can’t wait to go back! 💛🇹🇭"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kSk4xaHllV1JoTjFGV2FGRllibU5pU1hOVFlWRRAB",
            "text": "The atmosphere of the restaurant is beautiful, the drinks are gorgeous and creative. The dishes are super colorful, beautifully presented, and everything was REALLY delicious. Definitely coming back for a girls night out with my friends!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GU05ERnJRVXhLWTFKRWFtaGtablJzYmtsQlZuYxAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nAn unforgettable experience!\nBua Thai is one of those places that truly impress you from start to finish. The atmosphere is authentic and beautifully designed, and the service is absolutely impeccable — friendly, attentive, and professional. The food quality is outstanding, every dish is a journey to Thailand full of flavor and balance.\n\nThe drinks are pure art — definitely made for social media lovers and a must-order! 📸✨\n\nIf you love authentic and refined dining experiences, Bua Thai deserves a spot on your favorites list.\nThank you Bua — see you soon! 🙏🇹🇭"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4eFZIUkZibHBrYkZkNlJtUnFiVTU0ZDFKQlUyYxAB",
            "text": "Great atmosphere and food is as good as what we had in Bangkok earlier this year!! I'm glad to find this hidden gem during my trip to NY. We ordered Pad Thai with chicken breast and Pad Krakow with Shrimp and Blue Crab. They're both delicious 😋"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sVlRqWndablkzV1dWWUxXMXZWM2R0VmtocFFXYxAB",
            "text": "The food was absolutely delicious!\nFull of flavor and cooked perfectly. I ordered the Thai Ramen Basil, and it was rich, aromatic, and so satisfying. The staff was very attentive, making sure everything was perfect from start to finish. Definitely a place I’ll be coming back to!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pobVp6TjZOMlZwT1UxUlQyMWhiRGxxTTNKNVQyYxAB",
            "text": "Bua has an amazing atmosphere! The outside seating in the summer and fall months is especially great.\n\nI got the chefs recommended chicken leg Thai ramen with yellow curry and it was so tasty! The portion size was perfect for one person.\n\nWe also got the chocolate fried ice cream which was spectacular! Will definitely be coming back here again."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSTFZrcG1WbEJtZURrd1pEUndTMjVpVWtaQ1EzYxAB",
            "text": "Top 5 service in the city. What a great idea to fuse ramen and Thai cuisine together. If you don’t give this restaurant a try, you’re missing out. Worth the money and worth the trip. 10/10 food 10/10 people. Phenomenal."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGblpuSTVTa3RDUkRkd2VqSlZTUzFCT0hVeVVYYxAB",
            "text": "Pls avoid this place. We visited this place after a few years and the quality of the food has gone down the drain. The service is the only good thing.\n\nWe ordered the pad see eew and it was one of the worst dishes I’ve ever had. The veggies were stale and the broccoli had a rotten taste. It’s shocking that a Thai restaurant can’t do curries.\n\nThere are tons of other Thai restaurants in Manhattan, pls go there."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5WGNtVTJVVk5qVkRnd2JFZGZkbXAwYmpsa1JuYxAB",
            "text": "Their drinks are so pretty and taste good. Our server is so sweet and the store is beautiful as well. I will say their foods are just taste right and if you sit outdoor, you could also enjoy the manhattan views."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wUGFGWXlZelZMV0VKNUxVWnlNbVpWT1d4SlYwRRAB",
            "text": "This is a great place for a chill date night! My wife and I went recently and we had a great time.\n\nI had their Phuket Noodle Thai Ramen Soup with Crispy Pork and it was so freaking delicious. It was a really unique dish. Really creative and tasty. It had that great Tom Yum sweet, sour, spicy flavor with the lemongrass, makrut lime leaves, and galangal that paired really well with the ramen noodles and crispy pork.\n\nMy wife had their Crispy Duck Pad Kee Mao and it was equally delicious.\n\nThe drinks are served in fruit which is really fun.\n\nThe thai iced tea is served blended with ice which was a really unique and tasty to have it!\n\nThe decor was fun and floral.\n\nOverall really fun and great place for dinner. Highly recommend trying it!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNkstbXV3RRAB",
            "text": "Visited Bua Thai recently and had such a great experience. We tried the pina colada and watermelon mocktail to start — both super refreshing. The chicken dumplings and crispy chicken bun were packed with flavor and came out hot and fresh.\n\nFor mains, we had the shrimp fried rice and the chicken green curry ramen — both were comforting, flavorful, and really well-balanced. The green curry broth especially had a great depth to it. Ended with mango sticky rice, and honestly, it was the perfect finish — sweet, creamy, and just the right texture.\n\nEverything we ordered hit the mark. Great portions, beautiful plating, and solid service with beautiful ambience. Definitely a place I’d go back to."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aS1JUVTFOV1pLT1doRlZXUXlWRjgxYTFOdFdIYxAB",
            "text": "A stunning atmosphere of flowers and color, matched by an equally incredible menu of the most delectable Thai food. Each dish was show stopping in its own way, and everything was so delicious. When I was debating what to get, the staff was so helpful with their recommendations on top hits like the Ginger Soy Seafood fish. My favorites of the night included the Creamy Coconut Juice, the Thai Iced Coffee, the Crispy Chicken Bow Buns, and the specialty Fish. And the mango sticky rice was a fabulous way to wrap up the meal with a sweet treat! Highly recommend for your next upper east side visit."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kcFVuWlBWVmhmYTBKZlZFVjVUV2xoWlhORGFGRRAB",
            "text": "I went here with my family and the food was delicious! We ordered the lobster bun, curry ramen, and pineapple fried rice. The lobster bun was tasty with the spicy mayo on top and the lobster tasted so fresh. The curry ramen was flavorful and had generous portions of chicken. Lastly, the pineapple fried rice came in a half pineapple slice which was a nice touch. The place was nicely decorated and the staff were friendly. I’ll definitely be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNlpIaDNOR2hCUTFoUU1tUnhjbGxhTTFjMVNsRRAB",
            "text": "Bua Thai Ramen & Robata Grill is such a gem! The floral décor is absolutely stunning—perfect for summer and so Instagrammable. The staff is super friendly, and the whole vibe is warm and welcoming.\n\nWe went for Sunday brunch and ordered cocktails—the Organic Thai Mojito and a Lychee Margarita (my first time trying lychee in a cocktail, and now I’m hooked!). For starters, the Lobster Bao Buns were the highlight—soft, flavorful, and easily one of the best baos I’ve had. The Chicken Dumplings were also delicious and made a great appetizer.\n\nFor my main, I tried the Crab Thin Noodles, and it was outstanding—rich, comforting, and packed with flavor.\n\nOverall, this spot has the perfect mix of ambience, service, and food. Definitely a new favorite and a must-visit if you’re looking for a fun brunch spot with amazing presentation and taste."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tab05HZElaVFZYUW5aRldrOU9SVEpYVVRsVFJGRRAB",
            "text": "The decor is superb — we were amazed and took a lot of photos! The food was presented very nicely (so we took photos too)! Really love the ceviche and pineapple fried rice! The beef belly was cooked really well!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GcE0xOWphVFZuU2paek5FdDZiWEl0YkZaZk9GRRAB",
            "text": "First time at Bua Thai Ramen & Robata Grill and I’m impressed! I went to Thailand last year and have been searching for Thai food here in New York City that tastes just as authentic — this place comes close. I tried the clay pot, pokpok papaya salad, and pad see ew. Everything was flavorful and well-balanced, especially the clay pot fried rice. Great food, friendly service — I’ll definitely be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Bd2QydGxkakpCYTJ4T1EzbGlhMGhFZDJ4dE5WRRAB",
            "text": "The food and the service were quite excellent. The waitresses were very kind and patient. Chicken here is Halal. Had the green curry, kids had Ramen, and wife had Ceviche. Best Thai food in NYC for sure."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOdFFYWllYMHBuYVZSTU5rRnRNazFsYWtOSVZGRRAB",
            "text": "Decent place near central park.  It was a bit pricey considering the food is okay.  Crispy tuna rice was great but rest of the dishes were OK.  Staff was friendly"
        }
    ],
    "reviews_count": 97
}