{
    "name": "Chez Fifi",
    "place_id": "ChIJCZ6-33tZwokRIika4HJVD-o",
    "grid": "MN8",
    "address": "140 E 74th St, New York, NY 10021, USA",
    "rating": 4.2,
    "user_ratings_total": 115,
    "phone_number": null,
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOR0xUVTBUVlZEVEZONldXcHJkbVZtUkZBNVdWRRAB",
            "text": "If you’re looking for a dining experience that hits all the high notes: flavor, atmosphere, service, look no further than Chez Fifi. From the moment you walk in, you feel transported: the townhouse setting, the elegance of the wood-panelled dining room, and the buzz\n\nLet’s talk the Steak Frites: it’s a master class in simplicity done right. The steak arrives with that perfect crust, the juices still singing, paired with golden, crisp-on-the-outside, fluffy-on-the-inside fries that you want to keep dunking again and again.\nThe martinis are no afterthought, they make a cocktail crafted with intention. Clean gin, the right amount of brine, a blue cheese olive (or three) that carries its own swagger.\nThe service here is the kind you don’t always find—but absolutely want when you want to feel remembered and well-taken-care-of. On that note: a heartfelt shout-out to Markyia, the sommelier whose professionalism, graciousness and genuine helpfulness elevated the evening further. Whether you needed a wine pairing, a suggestion or just someone who knew the menu inside-out and made you feel seen, Markia delivered. It’s clear that the team believes service is part of the craft.\n\nThe atmosphere blends the formality of a classic French bistro with the ease of a modern New York dining room. You come dressed, you come excited, you come ready to savour and you leave fully satisfied."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xTWExVmxaMEl3VDJFNE1sVklOMWMxT1hGclRrRRAB",
            "text": "Amazing"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCeVF6UlJheTA0Vlc5blVFeHpWMVJOWVMxcVNFRRAB",
            "text": "Welcoming host. Decent French fare. The crab starter, roasted chicken, and chocolate mousse, all lovely. The tuna tartare failed to impress as their signature dish, but still good. The atmosphere is cozy, though loud, where we found ourselves having to shout most of the evening.\n\nUnfortunately, all of this was dampened by the strange experience we received from our waiter (tall man, curly hair), who singled us out and was less than welcoming from the onset. He not only failed to explain the menu but was incredibly uncommunicative at each encounter. Not a single check in or a smile the entire evening. This would have all gone unnoticed, if not for his excessively charming service shown to the tables left and right of us. To whom he explained the menu with incredible detail and attention at every turn. While we were left mostly to our own devices. This was only slightly made up by the efficiency of the assistant servers.\n\nWith so many restaurants in NYC that delivers excellent food with top notch service, there is no reason to patron/return to an establishment where anyone would be treated less than equal of others (and for no discerning reason). I hope Chez Fifi will prioritize their hospitality training to retain customers and not just focus on social media PR."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcU1GcHBNRGRuZVhkcVlUWnpZbE5xVUVac1ltYxAB",
            "text": "Chez Fifi – A Parisian Jewel in New York\n\nI’ve had the pleasure of dining at Chez Fifi twice now, and both visits reaffirm that this newcomer is one of the most charming additions to the city’s dining scene. The space itself is stunning—warm, intimate, and tastefully designed. The main dining room feels like being welcomed into an elegant Parisian home: cozy, personal, and stylish without being overdone. There’s also a small bar upstairs that adds to the allure, but it’s the atmosphere downstairs that truly transports you.\n\nFirst Visit\nOur first dinner set the tone. We started with frog legs and beef tartare, both beautifully executed, followed by Dover sole that was perfectly cooked—delicate and flavorful. A side of fresh string beans rounded out the meal. Service was excellent throughout; Alex, our server, was attentive, knowledgeable, and made the evening flow effortlessly.\n\nSecond Visit\nOn our return, the kitchen impressed once again. We began with a light salad, a bright and citrusy bluefin tuna au citron, and a rich, satisfying deviled crab.\n\nFor mains, the steaks were the highlight. The filet mignon au poivre was exceptional—tender, deeply flavorful, and enveloped in a peppercorn sauce that struck the right balance of creaminess and spice. It was paired with frites that were crisp, golden, and seasoned just right. The côte de boeuf, served with house frites, was a true centerpiece: beautifully seared on the outside, juicy and perfectly cooked inside, and bursting with flavor in every bite. It’s the kind of steak you remember long after the meal ends. Alongside, we enjoyed string beans and rice with clams, both adding freshness and texture to the table.\n\nDessert was a showstopper—the baba au rhum, generous and celebratory, soaked just enough to be decadent without overpowering.\n\nThough the main courses came out a bit slower during our second visit, the leisurely pacing gave us time to enjoy conversation and soak in the atmosphere, so it hardly detracted from the experience.\n\nOverall\nChez Fifi is a place where the details matter—beautifully plated food, thoughtful service, and an ambiance that makes you feel transported. Both visits left me eager to return. It’s the rare kind of restaurant that works equally well for a celebratory evening or a spontaneous night of good food and wine.\n\nHighly recommended."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OWVlXUmpjWEZhYnpKTWNHMHRlRkZmYjFkQ09FRRAB",
            "text": "This place is in serious need of hospitality management classes. We went for our anniversary and were seated at a dinky table upstairs. It might be a ‘cute’ thing if you’re in your late twenties, but not in your fifties. We were extremely disappointed with our treatment and left after 15 minutes for a Michelin starred restaurant that I had cancelled earlier to go to this overly hyped joint."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JM2NFZHpNWGxHTmtwQmEwZDVkRkpUTkhwM2RsRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\n\nDining at Chez Fifi was nothing short of extraordinary. From the moment we walked in, we were greeted with warm smiles and impeccable hospitality that set the tone for the evening. The ambiance strikes the perfect balance between elegant and inviting — chic enough for a special night out, yet comfortable enough to feel at home.\n\nThe food was absolutely outstanding. Every dish was crafted with precision, beautifully plated, and bursting with flavor. The menu offers a thoughtful mix of classic and inventive dishes, each showcasing the finest ingredients. Standouts included the perfectly prepared entrées, rich in flavor yet balanced, and the desserts, which were decadent without being overwhelming.\n\nWhat truly elevates Chez Fifi is the service. The staff was attentive without being intrusive, knowledgeable about the menu, and genuinely passionate about making the experience memorable. From wine recommendations to small thoughtful touches throughout the evening, the service team made us feel like honored guests.\n\nChez Fifi is a gem in the heart of NYC — a place where food, service, and atmosphere come together seamlessly. Without a doubt, this will be one of my go-to spots for years to come.\n\nMark Wagenberg"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSGRraDVSalJNTWpsVllURk5WRlJqV2t4ZlZFRRAB",
            "text": "A beautiful restaurant interior that reminds me of the inside of old luxury trains. The food is delicious French cooking that feels modern yet true to its roots. All of the dishes we had were delicious, the tomato dish stood out - the fries here are great too. Service was very good, attentive and professional without being too much."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5eFNFVnZVM0J6UkV4TU1tdFRRa05UYVVOeVlYYxAB",
            "text": "Wouldn’t serve us entrees at the tables upstairs cause they “are too small”. Food is good but won’t be back given the pretentious attitudes and terrible service. There’s 5 other French restaurants within a 5 block radius where they don’t treat you like this"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSlNESnZWRkUyUVhWVmRtcHFWblZOWTI4MlYzYxAB",
            "text": "12/10! 🌟 Chez Fifi is hands down the best restaurant in the city. From the moment the doors open and you step inside, it feels like you’ve left the hectic big city behind and walked straight into someone’s home in Paris. The music, the vibe, the food and drinks and the always welcoming yet professional staff all come together to give you the best possible experience.\n\nThe restaurant is named after the owner’s mother, “Fifi,” in honor of her memory. For those paying extra attention, you’ll notice decorations, art, and details throughout the space that come from the family’s own home. Even the menus have little hand-drawn illustrations that tell a beautiful story about Fifi and her family.\n\nThe food is always spot-on — not once have I been disappointed by a single dish. And there isn’t a day I don’t crave the crunchy Pommes Fifi, the steak au poivre with the tastiest au poivre sauce, the Txangurro, or the endive salad. Honestly, it’s impossible to pick a favorite dish , everything is so delicious so you truly can’t go wrong. For dessert, my go-to is the chocolate mousse and the fromage ice cream with huckleberries.\n\nThe cocktails are some of the best I’ve ever had. I love how they experiment with flavors and come up with exciting new combinations — each one has a magical touch that leaves you speechless. The wine list is just as impressive, with something for even the pickiest wine lovers who want to explore rare and special bottles.\n\nThis place radiates pure love and warmth. Whether it’s a casual weekday dinner, a date night, or a special occasion with friends and family, this is the spot. It has everything you could ever ask for — and it’s the kind of place you’ll want to return to again and again…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnd2JFRTNOalp1WTNWcVRsWlFOVGczWTNsM2NYYxAB",
            "text": "I’ve been wanting to try Chez Fifi since it opened, but it’s tough to snag a reservation. Finally stopped in on a Friday just for a drink, and the restaurant is absolutely stunning—classic, upscale interiors that feel timeless.\n\nThe bar is small, but the service was excellent. I ordered the tomato martini, which was lighter than expected with just a mild tomato flavor—not at all like a diluted Bloody Mary as I imagined. The blue cheese martini, however, was a 10/10—perfectly made, served with a pitless olive and a little side of blue cheese with honey. Such a unique touch.\n\nPrices are definitely on the higher side and the glasses are small, but it’s a solid date spot with a beautiful vibe.  Just for reference- the tomato martini was $31, and the blue cheese martini was $26.\n\nThe food looked amazing, and I’ll definitely be back for dinner."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCcWNVVk5XVXR4U21sTGIzTmFhMmRDWW1abFVuYxAB",
            "text": "Had the best meal at Chez Fifi. The menu is small but there is no filler. Every dish was phenomenal and the service and ambiance were 10/10 as well. The same group behind Sushi Noz knocks it out of the park again. There are so many new upscale French bistros open in NYC recently but Chez Fifi is a step above all of them. Can’t wait to return with a bigger group. Be sure to start with the Tomato Water Martini and have dessert and more drinks in the beautiful lounge upstairs."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twT1JWVlBTV05uVlRKVVNHcEJjVFJPWTE5Nk9HYxAB",
            "text": "The service here was 11/10, we had a party of 6 originally and they were accommodating when a couple dropped out and still gave us a beautiful big table. We didn’t feel rushed with a 6pm reservation which is unusual for nyc, had a great 2.5 hour meal. Giving three stars because the food was all just average - the tuna that was pictured is not what we were served, and the chicken was so dry. Steak was good but $20 more than all of my favorite french restaurants in nyc.  Overall there are other places I would prefer to go to for the price, and not worth $200-$300 pp. It’s great vibes if you are in the area and don’t care about value."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CV01tYzRVV1ZEWm5kbk9XRm1SRU5DVW5SdFZVRRAB",
            "text": "Great vibe upon arrival and moved upstairs to a very cool bar area for drinks. Service was great until we realized the Maitre D was a joke and hadn’t put our name on the waitlist when we checked in. One hour later came back to ask “can we put your name down for a table. It will be another hour.”\nTotally useless after we had spent $1,000+ on drinks.\nA real shame. We were looking forward to visiting this place. The rest of the staff were great but front of house is useless.\nUnlikely to go back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KUU0wUlhXWGwwU2tGRGRGUlVRV0pQUzBvMVduYxAB",
            "text": "Excellent, one of the few that lives up to its reputation"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xscU1sSXlRMDFaWmtSd05uTkZXbUZYVFdsdk1YYxAB",
            "text": "Been living on upper east side for 30 years. Best restaurant in town. hands down. Must try."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKbVZVcERhMEl3Y25wdWRuQmhWM1p2YkdnemFYYxAB",
            "text": "We had a wonderful time at Chez Fifi. Try to get a table upstairs, it is cozier and intimate. We shared a lot of different dishes, I highly recommend the Dover Sole prepared to perfection and the generous frog legs, less so the crab that was rather blend and the underwhelming cheese plate. The service was great throughout the meal, they went the extra mile to make our double birthday special and guide us through the Menu. Try both the tomato and the blue cheese martini, they are both exquisite and both are rather light in alcohol. Overall a great UES address"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTFkzZERMWEJvWTBKbFZHeGtPREUwYzNoMGRFRRAB",
            "text": "The food was fine; well prepared but not terribly imaginative. The service was excellent. But this was not a great meal as a $600+ ticket for four people (four appetizers, three entrees, a round of cocktails, but no wine) would suggest."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oVmVIZFVjVGd0VDJ4ZlpUSk5lVmREYmtsRmFHYxAB",
            "text": "Tucked away on a quiet street on the Upper East Side, Chez Fifi feels like the kind of spot you stumble upon and immediately want to keep secret. The dining room is warm and inviting, with soft lighting, wood panelling and comfortable chairs, reminiscent of an old world dining rail car with its long elongated footprint, brass accents and plush banquettes.\n\nThe menu leans classic French brasserie, with the expected favorites—steak tartare, escargot, frog legs, steak frites, oysters, and duck breast. While straightforward in concept, each dish is executed with precision but is both indulgent and refined. The blue fin tuna was one of the night's highlights with the fish coming from the same supplier as Sushi Noz.\n\nService here is professionally and efficient with an emphasis on turning tables quickly for the next guest rather than extended interaction. While courteous and polite, you wont find them inclined to establish any kind of personal rapport (unlike some other establishment in the UES).\n\nReservations are brutally difficult and will require a fair amount of persistence and effort to secure a spot in one the 40 seats spread across two floors. My one tip would be to have your Opentable page ready to go and to not be picky on time or date.\n\nFinally, be prepared to spend a significant sum for dinner. Prices are high and would strongly budget approximately $200/person including tax and tip."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0aGEzWm9kamxTWVZGelJEbDNabkJwWTB0Zk5HYxAB",
            "text": "Chez Fifi is one of those places you almost don’t believe exists in Manhattan. Housed in a charming pre-war building on the Upper East Side, it feels more like stumbling into someone’s impossibly chic apartment than a typical restaurant. The vibe is cozy yet elegant, with that effortless charm that makes you want to be a regular at.\n\nWe started with the seafood omelette, and the Txangurro, a nod to San Sebastián,  which you absolutely shouldn’t miss, followed by the Dover Sole. All dishes were beautifully executed and full of flavor. And don’t sleep on the martinis. Their curated wine list worths mentioning.\n\nIt’s definitely one of those spots you want to gatekeep… but can’t help telling people about."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CWU1ua3hhWFZxTlhGbFFYUmxWRTF6YzFKVlVFRRAB",
            "text": "The food and cocktail is insane"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxMFdFWmxWbXQwT0hCdGRXSklNVzkyVHpsUFRXYxAB",
            "text": "I recently celebrated my birthday at Chez Fifi with my girlfriend, and unfortunately, the experience was quite disappointing. We had a reservation at 9:30 PM but were not seated until 10:40 PM, which was over an hour late after the Maître D told us it will be a 10 min wait .while we wait the bartender was friendly .The service was decent, and the assistant server was very professional and friendly, which was the highlight of the evening. However, the food lacked flavor and presentation , and my cocktail arrived without even a slice of lemon or any garnish, and the presentation was not appealing. The floor was dirty with fries scattered around, the neighboring tables were not set up , and the manager didn’t even notice us as she was in a separate room eating. To top it all off, the air conditioning was not working, and we had a large fan placed right in front of our table.\n\nOverall, it was a very underwhelming experience and frustrating that after we told our disappointment to the server nobody came to apologies or do anything .\nServer disappeared and never came back so we left without getting birthday desert or a «goodbye» .\nI will not recommend it ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKcFlUaDNWbEV0V25SaGVWQkJYMnBWTXpoSFltYxAB",
            "text": "Great atmosphere and service! I found the food quite average. The pate was underwhelming / under salted, and the crab dish overwhelmingly buttery. Can’t say I would recommend compared to other French bistros in the city, especially for price."
        },
        {
            "date": "3달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201SWRWRjFNV1IxY25oVVpGWlhZVlZZUW0wNFZtYxAB",
            "text": "Si vous voulez payer 20 balles pour une portion de frites, faut y aller."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOWVRWTnhXbEZhZFdGcmRsOXZVRmMxV0RKclJFRRAB",
            "text": "Best restaurant we’ve been to in NYC. Service was incredible."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KR01rRTVRbTgwYVRGaGFXMUdUekF5Vm1OUWNIYxAB",
            "text": "My go-to place! the food is great and the vibes are unparalleled"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WcVRWQkxWV0Y0UzJ0b05rbHdSR3B3Ulc0MGRHYxAB",
            "text": "Excellent service and extraordinary food!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twNmIzRTBjVmh0VkRCNk1FWXRTVUowUkVnMFVrRRAB",
            "text": "This is such a special restaurant. Every detail, from the art on the walls to the masterful cuisine, is a profound and intimate tribute to the owners' mother. The red snapper, the poulet, the steak au poivre, the rillettes, the mousse, and the entire cocktail menu is forward thinking and still familiar. So excited to return."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NGExVlRTVVJ4UjIxRU9ERlhZalZJYXpOZlVXYxAB",
            "text": "Hands down the best meal I’ve had in New York this year. Supremely delicious, the nicest staff, and feels like a luxurious & exclusive dining room on the UES. The scallops, filet mignon and beef tartare were beyond excellent. Fromage blanc ice cream was the perfect conclusion."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUlkzQnpkVVpyVW1sckxYZElMWGhaT1dFd1ZuYxAB",
            "text": "A wonderful evening filled with a great ambiance, excellently curated wine list, and fantastic food and service.\n\nHighly recommend going to get a drink with bartender Alex R and hopefully you’ll get Dante as your server.\n\nGet the chicken, tartare de beouf, bluefin tuna, and crab dish.\n\nHave Alex R make you the blue cheese martini, get the French martini, and the Rose & Raspberry."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0Zk5ETm5jMjF5YTBOek1UVlpjblJ6YkdsamRYYxAB",
            "text": "Excellent food and service all around! Fun bar upstairs before or after dinner."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cVpHTTJXRWxZZW1SQ2VFcERZbVZFZFRkd1VGRRAB",
            "text": "I went here with trepidation due to some reviews and a general apprehension about NYC restaurants competing with their Parisian aspirations.  I am happy to report that Chez Fifi does a very respectable job of competing with the likes of Chez George or Voltaire.  From the start excellent toasted baguette accompanied by special butter and radishes. They just added a summer zucchini appetizer four ways which as great and the cucumber martinis top notch. Wild Dover sole is pricey at 148 but it’s a 2lb fish to share and in a light sauce. One of the best I’ve had and not swimming in butter as they serve it at The Grill.  Pommes Fifi are crisp with just the right amount of garlic.\nWe did not have dessert but 3 classics to choose from.  Service attentive and room narrow but not overly noisy.  The place is a winner and deserves it’s popularity!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poS2VtbFNMVlZwUjA4NU1HMDBVbFJPVWxReFYxRRAB",
            "text": "This place is unlike anywhere else in NYC - feels like you’ve been transported to another time and place. The menu is stellar - a favorite it the chicken (half or whole) that comes complete with the best potatoes and herby salad verte you’ve ever tasted. Worth the wait - try to snag a seat this summer."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21reGJXUlBWMWQzWWxaQ1FVdEdkM0pKTldkSFpFRRAB",
            "text": "Outstanding. Not sure how anyone could have negative things to say about Chez Fifi. Food, drinks, ambiance, and service are all 100.\n\nDrinks\nThe Blue Cheese Martini is basically drinking a cup of blue cheese and it is wonderful. If you're a blue cheese lover, order this. I was able to try 3 different wines by the glass and they were all great as well. Wound up going w/ the Chasselas which was perfect w/ our mains.\n\nFood\nEverything we ordered was a hit, absolutely no misses. There were three of us and we ordered the Foie Gras terrine maison, Salmon rillettes, Txangurro (Basque deviled crab), Bluefin tuna, Salad w/ yellow peaches, arugula, and Castelrosso, Riz aux morilles, Red snapper grile, and Filet mignon au poivre. It was truly the best steak Au Poivre I've ever had.\n\nIs it tough to get in? Yes. Is it pricey? Sure. Is it worth it? Absolutely."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSmRqSjVabWQ1ZW5adlpIVnJRbVE1T0d0cE4zYxAB",
            "text": "One of the best spots in the city right now without a doubt. The space itself is beautiful and super cozy. Upstairs there’s a bar room with couches and a more relaxed but still romantic vibe. The wine list is full of gems with a variety of age and at quite reasonable prices. The food is delicious and solid top to bottom. I’ve been in twice now for food and some of the favorites are the omelette that sees rotating components according to the season and of course the filet au poivre with fries and caviar."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WamFHdHpkRmxtWWpaMmJHdHJlakZ0VDJoRU1GRRAB",
            "text": "Just had such a fun and fancy night out with four friends here the other night! The wine list is unbelievably great and delicious, and the food was delicious and generously portioned! The chicken, escargot, and deviled crab particularly…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKS1B6YlhabDUySFN3EAE",
            "text": "Amazing experience! Staff is super lovely and provides great recommendations to guests with a really warm approach. Super fun to come in as a group as well as a romantic night for 2. Can’t wait to come back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMX0s4djJvOHZ2VHF3RRAB",
            "text": "A masterclass in modern dining — every dish is a statement, every detail intentional. Chez Fifi isn’t just a meal, it’s the experience. Elevated, bold, unforgettable."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25STVpFVnZTV3A2ZDJoVlUzSTBZVmxLT1RoR1JHYxAB",
            "text": "Bad service and snobby attitude total mismanaged place with forgettable expensive food"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQYUQ2WnZZaGRieG5RRRAB",
            "text": "Service is slow in an experience they don’t see people on time. Seems like all the hype has been bought and not earned."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VNZUMzNkxXNGJDT2ZnEAE",
            "text": "too expensive"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNdjhqTHFSNDdDbm5BRRAB",
            "text": "How to get in: we did a walk in around opening time, we had to wait 30 min for a table but we just walked around and came back. The restaurant is very intimate but elegant, very classic New York/ French. The menu is limited but almost everything on it is great. The upstairs is more of a fun vibe so I decided to sit up there. In a more lounge area where the bar also is. The crab dish was soooo good! We also had the salmon dish which was also wonderful. Even the bread and butter is so good. I loved the mango lassi drink and also the rose and raspberry gin and tonic. Our waitress was so sweet as well."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQdjFzcE9EcnZDTlpREAE",
            "text": "Downtown vibes on the upper east side.  The steak frites was amazing.  They have an upstairs bar room that is great for drinks after dinner.  Jirka the manager was really nice to us!!! I can’t wait to go back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VLU1o4NWplcS0tb1Z3EAE",
            "text": "We were so excited to try this new, hot restaurant. The interior is cozy and beautiful, with not many tables. There's an upstairs bar where you can also eat, which is lovely, and downstairs is the dining room, maybe only 10 tables.\n\nThe service was fantastic, but unfortunately, the food was very disappointing. We ended up sending three dishes back. The foie gras was tasteless and served with a stale baguette instead of thin toast or crackers, very unusual. The escargot was rubbery. The waiter insisted we try a crab dish, so we obliged, but it tasted like old sweat socks.\n\nThe Dover sole for two was filleted and served in a pan of butter broth. It was edible, but extremely disappointing. I've ordered Dover sole at every French restaurant I visit (my favorite was Le Périgord, now sadly closed).\n\nThe manager came over and was very gracious, but made a comment that the restaurant is probably not for us. I found that a little condescending, unless I misunderstood the statement. I don't think it's for anyone if they're expected to eat the dishes we were served.\n\nThe wines were delicious, and so was the chocolate dessert. Ordering steaks seems to be the more popular choice, but I'd go to a steakhouse for that."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKT3drdVRLeTZfYU13EAE",
            "text": "This restaurant is wonderful. The chicken for 2 is so delicious along with the most fantastic potatoes.. every thing on the menu is delicious, as well as fantastic desserts. They do everything well.\nIt transports you to Paris the minute you walk in!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VQcmRnWjZuOFB6UlB3EAE",
            "text": "Mixed review.. Honestly, the food and decor were excellent. We had the endive salad, steak, escargot, and a few other dishes—everything was really delicious. However, the service was lacking, which was disappointing given the overall quality of the meal.\n\nOur server, Kelsey, unfortunately made the experience feel rushed from the moment we sat down. At one point, she even came to the table and told us we had to hurry because she needed the table back by a certain time. We were half way through a bottle of wine and hadn’t even had the chance to look at dessert… She returned every few minutes, constantly interrupting our dinner, and gave what felt like a memorized script—every table around us got the exact same spiel, word for word.\n\nFor a two-top table spending $300+ per person, the service should be more thoughtful, and not rushed.\n\nAlso it’s unclear why reservations are so difficult to get online when the restaurant was half empty the entire time we were there on a Friday night. It seems like tables are being blocked to create hype, which feels contrary to the spirit of restaurant culture"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VLbmRnN2F6N29Ud2l3RRAB",
            "text": "DISAPPOINTING experience! Came on a Saturday night with a group of 5 and made a reservation for 9:30PM. We arrive 9:15 PM and are directed upstairs as the table is not ready yet. At 10:45 PM, we are finally seated.\n\nAt this point, we were already full off drinks and appetizers in the upstairs lounge but felt it rude to leave, so we ordered a few more appetizers to share.\n\nThe waiter made SNIDE remarks as he was surprised we weren't ordering more food at 11PM after making us wait OVER AN HOUR. The audacity of this restaurant and staff is beyond me.\n\nHow this place has good reviews is appalling. I will not be recommending this spot to anyone."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdU8zcEdREAE",
            "text": "Food very good I had a bad experience with the manager ! My husband leave and the refuce to server me food or drinks ! I Ben with paying with cash or card !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdUtIVDR3RRAB",
            "text": "Don’t go there ! Very bad !!!!!!! !tablel under my husband name ! When he leave، they refuse !  to serve me !  They have my card ! They said it’s not under your name ! Bonding no food for u unless your bushy and is there !\n\nfood  and drinks ! I’m from Kuwait ?!I flight 16\n\nmy first stop was there ! Very  bad  ! ! Ppl very bad !!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcGI3OFBREAE",
            "text": "Best in town for french cusine"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOXVqT0tREAE",
            "text": "The tuna needed more flavor. The crab appetizer was good, not great. The chicken was dry. The steak frites was great quality, but the sauce needed more flavor. The chocolate mouse was wonderful. Overall, this restaurant is good, just WAY overpriced for what it is."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRajdfU2NREAE",
            "text": "11/10. Incredible New Romantic French spot with nods of northern Spain. We were fortunate enough to walk in and get seated immediately. Service is unbelievable hospitable.\n\nEverything was superb. We ordered the escargot, saucisson, endive salad, filet mignon au poivre (with frites), and chocolate mousse. We started with cocktails and ended with red wine. Our server Alex swiftly guided us through the whole menu.\n\nWe can’t wait to come back. It was one of those special meals you treasure for months."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNTdMOTBRRRAB",
            "text": "Having lived in NYC for nearly a decade, with the past four years spent on the Upper East Side, I can confidently say this is the best restaurant in the neighborhood and perhaps in all of New York City. My husband and his family lifelong Upper East Sider agree wholeheartedly.\n\nThis restaurant lovingly named \"Fifi\" in honor and memory of the owners mom radiates warmth, love, and authenticity. Josh and David the two incredible brothers behind the restaurant have created something so special. From the impeccable service to the enchanting ambiance, everything about this place transports you straight to Paris.\n\nWhether you're celebrating a special occasion or simply looking for a memorable dining experience, Fifi sets the standard for excellence. I can't recommend it enough—it’s an absolute 10/10. I rarely take my time to write reviews ever but this one truly deserves it so much."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfc3ZTdXl3RRAB",
            "text": "With the rise of instagram famous restaurants and PR firms dedicated to turning mediocre food into perfect shots, it’s exciting to find a place worth the hype.\n\nThey say they are a love letter to Paris and San Sebastián and I can say they truly are.\n\nThe frog legs were buttery and flavorful, and the drinks - a solid 10.\n\nThe beef tartare was the best I’ve ever had - I actually wholeheartedly mean that.\n\nI didn’t love the espresso martini, but I’ll let that go because of how amazing\n\nEndive salad was a little sweet - however with the beef tartare it was a good pair.\n\nFilet was also incredible, it’s a pretty standard dish but they do it very very well that I do think it’s worth ordering here\n\nAlso as a self proclaimed connoisseur of bread and butter I can confirm they have it down.\n\nPs Jamon is average (although, had these insanely good nuts with them?)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRazlLUF93RRAB",
            "text": "Our experience began on a disappointing note, with a cold and rude reception from the host, being seated at a less desirable table despite other options available, which dampened the mood for our special occasion.\n\nThe food had its highlights: the endive salad and crab were excellent, the steak was tender yet not the tastiest and I would have preferred more poivre in the sauce. The bass was absolutely bland. Desserts were a mixed bag— the chocolate mousse was exceptional, but the crème brûlée lacked flavor and a proper crust. At $200 per person, I expected more in terms of both service and value, though I acknowledge the limited restaurant options in the neighborhood."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBOGYtMEpnEAE",
            "text": "I know it is rare but the MaitreD Pierce was able to seat us in the bar salon upstairs without a reservation on a busy night. Best fries we have ever had in our life!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2M282Smx3RRAB",
            "text": "Chez Fifi is a fantastic new spot for impeccable french dining on the upper east side. The crowd is elegant, the food menu is limited but delicious, and the ambiance is cozy but elevated. So grateful for my friend who managed to snag a reservation despite how difficult they already are to get your hands on!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfaWQ2UWNREAE",
            "text": "Chez Fifi feels like stepping into someone’s home. It is warm, cozy, and it’s got just the right mix of elegance and charm. The lighting is perfect, the vibe is beautiful.  It feels like an extension of a dining room in an Upper East Side brownstone.\nThe cocktails are superb. I loved my rose and raspberry gin and tonic, and the rhubarb cocktail  had a rich foam and a very full flavor. The endive salad with dates and mint dressing  brought crisp flavor and contrast between the rish texture of dates and freshness of the mint.\nChez Fifi is full of heart. The owners have poured their love  into this space, honoring their  mother in every detail.  You won’t want to leave.\n\nGetting reservations is not easy but, trust me, well worth it."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcFp2dkRREAE",
            "text": "I came in with very high expectations given all the buzz surrounding this restaurant—and to their credit, they’ve clearly done an excellent job with PR. While some aspects lived up to the hype, there’s definitely room for improvement.\n\nFood: ★★★★★\nThe food was outstanding. Every dish we tried was made with top-quality ingredients and executed to perfection. No complaints here—just beautifully crafted plates from start to finish.\n\nVibe & Décor: ★★★★★\nThe space is small and intimate, with classic, elegant decor that creates a cozy yet upscale atmosphere. It feels special the moment you walk in. That said, we were seated at a table near the front, and every time the door opened, a cold draft came rushing in. For next winter, a set of double doors would make a big difference in maintaining the comfort of the space—definitely something to consider!\n\nService: ★★★☆☆\nThis was the biggest letdown. For a restaurant with only 10–12 tables, the experience felt oddly impersonal—more like a large, busy venue. Dishes took longer than expected to arrive, the sommelier wasn’t particularly helpful, and overall the staff felt a bit inexperienced and not especially warm. At this price point, I’d expect more attentiveness and polish.\n\nWine List: ★★★☆☆\nThe list is extensive, but it leaned heavily toward bottles priced over $500. It felt like only a small fraction were under $200, which makes it tough for those wanting a solid bottle without breaking the bank. We had a $175 St. Émilion that was just okay—not memorable. A bit more balance here would go a long way."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOWZ5R3J3RRAB",
            "text": "My husband and I went this evening for our 14 year anniversary. Oh my gosh, everything was amazing the decor, the ambience, the food and the people working there.  It is very cozy and romantic They are so nice, friendly, caring and accommodating. We had a great waiter Dante.  The snapper was delicious and I highly recommend the French martini He really took the time to go out of his way to accommodate us, especially my husband who is vegetarian.  Barbara the hostess was so nice. She greeted us with a smile and was very accommodating in seating us. Jesse brought over a dessert and said some encouraging caring words to us for our anniversary. Everyone there is amazing. I highly recommend going to this restaurant."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2X2JERUlBEAE",
            "text": "Chez Fifi is so good, it is so exciting to have a restaurant like this open on the UES. The service, cocktails, and food were amazing, comparable to many of the Michelin Star restaurants in the city, and the interior is cozy and chic."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcDdtQmZnEAE",
            "text": "The most frustrating part about this new “French” restaurant is that they are trying really hard with the PR and lack of communication to create a sense of demand (there is no phone number to call to change a reservation and they don’t respond to emails or IG chat messages when one needs to change an online reservation; plus I think the online scarcity of two person tables is done to  create demand — for months the only online availability was for tables of 4). This horrendous treatment doesn’t improve in person. The bartender was the most clueless person staring at me like I had 4 heads when I asked him to recommend something. The drink he ended up recommending was a watered down Paloma for $30. The waiter couldn’t pronounce Chez when greeting us with “Welcome to Chez FIFI” (he belted out Chaise instead and repeated that twice). The food and decor fortunately made up for all the rest. Overall, however, I felt that I was at an overpriced gimmicky establishment trying to pass as French. $200 per person later, I dont think I will be back unless management makes some major changes. I’d be willing to reconsider my review then. There are other great options for authentic French food and atmosphere than this that wont break the bank.  Looking around, I also noticed it mostly attracts out of towners. I just don’t think New Yorkers will keep coming back given the situation.\n\nPros: beautiful, intimate decor in a small townhouse setting; unlimited warm bread on the house; delicious filet mignon with crispy fries; perfect glass of cote du rhone.\n\nRecommendations: train your staff and get a new bartender who understands customer service and mixology; bring down the prices or at least consider adding some affordable dishes to balance things out; hire someone to answer phones and reply to messages. And stop with the whole scarcity gimmick."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cmR5TTlnRRAB",
            "text": "We walked in on a weekday evening around 6 and were able to be seated upstairs. We didn’t get a “real” table (got two small cocktails) and sat along the wall and faced out - nbd.\n\nCocktails were delicious! A bit pricey at $26-31 each.\n\nWe enjoyed the crab appetizer, radicchio salad, fries and chicken entree. The chicken which comes with their signature potatoes and a green salad. We def didn’t need the fries but didn’t realize when ordering. The chicken was juicy and flavorful - portion a bit small for $80+."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnOE1QajFnRRAB",
            "text": "I dined at this new French restaurant last night, and it was amazing! The food was delicious, and the ambience was perfect for a romantic dinner. So sexy and intimate. The servers were so friendly and attentive, adding to the overall fantastic experience. I'm so happy this spot is in my neighborhood. Highly recommend!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdllfc0Z3EAE",
            "text": "So glad I stumbled in! The decor was incredibly beautiful and everything was delicious. I will definitely be back!"
        }
    ],
    "reviews_count": 64
}