{
    "name": "Bohemian Spirit",
    "place_id": "ChIJZd1h-MBYwokR0Ek-F4_Sep8",
    "grid": "MN8",
    "address": "321 E 73rd St, New York, NY 10021, USA",
    "rating": 4.5,
    "user_ratings_total": 658,
    "phone_number": "(212) 861-1038",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUE0yNHlNVUZxTTJGMGNGZEljRGt3VmpKM1lWRRAB",
            "text": "A real gem on the upper east side. The food is excellent - while we didn’t eat this trip we’ve had the schnitzel in the past. The beers are special - czechvar is a very special, hard to find lager that only select bars will get. Glasses are cleaned and served in the authentic Czech style - via Lukr pour and washed by hand, to ensure the temperature is not too hot to warm the beer and there is no soap residue. The staff is friendly, kind, inviting. This is an incredible place to eat and drink and we’re so lucky it’s right here in Manhattan!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214bE9FczNWRm96TVVwR2FrRkdPWEZ4TjNOb04wRRAB",
            "text": "I save room in my budget specifically for meals here. Fresh meals at prices that make you happy. Employees provided exceptional support during our meal. The flavors here are noteworthy. This restaurant should attract repeat customers."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twMVJHTmpTVlJyYmtzdGIxOUpTVXd5YTBKTmIxRRAB",
            "text": "We heard about this restaurant on social media and had it saved on our to go list for a while. We had never had Czech food and they're the only Czech restaurant in Manhattan. So, we finally decided to take the 1 hour trip and try it out for our date night.\nStaff was helpful, warm, and friendly. They answered all our questions and made sure we felt confident about everything. Restaurant itself was clean and inviting, the bathrooms were kept up and everything was good.\n\nWe ordered the goulash, jagershnitzel, sviekova, a Czech beer, and fruit pudding for dessert. Unfortunately, both of us got pretty sick by the next morning. I'm not sure if it's just the cuisine itself since we'd never had it before and maybe it was heavy on our system or if something maybe wasn't cooked properly and we didn't catch it since we're not familiar with the dishes. I don't want to point any fingers, because we truelly don't know but this ended up not being a fun experience. I tried calling the restaurant to just let them know, but the line goes to voicemail. We're still recovering from our visit, I personally haven't been able to leave the house because it's been that bad. Not really the experience we were aiming for."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paQ1RuVXdRMGxaTVhoRmVGWXhTREpvYUROeVJsRRAB",
            "text": "The initial impression cemented my loyalty. The food impresses and the bill seems fair. The prices are elevated, but value exists in certain items. This standard of attention is hard to find these days. You'll enjoy this restaurant - I'm happy I tried it."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paTGFGTTRWMmR0YmtReFZtTmtPRWxtWDJGaUxVRRAB",
            "text": "Yesterday I ate there with friends for the third time. My grandmother was Slovak, so I grew up familiar with a closely related cuisine. Bohemian Spirit is the real thing. Three of us had the Potato and Mushroom Soup, a generous bowl, rich, hearty and delicious. My main course was Jagerschnitzel. The meat was so tender I cut it with a fork, and the mushroom gravy was indescribably good. Two of us split the Crepes for desert, which were light and filled with fresh fruit, complemented with whipped cream and a scoop of vanilla ice cream. Sinful but delicious! On a previous visit I've had the Kielbasa with a side of Potato Salad, both of which were excellent. They have several Czech beers on tap. My favorite is Brouczech Dark. The quality of the food has been consistently high during each visit. Service is courteous, but plan to spend some time here. They carefully prepare everything to order, and it's worth the wait. If you love Eastern European cuisine, this restaurant is outstanding."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KUVlYaElSak5EVjJSb1JUbFpNRU5WUXpoMVpWRRAB",
            "text": "Amazing service, the beef goulash is the only thing that comes close to the real thing this side of the Atlantic! I go every time I can!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FNE9FeE5TVTFMV0VzNFZHOHhZVk5qUkVsSFNVRRAB",
            "text": "Really nice restaurant/bar with friendly staff and very good quality imported Czech beer. Nice and atmospheric, with lots of Czech homeware and old photographs."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGd1IyWmtUM3B5U21VM2Iwb3Raa2RXU0VwTFFtYxAB",
            "text": "I'm still dreaming about my meal at Bohemian Spirit! Pleasant staff interactions. The meals maintain quality and the atmosphere enhances dining. The spot features thoughtful design and cleanliness. I feel comfortable recommending this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOc2IwdG9hVkJLZGtWU1EyY3phRjk0VDFWbGFtYxAB",
            "text": "The goulash was fantastic! Worth the visit."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBeE5YcEdOSFozV1dGTFRHUTRPVmRXYW5kS1dsRRAB",
            "text": "A real gem on the upper east side. The food is excellent - while we didn’t eat this trip we’ve had the schnitzel in the past. The beers are special - czechvar is a very special, hard to find lager that only select bars will get. Glasses are cleaned and served in the authentic Czech style - via Lukr pour and washed by hand, to ensure the temperature is not too hot to warm the beer and there is no soap residue. The staff is friendly, kind, inviting. This is an incredible place to eat and drink and we’re so lucky it’s right here in Manhattan!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201eFJuaHVSVmxUWWpSbFRrSTRTRkZ5WlhKRmJtYxAB",
            "text": "Great restaurant. Good food, authentic enough as far as I can tell. Good and fresh beer. Even service is authentic - definitely reminds you that the word 'service' was not known in Czech in 90s."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CNVltRlNNRGQyWXpnd1JuSjZWbWMwT1RkVVJXYxAB",
            "text": "The atmosphere was very authentic to eastern Europe. Very generous food portions."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNFQweEpjakJwUzJaM05uWmhMWEpCVEhOUk9FRRAB",
            "text": "Amazing, very authentic food with generous portions (NJ suburbs sizes) 😄 I loved the goulash and the palachinke dessert. Worth the trip if you are looking to experience authentic European cuisine"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zNE5sSklWMWxxUzFkNGNrcDFVSGxRYlVOeFZtYxAB",
            "text": "This is a fun place, but dinner was hit and miss.  The duck confit with red cabbage was delicious, but the salmon disappointed.  Service was OK at best, and it was a nice dining experience.  We will probably not return, as the quality of the food was uneven.    I think this might be the perfect place for a beer and a bite."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vd1N6UkVUV1JGUkZFMU4yZEJhMHRmYkdFMWIzYxAB",
            "text": "When I stepped into Bohemian Spirit, I felt like I had been teleported straight to the Czech Republic. The interior design is spot on and really captures the atmosphere. I ordered a Pilsner and wasn’t given water, which actually made me laugh because it reminded me of Prague, where beer is cheaper than water 😂. I also had the goulash, overall it was good, though personally I felt it could have been a little better. Still, the experience was enjoyable and worth checking out."
        },
        {
            "date": "1달 전",
            "language": "cs",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0U1RYbHRWbFp3UW5WQ01FVmxOMVpvU0hWWldrRRAB",
            "text": "Po cestě po New Yorku jsem dostali chuť na domov tak jsme zašli na českou pujdu super"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOc2NXVnFRWGsxTTBwTWVqSktObGxPUzJwSE9YYxAB",
            "text": "Great vibe!"
        },
        {
            "date": "2달 전",
            "language": "cs",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taNFEwWXpiR280TmxsSlltNTVUbVYxUzNGbVVuYxAB",
            "text": "Zdravím pana majitele. Super restaurace s kouskem Česka. Jídlo je lepší než v některých českých restauracích. Děkujeme ještě jednou. Zdravím z Karvinska (Baník Pičo):-) a Olomóca."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GMFpETm9TRUppTURRNWVXdG1RVll6UWtZMFkyYxAB",
            "text": "The food was very good and the service was excellent."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVGJuVkNjSFpwT1VkR1JGcE5aMW8zVGpFelNVRRAB",
            "text": "I'm giving this restaurant a top rating even though I barely ate anything - the person who made the reservation didn't know I was vegetarian. Nonetheless I had a great time, as I love experiencing cuisines that I've never been exposed to, and this time, it was Czech food. We were a party of 7, all carnivores except for me, all drinkers except for me and my husband, and one of them is a beer connoisseur, so I learned that Pilsner, a pale lager, is the most famous Czech beer. The only option on the menu for me was a selection of salads, and I opted for one of my favorite vegetables - beetroot. Their servings are quite generous, and according to my fellow diners, the taste was impeccable. They ordered a lot of beer, and together we ordered a lot of food - salads, appetizers, mains, breads, and desserts. It's a large space, its walls covered with photos and objects of antiquity. One can definitely go around like in a museum and learn a bit about the history of Czech immigrants in New York City. If you love hearty meat dishes, exotic flavors and great beer, this place is definitely for you!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWaE1rTkdZbGhIWmtaa1FsbFZWUzAxWkhsUVJVRRAB",
            "text": "Best food & beer in USA\nA trip back home! ❤️ 🍺"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFMFVqSkVTVkZUUlc5RFEyaHNTR2N6Y1U5MGFWRRAB",
            "text": "Stumbled upon this place; lucky find.\nGreat Eastern European food:\nI had kielbasa, sauerkraut, and a chilled vinegratte salad. Crepes for dessert. Very good.\nService pleasant and timely. Quiet place, nice location. Clean and decorated with window plants.\nGive it a try."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kc2JVOTVjR1JKUTI1emEyTkxPV2RmV1VReVpsRRAB",
            "text": "This review is just about the apple strudel. We’ve visited many times before and have always enjoyed the food especially the fruit dumplings dessert so today we came specifically for dessert and decided to try something new. Unfortunately, the apple strudel was a disappointment. It tasted a bit stale, wasn’t served warm as stated on the menu, and at $17, especially given our previous great experiences, we were hoping for at least something decent."
        },
        {
            "date": "2달 전",
            "language": "sk",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205S1JFcGljWEpRZDJaYVdXVkdhRzlSTVRGcFkwRRAB",
            "text": "Obsluha a atmosféra je TOP , ako aj jedlo a drinky! Dali sme si Tatarák, ovocné tvarohové knedlíčky, čapovanú Plzeň a Veltlín! Chuť \"domova\" v NY je k nezaplateniu! Po mesiaci strávenom v USA som si dal konečne poriadne čapované pivo! Odporúčame všetkými 10!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKaVdFSlhVM0JrYVU1Uk1qVlBSa3N5VEdkVlVWRRAB",
            "text": "Went here for dinner and it was AMAZING! The Jagerschnitzel was super delicious and we got the prune buns for dessert.\n\nThe prune buns were HEAVENLY. I’m still thinking about them days later… Please never take them off the menu!\n\nStaff were nice and the restaurant decor is adorable. Can’t wait to go back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkQlVqbFFkakZXWW5WdGRHWmlialZrVW1wUVZIYxAB",
            "text": "Not the best Czech food in NYC. As a Czech myself I continue to be disappointed by the quality of the food here. Beer is good. Atmosphere is great. Service is not bad either. Get a better chef, people, so I don’t have to go to Astoria for some good Cech food.  Please!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xNWJYaERaWHBLUzFKbVZGbERaVmhuVHkxbVdYYxAB",
            "text": "This spot is part of my family visit tradition. The place works in this location. Staff accommodated our family's varied dietary needs. Their dishes obviously use just-harvested ingredients. This place has unique qualities."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SdFZFTmtaMFpOUTBkdlpIWmxkbWRuUm5OTFNrRRAB",
            "text": "Came here first time yesterday evening for diner. Glad I found this place! As someone from a similar culinary and cultural background ( Poland ) it is so hard to find good, Central European restaurants in the city. The interior of the restaurant is so quirky and unique, the kitchen is downstairs, you can see the chefs preparing everything if you need to use the bathroom, which is nice, IMO. They’re not hidden in the back where you don’t get to see them.\n\nAs for the food - absolutely delicious! Its heavy and hearty, so if you have a good appetite, come here hungry! I had the chicken liver pate and the angus beef gulasz with bread dumplings. I couldn’t finish it cause I was full! I had 2 slices of the dumplings ans 4 pieces of beef and I was full! The dark beer was good too!\nI will definitely be coming back here! You got yourself a repeat customer!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCQ00wRjRlR0UwZG5kM00xazFNazVGTWxWa1NsRRAB",
            "text": "This place is so incredibly mid. Maybe Czech food is just bad but the service wasn’t good either"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNMlJEQnhSVmxNYzIxdE5rUXRlazFrYVdKM1YzYxAB",
            "text": "We really enjoyed this place. The service and the food were spot on. We loved the photos on the walls. We will definitely be back."
        },
        {
            "date": "4달 전",
            "language": "sk",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wS1pVNVJWRlUwUlhscE9GWjRYMDVUTkRBellWRRAB",
            "text": "Rindgulasch 1a.\nHovezí guláš jedna báseň."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNQ2I3NGY2emRtVjVRRRAB",
            "text": "Since there’s no decent Hungarian restaurant in the city, I always appreciate other Central European cuisines. Food is great overall, some dishes can be a hit-and-miss.  Czech beer on tap, slightly grumpy service (adds to the authenticity), hot goulash soup (gulyás for us) with fresh bread and I’m happy."
        },
        {
            "date": "5달 전",
            "language": "cs",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNdUowX2Vxdk02YlBnEAE",
            "text": "Really...the best! Fakt nejlepsi. Svíčková was amazing."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZLUtiY2JBEAE",
            "text": "Looking forward to visiting a Czech restaurant in Manhattan as a Czech family on vacation in the US, it was a clash with a Czech reality compared to the service provided in other restaurants on this island. The food was good, as was the Pilsner Urquel beer on tap. Unfriendly service that makes you wait until you quickly find your place, pay and leave. The price level (more expensive) also does not correspond to the location or to other restaurants in Manhattan, especially when it comes to the service provided."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvc2NiWjN3RRAB",
            "text": "Cool spot. Beer is nice and cold. Schnitzel is great. Other food is solid. Wish it was more of a fun vibe."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMzlPczNRRRAB",
            "text": "I didn’t feel like I was in NYC. I was transported to Eastern Europe in so many ways and loved my meal here. The roast pork and sauerkraut were so good! Amazing service. Can’t wait to go back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbjhyeWp3RRAB",
            "text": "A bit disappointed especially having lived in Czechia. Beware they close the kitchen early. It says on Google they’re OPEN, they are not!…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaVlUVzF3RRAB",
            "text": "Excellent Czech comfort food. Warm, friendly ambience. Fun Czech decor. Courteous waitstaff. Spotless restrooms. Interesting, tasty Czech wines. Beef goulash is outstanding lots of tender beef, no potatoes, great sauce. Cucumber dill salad is light, refreshing. Veal schnitzel is good but maybe not up to Austrian excellence. Apple strudel is phenomenal - no delicate french crispy pastry but thick layers of apple slices with raisins wrapped in thin pastry.Michelin put me on to this place and i heartily recommend it."
        },
        {
            "date": "7달 전",
            "language": "cs",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3d0tlRmpnRRAB",
            "text": "Asi nejhezčí česká hospoda v zahraničí 👍…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MDdmTjJ3RRAB",
            "text": "goulash is the best of the best😭👌"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURna29ldlFnEAE",
            "text": "We found this restaurant on the Michelin guide. The restaurant was fairly empty, we were there a couple hours before they closed and it was snowing. The service was 10/10. The food was new to my husband and I, but we enjoyed every meal. We were offered suggestions of things to try from the server, we ended up ordering 8 items. The stroganoff was especially good we ordered open to go."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBXzdUUUpnEAE",
            "text": "Stopped by for lunch and a drink after walking through Central Park, and I enjoyed both the food and drink immensely! The experience took me right back to Praha. A great spot for a relaxing break—I’d definitely stop by again."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfamJ5Vld3EAE",
            "text": "Great experience all around. Authentic Czech food, nice selection of Czech beers on tap, a cozy atmosphere, and attentive staff. Don’t forget to order the strudel!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfaWNiMWpBRRAB",
            "text": "I think this place is overpriced. The interior was nice and food tastes good overall, but disappointed with portion sizes especially for the price.  I will say however, that the fruit knedlicky were delicious.\n\nAlso, I was sad to find out the staff really didn’t speak much Czech, a little surprising since it’s next to the consulate."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMnVXQl9nRRAB",
            "text": "What an unexpected gem! Very cozy, authentic place.\nThe food was very good, service is on point. The restaurant is not crowded,  good amount of space between the tables, so you can keep your conversation private.\nHighly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfb05ieDN3RRAB",
            "text": "Authentic Czech food in New York!  It is probably slightly adjusted for American tastes but found it even better than some places in Prague.  Great goulash, bread dumplings, and my favorite dish the Svickova!  Must try if you want Czech food"
        },
        {
            "date": "9달 전",
            "language": "cs",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmZ2VLUGxRRRAB",
            "text": "K jídlu nemohu mít žádné výtky až na naučtování 20%tipu za naprosto nepřijemou obsluhu. Jedná se o postarší paní s blonďatým mikádem. Jakkákoliv komunikace s paní byla naprosto nepřijatelná  a vypadalo to jako by radši měla podnik prázdný.\nRozdělení účtu byl taky příšerný problém.\nPokud vám nevadí utratit za tatarák 1200 plus nezapočítané 20% dýško tak přijďte, my už určitě ne."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmd3FfVldBEAE",
            "text": "Good food, good service, ok price"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeHEyRXlBRRAB",
            "text": "Hidden gem"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MzhudThBRRAB",
            "text": "Truly a magical place just steps away from home! We always walk by it and wanted to visit, and yesterday was our first time there celebrating my birthday. I'm a christmas baby born on Dec 24th so we weren't sure if they would serve us late on that day. I was in Prague just once in 2012 and loved their most famous and the oldest restaurant right on the central square. Since then I dreamt of trying Czech food again — confit duck with knedliki stole my heart. Just like in good old times but even better. Paired with dark beer — heaven! Steak tartar is top notch and close to be called best I ever tried. Deserts are great too. Aside from food, we were surprised how quick and attentive the servers were to us, despite it's Christmas eve! The atmosphere is hard to describe in photos — it's just so cozy and warm, making you feel right at home, not requiring you to look or act a certain way. I can highly recommend this place and sharing some photos and videos for everyone in doubt. Will be back soon!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqa0pLQjVnRRAB",
            "text": "You'll love this restaurant for its peaceful atmosphere, making it easy to chat without competing with loud music. And the portions are huuuuge! Even the soup starter could fill you up. While the service gives you space to enjoy your meal without constant interruptions, you might have to wait a bit for your water to be refilled. But despite not being perfect, it's definitely worth coming back for another visit! And who/what is perfect?! (Rolling eyes!!)\nBy the way, they have the best Brunch in the neighborhood and it's very well priced with 2 drinks included."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMXZQdkl3EAE",
            "text": "This was my first time trying Czech food. The restaurant is located on 73rd Street between York and 1st. I absolutely loved my food experience. We ordered duck and schnitzel. Both were great.\n\nThe duck came with potato dumplings and red cabbage. I was not a fan of the dumplings, but the red cabbage was spectacular.\n\nI definitely recommend this place for those who have not tried Czech food before. ☺️"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxeHBXdkx3EAE",
            "text": "What a fun and beautiful Czech restaurant. Located on a quiet upper-east side street, the vibe at Bohemian Spirit is mellow, but stylish. The interior is large, with lots of art and knick-knacks on the wall. We sat outside and--although the weather was poor when we visited--it was quite comfortable. There were limited (but all delicious) classic Czech beers and wine. The wait staff was exceptionally friendly and very accommodating. However, the big thing that REALLY makes this place worthwhile, is the food. Absolutely delicious and worth traveling for if eastern European comfort food is what you hanker. We had pickled brie, drowned sausages, Goulash, and one of the daily specials--braised beef with dill sauce and bread dumplings. Simply astounding. For dessert we had a really interesting fruit dumpling with vanilla sauce and ginger bread and \"beer foam.\" The price, given the impeccable quality, was very reasonable. I highly recommend!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2bzRfRDZnRRAB",
            "text": "Hardy food and eccentric decor. Very unique dishes, definitely worth trying!\n\nI ordered the schnitzel, which was really delicious and even better reheated. First time having it, and I am impressed by the flavor and crispy texture. Yum yum. I also got the fruit dumplings (pictured inside the sauce). The dumplings were gritty and doughy and had only a strawberry in the center, covered in a sweet beer based sauce... It worked so well! Delicious, and the texture was quite enjoyable.\n\nThe bread dumplings are more like soft, doughy consistency bread (pictured next to the fries). I was curious but I did not really enjoy it. My friend got the pork chop, but neither of us enjoyed the cabbage portion either. It was also a bit disappointing that there weren't any region inspired cocktails, but the rest of the food carried the experience.\n\nWould definitely come again!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlZ0xDeENREAE",
            "text": "Czech restaurant. Nice unique place with choice of draft beer was hoping that I would enjoy Czech food but food not what I expected. Cucumber salad was more like soup very watery with bland flavor. Duck was very dry and taste like old fat just horrible taste. Service even worst. Server that we had was nice t helpful and attentive at all we seat all night waiting for water and to get our check was forever."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3ME4yVEVBEAE",
            "text": "Had a lovely meal with my son.  He had grilled kielbasa, I had the jaegerschnitzel.  Both entrees were well prepared and presented.  The schnitzel was perfectly prepared; the mushroom sauce was perhaps a little much in quantity for the size of the schnitzel.  Nonetheless very tasty.  The side salad was excellent."
        },
        {
            "date": "1년 전",
            "language": "sk",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUc2FyemtRRRAB",
            "text": "Pozitivní recenzia pre Bohemian Spirits Restaurant na Google Maps\n\nBohemian Spirit Restaurant v New Yorku je skvelá voľba pre tých, ktorí hľadajú autentickú českú kuchyňu a príjemnú atmosféru. Nachádza sa v Bohemian National Hall na Upper East Side a ponúka širokú škálu tradičných jedál, ako sú hovädzí guláš, bravčové koleno a knedlíky. Majú tiež skvelý výber pív, vrátane plzeňského piva.\n\nPersonál je priateľský a ochotný a reštaurácia má krásny interiér s českými dekoráciami. Ceny sú mierne a porcie sú veľké. Určite sa sem vrátim!\n\nTu je niekoľko ďalších vecí, ktoré sa mi na Bohemian Spirits Restaurant páčili:\n\nPoloha: Reštaurácia sa nachádza v skvelej lokalite na Upper East Side, v blízkosti mnohých múzeí a atrakcií.\nOtváracie hodiny: Reštaurácia je otvorená neskoro do noci, takže je ideálnym miestom pre neskorú večeru alebo posedenie s priateľmi.\nVhodné pre rodiny: Reštaurácia je priateľská k deťom a ponúka detské menu.\nDostupnosť: Reštaurácia je bezbariérová.\nAk hľadáte skvelé miesto na vyskúšanie českej kuchyne v New Yorku, Bohemian Spirits Restaurant je skvelou voľbou. Určite sa sem vrátim!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoblo2TzhRRRAB",
            "text": "Hearty meal for a cold February night in New York. The dining area is brightly lit and open, with lots of different Czech memorabilia and photos adorning the walls and ceiling.\n\nThe waitress recommended all the traditional dishes. Everything was very good; big portions, top quality and authentic. Can’t forget a a few half litres of Pilsner Urquell."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHZzZ6Skh3EAE",
            "text": "Ordered a bunch of dishes that we shared kind of buffet style (4 of us). Located right next to the Czech consulate, the food and drink here was really good and at a fair price for NYC. One of my friends is from the Czech Republic, and said it felt as close to home as possible for a restaurant here. Definitely good no matter your tastes, and make sure to try the beer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMFlqcUZBEAE",
            "text": "Place it is fine ,,have Czech roots , but restaurant is not Czech people anymore, food overpriced, be careful with pay tab , after  finishing your food , 20% automatic charge tip fee  plus tax , if u r 6 persons at table , try to pay together for food , otherwise restaurant charge everybody 20% tip pls tax separate, so for 300$ food u ended up paying around 60$ tip plus tax minimum in New York new style..!\nThere is not Czech cook there , only Spanish guy who prepares food there..\nNot recommended this place for food for sure ..!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwd09DUjJBRRAB",
            "text": "Recently tried a Czech restaurant for the first time and loved it! Warm ambiance, friendly staff, and the authentic flavors of dishes like goulash and svíčková were a treat. The attention to detail in presentation and the delicious desserts made the experience even more memorable. A must-visit for anyone looking to explore Czech cuisine"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkMmJuVFZnEAE",
            "text": "I ordered the Svickova sauce and apple strudel with vanilla ice cream for dinner and they were both delicious! I had a nice time having Czech food for the first time Bohemian Spirit! The restaurant has nice ambience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNnM3TjV3RRAB",
            "text": "This is a true gem!!! One of kind atmosphere with great service. We ordered the holland schnitzel and goulash - it certainly did not disappoint. Portions are large so get ready to eat some amazing hearty food."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNaTdIazJBRRAB",
            "text": "Had a fantastic dinner here eating true Czech food that has maybe been a little Americanized. Also had Pilsner Urquell on tap and poured right (with a healthy head). They also poured us a half light half dark glass of beer, another favorite of ours. Service was good. I loved the 60s-80s music playing as well. Great place!\n\nThe svíčková was delicious. The steak tartare was excellent. I enjoyed the goulash entree. And the fruit dumplings were pretty good. I was happy with everything we ordered.\n\nWhen I say the food may be a little Americanized it's because the svíčková came with the meat completely submerged in sauce whereas I remember the meat being on top of the sauce. That's just my take on it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXMDhubVhREAE",
            "text": "For us, it was a perfect dinner.  We really enjoyed the excellent food. I think that I ate the best schnitzel in New York.\nThe Steak Tartare and rosted beet salad opened the \"door\" for a delicious schnitzel; we'll be sure to return to have it again.\nThe mass potatoes served with the schnitzen were delicious as well.\nThe apple strudel and the stuffed crepes closed out a great meal.\nVery good value for money and highly recommended"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyNkphV3RRRRAB",
            "text": "Love this place--and so close to me!  I've wanted to go since it opened and FINALLY made it!  Great good, friendly & helpful staff, 3 Czech beers on tap (2  Pilsners & a tasty dark and a good bottle selection).  Healthy portions.  The gulasch was delicious as expected, but the real eye opener was the chilled cucumber soup--addictive and refreshing!  A bit pricey, but it *is* the UES after all.  Definitely worth a splurge.  Will definitely be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4czd5cHlnRRAB",
            "text": "Just like in Prague!  Pilsner is poured right.  Food is great quality and you’ll find all the traditional Czech dishes on the menu.  All that’s missing are the low Czech prices 😉"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsN3VLNGZ3EAE",
            "text": "Excellent Czech food and beer — I had the goulash soup and the confit duck leg, both exceptional. Friendly service and good vibes. Will be back soon!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlaVlpTHlnRRAB",
            "text": "Authentic food and pretty good service. Highly recommend jagerschnitzel, which personally beats the schnitzel and duck confit. The beton cocktail (a twist on gin and tonic) is very good too. Great and whimsical interior with floating vintage furniture. Great for a casual eating experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1M0ltRmZ3EAE",
            "text": "Interesting restaurant that offers East European specialties for dine in or take out such as chicken, pork or veal schnitzels along with sauerkraut, red cabbage or mashed potatoes. For dessert don’t miss the Apple Strudel. In my opinion, a bit overpriced."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCcnJLQnJBRRAB",
            "text": "The staff was very welcoming and warm.  Service for the food was great. The quality of the food was phenomenal. We ordered pork schnitzel with French fries, duck confit and beef goulash with bread dumplings.  Fantastic meal!!!! So impressed!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabU95UDdBRRAB",
            "text": "What a great find…. Great weekend brunch special 2 drinks with choice of breakfast items or lunch. Fresh salads, crepe like eggs folded around your choice of filings. Lovely staff, indoor and outdoor available"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLNmVqTTF3RRAB",
            "text": "Had a good meal here. 4.6 stars: cauliflower soup and fruit dumpling dessert. 4.2 stars: half duck special and the braised beef with svickova sauce, cranberry, and dumpling (sauce was a bit too sweet considering the cranberry was also…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6bWEzMjJBRRAB",
            "text": "Delicious and authentic Czech cuisine in NYC, right next to the Czech consulate! The dumplings/knedliky are delicious. I included a pic before I doused them in gravy😋 I do with they had more veg-friendly options."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkb09TSEtnEAE",
            "text": "Este lugar es muuuuy único y a la vez hogador. Yo había pasado unos meses en la República Checa hace unos años, y desde entonces he tenido ganas de experimentar su cultura, historia, y comida.\n\nFui con mi mamá y hermano y los tres pedimos platos típicos como el veal y chicken schnitzel, y también el fried cheese — no te lo pierdes! Es rico, simple, y especial. Recomiendo comer todo con una de sus cervezas nacionales, como la Pilsner Urquell.\n\nAdemás pedimos los fruit dumplings, también una comida típica y muuuuy única (por lo menos considerando todo lo que conozco de la región). Es tan chistoso, una frutilla dentro de una empanada hervida. ¡Pero nos encantó!\n\nEl espacio es muy interesante y simpático también. Ojalá un día podamos ir cuando esté abierto el museo también. vinikající!"
        }
    ],
    "reviews_count": 75
}