{
    "name": "Pil Pil",
    "place_id": "ChIJh-ZRBb9YwokRSMkUC8lETk4",
    "grid": "MN8",
    "address": "265 E 78th St, New York, NY 10075, USA",
    "rating": 4.4,
    "user_ratings_total": 1293,
    "phone_number": "(855) 681-6614",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0M2FGZHdaRFZmTTFGR1NHbE1ZVXhWZEhrMmFXYxAB",
            "text": "Fun spot for happy hour! Delicious tapas and the house wine was good (though the pour was rather small!) Loved the decor!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SQ2J6ZHVRV1kxYm1SVWRucHVhMEp6WkdaTlpGRRAB",
            "text": "It's a lively place but I find everything to be very mid and inauthentic."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jNFRYbFVjUzFEVTNseFp6bDNTbEZRZDFaVU5FRRAB",
            "text": "Nice spot for a few drinks and happy hour bites at the bar. Nice wine options."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toSWJuWjZTbkV0VkdaUmFtUTNVRUZxTWxOaVVtYxAB",
            "text": "Excellent food, nice portions, highly recommend if you are on the upper East side. Outdoor seating available"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWlVtWnlkV0l3Y2t4TFdGQkNNMXBVZFhKR04wRRAB",
            "text": "Comida exquisita. Falló el servicio ya que los 3 platos llegaron con 20 minutos de diferencia cada uno. Vale la pena dar otra oportunidad por la calidad de la cocina"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VU0zbFVRVFpmTVVkNGNXZHZZVU5wUjI5V09YYxAB",
            "text": "Had a great time, delicious wines,apps, Import beers. British girl was super attentive and helpful for my group. A++++"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNldGTkpRMTgwUkZGUGVYSmhOVlppWHpWeFRVRRAB",
            "text": "Food was great. We loved the octopus. Nice atmosphere and music too. Jane was great server!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tscGNIaEVXV3RZZGpka2MwYzRXVzkyZURWcVZsRRAB",
            "text": "Vibe was nice and the food was pretty tasty! Prices are fair and I would come back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMFMyWklaekpvUVZReFMyOXBibmRWU25CaGVIYxAB",
            "text": "The restaurant handles both food and service with real skill. The kitchen creates unusually delicious dishes. The personnel displayed natural friendliness also. I found the setting both special and fun. THE MEAL WAS EXTRAORDINARY and a memorable time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25od1h6aDVZM013TVd3M1h6bFRRbEowVEdsQlprRRAB",
            "text": "Amazing place with great food and phenomenal service.   And an atmosphere to boot.  Very memorable space."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGS01VZHlNVnBLZFY5SVpXbEtaelZhWDJKb1pHYxAB",
            "text": "This is a great tapas place with a casual atmosphere you don’t always find in Spanish restaurants in New York City. There’s a real pub-like feel to the place and a great menu at a good price."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Nd2IwOU5VWFJTUzJZd2N6QlRlVmhSWVdONVNuYxAB",
            "text": "Highly recommend this place for brunch. They have brunch dishes which have several components so you can sample multiple things. Everything is so tasty!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xocVkwOTRla3hzYlROUFkxVmFTRmxEZUVwS1VVRRAB",
            "text": "I'm sorry I didn't take photos because this place is super cute.  Seating is tight but you still have room.  The staff was really friendly and accommodating.   The food was reasonable and delicious but I took 1 star off due to the small issues (ex.. Pan Con Tomate - taste was good but bread not toasted so it was soggy)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkUVZGcHJOREJmWWpCck15MURhVEpOUmxvd1JHYxAB",
            "text": "My favorite restaurant in NYC!!! The chef and the whole team were incredibly kind, the food was so delicious, and I had the best time celebrating my birthday here. Couldn't recommend more!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4dE1rMXJhbUpvUW1GNE4xbHVRMFZPWWtOR04zYxAB",
            "text": "Great Tapas spot, good wine and Sangria. No cocktail options. Food was amazing, step up from Boqueria, and a lot more neighborhood feel to it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMlRWbHJWbGw1Ykc1dExVSnJZVjlPYVhSS1QyYxAB",
            "text": "Had a lovely dinner with 6 of us tonight. Sangria was great. Food was tasty. Had an Issue with the bill that realized AFTER THE FACT and the owner, wrote me after and corrected it. (Thank you). Definitely recommend: great ambiance and tapas."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNWVsbHZSbk5IVUdkeGRGQmxWUzFIVDNkU1dWRRAB",
            "text": "The food and sangria were so good. I wish I could say the same about the service. We felt very overlooked - they seemed to be checking in on all the other tables pretty consistently. We barely got 2 drinks out of the unlimited brunch and were not told when it ended as a courtesy. We were just told it was over and the guy walked away immediately instead of giving us a chance to order something else or close out - getting the check also took a while. Too bad - would have liked to try some of their other stuff."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOdVNFNXRRVkZ2ZDJKM1pXc3hkRmhUVDNoVVZWRRAB",
            "text": "I like this place for brunch and their spanish tapas"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20weFoxUkdOVEZ5ZEZKSlgwMDJPV0ZVT0hGRFlWRRAB",
            "text": "amazing food, romantic dimly lit atmosphere. it’s a very very nice vibe, 10/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsVFNEazRXbGN3U2s1bWF6aDVaM2s0VFhCVFJYYxAB",
            "text": "Great food, beautiful atmosphere. Love the happy hour—supplemented by non-HH menu items, especially the bacalau (which we liked so much we got a second order)."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCb1JGcERhMTlMYzJGelJqaEJVRzFuVkhOck1YYxAB",
            "text": "Loved it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poU2N6SjRja2R3VTJaU04zSktZblpFUm05cVYyYxAB",
            "text": "Amazing tapas & cozy vibe!!! Love this place will come back next time!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZMFpHbEVjV1JEVEVGVGN6aDRaMUJwTjFrMVNrRRAB",
            "text": "The servers balance efficiency with personal attention. Workers here upheld the restaurant's service reputation. Tasteful seasoning. Fair costs and welcoming service. Good feeling inside with nice servers and clean decor. The taste experience is consistently excellent."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHaklpZGd3RRAB",
            "text": "Tried multiple tapas, average meal. Where is the salt guys?! No season on most dishes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toaVQySnJjMnh4TjE5S2VHNDNXalYwZUZBd1JIYxAB",
            "text": "Great atmosphere, delicious food, great place for brunch"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toa1N6TmZlVWRvUkhSclJqRTJOM0E0ZVZNdFoyYxAB",
            "text": "Good well priced Tapas"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sVlRIZ3pZVkJmYjJkMFFscDVTVk5KTFdKMWNVRRAB",
            "text": "I’ll be totally honest, the food is not good. We went here excited to eat some real Spanish tapas and were very disappointed. We started with patatas bravas that have nothing of bravas, it seems it’s ketchup with mayo. We also had the tortilla española and was really dry and felt as if it was old and reheated. The pan con tomate was more garlic than tomato, I couldn’t eat it. We also ordered calamares which were the highlight of the night because they were ok. The seafood rice had a mayo ketchup sauce that overpowered any other taste. So the place is pretty nice and the atmosphere is very cool, they have spanish beer which is very nice, service was great and super friendly but the food was not the same level. I’m sorry, I know there’s a lot of effort behind a restaurant but I need to be honest, if you come here for drinks it’s really good but for us, it wasn’t a good experience with the food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aemVFNVFaelF5YkdwMFJIWlpUSEJ2WTFKa0xYYxAB",
            "text": "Super friendly and cozy place.  Delicious food!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210NGVVOHplVmhSUzNocFMwTnRlR2N4U0cweWIzYxAB",
            "text": "Food was very mid. I regret not going to Boqueria instead"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWFptZ3hNVXBxYjNONFFqbEdhamhMYm1oQ01YYxAB",
            "text": "Great food and service! Super chill vibe. Cheese curds rocked!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRVUxTkdXV2xZVW1kV2FUQnNZMjFuY1V3eFdGRRAB",
            "text": "So good!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wd2NGaG5UREJmUVZscVFWRjVaWEpFWWpWS1ZuYxAB",
            "text": "I’ve been to Pil Pil over six times since December (I’ve honestly lost count at this point). It’s truly the best spot in New York for authentic Spanish food. I even brought a friend from Madrid, and they confirmed that both the food and service are outstanding.\nThe croquetas are my absolute favorite, I often order 2–3 just for takeaway. Their pan con tomate is so fresh and flavorful, you can tell the tomatoes are top quality. The chorizos are another must-try, and you can’t go wrong pairing your tapas with one of their sangrias. I genuinely love this place and it is probably my favorite food spot in the city since Spanish food is my favorite. If they ever start a rewards program, I’ll be the first to sign up!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4M05FOTVTa3hHVUVaUlEyZDZTMTlaWWxkalgwRRAB",
            "text": "Always a great vibe and delicious food!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kM1ltVnJRalp2UW1FMWVISlhibFUwUkUxVWRGRRAB",
            "text": "Went for happy hour. Good food. Great prices."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wR1gzRTNTa1l3VVZkcmMxQjBNalF6Y0cxVlZHYxAB",
            "text": "Great tapas spot! We went for the unlimited brunch and had an excellent time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2preVNteFNUelZYWW14UFRYZFFaek5FTFV0MVFsRRAB",
            "text": "Mediocre. All of the food needed salt and lacked the flavor I'd expect from tapas. The Sangria was watered down. The staff was totally pleasant and attentive. Would not recommend to friends as there are so many other great options in area."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqNk4zQnFRRRAB",
            "text": "Excellent! Never, and I have been many places, have we been seated and received heartfelt service so quickly and warmly. Our waters were present and filled within the 1st 15 seconds. Will, was a great bartender, fielding our queries and offering knowledge answers. Great vibe! So impressive. We will be back! So close to MET and East side. Hardest decision was Cerveza or Sangria… Enthusiastic 5-stars!\n\nOne year later. Same 5 stars, same warm welcome, fast service and delicious tapas. Added 5 stars for food. Will and Maria took good care of us! Enjoy!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KalprZHFXVXRWZGtKS1IwMVZjR3d0VjFkMk5GRRAB",
            "text": "We’ve Been coming here for 13 years. The absolute best tapas and customer service experience in the city. If you want to eat delicious Spanish food, beautiful ambience and overall wonderful experience, look no further! Great for indoor and outdoor dining! Eat and drink your heart out! Chef is warm and welcoming. Buen provecho (kids love the coca de Serrano)!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCM1VXaHhWM0ZGYTNOWWJGbGpSME5VV0ZWSVVsRRAB",
            "text": "Rude male servers. Food is not the best. I only like the meat. The menu is not the best. I didn't like the place. Service sucks."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pobk4xQlBSV1F3ZDNwVWIweEJTbE0zYWpreldXYxAB",
            "text": "This is a really nice Tapas place with great happy hour. The only issue is that it's very small."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdmJ6WlFTa3BvTFdremNUVnpUR3RxWjFsaFJYYxAB",
            "text": "I want to thank the people at this restaurant for being so kind to everyone on our trip. Thank you for the amazing atmosphere, and above all, for the outstanding service you gave us. I highly recommend this place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbmVtbFhTbTV4TUd4b1owMWFRekJ2U1ZCWU9HYxAB",
            "text": "I went there last week for dinner the food was amazing, the place is so cozy and the vibe is there. Can’t wait to go back again"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ab05uSlViak5wUlZwWVNIcFBjWHBTVUVsbE4xRRAB",
            "text": "I went here for my birthday and had an incredible experience. The atmosphere was great, the music was perfect, and the food was super fresh. The service was fantastic, they really made me feel special. Highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CcmNteEhkbXhNVXkxVWREaG5Ra0Z4ZFU1TWRsRRAB",
            "text": "Pil Pil is everything! From the moment you walk in, the ambiance wraps you in this cozy, chic, effortlessly cool vibe that makes you want to stay all night. The lighting, the decor, the energy—it's all on point.\n\nNow let’s talk about the food... wow. Every single dish was bursting with flavor, beautifully plated, and clearly made with love. The tapas were next level—fresh, flavorful, and just the right portion to share and savor. And the sangria? Dangerous in the best way.\n\nService was warm, attentive, and made the whole experience feel like a treat. I truly can’t rave enough. Whether you're on a date, out with friends, or just treating yourself, this place hits all the marks. Already planning my next visit!\n\nRun, don’t walk."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CNFlYbE9VMFkyUmxsRU16QXhSbEp4YTFsZmFtYxAB",
            "text": "The best food i had in my life"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taUU5ISjJia1pqY25wRFVETnRhMlZGVVdSQ2NrRRAB",
            "text": "The food was so fresh and good quality most definitely recommend plenty of food too must try"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQU3ZpZEx6bUxqVENREAE",
            "text": "Exellente services delicious food 😋"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KbFpqbEhUemhzTFhaVlZtNUpUVkF4TFd0NVgwRRAB",
            "text": "The food and service were good. However, it was too loud and crowded for my taste. The menu is on a touchscreen device, which I found uncomfortable. If you're young and have good hearing you should be fine."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aaFFUVXRhMGRDV1Zod1ZDMU9kVnA1TkdSSVMxRRAB",
            "text": "Delicious food and good wine paring. I only with they don’t have so many plastic plants. Because it’s pretty romantic as it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pndFlsQm1SR0ZHUzFkaGNGaDJXVmhJTTFjMmNVRRAB",
            "text": "Food was good but it was a bit noisy.  Didn't like the tall seating but service and environment were nice!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKREY1b2JPNE5XaExBEAE",
            "text": "First time visiting Pil Pil - the perfect spot for date night or a cozy dinner with friends.\n\nCarne Adobada: Beef steak marinated in smoked paprika, garlic, olive oil, vinegar, and pan-seared to perfection. It’s juicy, aromatic, and deeply flavorful served with crispy fries.\n\nCoca De Chorizo: Spanish flatbread topped with spicy chorizo, melted cheese, and roasted peppers.\n\nHomemade Tres Leches: A moist sponge cake soaked in three types of milk, offering a rich and creamy texture.\n\nEverything was beautifully presented and bursted with flavor.\n\nThe space itself is warm and intimate, with tree branches trailing across the ceiling and a mural that brings a rustic charm to the room. Romantic and relaxing vibe."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJcmZ5X3FqOXJld0h3EAE",
            "text": "Solid place all around for a quick bite or more casual meal. We got there for happy hour priced items and they were actually pretty fantastic, especially for the cost. We got the meatballs and the dates wrapped in bacon and the coquettes. The coquettes were absolutely unreal"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLZWRqSTMzeWNPcEZ3EAE",
            "text": "The lovely restaurant below our apartment.\nThe chief was our life saver when we arrived late and couldn't get into our apartment, he lent us his phone to call the owner to let us in as our UK phone had problem calling.\nThe restaurant had a lovely busy feeling to it good food and drinks, which we did iced Pop back down and sample.\nIt's in a lovely area and nice and clean inside and out."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3b3FydEp3EAE",
            "text": "I loved this place! Such a cute little gem. We went there for brunch and had a great experience. The setting was very comfy despite the limited space, the food was delicious, and the service was on top! They timely refilled the mimosas, and the brunch platter was so good I want to go back to try all the other dishes on the menu. I won’t recommend for big groups, but it’s the perfect setting for a date night or if you want to catch up with a friend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPcmUxY1hHX3U2Y053EAE",
            "text": "The main draw for Pil Pil is its vibe, with the dim, cozy interior lit mostly by the cool bar. The food is a mixed bag. I enjoyed the grilled smoky char of the shishito peppers  (Pimientos del Padron, $18 plus tax). The sauce of the Pollo Catalán ($23) was quite sweet from the raisins. The Manchego cheese risotto, which accompanied both the chicken and the Calamares Pequeños, needed to be seasoned better. The skin of the  eggplant was, in parts, tough."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPcmhoUGp1amZ2QkhREAE",
            "text": "Spanish wine bar with spanish food. Great selection of spanish wines, Food is okay nothing to rave about. Nice cozy place with good atmosphere. It is an expensive place with fine dine prices which this place is not. Overall fun place to be."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMWJTMEdBEAE",
            "text": "Pil Pil – A Cozy Spanish Tapas Bar with a Few Hits and Misses\n\nNestled in the Upper East Side, Pil Pil offers a warm and inviting atmosphere that transports diners straight to Spain. With its rustic decor and ambient lighting, it’s an ideal spot for both intimate dinners and group gatherings.\n\n🍽️ Food\n\nPil Pil’s menu showcases a variety of traditional Spanish tapas. The mini chorizos stand out as a must-try, delivering a burst of flavor that’s both spicy and savory. While the patatas bravas and mushroom flatbread have garnered praise from patrons , the tres leches dessert was a letdown, lacking the moist richness typically associated with this classic treat.\n\n🍷 Drinks\n\nThe beverage selection complements the tapas menu well. Signature sangrias and a curated list of Spanish wines enhance the dining experience, offering authentic flavors that pair seamlessly with the dishes.\n\n👨‍🍳 Service\n\nService at Pil Pil is generally attentive and friendly. Staff members are knowledgeable about the menu and eager to provide recommendations, contributing to a pleasant dining atmosphere.\n\nAmbiance\n\nThe ambiance is one of Pil Pil’s strong suits. With its cozy interior, adorned with tree roots on the ceiling and a captivating mural on the back wall , the restaurant exudes a charm that’s both rustic and chic. It’s a space that invites relaxation and conversation, making it a favorite among locals and visitors alike.\n\nOverall\n\nPil Pil delivers a commendable Spanish tapas experience in the heart of New York City. While there are standout dishes that impress, some items fall short of expectations. Nevertheless, the inviting ambiance and quality service make it a worthwhile destination for those seeking a taste of Spain."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLRFczWnI4bkxiWUJREAE",
            "text": "Pil Pil – A Hidden Gem on the Upper East Side\n\nDon’t be fooled by the modest exterior—inside, Pil Pil delivers a rich, authentic Spanish experience. The tapas are flavorful and generous, made with fresh, vibrant ingredients. Every dish feels crafted with care. The cozy ambiance, excellent wine selection, and warm service make it a standout. A true neighborhood treasure."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VMYl80OTJJbTZHeUt3EAE",
            "text": "Atmosphere of the restaurant is a bit darker. iPad menu hard to navigate . Foods are ok, service wasn’t perfect.I think it could be a good brunch spot tho."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiM3FtVWVnEAE",
            "text": "This is an upper east side tapas bar. Get your choice of drink and then experiment by ordering a selection from the wide variety of small food items. Sharing is also a great option. Vegetarians will find here a very reasonable selection of tapas to enjoy. Notice they have two spots one next to the other. They have both indoor and outdoor seating. Service was helpful, fast and efficient. Prices are as expected in this neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEckxtTXVBRRAB",
            "text": "Food 9/10\nSuch solid tapas but also might be biased because I had a great time. Objectively, I do think it’s one of the best tapa spots in NYC. The shrimp was a little oily but the oil sauce with the bread goes crazy. The paella had a very generous amount of seafood, the octopus was very tender and flavored, and so was the manchego cheese. The wines they recommended were also quite interesting and fun.\n\nAtmosphere 7/10\nWe were seated at some communal table, with parties of two sitting across from each other both sides. Could tell they were both first or early dates, so it was kind of funny listening in on their conversations. It felt a bit tight and cramped, not sure who thought of this setup but I guess its fine. Cool decor inside, hopefully I can come back during the day to full appreciate the interior.\n\nService 6/10\nSolid service, friendly dude. The only thing is I don’t like the iPad menus. They were quite janky and just not great for the dining experience."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRazRuV2ZBEAE",
            "text": "Whenever I see restaurants with thousands of Google reviews, five stars, and no comments, I genuinely think those reviews are fake.\n\nAfter seeing the high ratings, I decided to give this restaurant a chance, but honestly, the risotto was disastrous, and the chicken was dry. I also found the portions relatively small.\n\nOverall, I’m not pleased with my visit, so I’m giving three stars."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VPZWN2WkRrOGFtWUVBEAE",
            "text": "This restaurant has a lot of potential to be great specially in this area the UES. A few things that in my opinion need attention immediately the furniture, tables, chairs, are unstable and loose. The restaurant needs cleaning, very dusty everywhere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMd2NyQ3JnRRAB",
            "text": "A great find. Good Tapas. The Lamb Chops, Spinach Mushroom Croquettes and Paella were awesome. The paella was the closest to how they make it in Spain. We also had a Toasted Mushroom Sandwich, which is to die for. The Ceviche and the Sangria did not live up to the other things we enjoyed."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmOS1DVkdBEAE",
            "text": "Truly fun and delicious! We came here to host a small/casual baby shower and not only was the food amazing - as it consistently is- but they let us pick our playlist, made special mocktails for the mom to be, and overall just made us feel welcome. The staff was very interactive and sweet with everybody there. Highly recommend throwing an event here or just coming for dinner- never disappoints!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDOEt1M0lBEAE",
            "text": "Outside dining review : waited a good 30 min to be seated but the atmosphere was kinda pleasant. Food was pretty good and pretty authentic. The steak & fries was the most authentic. Tasted like Spain. Decent wine list. Also had some grilled…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyb2U3Z2xnRRAB",
            "text": "Great place for tapas (especially for brunch) with tasty flavorful food, large selection, nice presentation, ample indoor and outdoor seating and decent prices. The Spanish omelettes were incredible.\n\nWe got the region based tapas during brunch ($22 for 3 decent tapas servings from the region) with mimosa and sangria ($8 each).\n\nOf the items we had, the omelettes were the best, followed by the hangar steak with fries and Spanish croquettes. They also have a great dessert collection including a few vegan options."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNud1lXTHp3RRAB",
            "text": "On 11/11/23, we had our wedding reception here. We had about 60 people. My experience with Pil Pil from beginning to end was simply perfect. Pamela, the general manager, helped me plan our entire wedding through email and phone, and so flawlessly. She was so detail oriented in all of her suggestions!\n\nThey welcomed us a few months before the wedding to come try a complimentary selection of their food- and from then on I was blown away by the hospitality and service. We felt like special guests and the chef Pedja who is just SO nice- actually came out and served us all of our food and explained each dish to us! The ambience in the restaurant was just adorable and so much more beautiful than I expected. We are both nature people- so we adored the tree branch ceilings, the beautiful art, and the bar lighting using glass bottles was such a creative touch!\n\nThe food ended up being just amazing! We actually ended up having a brunch wedding so they served us breakfast for dinner when we went to try everything and we LOVED it. My favorite were the ham croquettes, the spanish french toast,  steak and fries and the coconut dates- mmmm but there was so much more than that!\n\nAnd Pam actually assisted me with every detail of the wedding planning, florals, scenery, the most delicious bride and groom drinks, sangrias- it was all so amazing. She put together really adorable signs with our drink and menu choices, a Mr and Mrs sign, and even had a faux cake designed (in the photos) with the MOST adorable surprise cake topper designed after our engagement photos!!! This was so unexpected and I have the cake topper framed in my living room still today! We had the most amazing tres leches cake as our “real” cake, and they put a piece into our faux cake so that we had a piece to cut. Pam even set up a memorial seat for my recently deceased father and allowed me to put up a photo and displayed my sign reserving a seat for him. It was just so thoughtful and beautiful.\n\nWe ended up having a last minute rehearsal dinner, scheduled only a few weeks prior- and they were SOMEHOW able to accommodate us in the next door party room, and it was so beautiful!! We had our own personalized champagne glasses (which I regretfully forgot at the restaurant after the wedding) and a nice long table set up for all our family with a bride and groom table for us. Service was impeccable and everyone had a great night.\n\nNow- the wedding itself! A day to remember! Pam and her staff truly went above and beyond to make our guests feel welcome and comfortable while everyone waited for us to arrive (we were running a bit late after wedding photos!) but Pam made sure everything ran so smoothly! We had our own playlist connected to the speakers, champagne served at the door, food was held until we arrived, and everything was just so delicious!!! Our guests were blown away with how we were able to fit 60 people comfortably in the restaurant and still had room to dance! Our family loved the big table at the back of the restaurant and absolutely everyone came out to dance and have fun with us. Our guests thought this was such a cool and fun experience and a great place to have a small wedding. Everyone loved the food, service and atmosphere, and some begged to stay longer haha! Hopefully we weren’t a crazy bunch to host, but Pil Pil was definitely the perfect spot to have our party.\n\nWe are coming back for our anniversary dinner in November- and will likely return for years to come. Thank you for making our special day so memorable 🩷🩷🩷🩷🩷 We will remember this day for the rest of our lives! Our guests are still talking about how awesome it was!! We love you Pil Pil!!! And THANK YOU PAM you’re the best!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfd2FlLURREAE",
            "text": "My aunt, cousin, and I stopped by on Sunday night for some quick shareables and we were pleasantly surprised by how delicious everything was. We shared the carne abodaba, ensalada de queso, esparragos Romeo, chorizo imperial, and tosta de cebolla. Everything was delicious and we easily finished everything we ordered between 3 people. The atmosphere was great! We’ll definitely be going back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXdExIcm5BRRAB",
            "text": "Loved it here! I had such an amazing experience here.  Great ambience & atmosphere. Beautiful decor both inside and outside. Attentive and courteous staff.  I asked if I can sit in a more intimate and romantic place and they give me that seat in the back room without hesitation.  The food was phenomenal.  Everything there was delicious.  There was a man from Spain there & he was loving it as well and recommended the calamari to us and bought a bottle of wine there.  I've been to Spain a few times already and let me tell you,  this place definitely makes you feel like you're in Spain. Tapas & wine is the best.  I loved my red sangria and loved the lamb sliders.  The music in the background is amazing.  Highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdlBfZ0p3EAE",
            "text": "A great tapas place in upper east side in NYC! Perfect place with amazing ambiance for early evening drinks and bites with friends. Usually it’s a wait to get seated but the turnaround time is quick. We tried their Prosecco sangria which set the evening rolling for us. The lobster, recommended by our server, was a dud - not much taste to the meat and lacked flavor to it. The mushroom and cheese flatbread was great - I recommend that. And lamb chops were simply amazing - succulent, rich and flavorful."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfNHV1SF93RRAB",
            "text": "Had the pleasure of dinning at Pil Pil last night. Such authentic Spanish cuisine. Delicious tapas, friendly staff and overall great ambiance. Probably one of the best culinary experiences I’ve had all year! 2025 is off to a great start when it comes to breaking bread with friends and family."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuXzhLOUhREAE",
            "text": "Overall, Pil Pil is a must try - we absolutely loved this place for happy hour! We booked a reservation for a Friday night and were seated immediately despite getting there a little earlier. The food, the music, the drinks - everything was on point. When we first arrived, they had a good mix of RnB going and eventually switched it up to some progressive house music. I’d highly recommend going with a group to try a little bit of everything. We tried:\n\n- Albondigas (meatballs in a savory tomato sauce with mashed potatoes and bread, this was the table favorite)\n- Spinach Croquettes (super creamy, has mushrooms in them but you don’t taste them at all if you dislike them)\n- Dates Rellenos (dates stuffed with ricotta wrapped in smoked bacon with a bit of honey mustard, ordered more than once it was great)\n- Carne Adobada (skirt steak with fries, comes cooked medium unless you tell them otherwise)\n- Fried Calamari (classic fried squid, very crispy and light)\n- Brochetas de Carne (ribeye and asparagus)\n\nWe did try both sangrias, the red is sweeter than the white. The rosé is dry but still has that hint of sweetness. They also have non-alcoholic rosé amongst juices and sodas if you’re looking to be alcohol free.\n\nFor dessert we got the tres leches with coconut ice cream and raspberry sorbet. The tres leches is not very sweet even with the addition of whipped cream, and is a very nice end to the meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsc1lUUEFREAE",
            "text": "I brought a group of high school students to experience authentic Spanish cuisine after a day at the Met. The owner was beyond accommodating: super easy to work with, very responsive, and open to work with a very limited budget. Planning the event was a breeze. When we arrived…Wow! The atmosphere was perfect, food was AMAZING, and I could not believe how much food was provided. The staff was very friendly and professional, we got to meet the chef, and the owner actually thanked US for coming! This experience far surpassed my expectations—We will definitely be returning! Hoping to make this an annual event! Thank YOU, Pil Pil!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxc3Z2WnlRRRAB",
            "text": "Service was good but the food was ok. I think the chef liked powdered Paprika a lot. All our food tasted similar because it was everywhere. Grilled octopus came in luke warm. The seafood rice was better but the mussels on it was not fresh. Croquettas de Jamon tasted like it was cooked hours ago and reheated. Overall it was ok."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURycE5TcUdnEAE",
            "text": "Updated on 8/1:\nI updated my rating after having lunch here.\nI really enjoyed their lunch special which is Tapas(5 for $40) with sangria. Jamon is good!\n\nPerfect portion and good quality of food.\n\nI found a new spot where my husband and I can enjoy Spanish food(including Jamon) and sangria. We tried the sparkling white sangria which was good(contains half of cava). I liked the vibe. I will try their spanish wines next time."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3d28yb2VREAE",
            "text": "Overpriced food that is not good. Given the price, I expected better food. Everything tasted like it was frozen and heated up with an oven. Nothing was fresh and some items were salty. Either there has been a change in management, chef, or the reviews are fake. I would not come back for the food. But if you are here just for wine, it may be bearable. The restaurant was also tight and cramped. There are better options around the neighborhood. I will not be back."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkeEpiRXdRRRAB",
            "text": "We went for late lunch to PIL PIL on a Saturday, inside was a bit crowded but the weather is nice to seat outside. The staff is considerate and they'll turn the heaters if you ask them.\n\nWe had one of my favourite beers, ALHAMBRA which is nice to found in NYC. Then, we had some tapas including GAMBAS AL AJILLO, SPINACH CROQUETTES, PATATAS BRAVAS , ALBONDIGAS with MASHED POTATOES.\n\nI recommend the CROQUETTES AND THE BRAVAS, really good flavor, both were crunchy outside and creamy or tender inside, really well done. Then, the bravas were not spicy at all.\n\nESPAÑOL:\n\nFuimos para comer un sábado un poco tarde a PIL PIL, dentro estaba bastante lleno pero el tiempo estaba bien para sentarse fuera. Los camareros son amables y encienden los calefactores si se lo pides.\n\nTomamos una de mis cervezas favoritas, ALHAMBRA, que es bueno encontrar un sitio donde la sirven en NYC. Luego tomamos algunas tapas de GAMBAS AL AJILLO, CROQUETAS DE ESPINACAS, PATATAS BRAVAS , ALBONDIGAS con PURE DE PATATAS.\n\nEn especial, recomiento las CROQUETAS y las PATATAS BRAVAS, muy ricas, ambas crujientes por fuera y tiernas o cremosas por dentro, muy bien cocinadas. Las bravas no eran picantes."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtdXUzLWRnEAE",
            "text": "The only reason I gave this restaurant 4* is because the restaurant was pretty empty and the host was insisting on sitting parties on top of each other, even though there were completely empty tables around.\n\nOther than that the food was great I recommend getting the bacon wrapped dates and the Lamb toast! Also, our waitress was amazing and so helpful!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdl9Yb2VREAE",
            "text": "Pil Pil gives the complete dining experience! Tapas style allows you to explore a bunch of different dishes and flavors, and they know how to combine flavors! SUCH a cozy atmosphere too, feels like you’re dining in a vineyard. The service is warm and welcoming.\n\nThe Pan con Tomate was a great starter — perfectly toasted with fresh tomatoes on top. These guys do chorizo right 👌🏼 Empanadillas de Puerco y Chorizo and the Spanish chorizo were some of my favorite dishes. Highly recommend trying the chorizo! Mac & Cheese croquetas were bomb! Worth getting for the table. Carne Adobada and fries were delightful — tender, savory skirt steak and I LOVED the seasoned fries and sauce duo. If you’re into coffee, end the meal with the espresso ice cream. It’s the right amount of bitter and creamy.\n\nHighly recommend this place for quality food, new flavors, calming atmosphere, and friendly service."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlb3Jmdnd3RRAB",
            "text": "The food was really good, just a bit pricey but somehow worth the cost. Staff was a bit pushy about getting drinks and sangria. But overall the service was good. Great atmosphere as well as cozy setup. Very cool digital menu. I recommend checking it out."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoMk1IRE5REAE",
            "text": "Good bottomless brunch. Food is yummy and perfect for brunch\n\ntheir drinks are delicious. Their sangria is a must. It tastes just like what I had in Spain! The staff is friendly and nice. It’s a small space but the decor is very cute"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYLUtTalhREAE",
            "text": "I absolutely enjoyed my birthday celebration here. The combination of various dishes was incredibly tasty! The ingredients were top-notch made by Predrag and the way they home-cooked and prepared the food was exceptional.\n\nAs a European, I’m quite selective about food, especially in the USA, but this place truly stands out. I would highly recommend it as one of the top restaurants I’ve tried!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNMlBQdkpREAE",
            "text": "Cozy atmosphere. Shared seating. Interesting decor. Service was very attentive. The food was very good. It was recommended two tapas for each person to share. That was perfect. We got there early in the evening, but as the night went on, it got busier and the tables filled up."
        },
        {
            "date": "3년 전",
            "language": "ja",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHOWFYVFh3EAE",
            "text": "アッパーイーストサイドにある本格的なスペイン料理が気軽に楽しめる名店\n✅料理は何を食べても美味しく、ポーションも大きめ。リーズナブル。\n✅店内はやや暗めで隠れ家的な雰囲気がある。\n✅店員の対応も感じ良く、料理やワインについて丁寧に教えてくれる。\n✅一方、チーズプレートはそこまで良くなく、ワインの盛りも少ない。\n✅お友達と気軽にワイワイ食事するのに向いている。\n2021年12月現在"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5a3RlU2pRRRAB",
            "text": "If you need a cozy and warm, but beautiful spot for outdoor dine in these weird pandemic (still going) times.\nThis is it ! 78st & 2Ave\nOne of nicer outdoor patios in the Manhattan.\n\nOh yes food is good too.. Just kidding, actually excellent tapas and price is hard to beat in UES area. Will come again 🥘 You 👈🏻.. should too"
        }
    ],
    "reviews_count": 86
}