{
    "name": "The Penrose Bar",
    "place_id": "ChIJE1SK5LtYwokRH1APiOrZNq0",
    "grid": "MN8",
    "address": "1590 2nd Ave 2nd floor, New York, NY 10028, USA",
    "rating": 4.4,
    "user_ratings_total": 2363,
    "phone_number": "(212) 203-2751",
    "reviews": [
        {
            "date": "11시간 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aWlpYTmhXSEJYTm5WR1NrVTRWM0J5T0VvMFNYYxAB",
            "text": "Didn't get any food, place was nice. Sat at the bar top. Bar tenders were nice."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkSVVEQm1URXN6Y1haWmEzSlZiRXcxYUZkTFIxRRAB",
            "text": "The best bar on the UES. Bartenders and wait staff are so friendly, and the bar is very social! I always bring my friends from lower manhattan here to prove there's things happening above midtown."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Od1IydDJWbWR4YTJWS1JHazBTMEozVTFaR1RVRRAB",
            "text": "10 dollar beer n shot after 10 is gonna help me answer the 9:45 \"should we move on to somewhere else?\" every time"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKS1ZHOTFkVUZCVm1GalZVMXNTVlp2VG10WlpXYxAB",
            "text": "My experience at The Penrose was very good.\n\nWe had a few cocktails — they were excellent, though a bit pricey at around $16 each. The quality is definitely there; both the food and drinks were great, and the staff was very friendly.\n\nI think this is a perfect spot for a date, a special night out with friends, or simply if you’re looking for a great cocktail experience.\n\nIt can get a bit noisy, which makes conversation a little difficult at times — but that’s only because the place is so popular.\n\nOverall, I definitely recommend it, just keep in mind it’s on the expensive side."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ac1EwVm9jM3BFYjJ4bGR6aFZSV2xRWTJsRGFFRRAB",
            "text": "Severe food poisoning two hours after eating the spinach and artichoke dip here. Other than that, great ambience, super kind maître d’."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kQ04weHBNSGxQU25sRVMzWkJUWEpCYVROMlduYxAB",
            "text": "Friendly staff but there must have been all of 2 ounces in my burger. The fries were burned. The menus is very limited. It is a nice place to drink but forget about eating here."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21keGFFMTRTMWwxTkdSNWR6WlJZMkptVlZRMlFYYxAB",
            "text": "Definitely a good spot, I can see why it’s popular. It is kinda dark in there, but I think that’s the vibe their going for. The food however was pretty good, and so were the drinks. Nice place to go in and have dinner, definitely recommend as a date night spot."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZNFgwcFVSak5RVWkxSVkxcEdaWFJFU21jMFFtYxAB",
            "text": "ate at the bar. good burger and pretty friendlyp\n\nbartender"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNMWJVdEZZVEJuVUc5V2NXcGlURUUyY2tGSGJFRRAB",
            "text": "We stopped by The Penrose for a late lunch after celebrating our friends’ wedding ceremony in Brooklyn — and honestly, what a gem! ✨\n\nThe vibe here is just perfect: warm lighting, upbeat music, friendly staff, and that true neighborhood energy that makes you feel instantly comfortable.\n\nI ordered the Penrose Dry Aged Burger & Fries, cooked medium — and it was incredible. Perfectly juicy, full of flavor, and easily one of the best burgers I’ve had in the city. We shared a few plates for the table, including the Spinach & Artichoke Dip and the Mac & Cheese — both were creamy, rich, and full of comfort. My wife had the Kale Caesar, topped with roasted chicken, and she absolutely loved it — super fresh, crisp, and perfectly dressed.\n\nI didn’t have any alcohol, just a club soda, but even that hit the spot — cold, bubbly, and refreshing.\n\nEverything about this place just feels right — from the food to the service to the atmosphere.\nIf you’re anywhere near the Upper East Side, The Penrose is 100% worth a visit. We’ll definitely be coming back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rd2RsVk5UMVJOTldZM2RFczFNeTE2UmpkVU9IYxAB",
            "text": "Stopped in for happy hour. Great selection of beers and wine. Didn't do cocktails but they looked good! Nice servers."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMmRUQnVjMk0xU1UxblptSjJjVFJrZEdjeU5HYxAB",
            "text": "Great service and good food"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1SVQxaEtNRmxWTTBVNGNtVlBiRTkwVVV0eFZHYxAB",
            "text": "UES staple."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWdVdsOTFURGhyZVUxUE4yOXZhV2hYUkMxMmEyYxAB",
            "text": "The taste of their food stays with you long after you leave. The selection satisfies all tastes and staff enhances the experience. This restaurant earned my recommendation. The meals and staff performance merit top rating. This restaurant has earned my frequent visits."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkbmFrTlNSVEF5YXpGalJsRk1iR2RNZEU1RlgwRRAB",
            "text": "Thank you to Dani and Eric for a wonderful experience! My whole family came to celebrate my birthday and they were so accommodating and energetic— we caught the end of the live music on the floor. the food was phenomenal (steak frites and kale caesar especially) and the drink were top notch (naked in manhattan). Thank you so much for helping make my birthday a memorable one !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMWVFNXdXRzlQZEdoYVQyeGlSbGxxUVhORWNYYxAB",
            "text": "I recently visited The Penrose in New York City, and overall I’d say it was a solid experience with a few areas that could use improvement. The atmosphere is definitely one of the highlights it has that warm, rustic vibe that makes you feel comfortable whether you’re stopping in for a casual drink with friends or sitting down for a meal. It strikes a nice balance between being lively and not overwhelmingly loud, which is always a plus in the city.\n\nStarting with the drinks, they were definitely one of the stronger points of the night. The cocktails were well-crafted, balanced, and had a nice variety on the menu to suit different tastes. It’s the kind of place where you can easily spend time just enjoying a drink or two and feel like you’re getting something a bit more special than the standard bar mix.\n\nFood wise, there were some hits and some misses. The lobster roll was quite good fresh, well seasoned, and satisfying without being overly heavy. I’d recommend it if you’re looking for something a bit indulgent but still classic. The Brussels sprouts, on the other hand, missed the mark for me. They had good flavor overall, but were a bit too salty, which made them less enjoyable than they could have been. It wasn’t enough to ruin the dish, but definitely noticeable.\n\nService was the biggest area that could use improvement. The staff wasn’t rude by any means, but the attentiveness wasn’t where it should be. At times it felt like it took longer than expected to get drinks or check in on the table, which is surprising considering how polished the rest of the place feels.\n\nAll in all, The Penrose has great drinks, a cozy vibe, and solid food with some standout items like the lobster roll. If the service gets more consistent and the kitchen eases up on the salt, it could easily be a go-to neighborhood favorite."
        },
        {
            "date": "1달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KSFJFOWpkbGRHUlZaamQwRlFkMjVXUkhoWWExRRAB",
            "text": "Barzinho super legal, bem americano mesmo. Estilo, comida e frequentado por americanos.\nO hambúrguer com fritas é uma delícia. Provei também um drink com café bem famoso nos Estados Unidos e estava uma delícia. Meu noivo provou uma cerveja, gostou muito também.\nO preço similar ao de outros restaurantes.\nAdoramos muito mesmo. Quando formos novamente a NYC pretendemos voltar."
        },
        {
            "date": "1달 전",
            "language": "de",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkemQyRm5ia3MxVjJKTWNtWTFhMlUwYTBkSFRWRRAB",
            "text": "Bar was meh"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NM1IwRTJMVnBUVFhaS2RXMUNSV1oyYlVOWWIzYxAB",
            "text": "Food was very good and the outdoor seating was lovely. The service was quick and simple. The seating was a bit cramped outside but overall it was alright."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oNVUwVjRiMVEyV1ZOdVdtcFJaWG95VW5OM1UwRRAB",
            "text": "Oh my goshhhhh guys. This place is so good. The servers/hosts are AMAZEEEE! So nice and knowledgeable. (Shoutout Sophie! You ate with your recommendations and service!)\n\nWe were seated really quickly with no reservation on a Saturday night, and the ambience was really nice. Lively, not too loud, really cute but not pretentious. The music choices were perf as well.\n\nService was excellent and speedy despite how busy it was, and the menu is priced really fairly. The Crunchwrap is DELISH! Def recommend and will be coming back🙂‍↕️👍🏼"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWUVNsTnlUVTFNVmpOcFl6bFZTbE56VFV4MVduYxAB",
            "text": "I wish I could give it 0 stars, but here we go. The moscow mule was abysmal, the atmosphere - albeit cozy, was uncomfortable to say the least."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNlQxcEhTREphU0dJNFNXTkJhRFY1YzIxSllXYxAB",
            "text": "Worst  place to hang"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pablZscHpXV293V21nMVUzTkVlVmxVY2xkZlUzYxAB",
            "text": "Fun bar in UES just a few blocks from green line and buses. Very good cocktail selection but with plenty of beer and wine options. The crowd is older than LES but still young and fun. This bar also serves what looks like decent food. I think it’s a great spot for small to large groups and maybe dates (but only early evening because the bar gets loud at night). Check the website for good happy hour specials."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WS2NUTjVNVkZxY2xoUWNGVjJhWFY1ZWpFM05WRRAB",
            "text": "I came for a few drinks and while it was very crowded, I wasn’t overwhelmed. I think they had the exact amount of people without making it impossible to be there. Drinks were great and came out fast. Whoever does the playlist on Friday night, keep it up cause I was vibingggg"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKaVdtVnZTbWx4YUZGRlpIcFplRE5zYjJadlVVRRAB",
            "text": "The Penrose on the Upper East Side is a cozy yet vibrant gastropub with a rustic, vintage charm. The atmosphere is lively without feeling overwhelming, making it great for brunch, dinner, or late-night drinks. Friendly service and a stylish vibe make it a neighborhood favorite that feels both relaxed and trendy."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psc1ZEbFRZMGswZWsxYU1tTjBOVUZqWjFWWVEwRRAB",
            "text": "Our party of eight found this place for a brunch option on a Monday morning. We made reservations and we’re taking to our seat quickly. The serving staff was kind and quick. The brunch menu had several options for those that eat meat those that don’t and those that don’t prefer breakfast items. The coffee was not very good. Our party ordered pancakes that were amazing. The burger was okay. The fried pickles that were some of the best I’ve ever had. The bacon , egg and cheese sandwich was the table favorite. We did try to break up our bill and the server didn’t seem to like that."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xORVpGRk5VRlppUjNSUE9EbFFPRXBwWjJKRmRXYxAB",
            "text": "One of the best burgers I have had in the upper east side. Always a good time at this bar restaurant. The menu has something for everyone ! Sitting outside on a late summer day was splendid!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwR1IzRm5ZbGRuTFZsUlQxOW9NbmRQY1dKMGNuYxAB",
            "text": "Was decent, but bartender was a bit rude and while the drink was really good the experience left a sour taste"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKaGJIZE9jMU53ZEVoUVJIQnpXV2MzVDFvME5VRRAB",
            "text": "I love this place. Been there countless times and the service is always great and the atmosphere is always fun and relaxed. It’s the ideal spot for a drink/early dinner after work, or a place to do drinks on the weekend.\n\nI gave it 3 stars because they changed the menu recently, and I’m afraid it’s not as good as it used to be. The fries used to be a 10/10 (I’d say they are now a 7/10), and they removed some amazing dishes such as the veggie burger (it was the best one in the city) and the grilled cheese + tomato soup which were delicious. Really hope they can bring those back on the next turn!\n\nEdit: they indeed brought back the veggie burger and it’s as good as ever! Fries are still not as good as they used to be, but changed my review to 5 stars in appreciation for them listening to popular demand."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wc1dua3lkREJOVVRaMlIzUlpRa3RIUkMxM1dFRRAB",
            "text": "La hamburguesa penrose termino medio excelente y la ensalada con pistacho una delicia"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oMFEyOXRWMlp2V0hKUE1sWTNjbWhhZFhwQlEzYxAB",
            "text": "Fav bar"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWbk16TlRjVlJrZGxvdFlVRnRRamREVjNoM1RrRRAB",
            "text": "Best cocktails in the UES, and the food to match with them"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKdi05T2pFMG9iaDJ3RRAB",
            "text": "The Penrose added the veggie burger back on the menu!! Updating to 5 stars\n\nThe Penrose used to be one of my go-to spots with my boyfriend and friends—I even gave it five stars! But as a vegetarian, I’m bummed the veggie burger is gone. It was homemade, delicious, and not a sad Beyond patty (sorry, not sorry). Now with it off the menu, Penrose has fallen off our regular rotation. I know there’s a mushroom bánh mì, but let’s be real—mushrooms are divisive, and not every vegetarian wants fungus in every meal. Please bring back the veggie burger—it was a 10/10!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1M2FHWjRNMjlhTlZsRVl6aExWMjgyWnpKQ1ZGRRAB",
            "text": "It's hard to find a good burger in NYC.  Penrose is on par with my Midwestern expectations for what makes a great burger."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2ekxUM3lRRRAB",
            "text": "They have the best Chicken Sandwich in all of NYC best cocktails too!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RdFNFZHBjVFpVVTBSYVNUaFVURVpET1UwdFUzYxAB",
            "text": "Watered down drinks, mid service. It’s been my go-to spot for first dates in UES but this last visit I was disappointed w my drinks."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WcWNHcFphVEV3YkhWYVNUUk9WWEF5UWtsRlluYxAB",
            "text": "Lovely outdoor seating. Very cool inside, too. Can recommend the place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aakxYaHNWMngyZVRKTGRHUjFRVWM0WmtacVdXYxAB",
            "text": "Great neighborhood place! Came here for brunch on a Sunday, and we had a great experience, from our food to the super-friendly service. Our server was wonderful (unfortunately, can’t remember his name), and the drinks and food came out…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cVJreDJjVFp3YVZrMWEzWlVaRXBvVERCcGIyYxAB",
            "text": "Bartenders girls have very bad attitudes, towards tourists. Very racism toward tourists. Especially the brunette one. I like the place but needs improvement to costumer service. We would appreciate more hospitality ! We would like to come back. Management needs to take precautions!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aNWJrUXRaMUpEWjBOUGFHeDRRblZqWkd4eVJYYxAB",
            "text": "They've been here for over a decade for a reason. Just started going here and it's been excellent every time. The staff, the steak frites, the lobster roll, the house potato chips, the cocktail menu: all stand-outs in a super competitive neighborhood."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTFRuRlNkWEZ1Y0VkbWRqWkJNRU4wT1dSeGRrRRAB",
            "text": "Way cool go-to any time of day UES NYC bar!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGMkxUUXpNR0pKU0U1UFpYaE5WWFpGWm5sMmIzYxAB",
            "text": "Food quality is on the low end.\n\nThey are technically a bar but the seating is more like a restaurant.\n\nThat being said, the fried chicken sandwich was as tough as rubber and difficult to chew,\nand the crunch wrap was not crunchy and somewhat soggy.\n\nThe service was, simply put, cold and unwelcoming.\n\nThe atmosphere was loud and cramped.\n\nThe wait staff and servers behaved like New Yorkers and were rude. I would guess this a decision made by management to staff individuals that \"they personally like\".\n\nI wouldn't recommend this place and will certainly not return. Such a shame."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKSGFEVmpabEZoVW1vd1RuTktSRjl0U21vMVZGRRAB",
            "text": "Love this company bars and restaurants. They are always on point and anywhere you go you feel at home"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLZV92dTZkcDVPQ1VnEAE",
            "text": "Oh my gosh..... the Penrose?! Lets go! ...literally. lets go to the Penrose because it is the bees knees! The food is next level.. when I lived in the UES I would pick up Penrose once a week maybe.. the shishito peppers, the popcorn chicken, even the homemade salt and vinegar chips.... e v e r y t h i n g there is amazing! I only sat in once, and our server Kelly made it a really great experience... huge shout out to Kelly! Whoever mixed the Pickle Martini is also getting a shout out and I wish I got the meet that person.  Penrose is a highly recommended restaurant. During the day you likely won't have to wait long for a table, if at all so get in while you can! Can't wait to go back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKX0h1NnljazUybXRRRRAB",
            "text": "Never went to a bar...First time nevertheless it was alright. Great fries 🍟"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQYkd6X3FNazQzdUhBEAE",
            "text": "THEY CHANGED THE FRIES. Literally devastating. Everything else is still good, buffalo Brussels sprouts slap, but I won’t forget this betrayal"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLdVRtY09YX0p1a01REAE",
            "text": "Love this bar. They have a $10 after 10 of spicy margaritas and other cocktails and a late menu that is really good. Service is super friendly from the man on the entrance to the server. Really fun place with excellent atmosphere. Would come back any time."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJcVhtSTNMck9hRjlBRRAB",
            "text": "We went for a friend's birthday and the staff were soooooo incredible. Great drinks and really good food. Super good spot to celebrate 🥳"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOaUE3Y0xLbHUzcUJBEAE",
            "text": "This is a hidden gem in the city. The food and  the drinks was tasty! On the weekend this place is packed !"
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNaVAteDJBRRAB",
            "text": "숙소근처라 호스트 추천으로 다녀왔는데 너무 좋았습니다\n음식도 맛있었고, 일요일저녁에 라이브 공연도 진행하고 있는데 흥나는 분위기~ 넘 행복했어요\n그리고 여기서 먹은 프렌치 프라이가 쉑쉑과 파이브가이즈꺼보다 맛있었어요...대체 뭘넣은건지...넘나 추천..!\n그리고 서버분도 너무나 친절하셨습니다!\n계속 와서 필요한거 없냐 괜찮냐 보통 미국 어딜가든 다 친절하시긴 했지만 유독 더 친절했던 느낌!ㅎㅎㅎ\n결국 혼자서 맥주 두잔 부셨습니다!"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadnZuQ1dnEAE",
            "text": "조금 시끄러운 편이긴 하지만 안락한 분위기에 친절한 서빙, 맛있는 음식이 있는 좋은 레스토랑 입니다."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUa0ltOWhnRRAB",
            "text": "친절한 직원 그리고 맛있는 음식 덕분에 즐거운 시간 보냈습니다."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLTHlnSk8zcTd5QzFnRRAB",
            "text": "Such a good spot- definitely worth the hype! The servers and hostesses were so accommodating and approachable! Very knowledgeable on the wines and cocktails list! Food and as really delicious we got the cheese board-the spread was so well paired! The bang bang shrimp was good too! We just went for drink and apps but curious and will be back to try other items!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbEl5OFpBEAE",
            "text": "Long time neighborhood staple, fabulously great for a last minute bite. The food and drinks are great but it is the excellent service that really makes the Penrose a wonderful place to dine at. If you are adventurous I recommend ordering the pickle martini. They also have an amazing Happy Hour!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzX01hVmJBEAE",
            "text": "A truly exceptional brunch spot! I can highly recommend the birdcage, south of the border, and the pickle martini! If you like pickles, that is\n\nThe salmon crispy was absolutely exceptional! And my friends and I thoroughly enjoyed the steak and eggs, side of tater tots, which is the go to, of course. Also, the chicken biscuit was extremely moist, and saucy the chicken was cooked perfectly and not dry! We will be back !! Gotta check out dinner"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLR2c0Y21fdzlQTkFnEAE",
            "text": "Lively, cozy and stylish! Truly feels like a local gem. The bang bang shrimp was the best I ever had, the Kale Caesar salad is also great! Also the Dirty Pickle Martini was excellent, and the Espresso Martini felt like a frozen dessert.\nThe only strange thing was being brought the bill unprompted, but the perfection of the shrimp made up for it :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREcUxudGlBRRAB",
            "text": "Best place to hang out with friends and your love ones! All the cocktails I’ve tried were delicious and flavorful, they used the high quality liquor and ingredients. So even I’ve had 6 glasses of cocktails I didn’t feel so drunk just a little tipsy I would say. And Eddie the server she was giving us the best service ever, thank you for your hospitality. Will definitely back!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOGRQRHZBRRAB",
            "text": "I was recommended by my co worker to try this place out, and it was EXCEPTIONAL! My friends and I walked in, and were able to be seated in a lovely booth immediately! They needed the table back by 7, but that was more than enough time! I got the Spicy Pickle Martini, which was SO GOOD, and the Crispy Calamari Po Boy which way exceeded my expectations! It was such a great little spot to catch up with friends! I will definitely be coming back here again for date night, dinner with friends, drinks, etc!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNweklpa1ZREAE",
            "text": "What a great find for casual dining, delicious food, and drinks!\n\nI love the atmosphere and vibe of this restaurant. I felt very relaxed and welcome. The staff were equally as pleasant and took great care of our group making sure we had everything we needed.\n\nThe crispy fish tacos with pineapple salsa and pickled onions was so good and fresh! With a side of crispy tator tots I was set. The ginger mule with fresh and candied ginger was too notch. I could drink that every day, wow. Well priced and delicious meal.\n\nThank you all for a great dining experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEd2NyWFlnEAE",
            "text": "Quick, attentive service where the waiter kept doing a great job to check-in on us. Although no photos, a very beautiful restaurant.\n\nFood was absolutely delicious and affordable! My friend and the Turkey Club while I had the Charred Zucchini Hero (highly, highly, highly recommend - would definitely come back for this!). We shared the tater tots, which were not only delicious but a huge shareable bowl for the two of us."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4M0otNFNnEAE",
            "text": "5 stars for the flexibility, ambiance, and service. We had a lot of changes in party size and time due to our group size and the restaurant was easy to communicate with and accommodating. Ambiance is great: a good balance of chill, low key, but also a touch of up-scaleness. Service is fast and professional. A good spot for a night out with friends and date."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcDVYT0hBEAE",
            "text": "Phenomenal brunch. Fun vibe and extremely tasty food. Menu is a bit limited but what we ordered was delicious. And I would definitely.come back here. Highly recommend the French toast sticks with a berry dipping sauce. Perfectly balanced…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzaC1qa0JREAE",
            "text": "I had an amazing boozy brunch at The Penrose Bar! The Bloody Mary and orange mimosa were perfectly crafted, and the avocado toast with smoked salmon was fresh and delicious. Our waiter and bartender were incredibly engaged and hospitable, making us feel so welcome from start to finish. Highly recommend for a fun brunch with your girls. Five stars!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuN2J6MFFBEAE",
            "text": "Penrose bar on the upper East Side of Central Park.\nWe ordered the fried chicken sandwich, the beef flat burrito, bang shrimp, grilled Brussel sprouts.\nAnd some beers.\nAll in all, it was a decent joint with good service, and the food ok, but nothing ground breaking.\nI had 2 small gripes, I thought the friend chicken was a tad dry and the sprouts a tad too salty; other than that a solid overall bar experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6MjlpMjF3RRAB",
            "text": "It’s the go-to spot on the Upper East Side, buzzing with energy and offering an array of delicious cocktails, mocktails, and more. What I love most? The delicious food and the impeccable service that makes every visit memorable. Whether it’s a laid-back hangout with friends or a romantic dinner date, Penrose ticks all the boxes. Can’t wait to go back again to unwind, enjoy great food, and soak in the vibrant ambiance! 🍹\n\nWe ordered\nMocktails\nPeach Fuzz\nThat’s Amore\n\nBrunch\nStrawberries and cream French Toast sticks\nSteak and eggs\nShrimp & grits\nBreakfast sausage\n\nFollow @spinx17 for more NYC food Adventures!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNVotbmZnEAE",
            "text": "Highly recommend the spicy marg!! Apart from great drinks + deals ($10 martinis after 10!!), the staff is so wonderful and kind!\n10/10 for the brussels sprouts and the cheeseburgers come pre cut in half (win for girls w OCD like me lol)\n\nVibe is also stellar for a first date or light girl dinner if that’s what you’re into besties!✨"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNubFlEaGRREAE",
            "text": "Not usually an UES person for a night out but this place has convinced me to start coming uptown for a girls night out! Great place for dinner and drinks, whether you’re on a first date or a night with friends. Highly recommend the bang bang shrimp, shishito peppers, and the Penrose burger! Super cute interior, fun crowd, and top tier service!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bUtyTDlBRRAB",
            "text": "Food was amazing; I had the steak & eggs. The staff have great energy, customer service, very nice & accommodating. We were celebrating a friend’s birthday here & she was so happy. Our favorite spot in NYC! Highly recommended ☺️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYeXV1UXB3RRAB",
            "text": "The ambiance is marvelous! Low lit, with upbeat music playing nonstop. Grace our server is amazing and so sweet. Newly renovated space gives me a SPEAKEASY vibe! Great for networking, parties, and events. Food of course was 10/10- try the Apple Cider/ Hot Toddy! I really liked how friendly the staff was and the location is very convenient. I’m coming back with all my girlies."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtNjYyVk9BEAE",
            "text": "Great place for brunch! Very roomy and spacious which helps with lesser wait times on the weekends. The inside is very tastefully themed as well.\nTheir French Toast sticks are the most ingenious idea and they’re so delicious…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaN29DS3hnRRAB",
            "text": "Great brunch spot! Came to The Penrose on a saturday at noon and found it suprisingly easy to get a table (at the bar, 25 min wait). The service and cozy atmosphere were great, the bartenders were lovely, and the food was quick to come out. Really liked the burger with tater tots. Their eggs benedict were fine but no my favorite. Really want to come back to checkout their sunday jazz nights!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYeXF1YVBBEAE",
            "text": "you HAVE to try the Thanksgiving Egg Rolls!!!!!!! probably the best thing i’ve ever had. their cocktails are so amazingly unique and everyone was so nice (thank you Grace for being so accommodating!). 12/10 RECOMMEND 🤍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIb3ZlUHdnRRAB",
            "text": "As a native new New Yorker, I have high standards for bars. However, after being at Penrose bar for the first time, I can honestly say that it is instantly one of my favorites. The ambiance, good crowd, delicious drinks, and food were so delicious! Definitely can’t wait to return."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyeGRPYXBnRRAB",
            "text": "We visited during their brunch hours and had a brunch menu provided to us, as well. The ambience and decor was relaxing and had this Prohibition feel to it, which was fun. The staff was very great, and our server Matt was very kind, fun,…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2b05yVjFBRRAB",
            "text": "Food is amazing. The atmosphere is extremely festive, warm and cozy for these below freezing temperatures in NYC. I got the thanksgiving egg rolls and when I tell you I felt like I was at home with the fam, I mean it 10/10. The pickle martini was a must try if you’re into the pickle craze. Extremely crafty menu! A must try if you’re in the city. 🏙️ 😍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0MDU2RVJREAE",
            "text": "I really liked this place! Low key brunch place, not too crowded for Saturday brunch - at easily got a seat at the bar. Food was really good and extremely filling for how the portions looked (not diner sized, kinda normal). I'm told prices are also affordable for New York especially, even though I did the millennial thing and ordered the I think $16 avocado toast haha (with bacon, would have been over $20 if I had gone for the smoked salmon)."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMybHJ5OE5BEAE",
            "text": "So good I got the burger and fries and it was actually fantastic. $28 so expensive for someone with no job 💀 I ate outdoors with my friends and we all really liked it. I also liked the inside when I went to the bathroom it was kind of a…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLb3R1NlF3EAE",
            "text": "Went here for dinner with a friend. Sat inside. Had a pleasant experience and ill be a returning customer. The shrimp was outstanding - our dinner conversation revolved around how we can make it ourselves on our own. The cocktails (the…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMycHN5SzNRRRAB",
            "text": "Went there 11:20am on Sunday, a short waiting time around 10 minutes.\nEgg Benedict is definitely great and tasty, French toast is good. The coffee is just average but it offered bottomless service.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1eDc3Z3ZRRRAB",
            "text": "Very delicious\nFried chciken burger\nFries are just what you'd expect\nThe pickle cocktail is pretty strong and the acidity of it too is strong. 비추.\nThe mac and cheese was good but it was cooked with swirly noodles instead.\nAdd the bacon.\nThe sharable artichoke bread dip is good as well."
        }
    ],
    "reviews_count": 79
}