{
    "name": "Dallas BBQ",
    "place_id": "ChIJOZSQmepYwokRGyoFV_YPkbU",
    "grid": "MN8",
    "address": "1265 3rd Ave, New York, NY 10021, USA",
    "rating": 4.2,
    "user_ratings_total": 3569,
    "phone_number": "(212) 772-9393",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkZlQwZENiVEJrTkRrNU9UVXlTMlJmYmtKNk0zYxAB",
            "text": "Great service, great and affordable food"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aS0xWbGFSMFpzYlRKTllscHlOWEphZVhkQ2VsRRAB",
            "text": "Yummy"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vM01XdERNRzk0TWtOd2MxUm5VVUZEUmtOUGVsRRAB",
            "text": "Our server was excellent."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkTmNuSllXalYyWkVSQ05saE5XRmd3VERSS1ZGRRAB",
            "text": "Food was good but not great.  Our waitress was nice but spoke so low I had to keep asking her to repeat herself.   I had a frozen drink called a Tsunami.   It was really good"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OT1ExRm9TbE10U1Vsa1EzQjVPRTVxT1d4alZsRRAB",
            "text": "We've been coming to this location for over a decade because it's a favorite for one of our friends who moved out of town. Every time she's within an EZ-Pass toll of the city we have to meet up there. Those Sticky Wings, Coleslaw, and Cornbread absolutely never disappoint.\n\nWe were so hungry no one took out there phones to take pics of the food. It was the only quiet time at the table until someone licked their fingers full of the sticky sauce and their amazing BBQ sauce. The frozen drinks are also very popular with our tribe. Our server, Lisha (or Leah) was awesome and very sweet. I hope I remember her name or spelled it correctly.\n\nAnyway... this location is still a great spot. Parking leaves much to be desired but if you're already in the city, take a cab, walk, or bike there. Your appetite will thank you and so will your taste buds. #LocalGem #GoodEats #theresthatfoodie #AVTeats"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKTE1rRnJlamN6Y0ZsaU4zQmFjWHB3YkRSVldVRRAB",
            "text": "Bbq Ribs with fries are the way to go."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aaVUyaFBORFpmTFZjME9ESjFSbk0xUzI5TlQzYxAB",
            "text": "I ordered and had to leave because of the mice running around the dining floor. The staff saw as well but when they noticed me looking they turned away."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0bWJuVjBNR1JyYkVsdGJuTXpWMEpIUXpBelZHYxAB",
            "text": "Yummy In Da Tummy! I had the ribs and shrimp with baked potato and cornbread 😋. I forgot to take pics of my food 🤦🏽‍♀️ but got a pic of my drink. Lol"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkemVXOVRaMmxmVmpRM1UxWkpjVGswTkdRMFNsRRAB",
            "text": "8/7/25, 3pm\n\nI came here with two friends for lunch. I got there first and was able to grab a table, but it took a long time before our waitress even asked if I wanted a drink. Throughout the visit she wasn’t very attentive—we had to ask the hostess multiple times just to get service, which was frustrating.\n\nNow onto the food: I usually get the bone-in sticky wings, but this time I tried the boneless wings. Babyyyyy, these things were HUGE! A 5-piece is definitely sharable, and they were a 10/10. I’ll be back just for those wings alone.\n\nOne thing that threw me off, though: a couple came in with a dog in a duffle bag and were seated across from us. I’m not sure if that’s sanitary in a restaurant setting, and it felt odd to see."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWGRFRlRNRTVRU1dWbk1WOWhiRXAzVVRadmNrRRAB",
            "text": "Took a little bit for them to notice we needed service.  But after, the service was great and food was good too."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xremVIRm5iVWRPTld0TU4xTTRMVGR4WnpCRVprRRAB",
            "text": "I would cone here again"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMnZhY3F3RRAB",
            "text": "GREAT HALF ORDERS ON THE MENU!  $12.99 Half rack of fall off the bone baby back ribs.  They were delicious!  Chicken and a few other options.   Comes with a side and cornbread.   Nice to have a meal without breaking the bank.\n\nPrior review:\nWent back today and food was great....including the baked potato.   It was very fresh, light, fluffy..... perfectly cooked.   I'm glad because I've always liked this place and the prices can't be beat!\nHalf portion baby back ribs were $12.99 which includes a side and fresh corn bread.   Great sauce for the ribs.\n\nEARLY BIRD DINNER SPECIAL is HALF A CHICKEN,  soup and a side for $9.99!   That's amazing!\n\nI'll try the corn on the cob next time.   Love love love corn on the cob.  :)\n\nPrior review:\nI love this restaurant but the corn on the cob was completely waterlogged and their baked potatoes aren't great.   Weird because those are such easy foods to cook.   I think what they do wrong is to cook both HOURS in advance and of course they suck by the time we eat them.    Corn takes only minutes to cook there is no need to ruin it for paying customers.   Potatoes should be baked in the oven which as professionals in business for decades,  this restaurant should time properly so the best is served to their paying customers.   NOT THEIR LEAST.\nWaitress was nice but never came back with napkins or when my fork fell on the floor.  I repeatedly got up and got things myself.\n\nI've been going to this restaurant since at least 1992.  It was much nicer then and the food was always top notch.   Please bring that experience back."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNcXM3bEdnEAE",
            "text": "THE SEATING IS MAXIMIZED FOR NUMBERS NOT COMFORT, SO SOME OF THE TABLES ARE VERY CLOSE TO EACH OTHER. THAT'S SOMETHING YOU EITHER LOVE OR HATE. PARKING IN THE AREA IS CHALLENGING. THERE ARE GARAGES IN THE AREA. GOOD LUCK WITH STREET PARKING."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5dVowSjNOazR3UkZJNFVGaElTMjVLVmpsNFJWRRAB",
            "text": "This place knows hospitality! The kitchen delivers excellence at appropriate prices. You'll appreciate their individual approach. Staff members exceed typical service standards. In general, it's amazing and remarkable !!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oSGQwMUpabXRyVWxobWRWRlllV2x6UWxOUlRXYxAB",
            "text": "It's great no complaints"
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNMVZXOXBiRWxPWkRSd01VdHVkMXBFU1RkSU1tYxAB",
            "text": "L’ambiente del locale risulta poco confortevole a causa dell’aria condizionata impostata troppo bassa, che rende l’atmosfera fredda. Per quanto riguarda il cibo, i piatti sono sostanzialmente in linea con altri fast food, anche se le patate servite insieme ai panini non avevano né un colore né un sapore particolarmente invitante, dando un’impressione di scarsa cura. In compenso, il personale si è dimostrato accogliente e disponibile, contribuendo a rendere l’esperienza complessiva più piacevole nonostante alcune criticità."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGdWRqUlFTM2xzVDNjelIyUjZNM05ITUhGWk1HYxAB",
            "text": "I had a really disappointing experience at this restaurant because of the server, Malubalo. She didn’t smile even once and walked away before I could finish speaking. Instead of placing the drinks and glasses on the table, she just handed them to me directly, which felt very unprofessional. Her attitude throughout the meal made me feel unwelcome. It was honestly the worst service I’ve ever received."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsU1ZIVkJiVEI0Y1VOMlNXSk9SVVJDYjFSQ2NWRRAB",
            "text": "Terrible terrible food, the steak was all fat, undercooked. The ribs were all fat, with hardly any meat. I was charged extra for a refill on water, yes water. The place also smelled like sewage water as they thought it was a great idea to start cleaning the place during working hours. I will never step back into this place ever again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NGMzSjJhRVZPYjNCak9WSTBhamREWlU5blIyYxAB",
            "text": "The worst food I’ve ever tried. “BBQ” should not be in the title of this establishment."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGRFJWbG9RbkJMTW1OWFQwSlphSEZUZFZSa1MyYxAB",
            "text": "The wine list was impressive and well curated"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5d1kyTXhWMEUzWWpoTlNXSjNhM0oyVlRKcE4xRRAB",
            "text": "Our go-to spot (and order) anytime we seek comfort food that guarantees total satisfaction and value for money. Been back multiple times and will keep coming for more."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOUGFWUlFXbGxPZEZKRk5WTlROVzFtY25adFYwRRAB",
            "text": "Food always good. Our server was great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkaE16UnpWSGhGVTFJMFdFWk1hSEl4Ym05eVFuYxAB",
            "text": "The food came out nice and hot, nit crowded and our server was excellent.  Enjoyed everything!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RM1EyNU9iRkpNVFRCVU9VTkxTMEYzY0hWUFdFRRAB",
            "text": "Very tasteful and filling. Drinks were amazing as well."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkRmJtNXBVMnhVUjIxeU0wMURPVEpuWDFGeVIzYxAB",
            "text": "Felt welcomed as soon as we walked in."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxNlJITm5WbVZSY0Y5WFowVTRWamwzUVZoTlZWRRAB",
            "text": "So many unique and delicious options."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21seGRGTlNaMEUwVXpKcFZqbDZUSFpSY0daemJtYxAB",
            "text": "This place should be called NY and we cant BBQ.."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOR1JuQjJWamw2WW1wZk5URlZhQzFtYjNGTVVuYxAB",
            "text": "A trip to NYC is incomplete if you don’t dine at one of the Dallas BBQ’s…a NYC legend. 😎"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GelEybEhNa0pHTUZWR1oySjRSMjUwWnpCTk5sRRAB",
            "text": "The waiter was rude and was rushing us to order. Food was good overall."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSU2JrUkdiRFowTVhWbmVVMDFXbUZtZFd3eFYwRRAB",
            "text": "Honestly, this was the worst experience I’ve ever had at an eatery thus far. The waiter Rosa, was very unprofessional. She was high on a substance. Unwelcoming. And, Very unpleasant for a waitress.\nI asked whats her recommendations? She replied everything.. I asked what’s your favorite beverage? She replied all of them.. why? What do you want?\nI replied honestly, nothing anymore!\nSo my friend begin to cheer her up by flirting with her.. and her energy shifted. I proceeded to order.. BAD CHOICE. Everything from the kitchen was COLD. Except the rice. The manager wasn’t a help either. So we proceeded to have our dinner microwaved\nPaid the bill, tipped her and left.\n\nNever again. They closed the kitchen so we couldn’t order anything else! Please don’t waste your time on this location. It was great back in the day. It’s not anymore. Very weird energy for a restaurant. No music no tv no positive vibes at all! To top it off she gave us the bill while still eating with an attitude bc she couldn’t go home until we were done!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pob2MwcGlVVzlqTFhwRE5qZEViRFpuVjFGU1dWRRAB",
            "text": "Had a great time with family! Liked the nice touch with the photographer."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxZlpWQnlhVTlxZW1sNWJFRTRaSFJRTVhkYVVWRRAB",
            "text": "I went for lunch with my coworker and take make sit in a place I don't want to\nCustomer service unpleasant.\nPLUS when we get there we gonna sit to the tables on right side and the from desk girl following us and said we have to let her know we want to see then she will said where\nI said but you should welcome us they let us know"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsaWNYUjNZbUZDYXpORVVXdG1UVmQ1VlRaVVMyYxAB",
            "text": "Great chicken wings! Giant pieces of sticky chicken wings. The baby backed ribs are delicious too. Very casual and affordable. Take out door is on the side entrance. Take out service was a little slow."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxNTR2cjBBRRAB",
            "text": "Great wings"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxR2FURTJVazh6Ym5GZlNXSmtTWFE0ZERaVmFrRRAB",
            "text": "I only ordered crispy wings as a takeout order.  They tasted like they had been sitting for a while and refried.     I've had much better at other locations.     And, they have a separate takeout counter,  with no one there to take orders"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSU2FtTXlNRTlRVWs5cGVHeGpaMWx2VFZKZllYYxAB",
            "text": "Amazing food and service! Huge portions- very impressed! The $22 classic combo gives me plenty of leftovers for tomorrow! Family had steak and ribs and all were tender, and so tasty!\n\n5 stars for sure!\nLinda"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cVp6YzBVVTVwYkVSaVFsRklRVmxpVjFsZlYzYxAB",
            "text": "Excellent and Excellence!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jd2FXbHZaVlpWTlRBdE0ydFZOMGw1ZHkxRmRYYxAB",
            "text": "Great food 😋"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZMVpVWndhSFppWVhsTFRXVXpRVVJqTVZkeWVsRRAB",
            "text": "Marone🤌🤌 Everything was soooo good!! My only complaint is I got kicked out because I slapped my mama 🙌🤣"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUk9DMWFiRmQyT1Y5Vk1IcDVkSEUwZVhseU5uYxAB",
            "text": "First time trying they Henny Colada"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMSzc0S3k4OGZURDF3RRAB",
            "text": "The food was delicious. The drinks were amazing! our waitress was very attentive. I would definitely come here again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VNLVowNTdXODdhRjdRRRAB",
            "text": "The place is a little bit noisy and the service needs a lot of improvements. One advice do not order your appetizers and main course when your order is taken. If you do that mistake the waiter will bring the food all at once"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNNzVoOURWalBtUVRnEAE",
            "text": "I've eaten at other locations of this franchise before, and this one was just ok.  But the service was very good and loved the location, as it was walkable."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOMjB5TXE3XzhQeGJ3EAE",
            "text": "My fave for eats drinks and memories in the heart of NYC"
        },
        {
            "date": "5달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPLUl0TXVxMXJ5LVVBEAE",
            "text": "Cuisine généreuse, les ribs de porc étaient délicieux, 1 part suffit pour nous europeens. Existe en version double. Salade cesar généreuse aussi en poulet mais pas incroyable. Prix corrects surtout pour le quartier."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJYUtnczZQc3NHZHZRRRAB",
            "text": "Always a good time"
        },
        {
            "date": "6달 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZckpYeldREAE",
            "text": "크리스피하고 맛있는 치킨. 계속 채워주는 물. 담백하고 따뜻한 콘브레드의 향연. 단 소스는 한국인 입맛에는 안 맞을 수 있습니다. 그래도 치킨 자체는 가성비도 좋고 촉촉해요"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyX29TazdRRRAB",
            "text": "정말 저렴한데 맛있고 뉴욕에서 가성비로 좋은 식당이고 서비스도 좋네요"
        },
        {
            "date": "8년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUN3cklOOBAB",
            "text": "일곱명이서 치킨윙 10피스짜리 네 개 시키면 거대하다고 느낄 수 있어요 ㅋㅋ... 윙을 시켰는데 치킨이 나와버렸다는 리뷰는 정답임.\n스티키 치킨윙은 교촌치킨 허니콤보 맛입니다 💕…"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVeDU3UEZnEAE",
            "text": "진짜 로컬 식당이라 현지인들이 가득합니다.\nsticky wings baby rips 맛있었어요"
        },
        {
            "date": "4년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNTb3VyRzZnRRAB",
            "text": "맛있고 서버가 정말 친절함. 다먹고나니 무료로 후식도 주었다.. 굿굿"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuNkp6d1JnEAE",
            "text": "음식과 분위기가 좋아요"
        },
        {
            "date": "8년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnbXBqMVFREAE",
            "text": "윙을 시켰더니 치킨이 나와버렸다"
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNbnVPWkl3EAE",
            "text": "립의진리입니다"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLZjdwYS1mdnFqX25nRRAB",
            "text": "Located in the Upper East Side, this BBQ shop sells a variety of meats and tasty Baby Back Ribs at a very good value. Besides the portions are very generous. Service is friendly and there is a nice family atmosphere."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNHFleWZ3EAE",
            "text": "It was okay I didn’t like the waiters attitude I hate tipping these kind of servers with bad attitudes. Atmosphere was okay but the waiter ruined my experience!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bWJhY1FnEAE",
            "text": "Dropped by for a quick bite with Dallas and was pleasantly surprised. The place has a fun, vibrant atmosphere with fantastic decor. I'm not usually a fan of franchises, but this one really stood out. We only had time for a frozen beverage, chicken wings, chips with guacamole, and an Alabama Slammer. Everything came out quickly, was full of flavor, and hit the spot perfectly before tackling the rest of my day. Sorry about the pics It looks so good we couldn't wait to eat. 😂 And as you can see it was tasty like I said"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbzlQNlVREAE",
            "text": "Great food drinks were amazing our waiter was very nice that’s a plus and fast service !!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNXR2bGlRRRAB",
            "text": "It’s been a long time since I’ve been here and I was actually excited about going and I was disappointed. Our server, I don’t remember her name, was ok. She was not rude but not really on top of things as if she just didn’t want to be there. The mac n cheese tasted off as did the rice. The chicken was good, soup was good and so was the cornbread. The atmosphere was good. But the bathroom was a mess. As I sat there, it brought back memories as to why I hadn’t been there in so long."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQOXNpLV93RRAB",
            "text": "Teníamos muchas ganas de comer costillas y elegimos este restaurante, muy buena elección, probamos las alitas, verduras en tempura, mac&chesse y por supuesto las costillas.\nTodo buenísimo, a destacar las alitas que estaban espectaculares y además gigantes.\nBuen trato del personal y ambiente agradable para disfrutar de la comida."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4bE9mOUJ3EAE",
            "text": "This joint was the bomb on food, price, and portion. But this location only! They lost an overall point when, upon leaving, I asked for their paper placemat and business card, and management was rude. Our server and overall service was excellent. The server was attentive and professional. Our food was abundant and came out all hot at once. I highly recommend this location. The experience was fantastic!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMd3R1YTJ3RRAB",
            "text": "We have not been to this restaurant in 10 yrs and it was a little disappointing. Sticky wings and tempura never disappoint and our waitress Leah was very pleasant n nice. This place needs a remodel  the bar was trashy, my Mom said she walked past the kitchen it was a mess, the bathroom was trashed,  the ppl who clean tables need to check around table for trash on  floor and when we walked out  omg all the trash outside around the restaurant is ridiculous."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyMmRXWmN3EAE",
            "text": "I would not recommend sticky wings or rib. Just sweat and sticky sauce. No savory.  Baby back ribs are okay with drinks.."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPSHN1NmItMDZlV0ZREAE",
            "text": "This is a staple restaurant. I've been going since a teenager. I'm 48 now. I love the prices and the food is very tasty. I always get the wings. Brace yourself for some HUGE wings. I love the crispy taste. The cornbread is so good. If you are visiting NYC you have to try BBQ. IT'S A NY THING!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzekt2OE93EAE",
            "text": "To each their own my date loved it but i hated food was not fully cooker eavry veggie i had was hard like really hard and my chicken was pink also hard and a pound of bbq over my chicken it was awful but the cornbread i did loved"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCMHZtUVdREAE",
            "text": "Updated: When our food came out, some of it was cold or room temp. For all the times I have been here, this was the worst experience with the food me and my family ever had.  Our server was amazing, but the food was bad. We got cold fries and burn fries. Room temp chicken with rice. The drinks were great. The ribs were cold as well. The only thing that was hot was the shrimp. This was in December."
        },
        {
            "date": "2년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQta3RIejZBRRAB",
            "text": "Très bien : découverte de l'enseigne lors de ce 3e voyage, tout est démesuré, le prix est plus que correct (86$ pour 3 hors tips), la quantité au rdv. Vraiment, si vous êtes gros mangeur, on vous le conseille, c'est gargantuesque, la serveuse (Jacqueline) était très sympathique (ce qui lui a valu un bon pourboire), Les ribs étaient bien cuits et bien recouverts de sauce, le steak était cuit à point sur sa fajita, les beignets de crevettes et ceux de poulet bien frits. À voir sur les autres restaurants mais celui-ci est vraiment sympa. Alors oui, c'est loin d'être de la grande cuisine goûteuse, mais côté friture et cuisson, ils assument leur rôle."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURncDZfLU1BEAE",
            "text": "The atmosphere in the restaurant was great. Not a quite place to eat if that’s what u looking for. He waiter was very friendly and checked on us frequently which was a big plus. First time visiting this place in a few years and still enjoy…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPMmZpSl9RRRAB",
            "text": "This was a great experience.... great food and Location. Fast service and spacious. Reasonably priced and nice menu choices. Drinks were fabulous …Lot of people enjoyed the food because was the Manhattan for the 65th National Puerto Rican Day Parade .."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcnZ6Y09nEAE",
            "text": "El ambiente no esta mal, el servicio fue excelente pero la comida le falto un poco mas de sabor,  primera vez que estuve en ese lugar, se que no puedo hablar por todo el menu, espero y la proxima vez que lo visite pueda dar las 5 estrallas,  and mi familia le encanto el lugar."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZbTh2UHlnRRAB",
            "text": "Haven't been to this location in years. The last time I was here, it was under poor management. It has improved a great deal. Enjoyed the food, and the staff was attentive."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHamFmZ05REAE",
            "text": "Was in the mood for wings, and a mixed drink. Thought I would give Dallas BBQ a try.\n\nWhen you enter for dine in, you must show your COVID vaccine card or you can not dine in.\n\nWas seated, if your super hungry, eat a snack prior to visiting, because you will be waiting a while for someone to take your order.\n\nOrdered my wings extra well done, they didn’t arrive well done, no blue cheese, had to wait forever for the waitress (whom was nice).\nThe waitress had more tables than she could deliver quality service to.\n\nIf I am in the mood for wings, I will probably go elsewhere just because the service and food was nothing desirable."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBbGZtM05BEAE",
            "text": "BBQ es uno de nuestros restaurantes favoritos, pero hace unos días fui con mi familia a festejar el cumpleaños de mi hijo y nos dieron muy mal servicio, nunca antes nos habían atendido así de mal, la mesera no estaba atenta a lo que le pedíamos, nos llevó agua cuando ya habíamos terminado de comer y la comida muy buena pero se tardaron 45 minutos en llevárnosla, después pedimos platos y tenedores para el pastel y asco 🤮 tenian arroz entre los tenedores que supuestamente estaban limpios, definitivamente una muy mala experiencia es un día tan especial para mi hijo y mi familia. Nos decepcionaron esta vez 👎🏻👎🏻👎🏻"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBNl9mdkxnEAE",
            "text": "Table seating is fast and food service is also. I have paid a visit to this location several times and have never waited more than 10 minutes to be seated and below 15 minutes for food. Which, in my opinion is great service for such a large location. The waitress are always very pleasant and check up on tables frequently. The bathrooms are always clean. My only push back is having to walk through some kinda kitchen structure to get to the bathroom (depends on what side your seated I believe). The noise level on a scale of 1-10 is 10+. Which makes it hard to hear the crowd your with. But, it's a up beat place. Therefore, it's expected. There is no parking lot. But public transportation make it easily accessible."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtcTk3Q293RRAB",
            "text": "Had a great time at this location, the food and drinks were great as always, and the staff was super amazing. Our server Jackie went above and beyond to make the experience even better; she recommended the new passion fruit frozen margarita and it was a hit with my girlfriend. The 72nd street Dallas BBQ's is always a hit and go to whenever I'm in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWdmVDZzd3RRAB",
            "text": "I have been going to this location for awhile unfortunately the food has not been up to par. I ordered cod fish sliders and they were oily. I ordered broccoli tempura and received a mix of vegetables. Not what I ordered. The drinks are in point in the location. But I ordered to go and did not receive a tsunami drink. It’s a shame because I liked this location but the  quality of the food has gone down hill unfortunately,"
        }
    ],
    "reviews_count": 76
}