{
    "name": "Water & Wheat Upper East",
    "place_id": "ChIJD2aQK95ZwokRtipR7To1S84",
    "grid": "MN8",
    "address": "1379 3rd Ave, New York, NY 10075, USA",
    "rating": 4.7,
    "user_ratings_total": 336,
    "phone_number": "(646) 484-5054",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkQlJYSnZZMFZhYkdoRFRYSjVWRUZCUm5kelZYYxAB",
            "text": "Me and my friends visited this place last Friday. The food was Unbelievable! The Onion/Bacon Pizza was one of the best pizzas I ever had!! Highly recommend this place"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoT1NWTktYekUzVVZGdE1tWkJTbVZ1WW14NE5rRRAB",
            "text": "I ordered the ‘Rigatoni alla Norma’ to take away. I was very displeased that the pasta was way overcooked, and mushy! The sauce was nice and flavourful but that was the only thing that kept it alive. I’ve had airplane food that’s tasted better and has been better presented."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBd1JGVkJiVXB5WjJKVWNubzJWMkpzVG10SFptYxAB",
            "text": "The bolognese was okay (not amazing, however) and they have a romantic, cozy vibe. But the waitstaff seems really disorganized for such a small place. Our waiter ended his shift without giving us the check so we waited for at least 30…"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCT1pWODBSMXBFUjBOSldWVjNXbVp1YmxWdVltYxAB",
            "text": "We really enjoyed our lunch at this restaurant.\nI highly recommend it for both the quality and value of the dishes.\nDuring the weekday lunch, they have a menu under $16 that includes a house soup or salad and a sandwich.\nWe had the Classic Italian and the Caprese — both were generous and very tasty.\nThe bread was warm and crusty, and the soup (butternut squash) was excellent. The beer was on special for $6.\nThe service was great, and they also offer homemade pasta.\nThe music was nice too (“Emotional Bliss” by Sajmoonn).\nOverall, a perfect spot for a quick, delicious, and reasonably priced lunch.\nWe’ll definitely be coming back to try more dishes!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oM1YyVmZRM1ZyUjNZemREQXRZVkJxTW1WaWNrRRAB",
            "text": "Great pasta, great people!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFNVNYRk9hbmxWYVVWbFZrdDNRM05uTmxkbFowRRAB",
            "text": "The burrata was delicious, really fresh!\nPasta and bread was also really really good."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GeVozQlBOR2xPUW1wNWVFMUdibEJZTWpadFFrRRAB",
            "text": "Worse than airplane food. Absolutely inedible. “Asparagus” pasta was just undercooked noodles, steamed broccoli, and no sauce. Indescribably dry. How does this place still exist?"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SS2JVVTVhVjlXTmtOcFRrOUZUMmxGVEdnNGRsRRAB",
            "text": "Took my niece for her birthday. First time here. We were very happy with the food, service, etc. Loved their flatbreads. Will definitely go back."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25saVlUZEthRUZtUkZCTlNsQkNPRUV6WW5ZMVpIYxAB",
            "text": "Really great spot for a low-key date night with some of the most perfect pasta. I love how the servers bring around all the noodle shape options, but I recommend trusting their suggestions for which pasta to pair with your dish — they know what works best.\n\nThe bolognese ALMOST became my favorite in the city (and I order bolognese at nearly every Italian restaurant I try), but it had a bit too much cinnamon for my taste. Maybe it was just an off night. My partner got the lasagna, and the ragu had the same issue — it felt like a game of roulette where we didn’t know when we’d hit a bite with cinnamon so strong we couldn’t taste the meat. If I could order the bolognese without the cinnamon, this would absolutely be my go-to neighborhood spot.\n\nI also highly recommend the bacon and onion flatbread. We realized they only give you bread if you ask, but the flatbread was huge and filling so it worked out."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205T1kybG5YemxZVUVvd0xXRkdVVlY0WlRGeVZGRRAB",
            "text": "Loved it, great Italian dishes!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVeGFrMXZiVE5LTm1Wa2R6TlpaRGRhYURoeWMwRRAB",
            "text": "This place was absolutely delicious. This is one of the first places I tried when I came to NYC and it did not disappoint. It’s a cute little place with seating inside and outside. I would definitely make a reservation, it was packed inside. It was a little cramped but the food made up for it.\n\nI got the vodka pasta with casarecce noodles, you get to choose the noodles you want and they have a handful of options!\n\nLet me tell you, this pasta was so insanely good. The noodles themselves were PERFECTLY cooked and the sauce was so flavorful. Portion sizes were generous, I was stuffed but wanted to keep eating because it was so good. I would definitely come back here!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSGJrVklaME5NYVVwSWFqZFZRMXBHV0hoWlJWRRAB",
            "text": "I’ve been here a few times and overall, the pastas and portion sizes are very good. Their bread with oil is delicious, but I notice they only bring you it if you ask for it. I was really excited to see that they allow you to add burrata to your pastas for $7, but the past 2 times I did so, I found their burrata to be a bit sour / bland. I thought the first time it might be a one-off, but it was the same when I tried it last night unfortunately.\n\nI like that they allow you to pick your pasta shape and bring around a tray for you to select from, but I think some of the shapes they picked are kind of underwhelming and should be replaced with more exciting options that do well al dente like lumache , gnocchi, maybe even a wider rigatoni that holds meat sauce better. The mafaldine is good though! Even an angel hair would be good as a lot of the noodles they picked are kind of small / similar to one another."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abFNubHdSRmhwZHpWbU9YWXpXVTExTW5KTlExRRAB",
            "text": "Had an awesome kale salad and bolognese pasta dish and was 5 Star!!! The service, atmosphere and food was all excellent and they just opened this week.  I highly recommend W&W on UWS……"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MWVGQXRPWFZzWlZOcU5uQktYMjlDU1VaamNtYxAB",
            "text": "The online menu and photos are fantastic, setting a very high bar. Regrettably, our dining experience was just average and didn't match the excitement we felt from their website."
        },
        {
            "date": "1달 전",
            "language": "zh",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKa1pqWkxUbmd4V2xGWFdWZFlWVkY1WWpoQmJrRRAB",
            "text": "服务员在前台手工切面，意大利面很好吃实惠，店里很温馨，服务员是逗比，一直在调戏同桌朋友"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FdGJFWm1XV1JIY1VaTWRHNVVaVEZ1TWxCT1JrRRAB",
            "text": "Best pasta I've ever had"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSNmNGbFpUamh2VFZOMlVHMDNabVo1YVUxVFdGRRAB",
            "text": "Food is beyond amazing here"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prdFpXSmxUVTlCV1hCcWRHOHpPVEJCYzJzNVduYxAB",
            "text": "I went ahead to try it based on the rating on Google but certainly not a 4.7 star place. However, Not expensive either. I personally will not try it twice."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkTlJsazBXWFppUTFoaVJHMVdjRUZmVW0xMlpWRRAB",
            "text": "Had a great meal at Water & Wheat. The Italian chopped salad was super fresh and flavorful, with the perfect balance of ingredients. The shrimp fra Diavolo with spaghetti was excellent – the shrimp were tender, the sauce had the right amount of spice, and the pasta was perfectly cooked. Everything was delicious, and I’d definitely come back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205NlVXMUJVazFhWDBaTlFraENMV3B0VmtKMk5WRRAB",
            "text": "Only a 12min walk away from the Met, this is a perfect cap to a day on the town. The waitstaff were quick to seat and serve us, and were incredibly helpful and friendly. The food was absolutely amazing; all the pasta is made in house, the sauces are to die for, and the portions are perfect for leaving you satisfied without feeling bloated. And for dessert, I cannot recommend the tiramisu enough (though the table next to us ordered the cannoli, which looked delicious).\n\nI absolutely will be back here next time I come to New York!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xab2NUVkxSRU0zUTAxU01GaHJSMkZtWTAxUFIzYxAB",
            "text": "메트로폴리탄 방문후 파스타를 좋아하는 남편을 위해 점심으로 고른 레스토랑입니다.\n결론은….. 별다섯개….!\n정말 너무 맛있어요!!!!!!!\n뉴욕여행 중 먹었던 음식 중에 제일 맛있다고 생각합니다.\n서비스도 너무 좋고 미슐랭3스타 레스토랑보다 더 친근하고 대접받은 느낌이었어요.\n북적이지도 않고 아늑한 분위기에 약간 동네맛집 느낌처럼 가족단위, 개인 식사가 많았습니다.\n\n해피아워덕에 와인도 저렴하게 먹었구요.\n트러플 버섯 플랫 브레드, 봉골레, 그리고 이주의 추천 소스+직원 추천 파스타 면 종류 골라서 먹었어요.\n다른것도 먹어보고 싶어 또 방문하고 싶을 정도입니다.\n\n한국분들 꼭 가보세요..!\n한국에서 먹는 이탈리안보다 맛있기 쉽지 않은데\n맛있어요!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBME5XNDBiSFZQV0ZSR1kxWmpZa1JIVFVSbU5sRRAB",
            "text": "Delicious and reasonably priced food, great service, will definitely come back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sRldFTnRVMWc0WkZoSlltMVJSV3hQYW1WcFEwRRAB",
            "text": "Exceptional food and service. Salads and meatballs are just great. thank you so much. we just walked in hungry and tired and had a very warm welcoming and attentive service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVlpIbFZhMU5rYVY4M2EzaFRORjlJZHpSSE4xRRAB",
            "text": "Food the best.    Fish wonderful, bolognese perfect"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQk5GZDNWMHRTY2s4MldHWkJhSGRQZWxCVGJWRRAB",
            "text": "Stopped by water & wheat and never again. The food was good but the service was not good, my waitress went to lunch never mentioned anything didn’t officially hand off the table, people passed us 4-5x and no one asked how we were if we needed anything. We waited an eternity for our mains they were polite but just not service oriented & I get it being small and things being handmade but i think attentiveness would have gone a long way."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBa2RmaG1RRRAB",
            "text": "Excellent homemade pasta and sauces, great bread, great salad with fresh artisanal greens. Wonderful service in quaint small setting. UPDATE: a few hours later, I got sick from the food, and had to run to the bathroom multiple times at the Lion King show a few hours after lunch at this restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sb2IxaFhWRmhOYkhSRE5UUm9aV2xqZGxKRFgxRRAB",
            "text": "Food: Fresh pasta, fresh bread, homemade meatballs? Say no more! This place is a gem!\n\nThe restaurant is on the smaller side, but perfect for a date or a catchup with a friend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSmExcFBWRUUwT1RGb2F6TkRlVmRaVjJ0U1MxRRAB",
            "text": "Such a delicious pallet! I will grab my favorite every week. No hesitation!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oaFUyOXdlbmRuT1hSR1pDMTVjVGxKVTNSMk5IYxAB",
            "text": "Fantastic pasta!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KYU5sZHNRemRsYVVvNGMxUlVRMWswY3pKS1NHYxAB",
            "text": "Amazing food and services"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMmFVNDBkekIwV2pCWFVGQlpTVWxQV1ZkVWMwRRAB",
            "text": "Great pizza. Canoli was very good. Great service. Very nice lunch."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aUFZFZGxNRWR6YWtGdFEweGlPVVZQWmxSelZHYxAB",
            "text": "Very casual comfortable place to have delicious pasta."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSb1RXSlBPR2RwVTFsRVdYazNZbTFwUmpKRE9XYxAB",
            "text": "What an amazing experience of stellar hospitality. We enjoyed the chicken parmesan and bolognese- the bolognese had deep and slightly sweet flavor, delicious. The waiter kindly and for no reason whatsoever comped our glasses of wine! We will definitely be back next time we’re in NY for another date night. Thank you!"
        },
        {
            "date": "2달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taQ1duVkhhbFZtY1hRM05IUkVZbmxhT0c1NmMxRRAB",
            "text": "Очень вкусные макароны! Съесть что либо до конца — это удивительно для нас )) тарелки говорят сами за себя"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGSmJHZFdXbUpuV0VWZmFrWkNkbnA0TjJzMGQyYxAB",
            "text": "Cute little cozy place, food is good. I recommend bruschetta with ricotta and spicy honey. Service was excellent, helpful and kind."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOc1dHVjNYMDVIY25GV1F6ZGtiVXB0Y0ROdWJFRRAB",
            "text": "Good food and service but very small, very crowded, and thus very loud (at least on a Friday night)."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ga2RrZHBhbWRLWW5kWFFsRkNOa001ZVhOMFFrRRAB",
            "text": "Cute small Italian place to enjoy after the MET. Great food, kind staff and comfy and relaxed atmosphere. The truffle risotto bruschetta and garlicky shrimp were excellent starters. Lunch specials were amazing. Brioche with chicken Parmesan was delicious and soup of day, squash + was yummy.  Go check them out."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214RFdFZ3pjRGhvTVdOYWMwVktlbTlhYlVwSGRWRRAB",
            "text": "Super cute place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdlluSTNWR2x1ZUhoTmN6WmFRMEUwWTNjNFlYYxAB",
            "text": "Best pasta I have had in nyc"
        },
        {
            "date": "3달 전",
            "language": "de",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25neFdHUlFRbWt5VVhWTWNFSTFXazAyYTB4UFRYYxAB",
            "text": "Das Essen war leider durchschnittlich bis unterdurchschnittlich. Die Pasta war verkocht und nicht lecker. Lediglich die Portionsgroße war angemessen. Der Oktopus war leider viel zu ölig, dafür war das Sandwich sehr lecker. Das Ambiente ist einladend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjNGJEaGFMVFIxVGxWelNsUlVja1Y0V0hwR2NYYxAB",
            "text": "Tiny portions (like, ridiculously tiny) and the pasta is way overcooked.\nWe took a taxi there especially from midtown and it was a huge waste of time and money. Disappointing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twQk9XZHFhbFZVYkRFMldrMDRXblpqY1ZWSWMyYxAB",
            "text": "You have to try this place!!! Outstanding!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWRVdsaExha1ZFZDNkblNXNXdVbEo2YWpsalIyYxAB",
            "text": "Eggplant Parm sandwich was good, the Zucchini soup was not good. Place was cute"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oRlJuYzVObWRPTWtSWExUWmtlbE0yY2tSd2NHYxAB",
            "text": "Nice quiet setting. Excellent food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkT2FGQjFVelZ3VTNkR2FrRlRTVVZsV1VaTVUzYxAB",
            "text": "Good food, friendly staff, tiniest bathroom sink in the multiverse."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pab2REbHJSMFpDYVY5YWJuSXpReTFYWW1wU00yYxAB",
            "text": "Pasta was very good and bread was out of this world. Definitely coming back! Adrian who was serving us was very friendly and helpful. 10/10 experience"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxM1QzTnhVbGxsVURscE5sVnlOekF6YTNwbmRWRRAB",
            "text": "Cozy Italian restaurant with homemade pasta and your choice of sauce. The wait staff was very attentive, and the food was exceptional."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odlMweHdabEExVlhkaFZFRk9TVlZqYld0MlVrRRAB",
            "text": "Fantastic spot for fresh pasta. Had the Old School Carbonara and the Avocado Ricotta, BOTH were incredible. The carbonara was definitely true to classic form, exactly what I was craving, and my partner's Avo Ricotta was a delicious, fresh light take, perfect for summer. We'll definitely be back here anytime we're craving a bit of Italy ❤️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaME9GRldSVXRaUjJvMFJWQXhTa2Q2ZW1FMVkwRRAB",
            "text": "This place is a must try !!!!"
        },
        {
            "date": "4달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWcVYzaDNhMGhLTlZwSlJrSjZjbTFaUkhSQmFXYxAB",
            "text": "A dir poco delizioso. Posto stupendo in una zona stupenda. #uppereastsidelover"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvb2FpcV9nRRAB",
            "text": "This is such a great spot for a delicious but casual and cozy lunch! Adrian was our server and he took great care of us.\nEverything we had was great- but specifically we would recommend the octopus (cooked perfectly), anything with bread (we had the chicken parm lunch sandwich), and the vodka sauce with pasta of your choice.\nOther reviews were right about the tiramisu, although we were full we ate the whole thing.\n\nThe vibe was cozy but busy, there wasn’t a moment during our visit that new diners weren’t coming in, but they managed to keep seating and taking care of everyone.\n\nNext time we’re hungry in the area we will definitely be back."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VMYVY5TlAtX0ptMUhREAE",
            "text": "Para un almuerzo rápido si estás en la zona está bien !! Un pecado no salar adecuadamente la masa de la pizza 🍕 la carta de vinos es interesante. La ensalada exquisita, allí no faltó sazón 😜 lo mejor, la atención de Maria🥰 En mi opinión, el baño necesitan más amor en un restaurant, los baños deben estar tan limpios como la cocina."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmOUwydDd3RRAB",
            "text": "Came here with friends for dinner a few weeks ago and loved it! We shared a flatbread and a salad - both great. For my own dish, I got the vodka sauce pasta but it sounds like you really couldn't go wrong with any of the options. Our server was wonderful, attentive, and responsive - and the ambience was perfect! A little small, but cozy nonetheless and not too loud. For dessert, we shared the tiramisu which was also delightful! I'll definitely be coming back some point soon."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQYkNtZW4zODgtVmhRRRAB",
            "text": "Exceptional. Service, food and atmosphere. The reviews commend the bolognese and they are right. It is arguably the best or one of the best I have ever had. Had the meatballs, bolognese, mushroom risotto, and tiramisu. The flavors of all the dishes were balanced and with quality ingredients. Im still confounded on what wine was used in the bolognese. Fresh pasta takes it to another level. Also the bread was phenomenal from the wood fired oven. Food portion and quality is great. 10/10. Will come back to try everything on the menu."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQaWNhV3ZBRRAB",
            "text": "My friend and I had a fabulous evening at Water and Wheat. Jack our waiter was fantastic. He had great recommendations and was the service was top notch. The whole staff was welcoming and the food was just delish. We will definitely be back. One minor point off was the can of Dike Coke for 3.50 each. I think we can do better than that. Overall 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsa0lLVGhnRRAB",
            "text": "The food here is so insanely delicious I cannot recommend it enough!!!\nThe pasta is so fresh and delicious and packed with so much flavor with many options to choose from you will not be disappointed with whatever you decide to try.\nThe service is quick, and everyone is super nice. I definitely had an amazing time here I would come back again in a heartbeat."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqcXNEek5REAE",
            "text": "Superb. Recommended for fresh pasta and intimate dinner, or also to go. The octopus is stellar! Pastas are a must here, and I tried the lasagna which is a top seller, and beautifully crafted, just know that it is not traditional with the dash of cinnamon. The tiramisu was the perfect way to end our meal. Service was excellent and friendly. Make a reservation!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRN051UG1nRRAB",
            "text": "I was craving pasta after visiting Metropolitan Museum of Art & came across this little Italian spot! You choose the sauce & pasta shape! Our server showed us the different shapes & we went with mafalde for Creamy Alfredo with Pesto. We also shared 10 Layer Lasagna… Immaculate!!! Everything was amazing!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twU2NHeGFRVWxyZFU5RGRYVkhSelpsZUhvNFJYYxAB",
            "text": "A gem of a place on 3rd Ave that I came across on Google maps. The margarita flat bread and spicy rigatoni basil was very good. The servers were friendly and excellent. I like the fact that they present you with a sample of pasta so you can choose the kind  of pasta to have with you order and what type  (reg, gluten free and whole wheat). Great place for a date , with friends or  family. Lovely place and looking forward to return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOLU9Ma0VnEAE",
            "text": "Honestly a truly magical experience, now it is a wine bar but their selection is exceptional !\n\nThe service was amazing and I asked for several recommendations, I was pleasantly surprised when my food came out quickly and efficiently.\n\nI started out with the most delicious kale Cesar salad I’ve ever had! Next I hit to choose which pasta shape I wanted which my order and I chose the garlic shrimp, incredible and so fresh. I also had the fire roasted salmon and it blew me\nAway !!\n\nFor dessert you MUST get the famous tiramisu worth it !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOOFpQQTRnRRAB",
            "text": "water and wheat was an absolute revelation. Located in the heart of the UES, this Italian American haven elevates the simplicity of water and flour to an art form in their freshly made pasta.\nThe customizable experience allows you to choose your preferred pasta shape and sauce. The menu extends beyond just pasta, with creative salads that showcase fresh and vibrant ingredients.\nBut the real showstopper? The truffle mushroom pizza - an exquisite combination of rich flavors and that unmistakable truffle essence. It’s a pizza lover’s dream come true. We also got the chocolate pudding for the dessert. It’s a perfect ending to a culinary adventure. It’s so rich and so delicious.\nWater and wheat is a must-visit for anyone seeking an authentic Italian American experience. The attention to detail , the quality of ingredients, and the overall ambiance create a dining experience that lingers in your memory."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcUstbUtREAE",
            "text": "Meatball sandwich Amazing\nParmesan chicken Wonderful\nMeatball flatbread Outstanding.\n\nSelena's service Marvelous"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYemVDXzh3RRAB",
            "text": "What a adorable pasta place on UES!\nThe place is casual and small, full of vibrant chater! Pasta is made on a big machine and you get to choose your pasta shape before they throw it in a pan.\nWent there with a friend, we had pasta Norma and Carbonara! Delicious! Note this Carbonara is made with guancale! If you know you know! We had 2 appetizers octopus and meatballs with flat bread straight from the huge pizza oven. Very nice wine selection for such a small place. I suggest buying bottle, prices are amazing considering it’s UES.\nThey did not disappoint with dessert neither. True gem 💎…adorable and super cute! You will see me again for sure."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMWN5aVJBEAE",
            "text": "Had an amazing lunch after visiting the Met. The portions are ample and price is perfect. We split a meatball appetizer, mista salad, and spicy tomato pasta and left stuffed! Got a tiramisu to go because it looks amazing! Highly recommend Water & Wheat to everyone looking for delicious Italian food in a warm, welcoming atmosphere"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQejV2VXVnRRAB",
            "text": "Fresh made pasta and other Italian dishes prepared and served with love and care. Maybe 10 tables to accommodate 40 people max, but don't be deceited by the size because the food is great. We ordered meatballs as appetizers - so good, tender, and tasty. My carbonara was absolutely one of the best I ever had. Their desserts are awesome, too. You should try the canoli and tiramisu!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREZ3JhbHVBRRAB",
            "text": "Pasta does take a bit long to come out, but the service was the best I’ve ever had! Our server was kind and recommended us the best pasta for our choice of sauce.\nI’d love to come back! Best time to visit seems around 5PM - right before all the reservations kick in for dinner time."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMM0todEdFcnMyY0ZnEAE",
            "text": "Delicious pasta! Sat just outside and it was the perfect day for that! The food was amazing and the servers were super friendly!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMk9iV1J3EAE",
            "text": "I got the panzanella salad was very refreshing!\nIs a cozy  place and you can see the process how they are making the pasta and you eat after few minutes. I had rigatoni with truffle Mac and cheese."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROMGJHTEhREAE",
            "text": "Water & Wheat is a cozy Italian American restaurant with their name inspired with the two components of water and wheat to create the most amazing pastas and flatbreads. An assortment of beautiful pastas was shown to us so we can physically choose instead of googling what it is. Pick a wine of your choice, pair it with a salad, wood fired appetizer and flatbread, and then a pasta. The octopus and flatbread is simply the delicious. Lasagna has the perfect taste that if Garfield was here, I would not have a chance to taste it. Bolognese is full of aromatic flavors that you have to try! Southern Italian cuisine with an American twist. Save room for dessert as they are amazing as well.\n\n2022 Cabernet Sauvignon Bosco del Merlo Veneto 14\n\nMista 19\n\nOctopus 19\n\nTruffle Theory Flatbread 24\n\nWood Fired Lasagna 25\n\nGrass Fed Brisket Bolognese Mafalde 20\n\nBudino di Cioccolato 10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGMXVqVXJRRRAB",
            "text": "Such a cozy restaurante in one of my favorite neighborhoods! Here, you can choose the sauce and the pasta shape (homemade). I decided to order Mafalde with the Truffled Mac N’cheese, love the combination!  They also have delicious flatbreads, meatballs and lasagna. And don’t leave without trying the tiramisu. It’s really good -and I’m not obsessed with this kind of dessert, but this one was truly special. Size of the portions is good and prices are very reasonable!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiOVlYNlBBEAE",
            "text": "My husband and I adore this place!  The food is impeccable, the service amazing, and they are dog friendly!  What can be better?!  They make their pasta in house and it is devine.  If your server is Selena, you are in especially great hands. She is knowledgeable, kind, and such a sweet soul.  Definitely give this place a try (and more) and you won’t be disappointed. Great gem on the Upper East Side.\n\nSelena, if you see this; find me on IG! 😉"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMEkzRVBBEAE",
            "text": "Came here on a weeknight. Since we had reservations, we got seated immediately. The hostess took the time to explain the different pastas that were offered.. I was amazed to know they make their own pasta!!! Right in front of you!!! Me and my group were totally stoked. We ordered the Cacio pepe, carbonarra, and vodka sauce pasta.. They were all good. I also got the mango/pineapple wine and loved it!\nSpecial thanks to Jemma, who was extremely kind and warm."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYZ0lQTDd3RRAB",
            "text": "Came here for my sister birthday celebration and it was an immensely enjoyable time. The indoor space was a bit small and I don't know what magic they used to somehow fit all those tables in there but it worked well enough. Space is basically the only thing I wished they had more of. But the staff was so accommodating, joking along with us, and making excellent recommendations of wine to pair with our meals. The food was delicious and very much living up to our expectations! I wish I took more pics....\n\nOverall, I'd love to come back to this place again in the near future!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzd04xOVlTbkp2YURBd05UbFBTbXQwYkVRMFdtYxAB",
            "text": "Love the cozy vibes of the restaurant. Doesn’t try to be hip and dim, instead it feels warm and inviting. The pasta here was so good too. I’ve had my fair share of pasta in the UES and I’d say this is amongst the best.\n\nGreat service and the tiramisu was phenomenal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGajVXQmRnEAE",
            "text": "Was walking by and decided to try a new place out. There were a few people already seated, but also a few tables available. This is on the earlier side of dinner, around 6 PM.\n\nI got seated quickly without a reservation. There was plenty of attentive and smiling staff to help us. Appreciate that they actually have physical menus versus having to scan a QR code.\n\nOrdered a beef brisket bolognese pasta, lamb flatbread and a salad. All are very tasty! Love that things are being made fresh and with unique flavors. Not sure what the name of the noodle we got in our pasta dish, but it was very tasty and held the sauce perfectly. The flatbread had Mediterranean seasoning and spices in the meat along with pickled onions and garnish. Had it been topped off with a little sauce or aïoli of some sort, would have been even better to my liking.\n\nThe layout is a long rectangular room. Pasta making station in the middle, we’re all of their pasta is made fresh and daily. They have a display case showing their daily pastas, a nice visual, touch! In the back is the kitchen. In the front is the dining room area. They will have to figure out a solution for the door opening right into the dining room as in the colder months a lot of Cold air would disturb the diners.\n\nYou can do takeout, which a lot of people were doing while we were eating. Look like they were getting decent Phone orders as well."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQS0dxYWlNMXJhX1JREAE",
            "text": "Klaivers was a great server! He took good care of us, checking on us frequently and making sure our food was up to our standards. The food was a real treat! We ordered the bruschetta and it was scrumptious, the honey was a nice touch. My husband and I both ordered pasta dishes and were able to customize the pasta type. The tiramisu was to die for! You don’t want to miss this restaurant and the tasty food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURscWJYMjdRRRAB",
            "text": "The food here is very high quality, more than I would have expected! We had the Burrata salad and a couple of GF pastas, which were all excellent. The salad was fresh with creative ingredients. The GF pasta was one of the best we’ve ever had in terms of both flavor and texture. We will definitely be back and will order to go, as well!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3ek8zVVlBEAE",
            "text": "Nice place. I liked how homey and authentic it felt, much more so than other generic pasta places. The only thing I would say is that don’t put the pasta in a box for leftovers. I had it the next day and it wasn’t very good. Overall, very nice place. 8.5/10."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyb1pQYkdREAE",
            "text": "We really enjoyed Water & Wheat when we visited on July 14, 2024. We were in a bit of a hurry so we did not have a lot of time for lunch. The waiter said he would expedite our order so we would not miss our bus. We had flatbread pizzas and they were very tasty. My wife had the grilled vegetables and she said it was delicious. The portions were just right for lunch. The only downside to our visit was we could not stay at the restaurant longer and enjoy dessert. We plan to return and I'd recommend Water & Wheat to anyone who likes pasta and pizza."
        }
    ],
    "reviews_count": 79
}