{
    "name": "Masseria East",
    "place_id": "ChIJfUbyZ75YwokRMi96wHTiLBA",
    "grid": "MN8",
    "address": "1404 3rd Ave, New York, NY 10075, USA",
    "rating": 4.7,
    "user_ratings_total": 317,
    "phone_number": "(212) 535-3520",
    "reviews": [
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KSGRYTnNjVzFEVmpkNFIwNVBhRWxoWDJsV1FtYxAB",
            "text": "I had such a wonderful experience, The food was absolutely delicious every dish was full of flavor and beautifully presented. You can really taste the quality of the ingredients. The desserts were just as impressive — perfectly balanced, not too sweet, and a perfect way to end the meal.\n\nThe atmosphere is warm and elegant, and the service was friendly and attentive without being overbearing. It’s definitely one of my new favorite spots in New York. Highly recommend! 🍷✨"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OTGQyZFdjSGd4VnpOcFgwMUpVVE5vY1U5T1RIYxAB",
            "text": "Always fantastic !!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWVlYaE9NRGMzZDJsNFpETmlkR1pHUkhZMVpHYxAB",
            "text": "At the restaurants request in their response I edited below.\n\nI just had their delivery.    The food was terrible. Had to throw out.  I do not recommend their delivery."
        },
        {
            "date": "2달 전",
            "language": "iw",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GM1ZsUmlhbU5pU2pKWGFXWldXbXhyVVd4bmFGRRAB",
            "text": "שירות ברמה גבוהה, האוכל פחות וזאת ביחס למחיר."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBd0xVdHJTVkoxYVhkNU56VldaRmxTYlRKdk5HYxAB",
            "text": "This establishment is a hidden jewel. I believe it would be well worth your time to visit and experience it if you find yourself nearby."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xaVprRnZSR0ZCYzIxeVZXb3RlVkpZUWxwWmRXYxAB",
            "text": "I hate writing bad reviews, but this place has such a wonderful rating I thought I had to try it. It was so average. Nothing compared to the old Parma that used to be there. Newer and nicer but the food had no flavor and it’s kinda over priced for average. Compared to the great Italian options in the area like Nicola’s, Ellios, Lasardi’s. Probably five or six newer places because I haven’t lived in this area in a long time. But I was very disappointed and I hope it was just an off night."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVVYwcHpWMGxVUjBGTlNGcENlRU51YURGSk1VRRAB",
            "text": "Jummy and elegante good services 🥰😍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GalFteHlSVEkwWXpodGQySnpZMFJsTFRsWlQyYxAB",
            "text": "Excellent in every way. Top notch food. Attentive and professional staff. Comfortable NYC atmosphere. What more could you want??!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WaFZUQlNiamRyV21kWVEwODBjVFZDVlU5dWEyYxAB",
            "text": "Perfect place for a date! The food is delicious and the service is great. We also had good wine. Fully recommended!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWWNDMU5aR1pWUWtKWFdrVk1ORXBxT0RoaVYxRRAB",
            "text": "Nice place, real Italian food and excellent selection of wines. The Staff is attentive. Thank you."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJZUNpYUtBLWNqcHlnRRAB",
            "text": "Great food, welcoming and comfortable."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZd3BILW1nRRAB",
            "text": "The service and staffs are absolutely polite and well mannered. The restaurant was full of locals so it was very cozy and family-like environment. They actually can make whatever you want in the kitchen so don’t be shy to ask! Their chicken Parm was a-mazing and worth the price."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJN082WjJRRRAB",
            "text": "Delicious food, good atmosphere and kind service"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbUwyd0J3EAE",
            "text": "Excellent restaurant, food and service was wonderful."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bXZYc1J3EAE",
            "text": "Family enjoyed a delicious lunch after viewing St.Patrick’s parade. Servers were welcoming & gracious to our family. Appetizers & entrees were wonderfully prepared."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbC1LVmRnEAE",
            "text": "Yes me, late but good person. You no so good."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRelAzOURREAE",
            "text": "Horrible takeout. Don’t know what it’s like there but I deeply regretted my order - food was just so subpar."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdk5UZGZBEAE",
            "text": "As we say in Italian: eccezionale!   Great dishes!  All winners.  Leave some room for dessert!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRek9iYkNnEAE",
            "text": "Not the best Italian in the UES\nService was great, but the food not up to par with the prices!\nHas a small bar, mostly older crowd"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNneHIta0RREAE",
            "text": "We had a spectacular experience! Every dish was incredible—the zucchini, the pasta, and the vitello were all absolutely delicious. And the wine pairing? perfect! Memorable dinner!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcDZyRFJBEAE",
            "text": "Marvelous food fresh ingredients. Artful preparation charming room. Oriente provides amazing service and desserts"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBamF1SjlBRRAB",
            "text": "Great service and food! Very authentic and good neighborhood spot"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBOVBIYVNBEAE",
            "text": "The veal piccata melts in your mouth, welcoming staff, we will be back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ejdmNTVBRRAB",
            "text": "Had a great birthday dinner with my best friend great place great service amazing espresso martinis can’t wait to come back"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2anFETHRRRRAB",
            "text": "We had the good fortune to get a table on a Saturday evening and had a fantastic meal. The white truffle pasta was amazing! And it was chestnut season so we enjoyed some wonderful chestnut cake afterwards. Tremendous service and wine list . Can’t wait to get back there"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQZ1plVWN3EAE",
            "text": "Delicious food and great environment!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQbG9HcklBEAE",
            "text": "Could be the best Italian in UES."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzd01EMlBnEAE",
            "text": "I never leave reviews, but this was outrageous. Overall restaurant, food was ok, not bad. Came with my family. The waiter that we were “lucky” to meet (older guy with dark hair) had no manners, rude, disrespectful, repeatedly made fun of my family members accent (while having a HEAVY accent himself, barely understood him). Didn’t bother to go over specials, even when asked for recommendations. Oh recommended one dish with lobster, again with major attitude. The only reason we stayed was  they finally realized he was being unprofessional and switched the waiter. The manager of the restaurant was very nice and did everything possible to save the night. Would not recommend or go back there though, very disappointing."
        },
        {
            "date": "11달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzOC1Ea2JREAE",
            "text": "Difficilmente mi metto a fare recensioni ma questo ristorante è magnifico in tutto.\nTrovato casualmente io mia moglie e le due figlie abbiamo mangiato piatti di alta qualità con un servizio eccellente.\nAbbiamo avuto anche il piacere di chiacchierare con il proprietario, una persona squisita di grande esperienza nel settore.\nRitorneremo sicuramente il prossimo viaggio che faremo a New York.\n\nP.S. Provate lo strudel, meglio di quello trentino (noi siamo trentini 😄)\n\nConsigliatissimo !!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMHRUaTBRRRAB",
            "text": "I had the chicken parm, which wasn't on the menu but was made special and didn't disappoint in the least. Alongside was roasted potatoes, carrots and broccoli with the perfect breaded chicken cutlet smothered in sauce and cheese. Inside, it's very nice-even the tablecloths are white. Our waiter Davide was attentive and friendly, which made the experience that much more enjoyable. We will be back, for sure!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYaF9mNXR3RRAB",
            "text": "Best traditional Italian food . Excellent service.  Various wine selections."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbWZiZHFRRRAB",
            "text": "Great vibes. Definitely recommend. The staff  is very friendly."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIam9PTDl3RRAB",
            "text": "The rating of 4.7 is what drew me to try this restaurant. Having been to hundreds of Italian restaurants in NYC throughout the past 25 years, this was a major disappointment. It seems they only pay attention to regulars. As for the food, the eggplant Parmesan appetizer was completely dry. The fettuccine Bolognese was completely bland and had close to no meat whatsoever, while swimming in what seemed like canned tomato chunks. In italy, we do not make bolognese like this. The pasta primavera had zero taste. I had to ask three different people for the check which we finally got 20 minutes later. No one asked us if we wanted the pasta wrapped up to go. No one asked us if we wanted desert. Not to mention, when we first sat down, I pulled out a bottle of water from my bag that had about 2 oz left, and I attempted to pour it in my water glass so I can put it back in my bag and throw out the bottle outside, when I leave the restaurant. I was reprimanded for doing so, as if I were a child. Other people may have had a wonderful experiences here, but unfortunately it was one of my worst."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3MS1HRzVRRRAB",
            "text": "Fabulous food prepared with care in an elegant, inviting environment. Warm, attentive service completes the picture. Highly recommended!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1bUtLQzN3RRAB",
            "text": "My main course was fillet of grilled salmon ($39.00) that came with mustard sauce, which I asked to be served on the side so that I could dip into it whenever I wanted to. The grilled salmon was served rare, but I ordered it medium-rare. It had little flavor so I sent it back to be cooked medium-rare. There was little improvement in the flavor. The mustard sauce was okay."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNicWRyZmN3EAE",
            "text": "Linguine alle vongole was one of the least tasty one and that's the only dish I order at Italian restaurants. Unfortunately it didn't taste much. I had to add Parmesan, pepper, and red pepper flakes to make it taste something.\n\nThe bolognese was okay, better than linguine but not the star of the night either.\n\nThe special of the day of salmon carpaccio was good and different twist on the classic beef.\n\nOur waiter was very good. The ambiance is also good - definitely a good place for a date night."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNidk1pQ2dRRRAB",
            "text": "Spectacularly fine Italian dining with impeccable and friendly service. For a greet night out or a special occasion this is authentic Italian at its best. They had a wonderful selection of vegetarian, vegan and even gluten-free options. The sauces and the vegetables were fresh and delectable- the fried asparagus, mushroom risotto and the spaghetti primadora were the most delicious highlights!! Finished the meal with a perfect affogato:)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydmVYcW5nRRAB",
            "text": "Wonderful experience!  The server who’s name I regrettably never asked was so attentive and personable he alone he a reason to go back very soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyb0lHX3RnRRAB",
            "text": "It’s very good but it’s also next to Antonucci’s which is, tragically, a little bit better in almost every dimension, especially ambiance. 🤨"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMaV9iZm5BRRAB",
            "text": "Came for the chicken parm and it was excellent. I always get a little bit nervous when Nat Italian restaurant doesn’t have chicken Parm on the menu but they say they will still make it for you. Makes me wonder why it wouldn’t be on the menu if it was good? Maybe one day I’ll figure it out., I asked the waiter before I sat down if they can do a chicken Parm and he said yes. Didn’t even look at a menu as that was the only thing I wanted.\n\nA bread basket came out with three different types of bread. Breadstick, light color baguette, and a dark color which was very good and very soft. I like eating the bread with their olive oil.\n\nThe entrée came with roasted potatoes, carrots, and broccoli. The chicken cutlet was a nice thickness with breading that stayed on the entire meal, regardless of how much cutting I did. Slathered and sauce and cheese. A lot of cheese. All of the flavors were excellent. Really came together nicely.\n\nThe inside of the restaurant was nice and elegant. White tablecloth with plenty of extra utensils I came at half hour, but I can imagine that this place can get very popular and crowded during peak times."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6ell6aGZnEAE",
            "text": "Had the cacio and pepe 10 out of 10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6OU1Ed1BBEAE",
            "text": "The food was amazing.  So glad we stumbled onto this place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6LTc3R3RnRRAB",
            "text": "We had a nice lunch some weeks ago. I still remember a delicious artichoke salad and a caccio e peppe pasta that was superb. Thanks!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbU95cHN3RRAB",
            "text": "Nada mal un buen lugar para cenar"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqX0tiUk93EAE",
            "text": "The food was delicious, the tuscany wine was really good as well. Fine dining 5/5."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURELWF1XzBnRRAB",
            "text": "Amazing food. Great staff. Impeccable service. Truly Italian."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREdXZYZ3lRRRAB",
            "text": "Great service, food, and ambiance!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkNmNleExBEAE",
            "text": "My mom & I  arranged a semi private luncheon for 18 people with the manager Giorgio. He was patient and helpful. The food was good and the staff were terrific, friendly and attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkcmZLX0JBEAE",
            "text": "The customer had an amazing dining experience with their guests. They enjoyed the fried calamari and cacio and pepe dishes, while their guests had the soft shell crab special and the tagliatelle bolognese which they both enjoyed. The tiramisu was the best they had ever tasted. The staff was attentive and friendly, and the new management, who took over a year ago, focused on providing authentic Italian cuisine with high-quality ingredients and attention to detail. The customer plans to visit the restaurant again the next time they are in the Upper East Side."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0azZQeWNREAE",
            "text": "this place is fantastic. i jus had lunch there and we were immediately greeted by the kindest and most sweet host noemi. she’s pleasant and welcoming. our server, mateo (and aldo) were also super courteous and informative. we went with the meatball appetizer and a chicken dish. (sooooooo good). last time i was here i had the pasta in red sauce and it was jus fantastic. this is a great neighborhood spot and i highly recommend. thank you noemi, mateo and aldo for making this such a nice experience. much appreciated"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKc3NfQ0JREAE",
            "text": "Growing up in a very Italian family it’s not  always easy finding a true authentic Italian restaurant. Parma Nuova is absolutely authentic. The food was amazing and the service is top notch! Thank you for a great experience. We will definitely be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaaXVLUjFRRRAB",
            "text": "Our waiter Davide was super friendly and attentive.\n\nThe food is well-prepared, and the portions are ample.\n\nWe enjoyed our dinner."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcUtPM3lRRRAB",
            "text": "It was overall amazing. The fried calamari was great and the cacio and pepe was to die for. My guests had the soft shell crab special and the tagliatelle bolognese, which they both really enjoyed. The tiramisu was the best we've ever had. The staff was attentive to all our needs and very friendly. The new management, which I believe took over a year ago, focuses more on Italian autenticity with high quality ingredients and attention to details. I will absolutely go back next time I'm in the upper east side."
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWdk9pemtBRRAB",
            "text": "Vera cucina italiana, con cuoco e gestore italiani DOCG. A New York puoi provare tutto, ma quando vuoi tornare a mangiare al meglio, potete andare in questo ristorante ad uptown manhattan e non rimarrete delusi. Consigliati i cucuzielli fritti per iniziare e poi scelto il risotto del giorno, con salsiccia al vino rosso, accompagnato da un buon vino toscano. Terminato poi con un dolce squisito (caprese). Servizio perfetto e personale molto gentile. Consigliato!🔝"
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsM0ktcHFnRRAB",
            "text": "tutto perfetto. Servizio e cucina ottima! Un vero ristorante italiano a Manhattan"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMy1hT19BRRAB",
            "text": "Excellent food and service. Loved artichoke and branzino."
        },
        {
            "date": "2년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbXBpNmpBRRAB",
            "text": "Fortemente consigliato a chi vuole trovare l Italia a New York.... Gestito da Giorgio  trasferitosi dalla Sicilia da molti anni. Aiutato da personale professionale e simpatico..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROdkpfZDJBRRAB",
            "text": "Great Italian food in a spacious, pleasant atmosphere. The waiter was very helpful and patient with us, and the restaurant was very accommodating of our kids during the lunchtime hour. The homemade pasta was really delicious, as was the battuta chicken."
        },
        {
            "date": "2년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwa01uVXB3RRAB",
            "text": "Durante una breve visita a New York abbiamo deciso di fermarci a cena da Parma Nuova. Siamo rimasti davvero stupiti dal l'eleganza, la professionalità e la qualità delle pietanze offerte ai clienti.\nOttimo cibo Italiano al 100% con prezzi indiscutibilmente onesti. Giorgio sin da subito ci ha accolti mettendoci a nostro agio e facendoci sentire come a casa. Anche se l'esperienza è stata breve, mi sento senza ombra di dubbio di consigliarlo vivamente."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxb0xYY1hBEAE",
            "text": "I celebrated my husband’s 75th birthday with a group of 15 and it was a wonderful experience. The food was delicious, the service superb, and the ambiance festive. Everyone commented on a beautiful celebration, and on how they all enjoyed the evening. Thank you Masseria East for a job well done. We will see you soon!"
        },
        {
            "date": "2년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKeC1mRTdBRRAB",
            "text": "Finalmente un ristorante newyorchese dove i prodotti utilizzati sono di alta qualità.\nPer l'italiano che vuole gustare piatti che riportano alla mente l'Italia, ma anche per il newyorchese che vuole mangiare italiano senza spostarsi dalla sua città, Parma Nuova offre dei piatti che accarezzano il palato e riscaldano il cuore. Un esempio tra tanti: I tagliolini cacio e pepe su crosta di parmigiano sono un' esperienza quasi metafisica, estasianti.  Ripensando alla mia cena presso Parma Nuova non riesco a trovare dei difetti: il ristorante è elegante , i piatti sono ben presentati, tendenti al gourmet, che catturano lo sguardo  degli ospiti.\nServizio eccellente, basato sulla professionalità, ma anche contraddistinto dalla simpatia del personale e del proprietario Giorgio, se non ricordo male il nome.\nPer queste ragioni ho recensito positivamente Parma Nuova: un ristorante che con orgoglio  rispecchia la mia Italia e capace di soddisfare i gusti anche di chi italiano non è."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwa09YOXhBRRAB",
            "text": "Amazing service!\nGiorgio was so attentive and friendly! We came in for a dinner and Giorgio made us feel very welcome and gave us a couple of good suggestions for our orders. The wine list is well-curated and everything was delicious! What a great dinner!"
        },
        {
            "date": "2년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKLTc2UzlBRRAB",
            "text": "stile e cortesia coniugati al fine di garantirci le condizioni ideali per apprezzare le meravigliose creazioni della cucina. Accolti e assistiti per tutta la cena, il responsabile di sala ci ha \"sussurrato\" la descrizione delle portate che si sono succedute con intervalli perfetti, nessuna inutile coreografia ma tanta \"sostanza\". Abbiamo ricevuto un'attenzione che ha reso la serata piacevolmente memorabile esaltando ancor di più, se possibile, le sensazioni visive e gustative offerte dai piatti del menu degustazione.\nI nostri sensi sono stati deliziati, grazie Parma Nuova, merita più di ogni altro perché a questi livelli l'arte di cucinare non può prescindere dall'arte del far sentire gli ospiti le persone più importanti."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcU8zSTdnRRAB",
            "text": "I had the pleasure of visiting this elegant and sophisticated Italian restaurant for lunch recently, and it was a delightful experience from the moment I entered until the moment I left.\n\nThe restaurant's interior was tastefully decorated, creating an atmosphere that was both relaxed and intimate—perfect for enjoying a leisurely lunch. The staff was attentive and well-trained, providing great service throughout.\n\nThe Carpaccio di Manzo, a dish I tried as an appetizer, was truly delightful - the flavors were exquisite. As for the main course I had the homemade Ravioli which was outstanding.\n\nFor those seeking a sophisticated Italian culinary experience, I recommend this restaurant, whether it be for lunch, special occasions, or simply when you want to treat yourself. The overall experience was exceptional, and I look forward to my next visit."
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxeDZTY0NBEAE",
            "text": "Qualità del cibo : davverro eccellente\nCucina : se vuoi provare i veri sapori della cucina italiana è il posto giusto. Beverage : Vastissima scelta dei vini.\nPersonale : professionale e simpatico\nLocation : chic, rilassante, elegante ed estremamente pulito\nCHICCA : angolo bar e Wine Wall\nConsigliatissimo"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsd2NDemhRRRAB",
            "text": "We had a fantastic experience hosting our daughter’s christening afterparty here! We had 16 adults and 5 toddlers, and the staff was very accommodating. The food was delicious, and the service was excellent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aGRyX2ZREAE",
            "text": "We had a wonderful evening eating outside. The zucchini appetizer was amazing, as was our pasta dishes (Penne Masseria was awesome). Most of all, the service was incredible, and that made our meal. Everyone was so friendly and helpful, and it made for a perfect experience. We loved this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKcUtmUFpnEAE",
            "text": "I had the pleasure of visiting Parma Nuova that truly exceeded my expectations. From the warm and inviting ambiance to the impeccable service, every aspect of my dining experience was exceptional. The flavorsome dishes, curated wine selection, and attentive staff created an unforgettable experience. If you're seeking an authentic taste of Italy in a delightful setting, I highly recommend this restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNU9haHVRRRAB",
            "text": "First of all, Giorgio is an amazing host. The food was beyond delicious and the service was impeccable. This restaurant has been transformed into a beautiful space. The decor is elegant and inviting. We appreciate everything Masseria East has to offer, and we like dining in restaurants  that are comfortable and welcoming. If you have not dined at Masseria East, call for your reservation today."
        },
        {
            "date": "2년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKckxYVHdRRRAB",
            "text": "Ho mangiato in questo ristorante in occasione di un compleanno. Abbiamo mangiato a base di pesce e devo dire che era tutto ottimo.\nAbbiamo apprezzato oltre alle prelibatezze dello chef, anche le coccole del personale di sala, dall'accoglienza allla cassa, passando per il servizio, tutti giovani preparati oltre che veramente gentili e presenti."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaE9yZFFREAE",
            "text": "Amazing staff and food! Sicilian owner! Very authentic! Can’t wait to go back!"
        }
    ],
    "reviews_count": 71
}