{
    "name": "Heidi's House by the side of the road",
    "place_id": "ChIJE9I-Pr9YwokRQh5-2GjSd-A",
    "grid": "MN8",
    "address": "308 E 78th St, New York, NY 10075, USA",
    "rating": 4.6,
    "user_ratings_total": 417,
    "phone_number": "(212) 249-0069",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKc1YwMVVOMlYyWkRKcU1IaFpSM0ZCZGkxS1ptYxAB",
            "text": "Delicious food and tasty wines in a cozy and relaxed atmosphere"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5VlRGZDFRVUZyUkY5ak5FdGlOamhOZUZRdGIwRRAB",
            "text": "I had the best short ribs of my life tonight.   Legit."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5VlVqbHFaM0ZDU21neFRXNWhOekpUZFhwU1gxRRAB",
            "text": "I have lived in the neighborhood for 5 years and Ed's/Heidi's consistently provides excellent service, yummy food, and delicious wine. Wyatt is an angel and as a transplant from Atlanta, Georgia I am grateful to have southern hospitality right here on the block. This is the spot, y'all'"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjd1NHYzFlVmx3YTB3d00wNXlOSFV3WlhCRE9VRRAB",
            "text": "The best local gem.  I hate sharing…but it’s my favorite spot."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdFIwdEdOVmxVVEhoM09IUjVNVGhDUkdGdU9HYxAB",
            "text": "Very cool little spot on the upper east side with a creative menu and great service. I don't usually start with service, but our server, Jake, was superb --- he should be in the service hall of fame! Friendly, helpful, funny, but yet not intrusive.\n\nHeidi's food is creative and delicious.  We had the Bruschetta with Heiloom Tomatoes and Mozzarella (photo) as an appetizer. For our entree we opted for the special Gnocchi with Mushrooms. Great!! (Photo).\n\nWe will be back . . . again ans again as long as Jake is working that night."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SQ2NraGFTbGR6TW0xNU5FNUNkR1p1Y2toeGFVRRAB",
            "text": "The mac and cheese was delicious, but the service wasn’t great. You know when people think their snark is funny? It doesn’t work in restaurants. The server had so much gall it might have been the owner, but that kind of attitude doesn’t belong in the service industry. The mac and cheese isn’t that good to justify being treated like that.\n\nHe also gave me attitude when I mentioned that online it said they closed at 11 (apparently they were closing at 10). When I apologized and explained, his response was, “Well, Google says a lot of things.” The thing is, their own website doesn’t list hours, and you’d assume like most NYC restaurants, they’d either update their Google hours or at least post them on their site.\n\nHonestly, I don’t understand all the glowing reviews — the one-star ones line up much more with what I experienced. I probably won’t be back- I’d rather get Mac and Cheese at the Smith"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMFNrcEplblE0ZWpKd1owaHNMVE5qVDJVME4wRRAB",
            "text": "Incredibly friendly staff. Good portioned food with an excellent patio to dog-watch. Will be back! And yes, the mac and cheese is as good as it looks. 😋"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xweU0wY3daMHhGYTIxMlFVcGFhbWQyYlU4MFpuYxAB",
            "text": "Cozy, cozy, cozy little spot with scrumptious food and friendly service. The salmon we had was cooked perfectly and served with a sauce to write home about."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWRmJsZFpiVUV5Y1RWdGN6aEZhVmRIVVUxSmNrRRAB",
            "text": "We’ve lived on the UES for years & just now discovered this GEM! I had the mushroom lasagna w/pesto & it was one of the very best things I’ve had at any NYC restaurant. Wow! Excellent, personable service. Out-of-this-world food. Inviting atmosphere. This is a new dinner time regular for us. TEN STARS! ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUU5XdFFNVlJvTm1KRFVubFphakJtVEV4aExXYxAB",
            "text": "Heidi's was the only establishment to respond to me when I needed a space asap for a Shiva and was able to accommodate my needs beautifully.Beth was wonderful and a made a hard circumstance feel manageable.  The space is lovely and the perfect size for my group of 20 or so. Jake our bartender and server was truly lovely, attentive and willing to support in any way he could. The food is delicious and what an array of wine. I will absolutely become a regular at Heidi's as I live in the neighborhood and hope to do a happier event there in the not too distant future."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SmVXTnRlblZNYVRCbmRsbGxUekZRYW5WUldWRRAB",
            "text": "Appalling service from the bartender today.\n\nWe came in for a quick dinner (couple with a young child). Our daughter was starting to act up after a long day of being out and about so we cut our order short realizing it was going to be a challenge having ordered some food for her and my wife in-advance already.\n\nWe ordered a main and a side and a glass of bubbly and the waiter visually and verbally got upset at us and shook his head and said \"really just two items\" and stormed away. Didn't realize there was was a minimum spend requirement and another couple beside us just ordered a burger to share and nothing else yet didn't receive this sort of treatment..\n\nAbsolutely unprofessional behavior from the bartender and maybe needs to be reminded that he's in the hospitality business. The place wasn't even that busy to begin with so it's not like we were hogging up valuable real estate.\n\nFood was average - it's a neighborhood type feel with its own charm but definitely won't be coming back based on the bartenders disgraceful attitude."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWRGNUWkpORzA1VjJwa1VuVTFORXRWTWxSWVowRRAB",
            "text": "We like how the menu changes, sometimes it’s hit or miss."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204M1QwazFiMFpHTjBGUFdIQTBlamgzZFdWcVVVRRAB",
            "text": "Easily a recent favorite spot for sure. Love how the vibes are low-key. The lamb shank was incredible and really hearty. The shishito peppers were excellent too. A strong recommend for anyone in the neighborhood, ideally for 1-2 people."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvOGNLUmNnEAE",
            "text": "One of the most disappointing dining experiences we’ve ever had. Not coming back.\n\nWe waited 45 minutes to over an hour for our food with zero updates. Halfway through, we were told they had run out of fries, which were supposed to be included with the meals. Instead of offering any kind of reasonable solution, we were given just two options: cancel or order the food without fries at the same price — no compensation, no apology.\n\nWe chose to replace the fries with vegetables (the only alternative available), only to find out they charged the vegetables as a paid extra — even though fries were included in the original dish. So we ended up paying more for less, simply because they didn’t have something essential on the menu.\n\nWe also ordered 2 medium burgers and 1 well done, but all came out medium rare. When we tried to address the issue, the responses were dismissive: “this is how it’s done here” or “for the future, this is a place where it takes forever.”\n\nIt’s fine if there are delays or issues, it happens. But tell your customers upfront, not when they’re already seated and committed. Also, making people feel like they can’t ask questions or express concerns is not okay.\n\nIf your restaurant often runs into these problems, at least show some accountability or basic customer care. Unfortunately, this experience was frustrating, overpriced, and poorly handled from start to finish.\nWe ended up paying 50$ per person for a beer in a can and a burger wrongly cooked, without fries and with the side dish we didn’t want."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdDVlUmVnEAE",
            "text": "Guy answering the phone is extremely rude. I was so excited about this place. What a shame"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNE9YY3RBRRAB",
            "text": "This cozy upper east side spot welcomes us with open arms every week (sometimes more than once a week). The delicious food and warm ambiance pairs perfectly with the incredible staff and owners. Put Heidi’s on the top of your list when you’re looking for a perfect spot on the UES."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaTlTZjVBRRAB",
            "text": "No idea how this place has good reviews.\n\nFood is claimed to be all “organic” but prepared poorly. $20 guacamole, $25 for Mac and cheese. Portions are small.\n\nWe got fries that were very burnt and we asked if they can replace them. Waiter replied “that’s how they’re served”.🤦🏻‍♂️\n\nThere are plenty of “small businesses” that provide respectable service and astonishing food. This place is not it."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcE5hN2dnRRAB",
            "text": "Excellent food and even better atmosphere."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfLVAzR3NBRRAB",
            "text": "One of those rare finds. A true gem. Heidi’s offers you an intimate atmosphere with amazing food. The owners happen to be welcoming and warm. Any chance I can, I try to eat here. The burgers are insane, the paella is off the charts! Please run to this place!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMktIWE93EAE",
            "text": "Amazing menu and great wines! Always a great crowd and fun conversation."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfc05xeU53EAE",
            "text": "Kindest, sweetest owners."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfc0pxYmNBEAE",
            "text": "The most amazing bartending I’ve ever experienced! They make you feel like family and their mac and cheese is to die for. Must visit for anyone in the area!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfc0tyTnBRRRAB",
            "text": "The greatest food. The greatest wine and the greatest atmosphere you can have in the upper east side by far. Highly recommend"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfa0pDR0x3EAE",
            "text": "Heidi’s is a great neighborhood find! Great food and great service. Always a warm welcome and a fun atmosphere. Cannot wait to go back soon!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNE1pTnRRRRAB",
            "text": "My FAVORITE local gem."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNElpZEZREAE",
            "text": "Heidi’s House and Ed’s Elbow Room are your quintessential neighborhood restaurant and bar, providing the same great food and different atmospheres, depending on your mood. The food that I’ve had is excellent and what you see coming out of the kitchen going to other tables makes you wish you had a bigger stomach to try it all.\n\nEd’s Elbow Room features some of the friendliest bartenders that tend to your every need and remind you of what service should really be that is definitely lacking at other restaurants and bars in the area."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfb1BXQkpnEAE",
            "text": "Our favorite cozy neighborhood spot! The staff is so kind and the food is absolutely delicious!! I dream about the gnocci and the short rib/shrimp tacos and bruschetta! The shrimp salad is also a favorite."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcGRLTHR3RRAB",
            "text": "This place feels like coming home to your favorite cozy spot that always hits just right. I've been here for date nights and catching up w friends- a perfect place for both.  It's such an ideal NYC neighborhood hangout- the food is ALWAYS outstanding, and the ambience (think cool jazz tunes, no tvs) is exactly what I need after a long overstimulated day."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcHBhcDl3RRAB",
            "text": "The space was small, and the service was unfriendly and rude. The cramped layout caused people to accidentally turn off the lights repeatedly, and there was no system in place to manage overflow. In winter, opening the door let in cold air, making the entire space—and the food—uncomfortably cold."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bWVIQV9nRRAB",
            "text": "Heidi's house isn't just a local bar; it's a charming neighborhood gem. The wonderful staff make you feel instantly at home, and while the drinks and food are excellent, it's the warm, welcoming atmosphere and the people that truly keep you coming back. If you're looking for a truly special spot with undeniable charm, Heidi's is a must-visit."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dFB1ZnZ3RRAB",
            "text": "Favorite local spot"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2eUxDMHF3RRAB",
            "text": "First of all, when you're in NYC on the Upper East Side, this is a *must go* spot. Not only is the food excellent, but the staff is exceptional. The owners are locals who embrace their customers and constantly consider their feedback. Perfect atmosphere, and an eclectic menu worth trying. Consider me a regular at this spot!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cjdYeDhBRRAB",
            "text": "I absolutely love coming here!! Such great service and a cozy ambience. Definitely try the shishito peppers, truffle Mac and cheese, and date pudding- they are sooooo delicious! Best Mac and cheese I’ve ever had!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2OTlyMVZBEAE",
            "text": "If you're in search of an unforgettable dining experience in New York City, look no further than Heidi’s House. From the moment you step through the door, you're enveloped in a warm, welcoming ambiance that strikes the perfect balance between cozy and elegant. Our server, Freddie, was so sweet and funny. He is so knowledgeable about the menu and it is apparent that he is passionate about this place. He really made us feel like an old friend. And the food is jaw-dropping. The mac and cheese? Oh. My. God. It’s spectacular. It's not just the best mac and cheese in NYC—it’s hands down the best I’ve ever had, anywhere. I ordered it with jalapeños and you certainly can’t go wrong with a little bit of spice and a whole lot of cheese! This is my favorite spot in the city. It’s unmatched on all levels and I can’t wait to return again and again and again!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dDUyZzZRRRAB",
            "text": "The BEST mac & cheese in the neighborhood.\nMy favorite is with truffle oil.  Pro tip: Order it well done so it's extra crispy!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dDhHWWVnEAE",
            "text": "Wow! All (chorizo/jalapeño mac and cheese; wok seared shrimp salad; etc) was delicious - but seriously, that meatloaf? “Best of melt in mouth” winner. Date pudding, chocolate soufflé. All outstanding in a small family-run UES treasure."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MTdIaXpnRRAB",
            "text": "The food was meh for the price. I heard they wouldn’t give someone hot water."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2LTg2RmZ3EAE",
            "text": "The service was not good. The food was mediocre as well. Would not recommend."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQbHF1OEtREAE",
            "text": "cute spot! good service, food was extremely meh especially for the price. would come back for a drink before a dinner elsewhere"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQcHBYczVRRRAB",
            "text": "Extremely disappointed by this place. I really wanted to like it but each dish was uninspired. The Mac and cheese was doused in nutmeg. To make matters worse, check for two apps, a main and two beers and a glass of wine came out to $160. I really don’t take any pleasure at all in leaving a bad review but thought others should be warned."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbnQzX2hBRRAB",
            "text": "Fantastic food, drinks, and service."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbnZfTjhnRRAB",
            "text": "Best in the biz -- I've been coming here for 10 years! Food is wonderful, staff is always so gracious and helpful. I tell everyone about Heidi's House and look forward to every visit. Many a celebration here too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNHVIT1JBEAE",
            "text": "Tiny spot with an interesting atmosphere. Unfortunately the service was not very friendly and the burger was bland. The chairs were also very cramped and not comfortable. They also suggested a 25% tip on the credit card machine which I had to manually change to a more reasonable tip amount. That annoyed me the most. With all of the thousands of restaurants to go to this one is not worth the hype."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NmM3WkZBEAE",
            "text": "I am very confused at what I am missing here. Tiny portions with average food at best. Friendly, but useless service. Ambiance and decor are very solid. They serve $14 canned beer. What's the draw? Would rather make Mac n cheese at home...."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURicHZQOENREAE",
            "text": "We enjoy every second at Heidi's. The food was phenomenal and the wine even better. This is our go-to place, since we discovered it, we mostly go there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidXVDMW5RRRAB",
            "text": "Was first introduced to this place a few days ago and have since gone twice! Absolutely love the atmosphere and the warmth and friendliness of the staff.  Have tried a few things and have been disappointed at NO points. The bruschetta and tuna tartare are wonderful. The shrimp salad is delightful! The burger hits. The fries are great. I could go on and on. While they have a smaller menu, they do what they do really well. A perfect place for a catch-up with friends, date night, an evening of me-time - whatever you want! Love that there's no TV and just light jazz playing - it really works to eliminate distractions and means you can hear your friends! I loved my experience so much I'm actually gonna be back here next week but what a delightful meal - definitely working this into my stable UES rotation."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNidjU2cUhREAE",
            "text": "One of my favorite restaurants on the UES by far! The mac & cheese can be made gluten free and it's AMAZING. We also loved their roasted artichoke salad, paella, tuna tartare, and hamburger! The cozy atmosphere here is unmatched and this place is truly a hidden gem. Highly recommend making a reservation because it's definitely a popular spot"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiZ2FER1FnEAE",
            "text": "We had an amazing experience here! Went out with our (sometimes picky) kids and everyone loved their food. The big surprise of the night was the date pudding it was delicious! The service was great and the vibe was perfect. This is a real Upper East Side treasure. We will definitely go back again and again!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNieXFpcjlRRRAB",
            "text": "Heidi's House is a GEM on the UES! every time I walk though the door I'm treated warmly, like an old friend. Their staff is always attentive and gives great recommendations on the menu items. Their food is too die for in real life. Everything I've had there has been delicious, you can't go wrong with whatever you choose. Run don't walk to Heidi's, you'll definitely be making it a regular in your going out rotation."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiOHJucHdnRRAB",
            "text": "THIS IS THE CROWN JEWEL OF THE UES - I'm so happy I live close by (but would take the subway). What I consider a real NYC establishment filled with atmosphere, great drink selection and food that is the fresh and delicious. Intimate setting that always fits the bill for me. Wonderful staff and a great place to strike up a conversation especially when you're dining solo. Have had probably everything on the menu!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNidk1xcFdREAE",
            "text": "This restaurant has such a lovely, intimate vibe and the food is even better than the ambiance. We ordered a bunch of things to share and nothing disappointed. I think my favorite was the mac and cheese and the artichoke salad. The dinner was delicious and I cannot wait to visit this perfect neighborhood spot again!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEZ3NiTGpnRRAB",
            "text": "The cozy atmosphere of this place is unmatched! Seating is limited so come early or make a reservation because the food here is fantastic. I loved my burger — the thick patty, sourced from Ottomanelli’s (for local UESers), had quality you could taste. It’s served on an English muffin which is unique and totally works! This was one of the few burgers where I didn’t feel absolutely stuffed/heavy after eating it which was refreshing. Highly recommend ordering it with the white cheddar cheese! The low lights, soft jazz, wooden furnishings, delicious food, and welcoming service make this place an easy 5 star 🙌🏼"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRaVAtRWRREAE",
            "text": "This place is really cool I came here for a private party and had exceptional service.  I would definitely come back to grab a drink at this bar.  The restaurant next door are also the same owners.  The food was delicious and a large selection of drinks.  Very nice owners as well! The Paella was delicious!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsa3NqRjRnRRAB",
            "text": "Cozy, intimate + amazing food. Thoroughly enjoyed the night’s specials. A gorgeous lasagna, bufala mozarella salad, chocolate soufflé. Lovely neighborhood spot. Will be a mainstay for me."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvODdiYXlnRRAB",
            "text": "What a wonderful gem on the Upper East Side. I knew they do not take reservations and that the place is very small, so I came in for an early dinner at 6 pm and the place was about half full. Ambiance is more on the dark side and music was…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJOU4yNXhRRRAB",
            "text": "A cozy and relaxing place with a small bar and a couple of two-people tables. We had their daily specials: roasted artichoke salad and lamb chop, and also paella and date pudding from the menu. The salad ($22) as well as the paella ($30)…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURscTQtMmdRRRAB",
            "text": "Heidi’s is the perfect place for a quiet and intimate dinner date. The food is exceptional, the staff are kind and attentive and the music played is cozy. I highly recommend Heidi’s because the service is consistently amazing."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZX0tHUzR3RRAB",
            "text": "Small, intimate, very busy yet you can hear yourself talk... no reservations, however call ahead to put your name on a list. Excellent Paella plus many Mac n Cheese options. Had fun on my date!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1aGJMWWFBEAE",
            "text": "It's a great neighborhood spot tucked on 78th between 1st and 2nd - away from the noise and bustle. I've had their crab dip, Mac and cheese and their burger. Smaller portions than what I'd prefer but all craft style and delicious. Always a little treat to spend some time here!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBcDl5dDlBRRAB",
            "text": "Charming hosts, thoughtful of every detail! Cozy and authentic. Feels like you are having a signature dinner at your grandma’s. Everything looks delicious, and tastes even better. It’s a pity I don’t live in the neighborhood. Next time l’m around, I’ll be back for dinner!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiM0tfSktREAE",
            "text": "Absolutely love the intimate atmosphere here. I am also gluten free and the accommodations from the staff here were INSANE. This is actually the best gluten free mac and cheese I have ever had. Also do NOT skip the paella. The staff was so friendly, the food was 10/10, and this is my new fav comfort food spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNidkxTcG53RRAB",
            "text": "Heidi’s House is my go to restaurant in the neighborhood where there is always a welcoming feeling by the staff and owner.   The food is always delicious with different tantalizing specials all the time.   I am always learning more about different wines and craft beers from the bartender.   I would have to say that Heidi’s is consistently comfortable for me and my friends.  I would highly recommend the paella and mac & cheese with a Sunday beer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNidkxEclpBEAE",
            "text": "My favorite upper east side neighborhood gem! Not only do they have my favorite pear cider but the menu is all of my comfort cozy favorites. This bar has immaculate vibes you want for a night out! The staff and owners are truly so friendly! You are missing out on not trying this spot asap!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRNXJmcW13RRAB",
            "text": "This is a GREAT date spot. My boyfriend and I shared the paella which was really really delicious, as well as the sticky toffee pudding. We got guacamole to start but I don't really remember it, which isn't necessarily a criticism of the guacamole, the paella just stole any thunder to be had."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiM0plVVp3EAE",
            "text": "Always look forward to dining at Heidi’s. Everything from the food to the ambiance to the service is absolutely delightful. Make sure you try the pasta special (ESPECIALLY if it’s a gnocchi dish). The meat specials are also always incredibly tender (short ribs are unbeatable when they have them). Sounds basic, but their guac and hummus are also the best around."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNaVlMYmdnRRAB",
            "text": "I really like this place, it's very relaxed with good wine and beer. I personally think the dining side is slightly nicer for the ambiance.\n\nThe food here is really good while everything is a little on the expensive side it's worth it.\n\nStaff here are great and always engaging with customers do don't be afraid to say hi."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNidk5ERXBnRRAB",
            "text": "Loved it so much the first time, we had to come back! The staff, the atmosphere and of course the food is absolutely amazing. Paired with a wine recommended by their knowledgeable staff, it is a dining experience you’re sure to enjoy. Do yourself a favor and find your way to Heidi’s House!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2NkxUTTF3RRAB",
            "text": "Decent paella, pasta of the day was mediocre and was just an expensive beef stew without too much flavor.\n\nChocolate soufflé came out nice and googy and had a nice kick of booze to it.\n\nLighting is a bit too dim to enjoy food."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnNmQyaXV3RRAB",
            "text": "Warm and inviting, from the bartender to the wait staff, even an employee from the back of the house carried on about one of his favorite dishes that he regularly orders made me want to order it!!! Simply lovely local place I never discovered till walking the dog!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaXJTM3N3RRAB",
            "text": "Heidi's House is a cozy little spot on the UES with great food and service. We started with a reasonable bottle of wine and then ordered the Mac N Cheese, which was creamy and full of flavor. My friend enjoyed the Chorizo Tacos, and I had the Roasted Artichoke Salad, which was delicious. The food did take a bit to arrive, but the overall experience was nice. It's a good place for a relaxed meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiM0lmN29RRRAB",
            "text": "Heidi's House and Ed's Elbow Room are my go to UES spots! The staff is lovely and food and atmosphere are unbeatable. Every dish I have tried is top notch and their wine and beer selection are excellent. Perfect place for a cozy date night or catching up with friends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxaGRPLUl3EAE",
            "text": "The true essence of a neighborhood gem - quaint & cozy!\nWill have you coming back again and again once you have a taste of their food (BEST BURGER in the area hands down!) that brings complete joy and comfort, wonderful wine selection, and DO NOT SKIP DESSERT...or underestimate the salads.\nThe date pudding is not one to miss- also a goodie to stop in just for dessert & wine/coffee.\nService & hospitality that is on point and makes you feel at home.\nGreat date night or catching up with a good friend for hours.\n\nEd's Elbow room next door is also superb and a spot you'll end up chatting with whomever is next to you and marking a new neighborhood friend!"
        }
    ],
    "reviews_count": 72
}