{
    "name": "The East Pole",
    "place_id": "ChIJbY3-ye5YwokRWOG8XH8DqSw",
    "grid": "MN8",
    "address": "133 E 65th St, New York, NY 10065, USA",
    "rating": 4.3,
    "user_ratings_total": 554,
    "phone_number": "(212) 249-2222",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oNk5HOTZWWFZZYWtoWGJXUndVV28wVW14aE5WRRAB",
            "text": "Terrific brunch spot. Best home fries ever. Small menu."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jeFUwMTVhREZ6U3paTGIwSTRUbFUxTkUxVlozYxAB",
            "text": "The food is great and they are dog friendly, we sat outside and they had heater lamp and blankets. Really enjoyed our evening here, service was top notch. Will be coming back when in NYC!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OUFZUaGtTMU5NTTNCa1JXbFROMlJQTkZkNWMwRRAB",
            "text": "Always wanted to try and glad I did."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wS2MwVjZSbXREVTFsbldtaGFkSEJwTjJGNVgyYxAB",
            "text": "Phenomenal dinner. Definitely listen to your server when they list the specials."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3MU9VVjZVRlpsUkRGYWJUSjJTRkkyY25kWGVVRRAB",
            "text": "This review should be more like 4.5 stars. I love that it is inside an old brownstone - it makes it extremely charming. The bar area js very nice, and the restaurant is cozy with nice surroundings. We loved the music they played on a Saturday evening, it was not too loud and not too faint. The music selection was great. Drinks were great too, and the food was very good. We started with the burrata and the squid, and both were tasty. Small portions, but they’re the appetizers. For dinner, we ordered the Truffle Pappardelle and the Grilled Pork Chop. Both were excellent, and we did enjoy it. Portions were on the small side for dinner as well, especially the Pappardelle. It was homemade pasta, and I truly appreciate a good homemade pasta. Can’t remember what we ordered for dessert, as it was a month ago that we dined here. All in all, we enjoyed our meal and our experience here, but felt it was priced a little too high. Having said that, we would come back, but it would not be a regular restaurant for us."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWGFUbFBjSEpqZVZnemFISTNVV3N6YURSclgwRRAB",
            "text": "I came here with friends and family ahead of a day of wedding dress shopping, and the staff here set the bar high for an incredible day. The food and drinks were perfect (10/10 shakshuka) and the staff were so fun and kind."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1M1ZVOUNSVTQ1Y25aV1RuSktWR1JZTFROT05HYxAB",
            "text": "I had brunch at The East Pole before going wedding dress shopping for my best friend. The staff were so incredible, giving us celebratory spritzes to celebrate the day and were so understanding after our train made us a little late. The East Pole also had delicious food and cocktails! It was the perfect start to our day of wedding dress shopping!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paV00xZDFOVkpmZFdkV1FsSmxWbXh4ZFZKS05tYxAB",
            "text": "This is truly a great place. Far exceeded expectations. Some of the best brunch food I have had anywhere. Staff was great, atmosphere was great and just a memorable experience!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kM09GWklkR00xV0VkMlZrSm1XRUV5WjBWelFtYxAB",
            "text": "Always a favorite. From a first date to family dinner. The host is fabulously amazing and will make sure you're taken care of"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMVdFcGtUbFZWTURCRE5Ga3dWMU5sYW0xNk1tYxAB",
            "text": "The prices are insane for what you get, in a bad way, overpriced. $9 dollars for a tiny cold brew filled with ice. Asked for soy milk, waiter said sure and then another server brought us, no soy milk and a Diet Coke instead of regular. They don’t have soy milk but our waiter sure didn’t know that, the waiter also got a lot of our order wrong and never brought me hot sauce when I asked for it. Also he upsold the steak and eggs special and then forgot to ask how we wanted the steak and how we wanted the eggs. He has to come back and ask … He seemed pretty stoned, do you man but at least do your job right. The food did taste good but I wouldn’t go back. Also someone illegally parked their Mercedes in front of the outdoor seating with their dog left in the back, so the alarm kept going off. Rude."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKSFNuWjNjVkozU2pFNE5rVnRiREUwVUd4eFNWRRAB",
            "text": "Wow! What a fantastic place to dine at! A welcoming host who graces you with a warming presence, we had the pleasure to be attended by Celian a great server with such attention to detail, amazing person to be attended by, Joe the chef was fantastic! His special appetizer for the evening was to die for! The food was outstanding the flavors that mixed with another were fantastic! Brian the manager made sure we felt at ease and that we enjoyed our evening he was attentive and caring such a treasure! Definitely will be back! Amazing restaurant!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGaFdtTnFTMTlFYlVJMWJWaDZSVTFSVm5OS1JrRRAB",
            "text": "A splendid corner for brunch or after hours meet ups."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rNWFGbzFVR1o1YkhsNVpESlhTWGhOY2paVVNuYxAB",
            "text": "Great experience! Food was great ! Love that they have outside sitting area. Very accommodating stuff."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SNVVsaHBRbmxZWlRReWVXWjVZMGh4WTFwcU1GRRAB",
            "text": "This rating is obviously relative to East Pole’s cost. If you compare East Pole to a mid tier American style restaurant that’s half the price then I’d give East Pole a better rating. However, for the price they are not worth it. I’d recommend The Smith if you want an American restaurant with a fun atmosphere, better service, better food and cheaper prices.\n\nSo let’s dive into East Pole! Starting with the food. If you want to talk about shrinkflation, East Pole basically coins the term. Portion sizes are small, especially for the price. Their burger (which they love to say they’re known for) is smaller than my fist (I have small hands) and mediocre at best, while costing the same as some of the top burgers in NYC. Their omelette is ok flavor wise but not for the price. Their eggs benedict must use the world’s smallest eggs and the amount of bacon is embarrassing. Flavor wise, you’re better off going to a diner where you’ll get something slightly better, double the size, and half priced. I will say their grilled cheese and tomato soup is good but, in keeping up with the theme, tiny! Seriously, you can make grilled cheese and tomato soup at home that’s bigger and probably just as good. To say this is the other star dish on their menu is pretty embarrassing. Oh and their coffee is terrible despite their attempt to have interesting coffee concepts, and small. Somehow their coffee is smaller than the normal amount of coffee you’d get elsewhere but still costs more. The one good dish on their menu that does stand out vs other restaurants is their banana bread - but not for $15!! Don’t even bother with the cocktails/brunch beverages. While $18 for a Bloody Mary is sadly typical in NYC now, their cocktails still keep up with the theme of half sized and underwhelming, so a fair price would be $8 or $9. If enough people want me to, I’ll go back and try their other dishes to comment on those as well, but I promise you they’ll be small, expensive and underwhelming.\n\nSo what about service? With such high prices the service must be fantastic right? Wrong! I’ve had dishes come before drinks and I’ve had dishes come not at all. The server is nowhere to be seen after you order and when you finally get your food and finish and are ready to leave because it’s been two hours, good luck getting your check. The servers seem nice enough but definitely do not work for their tip.\n\nNow in all fairness, it might not be the servers fault because the layout here is so bad. NYC restaurants are notoriously tight on space but East Pole takes tight to a new level. You can’t get into a booth seat without pulling out the table and the people next to you moving their table to the side. Good luck if you need to go to the bathroom, they only have one for the entire restaurant (if you manage to get out of your booth seat without knocking over the drinks on the table next to you, that is). If they have more than one, it’s unclear because there’s no one to ask.\n\nSometimes a restaurant needs a wake up call to shake things up. I’m sure they used to be decent until they become so popular and mainstream. But seriously, if you’re looking for this type of food, you can do way better at a lower price point with a cool atmosphere. If you want high end American food, check out basically any restaurant in the West Village."
        },
        {
            "date": "3달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJeGJ6YzVORGR2ZEZjMVgyRmtiaTFaTFVRellVRRAB",
            "text": "Parfait et service adorable 👌"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMR1ZsOGZtM3BDUEdnEAE",
            "text": "If you get drinks make sure to order drinks from Lexi! She is the best Bartendar I’ve ever had! She makes amazing old fashioned’s but also any cocktail you can think of! She’s a legitimate mixologist and she deserves props! I’ve order food here before many times and the food is incredible as well! But today I have to give all the praise to the amazing Bartendar Lexi! If you love cocktails and she’s working get ready for an experience because she incredible!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcVQySndjbGRRZEY4MVlWcGllVFYyVERkcVdXYxAB",
            "text": "Not worth a second visit.\nFood here was hit or miss. Some dishes were excellent (Kale Cesar salad, Goffle Road Farm Chicken), but others were bad. Avoid the \"Grilled Rack of Lamb\". The meat was poor quality and not prepared well. Also, the spicy hot \"harissa yogurt\" was a bad flavor combination choice with lamb (my opinion)."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOS1IwWkJNMkYzWWpSa2NITlBVVmsyYTFoVU4zYxAB",
            "text": "Great food and amazing service.\nThe best grilled cheese I’d ever had in my life!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sM1dEZEtWWFZwU0V4dlZHRlZhbEZ5VkUxU1gyYxAB",
            "text": "The East Pole was a new place for me to eat. I got there hungry and in a hurry with a group of runners after a park race.\nI ordered the eggs Benedict with Canadian bacon and home fries, a dish that I have enjoyed many times.\nUnfortunately, everything about the meal was not done well.\nThe Canadian bacon was over cooked and dry almost like crackling, the home fries were also over cooked, the eggs were well over poached and finally no hollandaise sauce on the eggs. I made several attempts to get the waiter's attention without success. They were serving the rest of my group of friend. In the meantime this hungry guy who was in a ruch ate his the meal.\nEventually, I gained the waiter's attention and explained my findings about the meal.\nHe seemed surprised to what I commented, and asked if I was sure of what I said.\nI didn't replied. I asked for my bill, paid and left."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GR1RFWkxRMGxaYTNjd2NIVlZWMGh6U1ZGeVFVRRAB",
            "text": "The kitchen knows exactly how to make taste buds happy. Restaurant workers added something special to our visit. The convenience and atmosphere enhance each other. Their dishes have predictable taste profiles. I believe you'll enjoy this restaurant."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxRlIwSkJhRmxLU21SNFJsTkJVbE5PYUhaaVJHYxAB",
            "text": "We had an amazing meal at The East Pole! The special avocado squash salad was light, fresh, and beautifully plated — a perfect start. The salmon was cooked perfectly with a crisp skin and tender center, and the truffle duck pappardelle was absolutely decadent — rich, savory, and full of flavor without being too heavy. Every dish felt thoughtful and well-balanced. The space itself is cozy yet elegant, and the service was warm and attentive. Definitely a place we’ll come back to!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQS3JxcXpaamF5cDR3RRAB",
            "text": "From start to finish, my experience at The East Pole was nothing short of exceptional. Set in a beautiful Upper East Side townhouse, the restaurant strikes the perfect balance between refined elegance and inviting warmth.\n\nI began with the Local Market Greens salad, a fresh, vibrant dish that celebrated the simplicity of peak-season ingredients. Lightly dressed and perfectly balanced, it was a clean and refreshing start to the meal.\n\nThe highlight of the evening was the Faroe Island Salmon, served with red quinoa and fennel salad, and finished with a subtle yet distinctive wasabi vinaigrette. The salmon was seared to perfection—crispy on the outside, tender and flaky on the inside. The quinoa and fennel added texture and brightness, while the wasabi vinaigrette offered a delicate kick that brought the dish together beautifully.\n\nTo finish, I enjoyed the apple cake with ice cream, which was both nostalgic and refined. The warm spiced cake paired perfectly with the cool, creamy ice cream—comforting, flavorful, and beautifully plated.\n\nWhat truly elevated the entire evening was the hospitality of Brian, the General Manager. His warmth, professionalism, and genuine care for every guest did not go unnoticed. Brian made sure the experience felt personal and seamless—something that’s increasingly rare and deeply appreciated.\n\nThe East Pole is a true gem. With its thoughtful menu, charming ambiance, and exceptional service, it’s the kind of place you’ll want to return to again and again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kRFlrRTRWWFZ0TTNGeE9FSTJZVEZQVFVablIzYxAB",
            "text": "Everything was wonderful, but the pasta I got with the pine nuts and tomatoes was WAYYYYY too cheesey for me. The grilled cheese was bomb and I would only go back for that."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VQeWktZnVJZ29HXzZnRRAB",
            "text": "Ordered the frittata for brunch. It was extremely dry and tasteless. The market vegetables used was potatoes and lettuce (or bok choy stems).\nEveryone else enjoyed their entrees.\nThe servers were attentive however they did not clear the plates."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQZnczSmpyaTd2S3FBRRAB",
            "text": "Excellent staff and host here. They have always made us feel welcome, and there is always something new and exciting on offer. Food and drinks are both top notch."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VKLVN2WWFscXVhenh3RRAB",
            "text": "Limited menu, took a long time for service. Had one drink and left."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VNS2k0ZWk3c3NYVDd3RRAB",
            "text": "Unfortunately, will not be returning there. This was a no for me. We received unfriendly treatment from the hostess right away, who was refusing to sit us because one person was on their way (5 min behind) while the restaurant was half empty and they had tables to sit us at. And when I asked nicely, she was just rude about it and kept repeating like a robot that they don’t seat anyone unless everyone shows up. While our server was very nice and tried to make our time good, the first impression was something we could not shake off. On too of that food was very bland and tasted bad. Avocado toast for $24 was very basic and no flavor. The boiled eggs tasted very bad too. Honestly, I would not recommend this place to anyone."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNMmRpNy0yOWVfXzFnRRAB",
            "text": "Such a cute restaurant with incredible food and absolutely lovely staff that make you feel at home!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaktQZlhBEAE",
            "text": "Awful awful service. They never checked on us, completely forgot our appetizers, we’re not apologetic at all."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdlp6bEhnEAE",
            "text": "Wonderful food, great service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM2MzSEJREAE",
            "text": "Way too expensive (around 100 $ per person) for the bland, sad food. Cocktails are nice and  ambience at the bar way better than at the restaurant, which is overly dark and somehow sad."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvc1oyMlpnEAE",
            "text": "I never leave any reviews because I don’t care for them, but I have been to hundreds of restaurants, specifically in the city that serve quality food, have big portions, and charge accordingly. However, the food I had there was rather bland tasting, pretentious, extremely overpriced, and the portions were small."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOHZDN3NnRRAB",
            "text": "Food, drinks and service all excellent. Thrilled to get a reservation so easily on short notice, which isn't always easy on a Sunday. Nice atmosphere, a little tight seating but expected in NYC for peak Sunday brunch though. Would go back again"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcUtiX3R3RRAB",
            "text": "I swore I was not going to write a review for this restaurant because I should’ve opened my big mouth while I was there. But it is really bothering me that I didn’t , Hence why I am writing this review. I went this past Thursday evening at 9 PM. The restaurant was packed. Our seating was ultra tight and the chatter in the restaurant was excessively loud. I usually like a dimly lit restaurant, but this was dark and dismal and I had to use the flashlight on my phone to see the menu. I could not hear what my husband was saying during most of dinner. A couple of times I had to tell him to text what he was saying.\nThe salad I ordered was nothing but mixed greens with 2 tidbits of shaved carrot and oil on top with possibly a few sesame seeds, no flavor “ Whatsoever“for $22. The (approx 8oz) squash soup was sweet  and strange tasting with a small spoonful of crab in the middle for $28. Nothing that we ordered, was impressive or worth the price. Even the dessert was blah! I left starving and felt like it was a complete waste of $180. The waiters are very nice, but at the end, they left us sitting there while we were desperate to get our check and go. I should’ve complained, but I didn’t, because I honestly don’t think they would have cared, it’s embarrassing, ruins it for everyone else in the restaurant and just puts such a damper on and already disappointing night……we won’t be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJeUpUNG5BRRAB",
            "text": "Horrible staff. It's not worth going, especially in an area where restaurant staff will be more professional to you. Poor performance form\nThe hostess and waiter."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3a3NYWXlnRRAB",
            "text": "Absolutely delicious. You can not go wrong with anything on the menu. Great drinks from the bar. One of my favorite restaurants in the Upper East Side. Very good spot for private events as well. 10/10"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dk1IVElnEAE",
            "text": "There are 3 small stairs down to the front door (I’m sure there is a handicap accessible ramp somewhere but just wanted to point it out).\n\nWe dined for brunch at the outdoor patio (there’s also a space heater if needed) and street dining. The inside looked beautiful and opens to bar top seating and then dining area. We had great service but expect really pricey coffee ($7-9) and entrees ($40pp after tip without coffee).\nWe shared 2 dishes and both were very delicious! The eggs benedict ($27) was cooked perfectly with a rich hollandaise. I asked for the home fries cooked well done and they were absolutely crispy and lightly seasoned to perfection! The portion of the thick cooked bacon was generous. The macro Bowl ($35) was very filling with a creamy tahini dressing. The dish is presented deconstructed but forms a great bowl when mixed together! I would definitely come here if the dishes were just $10 less but a great experience overall!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdThYZ1RnEAE",
            "text": "Perfect dinner spot. Good variety for a small menu, all delicious."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneW96LVh3EAE",
            "text": "Great brunch food (the staples)… however the eggs Benny’s bacon was VERY overcooked and dry. I had to take the time to chew through it. The shakshouka  is decent."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBdDU3eVhnEAE",
            "text": "Great experience."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBbDdUNzRnRRAB",
            "text": "Will return soon."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBeDdIWG9BRRAB",
            "text": "Top quality."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcGZXdXlRRRAB",
            "text": "We sat at the bar and the bartender was so friendly making our drinks and even came up with a great mocktail for my wife.  The gnocchi was delicious as well as the apple pie for dessert.  Highly recommend, bar is open seating, but would recommend reservations."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBd0liV3BRRRAB",
            "text": "My group had the pleasure of hosting a brunch in The East Pole's private dining space last weekend and everything was spectacular. The food, beverage, and service were phenomenal at every turn and I cannot recommend this team enough. This is a yearly event for my organization so we will be back again and again and again..."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfNVpuZTl3RRAB",
            "text": "Excellent shakshuka and eggs benedict"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfcXAtX3BBRRAB",
            "text": "Kyle and team took such great care of my friend and I. We ordered the shrimp toast special (devoured it), the truffle paparedelle and the double burger and all were fantastic.\n\nThe service was super attentive and quick, and the ambiance, playlist and lighting were also on point. Second time going and will definitely be back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNHNUTGhnRRAB",
            "text": "Excellent food and excellent service"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNGJpZ29nRRAB",
            "text": "Overall unremarkable with value poor for the amount of food you get. The atmosphere is also nothing special. If you have no other place to try, you could try this place to satisfy your curiosity, though I was overall unimpressed. It is not bad, but also not remarkable. Paying what we did for the amount of food we received was not a good deal."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NFpueGhRRRAB",
            "text": "We had a great brunch with family and they were able to accommodate our group of 7 on short notice. The service and food were fantastic and we will be back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2aE9iZEhREAE",
            "text": "Do not hesitate, this restaurant is truly one of the best restaurants in New York City. Wherever you are in Manhattan, I would urge you to travel here.. not necessarily because it has the fanciest menu or the best decor, but because it just has really really good food with some of the best staff I have ever experienced. I visited here with my dog who is blind, they have an indoor and outdoor seating area. Every person was so lovely and accommodating and friendly and the food and drinks were absolutely delicious. I had a cocktail that was so delicious they ended up ordering another one, not because I wanted it but because it was just so tasty. I went really simple with lunch and had a grilled cheese with tomato soup, this was like the best grilled cheese and tomato soup that has ever existed. Everything was homey and comforting and the staff really made the experience what it was."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUcEtEYk1REAE",
            "text": "The East Pole in New York City offers exceptional service with a friendly and attentive staff, making each visit delightful. The food is consistently excellent, with dishes that are expertly prepared and flavorful. Situated in a prime location, it's a perfect spot for New Yorkers seeking a relaxed and sophisticated dining experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiMmU2dUR3EAE",
            "text": "Waiters and bartenders were extremely friendly! The food however was not the greatest. To me, nothing really stood out. I had the oysters to start which were not extraordinary given the price (pretty average). I got the steak as the main course and let me tell you - that was the oiliest steak I’ve ever had. Definitely didn’t feel like a winner after eating it. In fact, I kind of felt ill. The atmosphere of the place was also off - it’s more of an intimate setting, except the lighting was so dim we could hardly see our food in front of us. Lastly, the kitchen service was very slow and normally I would give them the benefit of the doubt, especially if the restaurant was busy. But alas, we were one of three tables sat. Probably wouldn’t go back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIb2NyRlF3EAE",
            "text": "First time here and it won’t be the last! There was a small mix up with firing orders from the kitchen but it resulted in us getting our food faster which was perfect because we were so hungry. Our server was incredible and recommended the Wildflower cocktail which I loved. The host was very accommodating and super welcoming too. Overall, an excellent experience and I’ll be sure to bring anyone that wants a quality brunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNONmNPa2lnRRAB",
            "text": "The food was terrific! Came here for lunch/brunch today and the food was fabulous - I went with the eggs benedict and the home fries are crisped to perfection, the english muffin toasted and buttered to everyone's delight, and the brioche french toast was light and airy with the freshest berries! The service was wonderful and the atmosphere incredibly cozy - the host was kind and welcoming and our server, Pete, was great! The coat check was a nice plus for a blustery day. Well definitely be coming back here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiXzR5SE53EAE",
            "text": "$$$\n\nRandomly wandered into this place after the west side was cut off from driving.\n\nLocated on the east side of the city, this restaurant has both outdoor and indoor seating.\n\nOrdered the Huevos rancheros: blue corn tortilla topped with beans and cute little side dishes of guac, onion, salsa verde.\n(Make sure you tell em how you want your eggs, otherwise they'll come runny!)\n\nGrilled cheese and tomato soup\nI've most certainly had better but this wasn't a bad spin from the classic...\n\nThe home fries are where it's at! Crispy, tasty and fresh!\n\nService here = exceptional.  Everyone down to the host was awesome and extremely helpful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkbl9Td2t3RRAB",
            "text": "Stumbled in here for solo brunch. Has an adorable tea time vibe with natural light from above. Simple yet well-rounded menu and quality / details of the food makes everything feel elevated. Will definitely be back. Cute for girlfriends or date brunch or even solo! Also the wine list is excellent. 💕"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLeTZyWDdRRRAB",
            "text": "Great brunch place! The avocado toast with the 6 minute eggs was delicious and so did the home fries that were incredibly crispy and tasty. The only thing that wasn't great was the french toast that didn't feel like it was marinated enough in batter before being fried. Great place nonetheless! Very recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYajlDbmRREAE",
            "text": "Great people all around! Watch for the girl at the coat check cuz she’ll pressure you to give her your bag/coat (just kidding she’s all jokes it’s great)! Coffee was great, food was great, and people at the bar were extra friendly. Def a great time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREbmN1ZU1BEAE",
            "text": "Stumbled into this place via a work event at Park Ave Armory. The food was delicious and the service was excellent.\n\nI would absolutely go back for a proper meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3c1k3RVVnEAE",
            "text": "Stopped by here with my wife and 2 year old after balloon story. The entire staff (greeters, bar tender,  waitress, etc) were super friendly. Cocktails were on point- Citrus & Smoke was my favorite. My wife got the grilled cheese and soup which was delicious and I had the macro bowl (pictured). We walked to the Central Park zoo after which is only 5-7 mins away. I would definitely go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNueThIbGdRRRAB",
            "text": "It was lovely evening with my friends. Cocktails were great and also I want to mention you gorgeous host (he worked every Friday and Saturday), he was so kind, outgoing and show us great hospitality, we were happy to had conversation with him."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiaWY2MG53RRAB",
            "text": "The East Pole\n\nLayout/atmosphere\n*Marble bar (11 seats, candlelight); tables and leather booths in back room; coat rack by host stand; tables under awning and under umbrellas on sidewalk\n\nService\n*Friendly bartenders; wore aprons\n\nFood/drink\n*East Pole Manhattan (Rye, Ramazotti, Cherry Herring, Spiced Cherry Bitters) - good; cherry theme definitely comes across\n*Heirloom Tomato Salad (grilled avocado squash, jalapeño kefir aioli) [special] - glad I tried it; wasn’t a fan of the squash but the tomatoes were ripe and the dressing had a little heat yet still refreshing\n*Double Burger (thick cut bacon, Vermont cheddar and secret sauce on challah bun) with fries - Good; juicy patty and the choice of cheese complimented the patty; bottom bun didn’t hold up but a minor quibble; solid portion; fries were crisp and salted\n*Brown Butter Apple Streusel with vanilla ice cream - Good; warm butter and the crust just melted (in a positive way)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2NF9MeXp3RRAB",
            "text": "Go for the civilized outside dining - improved from the average UES restaurant by being on a tree lined cross street vs. one of the busy avenues. Good cocktails and wine offering. Menu is well balanced between New American classics and healthier options."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2NjhHMV9BRRAB",
            "text": "Been here before for brunch and I was not thrilled , however,  I stopped by for drinks and light dinner and it was great. Love the outdoor and imdoor sitting. Great customer service & welcoming staff. Drinks were exceptionally excellent &…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6OVpDdDd3RRAB",
            "text": "Fantastic food with a great atmosphere. I got the double cheeseburger with bacon and enjoyed it. Truffle upgrade on the fries was worth it. Two ice cold pilsners went down smooth."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqenRiUmZBEAE",
            "text": "Best French toast I have had in the city. Also eggs Benedict were amazing - the thick cut bacon & crispy home fries were perfection."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxajRXd05BEAE",
            "text": "Great food, drinks and coffee. Nice seating, dog friendly. The banana bread was to die for, and definitely recommend trying the guava Bellini. Will definitely be back for brunch!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3N1BheERREAE",
            "text": "Ordered half a dozen Oysters for appetizer and Smoked Salmon Tartine with watercress and crème fraiche.  Fresh and delicious. Beautifully presented.  (See the photos) LOVED IT.  What I especially enjoyed about The EAST POLE  is that it’s quiet and you can hear yourself and your party talk. The guests are upscale and polite. We got a nice cozy booth and we thoroughly enjoyed ourselves. Definitely check it out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYaTVlemFREAE",
            "text": "The East Pole is a fantastic spot for a night out! The atmosphere is cozy and inviting, with dim lighting that sets the perfect mood. The service is top-notch—the staff is attentive and makes you feel like a valued guest. Be sure to make a reservation beforehand, as it’s a popular spot. The only minor drawback is that the tables could be a bit more spacious, but it doesn’t take away from the experience. The food is excellent—both the burgers and salads are delicious, and the French fries with truffle are a must-try. Highly recommend for anyone looking for a memorable dining experience."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtbjhmMWdBRRAB",
            "text": "Eaten here twice so far, will be returning for more! Brunch until 4pm, food and service is always wonderful. I recommend making a reservation for quick seating and service.\n\nI have had the Brioche French Toast and the Banana Bread. Both are delicious!\n\nThe french toast is huge and very filling - I can never fully finish it.\n\nThe banana bread comes with a small dish of vanilla madagascar butter which always goes well with the bread.\n\nMy family has had the huevos rancheros and raves about it as well!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJd2V5azB3RRAB",
            "text": "Friendly staff, packed and noisey on main floor. Second floor dining room much less crowded and more comfortable.  Pork chop was tasty, though small. Vegetarian pot pie was really enjoyable. We will come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuLTRfUVZREAE",
            "text": "Our neighborhood favorite. Great place for brunch, dinner or a quick snack at the bar"
        }
    ],
    "reviews_count": 72
}