{
    "name": "Brasserie Cognac Upper East Side",
    "place_id": "ChIJt1jhrutYwokRMG84lxydIuQ",
    "grid": "MN8",
    "address": "963 Lexington Ave, corner of, E 70th St, New York, NY 10021, USA",
    "rating": 4.4,
    "user_ratings_total": 529,
    "phone_number": "(212) 249-5100",
    "reviews": [
        {
            "date": "14시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toRGVXTk9iR3hxYVhGU01GcHVkRmQ1WkZaME9IYxAB",
            "text": "They went out of their way to meet my needs. The menu reflects a commitment to taste and freshness. Fresh ingredients in every meal. The service makes you feel valued. Their employees delivered outstanding service also. This restaurant delivers exceptional quality."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOallWRTNRMlUzUmtGWU4ydHBPVjk1TmpaVlowRRAB",
            "text": "I went there with my friend which is a male  and the guy who might be the host just said hello to my friend even that I stepped in first, than the same guy took us the the table and asked my friend if that table was ok, he never looked in my direction, like if I was not there. Maybe for him men are more valuable than women."
        },
        {
            "date": "3일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twb1JVaDBkV05EY25CMVEwcHlha3BzU1VOWlFWRRAB",
            "text": "El servicio y la comida muy bien, deberian mejorar el tema del baño."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCTlZYWk5lVmR3YlV4dmVreG9PVFp5TVdkSFVsRRAB",
            "text": "It’s a shame nice vibe but raw chicken.\n\nThe waiter agreed and took it away, we then waited 20ish minutes for the new order to come out and it never came.\n\nIt was very busy and the service was poor.\n\nI don’t complain much but this was very disappointing."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwRmMxZDJOVlZzZEdaYVUxRmFkMFl6YjNKWlMxRRAB",
            "text": "Romantic spot with tasty food. Don’t expect fast service, it’s more relaxed. Upsetting that an establishment as nice as this doesn’t have Apple Pay though."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kRFVqSk9ZemRFTVdsa1lXUXhaMVpwT1RVNU4yYxAB",
            "text": "This is just fine. Foods are fine but nothing impressive."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSNVVUaDZRV1JHVmtacFJqbFVaVUZZUjNOWGFYYxAB",
            "text": "This is my go-to restaurant when I’m looking for good food + cozy, charming atmosphere. The service is always good and the wait staff is wonderful."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4MWQzbExObVU1ZVVSWE5tWjJNMXBWUlMxMWRFRRAB",
            "text": "This spot deserves recognition as a local standout. This spot has a great vibe and wonderful staff. Their plates satisfy hunger and their staff is kind. Their approach to service was outstanding! Relish your meal!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0QlVtdHlRbEZwYkRWbmFuVmpVMDR3VEVKbU5HYxAB",
            "text": "Cognac is just the right establishment to lift your mood and have  bunch and/or a  cocktail before a visit to one of the nearby art museums. The service was friendly and sophisticated, the atmosphere casual and quaint, the food excellent."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zd01EYzFTVWRHWm1OclZGWk5TV1paYm5RNFVIYxAB",
            "text": "Great service and delicious food. My friend and I had the avocado toast, kale quinoa salad, and crème brûlée. Their Sauv Blanc is the perfect amount of sweet!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSVF6VmZUSEJYTW0xQk9FWktOMGh3YVhadWRsRRAB",
            "text": "Except for the gougeres/cheese puffs, this place has the most unextraodinary French food in the entire city. I want to love it because we live two blocks away, but every time we try it, I am less than awed. Today's mistake was a nicoise salad that lacked any type of flavor and had a can of flavorless tuna on five lettuce leaves. Never, ever again! I do not care if this place is on InKind! Blech."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSWF6QTFZVWhHTFVSVVFWaE9PR3RLTTB4MVNYYxAB",
            "text": "De la misma cadena que Serafina, un clásico de NY. Gastronómicos profesionales. Recomiendo."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ocVFtSmZaMjVZU3pGNFYxTmpSRmRSUlRCV1NtYxAB",
            "text": "Very nice good and people"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poM1gzUndZVUpZZVUxc2RUZFhlbnBOUkdaQmVIYxAB",
            "text": "The food prices are what you’d expect in the neighborhood but it was delicious the drinks had really good prices though to the point I was shocked. Great spot to get a drink after work."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214dWRHMXFiRUkzUjJkaFRUVXRURVEzTURCWGFuYxAB",
            "text": "Walked by earlier this week & thought the menu looked nice so went there today for lunch. What a disappointment. I ordered the Boeuf Bourguignon The meat was very tender & came apart nicely but the sauce was utterly tasteless even the consistency looked watery. So disappointing\nI declined dessert for fear it would not be good.\nHow they can call themselves a French restaurant is beyond me."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SdGVYUXdOVzlzUmpWdVNsVmFNM2QzVW1WaGQzYxAB",
            "text": "This restaurant doesn't take shortcuts on authenticity. This spot maintains the perfect mood. The team responds to inquiries with genuine interest. The kitchen understands both taste and quantity. Well done! Coming back for sure!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkVVExWnVXa1Z6YjFoVGVWTnhkVmRvYkZWVVZuYxAB",
            "text": "Stopped in for a late lunch. Got promptly taken care of at host stand. Our waiter immediately paid attention to outperform table, service was personal & very professional. Shared a frisée salad, and each had an entree sized classic steak tartar. Both dishes were superb! The experience was truly delightful from beginning to end. Decor a bit tired. Highly recommended."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KVGRGbEthbVF0YTBZMVRrOVlkMlEwT1RadlNHYxAB",
            "text": "Ok, food was 3.8...just not quite 4. Place is nice, good atmosphere, crazy lady was playing some video on her phone super loud, wait staff shut her down quick. Great place for a glass of wine on the terrasse. Had the traditional soupe and the paillard, both fine."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhN3B2eUt3EAE",
            "text": "Solid French food spot."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oakxYa3hTV1pRV1ZodU9WZGZkMUpTTXpsTVVrRRAB",
            "text": "I was visiting a friend at a nearby hospital and after leaving wanted to treat myself to a wonderful steak dinner. A quick search brought me to Brasserie Cognac. Upon entering, I was immediately greeted and brought to a seat. I felt welcomed from the first interaction. I was brought some water and bread with their delicious butter. I saw Escargot on the menu and couldn't remember if I had ever tried it so I ordered that as a starter. It paired well with the buttery garlic crostini and had a nice bite to it. For my main course, I ordered the filet mignon (cooked to perfection at medium rare) which came with mashed potatoes and gravy, and I substituted Brussels sprouts for the asparagus. I had a pleasant Malbec to go with my steak. The filet mignon was delicately seasoned, moist, tender and went well with the potatoes and gravy. The Brussels are standard and delish. I ended my meal with a tasty Crème Brulée that I enjoyed very much. I was grateful for my server offering suggestions from the menu and being attentive throughout my experience. I would definitely come back to try more of the menu.\n\n#itsfoodovereverything"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dll6VkRlalprYlVsWU1YSldYMUJuTW5CcGFYYxAB",
            "text": "Salmon, creme brulee and cappuccino were terrific. Service was super!!! We sat outside to enjoy a gorgeous summer evening. AC was too cold for us."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aeExVOXphbUk1UTBJM1dFcGlTRGhMVDFrMGNIYxAB",
            "text": "Always a treat!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tscVIwUlRVRzVqUmpobVozZEhRblJTU0dwclNtYxAB",
            "text": "Classic cuisine with great service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCRlVHNHdWMGhEVGt3M1NtOVBUa3RDV0V4NlFVRRAB",
            "text": "Great spot.  We had a burger and fries.  Burger was well cooked but slightly under seasoned.  Great fries."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213M05VdFZSM05ST1MwNVMweEROVlZ1ZUVZd1pIYxAB",
            "text": "Ambiance is nice, food was fine."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RNGFHZzVNMnhIZW5CQlpHMDJXWHBQY1Zad2RtYxAB",
            "text": "I came in doubtful but left impressed and satisfied. They prepare everything from scratch. The plates come full and all our choices were delicious. Restaurant staff are truly friendly. We found every aspect satisfying."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWR09GWk5TekpWY2kxWGExbFpPV0ZRTkRsbE5GRRAB",
            "text": "Excellent brunch place\nFood was great, highly recommend the chicken salad\nRelaxed atmosphere, good but not hovering service.\nWill be back to try dinner"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaT1drdzFjRVZWYTFCM1dGaGpiakJ5VHpCZlYzYxAB",
            "text": "Came here for a late night dessert and had a great time! 10/10!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKNnZnTGo1cXFycUNnEAE",
            "text": "I ordered the filet mignon medium rare.  It came medium well done but it was tough as nails and could not be chewed.  It was the most expensive entree item.  A good filet mignon should be able to be cut with a fork.  This piece of meat was difficult to cut with a serrated steak knife.  I ended up with onion soup for 18.00 and asked the waiter to comp me a dessert.  He did and we left an overly generous tip.  Never returning there again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKdnNrODdWc05fai1BRRAB",
            "text": "Tuna bowl was absolutely amazing!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMUGFxTVRlM05pNjFRRRAB",
            "text": "Love this place. Great neighborhood gem with cozy indoor and outdoor seating in good weather. Good French standards with pleasant staff"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPT3c3S3pWMkx2dGJBEAE",
            "text": "Classic French bistro with smooth, courteous service. Excellent spot for lunch with a friend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VKem9rX21mdEotbjJ3RRAB",
            "text": "The food is average. Aside from a few experienced waiters, most of the staff are just runners who don’t even know how to properly place a plate on the table."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMaktzS245OTdmNk5REAE",
            "text": "My favorite restaurant so far! Food is amazing."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN2Fianl3RRAB",
            "text": "My husband and I came here for brunch after church on Sunday, hoping for a nice experience. Unfortunately, it was disappointing from start to finish. I ordered the French toast, which arrived as complete mush — inedible. I asked that it be taken back to the kitchen. I then ordered the quiche, only to be told it was unavailable. Trying to keep it simple, I asked for a croissant, which they also did not have. At that point, I simply had a mimosa while my husband ate his steak frites. Needless to say, we will not be returning."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvLWM3OFR3EAE",
            "text": "A beautiful seating area can’t mask the horrible food experience. I Ordered the omelette … it’s an embarrassing sized portion for three eggs … and each added “herb” is an addition change. Beware !!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvODRLYkJBEAE",
            "text": "Filet Mignon Flambe was perfectly cooked and delicous.  It was almost like Kobe beef texture - my knife slid through it like butter and I barely had to chew.  Love the cheese puffs too."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJajhxX0tREAE",
            "text": "A great place for a warm cozy meal! Service was outstanding. Well organized and fast a great crew! Food was very good. For me the goat cheese tart was my favorite. The steaks we had were ok but the knives were sooo dull that cutting them was a real chore. Beef bourbon was not as complex as it could be, Julia would be not happy. French onion soup very tasty and for desert the profiteroles were outstanding. The menu lacks the classic french flair but overall a good meal."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcWR5MG9nRRAB",
            "text": "Tiny place with good food and mediocre service (felt very rushed and they completely forgot my order)."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3anMteFJ3EAE",
            "text": "The tuna tartare was delicious as were the mussels.  Great service!  Overall, very nice restaurant."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRemNuam9BRRAB",
            "text": "We have come here many times and the food is consistently good, but what really stands out is the service, particularly our favorite waiter Orlando."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReGFEYlN3EAE",
            "text": "Orlando made our recent lunch special"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdHBMZGpBRRAB",
            "text": "Lovely meal in a lovely setting - Orlando’s service was excellent"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNC1maW9nRRAB",
            "text": "Tables,too close together.  Noisy"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdWRlMDhBRRAB",
            "text": "Love Orlando! Great service :) from Emily and Eve"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRX3ZmdUZBEAE",
            "text": "Orlando was very good. I appreciate his discretion and he knows how to connect with customer"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdlB6SU1REAE",
            "text": "Orlando was great!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnazRha2NnEAE",
            "text": "Great dinner, upscale but casual atmosphere, Orlando, our server, was great.  Will definitely be back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnM1pUQW5BRRAB",
            "text": "Had a wonderful dinner, always enjoy the atmosphere there. A shout out to our server Orlando, who was prompt , Attentive, and an overall lovely person"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnN2RmQUJnEAE",
            "text": "Amazing food, environment and service. The general manager is extremely polite with all the clients. Ready to have you and attend everything you need even if you have restrictions diet."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdDdEc2FnEAE",
            "text": "뉴욕에서 뉴욕다운 장소에 위치해있었고 프렌치 음식점이다 내부 인테리어가 독특해서 보는 재미가 있었다 음식맛은 좋았다"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURydGNMQl93RRAB",
            "text": "Loved the food and vibe here! The Cheese Puff Gougeres were like a warm, light, flakey, cheese hug — highly recommend as a starter. The Cognac Waygu burger was incredible, with caramelized onions and a juicy, savory patty. I loved the crispy fries that came with it. The Spicy Vodka Rigatoni had a light flavor, could’ve been dialed up a few notches. The service was attentive and friendly. Overall, romantic French atmosphere, quality food and top notch service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsNDZ5SnlBRRAB",
            "text": "Enjoyed our night at Brasserie Cognac this evening.  The food was good.  I had the duck.  It was good but not great.  We also had the Salmon and that was out of this world.  The cheese puffs were really good as well.  The onion soups were good and just the right size.  So often the soups are too large but this was the right size.  I’ll be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYcHItcURBEAE",
            "text": "Tasty classic French dishes can be enjoyed at this cozy restaurant like Steak Tartare, Onion Soup, and Mussels Mariniere. Make sure you leave space for the Chocolate Soufflé with Crème Anglaise. The ambience as the music takes you for an afternoon somewhere in France. Nice experience!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKemNtdk5nEAE",
            "text": "Pretty bistro with standard French fare. Place is pricey, which I’m fine with, so long as the food is good. Started with a salad, it was very tasty, decent portion with a house made vinaigrette. Went on to the French onion soup. Everyone knows one of the best parts is eating the slightly crisped cheese on the outside. This cheese was melted but the chef did not really brown it all. Once I got to the soup part it was off tasting. Hard to describe, maybe it was just freshly made or even perhaps just watered down. It was very sweet, like someone added sugar to compensate for not caramelizing the onions. For $18 I sent it back. My next course was the fondue. Also a huge disappointment. Terrible flavor and consistency. No cheese pull at all. Points for adding wine but maybe too much wine? They paired it with stale bread. Not sure what other posters were talking about with the veggies that come with it, but I didn’t get any. I ended up using the bread from the basket they provided at the beginning of the meal. I also didn’t eat much of it because I didn’t want to send back yet another awful dish.\n\nMy daughter got the beef Bourgogne. That was very good. The meat was fork tender and not dried out at all. The sauce was rich and the plate well balanced with veggies and well made mashed potatoes.\n\nThe service was good.\n\nI’ve eaten here before. Had the French onion soup last time and it was tasty so I’m thinking perhaps the chef was having an off day."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsZ3Z2R2dRRRAB",
            "text": "Had lunch at Brasserie Cognac, and the experience was very nice. This is a good Upper East Side restaurant that was absolutely packed when we visited for a weekday lunch. The food was solid, and the service was outstanding during our visit. This is a very nice neighborhood restaurant / French Bistro."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaOElyektREAE",
            "text": "A rather typical French UES restaurant with relatively senior crowd. Inside is cuter than outside, both are pretty spacious, there are also tables on the upper floor.\nA good find - brut champagne for $17 (decent quality as opposed to many overpriced bubbles), a great value for UES. The octopus salad was great with plenty of charred octopus, tuna tartar was OK. The apple tart tatin tasted better than it looked. Overall a solid choice for a casual and quiet dinner / lunch in the area."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbHFyNC13RRAB",
            "text": "Nice place with a style of an authentic French restaurant.\nBut the food was disappointing.  The appetining dishes were reasonable nothing beyond that.  The main courses were boring, and the dessert, we should give it up.\nThe service was nice and the price reasonable.\nManhattan has significantly better French restaurants."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMElMNUd3EAE",
            "text": "Very nice French restaurant, the food and the service were amazing. I had Tuna Poke and my company had Steak Tartare with homemade French fries. I definitely want to come back."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTbFlQNDJnRRAB",
            "text": "A very nice place. Service is excellent. I started with C'est si bon cocktail. Very good but should put less ice in it. For starters we took the onion soup (very good), escargot (ok, with a great gravy)  and cheese puffs, which was fine but…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqeVByMDhBRRAB",
            "text": "A nice local upper east side restaurant where I’ve dined for several years when  uptown. Very reliable food, nice staff; has the feel of a neighborhood place. Yesterday, salad & halibut over risotto."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHZzdMNDBBRRAB",
            "text": "Would go back, it’s a great spot for brunch. The host was very pleasant and the atmosphere is warm and cozy. She had the Cheese Soufflé, which was light in texture and mild in flavor making it an interesting experience that’s enjoyable when your appetite is for something small. It was fun to eat. He had the petite filet with mushrooms. It was very undercooked, which is silly in a professional restaurant who should know their oven or use a meat thermometer if necessary to get it right. The frites were excellent and the chocolate soufflé for dessert was very good but not great because a soufflé is dry inside and they served it with ice cream instead of a cream you can pour in the top. The skirt steak with frites would have been perfect if not for the fact it was sold out so we will go back for that another time. If you found this review helpful follow me."
        },
        {
            "date": "2년 전",
            "language": "pt",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSaDhYT2pnRRAB",
            "text": "O lugar é aconchegante, o serviço é agradável, os funcionários são educados e pacientes.\nDe entrada pedi salada de lagosta, para compartilhar. Estava deliciosas e serve 2 pessoas.\nPrato principal pedimos Beef Bourgnhon e Vieiras com espuma e risoto de aspargos. Ambos pratos estavam incríveis, muito sabor, a carne desmanchando, e as vieiras frescas em um ponto que eu adoro, foi uma explosão de sabor.\nO menu de sobremesa é fraco. (Pedi um creme brule de framboesa e não consegui comer. Infelizmente estava com sabor artificial) particularmente acho o menu de sobremesas o ponto fraco do lugar.\nConfesso que após comer o prato principal que estava espetacular, minha expectativa era uma sobremesa algo como Gateu OPÉRA ou Mil folhas."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBanA2elF3EAE",
            "text": "Thank you and the staff for such a truly memorable meal with my mother and I. We will be coming back for more special occasions to come.\n\nSuggest waiting the spare 20min for the chocolate soufflé. Worth it!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5LXJXVk5nEAE",
            "text": "Who doesn’t love a French brunch or dinner while up and about on New York City’s Upper East Side? Cognac delivers delightful dishes, large and small, as well as an excellent collection of wines. The French onion soup and the Oeufs Benedict…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKLXZHNk5BEAE",
            "text": "The food was absolutely Devine. The dessert was my fa favorite 😋 The service was desirable and you're likely to run into neighborhood friends with good taste 😁"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNza1lIOGJnEAE",
            "text": "NYC Restaurant week Winter 2020:\nThe restaurant has 2 floors, with first floor for small groups, cozy decors that are elegant but not ornate, feels history thru photo but not old, small to maneuver but sits comfortably. Popular destination for affluent locals from opening till closing.  Located near Hunter College.\n\nArea is clean, service is efficient, staff are friendly, menus are clear, wine list is lengthy,  price and quality are proportionally high.  We didn't ask for plates for sharing, so there was no plate sharing fee.\n\nWe ordered escargots, lobster bisque, duck leg confit, and codfish.  Under price comparison, the items seem cheaper than others by a lot, while still retaining its wow factor, but size of proportion is understandably smaller by a bit.\n\nThe escargots are between soft and chewy, with the flavor of extra virgin olive oil, parsley butter, and minced garlic.  There is no alarming flavor or texture.  It is also served with crispy garlic bread, and a slice of lemon for an optional added flavor.\n\nThe lobster bisque is savory and thick with the smell of lobster or other crutacean's juice.  Combined with some whip cream for a smooth and appetizing soup.  There are no other solids such as lobster chunks in the soup.\n\nDuck leg confit offers 2 leg pieces, cooked to juicy crisp perfection with some skin and fat.  Balanced the grease with red wine sauce, perfectly cooked smooth textured baby carrots, and a pinch of mixed herbs with strong flavor, such as cilantro.  All served on top of the butter smooth mashed potato soaked in duck juice.  Overall, it comes out to be a very satisfying entree.\n\nCodfish is boneless and cooked to a juicy perfection where its meat almost flaked apart.  The potato slices are soft with a hint of codfish juice.  Spinach stews between codfish juice from the top and the smoothly flavored and textured tomato soup from the bottom.  Codfish is not fishy, and the dish is very satisfying.\n\nWe close off this great meal with bubble tea from the nearby Gongcha.  But you could definitely go further and explore their regular menu for more tasty treats.  In fact, I was so curious about their culinary presentations that I checked out their regular menu from the outside.  The price is a bit outside my range,  but definitely worth it for a fancy night out!"
        },
        {
            "date": "6년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0aWJDWGJREAE",
            "text": "Um lugar encantador, garçons educados , gostoso sentar dentro ou fora na varanda ( aproveite que é verão ). Comida deliciosa, a entrada também , sem palavras para falar de tão bom que é lá ... os preços são bons e a comida show !!!! Vale…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhMWJfY2xnRRAB",
            "text": "Lovely place, we went without a plan but were very pleased with everything. The food was a but pricey but worth it. Service was great. We sat outside so ambience was as good as street seating can offer but cannot complain. Good place overall."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRc2NUUVF3EAE",
            "text": "Delightful neighborhood French bistro. We had the mussels for an appetizer, absolutely delicious, in fact have never had better mussels, followed by the filet mignon with a side of spinach, and finally the chocolate soufflé with a…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxcXVQZmZnEAE",
            "text": "Perfect 👌 dinner! Fast service and delicious food. Tried the Fillet mignon flambe and Steak Frites and cheese puffs” and the cocktails 🍹 Late night in Paris and naked Martini.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYN2RlY2xRRRAB",
            "text": "Really dainty spot on the upper east, salmon burger was delicious and escargot. I hear it’s the place for brunch, will return soon."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnOC1PYXFBRRAB",
            "text": "This was a fabulous find. We were looking for a restaurant before a play at the Armory. The food was  amazing and the service was impeccable. Had the steak tartare with the best presentation. (The photo may not do it justice. After that the mussels and frites and my companion had the Nicois salad. All of it was perfect."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqLUxmbTVRRRAB",
            "text": "Most belligerent bar tender in the city\nNever will go back and will be sure to spread my experience\nHad pay and leave without finishing my dinner\n\nManagement reached out and discussed my review and I am completely satisfied and will recommend this restaurant to all my friends\nThank you Marco"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyOGNXdXJnRRAB",
            "text": "Onion soup and mussels were good.  But should have known not to get the fettuccine - very bland and tasted like nothing."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpNEx5NzhRRRAB",
            "text": "The Eiffel Tower on every plate paired with French wine.Great service and cozy Missing 1 more star only because it was cold inside."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxaDlQa0x3EAE",
            "text": "Had lovely meal in their outdoor area. Had Goat Cheese & Tomato Tart, Steak with fries & chocolate souffle for dessert.  Food was delicious. Cote De Rhone wine good quality.  Would recommend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlLVBDUHFnRRAB",
            "text": "The first time we dined at Cognac was ~5 years ago for brunch, and I can’t remember what we disliked about the experience but were loath to return. Inevitably we did and have had relatively positive experiences since, though for some reason it’s never top of mind when we think of French bistros.\nWe went tonight, sat at the bar which is our custom, I ordered the Steak Frites, my spouse ordered the tuna tartare entree which was delicious as always.\nWhile billed as a hangar steak, what arrived was a sliver of sirloin (no more than 1/2” at its thickest, but I suppose what does one expect for $38 on the UES?). When I pointed this out to the bartender, he grabbed the general manager who explained they’d recently made the change and had yet to update the menu. To his credit he offered to allow me to change my order, but I don’t mind sirloin so I soldiered on.\nIt was cooked properly and the peppercorn sauce, fries and salad were tasty, so when all is said and done it was fine (an accomplishment since it’s arguably the thinnest sirloin I’ve had since Flaming Embers in the late 80’s).\nHere’s the kicker - it would have been nice if they’d bought us a glass of wine, no? I suppose I could have asked, but that’s not how I roll.\nFor $175 I think we can do better. Oh well.\nD.M."
        }
    ],
    "reviews_count": 78
}