{
    "name": "Adria",
    "place_id": "ChIJKT6YWABZwokR_373GJTMZOs",
    "grid": "MN8",
    "address": "1556 2nd Ave #2S, New York, NY 10028, USA",
    "rating": 4.8,
    "user_ratings_total": 78,
    "phone_number": "(646) 386-7703",
    "reviews": [
        {
            "date": "3일 전",
            "language": "iw",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSdk5Xa3RiR05GYjBwemVXSllSV0Z2UlhsV2NrRRAB",
            "text": "מושלם הכל אוכל שירות אווירה"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RGFFZGpUekZYU1docVVtaEhkWEpJVkVsVmVXYxAB",
            "text": "Wonderful place. Excellent food, we were a party of five (Italians) with children, we had ziti, branzino, fritto misto di pesce, salad and paccheri. All of us were enthusiastic about the experience. Thank you for a great Saturday lunch!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMmFqWXdhMDl0UWxOYU5HeGhXbU5mVjNGcU5sRRAB",
            "text": "Great food, very nice wine selection, beautiful ambience, friendly staff. Rodolfo and Luciano have been so nice, the top service, I felt so welcomed 😊…"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xORGQyVjRXbHBpYldzNGJqa3RMVlJqVWxkM2JrRRAB",
            "text": "Loved the meatballs and service was very attentive. My husband really enjoyed the ziti alla genovese, but unfortunately I did not enjoy the lobster paccheri. We’ll definitely plan to come back and I’ll try a different dish next time since it seems like a good neighborhood spot."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0eGQzZFZVbFZ2YTNsb2JHRm1VMGRyTm1KQ1MzYxAB",
            "text": "Just delicious. Period. It is what it is.."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oc2NYWmpTVGhoYVdrdGFsSlRiWGMxU21SVWVVRRAB",
            "text": "We went there for a Saturday dinner and had a great time! Servers were very friendly and attentive, and everything we ordered was absolutely delicious, very fresh and perfectly cooked. The drinks were also amazing. I highly recommend it!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSNFVUaG5WbHAyTVVaa1dVaDNNbXczYTNJMGFrRRAB",
            "text": "Good food would recommend to everyone in nyc. Only thing its a bot pricey"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGQ1Z6ZFFZbGRKVUVKMlYyaFBlR1JIZFRKdmNGRRAB",
            "text": "Excellent"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoZloxWm9aR3BXTjJWMVgwMUlSekpXZUU0d1ZWRRAB",
            "text": "Went with a small group. Got the Cesar salad to start then the spaghetti with clams. Both were delicious. The pasta was super light and not too overwhelming despite being a butter sauce. Got a boulevardie and then some red wine. Both were fantastic. The service was amazing. Great recommendations for wine and very attentive service. I was there with a regular and they clearly value repeat customers."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOWFJXVmlXVVJvY1hoblNFUkZURmxwWDNsblVuYxAB",
            "text": "I took my girlfriend Adria here, everything was done to perfection. Service was great. We got the octopus, and it was a little small but still very yummy. Also got the veal ragu, and it was cooked to perfection, but don’t forget to order the sausage and pepper ragu, it will rock your world. It’s in a beautiful tangy red sauce. You should also get the cheese cake, goes so hard. Loved it so so so much, coming back for sure!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5M2VscGtNMU5mWkRkT1l6UlZTV1ZLVm5sT2VtYxAB",
            "text": "A friend and I had dinner there recently. The restaurant is very attractive and the food, drinks and service were excellent. We had branzino and halibut and a wonderful peach tart for dessert. We both would return and we recommend the restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FM2IyVlBXR05yYWpkbVFWRjZjRTlOWmpsaFpsRRAB",
            "text": "Food was very high quality and fresh - service was fantastic! Great restaurant for any nice occasion or just for dinner as the ambiance was also very elevated. Will definitely be returning"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xNVNqSmhSVEJFWWxwclpXaEJZazVtVVdsemFXYxAB",
            "text": "A great date night spot on the UES with an upscale vibe, delicious food and great service. We sat at the bar and took advantage of their happy hour (4-6, monday-friday) which has some great deals on drinks and apps. Every dish we ordered was delicious and plated beautifully, the service was superb, and the bartender was super friendly. It was surprisingly empty on a Friday evening, which I was surprised about! I encourage others to come check this place out!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNMmFYTjNjemcwUVU0eU5VcGZRMDFGTURCWGFrRRAB",
            "text": "We loved Adria !!! As Italians ( chefs and spoiled 😉) we highly recommend this restaurant!\nWe’ll be back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jelpDMWxUV2hhT0ZsU1dXbHJiVkZSVkRkSWRYYxAB",
            "text": "Excellent birthday lunch for two"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wTGQxWm5lR1pJVm5Oc2NUaG9SMlJ6ZFc1WlYyYxAB",
            "text": "Completely delicious. Everything - drinks, apps, mains, dessert. And presented with care and artistry. Highly highly recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJemRFMTZaVVYwV25OUkxUQkNiMWxZTkdOeVgyYxAB",
            "text": "Delicious dinner.\nGood drinks.\nNice, attentive, but not fussy, service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOcUxYWlpRM2RpZDB0SGJsazJOemRVWVhSeVMzYxAB",
            "text": "great dinner with italian friends at ADRIA burrata lamb chops tuna crudo they all were amazing ,, thank you ADRIA.and the semifreddo at the end was just perfect."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sZlFYVmtNV1pWYWw5S1dtMUhORGt0V2tKa09HYxAB",
            "text": "Terrific new restaurant in the neighborhood.   Great food, great service and wonderful atmosphere.  We will be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVelVFeHJaMGxsVm5aYWIzRlBkR2g2YkRKclVrRRAB",
            "text": "Amazing!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLS3ZrOW10a2NtX29RRRAB",
            "text": "A recent add to the neighborhood - and this is such a gem! Incredible service and WONDERFUL food (I think I have had everything on the menu). I highly recommend the Orange Fennel Salad, the Lobster Paccheri, and EVERYTHING on the Mains list :-)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLYkw3TlNrdmR6TEN3EAE",
            "text": "This spot offers remarkable quality. Nice workers and good cooking come in large amounts at budget-friendly prices. The staff member showed enthusiasm while describing food choices. The serving size exceeds what the price suggests. The experience left a good impression."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMR1Myc1h0OHZITXRRRRAB",
            "text": "got the octopus and it was alright. the mashed potatoes were really good but I feel like the octopus wasn’t fatty/good quality enough. I’d still have it again though"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMT1d6OHJRem9fZTFRRRAB",
            "text": "Dined at Adria Sunday with family including 2 nine year olds. The host was very attentive taking care to address any questions from the 2 young ladies.\nThe grilled octopus was so popular a second order was needed. Swordfish-excellent, as well as the various pasta selections. For dessert, the Semifreddo Al Caffee was the table’s favorite. Will definitely return when I am in the city again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOMk1uYVBQZ0pfLU5REAE",
            "text": "Adria delivers across the board - great food, attentive service and a laid-back ambience. Will definitely be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMSGQ0WXVPbFpuNGpRRRAB",
            "text": "food was immaculate. service was great. the space was a little empty on a weekday, lets get her filled up!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMYk9zTUxpdUlUVWNREAE",
            "text": "We loved having dinner here! Food was delicious! Drinks were tasty! Love the atmosphere and the service was perfect! May be the best cheesecake I’ve ever had! We will definitely be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLN3l0YU83Nk9MbmdnRRAB",
            "text": "Culinary Excellence and Impeccable Service at Adria:\n\nWe had a fantastic birthday dinner tonight at Adria! From start to finish, it was an exceptional experience. The evening kicked off with a spicy old fashioned that was hands-down the best cocktail ever—we were so wowed that after raving about it, our wonderful waiter had the bartender come over to share the recipe. Such a great touch!\n\nThe gem salad and calamari were both outstanding starters—fresh, vibrant, and beautifully prepared. For mains, the LOBSTER PACCHERI was absolutely divine, and the halibut was cooked to perfection.\n\nWe couldn’t resist dessert, and we’re glad we didn’t—the pear tart and chocolate mousse were the perfect sweet ending to a flawless meal.\n\nThe service was beyond outstanding—warm, attentive, and genuinely enthusiastic. And a major bonus: Adria is one of the few restaurants in NYC where you can actually enjoy your company without shouting across the table. The noise level was just right.\n\nAdria is a gem. Already looking forward to our next visit!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FyZTJ4Z28tMk9REAE",
            "text": "We had a wonderful experience at ADRIA to celebrate the graduation of our daughter. The setting is cosy, quiet (with nice soft music) and somewhat classy. We had the pulpo, pasta al ragu and pasta with lobster. For desert, we recommend the cannelloni, the chocolate mousse and cheesecake. But what I preferred is the white wine from Campagna : Falanghina. Kudos to Luciano and his staff who attended to our dinner in a courteous, funny and expert way."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLWDB3TXVzdThyT3NnRRAB",
            "text": "Went for Mother’s Day lunch and everyone enjoyed their meals. I would give this relatively new restaurant a chance to become a part of your dining rotation."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMnJueDZ3RRAB",
            "text": "Really great service. The server said it was his 2nd day and he had a lot of presence, shout out to him. I enjoyed the lobster pasta which had huge chunks of lobster and did not have much cream in it. The cheesecake was also incredible. Overall, a nice quiet meal in the UES."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMHRXLUhBEAE",
            "text": "We were just walking by and with  no exaggeration the best food and service that we’ve  had in a very long time … We will definitely come back    .. (try the cheesecake and chocolate Mousse ) …"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcThXTVVnEAE",
            "text": "Wow.  This is one of the best restaurants I’ve had the pleasure of visiting.  The food was outstanding (quite possibly the best lamb I’ve ever had and the caramelized onion mashed potatoes were incredible).  Everyone enjoyed their appetizers and main courses.  The service was excellent and although we closed the place out everyone was very patient and we did not feel rushed at all.  Do not hesitate to visit here."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OUlfQ3ZRRRAB",
            "text": "Delicious food. Somewhat pricey but probably the best dinner I had in the UES in a while.  Lobster pasta is 5 stars, lamb also delicious! Please keep the quality of the food and don't increase the price! A new uality  resto in the neighborhood."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURROWVMSllREAE",
            "text": "Excellent place to go, the service is great and the food’s delicious 😋! High 5 recommend this place!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnM3IyNEh3EAE",
            "text": "Well designed new mediterranean Italian spot. Service was great and had a nice chat with the woman who runs the place at the end of my meal about how nicely she decorated the space. Food was good, although some of the portions felt just a bit inconsistent, since they’re new I’m sure it’s something they will work out as time goes on."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndGF2WEJBEAE",
            "text": "Wonderful restsurant on all counts. Try it!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfc09tWGRBEAE",
            "text": "Delivery never arrived a $75.00 order restaurant said they were sorry.. credit card was charged .. no dinner and the delivery person is scamming me.. saying he will be back in 5 minutes"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfM3U2aGtnRRAB",
            "text": "We were 5 people. The food was delicious. The swordfish cooked perfectly not overcooked. The service and staff were lovely. The room is very pretty and not noisy. We were able to speak easily. Food/price in the norm for New York, except it was all very good. Often you spend a lot and are not happy with the food. I highly recommend this new comer. Enjoy!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbzhYLWNREAE",
            "text": "NYE dinner. Probably one of the best meals I’ve had in NYC. Kudos to this new restaurant. The halibut dish was spectacular. It’s pricey, but what isn’t in nyc these days, and I’ll gladly pay for quality. Had the tuna, burrata and beet salad appetizers, all solid. Tried my wife’s lamb chops, delicious. Got an order of the lobster pasta for the table to share which was also enjoyable. For dessert, the riccota cheesecake was the standout. Absolutely out of this world. Luciano was our server and he attentive and guided us in the right direction. A must visit."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cnV6NWJBEAE",
            "text": "The room looks great, nice chandeliers, upscale interior; Service is fine, nothing to complain about; Relatively quiet early Thursday evening when we arrived. Food is great. The shrimp were carefully cooked and tasted fresh with a delicate flavor. Same for the swordfish. Lamb chops, despite being slightly overcooked, tasted good and came with fine mashed potatoes and a nicely reduced sauce.\nPrices are acceptable for the quality of the food and the nice ambiance. It is not a very lively place, not a place where you would go to party. But for a tranquil and enjoyable meal, free from the clamor of loud crowds, this is an excellent choice."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MHJ2dHF3RRAB",
            "text": "So impressed with our dinner here! Each dish was 10/10 and the service was fantastic. Also love the atmosphere and styling. We had the beet salad, ziti genovese, and halibut. Will definitely be returning"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQczh5OGR3EAE",
            "text": "Simple well-done Italian"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcVpDOWFREAE",
            "text": "Fantastic edition to the neighborhood! Everything we had was delicious and very reasonably priced! Loves our appetizers (Octopus and Grilled Shrimp)- will be back!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzcFpLUmd3RRAB",
            "text": "Best pasta on the Upper East Side!!! Absolutely recommend"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzb3RQMEtBEAE",
            "text": "Adria is a delight to dine at. The service is great and staff members are incredibly friendly/polite. The atmosphere is warm and inviting. The food (I had the Lobster Paccheri) is simply amazing. It is fresh, authentic and presented in such a great way. Highly recommend dining here if you want to try something new and spice things up a bit."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMmJ5cjlRRRAB",
            "text": "The food here from the team that runs L'Osteria (also excellent) was terrific.  Really attractive design and excellent wait staff.\n\nSimple, super fresh, high quality.  The prosciutto and Mozzarella was really good as was the Radiccio salad. The branzino was moist and tasty, the swordfish in a simple red sauce similar to a Livornese.\nThe creme caramel dessert was incredibly rich and flavorful.\n\nWe will be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMza1AtbnZRRRAB",
            "text": "We got the lobster pasta and halibut - both were delicious! The servers were so attentive. Great addition to the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdzlPaHdnRRAB",
            "text": "Great new spot in the UES (it replaced Grey Hawk Grille). Love the new dining room. Simple and elegant atmosphere. Sat at the bar and had the Mozzarella & Prosciutto, Rigatoni, and Lamb Chops. All exquisite! Service from Luciano (?) and Rodolfo was top notch. Definitely coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYX3RxT2xBRRAB",
            "text": "This is a simple but beautiful and elegant dining room with a modern and sophisticated bar. Menu is strong and not confusing. Service is excellent and getting better as they work our inevitable kinks. The maitre ‘d remembered us the second time we came, after a month, including where we sat and what we ordered. Food is on point. It’s going to become a neighborhood staple."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYb2R1anRRRRAB",
            "text": "A great new gem in the UES....service great and food was awesome. Try the Halibut! Everything price very reasonable especially for the quality."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuMTV1Qmd3RRAB",
            "text": "Food and service was very nice at this sister to L'Osteria. Also a very pretty room makes this a most welcome addition to the neighborhood!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcnE3bjdnRRAB",
            "text": "Amazing staff and manager. All very attentive and very professional. The place is beautiful and quiet which is awesome.\n\nBring the family and friends!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudUtXTVJBEAE",
            "text": "We had a wonderful meal , with superb service and atmosphere. I look forward to our next visit ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbkpMY2JBEAE",
            "text": "Food is so good\nService is great\nAtmosphere, so absolutely nice  🫡🤝"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuLThQcUd3EAE",
            "text": "Wonderful experience!  The food was fantastic and the service was even better!"
        }
    ],
    "reviews_count": 56
}