{
    "name": "Casa Cruz Upper East Side Restaurant",
    "place_id": "ChIJ48VsHFNZwokRgSjsT_HiU0U",
    "grid": "MN8",
    "address": "36 E 61st St, New York, NY 10065, USA",
    "rating": 4.1,
    "user_ratings_total": 402,
    "phone_number": "(212) 970-8983",
    "reviews": [
        {
            "date": "1주 전",
            "language": "hr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twTk9IcEtlbVJtYkd0b2VXcFVMVTgzYjFkR00yYxAB",
            "text": "Predivno mesto za uživanje"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCYVh6RnNVRnBzYlVkMGVVbzFURzFHVVRselRsRRAB",
            "text": "This is my second time at casa Cruz and I will always be honored to eat and enjoy time here. The staff is helpful, kind, and friendly. No place I have been has such a wonderful staff. We were greeted with love, kindness, and respect with no questions. We had the most wonderful waiter named jazz who went above and beyond to make our experience perfect! I brought my parents here to give them a fun experience and they are so grateful for how fantastic everything was.  We went to the bar after dinner and were treated fantastically. Not one bad thing to say other than the locks on the bathroom door on floor 3 needs fixing hahahaha! A place I will continue to go again and again. Thank you!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kR1MxcG9hM2RYUkhoZlYxZDBZMU5mV1RkT2MyYxAB",
            "text": "Went to this place for dinner and had an amazing experience! Would highly recommend for a friend’s catch up, date night or waiting to impress guests from out of town. Food was great (ordered the duck breast) but the service is what stands out the most. Our waitress was Naomi and she took great care of us from the moment we sat down to getting us drinks and recommending food. You’re guaranteed a great night if you get her for your table! Thanks to the rest of the staff too - I’d return again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FeWFUVTRTRVJIVm1jdFdUZEtRekI0V25KaGRVRRAB",
            "text": "The service was great, they accommodated it with the table, the servers and the hosts were very nice and welcoming, but, cocktails were ok, the food was not ok. It was not the best honestly. We paid almost 600$ we were hungry honestly speaking, and didn’t really enjoy the food. 56$ for the truffle pasta, not worth it. Def not coming back. Although tbe vibe and the design was top notch."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oeVFVaFdNa3g1UzBJeWIxQnJSalZ0TFVKR1NYYxAB",
            "text": "I recently dined at Casa Cruz in the Upper East Side. The ambience is undeniably beautiful — chic décor, warm lighting, and a glamorous setting that makes a strong first impression. However, the atmosphere felt a bit heavy and formal, which took away from the relaxed dining experience we were hoping for.\n\nI ordered the steak while my husband had the lamb chops. Unfortunately, the food was just average in taste and presentation; not bad, but certainly not memorable. At first, our server even brought the wrong dishes despite the restaurant not being very busy, which was a little surprising.\n\nThat said, the service overall was polite, and the restaurant itself is stunning to look at. If you’re going mainly for the interior design and vibe, Casa Cruz is worth seeing. But if you’re looking for an exceptional dining experience, it might not fully deliver."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KRFRWbHpaME51Y0RoU1VtNUxjSEowVFU5SmFYYxAB",
            "text": "the atmosphere? super super cold. SUPER cold. it is not welcoming.\nthe food? we had to give it back to the kitchen. absolutely disgusting, we couldn’t chew the meat.\nthe service? they had the bad food normalized already.\nwe spent 200+ in total 2 people, not worth AT ALL"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsSVdWUjBVWEJ5V0daVldHdzFaVU5MYTFBMmExRRAB",
            "text": "Casa Cruz was an excellent restaurant, Kilmor recommended it and went along with us and truly a wonderful experience as it was my brothers wedding, the food was exquisite. I would definitely go back to the rooftop and have another nice enjoyable lunch. Thank you truly for your service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkVk4zQjJTRkJaVEc1dGExWjFhSFpoZW5Kc2VGRRAB",
            "text": "Casa Cruz NYC is a hidden gem in the Upper East Side. From the moment you step in, the atmosphere feels both glamorous and intimate — the kind of place that makes any night feel special. The service is warm and attentive to every detail without being overwhelming, and the staff truly makes you feel taken care of. The food is outstanding: flavorful, beautifully plated, and clearly made with top-quality ingredients. The cocktails are a highlight, crafted with creativity and precision. Offering a very extensive and amazing wine list makes the whole experience even more special. Whether for a celebratory dinner or simply a stylish night out, Casa Cruz delivers an unforgettable experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xaWExaHBaMUkyT0hoR2FqYzVVblV4ZGt4SVRGRRAB",
            "text": "An extraordinary experience from start to finish. Casa Cruz offers impeccable service, exquisite cuisine, and a refined atmosphere that makes every moment special. A must visit in New York"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWWMzVjJURXQ0VURGQlIwUnNaMDlKWldwQ2RHYxAB",
            "text": "From the gorgeous outside of the restaurant, to the beautiful interior and the friendly staff Casa Cruz delivers!\nAndy,our server was great.We look forward to going back soon!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poTlFsbHROek4zUWw5NGVHWkdabDlmYXpsbE1VRRAB",
            "text": "Dining at Casa Cruz has been one of the most enjoyable dining experiences I’ve had. The staff was attentive, genuine, and offered a premium experience. Most importantly, the food was delicious. I came in as a party of 1 for dinner and I did not feel out of place. For a small party or a larger event, I’d highly recommend. Thank you to the staff for creating this special experience for me."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMmNtODFaREpSUWtaa1gzRjZTemxWT1dzeVlXYxAB",
            "text": "Great experience in a very romantic and great emdecor spot. The food was amazing. The octopus was prob my fave and the steak was ok when they took it back to cook it more. Ordered medium and it was more rare to maybe medium rare at best but they fixed it quick. The lava cake was amazing to finish off the night."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSU5URTNibkJqYjBaVlZGUndURWxOY25OcWFtYxAB",
            "text": "From the moment we stepped inside, we knew we were in for something special.\nExcellent design of this fine dining restaurant. We were delighted with both the service and the drinks. We also had the pleasure of meeting the General Manager Fernando, who was very welcoming and very attentive. Our server Andy also took great care of us throughout the evening, making the experience truly enjoyable. We will definitely be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVFdXbzNORmhsY1hCaU9GRlVjM1JsY0RoU1gzYxAB",
            "text": "We absolutely loved the restaurant — it’s elegant and welcoming. The service was wonderful and the food was excellent. Andy took great care of us and added special touches that made my birthday celebration truly unforgettable. We will definitely be coming back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVlZFSTJXRVZaU2tseFFVUXliVUZMUkVWeGMwRRAB",
            "text": "Came in around 6pm and found out they were having aperitivo on the terrace! It was a small but mighty menu, and I ended up having a club sandwich and Prosecco. Truly a lovely space. I will definitely be back (especially when it’s cooler)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkRWNTMVlRemh1VVZWaU9GZDRObEZ2TVhnd00yYxAB",
            "text": "Chic, sophisticated, sexy and a interior designer’s dream! The food and the service are exquisite. Every time I go there it’s always the same excellent experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MlRVdHJaRmxWVkcxNFpUUm5SM0ZSYTJwalpsRRAB",
            "text": "Celebrated my birthday at Casa Cruz and couldn’t have asked for a better night! The atmosphere was stylish yet inviting, the cocktails were spot-on, and the highlight was the tomahawk steak – cooked to absolute perfection and full of flavor. Service was top-notch, with Gabriel going above and beyond to make the evening special. Truly a memorable experience, and I can’t wait to return!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVVRHc3hPVTVCYURWTWIzQnpiR3BxY0c5SmVWRRAB",
            "text": "Gran opción, lujo e interiorismo en su máxima expresión."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGellsUjJMV1l6UlY5bFVrMVVWR1pRWjJoeVlXYxAB",
            "text": "OMG! what a fantastic experience! The food! The service! The atmosphere! Everything! Far and beyond! Just a happy customer here, especially the way the manager Isaiah took care of us. Exquisite!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NVVIUTFkblpaZG5sSE9YcHFkMGcyZG5kU01VRRAB",
            "text": "The bar is AMAZING!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsWVZEUjVaRFkxZVZWaU9XTTFTRTV4TjA5dVVFRRAB",
            "text": "Beautiful interior design and romantic/vibey atmosphere. The food was good but not amazing considering the price."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJbUlxckRndm8zbDl3RRAB",
            "text": "Absolutely loved my experience at Casa Cruz.The food and the service was amazing. The staff was so warm and attentive. The space itself is elegant and super cozy. One of my favorites plates were the branzino and the truffle pasta. The drinks were delicious too ! I Highly recommend it !!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOcnN1c0xGMGN5dkxREAE",
            "text": "Divine! The townhouse multi floors setup is posh yet serene, like an urban oasis. All the dishes were delicious and lovely presented. The host and staff were top notch professionals.\n\nA shout out to Cyan, Johnson and the host who name we didn’t get (sorry!). Johnson skillfully took apart the salt crust for the branzino and deboned, de-skinned it. A must try dish!\n\nThe grilled berries dessert with sage was an unexpected delight.\n\nIt’s been a while since we’ve felt totally satisfied from a dinning out experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKaGFXOXNlVTlWVjFrd1RUTnlabll0V0RCV2VVRRAB",
            "text": "The food was amazing, but the service was so rude. To be honest the man that we had as a waiter was soooo rude the entire table felt uncomfortable. The only reason I would come back would be because of the amazing food. But certainly not for the service. And it was expansive so we expected to have a good experience. Hope this review helps."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJeUUtY0c5OV9QWFN3EAE",
            "text": "Casa Cruz an amazing, elegant, private and delightful place to go.\nThe staff was extremely helpful in accommodating us, the GM Fernando, came to our table and welcomed us, what a outstanding person, our waiter super helpful, The ambiance was great, and the food definitely lived up to my expectations. We tried the house recommendations, and if you visit the restaurant, you should too. This is a must-try if you are looking for a nice cozy place for dinner and drinks at their bar."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMaTFocWZDaTZLWGhBRRAB",
            "text": "From the gorgeous outside of the restaurant, to the beautiful interior and the friendly staff Casa Cruz delivers!\nThe Baked Scallops, the Yellowfin Tuna Carpaccio, the soft boiled Quail Eggs and the Lamb Chops, all delicious. We look forward to going back soon!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOamZwSnJldXVfb3JnRRAB",
            "text": "Beautiful place - separate area for bar and dining room. I like that the front and back of the house is split so each \"pocket\" of the house gives a cozy, small restaurant vibe. Amazing for a date night. I would also recommend the bar for quick drinks.\nFood felt ok. The black truffle fettuccine was too overcooked and came away in chunks on our fork (maybe it was sitting on the counter waiting for us to finish the carpaccio). The fish, both tuna carpaccio and the branzino, were great.\nMy only issue with the waiter was that he kept forgetting our drink orders. Not only ours but also for all tables around us. So our row of tables had to keep asking him for the drinks."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdW9iNzB3RRAB",
            "text": "I was looking for a venue to accommodate  a 70th birthday celebration and I found it at Casa Cruz. The decor is exquisite, the hostess' attentive, and the experience exceptional. You must visit while in NY."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZak0zQU5REAE",
            "text": "Impecable todo. Iemaine una persona entrañable y Fernando super atento y profesional Muchas gracias"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNV9QVkp3EAE",
            "text": "I dined at Casa Cruz for my birthday and from the moment I walked through the door (literally) the customer service and hospitality was a 10 out of 10. A special shout out to to 'Zyanya' and 'Darwin' for really going out of their way and accommodating me and my guests !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcmRPYk5nEAE",
            "text": "Luxury Resort Feels, waited on hand & foot, gorgeous cocktails, insanely good food. Lovely was to spend a Saturday afternoon with the girls 🩷🩷🩷 Felt like we were in a cupcake 🧁"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcmF2SmtnRRAB",
            "text": "What a disappointing experience. The restaurant automatically includes a 20% gratuity in the bill, yet still presents an additional tip option at checkout. It’s misleading to suggest an extra 7% tip on top of what’s already been added. Transparency with billing practices is essential — this felt unnecessarily deceptive."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvN1lucm53RRAB",
            "text": "We went to have a late drink with no reservations host was really nice! They gave us a small table at the bar area!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJN3NIUHJ3RRAB",
            "text": "Casa Cruz is an absolute gem, offering an exceptional dining experience from start to finish. From the moment we walked in, we were warmly welcomed by Fernando, whose hospitality set the tone for the evening. The staff was incredibly attentive to every detail, ensuring a seamless and enjoyable experience.\nThe ambiance was simply perfect—elegant yet relaxing, making it an ideal spot for both intimate dinners and special occasions. As for the food, every dish was a delight. The octopus was perfectly tender and flavorful, the branzino filet was cooked to perfection with a delicate, buttery texture, and the carrots tagine was an unexpected standout, bursting with rich, aromatic spices.\nCasa Cruz truly excels in both service and cuisine. A big thank you to Fernando and the wonderful team for making our evening so memorable. Can’t wait to return!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaXNXb0Z3EAE",
            "text": "I GAVE IT A 4 BECAUSE THE WINE GLASS WAS SMALL AND PLASTIC"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MEphZjhRRRAB",
            "text": "Great experience with my husband. Amazing food and even better service! The atmosphere and aura makes you want to keep coming back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3a0lYOGtnRRAB",
            "text": "Excellent restaurant my best experience in nyc I visited for my birthday it’s was best experience ever services, atmosphere, foods I really recommend"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3a042UkxnEAE",
            "text": "Amazing experience"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMF9XOXJRRRAB",
            "text": "The dinner was amazing, with wonderful service. The service team, including one of the managers, Fernando, were genuinely nice. Can’t wait to go back to enjoy the bar."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRXzVYVkZBEAE",
            "text": "Very nice atmosphere"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbWZ5ZzRRRRAB",
            "text": "\"Exceptional service! I didn’t know about this place before, but now I can’t wait to come back. The food was absolutely delicious, and Darwin took great care of us. It was our anniversary, and they made us feel truly special. Highly recommended!\""
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRZ3VEVkx3EAE",
            "text": "This restaurant is the worst I've been to in New York, they gave me an appointment for 9:45 and then in their system they say you had 9:30 which was a mistake so they wouldn't let me in, they made me waste my time and they simply told me they couldn't serve me, they didn't even apologize, they wouldn't let me take pictures and my boyfriend had a shirt with a dress jacket and they say I couldn't go in like that either and yet guys came in in sports shirts and sweatshirts and they let him in, I feel like they discriminated against me and treated me badly, at least on my part, I will never go again, I have been to the best restaurants in NYC and that had never happened before, they want you to go dressed like you are old and in old clothes, a complete disaster, my day"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRLUx2S0lREAE",
            "text": "Caviar cones.   A MUST!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNk02eXF3RRAB",
            "text": "This restaurant didn't live to my expectations. The decor is  beautiful, very intimate, but the food, on the other hand, is not good at all.  The famous  tiramisu was frozen, not made fresh for the day.  The food is very bland .\nVery much  disappointed"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRcU1PcTl3RRAB",
            "text": "the caviar service is a must!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnN1p5ZGl3RRAB",
            "text": "I came here simply to compliment the outstanding service this place provides. The energy from the staff, the hospitality and gentle care for your every request, it's truly unmatched and rare to see in the busy NYC restaurant scene. Where I'm usually greeted with urgency, a sour attitude, or general frustration, Casa Cruz and their staff, ESPECIALLY, Silvia Sanchez bring such a comforting and caring approach to all their guests. Silvia has been such a great person to know and such an excellent professional in her line of work. She's accommodated many of my last minute or in person requests for literally anything. She's absolutely terrific and it goes on to show how their staff operate on an engagement level. Truly top notch."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneFplOXRBRRAB",
            "text": "I love!! Thank you for amazing place"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnb2UyNUpREAE",
            "text": "The food was excellent. Great service. Definitely coming back"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBN3Vqb2N3EAE",
            "text": "Great service!! Good food, good vibes"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBZzVLR0hBEAE",
            "text": "Gorgeous space, underwhelming food/cocktails/service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfbXNyU0lREAE",
            "text": "I had the pleasure of dining at Casa Cruz New York, and it was an absolutely delightful experience from start to finish. The food was exceptional each dish beautifully presented with bold, refined flavors that showcased the freshness and quality of the ingredients. Every bite was a true pleasure.\n\nThe service was outstanding as well. The staff was not only knowledgeable about the menu but also genuinely passionate about guiding us through the dining experience. Their attention to detail was impeccable, making us feel well taken care of without being intrusive.\n\nWhat really stood out, though, was the manager’s personal touch. They went above and beyond to ensure every guest was having a fantastic experience, checking in with us throughout the evening and offering thoughtful recommendations.\n\nOverall, Casa Cruz provided a perfect evening great food, professional service, and a team that clearly cares about creating an unforgettable experience. I highly recommend it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuODdIQjZBRRAB",
            "text": "My experience at Casa Cruz was simply exceptional. From the moment we arrived, the service was impeccable. Silvia, stood out for her attentiveness and kindness, making sure we had everything we needed at every moment.\n\nThe ambiance of the restaurant is charming, with a cozy decor that invites you to relax and enjoy the evening. The background music complements the atmosphere, creating a perfect space for a pleasant dinner.\n\nThe food was another plus point; each dish was delicious and well presented, making our dining experience even more memorable. I certainly enjoyed the stay at Casa Cruz very much and I can't wait to return. Highly recommended!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQX3FxX0JREAE",
            "text": "Casa Cruz provided an exceptional dining experience from the moment I entered. The staff’s warm hospitality made me feel at ease. The cuisine was of the highest caliber, and the service was impeccable. The ambiance was truly extraordinary, with a captivating atmosphere that enhanced the overall dining experience. The fondue was a culinary delight, and the beverages were exceptional. I highly recommend this establishment and eagerly anticipate my return."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzb2IyZzJBRRAB",
            "text": "Went for a dinner with friends and was absolutely blown away by the exceptional service ! Everything from the food to the atmosphere was beyond incredible. All the workers were extremely attentive and made sure we were well taken care of! The second we walked in I was blown away by the decor. The quality of the food and drinks were on par and everything tasted amazing ! Highly recommend ! Some of my highlights were the ravioli, the beet salad, the steak, the polenta and the potatos !!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdGFYNXJ3RRAB",
            "text": "Casa Cruz: The New Home of Elegance and Glamour in New York\n\nCasa Cruz has quickly risen to fame as one of New York’s hottest dining destinations, blending luxury, sophistication, and exclusivity into a truly unforgettable experience. Located on the Upper East Side, its interior stuns with gold accents, warm lighting, and elegant furnishings that immediately captivate.\n\nThe menu features modern international cuisine, with standout dishes like fresh seafood and expertly crafted cocktails. Dining here feels like stepping into a world of luxury, and it’s no surprise that celebrities and high-profile guests frequently gather at its tables.\n\nThis is more than just dinner – it’s a lifestyle. Perfect for celebrating special occasions or indulging in a night to remember, if you can snag a reservation!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYX3Z6QWF3EAE",
            "text": "Went for a family dinner. The atmosphere was superb, found it really original that they have different floors and spaces so not everyone is on the same room and it feels more private with not too much noise. Service was amazing, everything they recommended was great. I ordered the lamb chops and loved them. Loved the potato tots as well. A really cool place if you want to celebrate something special."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQODYyNmpBRRAB",
            "text": "I had the chance to dine at Casa Cruz , and it was a fantastic experience. The food was delicious, authentic, and full of flavor. Every dish was perfectly prepared, and you could taste the dedication in every bite. The service was excellent, with top-quality attention. The staff was very attentive, friendly, and always willing to make you feel comfortable.\n\nThe desserts, in particular, were a real gem. They make you feel like you're eating in an authentic food Mediterranean .\n\nI will definitely be back. Casa Cruz stands out not only for its food but also for its exceptional service. Highly recommended!\nAnd the environment"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzN05ETl9BRRAB",
            "text": "We celebrated my birthday at this restaurant with an 8:30 PM reservation, and from the moment we stepped in, we knew it was going to be a wonderful evening. The decor and ambiance created a warm, inviting atmosphere that felt perfect for a celebration. The service was truly outstanding, and attentive without being intrusive, and every detail was thoughtfully handled. I ordered the Wellington, which was perfectly cooked and bursting with flavor, while my partner enjoyed the branzino, which was delicate and beautifully seasoned. Both dishes were exceptional and exceeded our expectations. It was an unforgettable experience, and I highly recommend this place to anyone looking for a special night out."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQX2J2Z0N3EAE",
            "text": "Loved our team dinner at Casa Cruz\nFor once a place that is different originals and so vibey\nWe loved all the plates!!! And the service was absolutely incredible I would totally go again\nSpecifically\nLoved the Focaccia\nLoved the Quail Eggs\nLoved the Beef Wellington\nLoved the Duck Breast\nLoved the Branzino\n\nAnd wonderful desserts!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUcEp1M1NnEAE",
            "text": "The food was absolutely delicious! The service was impeccable and a luxury charming ambiance. It was a memorable experience and my new favorite place in NYC! I eat octopus at every restaurant when it’s available and I have to say the BEST octopus I have ever eaten was at Casa Cruz."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtdi1ta3l3RRAB",
            "text": "Our reviews had over 56 million views in the last 12 months.  We do not get paid we just love to eat and have fun.  We really love Casa Cruz.  We were invited for a dinner party of 20 people with a fixed menu served family style.  It was just great.  This is an old townhouse converted to a dinner club.  Hard to get into without being a member.  When you arrive they escort you up the elevator to one of 4 dining floors.  We were on the top floor and it was set up for just our party.  All staff are in suits or long dresses, very elegant.  Walking servers brought some apps and each was great.  We sat down at a lovely set table (4 sets of 6 people each) and the food started coming.  We had a small amount of each of the 16 items served.  All of them were really good.  I got some photos of the room and of about half the food because it was so good I forgot to take photos sometimes!!!  Suffice it to say that we would go back if invited.  I have no idea what it cost because our host paid for it all, but all in all we liked it.  We have tried to get a reservation but no phone calls are answered and our emails are not responded to.  When I mentioned this to the manager he told me that they try to make it hard to get in, but he did not offer any solutions so we probably will not be back unless invited.  It is great, but no restaurant is worth this kind of hassle.  If it becomes reasonable to get in we would go back, but until then there are lots of places just as good that love to have us come for dinner.  Check out all of our reviews and look at all the photos below. If we do not like it we do no review it so all of the ones you see are places that are fantastic. Follow us if you like. We had over 56 million views in the last 12 months and we thank you for that. We don't get paid, we just love to eat. Be sure to click on \"RobH\" at the top of this review to see all of them and to follow us if you like good food and FUN.  If we do a review it is because we love it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdk5qSzFBRRAB",
            "text": "I had an amazing experience at Casa Cruz last week. I've been to many similar restaurants, but this one truly stands out. The service was exceptional. The host Jenny was amazing. She was really  helpful and Gentle. The whole team worked together to provide a flawless eating and drinking experience. Plus manager Silvia was professional. I recommend this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSazdqclR3EAE",
            "text": "This is definitely an NYC scene! The restaurant design is stunning. I loved the small bar room next to the main dining area and had a glass of wine while waiting for my girlfriends. We had several apps (salad and burrata) and then two dishes of pasta. Food was pricey but comparable to other fancy NY restaurants. I thought the food was good overall and wine was okay (only two options by the glass and not really my type). I would go back to the bar 100% for the vibe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuMzQ2cDZRRRAB",
            "text": "Very good experience , the food was flawless. The service, however, truly set the evening apart. Our server, Soriano, provided some of the best service we've ever experienced—attentive, knowledgeable, and incredibly welcoming. The ambiance was cozy yet elegant, creating a warm atmosphere that perfectly complemented the dining experience.  Highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyN09lMGpBRRAB",
            "text": "Very mixed impression: luxurious ambiance, nice crowd, attentive service, but the food needs to be improved. Out of 4 dishes we ordered (zuccini blossoms, octopus carpaccio, roasted prawns and fried calamari) the zucchini blossoms stuffed with ricotta and prawns skewers were amazing, the other two were below average.\nMy spritz cocktail was so diluted with ice I could not feel even a hint of prosecco. Both desserts were subpar and overly sweet: the hazelnut chocolate torte was too liquid but at least rich, the limonchello coconne (a merengue with ice cream inside) was so sugary we could not finish it (and we both have a sweet tooth).\nWe sat on the rooftop. It was more relaxed than the downstairs,  but not much of a  view."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmc19uUmlRRRAB",
            "text": "This place was so instagramae and while the interior was super classy, I have to say it’s not really about the food\n\nThe vongole was just okay—too buttery for my taste\nThe beef wellington was decent, but not something I’d come back for\nThe steak tartare though, was pretty savory and enjoyable"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURacmVQM1Z3EAE",
            "text": "Super luxury feel spot. Few levels. Different rooms. I do not recommend the rib eye. The yellowtail appetizer was a hit\nSalmon entree was fantastic.\nThe bar is so fun ; all\nKinds of cocktails. Great date spot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoamJLUzZnRRAB",
            "text": "First you’ll have to get a reservation. Good luck. You’ll need to be frantically refreshing the website.\n\nSecond, you’ll have to afford the dinner. We suggest a home equity loan.\n\nThe cocktails spanned the spectrum. Two at dinner called their cocktails “amazing”. I couldn’t conjure a nice adjective for mine. If you don’t have anything nice to say…just drink talking about something else.\n\nAt dinner, the steak tartare met the high expectations set by the price. Given the price, that deserves praise.\n\nThe pasta dishes tasted good once you managed to wash out the taste of being ripped off on the price.\n\nChef did a great job on the steak and potatoes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYX3ZIbG5RRRAB",
            "text": "My friend and I had the best time catching up over dinner at Casa Cruz last week! From the moment we walked in, the host was super welcoming and set the tone for the night. Our server made sure we were well taken care of, and the service was top-notch throughout. The Branzino was fantastic, but the real star was the Beef Wellington—honestly, the best dish I’ve had in New York in ages. Can’t wait to go back for round two! Thanks, Casa Cruz!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCM3ZQbUR3EAE",
            "text": "The hype is very real! Had a crazy experience here and loved every minute of it. Sure, it is pricey, but you get what you pay for. Out of this world decor, wine list was exquisite, menu has something for everyone. The salads were vibrant and overall good portion sizes. Great service, and can’t wait to for another visit to the bar room. Really really cool space. Cheers x"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcUlyOGt3RRAB",
            "text": "This was one of the most beautiful restaurants ever. Everything was so aesthetically designed and made for the most incredible atmosphere. On top of that the food was incredible. The lemon pasta, pesto pasta and blackened chicken were spectacular. Everything on the menu that we tried was 10/10. Our waiter was so friendly and helpful and really made the dining experience that much better. We loved this place so much we decided to go back the next weekend. Highly recommend. Didn’t get a chance to take photos of the food because it looked and tasted so great. Our new favorite spot. And the flan for dessert was to die for. Can’t say enough good things about this restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSa19UbjJ3RRAB",
            "text": "Yeah…. The place is beautiful, but really beautiful. It’s a 6 stories townhouse in de middle of the UES. It looks like a movie scene. Check in with the host at ground level. Do not show up with out reservation. They will take you to the bar in the second floor for some drinks before dinner.\nThe bar in amazing, drinks are a blast. Tried the old fashioned and the casa Cruz.\nAfter 20 minutes they host took us and our drinks to the table in the 6 floor. The tables are in an outdoor space that it’s decorated as a circus tent.\nFood was good, not great.\nLiked: vitelo tonnato, risotto and the humita and the carrots.\nDid not liked: the waygu tartar, octopus was hard, cod fish not much flavor."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUeC1ETjN3RRAB",
            "text": "Amazing interior design. Best looking bathroom I’ve ever seen. Had a chance to dine at the best table in the house. Cocktails are otherworldly. Definitely worth checking out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzM09uVmp3RRAB",
            "text": "It was my first time dinning here and the food was amazing. Especially the Caesar salad and the spiced corn humita that came along with the duck breast. I highly recommend. The staff were attentive and amazing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNHIzRC1RRRAB",
            "text": "Our experience was good; the host and overall service was great although the server could have been more knowledgeable about the food.\n\nThe portions are on the small side - for the price expected a bit more quality/care with the presentation too.\n\nThe wagyu tartare had some pretty big chunks of meat … way too big, like they didn’t quite cut it right… and that we couldn’t eat. The ambiance is pretty relaxed and beautiful. I’d consider coming back but not sure.\n\nThe only food we really liked was the lemon pasta. The gnocchi, the gem salad, the tartare, and even the raspberry dessert were pretty forgettable.\n\nAt this price range, I expected a bit more. Maybe we will give it another chance, but not sure about recommending it."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcmJqTExBEAE",
            "text": "Ambiance, food, and service were all amazing. The Caesar salad and tiramisu were amazing and so were the drinks.\nWill be back!!!"
        }
    ],
    "reviews_count": 76
}