{
    "name": "Aunt Jake's",
    "place_id": "ChIJKffayQBZwokRbiyJa4TZAIw",
    "grid": "MN8",
    "address": "1555 2nd Ave, New York, NY 10028, USA",
    "rating": 4.5,
    "user_ratings_total": 469,
    "phone_number": "(917) 261-5040",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGMU5XRXlSRVpHYWs1WlRrYzFkM0prVXpWNVdFRRAB",
            "text": "Absolutely loved my night at Aunt Jake’s tonight for my birthday! We got there 20mins early but was seated promptly. We placed our order for dinner from the prefix menu (which had many options to choose from). Hubby and I got the mussels, calamari, and I created my  own entree by selecting mafalda and pesto with shrimp (+$8). He got spaghetti and cacio e pepe with chicken (+$6). Dessert was two choices, donuts or mason jar sunday so we got one of each. Once the dinner orders were in, we were invited up to the center counter which was already set up with pasta making ingredients. My husband and I were lucky to stand next to our instructor, Carmine, and the experience began. It was super fun, great atmosphere and informative! Made fresh pasta for the first time and Carmine made the experience easy and enjoyable. We got to pack the pasta we made to bring home. After the class, we had dinner and it was so so good! I was excited for the experience but the meal was the cherry on top with great portion sizes that we both left stuffed. We also got their spicy passion fruit margaritas which was a bar quality cocktail. The price is super affordable for such a great experience and I would definitely recommend Aunt Jake’s to others!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVFNWSjVOVWQ2U2tKeVZERm1Tamg0ZWpsQlRVRRAB",
            "text": "My friends and I had a fun time! The stuff is great, and the pasta class went so smoothly. We really enjoyed it!\n\nFor only $60 we had an amazing experience of making pasta + delicious fresh food!!\n\n100% recommending this place!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvM1REZEZkemRNVUdGb1lTMTVhSGhhVDJZd05sRRAB",
            "text": "Went here for my friend’s birthday and had such an amazing and unique experience! We started with the pasta-making class, which was so fun and hands-on, the staff was super helpful and made it easy to follow. Afterward, we enjoyed a delicious three-course meal. Every dish was full of flavor, and the service was friendly and attentive throughout."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQLUd0TXJBZ3Nuc2NBEAE",
            "text": "I had such a fun and memorable experience at Aunt Jake’s! Went for a girls’ night out, and it was the perfect activity. We took their pasta-making class, and it was absolutely worth it — just $60 for a hands-on, interactive evening.\n\nThe instructor was fantastic — super friendly, engaging, and made learning to make pasta from scratch really enjoyable. We got to create four different pasta shapes and customize our own dishes with the sauce of our choice. The pasta was fresh and delicious, and the mussels I had as part of the three-course meal were a standout! Everything was full of flavor and cooked perfectly.\n\nTo top it all off, dessert was a sundae that hit the spot and ended the night on a sweet note. Plus, I got to take home a ball of dough to recreate the experience in my own kitchen.\n\nHighly recommend Aunt Jake’s if you’re looking for something unique, fun, and tasty. Perfect for a date, a night out with friends, or even just treating yourself."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVMllWb3RkVmg1TWxKSlFqSnNSMDVJUWpCVVFuYxAB",
            "text": "Aunt Jake’s offers an immersive activity of pasta making and a full three-course meal! It was such a fun night. I went for date night but it’s also a great girls night or friend group activity. Our instructor Carmine was funny throughout our class and went through each detail. He made sure everyone was comfortable and the pasta making was point. Customer service was great as well!\nFood and drinks were 10/10. I had the spicy passion fruit margarita and my fiance had the sangria both were really good. For our apps we had the champagne mussels and calamari. Our entrees we got the chicken parmigiana and rigatoni with spicy allá vodka sauce. Desert we had the sundae. I will definitely come back. All this for $60 per person! Can’t beat that."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKTWRXZGZPSFpvZEdkUGVVWjNMVWhKYlRGWVdtYxAB",
            "text": "Excellent ambiance, food, and service (shoutout our waitress Alex)! I tried the mussels - absolute quality, delicious broth, with a perfectly crunchy garlic bread on the side. Went on a Friday night and saw there was a pasta making class - looked like so much fun and will definitely be coming back for this!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNVzJpTWJ0bWZYMFVnEAE",
            "text": "The pasta making experience was amazing! Chef Anthony was super funny and welcoming. The entire pasta making process lasted around 1.5 hours! Super super super fun!\n\nAfter making the pasta, we sat in our corresponding seats and they’ll start serving the food! They were not lying when they said THE PORTIONS ARE HUGE!!! The burrata WAS YUM! The meatballs were big and GOOD! We got the Spicy Alla Vodka and Chicken parmigiana and was not able to finish both entrees. Desserts were also pretty good!\n\nReally recommend for date nights, birthdays, friends gatherings"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJX19xTXZnZ3RxZlJBEAE",
            "text": "Absolutely one of our top experiences in NYC. We were visiting from Austin, Texas and pasta making exceeded my expectation. Anthony was the bomb.  So fun and engaging we were sad when it was over.  He became a fast friend and we had the best past making group too. I am going to recommend this to anyone visiting New York.  We loved our waiter too, the entire staff was phenomenal. Food was phenomenal! Sweet potato gnocchi in vodka sauce was a 10/10 and my husband felt the same about his lasagna. Great drinks!!!  10/10 5 star review!!   Must do in New York!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKNnI1SkhFd0tLdUp3EAE",
            "text": "This restaurant offers a wonderful experience with great ambiance and service. Even for someone who doesn't cook much, the pasta-making class was incredibly clear thanks to excellent instructors. Be sure to arrive on time, as everything is ready when you get there. While you're enjoying the experience, your food is being prepared for later, and you can order cocktails and drinks throughout. I highly recommend this experience for a fun day out with family and friends."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sWGFHTjNNWGhqZWpSTFptaElTVnBpWWxSeVdXYxAB",
            "text": "I recently celebrated my birthday at Aunt Jake’s, and it was an amazing experience from start to finish! The price is $60 per person, and it’s totally worth it. You get to make your own pasta, which is not only fun but also allows you to take your creation home and cook it within a few days; perfect for enjoying the fresh flavors again.\n\nAfter making your own pasta it is time to eat. The meal includes a delicious three-course dining experience that feels both special and satisfying. What really made the night stand out was having the owner as my instructor. He was incredibly knowledgeable, funny, and made the whole process enjoyable and relaxed. The staff overall was fantastic friendly, attentive, and welcoming, which made the evening feel even more personal and memorable.\n\nIf you’re looking for a unique dining and cooking experience with great food and top-notch hospitality, Aunt Jake’s is the place to be!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKalg4cm5QLU1lRTZ3RRAB",
            "text": "Ambience: 5/5\nService: 5/5\nFood: 5/5\nPasta date with my partner and I have to say it was a lovely experience. It’s $60 per person and you get a 3 course meal + the pasta making class. Very engaging and fun atmosphere to be around, you are next to other people but you don’t really notice if you’re with someone else. Instructions were very clear and easy to follow, I appreciate that our instructor is willing to clarify and help around. As for the 3 course meal it was all delicious.\nThe chicken parmigiana had a good balance of spice and seasoning. I loved how fresh and crunchy it was. I would definitely recommend trying this with anyone!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WV1FtOUJTVk0zU21FeE0zbEdZM3AyT1RKWU0wRRAB",
            "text": "I normally don't like pasta that much but when I got here the food was scrumptious! Not only you can sit here and enjoying the food or the nice modern interior and warm welcoming as you enter the establishment. This place is also great if you wanna learn how to make your own pasta from scratch, place is great if you want to bring a friend or a big group of friends, or family."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxaGRFaFNabUZ0VjI5NVRreEhjVXhWVkUxalpsRRAB",
            "text": "Came to Aunt Jake’s to try something new for date night and was not disappointed. The class itself was such a great time, easy to follow and the food was outrageous. Not to mention all staff were super nice. Would recommend it to anyone looking for something different and fun!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKclV2TXFROGZmay1nRRAB",
            "text": "Amazing experience! The class was very fun and informative. The instructor was very friendly and had a great sense of humor. You take home the pasta you make, and they take your order for the dinner before the pasta making begins. Once you’re done with making the pasta, you sit down for an amazing 3 course meal. The food was absolutely delicious. Highly recommend this experience. The drinks were also on point!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJeTZ1M2xRRRAB",
            "text": "An unforgettable pasta making experience, if you’re thinking about doing it… DO IT!! I took my mother and sisters here for a fun family activity and I would love for is to go back. The staff was amazing and helpful - super beginner friendly. Drinks are served during the pasta class - you make different types of pasta - and then you and and eat what you ordered at the beginning of the class. I forgot the name of most of names of what we ordered but everything was delicious. Get the doughnuts with salted caramel for dessert!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLT0E5T19EcUlLb2lRRRAB",
            "text": "Brought my fiancé on a pasta making date. It was more than worth the bang for our buck. $60pp for the class and a three course meal (excluding drinks) who can beat that? The class was a lot of fun and it was nice to mingle and let loose. If you can’t handle sarcasm and jokes this may not be the class for you. We all enjoyed in good fun and I would love to come back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZek1qbGhhV1ppYzBoV1RUZEVhRGd0VEZGclpXYxAB",
            "text": "the pasta making experience at Aunt Jake’s was a blast! the food was delicious and the staff was extremely accommodating (we brought our baby in a stroller and they reorganized the table to fit us all)! such a fun evening and definitely will recommend to others!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRd1pIUHJ3RRAB",
            "text": "10/10 pasta making experience\n7/10 food\ni did the pasta making class, and it was a very interactive and fun experience. the chef was funny. the full experience was around 2-2.5 hours for 75pp.\nit comes with a 3 course meal after the class. champagne mussel was a delicious starter. but both mains that we ordered were mediocre. the squid ink pasta was dry and a bit fishy? and the lasagna was also lack in flavor(Rao’s is so much better in comparison). desserts were tasty. will probably not come back for food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZa3BPd0dREAE",
            "text": "This experience was a 11/10 from beginning to end that I recommend for absolutely everyone. We went for a birthday and it truly was a memorable and very unique experience. The pasta making was fun and entertaining, and was unlike anything I’ve seen before. we learned how to make a couple different pasta shapes before sitting down to eat, and the food was amazing. The calamari is 100% worth it, and the chicken bolognese is amazing, but everything on the menu looked so good it was hard to choose. with each person getting their own appetizer, entree, and dessert, we left full with leftovers (and the pasta we made) because they most definitely don’t skimp on the portions. Overall from beginning to end it was an amazing experience that I recommend to everyone :)"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTllXMU1ka1pSVWtJek1uUjNXWFpXYldSWVUwRRAB",
            "text": "I went to Aunt Jake’s last week for a work team building pasta making class and it was absolutely spectacular!\n\nOur instructor was Carmine who is also the Owner, he was extremely charismatic and kept the group engaged and having fun throughout the experience as he taught us all how to make 3 different types of pasta.\n\nHe made it easy to understand and made sure all 36 of us were following along to each step which do a group that large was extremely impressive.\n\nAfter the pasta making is complete we sat down for dinner and enjoyed an authentic 3 course Italian meal with so many delicious dishes, I still can’t decide which was my favorite.\n\nI highly recommend experiencing the magic of Aunt Jake’s as soon as you can and trust me you won’t regret it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214UE0yOWZSVmQ0VDJWYWRHUldiVW8wY0ZvNVFVRRAB",
            "text": "We had the most incredible time! 😍 I brought 3 of my girlfriends for a girls night and I would highly recommend! The instructor was amazing and the class was so much fun, I learned so much !  We had incredible cocktails during class and really enjoyed the dinner, we ordered a bunch of different dishes and loved everything. The chicken parm is my favorite and I still go there just for the chicken parm! Highly highly recommend 🍝🍝🍝"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3emV5TGR3EAE",
            "text": "Aunt Jake's in NYC offers an unforgettable pasta-making experience that deserves every bit of this 5-star review! From the moment we arrived, we were greeted warmly and made to feel right at home. The highlight of our visit was the incredible pasta-making class, which was both educational and incredibly fun.\n\nChef Carmine has truly created something special. His passion for pasta is contagious, and his attention to detail ensures that every participant leaves with newfound culinary confidence. The class was thoughtfully structured, with clear demonstrations and plenty of hands-on time. What truly set the experience apart, however, was the instructor's professionalism and humor. They kept the atmosphere light and engaging, making even the trickiest pasta techniques feel approachable and enjoyable.\n\nWe learned how to mix, knead, and shape our own pasta from scratch, using fresh ingredients and traditional methods. The personalized tips and tricks shared throughout the session were invaluable. Best of all, we enjoyed a delicious meal made from our own creations, accompanied by perfectly paired sauces.\n\nWhether you're a seasoned home cook or a complete beginner, Aunt Jake's pasta-making class is an absolute must. Thank you, Chef Carmine, for an amazing experience! We'll definitely be back for more."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaVktSWpnRRAB",
            "text": "This Italian restaurant doesn’t just serve amazing pasta, they’ll teach you how to make it too! Such a fun date idea! ⁣\n\nOur waiter was nice, but when I first arrived, I was confused and just stood by the door for a while, no one came to greet me.\n\n- @GoerToEat"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdTdqRHdnRRAB",
            "text": "I recently took a pasta-making class on the Upper East Side and had an amazing experience! The class was fun, hands-on, and taught us step-by-step how to make fresh pasta from scratch. The chef was knowledgeable and made the learning process enjoyable and easy to follow. Afterward, we got to enjoy a delicious three-course meal featuring appetizer, choice of pasta, and dessert which was the perfect way to wrap up the class. We also opted for the bottomless wine and sangria add-on for an extra $30, which was totally worth it and made the meal feel even more special. Highly recommend for a unique night out or a fun date idea!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VQTEx0cmE0MU9icFBREAE",
            "text": "I was excited about the idea of making pasta with friends, and for the price, it's a great deal, especially since it includes a three-course meal. However, the experience felt a bit cramped due to the large number of participants. While making pasta was enjoyable, the overall food quality was mediocre.\n\nAfter our pasta-making session, we ordered calamari and burrata for appetizers. The calamari was a bit tough, but the burrata was delicious. I opted for the malfada with roasted garlic pecorino sauce, but unfortunately, the sauce lacked flavor and was quite disappointing.\n\nFor dessert, we tried the fried doughnuts, which were a solid choice, especially with the accompanying salted caramel sauce. However, the doughnuts were quite oily, and the tiramisu was a bit dry.\n\nOverall, I don't think I would return to dine here."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvc0k2Z2V3EAE",
            "text": "Wow… who knew $60-70 could get you such an amazing experience, definitely one of the best activities to do in NYC. Anthony made this experience extra special, he’s funny, helpful and kind. My friend dropped her pasta and he stayed with her after the experience to help remake her pasta. <3 You get a bang for your buck here you get to make varieties of pasta to take home and cook for yourself and you also engage in a 3 course meal and the portions are HUGE. Safe to say I’ll definitely be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ek1TZThnRRAB",
            "text": "FIVE STARS !!\n\nI had such a fantastic time at Aunt Jake’s! The pasta-making class was an absolute blast. Anthony, our instructor, was hilarious and really made the whole experience enjoyable. We got to make four different shapes of pasta, which was not only fun but also a great learning experience.\n\nDinner was top-notch—there’s a huge variety of delicious options, and everything I tried was fantastic. The service was also amazing—attentive, friendly, and made us feel right at home.\n\nAll in all, this is probably the best deal in the city for a night out. Great food, great people, and a fun, interactive experience. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMazVmZG93RRAB",
            "text": "The whole experience was so fun and the staff were all attentive, kind, and funny. Special thanks to Jason for recommending the kale salad for apps, it was surprisingly exceptional. After being guided on how to make our different shapes of pastas we had a three course meal of our choosing which was delicious and got to take home everything we made. Such a great way to spend an afternoon"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2NGRiaUF3EAE",
            "text": "We saw an advertisement for the pasta experience at Aunt Jake's and decided to try it! Reservations must be done ahead of time on Open Table and the slots get booked out very fast. We booked more than a month in advance for our weekend morning slot.\nThe pasta making class was fun but felt very rushed. The instructor was trying to be funny but was mostly rude. You first learn to make the dough and then four types of pasta (not from the dough you make). They give you all the equipment required for making the pasta and a box to carry this pasta back home.\nThe three course meal was very good. We tried the eggplant and mushroom appetizers, chicken marsala and mafalda pasta for main course and both the desserts - loaded ice cream and doughnuts. The servers were friendly and the drinks (priced extra) were okay.\nThe space is very cramped for the large groups they take in and honestly I felt like this experience was overpriced. So we will not be coming back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnell2Nnp3RRAB",
            "text": "Great deal! Probably can't find a better one in the city. Pasta making experience AND dinner included. The dinner was a bit misleading as the third course didn't have many dessert options (we had an ice cream sundae). The chicken marsala was also not very good. But the pasta was DELICIOUS. We had it at home with our own sauce. Hot honey burrata and meatballs also amazing appetizers! Still recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuemZhd293RRAB",
            "text": "Came here as an anniversary date with my boyfriend and it was amazing. Can not recommend this experience enough! Do not hesitate and just book! The food you eat and the pasta you make is all top tier. Can not wait to go back ASAP. Our instructor was super comical and made us all have a great time despite not knowing each other! 5 stars is just not enough!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmaDlUYm9nRRAB",
            "text": "Went for the pasta making experience and dinner, it was incredible. The instructor was fun and knowledgeable. The restaurant is easily accessible by train and a short walk from the train station.\nEnjoyed the 3 course meal. The dessert was absolutely delicious. The main course was fresh and tasty, the portions are good. The service was excellent.\nWe had a fun night, wonderful for date night or with friends. I totally recommend this place."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBbllxOS1BRRAB",
            "text": "This is a pasta making class that I 100% recommend to visit! You get to make pasta from scratch and shape them yourselves. The best part, you get to take the raw pasta home AFTER eating the included pasta dinner they make for you!\n\nThe staff are great and friendly. The food was delicious and filling. The only thing that “missing” was they ran out of mussels for an appetizer, even though we were the first class of day, but the other choices made up for it.\n\nThey start you off by taking your order. My wife and I ordered Calamari and Hot Honey Burrata as appetizers. Recommend the Hot Honey Burrata as that was delicious but not so much the Calamari. Still good however.\n\nI ordered Cavatelli Roasted Garlic Pecorino as entree. Wife ordered Rigatoni Spicy Alla Vodka. They were great! No regrets there. I will say we were hungry getting there but left full with some leftovers.\n\nDesert was also tasty with the Doughnuts with Caramel and the Mason Jar Sundae. If you go with two people. Get both as they are delicious.\n\nAs for the pasta class itself, it was very informative and fun. You are making pasta in a large table with multiple people. They have two instructors on each end of table showing you their methods and demos. They come around to help who needs it.\n\nYou start by kneading and creating your own pasta dough, that later you can shape at home. Then they bring out pasta sheets that are ready to be made into whatever shapes they teach you. Bowtie and Linguine were some of them.\n\nThen they let you take it home! Definitely a must visit if you never made pasta from scratch before. Very fun."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25seFRVbFJhV2xOTmtKWlkyZFViRFk1VUhrNVdGRRAB",
            "text": "Let me just say this!!! This pasta making class was absolutely amazing. I took my friend here for her 28th birthday and it was so much fun. I felt like a child again when I was making pasta for the first time. The instructor is so witty and made the experience worth wild. Honestly I’m not even kidding it’s some of the best pasta I’ve had in a while. The appetizer, the drinks, the entrée the dessert everything was absolutely delicious and It’s affordable and then on top of it, It’s a wonderful experience. It’s something new it’s different so if you’re thinking about wanting to do this experience, I highly recommend and I honestly don’t leave reviews like that, but I had to come in leave a review for this establishment. Thank you so much for creating this experience for us, serving great food, and for having a staff that has wonderful customer service now I’m trying to see who I can bring here so I can do this again lol 😂😭🙏♥️🫶🏾 I need that lasagna now"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJLTlLajhRRRAB",
            "text": "This was a fun experience for solo, with friends, and or date night!! I had so much fun learning how to make pasta from scratch. The staff were very friendly and helpful. First we started with making pasta and then we ate a three course meal. The food!!! Omg don’t get me started on the food. The food was amazing. Started with the champagne mussels and I had the broken meatballs with tagliatelle noddles for my entree. My boyfriend had the chicken bolognese and I almost ate all his food as well. Everything tastes so fresh and delicious. The bread was my favorite part. Ended the meal with a sweet treat. I love how fresh everything tastes and how affordable the class was. Felt like I was in Italy. I would highly recommend Aunt Jake’s and I’ll be back soon. Definitely better than Carbone!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJa0x6OFJREAE",
            "text": "10/10 everything!!! The pasta making, the instructor, the servers, the food OMG!\nWhat a great deal too! Highly recomment and literally want to do it again just for the 3 course meal that was soooo delicious. Perfect for friends, family & couples to do. They are always booked up too so make sure to book ahead."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPdmsyYmZNX01tUUxnEAE",
            "text": "My friends and I enjoyed the pasta class. The drinks were good and service was excellent. We had so much fun and a nice time! Highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMbjVpV3ZRRRAB",
            "text": "Had a great time at Aunt Jake’s pasta class experience! The course was fun and informative, we learned a lot. We made different types of pasta and even got to take them home! Included with the class is a 3 course meal with appetizer, entree, and dessert with plentiful options that are all delectable. Orders were taken before the class started and everything was served afterwards creating a fantastic experience overall. Would love to try out their food again if I can."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcmVmUWpRRRAB",
            "text": "Fun, loud and friendly (sarcasm is a second language). The menu they served after the class is exquisite (my mom and I ordered marinated mushrooms/hot honey burrata to start, chicken marsala and eggplant parm for the entre and a sundae for dessert)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMbXNXa0JBEAE",
            "text": "FINALLY! I snagged a reservation at Aunt Jake's to treat my sister for her birthday and it was everything and more! I reserved online for $10 per person ($20 total) which is deducted from the bill after the experience. Make sure you get here at least 15-20 minutes early so you can settle in.\n\nEach person has their own \"pasta making station\" where  you'll learn how to make different types of pasta that you pack up and cook at home. They are very organized when it comes to how they operate which is great. Once the pasta class is over, you're seated to enjoy a 3 course meal for $60 per person. You can also add in cocktails, soft drinks, etc. for an additional price. $60 for an app, entrée and dessert? Such a steal! Well worth the money and one of the best pasta making classes I've taken. Each dish was delicious and you can tell they were made with love. Will definitely recommend this spot for things to do in New York!\n\nAlso - The sweet potato gnocchi is a 10/10!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bzlYTUh3EAE",
            "text": "It seems like it's a nut free environment! The class we took was so much we learned how to make our own pasta dough and 4 different pasta shapes. It's a great place to go as a couple, with family, friends, etc. Once the class is done you can have a 3 course meal and everything was absolutely delicious. Definitely make sure to order and share!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1eVVIRjZUVVZ2YUd0MmN6VjRkWGgwV0ZwV2EwRRAB",
            "text": "This was the most amazing experience I’ve ever had in NYC. Joe was a phenomenal instructor. He was patient and went around to make sure that everyone was not only comfortable but confident in their pasta making abilities. The food after class was amazing. Heavenly even. I had the chicken parm. Slightly spicy just like I like it. Will definitely be back.\n\nThanks again Joe!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQaE1XdWlRRRAB",
            "text": "Took my wife to Pasta class. We had a great time. The instructor was very helpful and we were able to do so many types of pastas after is a three course meal that’s included with the price and everything was great and we were able to take our pastas home."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmX1lXSXJRRRAB",
            "text": "Similar to a Eataly but DIY, as you make your own pasta and you have a three course meal as part of your experience. We came as a party for 2 for my friend’s birthday.\n\nHOMEMADE PASTA EXPERIENCE\nYou start by mixing the dough and you keep the dough, as the dough needs resting and it is time-consuming. The chef will give you extra prepared pasta sheets for you to play around. You can keep all the made pasta and your palm size dough to go home. It is a fun, hands-on, and educational experience. Very obvious to see if someone has worked in the kitchen before or not.\n\nTHREE-Course Meal\nApps\nEggplant Caponata\nEggplant, raisins, celery, garlic, olives, tomatoes, paired with focaccia\nTasted almost like teriyaki, really fun stringy eggplant mush of sweet and savory on the top of the a big focaccia bread.\n\nHot Honey Burrata\nRoasted tomato, basil, olive oil, paired with rustic bread\nSpiced and sweet and creamy mozzarella elevated with savory olive oil. The bread is super crunchy with large air holes. I really like this dish because it screams tasty, whether with or without bread. Mike’s spicy honey, bonus point.\n\nEntrees (you choose a shape and a sauce/a set dish)\n\n(Set-dish)There Cheese Meat Lasagna\nThe cheeses are Ricotta, mozzarella, pecorino, with meat ground beef and short rib.\nWooow one of the best lasagnas I had, better than then one I had in I Sodi. The cheeses are creamy, melty, elastic, savory, and accompanied well with the ground beef and extra-tender fatty ribs. The pasta sheets are hard or raw but perfectly al-dente, weird for non-noodle shape but it was the perfect resistance to the teeth without being too mushy. Highly recommend.\n\n(Select shape and sauce)\nSquid Ink Bucatini with Sunday sauce (5usd extra)\nThe squalid ink bucatini is hollow and is 3.5mm in diameter. Texture is perfect and the taste is yummy as it hosts both a meaty sauce and also the umami from the fish. The Sunday sauce is their own marinara sauce with short rib, sausage, and veal, a feast for meat lovers. All meats are braised to be gifted a collagen-rich mouth feel with each distinct texture. The sauce coats the bucatini well and produces a well-rounded dish that I nothing to say but to be silent to eat a mouth full.\n\nDessert\nMansion Jar Sundae\nMansion jar with layers of vanilla ice cream, brownie, fudge, Oreo cookie, and maple whip.\nIt is exactly the taste that you would imagined. Good combo with smooth, crunchy, sweet and savory.\n\nDoughnuts with salted caramel\nThe doughnuts taste like eggy sponge cake, a bit denser than I imaged an airy doughnut but I don’t dislike it. Reminds me of the childhood sponge cakes made with lots of eggs.\n\nThe seatings are a bit crowded and the room is a bit limited. Understandable considering the area. The chef is super loud (former marine I believe) so don’t worry about not being able to hear the instructions.\n\nOverall, I highly recommend this place. For the price you actually get around 8 servings of pasta (4 made in shapes and 4 in dough version), and a three course meal. I would bring a friend or a date to share this special experience."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1bElLVjh3RRAB",
            "text": "I went to Aunt Jake’s for their Pasta Making Experience. My girls and I had such a great time. Definitely a new experience for us, and for the price, it was well worth it. We arrived about a half hour early. We were immediately seated and our drink order was taken. The young lady leading the experience was super sweet, great personality. She was very likeable and made the experience that much more enjoyable. We were able to take a significant amount of dough and ready to cook pasta home in little to-go boxes. But not before enjoying our drinks and the freshest pasta I’ve ever had. Over all it was a great experience. Great for date night or a girls night."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqZ19mcmp3RRAB",
            "text": "Went for a pasta making class had so much fun! You learn how to make pasta as well as have a 3 course meal. The male instructor was absolutely amazing. Entertaining, funny, knowledgeable and helped us. Had the best time would highly recommend to anyone. Food was delicious. Service was excellent. Drinks were also delicious."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfdFBLSGVnEAE",
            "text": "The attentiveness of the staff was wonderful as well as the food! My husband and I truly enjoyed that class. However, the instructor had dark humor and made a lot of inappropriate jokes that many people may not find funny nor agree with. Besides that we had a wonderful time!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MDdlQXdBRRAB",
            "text": "Took the pasta making class yesterday to celebrate my friend's birthday. It was a blast! We got to learn a new skill, had fun with the whole class, and ate an amazing meal after! The mussels were incredible, Chef Carmine is a cutie, and the energy was great. I would highly recommend this experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURId2J1am9RRRAB",
            "text": "We had an amazing time at the pasta making class! It was $60 per person for the experience ($10 deposit which they deduct from your bill at the end), and it includes an appetizer, entree and dessert - you can order drinks for an additional cost.\n\nI recommend trying to book the earliest class you can so you'll have more space to enjoy the experience. I booked the 5PM time slot which seemed more enjoyable than the 6:30PM slot because we didn't have a full house so we had more space to maneuver around (otherwise you're basically elbow to elbow with the person next to you). The pasta making lasted about an hour - was super fun and you end up making enough pasta for one serving (and extra dough for another serving), which you pack and bring home.\n\nThe butternut squash risotto was delicious especially with the hints of sweetness from the squash. It was definitely my favorite dish of the night. We also ordered the hot honey burrata, champagne mussels (dip the bread in the soup, it is soo good!), and squid ink bucatini vongole. It was a lot of food, but they pack it for you to bring home so nothing is wasted.\n\nHighly recommend this for a date night/girl's night out!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3eHBydkxREAE",
            "text": "Booked this class for my boyfriend and I and we really enjoyed it. The instructor was so kind, knowledgeable and funny. He made the class really enjoyable and was interacting with everyone throughout the night. I ordered the squid ink pasta and I didn’t love it. I feel like it could’ve used more sauce since the noodles were super thick but that’s really my only con. We both really enjoyed the spicy passion fruit margarita. For $60pp, I def think this class was well worth it."
        }
    ],
    "reviews_count": 50
}