{
    "name": "Pastrami Queen",
    "place_id": "ChIJRdfQLr5YwokRPG1c3y-4zJ4",
    "grid": "MN8",
    "address": "1125 Lexington Ave # 2, New York, NY 10075, USA",
    "rating": 4.1,
    "user_ratings_total": 1687,
    "phone_number": "(212) 734-1500",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMFZGVldUMFU0WmxScldqaGlUemROVm5WelpYYxAB",
            "text": "I found this place in google maps but to be honest it was a big big disappointment, I did order a classic burguer and a soda, the burger was not juicy, very very basic, the french fries were too greasy I even couldn’t eat them, I end up paying 30 dollars for a mediocre quality food, I definitely would never come back."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdVoxTnNiamN0Tmxaa1VEaGhlalJtVmpadE1tYxAB",
            "text": "So tasty and authentic"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVGRWcEJiRkZtWkU1c1dFbDBVbTE2VDNOQ2FXYxAB",
            "text": "“Best pastrami anywhere” for anyone who has never had pastrami anywhere else."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSWGJVWkdVbVoyVG1FeFlXcHdVSGd4UkVwaFFVRRAB",
            "text": "Are you kosher with a kosher certificate, if so, which one?"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSR1JucGxhbkZYZUZreU1uY3dhbVZSVmkxelQxRRAB",
            "text": "A real steal. Simply a sandwich made in 30 seconds with three cucumbers pulled from the jar. A $30 sandwich makes no sense even if it's delicious (and this wasn't). I ordered it by mistake because I misread the menu and thought it was $15."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOV2RsRjFRbFE1V1dWQmNWSlZha0pKYVVJM1IzYxAB",
            "text": "Solid pastrami sandwich. Easily fed two of us. Cramped quarters, felt lucky to find a seat on a rainy day. Attentive service. I think pretty much what you would expect at a New York deli. Definitely fit the desired need."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMmNUazRlbTV5TFhOWE56VnNNVmR1VkhBeVMwRRAB",
            "text": "Very hood pasteami sammy. Unsure if it was better than Katz’s. But i liked it very much."
        },
        {
            "date": "2주 전",
            "language": "iw",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taNlVtNURWM1Z5ZDNGM1NUaE9WRXhYVEhkTFlYYxAB",
            "text": "מקום קטן ,מקסים וכמובן טעים.מנות גדולות מאוד.מומלץ מאוד"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSmIzRjZTbDgwWDAxVWREVlFkMVJLZFRKM1RXYxAB",
            "text": "This place felt like a legit scam. Tiny portions, insane prices, gross food, and scammy service.\n\nWent late evening after a long day at The Met. Was told they offered table service, so we sat down to order. My friend and I ordered a pastrami sandwich each. They were $27.00. We were expecting huge sandwiches for that price and due to the fact they make you pay $4 extra to share. We each ordered a soda.\n\nThe sodas were in a cooler in cans - we got up and grabbed them ourselves. They were warm. Ten minutes later, our sandwiches came. Cold rye bread, a TINY portion of greasy, fatty flavorless meat, and a few soggy pickles. For 27 bucks. The sandwich had to be drown in mustard to be edible. It was so greasy and flavorless. The only real flavor was “fat.”\n\nThe server never came back to our table once.\n\nYou pay for your sandwich at the counter. As we got up, the server casually cruised by and said “oh, thank you. And you’re both very pretty. Both very good looking women.”\n\nI paid for my sandwich and hit the button to leave a tip, even though they did literally nothing outside of drop a sandwich on the table and call me pretty. Lol. For whatever reason, the cashier said the tip didn’t process and asked me to leave another. I said I tipped 18% — he said it didn’t work and I had to leave another. I checked the receipt and my bank and so far, I’m hoping it wasn’t a scam. But it felt like one.\n\nThe food here is NOT good and it’s CRAZY overpriced. But if for whatever reason you decide you want it anyway, don’t let them bait you in to “table service.” It’s a complete scam to get you to leave exorbitant tips."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SdWVHRnlOVlV6T1dWdE9HNUllVFptU1hSUmVsRRAB",
            "text": "$35 for a very good sandwich but a bit overpriced.\n\nHighly customizable options.  So many combinations.\n\nBread could have been better, but over still quite tasty."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKaGJFaHFZVzVPTms1bFUwOTVhSGRyVDFsU2NVRRAB",
            "text": "I waited 45 minutes for my sandwich because they forgot about my order. The sandwich that I got was cold and upset my stomach. Not worth it."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaWFoxVlFabTEwVTB4ek9HVjNabkppWTIxT2QxRRAB",
            "text": "Nice pastrami, a bit expensive for the size maybe but it’s enjoyable and the service is friendly"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tadVgzUkhPV05aUm1OcldEQjZVREZDVW05YVkwRRAB",
            "text": "Pricy and over-rated!\nNot recommending"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wMk1rMXVVbHBDTkVoWGNYQkNaalpPY0hSVlZXYxAB",
            "text": "The food was good nothing special Katz's deli gives you much more bang for your buck. I'm so disappointed I paid $70 for two pastrami sandwiches on the club and there was barely any meat in there I mean really. I'm never stepping foot in here again sorry but the trip to Katz's deli is well worth it. I'm so disappointed in you guys $70.00 for two sandwiches and four pickle tomatoes."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GcmRHTm1kMlZEWjFoUE4yOUlTek5rTUVOS2RtYxAB",
            "text": "Ordered the chicken noodle soup on goldbelly\nIt supposed to be chicken noodle soup, it only has about 10 strands of short thin noodles, carrots in a quart sized container. No chicken included."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPN2U0YTJYaGNyMFhnEAE",
            "text": "Delicious  brisket and tongue sandwich. Prompt delivery.."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHLXUzTkhnEAE",
            "text": "Still the best pastrami in city.  Better than Katz, 2nd Ave deli, or Carnegie. Ridiculously priced (as they all are). Seating is pathetic. But the smell and taste of the pastrami is fantastic."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tacWNVUmlVWHBHYTNsblMzcEtSbVJETTI4d05GRRAB",
            "text": "The pastrami sandwich would be fine, if it only cost $12.  But at $29 out the door, it is comically small and comically bland."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taYU1qZDVabFo0TVV4elQwUTBiMjVZTVRWVmNHYxAB",
            "text": "I visited on Rosh Hashanah for the first time in 20 years. I was disappointed. It was not as I remembered as a child. the food was mediocre at best. The pastrami was very dry, hard and too thick. Not enjoyable at all. The roast beef was flavorless and also very dry. For the prices they charge I’m glad I haven’t visited in 20 years and will likely wait another 20+ years for the next visit."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRWIwTlJialJ2TlVNdFZIZHJkVXRRUkU5elFWRRAB",
            "text": "their food from the store seems good but their catering food is awful. their brisket is cut way too thin and just disappointing.  stick to the pastrami and knishes, but again catering food for some reason comes from a different place and is just not good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210bVJGaDZjbXgxT1RGQ1dEWklVbWxVVm5BMU1FRRAB",
            "text": "Delivered quickly. Everything was exactly as ordered.\nFood was delicious. A great take in experience"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tseVdGSm1WVXhqTTBOVk56Sk5PVWhQVFROU2FsRRAB",
            "text": "Small store. Pastrami is delicious."
        },
        {
            "date": "1달 전",
            "language": "fr",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vNGRsa3RRVUZ1VEVoNGIxSTRNM0l3T1RoVGNtYxAB",
            "text": "En vrai le pastramie un peu bof comparé a katz sa n'a rien a voir je les trouve bien moin savoureur ici\nSeul chose qui me fait mettre 4 étoile c'est les frite qui sont maison et portion tres généreuse pour facilement 2 personnes katz devrait justement en prendre note car c'est se qui leur fait défaut....\nSinom trouve l'accueil moyen seul un employé c'est accueillir les gens sinom on existe pas pour les autres\nNiveaux prix c'est comparable a katz j'ai eu pour un sandwich 1 boisson 1 frite ( qui compte pour 2 ) un total de 42$ taxe comprise\nEn revanche restaurant assez petit si vous 5 ou 6 sa etre un peu compliqué"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21odVRsVTVYMGx0VTI1NVNtNVBWa1l6YjBwNE1IYxAB",
            "text": "Tiny room, amazing Pastrame"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tad1NYaFBkWFZUYkd0c1J5MW9VbDl2V2twNGFFRRAB",
            "text": "Delivery was really good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFMVVrRnJaVEpLWW5sM1MyczBVVlJEYkZJNFNFRRAB",
            "text": "Lets get right to it: $30 for the sandwich wasn’t worth it. Sandwich wasn’t horrible, a bit dry and had basic flavor but still edible (for $2 a bite of course) I just feel there shouldn’t be reviews or ravings of “known for huge sandwiches”. A huge sandwich should have me full or saving half for later. Im still hungry and Im definitely not a big back. I can appreciate great food for the price but this didn’t add up for me and I work all over the city to queens and brooklyn. Try it and form your own opinion of course but don’t go in with high expectations. I didn’t even have enough dressing to finish the other half of my sandwich.\n\nPs dont let the photo fool you, sandwich is barely 2 lbs Id say"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjMU5HcFdkM0ZSU210RGRtTk5hRGczUzNScGNWRRAB",
            "text": "Sitio pequeño. Raciones diminutas. Sandwich sin tostar. Precios desorbitados."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaaU0wNURhelYwUjNwUGNIRkdiV3hqTm5WZmIzYxAB",
            "text": "50/50... great warm service but the PASTRAMI WAS GREASY AND NOT TASTEFUL! To be honest the coleslaw was pretty good and tasted better than the sandwich. Very disappointed especially since the sandwich cost approximately $30. Did I mention the coleslaw was pretty good?"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNlVGVXdUVzVCTmxVNFNFOWFNalpzWjNoS2NFRRAB",
            "text": "Overpriced hit or miss food space. Food can be good but most likely it's not well prepared and therefore lacks taste where definitely should be tase for the price they charge. Typical train station food quality. Not bad but also not good. Too expensive for what they serve"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnbkxmRXJ3RRAB",
            "text": "Service-very attentive, food is fresh, very fresh and tastes as fresh as it looks!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONVYwTTJiamxSY1VweFJ6RlJYMWRYZWxkV01rRRAB",
            "text": "This place was recommended to me by a friend...and it was great! Had the hot pastrami and onion rings. Both were great!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjM09XZHBUemwyYkdJNVdscFVOamRzUlRWU04wRRAB",
            "text": "The pastrami was extremely dry and tasteless."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sWVVrUnRXbWRNUldOWlVWRjVOelJpV1VGNldsRRAB",
            "text": "Un poco decepcionante, si bien aún al parecer mantiene su estética original, se lo ve súper aburrido, el servicio fue amable pero había solo una persona atendiendo, el famoso sandwich de pastrami no tenía sabor a nada, ni siquiera el pickle que lo acompañaba, le falta mucho amor a esa preparación y eso que es un plato simple!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MFdXaHdjbE4xVjA1SWQweExlVmRTTXpGVE5YYxAB",
            "text": "Used to love it here but the prices have gotten out of control.  $23 for a large matzoh ball soup and it only came with two matzoh balls.  $4 extra to share a sandwich when dining in.  I know inflation is real but this is just stupid."
        },
        {
            "date": "2달 전",
            "language": "pl",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GcGVsbG5TbUp2UjBaRVpXSnpiR0pKUjJGdGVYYxAB",
            "text": "Nic specjalnego. Zwykla kanapka trochę bez smaku. Jesli spodziewacie sie czegoś nadzwyczajnego to raczej nie to miejsce."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3bVp5XzlnRRAB",
            "text": "Favorite neighborhood deli on the Upper East Side. We always take visitors there for their brilliant sandwiches, which are perfect for toting to Central Park. The Pastrami Queen staff is kind & good at what they do. Can’t recommend them more highly! It’s not a fancy dining room but it’s clean & comfortable. A+++++"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMVlXSXROM0ZsU0VwcGJsbHZVbUZRU2pkT1JVRRAB",
            "text": "Pastrami sandwich at $27: did not met expectations vs a corner deli."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMU5HMXZlVUZOTFdsV2VHRjRSVzVTZFZwTE9GRRAB",
            "text": "Higher price, less quantity, and lower quality than Katz. Only tourists eating there when I went."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wTlJXaG5SVWh2VjBGaU1rbGFZVE5XZEhSR1YxRRAB",
            "text": "We were really happy to have found this place. Had a craving for a good pastrami sandwich after a long walk in Central Park and were not disappointed. Shared one sandwich between two people and had coleslaw and potatoe pancakes on the side. The coleslaw was fresh, creamy and crunchy and the pancakes a fluffy, not too sweat treat with the apple sauce. Would really recommend this place for your New York visit!"
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201T2RUbDJiR051WjB4WlEzazVNbHBKTUVONlVGRRAB",
            "text": "Esperienza negativa; nonostante non hanno voluto farci sedere per cedere il posto ad altri forse privilegiati abbiamo aspettato 20 minuti per 2 Pastrami (altri al tavolo arrivati dopo di noi hanno ricevuto prima) e alla fine non è stato neanche un granché ne il panino ne le patatine che erano tutte bruciate"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcWFuUkZVbVJmVUVGQmQxUTVMVWxuVEdaeE5VRRAB",
            "text": "Great food and service. Far superior to the experience you will have at Katz's."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4dmFyLW53RRAB",
            "text": "Pastrami is good but the prices are way out of wack. $9 for one latke??"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWelRVMURkelZpTkhKUVZrNUNTRlJtWlVvMlVIYxAB",
            "text": "I was looking forward to a Great Pastrami Sandwich While my sandwich was being made I was given 2 slices of pastrami to taste\nBut received crumbs of meat sandwich .. Not happy at all!!🤨"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsWk0wVmxXR3BGT0V4NlUxOVhXbmR3VTNORmRXYxAB",
            "text": "Overrated. Meat is decent, but the price, the average bread bring the rating way down.\nOrdered the famous pastrami sandwich. Hype is way too much"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21adVowMWxUMGRDU0d4dFNtRlNlRUZFY0d0YVNHYxAB",
            "text": "Excellent egg salad and pastrami sandwiches."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdlFXWldhVGxxUm1ZM1ZFeFlRekJ2VFhWSGFWRRAB",
            "text": "Unfriendly and pretty sure they scammed me - no prices and charged $30 for half a sandwich with slaw.  Sandwich was OK but not the huge deli sandwich experience you would expect for such a price.  Would avoid."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rNE1HWmZUamhZU3poWVEyOHRUV05DZUZKNlZWRRAB",
            "text": "A hidden gem that exceeded expectations."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUE5WRmlkQzFIUWpCM2NuSmZWM05IYXpBeVgyYxAB",
            "text": "I love this place. People are very very nice and pastrami is good!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kMmFHMDNXbVJTU1ZoU2NrMHljUzFaT1hwUWRsRRAB",
            "text": "Assistant manager (Spanish Guy) very disrespectful and need to learn how to listen, not be arrogant and disrespectful to frequent customer who spends ovetr $50.00 per order.  My simple complaint had to do with the meat cutter who have tough Brisket on RYE bread when specifically ask for soft bread without seed.  This is due to Allergie issues."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kQ2VtbHBZbmhaVWpKZldqUnllakZIYlVOdVQwRRAB",
            "text": "Worst Pastrami I ever hadover priced dried out strips of fat."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNmRPNDhRRRAB",
            "text": "찐 로컬이라고 해야될듯\n가게주인과 동네사람들하고 인사하는 모습을 뉴욕와서 처음 본듯\n\n파스트라미 샌드위치 먹으러왔다가 화요일만 진행되는건지 모르겠으나 특가메뉴가 있어서 그걸 먹음\n맛있게 잘 먹음\n\n단체손님 주문을 받아서 그거 열심히 준비하고 있었으며 관광객의 모습은 보이지 않았음\n\n화요일날 센트럴파크 갈거라면\n여기서 포장해 가서 먹으면 좋을듯"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNRzEzLTJ2amV2WXF3RRAB",
            "text": "Pastrami Queen was great! The sandwiches were truly excellent — especially the roast beef, tongue, and brisket. The beef broth served as a dipping sauce was rich and flavorful. The coleslaw was fresh and perfectly balanced, and the local soda was just the right touch. The place was clean (even the restroom!), we found a table right away, got served quickly, and finished our meal without any delays. The check for three was a bit over $100 — definitely worth it for the quality and experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPR3Z0SlBCaWZiX1BnEAE",
            "text": "I really wanted to try a typical pastrami sandwich, and I think I chose a great place. It's very small and modest, but it has a unique and authentic atmosphere. The staff was very attentive and friendly. I ordered the traditional sandwich with fries, and there were two of us. It was very tasty."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPNnQ2b3ZNdmJLRU5REAE",
            "text": "Loved this pastrami. My top pastrami place along with Katz. We had the pastrami sandwich with noodle soup. Soup was okay but sandwich was phenomenal. I like that they don't add sauce and you do it yourself to suit your taste. We had to wait a little for the table but worth it. Service is fast as well and efficient. They have a decent restroom. Prices are normal as per nyc standard. Would recommend ✨"
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEeDUtSDBnRRAB",
            "text": "Un’ottima opzione per assaggiare dei buoni panini a base di Pastrami. Il locale è piccolino, non sempre è possibile trovare posto. Il servizio è ottimo, tutti i camerieri gentili e il cibo è fantastico. Le migliori patatine fritte mangiate a NY. Il prezzo è Ok considerando la media della città. Lo consiglio molto."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJazd1OFBBEAE",
            "text": "Pastrami Queen is absolutely amazing! Everyone who works there is so friendly, you feel welcome the moment you walk in. The pastrami sandwich is truly a hit: juicy, flavorful, and perfectly prepared. If you’re in New York and craving a real deli experience, this place is a must-visit!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbU0tYm53RRAB",
            "text": "We decided to visit this famous spot known for its hot pastrami sandwich after seeing all the great reviews, and it turned out to be an excellent choice! The sandwich was absolutely scrumptious, full of flavor and perfectly seasoned.\n\nTo make the experience even more special, we happened to run into Adam Sandler—he’s just as friendly and down-to-earth as you’d expect!\n\nThe place itself is small and modest, very simple in decor, but don’t let that fool you. It’s all about the food here, and that pastrami sandwich is highly recommended!"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3eG9EZXVRRRAB",
            "text": "El mejor Sandwich de Pastrami de NYC es el de Pastrami Queen!!! Pedimos un pastrami para dos y dos siders: patatas fritas y aros de cebolla. Los siders eran gigantes, pero no dejamos nada en el plato porque todo estaba muy bueno. Sobre todo el Sandwich de pastrami!!! El local es muy pequeño y tiene pocas mesas, pero tuvimos la suerte de llegar y encontrarlo vacío, aunque luego se llenó rápido! Mejor ir temprano."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdHViX1h3EAE",
            "text": "We went into this place on a whim since we’re big fans of pastrami sandwiches, but I think we would’ve been better off getting deli items and preparing them the way we wanted at home instead.\n\nThe famous 8-9oz pastrami sandwich wasn’t bad, but for $25 (1/2lb of the same meat was $24 on its own), it was really just the meat on bread with a pickle, and left a bit to be desired for us - though we’ve had about a dozen pastrami sandwiches all over the country, so we may just have certain preferences.\n\nWe also got the macaroni salad (delicious) and a spinach knish (HUGE and the flavor was good, but it wasn’t properly heated all the way through so we decided to just bring it home). The person who took our order was wonderful and very kind, though the sitting area to eat in was, as other reviewers said, quite small. He was very quick to make sure tables were clean and folks were seated though!\n\nAll in all, I think I would’ve treated this like a deli instead of a lunch spot and just gotten all the items to go (and just the meat instead of the sandwich) so I could prepare them to my preferences at home. Worth a stop if you’re craving good pastrami and other deli specialities though!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBM1VHdHhOVUZrWm5SM1QzTkNTakp2UVRKVlYwRRAB",
            "text": "I was in the area and was looking for a place to stop for dinner.\n\nI found Pastrami Queen! I'm so glad I stopped here.\n\nMy food was prepared very quickly. I only had to wait a few minutes. My pastrami sandwich also came with pickles, mustard and another sauce.\n\nMy sandwich was warm and very flavorful. I would definitely order this again.\n\nI can't wait to order this again; I highly recommend it!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJbkJvLW5WLVB2ek1REAE",
            "text": "Pastrami deli that has cozy seating. Not able to accommodate big groups. Has a small bathroom.  Pastrami sandwich was top quality worth the money. Check out the menu for many other delightful deli treats. They even have matzo ball soup. They also sell deli meats by the pound if you want to grab and go. Only one waiter but impressed he remembers every order and doesn't have to write it down.  Got to visit if your in NYC and are a fan of pastrami and freshly cut quality deli meats."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRLW9YTWV3EAE",
            "text": "I was passing by this shop and thought a hot pastrami sandwich sounded good!\nI looked at the menu and thought that $15 for their JR sandwich was pretty high, but if it was good, well worth the price!  It wasn’t good. As pictured, the meat barely covered the bread on a SMALL sandwich! The pastrami was also “crumbly” and dry! It was ready so fast after I ordered it that I was still paying for it when the sandwich maker brought it to me! This probably meant that the meat was pre-sliced! Which would explain the dryness.\nBy going to a shop named Pastrami Queen, I thought that I’d be getting a great sandwich! I guess I was thinking that I was getting a Katz quality sandwich! So very disappointed! Well, the young lady at the register and the guy that made my sandwich were very polite and friendly. At least I don’t regret leaving a tip for them!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdjk3Z0lnEAE",
            "text": "Known for their insanely tender pastrami and rich, flavorful matzo ball soup, Pastrami Queen is a staple for deli lovers. While the space is quite small and fills up fast, the food is undeniably worth the squeeze. Their sandwiches are generously packed, and the broth in their matzo ball soup is pure comfort"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyMjR5a0RBEAE",
            "text": "If you're looking for the best pastrami sandwich in NYC, this is the place to go! This old-school deli captures the essence of what a classic pastrami sandwich should be. The pastrami is perfectly seasoned, tender, and generously piled high on fresh rye bread. Each bite takes you back in time with its authentic flavors. The atmosphere is nostalgic and welcoming, making it a true New York experience. It is a little expensive, but absolutely worth it for the quality and taste. Highly recommend for anyone craving a top-notch pastrami sandwich!"
        },
        {
            "date": "10달 전",
            "language": "fr",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNmJyYVdREAE",
            "text": "Sandwich super bon ! La viande est de super qualité.\nLe lieu est sympathique et le service agréable, attentionné.\nLe seul petit bémol pour moi est le prix du sanswich. 24.95$ pour un sandwich , sans rien à côté, cela me semble trop cher (sans accompagnement sauf deux gros cornichons)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4MWRtazFRRRAB",
            "text": "In one word: Mediocre. I tried their hot pastrami sandwich, and it was disappointing. The rye bread was definitely not fresh, and the pastrami was bland. It was definitely not juicy, and lacked any distinct flavor. Even the side pickles tasted bland too, maybe low on salt. Overall, definitely not worth the price. You can get a much better sandwich elsewhere for a much better price."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWcHB2R21BRRAB",
            "text": "Amazing Pastrami Sandwich!!!\n\nSetup -- another stop on our Tony Bourdain NY food tour and another homerun!\n\nFood -- definitely one of the spots I was most excited about on our first trip to NYC. After tooling around in Central Park, walked up to grab a pastrami sandwich. What I didn't expect was the huge selection and menu of food ready available. Had only planned for the sandwich, but which I'd saved room for more.\n\nThe pastrami sandwich was huge and tasted fantastic. Pastrami was juicy and tasty, came with a big pickle, and two types of mustard. Opted for a side of potato cakes. They were definitely interesting and yum, but certainly different. They had such a huge selection, go there with an appetite, as I wish I'd tried more items.\n\nVibe/Scene -- definitely a small deli and not much space. They jam tables and chairs in every inch of the space, it's just not big.\n\nService -- was friendly, helpful, and prompt.\n\nOverall -- amazing Pastrami Sandwich and tons more to choose from!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2am9fTGhnRRAB",
            "text": "Hailed as one of the places that you should go because Katz it over-hyped and overpriced. I wouldn’t say the prices here are much better for what you get. $30 for this sandwich was more overpriced in my opinion than the amount of food you get at Katz. Comparison over, onto the food: The World Famous Hot Pastrami Sandwich.\n\nThe pastrami itself was top dollar, soft, flavoursome and perfectly cut for you to enjoy bite by bite without getting a whole load of meat. I wouldn’t say there was anything particularly hot about it so I’m assuming that is a reference to its popularity. The bread was the disappointing part, quite dry and lacked any attention to detail. Use the drippings to moisten it or put some spread on it. I’m sure there’s people who only want a “plain version” but maybe offer some spreads on order. Overall, a solid sandwich but not a great sandwich."
        },
        {
            "date": "6달 전",
            "language": "de",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeGNXeFRREAE",
            "text": "Das Essen war ok, aber aus meiner Sicht gibt es deutlich bessere Alternativen in der Stadt. Für 27 $ war das Sandwich viel zu klein, es gab nur zwei kleine Gürkchen und das Fleisch war etwas trocken. Bei Katz‘s gibt es eine größere Portion, von der zwei Leute satt werden können, und viel saftigeres Fleisch für den gleichen Preis."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNidG9YbnpBRRAB",
            "text": "Amazing classic pastrami sandwich, packed with tender and flavorful slices that melt in your mouth. The small space adds to its charm, making it feel cozy and authentic. The service is friendly and attentive, enhancing the overall dining experience. Great place!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2MF91ZU1nEAE",
            "text": "Pastrami is a serious debate in NYC. Pastrami Queen is one on the best kosher deli in town offering all the classic items form Jewish Eastern Europe food. Concerning the pastrami it’s amazing and be sure to ask for lean or fatty cuts. Also…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3b0lTQmdnRRAB",
            "text": "We had Pastrami Queen take-out, while visiting family. While we found GrubHub to be kind of wonky, we called and got advice on how to “Deli To Go.” Now, I must say so, it was so well worth it. 2 pounds of beef for a group of 4. Pastrami and brisket. Salad toppers. Vast quantities of quality deli mustard, brisket gravy, and thousand island. A loaf of rye. Matzoh ball\nSoup. Pastrami and brisket. A delish knish. The pickles and chopped liver. Overall a deli order that very much delivered. Literally and figuratively. Truly fit for a queen!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4Mi02eWRREAE",
            "text": "Fantastic and better than Katz’s Deli! My $25 pastrami sandwich was overflowing with meat. I got the mustard and dressing on the side. There was only a 5 minute wait on a beautiful Friday afternoon. This is probably my new favorite place to eat near the Met Museum."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4X0piRFZnEAE",
            "text": "Old school kosher deli, pastrami is a lot leaner and thinly sliced unlike Katz of S&P, also less of burn exterior is trimmed giving a unique texture and taste. Pickle's not bad, such a large portion saved 1/3 for later. At $24 per is tad expensive for what you get."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtME9MYThRRRAB",
            "text": "Their pastrami hot sandwich is famous for a reason. Amazing! very good, tender, meaty, yummy. However, be aware that they use bread with caraway. if you don't like it, maybe you should ask to use another bread. I do not know if the replacement will be possible though.\nGarlic fries are also great. As well as the onion rings. But the rings are a bit too greasy to my liking.\nThe staff was really nice too.\nWe have been to Katz and also here. And here is not any less amazing than Katz. So if you want to skip the queue, come here instead."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaeGJ6Ni1RRRAB",
            "text": "They serve up a great pastrami sandwich though at $25 it’s not great value. Their pastrami also tends to be on the leaner side compared to Katz’s. That’s a negative for me but on the other hand, the lines aren’t as long. Their seating area is pretty tiny so there is often an extra wait if you want to eat there but if the weather’s nice it’s a great lunch to take to Central Park."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dV9HSTdRRRAB",
            "text": "Amazing pastrami sandwich on the upper east side, more off the beaten path than places like Kat’z, but just as good. Love the pickles they give you too, and great retro ambiance."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4N2JlSlJBEAE",
            "text": "The service was great and all employees were wonderful. The space is not very clean but it is acceptable. Stopped in with my husband to split a Pastrami and potato knish for lunch. The Pastrami had a good texture and a good \"melt in your mouth\" consistency but I found the flavor to be pretty bland overall and the bread wasn't complimentary. Because of that, the price is too high.\nThe knish was good enough, but not something I'd go out of my way for."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4eE5HdUdnEAE",
            "text": "At Pastrami Queen, renowned for its classic deli offerings, we had the pleasure of trying their signature pastrami sandwiches, accompanied by homemade fries and a refreshing soda. With impeccable freshness and delectable ingredients, there is no doubt about the quality of their offerings. We are awarding Pastrami Queen four stars for its outstanding culinary experience.\n\nThe star of the show was undoubtedly the pastrami, expertly crafted and packed with flavor. Each bite was a delightful combination of tender, succulent meat and robust spices, perfectly complemented by the soft yet hearty bread. The homemade fries provided a satisfying crunch, and the soda acted as a refreshing palate cleanser, rounding out the meal nicely.\n\nWhile the food left us thoroughly impressed, we feel compelled to mention one aspect that could be improved. Given Pastrami Queen's well-deserved reputation and popularity, we believe they could enhance the dining experience by offering a more comfortable seating arrangement. Unfortunately, during our visit, we were seated in a cramped corner near the restrooms and their storage area. However, despite this minor setback, the exceptional taste and quality of the sandwiches made the wait well worth it.\n\nPastrami Queen holds a special place in the hearts of many New Yorkers, known for its long-standing presence and commitment to serving traditional deli fare. With over six decades of history, this iconic deli has garnered a loyal following, attracting locals and visitors alike in search of authentic and mouthwatering pastrami creations.\n\nIn conclusion, Pastrami Queen delivers on its promise of delicious, classic deli sandwiches. While the seating arrangement may leave something to be desired, the exceptional flavors and quality ingredients make up for it. Whether you're a pastrami aficionado or simply looking for an authentic New York deli experience, Pastrami Queen is a must-visit destination."
        },
        {
            "date": "1년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibWI2bFR3EAE",
            "text": "Havia provado um sanduíche de pastrami no Katz's em uma viagem em 2022. Em minha experiência, o pastrami do Pastrami Queen é mais saboroso.\n\nPedi o \"Hot Pastrami Platter\" que acompanha quatro fatias de pão, um pequeno prato de salada de batata e colesaw (salada de repolho) e um prato grande de pastrami fatiado (com quatro pedaços de picles). Esses aperitivos me surpreendeu positivamente. A salada de batata que é tão comum nos EUA. A versão do Pastrami Queen é excelente.\n\nO prato de pastrami veio um pouco frio. Mas isso foi solucionado, pois pedi ao garçom que esquentasse o prato. Tudo resolvido!\n\nEsse prato é suficiente para duas pessoas (fui com a minha esposa). Acho que o preço é um pouco caro (US$ 31,90), mas creio que vale a pena. Se comparar com o Katz's, o preço no Pastrami Queen é um pouco mais baixo.\n\nRecomendo para todos, especialmente, aqueles que nunca provaram pastrami."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnNVJHVXliakI0UWkxTlZXRmFiVFp6VGxJMGRIYxAB",
            "text": "No frills alternative to Kat’z. The sandwich was delightful!  Price was fair and the sandwich was decent in size. Came in on a Monday morning and no lines. Sandwich came out quick and got devoured even quicker. If you’re in the area, definitely worth stopping by."
        },
        {
            "date": "2년 전",
            "language": "it",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeHRmQ1BnEAE",
            "text": "Comincio con le note positive: il personale è molto gentile ed il locale, piccolissimo, è pulito, bagno compreso.\nIl pastrami però francamente l'ho trovato un po' troppo caro e meno abbondante rispetto ad altri posti in cui sono stato.\nPer il pastrami che vedete in fotografia (ce ne sono due di panini così, uno l'avevo già mangiato 😁) ed acqua frizzante ho pagato 40 dollari, mancia compresa. Giudicate voi."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoajZ1TGRREAE",
            "text": "This has been our go to take out for pastrami but dined here for first time and was even better. Quick service and Super attentive and kind staff.  There is something special about their bread and pastrami. Also recommend their matzo ball soup."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbkt6akN3EAE",
            "text": "After passing by the store several times, I decided to go in, it is true that the place is not inviting in terms of external visibility, but inside is a celebration of tastes from a long time ago.  And that's what I like about food that he…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfdmRxUmR3EAE",
            "text": "Ranks highly on my list of pastrami sandwiches in NY - this is a cosy and unassuming spot in UES that does its pastrami and sandwiches well and nothing else. Would come back and order more to go."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmMk92UWJBEAE",
            "text": "I never usually write reviews, especially if they are negative but I’m extremely disappointed with my recent experience at Pastrami queen. I previously ordered 3 mini potato latkes with a delivery order, and they were absolutely delicious! Based on that, I decided to order 24 mini latkes for Chanukah, expecting the same quality and presentation. What I received was unrecognizable and nothing like the 3 mini latkes I had enjoyed before.\n\nWhen I called to address this, the restaurant told me that the 3 mini latkes are prepared differently than the 24 mini latkes. How was I supposed to know this when the Seamless picture shows the same type of latke for both orders? This is incredibly misleading and feels like false advertising.\n\nI tried to resolve the situation politely and even asked if I could come in to exchange them for the \"normal-looking\" latkes I was expecting. Instead of offering a solution, the manager told me he was \"busy today\" and hung up on me.\n\nThis level of customer service is disgraceful. A clear lack of communication, false advertising, and dismissive behavior from the manager completely ruined what was supposed to be a special meal for the holiday. I won’t be ordering from here again."
        }
    ],
    "reviews_count": 86
}