{
    "name": "Nightly's",
    "place_id": "ChIJi10u8kJZwokRH-oXTMn-uVA",
    "grid": "MN8",
    "address": "1496 2nd Ave, New York, NY 10075, USA",
    "rating": 4.3,
    "user_ratings_total": 210,
    "phone_number": "(212) 597-2248",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWWRFSkhkMHh5WmxoaWJrdGlRemxrVGtRMGQyYxAB",
            "text": "This was the second time I experienced Nightlys and it only got better. A group of 9 took the back space that was perfectly secluded by curtains for friendsgiving.  The food was so good! Had chicken, mac and cheese, fries, brussels and desserts. The proportions were amazing and we did prefix based on group."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSWFF6bE1ObmwxTUVoSkxWcERTa0pYTWkxaGEyYxAB",
            "text": "This was my first time at Nighlty’s. Jane helped us organize a dinner for 9 people and it was seamless. Joel and Freddy helped us throughout the night and were extremely attentive. The crack and cheese is a must! The Brussels are the best we’ve ever had. I loved the cod, the lemon butter was divine."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kdllUUmxkbXRMVWpadU0wRk1lbWc1VEZaaVoxRRAB",
            "text": "We had our annual Friendsgiving at the large private table in the back and it was so fun! Joel and Freddy were the best waitstaff team - super accommodating and friendly. Jane was a great coordinator for our event as well. The food was so good - highlights were the short rib, Mac & cheese, Brussels sprouts"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWU1FXOU5hRzF1ZURsSmRIUmtTV2ROWkY5cE4yYxAB",
            "text": "Really bad. Waiter took the gravy/sauce boat from my PLATE with his BARE HANDS barely 30 seconds after I poured the sauce on my cod. I actually think he touched my food while doing so. Reservation for 4, my chair was getting kicked the whole night by the wait staff, and I was pushed in as tightly as I could (136lbs woman). Mediocre food. Bad service. Pushy to order and move on from the minute we sat. So many other better places in this in the ues."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSa00yOXhlakpTWDBkdVEyNHdOM05UVkdOaU4wRRAB",
            "text": "Service was wonderful and atmosphere was so cool!  Food was good but not great. Great spot though!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKRlYxRk5iRjltYWkxd2FsTXhaSE4yTUZWTldVRRAB",
            "text": "Amazing food and amazing experience… the food was great but Joel’s service made it that much better… he’s the man. Had a great time."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WSFkwd3pMVmhSWjNKRVRYQkZkRk5sUm1kV1VuYxAB",
            "text": "I was really excited to try Nightly after seeing so many great TikToks about it. Unfortunately, what those videos don’t show is how differently customers are treated. The food was good, but the service was terrible.\n\nFrom the moment my party and I arrived, the hosts were not warm or welcoming. There were open tables available, but we were told they were “waiting for a 4-person table to become available.” Looking back, it felt like they were hoping we’d leave, it seemed they simply didn’t want to serve us. The host, Ellie, seemed as if she didn’t want to be bothered with us at all. As we waited, we were asked to move several times whenever servers came by, which was uncomfortable and unnecessary especially considering there were two tables by the door that could have easily been put together for us to sit down.\n\nEven though we arrived 30 minutes early, we were eventually seated (before our reservation time), but at a small, cramped table. When we noticed two larger tables open up, we politely asked if we could move to a booth. We were told booths were for parties of six and that they’d “let us know” if the group didn’t show. No party of six ever came during our 90-minute meal, and one of those tables sat empty the entire time.\nTo make matters worse, our waiter never introduced himself  I had to ask for his name. I also had to ask for an additional drink after mine was finished, which felt like another example of the lack of attentiveness. Yes, it was crowded, and yes, this is Manhattan — but this is not the type of service I usually accept. One of my friends really wanted to try one of their desserts, so we decided to make it work.\n\nI even have pictures showing the empty booth and another where a party of five ended up sitting, while we remained cramped with our bags in our laps and some of our coats on. The booth that remained empty for the 90 minutes we dined ended up having two people seated there just as we were leaving and that’s the picture below.\n\nWe stayed, we ate, but we left feeling physically uncomfortable and emotionally unwelcome. It’s frustrating to see a place with such potential fall short because of poor customer service and a lack of inclusivity."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0TWEwdGpiMjEzTTA5cUxXeDVZMll4WDNBM09VRRAB",
            "text": "OK. Not many options. Liked it overall too pricey for no reason."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OdlEyTk1WVkJNWTFVMU5YVXhkRUZvZUVWVE9XYxAB",
            "text": "A perfect final night at Nightly’s!\n\nWe wrapped up our bachelorette weekend at Nightly’s, and it truly could not have been more perfect. The food was absolutely amazing - every dish was delicious, beautifully presented, and came in generous portions that our whole group loved.\n\nWorking with Jayne was such a pleasure. She went above and beyond to make the night special - so hospitable, creative, and thoughtful in helping us design custom menus that fit our group perfectly. Her attention to detail really made the evening feel personalized and seamless.\n\nAnd a huge shoutout to Kyle, our waiter, who was the absolute best! His energy, humor, and attentiveness kept the whole group smiling and made the night even more fun.\n\nNightly’s has that quintessential Upper East Side vibe - stylish, warm, and lively, and it was the perfect spot to celebrate our final night together. We couldn’t recommend it more for a special occasion or a night out with friends!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twak9WWk1ZMkpJUlU5clYzZFNaaTFFVEZNM2JGRRAB",
            "text": "Good ambience and nice service. But food tastes mediocre and the portion is too small for a main dish from the dinner menu. We had ceviche, burger, carbonara and mussels."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKSlpHeERMVEo1VVZSV01GQkRURTlGZDJSUmJIYxAB",
            "text": "We had a lovely time. Joe the Manager is the BEST and has the MOST competent staff. Izzy the Floor Manager, Mina our waitress and Kyle behind the bar. The food was FAB!! Highly recommend."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xscmVFbFdaRVpwZGsxbE1GQkpUamRTWDFOU2EzYxAB",
            "text": "Tasty food! The burger went perfectly with caramelized carrots. Joel provided excellent service and made our experience all the more memorable. Thanks 😊"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxQ1ZEZEpiMlkxT1dwcU5ESTBjbEJJV1dOdllYYxAB",
            "text": "I had the absolute best experience at Nightly’s! From the drinks, to the food, to the service it was all incredible. The general manager was also a pleasure to work with. I will definitely be returning and have no doubt that it will be the same great experience! So many awesome gluten-free, vegetarian and seasonal options. Highly recommend the salads and chick pea fries!"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ai1TYThRRRAB",
            "text": "The perfect spot for a late-night Martini or a cozy family brunch. The atmosphere is both glam and intimate, filled with art and personality. The food is delightful, the staff is warm and welcoming, and the desserts are a must."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGdVJrdDVUa3hRVHpKSk9HMUVZVEl3VlVNNFIyYxAB",
            "text": "My friends and I came here for a birthday and we booked the private table behind the curtains. Literally had the best time of our lives. I would legit DIEEEEEE for our serve Kyle, actually love him badddddddddd I miss him already . We had a pre fixed menu and I can’t say one bad thing about the food it was amazing. Honorable mention to the CHEETAH PRINT CHEESECAKE - byeeeeee it left me speechlesssss. I loved it. The drinks, the food, the service - just amazing. No doubt in my mind that I will be back there.\n❤️"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kaFNHOTFaSHBYYjBkVVpXUlZiR2xaZWtwNVlsRRAB",
            "text": "Nightly’s has quickly become my new favorite restaurant in the city. Everything about it is incredible - from the chic yet laidback ambiance to the friendly, attentive staff who make you feel so welcome. The food is amazing and you can really taste the quality in every dish. The cucumber salad is a must (I get it every time!), and the cocktail menu is so well thought out - every drink is unique and delicious. It’s the perfect spot for dinner, drinks, or just a great night out. Highly recommend!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gb1dqQjBRVmQyVkdWbmJHRndhMjFZVDJ4WWJsRRAB",
            "text": "This was really disappointing — the quality was far below expectations, and it felt like no real effort was put into it."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSk1XbzBPRlE0WVhodlNXUXlRMFZtYmxaM1ExRRAB",
            "text": "Yummy mocktails. Wouldn’t go back for the food, except the chicken was great!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SQ1kzZEVTalZ5YlV0NVRIVmxkbTluV1hGS2JuYxAB",
            "text": "Extremely pushy waitress who kept bugging us about ordering from two seconds after we sat down! Repeatedly, despite me making it clear that we just sat down and can we catch a breath first. This went on throughout the evening, not just with the first drinks. She just kept bugging us half way through each course if we’re ready to order more. And then when we did want attention, nowhere to be seen. Very rude and pushy. This despite us being the last reservation for the evening.\nDrinks were good. But appetizers were highly disappointing. The ceviche looked like cat sick and tasted disgusting. The octopus was tiny and overcooked. Just disappointing altogether. Never going back."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWVltNVRjV2N5YTJ3MFVXUjNkRGhOZWxRMWJtYxAB",
            "text": "great martini"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MlZIRkNhMmRVWVVSeFRXWk5WVzVoTkZoMVprRRAB",
            "text": "Great burger (the caramelized onions really make it) and sticky toffee pudding. The risotto and mac and cheese were just okay. Trendy, fun atmosphere."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFd09WTkdTekZXVWtkdVpESk9iMXBmZDJaWFRXYxAB",
            "text": "Great food, super friendly staff, and fun atmosphere!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214d1pFMUVWbFY0YmpOTlNHRXdNV2g0WjJSQ2FWRRAB",
            "text": "I got food poisoning from eating here, along with many other reviews (I think this is the 5th or 6th one)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Fd1IwUnZMVGhHVlVSMlRFMTJkbTl2ZVRWQlIxRRAB",
            "text": "Joel is the man! And wonderful wine and ambiance."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTFdXTjVabEJVVmtzM2R6bFlVVXR5UjJkM2NrRRAB",
            "text": "I don’t often go out of my way to write a review but this was an exceptional experience and it is well deserved. I am a foodie with high expectations and they did not disappoint. I did not go 1 minute without a water refill, which I highly appreciate."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0WWJ6UXhOelF3T0hRMVJqRlpibEZxT1dkZlpuYxAB",
            "text": "This new place is buzzing and vibing, but the food lacks flavor and, frankly, good taste. I would stay away from ordering their seafood as both dishes I've tried - ceviche and cod - were the most bland in town (in my experience). The steak was better, although I'm not sure if it stood out merely in comparison to other dishes. The highlight was the chocolate dessert, which was truly impeccable, but not nearly enough to redeem the overall experience. It seems as if the whole effort went into the decor."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVGRWQnVOblJhYWpWTVRIRnlkVWN3VVZWeWRVRRAB",
            "text": "Nightlys is an amazing spot for all types of events! From the moment I walked in, the ambiance was perfect—stylish yet welcoming. The food and drinks were absolutely delicious, and every dish felt carefully crafted. On top of that, the staff was super nice and attentive, which really made the experience even better.\n\nThis place is definitely a 10/10 in my book, and I highly recommend it to anyone looking for a great time out. Nightlys has officially become my new go-to spot!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205UmFsWjRhVlZsYkhkUlNubDJVMHgwVlhZMWVtYxAB",
            "text": "My wife and I tried to visit this place with our son two weeks in a row but were turned away both times. The hostess was very rude and claimed they were expecting other guests, even though the restaurant was half empty. We even saw reservations available online, yet we still weren’t seated. It seemed like we were turned away simply because we had a baby with a stroller. The service and staff were terrible. I do not recommend this place at all."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNeE1teElSak5KYWpOQ1JVdDZkVlZUWms1MU1WRRAB",
            "text": "Joel was amazing - his recs and energy made the night :) get the date pudding !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wa1JHTlpXbTF3VkVweFNWQklSMlpuWDFWTVoxRRAB",
            "text": "Phenomenal, inventive cocktails. Max at the bar is seriously the best."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5b1NuSTJXazVWTjNOUlltVnlRMVY1U1MxRmVFRRAB",
            "text": "Went for brunch and was super disappointed- the steak and eggs was such a small portion for $36. The service was awful. our server ignored us most of the time, but when she did come by she awkwardly stared at us and didn’t seem friendly.  It was also a hot day and there was no AC on inside… my friends and I were sweating the whole meal. I asked to have the ceiling fans turned on bc they were off and apparently that was too much to ask. I would say skip this place. It was an expensive less than dining experience and dining out these days is too expensive to have a bad time!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SVVVXSnVZMlJOT1dsM2MyOVZVR2hSYTFsa1pFRRAB",
            "text": "Downtown vibes but uptown with a solid burger. Video review below but check out the full version on my IG/TikTok: @snacks.andthe.city"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdGMyNUhhMHBFV20xR2RVUkxNRGRZV2pkaFRVRRAB",
            "text": "Yeah, I don’t usually write reviews—gotta keep the good spots safe from you vultures. But fine, here we are.\n\nLet me confess: I’ve shamelessly eaten my way through the menu more than once (and don’t even get me started on the wine and cocktails—dangerously drinkable). If you’re hunting for food that’s not just good but mind-blowingly delicious, this is your spot.\n\nThe menu plays both sides: angelic or devilish, you pick. Case in point—prawns. Fresh, zesty, perfect with a squeeze of 🍋 … but if your cholesterol can handle a little recklessness, why not drown a couple in butter and live your best life?\n\nThe vibe? Options galore: cozy booth for a date, patio for that breezy night out, bar for the fun chaos. I’ve gone with friends, colleagues, a date—you name it. Zero complaints, maximum repeat visits.\n\nAnd now, a PSA for my fellow water snobs: rejoice. None of that over-chlorinated tap nonsense. No swimming-pool-scented ice cubes. Just crisp, clean, sip-worthy water. Cheers to that.\n\nBottom line: this place slays. Eat, drink, flirt with the menu, and try not to become addicted. (Good luck with that.)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMk4zZE1NVnBRTVVRM1VEVjJYMWxRZFMxUFoxRRAB",
            "text": "It was so cool to see my boyfriend’s designs on the menus! The gnocchi was incredible and a perfect last dinner for our trip to New York. Go check out the owners music it’s fire- Gasoline Tequila"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGU2IyZGxkRFZEU1dOVFdXMVRSMkpWWTI5Zk1XYxAB",
            "text": "The food here is simply not good. Spinach artichoke dip was extremely salty and had almost no artichoke, the tomato and watermelon salad was basically a wet pile of tomatoes, and the banana leaf cod was overcooked, dry, and flavorless. I expected mediocre food from a sceney place like this, but it didn’t even live up to my low expectations. Atmosphere is nice, service was just okay."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWV1MxUlhSalozT0hack5HTkpVM3B6TUdWbVpIYxAB",
            "text": "Food was great\nStuff was amazing\nI recommend this place to everybody"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JdFRrNWpiSEk1YTNkb2JFOUNjbmRZTlRWaFJGRRAB",
            "text": "Loved our experience here at Nightly’s for brunch. They have a great dinner selection, but their brunch is where it’s at! We ordered the pork belly hash, chicken club sandwich, and eggs Florentine benedict—yum! The fries were incredibly crispy. Then, we finished with the lemon ricotta pancakes to share. They all tasted amazing! Sat outside with drinks and people watched/chatted. Our waitress, Mina, was also incredible, super nice, and very attentive. She speaks many languages which is also very cool. Highly recommend this experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeGFrSlJkMFpsYWpJNFQxb3liRnAxYlVNNVFWRRAB",
            "text": "From the moment I was greeted by my server, Joel, I knew I was in for a great dining experience. Joel was attentive, warm, and incredibly knowledgeable about the menu, guiding me toward a dish I might have otherwise overlooked the lemon carbonara pasta.\n\nThe pasta was an absolute standout: perfectly al dente noodles coated in a luxuriously creamy sauce, balanced with the brightness of fresh lemon."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xweGJYbHdkSFJaT1ZGUWFVUlhYMmN3Wkc1b00wRRAB",
            "text": "Great food and vibe!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210QlEwRXdVV2hsWmtabE1FRmlMVlZ1ZFd3MVgyYxAB",
            "text": "KYLE made our night one to remember. The wittiest, most attentive server I’ve had in a long time. He had spot on recommendations and made us feel so welcome. I highly recommend the porter house steak and street corn, and the sticky toffee cake is TO DIE FOR. Do yourself a favor and reserve a table, hopefully Kyle is on schedule to make your night one to remember"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsSVNraDFaV0kwVGtVd1NEZG1YMkkxYVZwYU1WRRAB",
            "text": "I had an incredible dining experience at Nightly’s! Our server Kyle was absolutely phenomenal, he was playful and made us feel at ease, we had all of our needs met…we stayed at our table for three hours and were invited to do so-felt the opposite of rushed. The crudo was excellent as was the dill centered salad. The tale of two tar tars was too fishy-would not recommend, the mussels were solid, heavy on the thyme. The restaurant has an excellent vibe-truly feels like you are getting lost in a restaurant downtown-loved the atmosphere, wine was excellent."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBdGZuc0d3EAE",
            "text": "Yummy food and drinks! Loud but good vibes! Joel is the BEST server, so kind and attentive! Thank you Joel for an amazing night!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOM1N6RkRlVGhGUTJNd05YVjJXbDlLV0Vsb1dWRRAB",
            "text": "Nightly’s is a phenomenal addition to the Upper East Side — hands down the best dinner I’ve had in the area in years. The food is exceptional, offering a menu that’s both approachable and refined. The beverage program is equally impressive, with a thoughtful balance of creativity and sophistication. Service is flawless, and the ambiance strikes the perfect balance between chic and inviting, never crossing into pretentious territory.\nThe true highlight, however, is Joe, the manager. As someone with a background in restaurant management, I can confidently say that hospitality professionals like him are rare — his presence elevates the entire experience. Nightly’s has quickly become a go-to spot on the UES. Highly recommend. 10/10."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wNWJFVTBUQzFoUmw5NVVYZElkVkZGZW5kcWFWRRAB",
            "text": "Wow! Soooo impressed with Nightly’s!! I feel like I’m sitting in Paris…But elevated & in NYC!! And good looking crowd. What a vibe…the brunch was YUMazing! From the French toast (A MUST), pancakes (Fluffy crispy perfection), eggs florentine (divine hollandaise - like cacio Pepe) and chicken paillard! I could go on….i can’t wait to be back & try the dinner dishes. And come back for brunch bc it was BOMB!! Exactly what the UES was missing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTVgybHBVa3B6Vm1OSVREQXdSWFJ0WlRKUmRWRRAB",
            "text": "My wife and I tried bunch at Nightly’s for the first time today, given that we are regulars at the restaurant’s sister locations down the block and have always had great experiences at those locations. Unfortunately, I’d summarize our first experience at Nightly’s as abysmal, both for the food and service. After being seated, we waited 15-20 minutes w/o a server stopping by. We finally had to flag down the wait staff to put in our drink order. When the drinks finally came, there were missing items which the server forgot until prompted another 15 minutes later. While placing our food orders, we were informed that the restaurant was out of several items on the menu. As a result, we changed our orders based off that information. Once the food orders were placed, the server again returned to our table notify us that some ingredients were out for one of our entrees; however, they could make a substitution and still deliver the meal which we said fine to. When the food order arrived, the club sandwich was on the wrong type of bread, missing bacon and had so much sauce that the bread was disintegrating. The steak and eggs were bland and the meat was undercooked to the point that it was tough and sinewy. When the wait staff notice that I had not touched 70% of my meal, I informed them that it was not correct and missing several items. Rather than raise an issue, I asked if my meal could simply be boxed up to go. Despite saying no several times, the server (after speaking with the manager) insisted that they would remake the food for me rather than offering to remove the item from our bill or offer something else from the menu. The manager never once stoped by the table to apologize or ask if there was anything that they could do to help. When we were done, we paid our check and left the restaurant quietly. Upon returning home, I opened the food that was remade out of curiosity. Unfortunately, the sandwich was half the size of the one I’d initially received in the restaurant, the bread was not toasted at all and the sandwich was again disintegrating from too much sauce. I think it’s safe to say that I have zero plans on retuning to this restaurant in the future."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OalExTTBWVUprWVU1SFptMXRaSFUwVUhCbVFtYxAB",
            "text": "Yum! Cocktail, eggs benedict, pancakes and French toast all 10/10. Best brunch in a long time"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSGVGVldhV2cwY0U5cVpqSnVVazQwTVRCTlRVRRAB",
            "text": "Beautiful restaurant - food was amazing (challah French toast and peppercorn Hollandaise, so good), great service, and cool ambiance - such a great addition to the UES!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZeFJGb3RPV2hFWXpaUmQxZDBPRTgzVGtGdlNtYxAB",
            "text": "I organized a bday for 8 friends.  Jayne was amazing at helping me plan the event.  We were seated in the \"boardroom\" which was a great spot as you are in the restaurant and feel the energy that Nightly's is famous for yet had some privacy.  Our waitress Patricia was a pro and took care of us really well.  Her recommendations were accurate and we all enjoyed the food selection.  We will be back for sure!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSUk1XVndUMmROY1RWT1lYWm1PREpWWWxjMmVsRRAB",
            "text": "I’ve been wanting to try out Nightly’s for the longest time and finally got the chance—it did not disappoint!! The staff was so sweet and accommodating. The flow of the food coming out was perfect. They did not rush my friends and I (we took forever to order) even though it was a totally packed night. The food was phenomenal, we shared so many apps and entrees and everything was amazing. Will definately be going back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKMWVFZFJRMGxqWVVaclQzbHZYM0ZNYW5aaU1HYxAB",
            "text": "I’ve been here a few times w the girls and it has consistently been a great experience from start to finish - the drinks, the apps (get the spinach & artichoke, it’s not the basic one you’re used to), mains and DESSERT.  And the service is always top notch. Definitely a gem in the UES! Can’t wait to try brunch!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRE4xbHdWVVo2TW5JdE9FRTJabWhCTFhKNlNVRRAB",
            "text": "Went for brunch on a cloudy Sunday, not busy at all and got seated right away but waited 1 hour for food.\n\nThe servicer was ok. It took her 3 trips to the table to ask if we wanted coffee and we never saw her again until our food was finished.\n\nMy GF and I both got eggs Benedicts.  She got the vegetarian version.\n\nThe flavors/seasoning were great but..\n\nAll 4 eggs were completely over cooked.. I get prices are high ($26 bucks for each meal)  but when you are paying nearly 30$ for 2 eggs, English muffin and potatoes. I expect the poached eggs to be poached not hard boiled.\n\nSince the server never asked how our food was, we never had a chance to say anything..."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvX2Jqb0xREAE",
            "text": "I stopped in today for brunch, it was packed. If you have kids it’s not stroller friendly, so if you’re bringing one make sure it’s a small compact one. We had the cacio e pepe eggs and stuffed French toast with a whipped berry compote.\n\nPortions were good for sharing.\n\nMy 2.5 year old doesn’t eat eggs at home but he did here so that was a huge win! I guess I need to prep them like they do. I loved the challah French toast, the whipped berry compote was very tasty.\n\nIt gave me French bistro vibes. Just didn’t find staff the warm and friendly but I’m coming for the food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQbk15ZXVZLTQzLUJREAE",
            "text": "Made a reservation. Which is probably needed cus this place is busy. And rightfully so - this may be one of my new favorite restaurants  hands down\n\nFirst the drinks - perfect martini. They had a unique version of a dirty which I thought was exciting and the taste was perfect.  I ended up having 2\n\nWe had the steak and the burger. I’m on a quest to find the best burgers in nyc and this ranks close to the top. Everything was so tasty I saved my last bite for this     -  the steak was good but honestly it’s steak and used the same seasoning as the burger\n\nWill go back\nFor the drinks and burger alone. But my partner wanted to try the twice baked potato. Which was another win. So strange how it looked but tasted perfect as well.\n\nI just wanna go back and try other things but fear I’ll just do a burger\n\nThe fries held their own too !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ONFJHeFRhWGRIT1VsUWRWTkxWMWR6YTBscWFWRRAB",
            "text": "Nightly’s is just what the Upper East side needed! Went last night for the second time with a group of friends and we all couldn’t say enough about the atmosphere, drinks and food. Love that we went on a Tuesday night and there was such a good vibe. The staff is so friendly and professional. Even though it was busy, our waitress was such a doll and had such patience while we chatted/couldn’t make menu decisions. The manager Joe has been a pleasure to work with on getting reservations for our group.\n\nI started with the Misfit Martini and omg was it delicious! I always say I can’t do a martini, but the name speaks for the drink. So delicious and perfectly made.\n\nFor food, definitely order the Caesar, tuna and spinach & artichoke. You will not be disappointed. I’m still thinking about the cod and lemon carbonara. Lastly, get the toffee pudding — it’s more of a bread pudding and is insanely good.\n\nWe will be back for sure!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJenZqTHl3RRAB",
            "text": "HOW TO GET IN: I was able to walk in around 6 pm and still got a table.\nI think this is a cute cool new spot! Loved how lively it was inside and they’re accommodating. I think the food is good especially the rib appetizer but I think it’s too expensive for what it is"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRM1B5VDRBRRAB",
            "text": "This has become our favorite neighbor spot! The food is amazing along with the staff. We love the ambience as well. It’s very downtown vibes uptown. The burger is not to be missed along with the octopus. The steak was also amazing and the chicken. Oh and don’t miss the carrots!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2ajlEMERREAE",
            "text": "Sometimes, the crowd is wrong, but definitely not in this case. This place always seems to be packed and that's because the food is excellent and well prepared, while the drinks are creatively mixed and better than expected. Our server was really great as well.\n\nIf there's one thing that you can find significant fault with is that there isn't a lot of personal space as it's tightly packed to fit as many people as possible.\n\nOverall, I completely understand why it's always packed and it's certainly a great addition to the neighborhood."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOUmQxUm1NVlZFYjFkTFRHaHZXV3gyUmxWclZtYxAB",
            "text": "Such a cozy and stylish neighborhood spot with great comfort food and amazing wine list! The staff is very warm and welcoming. Definitely worth a visit!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cVpmYlNnEAE",
            "text": "I had an exceptional dining experience at Nightly’s. From the moment we walked in, we were immediately struck by the inviting and stylish ambiance, which set the perfect tone for the evening. The staff were attentive without being overbearing, offering insightful recommendations with genuine enthusiasm. Each dish we tasted was perfectly prepared, full of rich flavors, and beautifully presented. The butterfly prawns, short rib, and the cod were all thoroughly enjoyable! The evening flowed seamlessly, and the service was impeccable throughout. Nightly’s is truly a gem, and I look forward to my next visit!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbC1IQTVRRRAB",
            "text": "The vibes are just what you want after a long week. Where friends come to share good laughs with amazing dishes and mighty drinks that give you that liquid courage.\n\nGet the octopus and Rockefeller oysters and then the steak and chicken is a must-have! The desserts are also amazing with your espresso martini:)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJM0drS1BBeC0teFpBEAE",
            "text": "I've brunched on the weekend here, which was exceptional prompting me to try the dinner menu, which was also very good.  I used to frequent here alot for weekend brunch when it was Quality Eats. The Brunch menu is delicious - we had almost everything on the menu and all were exceptional. The specialised cocktails are worth trying. For dinner, the seared ngocci was devine, drenched in aromas and flavours and sun dried tomatoes. The grilled corn as a side was perfect - charred flavoured with spicy mayo for kick. I had the fish tacos, and honestly, I recommend they ditch that as it does nothing to the menu. Boring and bland, could use some spice or kick or flavour. Cocktails were great. I had a martini, and sitting outside people watching was a great dinner experience."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBdGVtakdBEAE",
            "text": "Cocktails are amazing. Cool atmosphere. Friendly bartenders as well. Highly recomaned it. We are from Germany and enjoyed our time at the bar with a few Cocktails."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WVYydEtNMDlwWWtzME5sVndPV1IzY0ZFdFdrRRAB",
            "text": "We had a delicious meal at Nightly’s. It’s a great neighborhood spot on the UES. The team was so nice to us and the steak was delicious. We also enjoyed our cocktails, their wine selection and the roasted carrots. We’ll be adding this to our regular rotation - and they told us to come back with our kids!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJUDd4LVBsOExUb1FREAE",
            "text": "Joe, the Manager, was great. Got us a table right in the middle of the insanity. Was it the best table? No…\n\nWere we happy just to get a table?…  Absolutely!\n\nService was great. Food was fantastic."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVMFVHWlViMTlaUjNGeGJtNXBVVEUwWWxGU1gwRRAB",
            "text": "Love this place, came for a date and had wayyyyy too many 2nd Rodeo cocktails. Then came back again to have even more solo. Need to actually eat more than the artichoke dip next time. Anyways, the service was fun, the drinks were fab, and there’s a reason why this place is always crowded🥰"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3anFTWkdnEAE",
            "text": "New Best French Fries Alert! Everything is So Good… but ooh man THE FRIES … perfect! Great neighborhood spot for an intimate date or to meet a friend or several! Servers are all Minnesota Nice, drinks are tended by a seasoned professional, food is top notch - a welcome downtown cool addition to the Uppers!  (Also the sweatshirt sitting at the bar was a sign I should get one but it was sold out by the time I went to get one!)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOE1tUFhBEAE",
            "text": "Came for the vibe, stayed for the vibes and left with the vibes!!\nWent on a Saturday night to celebrate my fiancé’s niece’s 18th birthday.  We sat in a cozy nook in the back.  Every dish was a flavor bomb -- we shared the short ribs, chickpea fries, Chargrilled caesar, and I had the Cod as my entree.  Each dish was packed with flavor and if you know me, I’m a sucker for great food and presentation.  There was also a variety of fun, unique cocktails, but the bartender made us the tastiest gin cocktail with pineapple and cinnamon (downed 3 in an hour :) )\nService was impeccable and quick even on a busy Saturday night.  Overall, we had an amazing time with family and friends.  If you’re looking for a cool spot, you will not be disappointed by the food, ambience, stylish decor, and even the cute uniforms!\n\nP.s. - the date dessert is a must!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvenNiNGlnRRAB",
            "text": "I gotta say I was a little underwhelmed by the food overall. Nothing really jumped out to me on the menu. We ordered the Tale of Two Salads, Tartar Tango, Marry Me Chicken, and the cod. The salad ended up being our favorite of the night. Fresh, flavorful, and I loved the creative use of Brussels sprouts. The tartar didn’t quite land for me. The avocado seemed a bit bruised and overpowered the tuna, and I didn’t get much of the yuzu ponzu. The cod had good flavor but I found it a bit overcooked and tough. And lastly, the Marry Me Chicken. I think the chicken was cooked perfectly, the skin was crispy and it was extremely juicy. I just wish you would get a bigger portion of the sauce.\n\nOn a brighter note, the drinks were really well made and tasted great. Overall, it wasn’t a bad experience, but I don’t think I’d rush back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJb3Q2TWJnEAE",
            "text": "Nightly’s is clearly aiming for that Hillstone magic—dim lighting, buzzy vibe, and greatest hits like spinach-artichoke dip and shrimp cocktail. The scene? Nailed it. The service? Spot-on. The food? Well… it’s still workshopping that.\n\nWe ordered the dip and shrimp to kick things off—familiar faces, but missing that Hillstone-level swagger. The real plot twist came with the tomahawk steak: beautifully cooked but aggressively over-salted, like it had been seasoned by someone settling a personal score.\n\nIn short: great energy, great team, but the kitchen’s still finding its rhythm. Worth a visit for the scene and the team—just temper expectations on the food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvODdIV25BRRAB",
            "text": "\"An Example of How to Get it Right from the Beginning\"\n\nMy wife and I, along with our two friends, had reservations on Saturday night at 7:30pm.  We arrived 10-15 minutes late due to the rain.  I was worried that they may give our table away or give us a hard time.....however, we were greeted by our server who apologized that the table wasn't ready and that it should be just a few more minutes.  The owner/manager (Joe) asked if he could buy us a round of drinks on the house due to the short wait (wasn't necessary, but of course I loved the simple message.....\"We are going to take care of you\").  Throughout the meal, they both checked-in to ensure we were pleased and if we needed anything.  Our server Kyle was awesome-aimed to please, very professional and always on his game.  The food was also great but I am writing a review because the service was so above and beyond.  Kudos to Joe and his staff.  They knew how to make you happy even when there wasn't an issue.  Recently, I had an experience where a manager of another hot restaurant spent a lot of time telling me how important customer service was but made me \"work\" to get something remedied.  At Nightly's, the manager and server made the experience perfect from the beginning.  Thank you."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNReWVqdDZ3RRAB",
            "text": "We celebrated a milestone birthday for our adult children here and had a WONDERFUL experience! A custom menu, fabulous food and top notch service. The attention to detail went above and beyond our expectations. Thank you, Nightly’s for an evening of memories!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbzZ5U3pnRRAB",
            "text": "Atmosphere is great the decor is fantastic stepping back in time with mixture of modern.\n\nChicken was fantastic, temperature was great , sauce was great with it. I do recommend to try it is a must. Well cooked! Soft , crunchy texture, well size portions. Do recommend 👍🏼.\n\nUp next is the 78 burger 🍔😋."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcHZuZHhnRRAB",
            "text": "We stopped in on a Saturday night around 6:30PM without a reservation and were so grateful they were able to seat us—a family of four with two young kids. The staff couldn’t have been more welcoming. Everyone was friendly, accommodating, and genuinely kind, especially with the kids.\n\nThe food was fantastic—both the salmon and steak were delicious. The salmon portion was a bit on the smaller side, but still perfectly cooked and full of flavor.\n\nJoe, the GM, went out of his way to check in on us throughout the meal. He was incredibly warm, down-to-earth, and made sure the kids were happy and taken care of. To top it all off, they surprised us with desserts, which was such a thoughtful touch.\n\nThe vibe was just right—doors open on a beautiful night, a great ambience, and perfectly made drinks. We’ll absolutely be back—great service, great food, and a really great experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRlQzbGFOemhmYlZOSVNUTnpOR1JOUVZBMExYYxAB",
            "text": "We've lived on the UES for almost 10 years now and I'm not sure why it's taken me so long to get to Nightly's but it is SUCH a fab addition to the neighborhood. I happened to go for happy hour drinks on a Friday with 2 friends and dinner with my husband the following night. The place has downtown cool vibes with the warmth and neighborhood feel that we love about local spots. The owner / manager Joe was so kind and treated us like we were regulars on our first visit. We'll definitely be back again."
        }
    ],
    "reviews_count": 74
}