{
    "name": "Osteria Nando",
    "place_id": "ChIJnxd0SbpZwokR2K_m8Ng42_g",
    "grid": "MN8",
    "address": "1589 2nd Ave, New York, NY 10028, USA",
    "rating": 4.5,
    "user_ratings_total": 349,
    "phone_number": "(212) 731-4355",
    "reviews": [
        {
            "date": "13시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cFdYWXhRekpaUzNSaFRqZFNWVGR4YVRNelgwRRAB",
            "text": "Such a great spot! Had an amazing meal here of escargot, octopus, coq au vin, and beef bourguignon. Oh, AND the best chicken Parmesan. The manager was so attentive and welcoming. The wine was also delicious. Would highly recommend!"
        },
        {
            "date": "수정일: 1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoLXRDdUZBEAE",
            "text": "Excellent food and service.!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVExWb3dWR3BFUTFONFUwNVpNRkJLWVhkdmRWRRAB",
            "text": "The reservations are a lie and it smells like urine in there.\n\nMy friends and I had a reservation for 4 people for 7pm this evening. 2 of us showed up at 7:05 to check in and told them we had a reservation. The host told us there were no tables and offered us the bar.\n\nRight as we walked in, it smelled a bit like bathroom. As we moved to sit at the bar, the smell grew stronger. We sat at the bar and were then informed that we could have a table if someone finishes. They then asked us what name the reservation was under, and looked it up...then didn't say anything. Not even an \"ah we overbooked sorry.\"\n\nWe sat at the bar smelling the stench of urine and after some evaluation, decided just to leave. 4 people sitting along a bar isn't conducive to good conversation, and the smell of bathroom isn't conducive to good eating.\n\nThis review is just for service + atmosphere. Can't speak to the food because we didn't have any."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMFJ6QktRbnBRU1RoUmNrVllRazFYZFZOaGFsRRAB",
            "text": "Had a lovely late lunch during the week. Food was delicious and service was the best. Highly recommended. Also loved the tv screens playing calming scenic views."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCd09FbGhSRVEwYURaT1RsRkVOa2d0WlhSbE1XYxAB",
            "text": "Excellent restaurant, including the  dishes and service. Great friendly atmosphere. I definitely recommend this restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNE0yeEhla3RoZW0xYU5FMUxOVFYwU3pSbk1WRRAB",
            "text": "Dark wood interior with light melodic music that captivates a good evening out without keeping you from hearing the people at your table. Chicken Greek salad was good. Side Brussels with garlic were a nice addition to fill up while keeping it calorically light."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTVZYWkpXRzlIVnpVMVRuRkxja1UwYjJ0amFuYxAB",
            "text": "Great spot for brunch!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNEwtdEd3EAE",
            "text": "I love this place. Dog friendly"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KM05FSllSemxVWlcxT1MydG9SV2d3ZVhaT1dtYxAB",
            "text": "It's a good food place, but the wait staff, managers and runners don't offer a good experience.\n\n(It's a good food place, but the wait staff, managers and runners don't offer a good experience.)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWVlpqUkRTMEZQVGtVd1ZqTnBWRlpqTkdSbVlrRRAB",
            "text": "Amazing food. TVs are annoying"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsSVJIQTFhbTF6YjJaVlZETnpVbGRwUlRCSmQwRRAB",
            "text": "Great salmon! Would be better if it came with lemon"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201R1VsaHROMHN0ZDBGMGVVWldUblEzYXpoTWFVRRAB",
            "text": "Great little gem on the upper east side!\nLarge menu with lots of fish and pasta options. We loved the sole almondine, scallops appetizer and Branzino. Dessert was also great- definitely get the chocolate soufflé. Service was also great."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCNGJEbGhkbmh5TmpGb2JuZHlVelZsTWsxRVZHYxAB",
            "text": "Everything was amazing!\nVery friendly staff, delicious food, so beautiful place"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tabVNYTkpPRnBSUjFWS1QyMUZUbkEyT1ZsSFNuYxAB",
            "text": "I am not rating food yet, because I’ve only been to the bar, so far… I ordered a martini with a twist, excellent. Later, one of the best French 75 I’ve ever had. I am biased, Rodrigo, the bartender, one of the last classic, fun, chill, best bartenders I’ve ever known in nyc!!!  I followed him here from another UES spot! Stay posted for a food review! 😁"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SSlVWRnFWRkEwUm5CdFpGUjBVVVZHTjBWWmRsRRAB",
            "text": "A little overpriced and the food is mid. I wanted to try it as a new option, but can’t say we’ll be back. The waiter was super friendly though, which helps!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMdU9qNG5mcDRMeERREAE",
            "text": "Guy finally cleaned his kitchen. Still never eating here haha.."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPbjktZkNLdXZlMVZnEAE",
            "text": "Osteria Nando is a gem of a restaurant tucked away just east of The Met in NYC. The food was excellent and interesting, fairly priced (for NYC) and served by a friendly, skilled staff. It was clearly a favorite for local residents, and we felt fortunate to have found it. I highly recommend this restaurant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNRzkwLU91ckp6alNBEAE",
            "text": "I've never had a bad Caesar salad before. I didn't know that it was even possible to make one, but they managed."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPTzB3N1hFOHBxRHJRRRAB",
            "text": "Great meal and very friendly staff."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLSzZ2ZlBRc3ZubnNRRRAB",
            "text": "Good food and great service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLU0Z0dmFDcU9hZEtREAE",
            "text": "We decided on Osteria Nando for a holiday meal and sat outside. The muscles were just not quite right. Some shells were not open, others the inside had fallen out, and the broth was a little too creamy without a lot of taste. The halibut  was fresh and tasty and the seafood risotto was good. The music outside was too loud. The environment was too busy and distracted from the dining experience. Our server was okay. Overall impression was off."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VQNjR4YWpEc09xQ1BBEAE",
            "text": "Dirty kitchen is dirty kitchen. We can go ahead and play the blame game all we want but it's not cleaning anything 😔…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VOR1d5b3ZrbC0zRWFREAE",
            "text": "Currently this restaurant has a letter C health rating from the NYC dept of health. They have repeatedly received letter C ratings in previous years. You can check this on the nyc dept of health’s website."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZZ2ZLMDV3RRAB",
            "text": "I recently dined at Osteria Nando on the east side with my wife, and we had a truly delicious meal! The food was exceptional, bursting with flavors that showcased the chef's talent. Each dish we tried was a delightful experience, making it clear why this restaurant is highly regarded.\n\nWhile the service was friendly, I did find myself giving it four stars. We had to repeat our order several times for clarification, which revealed a certain casualness that I don't typically associate with restaurants of this caliber. However, the overall atmosphere and the fantastic food more than made up for this minor hiccup.\n\nI highly recommend Osteria Nando for anyone looking for a wonderful dining experience. With its delectable cuisine and inviting ambiance, it's a place worth visiting! Five stars for the meal, and I look forward to returning!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJX2JteUhnEAE",
            "text": "It has very tasty food and a very pleasant service. Highly recommended."
        },
        {
            "date": "7달 전",
            "language": "zh",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ajlqSWJ3EAE",
            "text": "服务还不错，里面有些拥挤比较吵，信用卡多收4%。"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3OUpheGZ3EAE",
            "text": "We had an amazing experience. We ordered the beef bourguignon, the seafood risotto, and the saffron and lemon chicken, and they were simply delicious - the beef tender and flavorful, the chicken juicy and well-seasoned, and the risotto creamy and tasty. We also got French onion soups as starters and simply loved them. We look forward to our next time at Nando!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3d05DSV9BRRAB",
            "text": "Food and service 👌🏽…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBbG9UakZ3EAE",
            "text": "Really good experience and great service. The Boeuf Bourguignon is excellent !!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBeWUyMHFnRRAB",
            "text": "Food was amazing, staff was great! 10/10"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdXBuZGdnRRAB",
            "text": "Great place for dinner with excellent food and very nice ambiance.  The service was outstanding and we very much enjoyed our meal there.  Staff were polite and appreciative of the business. Highly recommended"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfbDkyYkpnEAE",
            "text": "Me encanta, la comida deliciosa"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfODZ1R2xBRRAB",
            "text": "Had a very comfortable corner table for 4.  The service, vibe, and food were all\nVery good.  Prices were reasonable for top quality drinks, service and food.  Would go back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOVpUYjh3RRAB",
            "text": "In all honesty, we booked this reservation last minute and didn’t expect much. It beat all expectations.\n\nI didn’t take great photos, but as a party of 7, 4 people had the hangar steak, 2 had the burger, and I had the Alexandria salad (beet salad with arugula and blue cheese?). Everything was incredibly well cooked and had a ton of flavor. No notes for what we ate - we thoroughly enjoyed everything.\n\nThe only thing I’d say is that the advertised cuisine is very confusing - Mediterranean, French, and Italian. We got random naan with some tzatziki - both great - as complements for the table. But, idk why they are trying to combine these different cuisines and food styles.\n\nI’d just say, pick French/Mediterranean fusion, scale the menu down to the hits, and go on from there. The menu is unnecessarily big, they don’t need all those items. Pick the top items and focus on making them incredible/something that people are missing in their life.\n\nThe chef is great and everything is cooked/tasted amazing. A smaller menu with things that are “to die for” would put this restaurant on the map."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNEtQTFpREAE",
            "text": "Such a Surprise was to discover this gem last night on Upper East Side! What could be better after visiting Metropolitan Museum of Art???- to indulge yourself in such a delicious food!!! My Beef Bourgeon was perfect!!! Shrimp & scallops as appetizer - simply amazing to wake up your receptors for main course! 5 Stars Two Tombs Up!!! Definitely will be back soon!!! Spasibo!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmMnNQSk93EAE",
            "text": "Excellent service particularly tasty food w/fantastic seafood appetizers and delicious entrees. Cozy atmosphere and friendly staff!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNHRUSWx3RRAB",
            "text": "Amazing experience!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cThMTlN3EAE",
            "text": "Amazing French food! It's easy to miss but I dream of the food here like no other bistro"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MmRDOF9nRRAB",
            "text": "Had dinner here after a movie. Party of 6, and they were very accommodating. Food was delicious and the servers were lovely. Cozy and inviting atmosphere."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MGVIYTZnRRAB",
            "text": "Will i come back? No\nWould i recomend? No\nBeautiful cozy little place but is missng for someone to lead them to  deliver an expirience throughtout the night while yet delivring an excellent great service!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2Z015MzhnRRAB",
            "text": "Cozy vibe and fantastic food. Hidden gem in the upper east side"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQeWZIZzdRRRAB",
            "text": "It is important that someone inform the MANAGER that in fact all restaurants in NYC DO NOT charge a fee for credit cards and that it is ILLEGAL to do so without stating either on the menu or in someway informing BEFORE you receive the bill that 4% will be added to your bill.  The food was mediocre.  The mussels were gritty, the fries I suspect reheated as the minute they cooled down they were like cardboard.  Brussel salad was bland and hard to chew.\nServie was either invasive or negligent..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYaHRUWEpREAE",
            "text": "Great service! The bottomless mimosas come in a cute pitcher and the food is very good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcktYOV93RRAB",
            "text": "Super cute restaurant, excellent food, and such a wide variety of options on the menu to please everyone. Will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMlBmX3FRRRAB",
            "text": "The customer service was quite bad, to say it  polite. The personnel told me the place is already closed, but the way it sounded was very unfriendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuaTdyT3p3RRAB",
            "text": "Large portions and complimentary dessert very much appreciated!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuNVlqZmN3EAE",
            "text": "Nice place for a family dinner in a quiet corner of the UES."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINXJtNnBBRRAB",
            "text": "Nice place and good food but impossible to have a conversation on a friday evening.  Acoustics were terrible."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMnB6QjBnRRAB",
            "text": "Nando Osteria- amazing experience great salads. Main was awesome short ribs with mashed potatos. The service was amazing. We had amazing service and Nando himself really made our experience really an nice old school type of hospitality that you dont see in most restaurants these days."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIOTZERFV3EAE",
            "text": "Food was delicious and service was great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMd3RiYnZ3RRAB",
            "text": "This is my second time back and it was just as amazing as the first. A super underrated spot with the best food and ambiance. Our favorite dishes were the mushroom risotto and the squid in seafood pasta. Both are absolute must tries, dense and creamy but doesn’t weigh you down. Wonderful staff that were chatty and helpful. We were even given a slice of tiramisu on the house to end our meal. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqMzVINFRREAE",
            "text": "The perfect date night spot when you want one cuisine & your partner another!\nDeliciously Flavorful food matched with Impeccably attentive service. Set a cozy ambiance that makes an enjoyably memorable experience."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbkx1eUdnEAE",
            "text": "This is good restaurant. The lobster bisque and the lobster risotto were really quite great. The linguini with chicken was also delicious but a bit dry. The service was a bit awkward though, like the table was not yet ready when we arrived…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbDRQNnZBRRAB",
            "text": "Amazing service, a great low-key ambiance, and delicious food! Osteria Nando is a delightful French gem that’s perfect to visit after a day at the museum.\n\nMy two favorite dishes of the night were:\n\nCOQ AU VIN - This braised chicken dish, served with Burgundy wine, carrots, pearl onions, and mashed potatoes, was absolutely delicious.\n\nSEAFOOD RISOTTO - The risotto was packed with shrimp, scallops, corn, Parmesan, and lobster nage. Each bite was creamy and flavorful.\n\nFor dessert, the tiramisu was my favorite, filled with Kahlua and layered with moist ladyfingers. The chocolate cake was rich and perfect for a guilty pleasure.\n\nHighly recommend dining here!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSeGN1QmJnEAE",
            "text": "Came here for bottomless brunch and was very impressed! The drinks were great and the food was so delicious. We got the eggs fra diavolo, the bagel with cream cheese, lox, and the works, and the French toast. My friends and I couldn't help but share all of our entrees-- everything was fabulous-- but my favorite was the eggs fra diavolo. The staff were also so friendly. Overall incredible experience and we'll be back for dinner next time!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadnFqZkp3EAE",
            "text": "Such a strange experience. They advertise a bottomless brunch but they don’t actually have a bottomless brunch. The manager was rude to his staff in front of us which made us feel uncomfortable. The food portions are small and the food is…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXXzV1MXFRRRAB",
            "text": "WOW! I am blown away. The food here was incredible! Service was also very good. I have no words to describe how delicious and fresh everything was. Highly recommend!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcjhIV2J3EAE",
            "text": "I really loved the place, atmosphere was amazing, music is so good there. Service was outstanding, in the end of our meal we got complementary dessert. I wasn’t crazy about the food. Pasta wasn’t good, we asked aldente, but it def wasn’t, and tasted like they just got this pasta from the corner store .We also ordered fish and it was pretty dry, and tasteless, onion soup was very salty. For this quantity of food price was very high. 15$ for tiny soup it’s too much . 15$ for salad was ok, but size of the salad was really small. Maybe next time I will try something else and will be more impressed."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5M3Fiam1nRRAB",
            "text": "Excellent new mediterranean spot on the upper east side! We got brunch this weekend and were completely blown away by the flavorful food and drinks. It took us so long to order because the entire menu sounded amazing and none of us could decide what to get!\n\nTo start they brought out some flatbread with maple butter that was to die for. We ended up ordering eggs benedict, short ribs (with scrambled eggs), and hazelnut french toast. All three dishes were stellar and we'd happily order them again if there weren't so many other things we wanted to try! We can highly recommend the mulled wine as well, it's perfect for chilly outdoor dining days. The outdoor setup is so cute too, they have hung up vines and string lights, and the heaters kept us plenty warm. I'm sure it will be just a matter of time before it's impossible to get a reservation here, but in the meantime my friends and I will definitely be regulars!\n\nOur only recommendation would be to add light dressing to the mixed greens on the side, just something like olive oil/lemon juice would  be great!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLdXRxTzRRRRAB",
            "text": "Absolutely phenomenal food and great friendly service! Outdoor accomodations are spacious and the overall vibe and decor is very authentic! Appetizers were all outstanding and good portions, and the main entrees were supreme! Definitely try…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLOG9PTTNRRRAB",
            "text": "What a wonderful place! Found it while looking to replace my \"regular\" that was shut down during the pandemic. The vibe is wonderful, great music  that makes you want to stay longer than you originally set your mind for.\nFood is good, wine too and the cocktails are great.\nAnd the prices are super fair.\nAbsolutely won my attention and I love it!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpd3BEUFB3EAE",
            "text": "Great brunch place. It's pretty new and they opened in the midst of the pandemic. The avocado eggs are delicious and also the short rib and eggs dish. The French toast was very good too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSeklEb1R3EAE",
            "text": "Had a lovely brunch here today! The Bloody Mary is really tasty, and I enjoyed the brussel sprout hash! The host Justin is so nice and welcoming, and provided great service!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpd042anRnRRAB",
            "text": "Tried this place for the first time.  Just happened to pass by and gave it a try.  Glad I did.  The brunch was really good.  I got the brussel sprouts hash. Loved it. The tables were a bit close but they had the plexiglass dividers, so felt comfortable enough.  Will definitely come here again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdWNuOWZREAE",
            "text": "I knew I had found a hidden gem, a place where I would return time and again to savor the flavors and immerse myself in the warm embrace of French Italian hospitality. They got absolutely phenomenal food, romantic ambiance, friendly services. Love the trout almondine and scallop Al peperone rosso, definitely will come back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtdEp1SG1RRRAB",
            "text": "Fantastic spot with indoor and outdoor covered seating options. Delicious food and great atmosphere. Mulled wine was good and I very much enjoyed the shrimp appetizer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWNU9qNk93EAE",
            "text": "i’m waiting to see how my nightmare is handled. There is just too much to say about all the disappointments and un edible. Fish\nbranzino that was dry, metallic tasting and tasteless in some weird tastless sauce\nafter having been disappointed with the sandwich, I ordered because there was nothing inside. It was like a tiny sloppy Joe inside but mostly bread and very salty. When I said, put the sauce on the side they do\nit was mostly sauce, no meat horrible. He convinced me to order something else cause he ran out of he said. The short ribs sandwich meat. I guess that’s why it was all sauce and shreds of minuscule meat. It’s come to the point where the quality of food in a lot of restaurants has gone down. The prices have gone up and it’s not worth eating out anymore. most places I get better fish and citerella, I know it’s fresh. It taste delicious just plain. The texture is soft, flaky, wonderful fresh fish. It took him an hour to have this brought over from a few blocks away when fish takes only about five minutes to cook. I knew it was frozen as I grew up in sheep,sheaf bay and always got fish from the docks there since I was knee-high to a grasshopper. I know fresh fish. At compromises 90% of my protein as I’m not supposed to have meat./\nOnly go to places that are consistent and good and know there’s some quality to the food and how it’s prepared. It’s a shame Ruined my dinner. I had the dessert which was excellent the tiramisu. I’m sure that’s brought in from outside but it is very good better than a lot of places. It it\nSo there I was with dessert for dinner. I have more to say, but I’m stopping now to see if I ever get a receipt that shows the amount I paid on my credit card I got A copy of what I ordered instead of a credit card receipt that shows what I paid was charged and the tip. I never got receipts like that from restaurants I got normal credit card receipts there was no amount nothing I asked for one receipt and then I asked for a credit, and I got neither, no more business here from me. It’s a quaint, charming place but we want good food when we’re paying for it. I can eat better at home. My cooking is good!. It’s just times I don’t feel like cooking. Not that broiling or sautéing a piece of fish, is cooking and steaming a vegetable . But I have health issues and I’m tired often. Wish I could’ve done more business with this place but I have to be able to eat the food and not be ripped off with it empty almost that looks like sloppy Joe from Subway decades ago! When I had this sandwich a few times before it was edible not a lot of meat but it was OK , I don’t know what the hell he did and if it’s true, he probably ran out of product and gave me nothing inside virtually. I said no sauce it was all sauce 75%. I would’ve liked to write up a nice write up. I hate writing negative things about places, but he he pushed me to order again , I couldn’t eat the fish that as I stated. I hope they get their act together. hopefully there are other dishes that are better there. But I’m not willing to try anymore. This left a very bad taste in my mouth. double entendre\nI wish them well like I said, I hope they get it together."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpcnVtdGN3EAE",
            "text": "I have lived in the upper east side for 4 years and this the best neighborhood/ non pretentious restaurant I have been too. The staff is really friendly and the inside dinning is really cute! Great mediterranean and french dishes!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGcTRUUTRBRRAB",
            "text": "Great experience. Delicious food and drinks. I celebrated my birthday, and they gave us a few drinks and dessert at the house. Service was fast and efficient. The quantities were decent, and the food was delicious. We would go back to try other items on the menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSOXNhMEFnEAE",
            "text": "Such an amazing spot. Waiters were so attentive. I ordered the endive salad to start. Easily in the top 5 salads in the city. Main meal was the lamb chop. Cooked absolutely beautifully, and very fairly priced for a lamb dish in the city. Will be back here for sure!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyOUtYYjR3RRAB",
            "text": "A great brunch spot that is cozy with friendly service. We ordered a mushroom vegan bowl ($6 for extra 2 eggs) and the short ribs. Everything was tasty. The vegan bowl is rather filling so you won't leave hungry."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKOUlmMVp3EAE",
            "text": "Omg everything was just tasty and well plated. We had a variety of dishes and no disappointment. Great service always with a smile"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0b3B2NFpREAE",
            "text": "Very Busy on Saturday Night. Despite the crowd we had a pleasant greeting by the manager/owner(?) and timely service by our waiter. The food was filling and tasty, and the drinks were small, But Strong!  If you're looking for a busy  atmosphere, this will work well for you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5eWFENVB3EAE",
            "text": "The onion soup was great and well-seasoned. Beef bourguignon was delicious and a must-try in here. Didn't like the complementary tiramisu but it was nice for them to bring it as a nice gesture."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNHFQWGVnEAE",
            "text": "Don't know if the smell is humidity or urine. But it reeks. Food was very unpleasant, chicken was supposed to be grilled but for some reason it was super greasy when served, looked old, burnt and rubbery. Order came out wrong. Service was mediocre. Wouldn't come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaaHRMelpBEAE",
            "text": "Everything about this place was amazing. The food was perfect in every way imaginable. Everyone here was very nice and helpful with everything!! Will definitely be back!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREazRhcVNnEAE",
            "text": "Excellent and friendly service! Came for desert and it was delicious! They gave us tiramisu on the house. Ambient lighting and a good spot for catching up with a friend or a date."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDd3ZQRUt3EAE",
            "text": "I’ve been looking for a good brunch place in the area and i finally found it! The food was SO good especially the French toast (picture). Service was great and fast. The dinner food also looks amazing - we will definitely be regulars here!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHeEtqZjd3RRAB",
            "text": "I love this spot. Been back 5 times. The Beef Bourguinon, Pulpo a la Plancha (octopus), and French chicken curry are excellent! It has great gluten free options as well which are not common for some of the French inspired dishes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSN0kyclB3EAE",
            "text": "I wanted to try something a bit different, so French seems right. The food was amazing (Coq au Vin and Onglet a L'Echalote) and more than enough.\nThe by the glass wine selection is a bit limited which was fine."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSem9iZ0lBEAE",
            "text": "Had a great time. Just came in for a drink.  All the staff were so nice especially Justin . I live in the area and never knew about this place . I will definitely be back ! Thank you for the great service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidnFiNkxREAE",
            "text": "I was a bit concerned about having French, Italian, and Mediterranean on the same menu, but all the food was quite good and the selection made all my kids happy. Great service and a nice atmosphere that bridges the gap between casual and upscale. Reasonably priced for what you get. Glad we found this place."
        }
    ],
    "reviews_count": 82
}