{
    "name": "Hoexter's",
    "place_id": "ChIJJWByn_BZwokR9IC-3PtPPuk",
    "grid": "MN8",
    "address": "174 E 82nd St, New York, NY 10028, USA",
    "rating": 4.4,
    "user_ratings_total": 174,
    "phone_number": "(212) 288-1777",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CblRuRjFkV1I2UTJOMlZHdG1ZM0owT1d0NU1HYxAB",
            "text": "This restaurant stands out among others in its vacinity through its wonderful and respectful staff & the food. Easily some of the best cooked dishes I’ve had. The drinks were fantastic, and the waitress even let us know the wait time for food so we could sub in an appetizer!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sVk0wWmljbEpsVmxjMk9ETlpOVzB0ZVZVM1pVRRAB",
            "text": "Although the food was good and our waiter was wonderful, when a huge cockroach jumped off the tray and ran around the table and my lap, the meal should have been free!!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTU9GVkhNV2w2WkhCM1VTMXFVM2RaU1VSS1dtYxAB",
            "text": "My new favorite spot. Fantastic food and fantastic service! A true UES gem."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psdE9GSkVYMXB3WmtaMGJEUmtXVGR3YkZoM05FRRAB",
            "text": "Really cozy spot with good food. Definitely a bit overpriced as the steak frites are a shocking $78. The areas that are quiet are way too dark, the areas that are bright are way too loud. We ending up having to sit outside. Great, attentive waiters."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TVpUSlFjbVJrTTA5V1RYazJTMGwyV2xwa1NrRRAB",
            "text": "Vibes and food were awesome. Had the burger and garlic bread. Liz was a great server who knew about the menu, was very attentive, and made us laugh multiple times. Thank you Liz!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwbE9IbFVja2h5T1ZWSVgxOTZRaTFKZVZCUmMyYxAB",
            "text": "Fantastic. I've attended three times. I am in the food business, and noticing details like bread quality and butter temperature, attention to detail with flavor and combinations... it's a winner."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5bllVdE1ZV1JUTm10T2MwcE1SMUJNZWs5dWMxRRAB",
            "text": "4 of us met for dinner at 7 on a Friday night. The staff were wonderful, the service was great, the food was above average, really delicious. The noise level was unbearable. We switched tables early in the meal to what we thought would be a quieter spot, but absolutely couldn’t hear each other speak. My Apple watch told me that the decibel level was so high it would lead to temporary hearing loss. Go early for a fantastic meal - avoid peak dinner hours."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKMU0wdGlZM0ZTUW5oRFdHbEVZVTR0YzFGNlFrRRAB",
            "text": "Wow. Great place. Good food. Sat at the bar. Best onion soup ever. Burger was on point. Great team who take their jobs seriously. Will be back. Went to the restroom not sure on the tartan. 🤣"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xcFpuVkJjMUZIYzI1Wk1HaDFRV1ZhVVY5NmVIYxAB",
            "text": "Always a great time! Def make this a stop if you’re in the city 🍸"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVNU1sOWxVemRRTTFWVE5GZERSWFZEYm5sNU0xRRAB",
            "text": "Food and service were excellent!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMGRVNXRha0pCVW5rM09VUm1jWE5GWldsU1VHYxAB",
            "text": "We had a great experience tonight! My wife and I celebrated a special occasion and the staff helped us celebrate with a free dessert. The food, as always was great, and our server was wonderful!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOaVFuTlJSekl4TlRCWWJrVm5PRXhFZVRaVmNtYxAB",
            "text": "Good food.\nWe went on saturday and they dont have lunch option but the brunch option was good. The air condicioner was too cold . Very unconfortable"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SR2VtUndOemsyV0djelVscGhhR1Z5TTFVMGJYYxAB",
            "text": "Get the burger, fries and ranch! Amazing atmosphere and food!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWMlFtaFllVXROVkVodFpqTmZibXBRU1RVMWQxRRAB",
            "text": "Fantastic. We didn’t mess around. Split burger and limited availability cheesesteak.\n\nBoth delicious. The latter was phenomenal!\n\nCool place, with a fun vibe, too."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCQlMyRnRkelJNTVhSUWVXZHhXalpKUVRocFgzYxAB",
            "text": "A neighborhood favorite"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taaU5YUXpNUzF1VlRsalEwZHZZbEJ2Ulc1dVEyYxAB",
            "text": "Went for brunch. Not worth the price tag. Food was fine. Drinks were strong. You can get better for the same price. Servings were pretty small. Service was not great—totally trying to rush you out the door as fast as possible by taking non-empty plates and drinks/setting down check as you’re ordering another round of drinks in an empty restaurant."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZNVMwZFBhRjlqTmxCS01VbHhkREYwVG05MmJuYxAB",
            "text": "This place is at once elegant yet casual, and the staff is clearly made up of service professionals (not actors working a side-gig). The food is fresh and delicious, with no unnecessary gimmicks. Great drinks too! And the decor is warm yet very different—literally every room is different! Super fun. Hoexter’s is a new regular spot for us."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5bFdIWnlOWFJoT1RkWVR6aE1Uak5RZUV4MFpGRRAB",
            "text": "Pedí las costillas y estaban deliciosas; el pan de elote con mantequilla combinado con la salsa de las costillas es lo más rico del mundo!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPLVQ4cHVUNGRMY1JBEAE",
            "text": "Overall, Hoexters was a nice experience. Vibes were fun, service was great, and food was pretty good. The highlight of what we ordered was without a doubt the burger. The artichoke was notable as well. Definitely a spot worth checking out!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUlRsRnRjVUp2UzNCVFUzTmxlVVJRZDBScGMxRRAB",
            "text": "Upon reception, they were quite rude. Great food and phenomenal waitress though. Hostess should learn some hospitality."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJZmFyTW5wbm9IUUt3EAE",
            "text": "This is the place that the Upper East Side has needed for so long (and of course HAD once before).  Great food and drink.  Love the chicken parm."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKZWh2T2lYbFBhd25RRRAB",
            "text": "The food was amazing! We had the burger and chicken parm, as well as a burrata salad which was a special. I do have to say the service was overly annoying. I understand that they were trying to be attentive but they kept coming every 5 minutes asking if they could take away my boyfriend’s plate. We had 5 different waitresses coming for different things and asking if they could take away our plates when we were clearly still finishing up. That was a bit off to me, otherwise the food was pricey but great!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMYTN2ZTJqaDlxbEpREAE",
            "text": "Got the burger and the bar special (which tonight was a chicken parm sandwich with a DELICIOUS salad). Food was great, bartender was awesome (we sat the bar), and design is beautiful and cozy. Loved loved loved the playlist. It's unexpected for the decor, and creates such a great vibe. Can't wait to go again!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJdW44cDdFM3AybXdRRRAB",
            "text": "have something to celebrate? parents in town? date night? Hoexter's is a must visit for dinner on the upper east side! i particularly loved the burger & want to come back to try all the other items on the menu."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKQzBodDNMX0tiV2F3EAE",
            "text": "Great food and great atmosphere! Bit pricey but not far out of line for the area. Recommend trying to sit in the back as the narrow restaurant means that there is a lot of foot traffic in the front and middle."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKcTFfYTc4OWR6RU93EAE",
            "text": "The food here is hands down excellent. The Gorgonzola bread (surprisingly delicious), cheeseburger and Branzino were excellent. I don’t see that they have the calamari dish anymore but that was also amazing. Great cocktails and nice to have another fantastic restaurant on the UES. I personally don’t like sweets but their desserts here were a crowd favorite. Would go back"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMGJhZkN3EAE",
            "text": "I’m still in the restaurant as I write this. 10/10. The burger, the ribs, fries(order extra crispy), cornbread, Gorgonzola bread, beer(IPA), and the service is all top notch. I don’t live here but I will be back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN1l1MDNRRRAB",
            "text": "Delicious food, amazing service, great atmosphere. Loved the dutch baby + french onion soup!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbGZDMDl3RRAB",
            "text": "Great local spot with a downtown vibe! We got to gorgonzola bread (8/10), tuna crudo (9/10), the burger (9/10), steak sandwich (8/10) and the lemon tart (10/10). Will definitely be back to try more!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNGFxenhRRRAB",
            "text": "5 stars! Food was amazing, service was amazing, and vibes were great. Cocktails strong. Great date night spot."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNDh1YXhnRRAB",
            "text": "While your brain may glitch out trying to sound out the name, your tastebuds will thank you.  Tweaking comfort classics is a fairly binary exercise - the outcome is either amazing or meh.  Here the results are mostly amazing.  Great service and ambiance round out an experience that's highly likely to hit the mark."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvd2VDMF9RRRAB",
            "text": "Brunch was delish, staff were attentive although it was busy and the atmosphere is inviting. Who could ask for more?"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOTZ2cHhnRRAB",
            "text": "Spectacular food. Accommodating kitchen and attentive staff. Branzino was perfect."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNHRXOGJnEAE",
            "text": "Slightly fancy pub food. Great drinks! Bar area looked fun."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeUxEbGRnEAE",
            "text": "Great food. Great service. The restaurant is beautiful- walk to the end and back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJb2J2NW1nRRAB",
            "text": "Cozy and upscale atmosphere, great for a night out or celebratory dinner. Good martinis :)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3c0xiRGhBRRAB",
            "text": "Nothing short of the best burger I've had in a long time. Gives Minetta Tavern a run for its money. Outstanding service and hospitality."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3c0xhT29BRRAB",
            "text": "Great experience from beginning to end. We ordered the Gorgonzola garlic bread which was a perfect temperature - the sauce was bubbling in the pan. We also tried the tuna crudo, which complemented the garlic bread surprisingly well since it was lighter and paired nicely with onion and capers. For our entrees, we enjoyed the smashburger and the branzino. The branzino was delicious, although watch out for some small bones. We finished with a fantastic sundae for dessert. I would recommend ordering the Father Hugo drink (tequila based), which had a unique fruit flavor."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNTgyRk9BEAE",
            "text": "There were six of us for brunch—we changed the number at the last minute and they were able to accommodate us at a crowded time. The food and service were both above average.  I really enjoyed my BLT salad. The ambiance is cosy and lively. We’ll definitely go back."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2eDdDOVZBEAE",
            "text": "Was there for brunch. They were able to seat us as walk-ins, but it quickly became packed. Loud. Food offerings were solid, but only the mortadella egg sandwich was memorable. Limited menu. Might return for dinner."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfME8tSnNBRRAB",
            "text": "Great dinner, loved the garlic bread and the duck entree. Winter salad was just fine. Chocolate cake dessert was solid"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdVl5ZDVnRRAB",
            "text": "Restaurant cancelled my reservation an hour before for no reason. It took 6 tries via phone to get through to the restaurant. Explained that I confirmed my reservation via open table (which now I can't see messages because the correspondence goes away after a reservation has been cancelled) and asked why. Hostess insisted I cancelled my reservation the day it was made. How could I do that if they sent me a message asking for confirmation today? They sent a cancellation email at 1727. No text from Open Table. Saw the email at 1756. Got through to the phone at 1813. I asked for my reservation for 7pm back to which they said they filled it already and can't accommodate until much later. Hostess was rude (not the first time I've experienced this with this restaurant during a previous walk in attempt)."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdWFERnp3RRAB",
            "text": "Amazing burger"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneTVqS1RBEAE",
            "text": "Went here for dinner on a Saturday night. They were able to accommodate us in the bar area, but it was very crowded. The food was enjoyable, but did not stand out against many other options in the area. Prices were high, and the vibe appeared to consist of those looking to fit in with the \"west of Lexington\" crowd. The interior design of the space was well done."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnZzdhLUtnEAE",
            "text": "The atmosphere is fantastic, the service is excellent, and the smash burger is truly the best in the city! I'm surprised to see negative reviews, as this place is absolutely amazing. It's unfortunate that some individuals seem to focus on nitpicking rather than appreciating the experience."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnekl6SjN3RRAB",
            "text": "Great place for brunch. The eggs hash and bacon were very solid. The Dutch baby was phenomenal! And the milk and cookies at the end were a perfect way to end the meal. Highly recommend"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMXJYczlnRRAB",
            "text": "Friday is the most welcoming & graceful maitre D we have ever encountered . She’s such a joy to experience when we come to Hoexters! The food and ambiance is top tier , but Friday was the cherry on top! we’ll be back!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBdGZiak5REAE",
            "text": "Overall, a very disappointing brunch experience. We had heard good things about this place online and were excited when it opened. The hosts were very confused about our reservation and couldn’t keep track of if we were two or three people for brunch, even though we made a reservation for just the 2 of us. A minute after we were seated a very nice bus boy asked us if we wanted water and what kind. but never came back to fill our glasses. A waitress came by and asked us if we wanted anything to drink, but still no water. After 20min we finally got our drinks and water after a third time being asked. I asked for sugar for the iced tea, but that never came, so I asked the table next to ours for theirs. They were not enjoying their meal either. Our food finally came and it was cold. I ordered eggs and they were unseasoned (fine), but had to flag a waitress for 5min before I could get salt and pepper for them.\n\nTo conclude, ambiance was nice, food was bland, and the restaurant must be understaffed because everyone seemed frazzled at all times. It was not the peaceful fun atmosphere we were hoping for."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfelotLWJnEAE",
            "text": "Amazing food and ambiance. So warm, cozy and excellent service"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfa08tQ0NBEAE",
            "text": "Fantastic food here especially across the garlic bread, burger and the veal chop. I was stuffed but felt like I ate like a king. Space can be a bit cramped in the back dining room but it can also be cosy. Hope to come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuM01EOHZnRRAB",
            "text": "Absolutely delicious! The burger is a top-ten in the city in my book and the mountain of fries were crisp and tasty. My martini was on point with massively stuffed blue cheese olives. But the highlight of the night was that Gorgonzola bread! All-in-all this was a great dining experience and thank you to Olivia for the exceptional service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3MEpqcUN3EAE",
            "text": "Great place for dinner and cocktails! Fun date night ambiance. Food highlights were the steak frites and the ice cream sundae. The chicken wasn’t anything super special but it was cooked well and tasty nonetheless. Service was very attentive."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWeTd1ZGNnEAE",
            "text": "Update 8/17/24\nWelp they are all about turning a table now. I've waited longer at Chipotle to get served my main meal. They had us in and out in 45 minutes. They forgot our appetizer entirely. We had to reminder the waitress and our actual meal came while she was checking. Again this was 15 minutes into the meal.\n\n-------\n\nService was fantastic as this place just reopened (after a few decades hiatus). Food was definitely fired as we worked through our meal and it was spaced out appropriately. Garlic bread is over the top good and not as heavy as you'd think. We went more traditional with French onion soup and the roast chicken but tons of tables had the smashed burger. 10/10 will repeat"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxLWJIaFFREAE",
            "text": "Highly recommend the french onion soup and the sundae. Garlic bread was bit too soggy for our liking although that is how it is supposed to be according to the waitress. Burger was also good but not anything too special. Sundae is a 10/10!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqcmRuMXJnRRAB",
            "text": "This place is a little small, but the French onion soup was really good as well as the Gorgonzola bread. I would highly recommend. The only thing I didn’t like was how small the space was and we were really squeezed in. But I still loved the vibe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYLXVtRGZ3EAE",
            "text": "My husband and I came to Hoexter's the day before our wedding for a yummy burger and we were NOT disappointed. Truly one of the yummiest burgers I've ever had. We ordered bread as an app but the burgers came out about 1 minute after so didn't really get a chance to enjoy it as much as I'd like. The bench seats at the very front in front of the window are kinda thin so just be mindful of that.\n\nAll in all the drinks were fabulous as was the staff! We're eager to comeback to try the rest of the menu!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyOE96c3BRRRAB",
            "text": "Hoexter's, one of the Upper East Side's newer dining enclaves, was a feast for both the eyes and the stomach.\nFrom the 'Hollywood glam' aesthetic and ambience to the solid people watching (and couple critiquing) - straight to the fantastic plates and (overpriced) cocktails - I will definitely be adding this darling to my roster.\n\nWhat we ordered:\n*Grandma Terry* Idk who \"Grandma Terry\" was, but they named this cocktail after her: Caviar and herb-infused vodka, dry vermouth, caviar bump cracker.\nFor $34, the caviar tasted too fishy/cheap, and the drink, itself, could have been a bit more briny.\n\n*French Onion Soup* DYNAMITE\n\n*Pork Milanese* Holy tenderness! I just auto-assumed that the 'chop would be more tough and toothsome, but the pork was juicy enough to be cut with a fork. My only critique? The seeds left in the lemon wedge."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2NUl6MGVBEAE",
            "text": "Cute decor, prompt and friendly service. The only snag was when the waiter answered 'no I don't know anything about the teas' and just waited for me to choose one. Portions are solid, the burger was tasty. Tad salty, reminiscent of McDonald's Big Mac and fries."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkcWFLdERnEAE",
            "text": "Fun place! This visit we were at the bar only and did not order food. My friend the caviar martini and I had two different cocktails. I think I had a sister Rachael, and aunt Joanie, both excellent!\nI think it’s perfect for winter because it’s dark decor, and basement level. I do plan to go back and try their food."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5anVPZDRRRRAB",
            "text": "Good experience but not positive if it’s worth the hype. The burger was good and the garlic bread was inventive and delicious. The cocktails were a highlight. Unfortunately, the tuna crudo was not fresh and the dish was very small.\n\nEditing to add my second experience here was good. The service is attentive and the vibe is perfect for a late dinner date somewhere dark and lively. We noticed the music was a bit inconsistent, sometimes not fitting the overall environment. Also thought it was strange my boyfriend’s burger came with a lot less fries than mine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNucmZHQ2l3RRAB",
            "text": "Hoexter’s\nEst. 2023\n\nLayout/atmosphere\n*Brasserie; bar area, few tables in front; dining room past the maitre’d stand; wildlife murals on the walls; tables on sidewalk\n\nService\n*Servers in same dark blue uniform blazer; attentive\n\nFood/drink\n*The Martinez (Gin, antica torino vermouth rosso, Orange bitters, lemon twist) - solid taste; vermouth stands out; not overpowering citrus\n*Sourdough Bread (salted Vermont Creamery butter) - enjoyed throughly; quality product; good crunch on the bread; salted butter nice touch\n*Roasted Half Chicken (pearled couscous, roasted summer squash, jimmy nardello peppers, cherry tomatoes, herbs) - chicken juicy/crispy skin; couscous delicious; vegetables pop with flavor\n*Chocolate Chip Cookies (vanilla ice cream) - mini cookies, warm, soft but but of crisp on edge; ice cream solid"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWbmV1Y093EAE",
            "text": "Amazing addition to the neighborhood! The food and drinks were spectacular but the host Lucy and our server Faith made the night exceptional! Do yourself a favor and try and snag one of the coveted tables here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6bEtldUtnEAE",
            "text": "Great place the burger is awesome. Must get the garlic bread in cheese sauce it’s an absolute must. The service was terrific and everything about it was top notch"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfclBPMldnEAE",
            "text": "Going to round up from 4.5. Nice looking place, good crowd too when we went for a Saturday brunch. But also got a reservation that morning so not so tough as some other brunch places to actually get a table.\n\nService was very professional and polite. The food was really good, just not quite as good as I had hoped.\n\nThe mortadella sandwich was a 4 and could have been a 5 if they fried it a bit more for some crunch and left the jam out (doesn't need that sweetness). Make it just like Bourdain did :) Home fries were solid but served room temp. The Dutch Baby was a 5, exactly what you would be craving for.\n\nAlso got a side of salmon and sourdough toast -- generous serving and very tasty.\n\nNot among the top 10 brunch spots in NYC (yet) but I doubt anyone would come away from Hoexter's unhappy with their meal and experience."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbWF5VUZnEAE",
            "text": "oguish American food shop with an upscale ambiance and serving environment that make for a good dinner spot if looking to be a bit more formal/celebrate the occasion albeit with a bit of a small portioned entree selection. The famous garlic bread however is worth the app and they have a real solid burger. $30 a dish. 3.75/5 stars as a dinner spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsczdDSWx3RRAB",
            "text": "I went to the opening night of Hoexter’s on 11/25/23. I was very impressed with the experience, especially given that this was the restaurant’s first true dining service. We were immediately seated in a nice table in the corner. The mood was pleasant and welcoming. Our server was very nice and attentive. The cocktails were refreshing and welcoming. The garlic bread was phenomenal and unexpected. It is a must try. My family and I had a mix of entrees including pork Milanese, the NY strip, the calamari and the gem salad. All were delicious. The Milanese melted in my mouth. My wife’s steak was cooked to perfection. To be honest, I could not get enough of the Brussels sprouts and mashed potatoes. I would highly recommend the restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiOGFXX3Z3RRAB",
            "text": "Solid food with great service in a tight space. Hence, the lack of availability on OpenTable.  Although when you select bar seating they do have about 4 tables around the bar that are included. Didn’t feel like a cocktail, though each one made looked absolutely amazing. Pricing is extremely steep on a few dishes but well worth on most others."
        }
    ],
    "reviews_count": 67
}