{
    "name": "Botte UES",
    "place_id": "ChIJI43xgLlYwokR9H-LXHs36gc",
    "grid": "MN8",
    "address": "1606 1st Ave, New York, NY 10028, USA",
    "rating": 4.4,
    "user_ratings_total": 323,
    "phone_number": "(212) 207-0052",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5RVRtbDJkWFEzYzNKalNHYzBURlIwY3pWbVRrRRAB",
            "text": "Great food, atmosphere"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWmREWnlRbGhDZVU5aU5rbEZjV2szU1VWWVduYxAB",
            "text": "Bautizamos a nuestra nieta Lucia y mi Yerno escogio este lugar, su comoda esta bien y ambiente bueno, sus personal rapido y atento en todo momento!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxV05qSm5NSHBMTFVkek5XTlVPRXRJWW1GaGRrRRAB",
            "text": "We love this place. We come for happy hour all the time and occasionally branch out for the chicken parm with vodka sauce. The salads are tasty and the staff are so friendly, this is our neighborhood spot! We even got our engagement photos taken here!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRWVGSkhTRGhNUmtsR1oxSk5hM2syTWtreFEyYxAB",
            "text": "Food was fine enough, but we had a reservation and they sat us in this strange annex in the back with zero ambience or airflow. It looked like an overflow room. The next group that was brought to the back was immediately offered seats in…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taMk9VMDVVSEJsY0RSaVdGQmZjR1l3TjJrMU0zYxAB",
            "text": "Rude manager and bland food for what they charge"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtem9Uc01BEAE",
            "text": "This is a really great local Italian place – not as fancy as Felice across the street, but the food is excellent and the atmosphere is fantastic. They have a wide selection of cocktails and wine, and the chicken parmigiana is a must-try... especially if you sub for vodka sauce!\n\nThe area up front is a really great spot for a date, but they also have a back area that's perfect if you're bringing the little ones with."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SeVNVeEJORFoyWVhveVJrazVVbVZNZUVKclRXYxAB",
            "text": "solid neighborhood italian eatery, would definitely recommend and return."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25STFUwTlVNMDlWVFhGNU9EQTVkRFJqYVhoRVVVRRAB",
            "text": "This place knows hospitality! Great portions, friendly staff, and often give you a free shot at the end. Love this neighborhood gem ❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKT1JWRmZWR3BoZUVGeVNUbDRXVWxhTlhKVVJGRRAB",
            "text": "Undercooked noodles ruined the entire spaghetti alle vongole dish. Sauce was too thick as well. The arugula salad with pears was terrible. Why were the pear slices maple syrup infused? It just tasted weird. I would have mentioned the undercooked noodles if the server asked how everything was going, to which he never did. It wasn’t even busy, why not give good service? Music was way too loud in the restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONVZtRnFaakpHYkhWclUyVTRYMnBzTjFOaGIyYxAB",
            "text": "Food is great. Servers are better. I have yet to arrive without one of the hosts being a little rude though. Slay"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KYWR5MVdXbXhIUm1KdWFVRXlZMVZLZUhVeVRIYxAB",
            "text": "I have ordered Botte delivery a few times and the food is generally decent for takeout/delivery. This review is based on an order placed whereby they sent the wrong item. I called and they sent the correct item. This all took well over an hour. however the new correct item was made in haste and missing ingredients. I had the service I ordered through contact Botte for a refund or credit which was denied."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zMVJtdDBaRFl6TVVwME1YaENWek56VkdKbVVHYxAB",
            "text": "The clams and pasta, mmm."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWeFlraFpTUzFsTkc5TmRWWk9ha1ZGTUhwWE0wRRAB",
            "text": "Had an amazing time at this restaurant, server was great Leon gave great customer service. Amazing staff definitely recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkTGNXcGhRbVl5WkdGbWJtTXhTRlZKYzJKMWJWRRAB",
            "text": "Great food, friendly service. Good value too. Good choice of vines."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xodGRrZzNNVm90TmxGWk9HMXROMmxxZEdOUmNHYxAB",
            "text": "Such a great restaurant with outstanding service.  Thanks Luis for making our experience wonderful."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4bWVsTnVVblp3WmtkS1FWaHJaR2d5WkhwS1ZWRRAB",
            "text": "Ashley was phenomenal! She recommended both the Take the Ferry cocktail and the avocado kale salad with salmon—both were absolutely perfect. Even with the bar packed, she never missed a beat and made us feel like a priority the entire time. Her attention, energy, and spot-on suggestions made the experience unforgettable. Total pro! I will be back for sure."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VLX2h2TFdxZ2J6SWxnRRAB",
            "text": "Had the rigatoni ala vodka and it was not that good at all. No flavor but I give it 2 3 stars because our waiter and service was amazing and nice.\nNeed to switch up the sauce and portion size and or chef"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJTEEyZjZVdzVMZVBnEAE",
            "text": "Lovely people"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VMS0txUHlONHNYWFVBEAE",
            "text": "Had high hopes for the food from word of mouth but might be one of the worst, blandest Italian restaurants I've tried. I ordered the fettuccine alla bolognese with chicken and the pasta tasted like water, I had to season the dish myself. The parmesan was better than the pasta. But bread was good though haha"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOalZvdV9QbXFPejd3RRAB",
            "text": "This restraint is exquisite. Food is made exactly how you want it, and tastes exceptional! Staff is amazing and the drinks are on point! Been here a number of times, and can say it’s consistently great!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdGJ5OXpRRRAB",
            "text": "The manager and servers are so sweet! Came in for HH which is amazing here, and they were the best!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbmNuT1Z3EAE",
            "text": "The food was delicious, but the service is what really made the night. Ashley was amazing—super attentive, thoughtful, and genuinely kind. She made everything feel easy and welcoming, like we were in good hands from the start. The beef carpaccio was a standout—light, flavorful, and beautifully plated. And the carbonara? Rich, perfectly balanced, and easily one of the best I’ve had. The manager Jacobo kept things running smoothly in the background, adding to the relaxed, seamless vibe. Definitely coming back—and recommending it to friends.10/10 immaculate vibes"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJek9ER3F3RRAB",
            "text": "Excellent service and phenomenal food. Really enjoyed our branzino, chicken palm and our salad. Drinks were nice and strong too. 5 🌟"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NFBMYlVnEAE",
            "text": "Vodka sauce pizza was delicious"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRallXY2xnRRAB",
            "text": "Really good place for food and good vibes"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnc3YtenpBRRAB",
            "text": "You can tell they put great care into their food. Everything was fantastic and the staff are very kind and willing to please. A wonderful Sunday lunch!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnemJLbHNRRRAB",
            "text": "They have an excellent happy hour with strong, tasty drinks. The waitress was not very friendly but she was efficient."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNna1pDbE1BEAE",
            "text": "Ashley was our server and was on top of everything. The food from apps to entrees to desserts were all unbelievable. Highly recommend the supplí to start, any of their pastas or chicken dishes, and cocktails are great. Cannot recommend Botte enough, especially this location"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN0puc1RBEAE",
            "text": "Great food and great service!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNkpQT3FBRRAB",
            "text": "The menu posted online was not accurate.   Went for the Cioppino but they were no longer offering it.  They rushed us to eat and paayy aathe bill for no apparent reason.  We didn't see anybody waiting for tables.  Salmon was severely undercooked.  Did not offer an apology.  Not going back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBeDZYaS1BRRAB",
            "text": "Elegant, but laid-back lil place. Excellent Happy Hour offerings & great atmosphere - feels like being among friends. Highly, highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMUwtenZ3RRAB",
            "text": "We had lunch at this Italian restaurant, and it was a delightful experience. The food was genuinely delicious.\nWhat made it even better was the fair pricing—great quality at a reasonable cost. It’s not always easy to find places where you eat this well without overspending.\nIf you’re looking for a true Italian meal that won’t break the bank, this is definitely the place to go. Highly recommended!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfOGV5ZnJ3RRAB",
            "text": "Juan is great. Good vibes. Surprisingly affordable as well"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfM0s3UV9nRRAB",
            "text": "Love this joint. Great happy hour."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaElPWnVBRRAB",
            "text": "highly recommend you try this restaurant. Whether your looking for the next perfect date spot or with the family, Botte definitely delivers. Pizza was pretty good but the appetizer and entrees were the star of the show!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdGZMTWR3EAE",
            "text": "4 stars in person. But have picked up twice now. Pizza was under cooked, Cacio e Pepe was bland and seemed like a smaller serving than in the restaurant."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmem91R2Z3EAE",
            "text": "One of my fave neighborhood spots.\nDelicious food (the bread and tomato spread is always a great start).\nExcellent craft cocktails, extensive wine choices and friendly servers and bartenders.\nI love the eggplant Parm and the chicken Milanese (which you can have grilled or fried)."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmMm92alN3EAE",
            "text": "We had a wonderful dinner her on Xmas eve. The food was great and the staff very attentive. The manager is also very attentive and does a terrific job taking care of his patrons. We’ve been to Botte many times and always enjoy it."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMjcyaE5BEAE",
            "text": "the manager (I assume it was the manager) was nice and seated us right away when it was busy (always appreciated). The food was tasty!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmeEw2SmRREAE",
            "text": "Awesome staff Awesome food"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dDlHT1p3EAE",
            "text": "The food was good and I thought the price point was fair. It is a cute little spot and waiters are kind. The drinks are expensive, but that is to be expected in NYC.\n\nMy real gripe with the restaurant is that we made a reservation for a specific time, showed up exactly at that time and then they made us wait over 30 minutes for the table to be ready (upon arrival, they said the table was almost ready which was not true). This was a bit upsetting giving it’s Christmas Eve. What is the point of a reservation if I must wait over half an hour for my table to become available? No accommodation was offered for this inconvenience and the manager didn’t really check in on if we had a positive experience despite the fact that we waited so long for our table to be ready which I found a bit odd. New York City and especially the UES has an endless amount of restaurants to pick from, so I do expect higher quality of service when I choose your establishment for my Christmas Eve dinner given the mountains of options available. The food was good, but I just don’t think I would recommend or want to be back for the latter reasons."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ODRiRWd3RRAB",
            "text": "The service and the atmosphere was good. The pizza was okay. Compared to diavola pizzas, I tried in other italian restaurants. I think it was 3 starts out of 5."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcHNtN2FBEAE",
            "text": "Greatest food. Service is dope at all levels. From the start to the end. My recommendations🤌"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcGJxU2FREAE",
            "text": "Pasta looked overdone yet was undercooked🤯, bolognese is not really bolognese sauce (more like poured out of a bottle) not worth it, not disgusting but it just tasted microwaved. Everything else is fine, maybe for a glass of wine at the bar only. Cute place though."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMa00zRzRnRRAB",
            "text": "Swordfish special was great with the citrus notes. Chicken parm was huge and lovely and they even subbed the side of penne vodka instead of pomodoro. best of both worlds and will be back. edit, service is great. Food still good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubDk2bmxBRRAB",
            "text": "Love this place! From the Happy Hour up to 7pm on both food and drinks to the Cacio & Pepe which is just fantastic! Make sure you visit!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNE5mdjhRRRAB",
            "text": "fabulous atmosphere and service. Highly recommend the rigatoni all’ amatriciana and vodka pizzas. Drinks were great too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIZ0p6Q2lnRRAB",
            "text": "Can't rate the food because it never arrived. Poor customer service. Apparently the restaurant was out of an ingredient so instead of calling with substitution options, they waited an hour and then cancelled my order; after I'd been told it was accepted by the restaurant, it was being made and already picked up by the driver. Really rude"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3dkp2S29BRRAB",
            "text": "This place is just amazing, in personal opening the best in upper east side. the service is excellent, the food amazing, the manager, bartenders the best. hello restaurant in upper east look out. thank you for an amazing service, makes me want to return more and more"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3eU82MjhnRRAB",
            "text": "Very laid-back afternoon quiet peaceful staff was great. Food was excellent and they actually listened to how we wanted our food prepared. I would highly recommend this place. I live in the neighborhood with my lovely wife."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCd3ZEN2RREAE",
            "text": "I blown away by the delicious chicken parmigiana, which had vodka sauce instead of red sauce. The breading was crispy and the chicken was juicy and flavorful. There was homemade and fresh pasta part of the chicken parmigiana dish. The service was also outstanding - the waitstaff was friendly and attentive. Especially, Vinny, he was attentive and genuinely interested in making sure that my dining experience was top-notch. Vinny was also very friendly and personable, which made the dining experience even more enjoyable! I highly recommend this restaurant for anyone looking for a fantastic Italian meal, especially the chicken parmigiana. Five stars all around!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0MzZyMUpnEAE",
            "text": "Botte UES offers the same high quality service as its Astoria location only with more space and a bigger bar!\n\nThe staff at Botte UES were very friendly and attentive. The drinks and food were also amazing. It was nice to not need a reservation on a Thursday night but I do recommend making one just in case.\n\nPro-tip: The dessert portions are big enough to share. 🎂"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1M1B1Nkp3EAE",
            "text": "We were able to get a reservation in fairly last minute and we were promptly seated upon arrival. The atmosphere is very nice and gives off \"cool industrial italian basement\" vibes (in a great way). The food and drinks were good and it was great that they had vegan and vegetarian options for those with dietary restrictions.\n\nI personally had the Lasagna, and for dessert we shared Tiramisu and Creme Brulee. Overall, the food tasted good and it was an enjoyable dining experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4cjVmRTRRRRAB",
            "text": "As a regular at the Astoria restaurant, I knew the manager would open a first-class bistro in Manhattan with the highest expectations and attention to detail. The Roman Italian cuisine is mouth-wateringly delish. The wines they serve pair perfectly and I adore the Montepulciano. The restaurant is warm, comfortable and friendly. In fact, I ordered a typical American lunch...that was done perfectly. I promise I am coming back for an Italian dinner!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHbzRqMENnEAE",
            "text": "Awesome dining atmosphere that made me feel so relax and would make a great spot to sit and drink with friends. Food are so delicious that I’m not really much of a meat person and I don’t usually finish up a main course, but I actually ate the whole thing here and would like to ask for more and more! The staffs here are so friendly and professional that made me feel totally welcome here! I was so happy to see that they have dessert which is a very big deal for a big sweet tooth like me!! Love that their dessert are so tasty, but not too sweet!! Would totally come here over and over again! Totally recommend this place for dine in or just for a drink! It’s all good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6eDQtelh3EAE",
            "text": "We’ve been here few times, one on a Sunday night and another one on a Valentines dinner which was very packed and we were a bit disappointed with the tardiness of servers on that day but it was understandable. Food was great, we ordered calamari(not that impressive), chicken milanese, pasta and tiramisu. My favorite dish was the chicken milanese— it’s absolutely one of the best chicken milanese in the city."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCbTlIRFlBEAE",
            "text": "My friend, who lives in this neighborhood suggested we come here for brunch.\n\nA small, delightful neighborhood restaurant. From the minute you walk in staff helps make you feel special. Unobtrusive check-ins with us left us wanting nothing.\n\nThey got the sauce for egg benedict exactly right accompanied with salad, saute spinach, and potatoes.\n\nMimosas more champagne than orange juice. 😉"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMX1p5M2hBRRAB",
            "text": "I ordered the branzino ($28 + tax) which came with a nice variety of vegetables. The branzino was one of the best that I have had in a long time, I eat out often. They have two dining rooms, the second one is in the back, both of them are simply decorated."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkc1BuZjRBRRAB",
            "text": "Customer service was very good. Food and dessert were OK. Maybe we’d come back for the salad and pasta and happy hour, but not for the dessert or burger."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoM09LRTZBRRAB",
            "text": "The food was amazing and the service was very kind and fast, probably one of the best italian restaurants that I have tried!\n\nI tried the POMODORO BRUSCHETTA, tasty tomato on a crunchy toast, RIGATONI AI 4 FORMAGGI, very good, and the CARBONARA which was definetely a win. If you like spaghetti carbonaras, please try it, you won't be dissapointed, they make it delicious.\n\nESPAÑOL:\n\nLa comida estaba increíble y el servicio fue amable y rápido, probablemente uno de los mejores restaurantes italianos que he probado.\n\nProbé POMODORO BRUSCHETTA, tomate sabroso en una tostada crujiente, RIGATONI AI 4 FORMAGGI, muy rico, y la CARBONARA que fue definitivamente un éxito. Si te gustan los espaguetis a la carbonara, por favor pruébalo, no te defraudarán, los hacen deliciosos."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydnJfN3NBRRAB",
            "text": "Great service, the waiters were very attentive. The diavola pizza is so good! The truffle fries were also great!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMjhfcThBRRAB",
            "text": "A great Italian restaurant in the neighborhood, which has a high expectation for Italian food, because there are several good Italian places nearby. The food is solid and traditional. Great atmosphere and friendly staff."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtcXBLRC1nRRAB",
            "text": "I don’t normally write reviews but felt the need - what a delightful experience! The calamari was delicious - well cooked and lightly breaded. The cocktails were incredible! And our meals were delicious - I ordered the lasagna and my husband ordered the carbonara. And to top it off, they were super accommodating for us and our toddler. We will definitely be dining here again! PS - Benjamin is EXCELLENT."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5OUl1cnd3RRAB",
            "text": "Ordered because the ratings looked promising but the absolute worst bruschetta I’ve ever had and worst $14 I’ve ever spent. Like they actually put chopped tomato on non-toasted bread. I don’t even think there was a touch of olive oil….!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlZ0lQUEFREAE",
            "text": "Visiting my son in the Upper East Side of NYC and we stopped in this restaurant. Great  Italian food, wine 🍷 and the service was perfect. One of his new favorites!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPMzRlQjdBRRAB",
            "text": "This place used to be amazing, but it has gone down significantly. The wait staff was fantastic however the kitchen and manager were an absolute mess. Main courses took over an hour to come out from the kitchen and it was all wrong. Chris (the manager) literally laughed in our faces when we asked for help. Sent out the wrong pizzas/courses, then proceed to scoop off the wrong toppings to then just ‘throw’ on the right ones. They were all cold. The bread sent to the table could chip a tooth as it was harder then a crouton. Someone at the table had a serious gluten allergy and the serving staff had no regard, with gluten pasta/meals spilt all over the gluten free cold plate. Chicken parm used to be great, it was black from being seared under the broiler. We asked the manger (Chris) to assist and he said “well you don’t like anything put on the table” then walked away laughing. This place has devolved quickly - used to be a local neighborhood haunt but now don’t bother."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWejZES0tBEAE",
            "text": "Coziest vibe on a cold December night. Manuel R was our server and he was nothing but kind and smiley the entire time. The food was really good and the ‘Made Ya Blush’ drink was amazing"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcXZfWS1BRRAB",
            "text": "The food is always amazing.  We decided to order out today.  We got the Diavola pizza, sautéed spinach, and the Chicken Paillard, all of which was delicious!   However lost one star because the $24 chicken paillard was a bit small.  We are still starving."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOai1LSjB3RRAB",
            "text": "Great service, friendly and helpful. We have enjoyed every dish we’ve tried. Happy Hour Negroni was really nice!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWeHRHWjh3RRAB",
            "text": "Best happy hour in nyc!! The food is amazing, the italian wine is delicious, and the prices are the best!! $6 glass of wine!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbU12TXdBRRAB",
            "text": "Amazing! We had a delicious salad and some fabulous pasta. Great atmosphere and our server Benjamin was super nice."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHZy1fY1FnEAE",
            "text": "My favorite Italian restaurant! Food is delicious and great service. You can never go wrong with meatball and grilled octopus❣️Don’t forget to try pizza too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dGFlbkRBEAE",
            "text": "Food was fine but the portion size was kinda insanely small for $22. Like…half the size of an appetizer small. But we got the gnocchi entree."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcy1udUNBEAE",
            "text": "Botte is one of my favorite restaurants ever! I’ve been here for so many times and for so many occasions. I came here with two girlfriends so we could celebrate a mini bachelorette for one of them. Our server was JD and he was excellent,…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCb29HOEJ3EAE",
            "text": "This is one of my fav UES restaurant for sure, the food is amazing, the price is fair and the service incredible!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbHFHT0NREAE",
            "text": "We came here for a family celebration on a Saturday night (partially inspired by their promo for a $29 bottle of wine) and this place did not disappoint! It was our first time here and we loved everything we tried!\n\nMy wife got the orecchiette with sausage and it was so flavorful and delicious! I ordered the bolognese lasagna and that was also incredibly flavorful and tasty.\n\nBoth pasta dishes were $22 each and the portion size was enough for each person’s dinner.\n\nThe service and the ambiance were great as well, so we will definitely be back!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqak02aVV3EAE",
            "text": "Unfortunately, the food has gone  downhill. Ordered the meatballs which arrived cold, but the plate was hot underneath which means microwaved. I asked for warm food. The same plate arrived, which I knew based on what I had left uneaten, just a little warmer. They should have brought out a fresh order instead of trying to save money. The food was flavorless and my longtime pizza parlor serves more appetizing meals. I masked it with hot pepper and grated cheese, and ate my $18 appetizer because I was hungry and felt like conversing with my friend and not the server about what they should have done. Won't be going back which is a shame because I've had much better food experiences here. One thing they haven't skimped on is good olive oil\nfor the table."
        }
    ],
    "reviews_count": 77
}