{
    "name": "Match 65 Brasserie",
    "place_id": "ChIJraJ9su5YwokR7iKyqGteG58",
    "grid": "MN8",
    "address": "29 E 65th St, New York, NY 10065, USA",
    "rating": 4.4,
    "user_ratings_total": 889,
    "phone_number": "(212) 737-4400",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsd1RXUkhNV1ZKU0dWdVQxb3hiWGhUWTNOa1gwRRAB",
            "text": "Very nice dining experience. A great stop in for lunch off Madison Ave. Compliments a day of shopping or errands. Friendly and attentive service."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xb1UwUTBNRmhyV210blNXVnRXRzlRT1hKM1NtYxAB",
            "text": "The perfect Parisian atmosphere. Warm, relaxed, elegant, and buzzy. If you attend an Armory show the same night, they'll give you a free glass of rose. Chatting with our waiter, we learned that he was also a performer, and had friends playing in the show we had just seen.\n\nUnfortunately, the food doesn't match the atmosphere (My chicken was very overcooked and dry). Considering the prices, I would've hoped for more from the kitchen."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twWWNVNUtaakZuT0Mxa1NIRkpOM0kxYWtORGRIYxAB",
            "text": "This is probably my third time eating here when I want to eat beef tartare. Fresh and service is great. Staffs always checking on you. Monday night - still many people were having dinners here. Lovely place."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONllteFVZMUZEUW1ZNGJYb3hkSE5qVTNjNUxXYxAB",
            "text": "It’s a small space, but they do a lot with it. Definitely recommend the pate, homemade soups and the burger."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoTlIweEJjbWhNZFhWUlJUZDZMV1ZOT0VaWU1tYxAB",
            "text": "Pleasantly surprised. Very authentic"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTFUwdDJNMlo2WkRKVVdUbHZNRGRNVjJadGFHYxAB",
            "text": "Match 65 Brasserie is a charming Upper East Side spot with true Parisian vibes, great steak frites, cozy atmosphere, and attentive service. Perfect for a relaxed brunch or evening glass of wine!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Zd016azBUVXAzTkhOclluQlBjM0pQYWtkek9WRRAB",
            "text": "Very good service, the food was good, I loved the atmosphere."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RelpYWlJha3BMUmtOdlkwVXhXR1ZLVWpsRmJrRRAB",
            "text": "Exceptional food, and service"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213d1ZWQkdOMVp4VjFOaFJWZEpVekJ3UmpSME1IYxAB",
            "text": "If you’re looking to have your $300.00+ dinner end early by an unprofessional manager not once but TWICE.. this the best place for you. Never in my 10+ years dining out with my husband all over top restaurants in NYC, have I seen blatant discrimination. Don’t waste your hard earned money on this at best AVERAGE place. I promise, there are so many better French restaurants than this one."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tScVRGQnVhMUV4TTJ3NGJFTmxhbGROVXpFME4wRRAB",
            "text": "True French brasserie with great staff, lovely atmosphere, and good food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsMGMyUkhUMk4zTVRJeFlYTXhlWE5HV0cxQmFsRRAB",
            "text": "Every staff member here knows how to make you feel welcome. The menu delivers predictable results. I haven't received such good service in ages. Perfect location. The meal deserves every penny paid."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsVFdHVklaME01ZGxCdGNHMXFNMDlGUkRsemNWRRAB",
            "text": "Highly rec the Chevre Chaud Salad. It was exceptional! The staff here is also extremely lovely. A welcome change (and did not get annoyed when I asked if I could take a work call here, unlike some of the other cafes in the area)."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVE9HTkhlbW8zTldjNFNIRnZYMjl3WTB0R05VRRAB",
            "text": "Service excellent, helpful and attentive\nFood not nearly as good as the times we have been before.  The meat was so very tough and the Caesar Salad had too little dressing and  no taste at all.  Very sad about this. Would have wanted better food to match the service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCcGMyWlVkR1pSYVY5R1YyTXlXRkJwZDB4Mk1rRRAB",
            "text": "Great atmosphere French bistro near Central Park , steak frites is great , very nice escargot , and relax place to hang out for a casual french dinning"
        },
        {
            "date": "1달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tScllVUkNRVm93ZFhKNFoxSnVRMjF1YzAxS1ZXYxAB",
            "text": "È il mio posto preferito a New York: tartare di tonno e di manzo ottima, salmone e trota incredibili, piatti abbondanti e generosi. Ambiente carino ed elegante"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGZmNUUXdUVk5yT0ZGWmJYRlBjVzlGYjFkVGRuYxAB",
            "text": "Eh not going back. Food was bland. Not great. Sad!"
        },
        {
            "date": "1달 전",
            "language": "cs",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNmRsTkNjVVZqUmtsYWVEUmZhVTlaYW5wdGFIYxAB",
            "text": "Naprosto fantastická restaurace s úžasným vibe, luxusní cibulackou a skvělou obsluhou! Doporučujeme!!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqamZMM0JBEAE",
            "text": "Charming French restaurant .\n\nThey were very packed on a Sunday afternoon. Definitely feels like you are someplace else . Décor  will transport you .\n\nStaff is very nice .\n\nThe Salmon and chocolate mouse I had was very solid .\n\nThis is not Bar Boulud level but certainly enjoyable ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aM1NVdFhZbmhYZVc1SlpWUjFNelJqVkVSd05rRRAB",
            "text": "Love this place what a gem\nThe burger and the Milanese were divine!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ONVFYaGZibkpJWVRSRFVtUXdaakZ6U3pCWFdIYxAB",
            "text": "I did not have pleasure of dining, but witnessed through smell and visual the decadent meals being served around me. I was at the bar and came for some drinks after a brunch I attended in in the Financial District. The staff and manager were professional,  courteous and knowledgeable in their drink recommendations. The ambiance of the restaurant brought me back to my time in the Amalfi Coast in Italy. I had the La Piscine Rosee, Bottle of Rose Champagne and ended the night with my favorite drink Espresso Martini. I definitely recommend if you're looking for a nice date spot or something to do after shopping in the city."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twWVlWQnFaSGgzWTIxSmVXNU1Rak56VmxCdldVRRAB",
            "text": "We all know a lot of French restaurants, but if you’re looking for delicious food that warms the heart and attentive, genuinely friendly staff, this is your place to go."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aRmRpMUtUMkZaVjI1M01uRk9ja2hUVmxRM01WRRAB",
            "text": "Cute, little bistro near Central Park. The steak tartare here was tremendous."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWa1ZFOVNjVVoxZVV4Q016RnpTMUJWVkRGMWFVRRAB",
            "text": "Very bold chocolate mousse."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jd01sWmZOMDFDTWtOTVNVSmZSek01U1VWRWVWRRAB",
            "text": "Match 65 is a hidden gem! The food was outstanding — fresh, flavorful, and beautifully presented. We had [you can add your favorite dishes here if you’d like], and everything was spot-on. The atmosphere is cozy yet stylish, perfect for a relaxed evening out. The service was warm and attentive without being overbearing. You can tell they care about both the food and the experience. Highly recommend if you’re in the area — we’ll definitely be coming back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4R1ZXTkdXRlJaV1ZCWGNITXhXVXRqY2pKSlFWRRAB",
            "text": "Stumbling upon this place was fortunate! Their food preparation is excellent and their service always meets standards. The team here makes dining pleasant. The prices are very reasonable and the food is great. I happened upon this amazing place!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjdE1teDNaVUZhTVdkSWQyUnVVR0pyYkZKWFZtYxAB",
            "text": "Nice service and friendly staff but really not worth it. Wanna be a French restaurant. Food is more than average. The tartare is a lightly seasoned supermarket ground beef. The mushroom sauce on the roasted chicken tastes like old chicken broth. Just stop here if you are REALLY hungry and you are willing to pay too much. It hitches to pay the bill."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdVNETmlRV0Z2ZUV0dVVVRkVXVmxpT0hsVGJsRRAB",
            "text": "Excellent service, but the $55 steak fries were supposed to be bigger, taste better, or have better fries for the price."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWFJsZG1lalZHYVdoNlgycHpjSGRFV2xZM1RVRRAB",
            "text": "This restaurant captures the essence of New York, with a local touch, delicious food, and a pleasant atmosphere."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21scGFFWm5hRGRaYlVkTlpGWjZWbmh5ZEhCelEwRRAB",
            "text": "The kindest, most accommodating staff! A gem of a spot."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SeVR6Tk9iVzk2TlZORFIwZExSVFV4TW5JdGJsRRAB",
            "text": "Order placed via Uber.\nA burger with fries, with extra egg, avocado, and bacon.\nThe burger arrived completely crushed and destroyed. The bun was soggy. It was inedible and disgusting.\nOn top of that, the fries were cold and limp — obviously, everything was thrown into the same container.\nAvoid this place at all costs!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GcWNGaHliRnByY1ZZMVltcGtNMTh6YkdGa1VVRRAB",
            "text": "I come here all the time, Anthony is an amazing bartender and person in general. He is very attentive and sweet. Escargot is what I always get, always comes out bubbling hot and super flavorful."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oaWIwMW5kMUJTWVhCdFlsVkdkakUyTkVSRFNtYxAB",
            "text": "My boyfriend and I went this past Sunday and had an amazing brunch! Our server was awesome, he was super attentive and helped us pick the perfect wine to go with our meal. We’ll definitely be back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxT1NVbHJjRXRTTjNWWlpXbENVbWxsVDI1UFJWRRAB",
            "text": "Great fresh food ! ♥️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VPQ3puSU9RMHNUMi1RRRAB",
            "text": "Nice place, great location, good atmosphere.\n\nMenu was limited and not really french-french but american french.   I would have loved some genuine french cuisine but it was mediocre.\n\nI felt like the food was dropped off from the grocery and tossed onto a plate. For $30-50 an entree, it is not worth the price.\n\n$25 for 4 pieces of store bought mozzarella and tomato + 2 pieces of small bread? No thanks.\n\nThe menu didnt have many food options.  The 2 page menu had maybe 15 different entrees.  The back half had like 50 different drinks to pick from."
        },
        {
            "date": "5달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPcTJzZW1EX05IMlZ3EAE",
            "text": "Posto delizioso, cucina ottima, servizio eccellente! Ci tornerò sicuramente."
        },
        {
            "date": "5달 전",
            "language": "fr",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLaXluZXFScUw2Um5RRRAB",
            "text": "Ce fut une très belle découverte. Nous cherchions un endroit pour se restaurer proche de Central-Park et la 5e avenue et bingo, nous avons trouvé une petite brasserie à la française. L'accueil était bien chaleureux, le service était très rapide, le personnel bien souriant. La qualité du repas et excellent. La décoration style à la française. ambiance décontractée et sophistiqué en même temps. Une bonne adresse culinaire que je garde dans mes favoris. Allez-y les yeux fermés.\n-------------------------------------------------------------------------------------------------------\nIt was a wonderful discovery. We were looking for a place to eat near Central Park and Fifth Avenue, and bingo, we found a small French-style brasserie. The welcome was very warm, the service was very fast, and the staff were very friendly. The quality of the meal was excellent. The decor was French-style, with a relaxed yet sophisticated ambiance. It's a great culinary spot that I will keep in my favorites. Go there with confidence.😊"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURramFMVE53EAE",
            "text": "Love this place. Great food , great cocktail and very friendly service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VOcW5qY1hFLV9qb3NBRRAB",
            "text": "Loud, over salted food, inattentive staff. Not fraud but can’t recommend"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VPeUc1T0N0LV95Q1lREAE",
            "text": "Minus two stars for the service. Not very nice staff, food was just OK. Not kid or stroller friendly."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKT3Yyb2ZZeDZLQVdnEAE",
            "text": "The gas was off the day we visited so that impacted what was available, but the staff was very good about managing expectations and telling all customers what was available on their then-limited menu."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPdUIwWkxVN19PLS1BRRAB",
            "text": "Stylish tiny bistro that found me a place at the crowded bar where the bar tended raced to keep up with the orders. The pate was nothing special, the fries were ridiculously expensive.  The quaintness and location support the prices. Picturesque. I wouldnt return, even if it was empty."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNSFhwWjJ4OFpQMTJnRRAB",
            "text": "This place has become the go-to for us whenever there’s an event at the Roosevelt house. The price is extremely reasonable for what they serve. And amongst all French restaurants we have been to, in NYC and central NJ, this is the best."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMk1pcUd3EAE",
            "text": "Delicious French food with beautiful presentation. We had no reservation and the host was so friendly and accommodating. Definitely would like to come back to try more dishes."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcDU3a1FREAE",
            "text": "Service was fantastic, food was absolutely delicious, and it's one of the cheapest places you can eat in Manhattan (that's still not very cheap). Definitely would come here again.\n\nI don't recommend the bar, though, tiny drinks for crazy prices."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLNFA3ZGxRRRAB",
            "text": "Our reviews had over 56 million views in the last 12 months.  We do not get paid we just love to eat and have fun.  We really love Match 65.  OMG WENT 3 MORE TIMES, ALL WERE AWESOME.  MARCIA WAS OUR SERVER AND SHE WAS GREAT.  HAD THE MUSSELS BUT WE CHANGED THE SAUCE TO TOMATOES AND THEY ACCOMDATED ME.  OMG WERE THEY AWESOME. (THEY SAID THEY CANNOT DO THIS WHEN BUSY BUT IT AS 9 PM SO IT WAS OK, VERY NICE). MARIA HAD THE BURGER AND LOVED IT.  MUST HAVE THE SALMON TARTARE EVERY VISIT AND ALWAY GET THE SOUPS.  ALL ARE VEGAN, ALL ARE PUREE AND ALL ARE WONDERFUL.  MET THE OWNER AND SHE WAS GREAT.  MADE SURE EVERYTHING WAS PERFECT. 2 more visits.  Perfect every time.  1st class Great French food perfect for foodies.  Be sure to get the various crepes for dessert (see photo of them on fire!!!), mushroom ravioli is superb, steak tare tare and salmon tare tare are awesome.  Loved the daily soup every time we ate there.  Perfect spot for romantic date.  Get a reservation for sure.  photos also include French onion soup and mozzarella and tomatoes.  Both were perfect  Check out all of our reviews and look at all the photos below. If we do not like it we do no review it so all of the ones you see are places that are fantastic. Follow us if you like. We had over 56 million views in the last 12 months and we thank you for that. We don't get paid, we just love to eat. Be sure to click on \"RobH\" at the top of this review to see all of them and to follow us if you like good food and FUN.  If we do a review it is because we love it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvb3REVDZnRRAB",
            "text": "Top two fish meal in my life. The other one had three michelin stars. Well dond!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcU1lWE1REAE",
            "text": "A must place to go every time I’m in NYC!"
        },
        {
            "date": "6달 전",
            "language": "it",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJZ1lEMER3EAE",
            "text": "Match 65 Brasserie è una piccola perla nell’Upper East Side. Atmosfera perfetta per un pranzo o una cena in stile parigino.\nServizio gentile, ottimo vino e tavoli all’aperto davvero piacevoli. Una tappa perfetta per chi ama la cucina francese con charme newyorkese."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbUxucThnRRAB",
            "text": "A New York Treasure … don’t miss it!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOWNEZHVnRRAB",
            "text": "Delicious food, above and beyond service, stylish atmosphere and prime location."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4dGJUaTJBRRAB",
            "text": "맨해튼에서 처음 가본 프렌치 레스토랑. 프렌치 어니언 수프랑 까르보나라 너무 맛있었어요. 디저트도 완벽함"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0M3MzSF9RRRAB",
            "text": "미국 출장길에 시간이 남아 들렸던 프랑스 레스토랑. 스테이크를 주문해서 야외에 홀로 앉아 먹었다. 주문했던 스테이크는 육질이 매우 부드럽고 맛있었다. 날씨 좋을 때, 야외에서 맛있는 음식을 먹으니 좋은 추억이었다. 직원도 친절했다."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZMWR6MHdBRRAB",
            "text": "점심식사를 위해 방문하였습니다. 1시가 지난 시간에도 사람들로 붐볐어요. 맛있고 은근히 가성비가 좋았던것 같아요^^ 조금 좁지만 재미있는 곳입니다. 프렌치어니언스프 추천합니다."
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnNXFLeVF3EAE",
            "text": "여유롭고 현지인들 많은 식당이에요\n맛도 깔끔했고 좋았어요"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6bFlQTTFBRRAB",
            "text": "We recently enjoyed an alfresco dinner here and everyone enjoyed the pleasant evening meal. We ordered a variety of dishes, classics made with quality ingredients. The Caesar salad, chicken and even ravioli were fantastic. Chilean sea bass special was good but didn't warrant the price. Wines were great but the martini cocktails were too sweet. The owner/manager was extremely courteous and accommodating but our server, though polite, seemed distracted and rushed. Overall a positive experience and we'd be back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2anVERklREAE",
            "text": "We recently enjoyed lunch here and everyone enjoyed the meal. We ordered a variety of dishes, classics made with quality ingredients. The Caesar salad, chicken and steak with fries with wine hit the spot! Overall a positive experience and we'd be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4aTluY0NnEAE",
            "text": "Ordered to pick up for lunch. Nice place. Indoor and outdoor seating. I had a Classic Black Angus Burger and a vegetable soup.\nThe soup was light, slightly spicy with a nice hint of celery.\nThe burger was delicious. Take a moment to appreciate the size of the patty. Cooked perfectly. Great selection of cheeses and toppings for the burger. I added guacamole. Fries was good and crunchy. Everything was packed neatly, and I had a little surprise of mini cookies, which were tasty. Thank you.\nCan't wait to go back. The menu looks amazing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKOUs3OXlRRRAB",
            "text": "This place was so fun to visit! I really like the atmosphere inside as it’s dim lit and romantic. It’s perfect for a date night. I decided to sit outside as it was a nice day. Partly cloudy, but tentative was great. I got the tartare with fries and a drink and for desert the apple tart with ice cream and an espresso martini. The staff was super friendly and knowledgeable about drink pairings. Perfect place for a special occasion, getting drinks with friends or a date night."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueDYzbVpBEAE",
            "text": "Was visiting the Kips Bay decorator show house nearby so we stopped in for a late lunch. We ate on the sidewalk since it was a warm day and it didn’t look like they had air-conditioning working inside. They definitely are working the French bistro interior decor. You’re in the heart of the upper East side so you’re paying through the nose for what would probably cost 25% less elsewhere. Service was fine, not particularly gracious and the food was decent. Not sure I would go back unless I was in dire need in that area."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4LVo3YWVnEAE",
            "text": "I came here for a late weekend lunch and had the croque monsieur. The interior of the restaurant has that charming, classic French brasserie look, and there are a few seats at the bar that are perfect for enjoying a meal alone and some fresh air from the open windows. Despite how the area is a bit of a tourist zone, Match 65 manages to retain the feeling of a neighborhood establishment. The servers were very kind and attentive. I also like how they have branded matchboxes to match their name (ha, get it). My only complaint is that my dish was very heavy on the salt, and it was hard to finish because of that."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5bVlDNFRBEAE",
            "text": "Very cute and romantic flare for the outside-inside patio... tiny tables, just like in France.\n\nMust say, the service was very good and friendly, it was a pleasure to sit and relax, not rushed out. Felt very welcomed.\n\nSolid French Classics, solid. Hoping to see more culinary experiments when all goes to normal.\n\nFantastic Creme Brûlée"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuczREXzd3RRAB",
            "text": "Great weekend lunch spot after the Met. The atmosphere is quintessential French bistro. We had a simple lunch with French onion soup (one of the best we’ve had) and Caesar salad. Service was excellent."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURBdHNKSBAB",
            "text": "Great service, we loved their pasta. Only missing baby changer in the restrooms. Great selection of appetizers. One of our favorite french places in the city for a reasonable price. Recently changed waiters and weren't very kind because we came there with kids."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1M3JYM0V3EAE",
            "text": "They were somewhat busy. There were some street parking nearby. We were sat pretty quickly but it took us a long time to get some water and to put some drinks in. We weren't even asked if we were ready to put any food in after our drink order before our server left the table. After our drinks came, it took awhile before she came back to take our order. We ordered the mussels and prime rib tartare. For my drink, I ordered the La Priscine Rosee which was just ok. The prime rib tartare was good but the mussels [not on the menu] had too much lemon in the broth.\n\nOverall an okay experience, not sure if I'd come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkdi11c0pBEAE",
            "text": "It's so close to 5 stars but a few items needed more seasoning.  The French onion soup for one was an example.  The trout almandine however was one of the best I've ever had."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUb0xHSFRnEAE",
            "text": "It was our first meal in New York, and it was a very good experience . Tried all three dishes each and every dish was very good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtLTY2TG5BRRAB",
            "text": "I love that place! The steak frites was delicious and it was a great time to go during the France vs England World Cup game. The mood was warm and energetic. I had my dog too, so they were extremely accommodating and offered him water. They didn’t mind him sitting inside. Thank you for having us."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURReHIzUTFBRRAB",
            "text": "French bistro with decent food. 4 star because of the service and the ambience. The Irish waitress so Lovely, made us feel very welcome. Excellent crab cake and foiegras. Perfect pit stop from.the hustle of Madison avenue."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKczlydXNnRRAB",
            "text": "Chanced upon this delightful French brasserie. The care taken to create a French atmosphere is seen in the interiors where the names of French drinks are found on the lamps/ the hostesses are french and even the VS mustard accompanying the pate was a blast of true blue french cuisine."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSeUstcXlRRRAB",
            "text": "Decent restaurant but the food was below par. It’s about expectations at this French restaurant but they delivered below expectations. The place is very nice indoor and the ambiance is nice too. They also have some seating outside."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlbVo2MzBnRRAB",
            "text": "Very good food and great service. Nice little French bistro which has an authentic French flair. The steak frites was tender, juicy and cooked perfectly. Highly recommend the escargot too which is cooked to perfection. And great music."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bHZmY3B3RRAB",
            "text": "Excellent. No wonder it was so bustling at noon! Friendly service, perfectly made cocktails, fried to perfection fries, sizzling generous escargot and absolutely divine steak tartare. Feels like Paris for a moment."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxd0xpNE1nEAE",
            "text": "Nicely appointed outdoor seating on a quiet residential sidewalk. Impeccable service!\n\nThe food is a little pricey but expected for the area. My nicoise salad was $25 which would be a fine price except the tuna was overcooked and a bit dry. Great iced coffee!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYZzRXV2R3EAE",
            "text": "Good atmosphere. Good food. Good service.\nMoules were fantastic. Steak was good. Had a nice time. If you are in the area it's a great place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINEozc3JRRRAB",
            "text": "6 out of 10,  bread and butter was fresh. Main course “Filet Of Atlantic Salmon” had  too much oil. Tomato, potato’s and eggplant are very tasteless….. just one herb that overpowers the actual tasted of vegetables. Not sure about other dishes but salmon was a disappointment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbktIWmRnEAE",
            "text": "Came here the day of the Greek Independence Day parade, outside the restaurant but bustling but inside was pretty quiet. The service was a bit slow. The food made up for that! Our artichokes were delicious, my salmon tulum salad was incredible and my fiancé loved his chicken paillard. The salmon was cooked perfectly for my salad. A beautiful brasserie we’ve been visiting occasionally for several years, definitely recommend."
        }
    ],
    "reviews_count": 76
}