{
    "name": "Ravagh Persian Grill",
    "place_id": "ChIJcQpUZcJYwokRaQR_s0f6qAg",
    "grid": "MN8",
    "address": "1135 1st Ave, New York, NY 10065, USA",
    "rating": 4.4,
    "user_ratings_total": 1276,
    "phone_number": "(212) 861-7900",
    "reviews": [
        {
            "date": "8시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paaGNUSklhbWxmTWpKVmJtdHRPVkE1U21sbmQzYxAB",
            "text": "We have ordered food for dinner. It took them nearly 90 minutes to deliever. During that time, we called them, just to be placed on hold for a long time. By the time the food arrived, it was cold and no longer needed."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGcVJGTnhia2h4Y3pScFNEbEdVREkwVTNabk4zYxAB",
            "text": "Amazing Lamb and Steak dish, good veggies - honestly could have split the plate. If I ever travel back to NYC I am going here !!!! Delicious."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BdGR6bHFNbUZHTVhKRlJVNDNkWGRsWDB4RmFIYxAB",
            "text": "We had dinner with friends this Saturday October 25th.  The Atmosphere was lovely and relaxed, Staff and Service very welcoming and professional.\nExcellent food, well priced. they didn’t pressure us nor did they mind that we set almost till closing.\nWe will return 👍"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GQlNHY3pUa1JMZFROSGNUUlVhbXBsVnpGM1ZtYxAB",
            "text": "I am very happy with the experience that I had in this restaurant , the food was simply delicious the portions large and so tasty , the staff members extremely kind and  so the atmosphere .\nThe dessert I shared with my friend Ken was the cherry on top of the cake : we had the most delicious saffron & pistachio icecream which I recommend to all of you !"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKVlVFODNRVVZDZW0xUGRUVXdaV0l3UkVoVk0yYxAB",
            "text": "This wonderful place showed up in my online search. The five-star limit undersells this restaurant. The dishes here are distinctive within the city. The second we stepped inside, a pleasant employee acknowledged us. I recommend exploring the complete menu."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWmNESTFZVzVVWm1GbGNUZ3pkbkJOTnpoT1MzYxAB",
            "text": "Ravagh Persian Grill 65th 1st ave, A quaint Persian grill, stopped by for lunch, chicken shish kebab was extremely tender w/ rice , braised tomato and grilled sweet onion added nice flavor. Also cucumber and mint yogurt added nice depth of flavor. If your ever in the area , give Ravagh a try your palette won't disappoint."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psSlVqWkdRbU41YzBSMFdWRmZVRUZVVlRSUk5FRRAB",
            "text": "Great great Persian food the meat wow  the manager Mr Moises was great and super nice and very attentive and took care of us …from now on every time I visit New  York I’ll definitely be back to this place"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SWWJHSnNhbFJzUWtocE4wMHdORlJWY0ZKMGRYYxAB",
            "text": "Excellent food, service and quality, I could not ask for better. Highly recommended 👌🙏👍"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21neFFqSnZWbTl4YVhkNFYwSXhOWGhpZFRORlFWRRAB",
            "text": "I was born in Iran, and I know what real Persian food should taste like. I didn’t expect the exact same flavor here in New York City, but at least something close. Unfortunately, the kebab we ordered was nothing like traditional Persian kebab.\n\nI have never seen kebab made with parsley or coriander — and the taste was more like curry than Persian spices. It felt like a completely different cuisine.\n\nWhat made it worse was the service — nobody came to check on us or ask if we were satisfied. They just dropped off the bill. I don’t care about fancy presentation, but please don’t call it a Persian restaurant if the food isn’t truly Persian.\n\nThe next day, we tried another place called Nasrin, which was a real Iranian restaurant — what a difference! Don’t waste your money here if you’re looking for authentic Persian food."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGSGMxTjRhMFJYVGpCSll6ZHVkVGRQWTBOWk0wRRAB",
            "text": "Incredible food. Friendly service"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4ME9HTnJORFF3V0hSQ2J5MHhOREpDVW5WUFVtYxAB",
            "text": "Great food amazing quality"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkU1gxUmFWMmMzUkdGa1V6QTJRa0Z6TkVSUlZrRRAB",
            "text": "We absolutely loved our experience here! The Hummus and Sambusak were delicious starters, and the Ash Reshteh soup was rich and flavorful. Both the Beef Koobideh Kabob and the Lamb were cooked to perfection and tasted amazing. On top of that, the staff were so friendly and welcoming, which made the visit even more enjoyable. Highly recommended\nWe’lldefinitely come back!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCbE9GTnFNa0pSWTNOQ01GbGZPRmwxY0d4UVIwRRAB",
            "text": "Excellent food, well seasoned and cooked. The grill selections-beef kabab, chicken kabab- were properly prepared and delicious."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SU1UyeDVNMDQxTWxjMkxYUmtOVUZ6VG5KeldFRRAB",
            "text": "The food was excellent! The service was excellent! The manager (Raffi) was professional and gracious. This is the first time we came to this location of Ravagh and we will be back. Highly recommend this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkR01GVjJjRTUwUm1wSGFrTTRieTA0YzFoclptYxAB",
            "text": "I stopped by here for a late lunch for the first time. As soon as I walked in I was greeted with a smile and enthusiasm. Everyone that worked there said hello and looked happy to be there.\nThe restaurant itself is very cute, cozy, and clean.\n\nI’m pretty new to Persian Cuisine and have only had it once other time. While I liked it the first time- this time I REALLY enjoyed it. The koobideh kabobs were seasoned perfectly and was soo juicy and tender. For dessert I got Persian tea (which I love) and I decided to try to Faloodeh. The fresh lemon and sour cherries were a lovely touch, making it very light and fresh after that amazing meal. The noodles in it were also a nice surprise as it gave it a nice texture. The best part is I didn’t feel overstuffed or tired after eating. It felt like I was eating a comforting home meal- that being said I left extremely happy and satisfied lol\n\nI also got the dark meat chicken Kabob to as well to try it .. it was sooo juicy. I think I could just eat the chicken every day like that alone lol in the to go bag they also packed some of their delicious fresh bread, along with sauces for it and some sumac.\n\nNeedless to say, I will be returning again! I’m constantly craving that koobideh and I absolutely want to try some new things!\n\nAlso needed to add that while I was eating, a customer came in wanting gluten free options. One gentleman kindly stood there and assisted her, pointing out everything she could get. The people always make the places better."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4eExVVjRkRkZ4ZWtrMFVVNTBZVVZNTlZOMWFFRRAB",
            "text": "Lamb Shank with Albalo polo is the best combo you can get!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OemQxaE1hV0p5Tm1VMVZHMVJNak5UWlV0dE1FRRAB",
            "text": "The local dining landscape is better with this place in it. The menu offers delicious choices and the waiters offer helpful assistance. The staff makes dining here special and the food makes it memorable. Restaurant personnel showed complete cordiality. I want to experience their other specialties soon."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dFoxaHpaMHh0UmtKSFpURlVla2xXTFVwRFdHYxAB",
            "text": "The worth Persian restaurant i ever tried"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbWJXUlJTRWx3UTNvelRDMWlSblI1UW5RMFNrRRAB",
            "text": "The food was delicious!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxamVWWnJNVmt4YlZwcGVVcGljRzFGZWpGRmNuYxAB",
            "text": "Koobideh was good but rice should be more! Staff are friendly. A great place to enjoy Persian food at the heart of Manhattan!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oUVJuQlhaMFpQU1VWR1FqSXlSbGgzU0hSRWJuYxAB",
            "text": "If I could give -100 I would give! The uber app didn't give option to not add “substation” so I wrote a note specifying I wanted the basmati rice and chicken( the already comes in the dish). Only if they could switch the grilled onion for some friesok, if not that would fine. They sent my order missing the main reason I orded, the rice. So, I call and try to explain what happened. The persons interrupts me, starts to yell and hang off the phone on my face. I call again and ask for the manager, guess what? That was the manager. Rude, unprofessional, first and last time ordering from there. When I mentioned he was rude and hang off he said you didnt let me talk, I said that I was explaining what happened in the app and it does not matter you cannot talk to people and costumers like that. Yelled at them??? He was so rude! In the end I lost it bc was such unpleasant person and horrible experience ordering for the FIRST time there and instead of listening and solving easly the small issue the manager yells at a costumer, a “man”. It was not cheap, spent $40 for one person meal and missing item! But the behavior of the manager of 1st ave location was despicable"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOckR0ZFNub2RPR2pnRRAB",
            "text": "Amazing food and very well service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdWRHMWZRVzVIZVdKcFRUaHZhbmg2TFhSQk1tYxAB",
            "text": "nice place, we like the food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOTmFqZHdNMUpNVmxaR1NXZFVYM2xFTVVrMmRtYxAB",
            "text": "We were excited to try Ravaq for authentic Persian food during our trip, but the lamb koobideh was quite different from what we expected. The flavor leaned more toward Arabic cuisine, which can be great in its own right, but it wasn’t what we were looking for at a Persian restaurant. It might be helpful if the menu clarified the recipe style so guests know what to expect. Unfortunately, it wasn’t the experience we hoped for.👎🏻"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wa1NHVTJVbXR0VEY5R2NURlJOV1p2YTB0cmNtYxAB",
            "text": "I would give 0 if it was possible. Who the hell in the world add herbs and veggies into kubideh. It tastes like arabic food!!!! I just donnow where are they bringing these imaginery recipies from!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ONFNsRnhRbWwzVm01aFEzY3lRMmhCWVc1d2NVRRAB",
            "text": "The food was amazing and the vibe was nice, but the service was really disappointing. One of the women servers was great, very polite, but the two men working there honestly need to learn how to treat people. They brought out the main course while we were still eating appetizers, crammed everything onto a tiny table, and then dropped the check without asking while we were still talking. On top of that, they already charged 18% tip and still expect for more. Great food, but the service really ruined it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NldGTkxka1pDYnpSblkxZ3pWaTF2VlVoU01XYxAB",
            "text": "Enjoy the food very very much …\nVery Fresh\nBig portions"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oa2FHTndaM1psWDBSWFVWa3plRWx1Ulc5aVZsRRAB",
            "text": "Best"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdWRIQk1RVGt3VEVwS1RXODVOM1l3YjNsbk9IYxAB",
            "text": "Great service ,great food\nI tried both branch, they both great\nI strongly recommend this place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poc2FsTkdjVjl5ZW1sSVpqRjVNbkV0YWpZd2NWRRAB",
            "text": "The food is absolutely delicious; you'll want to savor every bite. It's a clean and delightful establishment. They even offer complimentary bread, soup, and salad, which is a wonderful touch. This spot is truly a gem in NYC!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xreFJGYzRUREJvTTFObmIzQnNhVkZzYVVaTmNVRRAB",
            "text": "The meal is huge. Most could be finished for one person."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOTVZEYzBjbEZLUkhONE1tSlZSVGRxUW5BelNrRRAB",
            "text": "Loved ,oeved, loved it"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poMlYzSjJlSFJqUkRaMUxXVjRTVEZEVjBaemQyYxAB",
            "text": "Been dining at this restaurant for years and it never disappoints. The food is delicious - always well cooked and nicely seasoned. They serve large portions so it's a great place if you have a big appetite. I had the chicken sultani kabob with vegetables -juicy chicken pieces and the koobideh was delicious....everything was pretty great. Friends had the lamb kabob and lamb shank stew with eggplant- all delicious."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SUVVUZHBkMDlHUVRSVlFVVllUM1JtVjA1TlduYxAB",
            "text": "Food is always so delicious and fresh at this location. They were accommodating to a larger group with children. Bread was so fresh and delicious.\nLots of vegetarian options."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twTk9IcGxUelZ3TFhWblMzbFhNbVYwWkdaYVVHYxAB",
            "text": "I got take out so can’t comment on the atmosphere. The food is absolutely fantastic, and I have been ordering food from here for 3 yrs. I drive from Westchester County cause no other Persian food compares. Staff always runs the food out to my car. They are great!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ab2RrSkpVa3QxYUUxcVJHTXdkRjh3ZFRaVldrRRAB",
            "text": "Absolutely loved Ravagh Persian Cuisine! Super authentic flavors and you can feel the warmth from the second you walk in — staff is really friendly and on point with service. The atmosphere is classy and cozy, perfect for a nice dinner.\n\nWe started with the Mediterranean salad — fresh and full of flavor, easily a 9/10. The lamb koobideh was juicy and cooked just right, with that delicious saffron rice on the side. But the real star? The chicken fesinjan. That sauce was on another level — rich, bold, and unforgettable. Definitely a must-try. Will be coming back for sure!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbVZrNW9Sa2RCV1cxbU9URXdlaTFoVDJwTE1VRRAB",
            "text": "I get my food from there sometimes twice a week, love the chicken koobideh very delicious large portions enough for two."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkd2NHdHVOMHRPWjNBeGQyOXFZWHBZTW5jNWVFRRAB",
            "text": "For thr quality no one is close in that price."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kV00yeHRZMlY0TlZOVWRUbEtiM040V2tkbU1YYxAB",
            "text": "Excellent Persian food in a relaxed atmosphere. Lavash fresh from the oven, excellent koresh and kebabs. Friendly service and enormous portions. The fesenjan was outstanding. Reasonable prices for a real feast."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CcVRtdHBNa3d4UTFaQ1kyUTNhMnBaZG5SMU0xRRAB",
            "text": "best persian food anywhere in ny i've had, everything was good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GcWVWY3daM1JQT1ZkS2FWb3pUMUJYYnpaNWFrRRAB",
            "text": "I liked this place very much. It is highly recommended for persian food and kebabs lover.  I tried lamb shank and kebab combo which both were tasteful. Baklavas were devine as well.\nI would definitely come back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkc1lVSlpWMlJYYkZSZmFqTjZlbUpzY0VsbFdrRRAB",
            "text": "I order delivery from this location once every other week and it is always amazing! The Sultani Koobedih combo is great."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTlVtRk9TVTV6Y0hSbFZGWnlVM1JIWDFoYWFGRRAB",
            "text": "Gets busy on Friday evenings so show up early or be prepared to wait. Food was all delicious and the servers were great. I’ll def be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VeVpIWldhRE13UTFOeVRqbHZPR3R6V0ROYVlsRRAB",
            "text": "We looooved the food. We had also chicken kebab with rice, it was so good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WU1R6aDBWRVl4VEdSNU5ubDVURlJCVUY5aGFVRRAB",
            "text": "The food here is overall average, but the Kebab Barg really stands out — tender, flavorful, and cooked just right. If you haven’t had high-quality Persian food before, you might enjoy it more, but for those familiar with top-tier Persian cuisine, the rest of the menu may fall a bit short. Still, worth a try for the Barg alone."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WM1pWVlZVa1JyTUVkQ1QwRklOVE5NYmxkNmQxRRAB",
            "text": "Best persian ive had at a restaurant. Felt like a homecooked meal but a bit more elevated in terms of seasoning so you know you're out to eat, but everything was authentic and flavourful and plentiful. Obsessed"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoNFJYZHRWVXRTTjB4c1FsaEViV2hUVjFkRGQwRRAB",
            "text": "Slightly expensive but easily worth the price if you order correctly. Lamb shank is the best entree on the menu by far. Highly recommend paying extra for the cherry rice. The bread they bring out at the start is fantastic, as is the green sauce that comes with it. Hummus is solid as well"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oSU9WUnJWRGREWlhaWGEydDJUR290VEU5aU9HYxAB",
            "text": "This restaurant wins me over, just like the area. The menu features great-tasting food made with fresh ingredients. The people here all show warmth and provide assistance.  offers a compact, tidy and comfortable space.  keeps its status in my top dining experiences."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTFZUZG1OSFk0TkZkbk9VbFRXR04wZDBsTU9IYxAB",
            "text": "It's quite good. The barg was cooked well, how I like it, but still juicy and flavorful.\n\nFYI: The uploaded menus are actually out of date. Kebab barg will run you $32 before tax."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKalQwcHNjRjlQUzNoa1QxVlRabGhOWVdWSWVIYxAB",
            "text": "We ordered the eggplant appetizer, yogurt with mint and cucumber, and chicken kebab with rice. Everything was fresh and very well prepared. The freshly baked bread was also a nice touch. Overall, the food quality was very good.\n\nHowever, I was surprised to see an 18% service charge automatically added to the bill. Honestly, it's the first time a restaurant has ever charged me a service fee like that — and it was separate from the tip I personally added."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZZ2QzUjVRRRAB",
            "text": "The presentation of the food was absolutely beautiful and mouthwatering , we ordered the lamb shank, barg, and chicken kabob. Unfortunately, the taste didn’t live up to the appearance. The meats lacked distinctive flavor, and the texture was chewy. The chicken kabob was decent but could have been thinner and more flavorful. The lamb shank was the highlight of the meal, yet even that fell short of being great."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmclByNWZnEAE",
            "text": "Quick lunch today.  We shared traditional eggplant and Ghourmeh stew. Orders come with delicious warm bread and dips and a salad.\nGreat vibes and always busy.  Service was excellent.  And we keep going back!\n\nBack again last night with two nieces from SF. Had a great dinner with Humus, traditional Eggplant, chicken kebab, lamb Kebob and beef kebab.\nWe were back again in March with our nieces from SF.  We ordered lamb chops, shrimp and seafood.  All so delicious.  We will continue to go here for wonderful Mediterranean food.  It has great vibes and is always busy."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdVBERFRnEAE",
            "text": "Ravagh is hands down my favorite Persian restaurant in NYC so far — and I say that as someone who grew up eating this food. The flavors are incredibly authentic and consistently delicious. The beef koobideh is a must-try: juicy, perfectly seasoned, and cooked just right. The sabzi is also spot on — fresh, flavorful, and exactly how it should be. If you’re looking for real Persian food done right, this is the place."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBamQ2TmxBRRAB",
            "text": "This Persian restaurant located in the Upper East provides the neighborhood with excellent choices of grilled lamb, chicken or fish. Also, offers exquisite Persian salads. The portions are very generous and it has a great price value. Highly recommended when you have cravings for Persian food!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNWNpSGV3EAE",
            "text": "Ravagh offers an overall decent dining experience, but it falls short in delivering authentic Persian flavors. The kabobs are heavily Americanized and lean more toward an Arabic style, which may disappoint those seeking a true Persian taste. Additionally, the stews, particularly the ghormeh sabzi, lack the bold flavors typically expected, coming across as rather bland. On the bright side, the ambiance is pleasant, and the service is satisfactory, though the spiciness of the kabob was a bit too much for my personal preference. If authenticity is a priority, you might want to explore other options."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdnZmSjVRRRAB",
            "text": "Really good food. I love the lamb leg stew here. The baba ghanoush is phenomenal. It went so well with hummus and the fresh, warm bread here. It’s a definitely must have. The Turkish tea was tasty as well. If there were any complaint, it’s that food size is big. It seems that one portion would be good for two people.\n(Below is an update)\nService here is wonderful. My husband and I came in with our baby today and waiters here were extremely accommodating. I appreciate this very much."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuc29DSkd3EAE",
            "text": "Amazing Persian food! The atmosphere was great, with lots of seating available and lovely ambiance. The staff were great as well! Large portions, free bread and sauce to start. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxeTVpclRREAE",
            "text": "This restaurant was highly recommended by some of the pickiest non-foodies I know. And it did not disappoint!\n\nThe food was delicious, fresh and full of flavours. I am a meat lover so having good beef quality and fresh is always top of mind when trying out new places. I can't emphasize it enough, the kebabs were tender and juicy to perfection!\nAnd entrée sizes were enormous.\n\nThe restaurant is gorgeous as well! Definitely worth at least one visit, if not regularly."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQcXJiSkRREAE",
            "text": "We visited this Persian restaurant and ordered the Soltani and Chicken Soltani. The koobideh was excellent and truly delicious, but the barg was just okay—it didn’t quite taste like authentic Persian barg. The chicken koobideh was decent, though it lacked the authentic Persian flavor. On the other hand, we really enjoyed the jujeh kabab. For our appetizer, we had ash reshteh, which was quite good.\n\nUnfortunately, our experience was overshadowed by the behavior of the hostess. They seemed to treat customers differently, and we found them to be super rude during our visit. This unprofessional attitude really detracted from the overall experience.\nI recommend other places especially with this price and atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3eklYbXh3RRAB",
            "text": "The food was amazing I love it. There food decorations and there serving style was really good, and the environment also good. And best thing was the food is halal❤️❤️. In one word is amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyOHVMWXBBRRAB",
            "text": "A solid five stars, this places serves up awesome Persian food in a nice casual environment. To start, their babaganoosh is one of the best I’ve had in a long time - they grill the eggplant which gives it an amazing smoky flavor which went perfectly with the bread. The barg kebabs we had were also excellent - tender with great flavor. Portions are generous though -one order along with a soup and starter was perfect for the two of us. I look forward to returning!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSc2VHM2JBEAE",
            "text": "As a local resident, I have had the pleasure of dining at Ravagh Persian Grill on several occasions, and I can confidently say that it's one of my favorite spots in the neighborhood. The atmosphere is warm and welcoming, and the food is simply amazing.\n\nWhat sets Ravagh apart from other Persian restaurants in the area is their kebab. It's simply out of this world! The meat is always cooked to perfection, juicy, and tender, with just the right amount of seasoning. The portions are generous, and you can always expect your dish to be served piping hot and fresh.\n\nIn addition to their amazing kebab, Ravagh also offers a variety of other Persian dishes that are equally impressive. Their stews and rice dishes are full of flavor, and the vegetarian options are equally delicious. And let's not forget about the fresh bread they serve, which is simply irresistible.\n\nThe staff at Ravagh are also incredibly friendly and attentive. They are always happy to provide recommendations and answer any questions you may have about the menu. The service is top-notch, and the staff always go above and beyond to ensure that your dining experience is enjoyable.\n\nOverall, if you're looking for a delicious Persian meal, I highly recommend Ravagh Persian Grill. Their kebab is simply amazing, and the other dishes are equally impressive. The warm and inviting atmosphere, combined with the friendly staff and great food, make this restaurant a must-visit in the neighborhood."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBM19fVkVnEAE",
            "text": "Awesome spot with delicious food and generous portions.\n\nCame here for lunch with my boyfriend. We started with the Mediterranean Chopped Lunch Salad—fresh and full of flavor.\n\nFor the main course, I had the Bronzini Lunch, while he went for the Sultani Kabob. Both came with aromatic rice and nicely grilled veggies. The fish was cooked perfectly, and the meat was super tender and juicy. Even the complimentary bread and dips were great, the wine was good too, no complaints. Lovely service. Definitely worth a visit!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREeDlUaG53RRAB",
            "text": "I started off Ash Reshteh soup ($13) which is a traditional Persian noodle soup with greens, chickpeas and kidney beans, topped with kashk (a type of onion). I found that it had little taste except for the slivered onion on top.  For my main course I had the lamb shank ($34), which was simmered with herbs and garlic, served with what they call green rice (pictured), which had a different and pleasing taste. I went to this restaurant after I found that this restaurant was listed on Google as having one of the best lamb shanks in the city, I agree, it was very flavorful."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURadWQ3Wm9RRRAB",
            "text": "It was our first time to  expirience Persian Cuisine Everything we order was delicious,flavorful .The staff was very attentive. The only downside was that it was so noisy. Restaurant was full. People,who didn't have reservations, were waiting. By the way I forgot to mention it was Monday.I wish every dish would come with a recipe card😋. I would highly recommend this place for someone who wants to expirience new flavors of authentic food."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NEo3QXJRRRAB",
            "text": "This place never disappoints. The staff is always friendly and attentive, and the food is consistently delicious. Every dish is carefully crafted, and you can taste the quality. Definitely the best persian food in the city. The atmosphere is vibrant yet cozy, making it an ideal spot for both a casual meal or a night out with friends."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4Z092Z2hBRRAB",
            "text": "Great place, huuuge portions, prices are regular if not low. Meat is tender and tasting fresh. I been there maybe 8 times, always enjoyed. Try their Sultani kabob, that gives you the best bounce for an ounce. Salads and appetizers are good too, they could be entire meal in itself."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKMlB0YWlEOHJLU0N3EAE",
            "text": "Absolutely loved this place. Food was beyond good. Will definitely be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoeHQtMVpREAE",
            "text": "Late Review - i visited this abt a few months ago. Food Portions are huge! The kebab as very juicy, however the lamb was a little dissapointing as it was way overdone, and the meat is a little dry.\n\nOther than that, the ambience is very nice.\n\nThe service was a miss and hit. They are alright but you will be rushed to finish your meal. I would say it’s a decent place to go for a date, but I’m not sure if I’ll like it if I’m being rushed to finish my date.\n\nWe had the chicken Sultani kebab with zheresk rice, Khoresh Bademjan with vege, a tiki tiki and Hendricks. Total 97.99."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPeHJHbnJnRRAB",
            "text": "Great Peruvian Mediterranean restaurant with good food, service and drinks. I've been here a few times in the past few years and it's had consistently great food and service. I always get the kebab- the lamb, steak/filet, and beef are all delicious!\n\nThe kebabs come with your choice of grilled vegetables, rice, or French fries. We got all 3 and the veggies were my favorite 😍 the bread served with the babaganoush is delicious\n\nI love the outdoor seating next to the flowers 🌻"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1c2N6UFBnEAE",
            "text": "Amazingly delicious food, especially the khoresh fesenjan (chicken in pomegranate sauce) with the rice with tangy barberries. Our servers were very attentive (but the host who greeted me wasn’t). Perfectly fine modern ambiance with nice middle eastern music."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bWRIbm93RRAB",
            "text": "The food was DELICIOUS!!! They were attentive servers, but didn't push us out. My favorite was the chicken kabob with specialty rice, it had barberries and saffron! So yummy. We had Persian food in another city and wanted to see if we could find some in Manhattan. My mom and I shared yummy baklava and my husband had lemon sorbet in the lemon shell. He didn't leave any left."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NHFPSFFBEAE",
            "text": "I tried several Persian food restaurants in different places and this one is no less than them. It is a good restaurant with good food and service. We tried the beef and lamb kebab and the beef was better in taste. The lamb was a little spicy but overall both were delicious! The starter was traditional eggplant and was excellent."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxejdyNG1nRRAB",
            "text": "100% Halal and Delicious. The combination platter was the best option because it has a few selections but for the portion given it is pricey, I guess that’s what the city rates are. The chicken platter was good too but a bit bland for me.…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzd0w3dWlnRRAB",
            "text": "A quaint and charming gem in the Lower East Side. Fantastic service and not overly crowded which made for a perfect atmosphere for a romantic dinner. Impeccable service where the waitstaff was not too intrusive but also not aloof to the…"
        }
    ],
    "reviews_count": 75
}