{
    "name": "Avoca",
    "place_id": "ChIJDe3ctJVZwokRE3GOfnRJQtI",
    "grid": "MN8",
    "address": "1678 1st Ave, New York, NY 10128, USA",
    "rating": 4.8,
    "user_ratings_total": 1734,
    "phone_number": "(212) 202-0140",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRNWFubFVibmRMZDBsYVlqWnNaMHhoY1VGQ1drRRAB",
            "text": "Recently hosted a birthday event at Avoca and it was fantastic. Great service, great prices, and great vibe. All my guests had the best time. I’m also a regular at Avoca for dinner and brunch and would highly recommend!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMVdEWTRMVUpEUjNadFdIQjFibTVUV1V4R1IxRRAB",
            "text": "Jordan made our event over and above what we expected. This music was great, the energy was high, but the service made sure our night exactly what we planned it to be. They cleared our reserved space from another group that had encroached graciously and without conflict, and made sure we were well taken care of all night. Couldn’t have asked for a better experience, much appreciated y’all."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1VVNrcHdTbTE0TTFWcldGTk9TWE5VVDBwSFpFRRAB",
            "text": "We had a great time and thoroughly enjoyed being at Avoca. We had a large group, and a lot of people commented that they had hoped to check it out some time, so were glad to get a chance to do so. We appreciated the kind server, the excellent drinks, and enjoyable atmosphere. We were worried it would be too hot on the patio (this was in July) but as the evening went on it became quite enjoyable. Thank you for hosting our group and maintaining a great spot on the UES! I know that myself and my husband will be back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUlZtZGpiRXRuU1hCQlVEUmxPVlJTTlhWQlZtYxAB",
            "text": "I hosted a happy hour for the parents (and kids) of my son’s class this past weekend. Everything from planning the event with Rory to the service, food and drinks were perfect. Our friends kept commenting on how great the back patio space was and everyone enjoyed their food and drinks as well. I would highly recommend Avoca for events or even just a dinner out!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205bFV6TmpVbTF3ZW01T2NYRlhUM0pFU1daQmRtYxAB",
            "text": "We had our engagement party here in the back outside room. Everything was really great, it was easy to work with Rory to get the event set up and the wait staff was really attentive and friendly."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSWVURkdabUpTUm5WWWFXdG9UQzF5Y3pKTE5HYxAB",
            "text": "I love this place! Such a perfect local spot. It’s got a lovely ambiance, it’s dog-friendly for their outdoor and back patio spaces, and a great space overall. Their cocktails are fantastic and food is good (the dipping sauce they serve with their soft pretzel is excellent). I took my mom for brunch for Mother’s Day and she loved it as well. Their customer service is also unparalleled. I contacted them last minute about having birthday drinks there and they were able to accommodate no problem and even held a good sized bar table and space despite my delayed confirmation. They were so accommodating when we arrived, and let us order from the bar which is rare when you reserve a space or table. Everyone is so nice there and we met the owner who is lovely. I’m back there for brunch tomorrow!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1TVoyMXViVTlWWnpCMU9VdFRVbHBXZVRaWlNIYxAB",
            "text": "Amazing drink deals + friendliest staff! Also great spot to bring your pup, they have 2 patios"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swNFRVY3ROa2hhTUZWak0xSk5OelJuV0ZBMFVIYxAB",
            "text": "Great burger and happy hour! Zoey was awesome!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcVMyc3hkR05vWkRCQlNuRjVZVTV1ZGt0MU5GRRAB",
            "text": "I had my birthday party in the back patio and it was the best decision!! The place is really nice, specially the patio! The staff is beyond amazing and with the BEST attitude! The food was also great as well as the variety of drinks! Kevin was our waiter and was simply the best like the rest of the staff! And last but not least Rory, the owner, was always responsive and accommodating throughout the whole process!\nThanks Avoca for the best birthday party!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wd1VtMUpjMHR3TUc0NWVFNUhOMjl3WXpCeGIwRRAB",
            "text": "Awesome place and environment. Best staff"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKS1UzVjNlRXcxUmxCSVpUbEZhME5mZEZOUGFVRRAB",
            "text": "Yummy food and a lovely time!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKMlozRlZVRkZ1Y0dKWlEzVm9ORU5JUlZsZldWRRAB",
            "text": "We came here because of the high rate on google and we can really understand it… great drinks, great atmosphere and Rorry is the best!!!!\nThank you for an amazing night"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCbExWQlJTVWR4UVcwNFVHWXdkeTFqUXpCdllVRRAB",
            "text": "The Best Bar and Drinks"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OYWJ6aFpkM1l5ZFVOSmRXZHJNQzE1Y1dKUmNGRRAB",
            "text": "I did my birthday at Avoca for the second time, and it was just amazing! The staff was so attentive, kind, and helpful. The space was very clean - and spacious. The food and drinks were delicious. I would 100% recommend this place for an event!!"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6eXQ3Um1nRRAB",
            "text": "Terrible burger. Low grade meat, frozen n cooked like crap. Inattentive staff that knows nothing about their beers. I gave them two chances. Fail. So far, every business at them is location failed over the last 20 years. No surprise."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214TmFYcHVXVzg0V210a2JXRjFkbFZWTWxSTk9FRRAB",
            "text": "Did not eat....the music was too loud. Nice interior and staff. But could not stay because of the noise."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KblgyZDRlSFZsTm5SUVFXSnRlVGRJV1hScVZGRRAB",
            "text": "reserved the back patio for a birthday/surprise engagement party and it was wonderful!! rory was lovely and so was the food, drinks, and service! 50 people fit comfortably and everyone had a great time!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4ek9FVTFMWE5pUTFod09IWXRiMDFCWW1reVZGRRAB",
            "text": "Great local spot, amazing atmosphere, food was good and drinks were great."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SdVN6WllUMGh4VFdwclNXNVdPVzVzWlMwMVgzYxAB",
            "text": "Kevin was the best, great service so much patience and very family friendly. Our dog was treated so well. I will be here every weekend!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMWRtOU5aWFpRWkdGWE1uY3lOWEZXWTNJNVpYYxAB",
            "text": "We had our engagement party in the garden yesterday and it was a dream! Had it reserved for 3 hours, a perfect space for our group of 40 people. The servers were excellent and drinks came quickly. Everyone was happy with the platters of food and heard from a ton of people how good they thought the food was. No charge to bring in our own cake, and the staff was helpful in letting us drop off some decorations earlier in the day to store there and then put out. At the end of our 3 hours of reserved party time, they moved us inside with the remaining food and gave us space to continue eating/drinking for those who weren't ready to leave yet. Rory the owner is also wonderful to work with. Highly recommend having an event here!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKQ1NUVlZVVms1WW5adlgyUTJURWxYWVZodmRuYxAB",
            "text": "I hosted my 35th birthday at Avoca recently and it was such a fabulous experience! Rory did an excellent job in coordinating food for the event. Staff were also super welcoming. Loved getting to have a pup present as well! Don't walk...run to have your next event at Avoca!! I promise you won't be sorry"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0NGVDMXpXa0pQY0hCaWVVZGxaakpTWlVaMVpIYxAB",
            "text": "Our small group had a great time in the back patio. The drinks were great, the chicken fingers, sliders and pigs in a blanket were all hits and the desserts were delicious too.  Even the music playing was perfect. Will be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVWEyeENaVWx2ZWtKdE5uUkVkell5Y0U0eVYwRRAB",
            "text": "Amazing place ,service great, delicious food ,Rory thanks for welcoming us , definitely will return ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4V1JHNDJTVUowYmxjd05XbFNkemRhZFd4M1kxRRAB",
            "text": "my coworkers and i enjoyed the ambiance! thank u Rory for welcoming us👍🏽definitely coming back . food is a A+."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1MVgzTlFVbEZYTFV4WVpqQmtTbU5MUTBWTGNVRRAB",
            "text": "Can't wait to be served again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toRU1XTk1Sbmg1T0dWaWFHTlNXWHB2YzNSV01YYxAB",
            "text": "ZOE AND MERIT WERE THE BEST!!! 10/10 service would have left if it weren’t for them!! We had an annoying situation with weather and they handled it with ease. Literally top tier girlies!! Go here for good service, good food, and good drink prices !!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5c2FGQlRPVkJCTWpOMk4ycGtaSEJXU2s1S2VYYxAB",
            "text": "Zoey and merit are the best. We would have left if it was not to them."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMU5FNDBObGR6UjI5aWEyVTJiV0ZOYVVONGFXYxAB",
            "text": "Love the food here! My usual brunch spot👀 hidden gem !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxQ2QycGZlRlJIWkRaR1VEZFJURlZvWVRodVdtYxAB",
            "text": "Hate to do this but when my girlfriend and I walked in around 11:15 on Saturday with my two dogs and they gave us a table that could barely fit 2 person so I asked if we can take a table slightly bigger and she told me it’s the store policy and I had to take the small table. I looked around and we were the only ones so I asked her again and she said “it’s not up to me” shrugged her shoulders and that was that. I guess I was asking for too much.\nI finished my brunch near by and when we walked by this restaurant again I still didn’t see anyone at the restaurant."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SmNuSkVVVVJQZDNob1VYbHJNVFJpVFZOSWRHYxAB",
            "text": "Everything was delicious,, truffle French fries is to die for, drinks were AMAZING and thank you Josh and Kevin 🫶😊 , super  SWEET  and professional.  Thank you !!! ❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VM2VURndOVUpDV25oM1lWSkNiSEJtU25oR1duYxAB",
            "text": "A great neighborhood bar if you are a local of yorkville this is a great place to have a technical stop before heading home for a good drink. A good range of whiskey."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWYU9YaFZUMHhsVjNWMVoyVm1OMEpXTm1kRVYxRRAB",
            "text": "Great spot in UES! We brought a party of 30 people here and they were very accommodating. Rory the owner is great"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200eFNrRkNlVXhLWmxGelVrbHRibEpNVkhCamNtYxAB",
            "text": "I had my birthday party on the back patio at Avoca last weekend, and it was so great! The food, drinks and service (and playlist!) were excellent. It was the perfect amount of space for the group — we were 25 people but there was room for probably double that. There was no cover charge or minimum to reach for our numbers. I preordered some platters of food for the group which were delicious and actually pretty huge! We were having so much fun that we moved inside to the bar to continue the night. Can’t wait to go back for a more lowkey dinner soon!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toQ05rb3RjRGxhYzBGME1XZHRZa0pDVEhwdVgxRRAB",
            "text": "We had a great time as Avoca. It’s been a local spot that’s been open for a few years but this was our first time going.\n\nAmbiance: We sat outside as the weather was really nice and Avoca has great outdoor seating. We sat in the front - they have a nice section where you can feel like you’re part of the street crowd but also semi private. Note: They also have a garden patio in the back in case front seating is full.\n\nFood/Drinks: We got mocktails and NA beer. I loved that the menu clearly stated which cocktails could be made into a mocktail. They were also willing to work with our flavor profile and make us a mocktail based on what we wanted.\nFor food, we got the fried mushroom. It was pretty good and the sauce was a nice compliment for it. I do wish the mushroom was cut to smaller sizes - it would have allowed for less breading and a crispier fry. We also got the curry cauliflower - unfortunately, it was disappointing for us. It felt way too sour and there wasn’t a lot of flavor to it other than that. The truffle fries were really good and a great snack.\n\nService: Everyone was friendly and nice. We sat there for about 3 hours and they didn’t rush us. They came and checked on us often.\n\nPrice: Everything was reasonable priced. Mocktails were about $10 which I think is a fair price. The appetizers were also priced well especially for the portion size.\n\nInsta: @TheShahLALand"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twYWRGTjFlRU5CVldzNVZUWkhaRlZDYjJ4MVUwRRAB",
            "text": "What a cool n fun bar this is and dog friendly too… food….. typically what you would expect at a bar, no frills."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aR1RVdDFia3g2YUhoRWRGRjNURmR6U0V0UE9WRRAB",
            "text": "Had a birthday party in the back garden with about 20 people. Backyard area was very pretty and a comfortable size for our group. Staff were super friendly and accommodating, food was great, and overall a really positive experience!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGRk1UQnRPSGhyYlVaT2FrTkNMVVJsWlhwMmMwRRAB",
            "text": "I went here for brunch. It was nice and offered a large menu but didn't have many vegan options. A bit overpriced for the meal I ended up getting."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sV0xWTlpPRkZzU0dvd2RtMDFlRVpNVDI1c1VsRRAB",
            "text": "I booked my 30th birthday at Avoca and had an amazing experience. The service, drinks, and food was awesome. The back patio was spacious and set up perfectly! Rory was very helpful ahead of the event. I highly recommend having any event here."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KdFptazNPVE5yWlV4NkxXSXlTRk5XTVROT2RtYxAB",
            "text": "Trendy\nMake reservations!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVmQyb3djVFZpTUZsamJGVnVXWEY1WDFBeUxWRRAB",
            "text": "i think this spot has become too popular for it's own good. for starters, the music is super loud and the wait times can be long. however, if getting wasted in a nice environment is your weekend vibe, this place is a great pick!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25adFUxOVZPREJvYTBsVWVXcHlibEJtVW5CNmIwRRAB",
            "text": "Had a party here with about 50 people. Great vibes and atmosphere. Staff was so friendly and helpful!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxMlVtdGlNVGhPV1hkT2NVWk9VRkl3ZVZjeFRIYxAB",
            "text": "We had a fantastic time celebrating my boyfriend’s surprise birthday party here! The staff was incredibly friendly, attentive, and made us feel very welcome. It’s a great spot for a fun and memorable celebration with friends. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaWVJsSnZSR3hUYW5keGNISlRUM1ZhWmtGMldsRRAB",
            "text": "Hosted a birthday party here for around 50 people in the patio space. Staff were so incredibly helpful and accommodating and the space was fantastic and very nicely decorated. Highly recommend for a party space."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xocmJqUTBORU50TTJKTVJWcGthRmxVZFRZM1UyYxAB",
            "text": "This place was perfect for a gathering in their backdoor patio for my 30th birthday. Great drinks, good food options. Perfect way to spend a summer evening."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUVUwWnhSMVpLYTFOb2NtVXRkSEF3T0dWblFtYxAB",
            "text": "Avoca Bar is a hidden gem! The atmosphere is cozy and intimate, with a warm and inviting decor that makes you feel right at home. The staff is friendly and attentive, and a special shoutout to Dylan the bartender - he's a top bloke! The Guinness is always poured to perfection, and the burger is hands down the best I've had in NYC. Whether you're meeting friends for a night out or enjoying a romantic evening with someone special, Avoca Bar is the perfect spot. Highly recommend!\" 5/5 stars."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVE0zaE1TMkpyUVVGelpUVnVaRUpQWDJob1NWRRAB",
            "text": "Rory and the team at Avoca are incredible. This place goes beyond dog friendly - they go above and beyond for your dog. They brought our dog a dog bed, water bowl and a treat. Rory moved a table to accommodate us as our dog wouldn't fit next to the table where it was originally set up. The burger is incredible and the cocktails/mocktails are great. This will definitely be our new go to neighborhood spot. They deserve all the amazing reviews. Their service is one of the best experiences I have had in NYC."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4M1REWnZSVXhzY1VsZmNqWjRRVkIzYkRoSWExRRAB",
            "text": "Ilene Louise and katie and twenty are awesome ! Took great care of us and have great senses of humor! Awesome food and cocktails!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGcU1GaHJORlV5WjJGNWRtdEtSV0V6TmxWdk1rRRAB",
            "text": "Love this place! 10 out of 10 highly recommend! Food is great, the server was so lovely and the owner himself comes out to greet you! We did bottomless and it was def worth it. Green machine drink is so good if you like coconut,"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1YWNsVkZTbXR1VGpOd1NtSXRNelZDU0dGbmJXYxAB",
            "text": "Sophie was amazing!! Best server!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQck82SlQyNjlYRVpREAE",
            "text": "Such an amazing experience at Avoca! The food was delicious, especially the chicken sandwich🤩 The drinks were fab, and our server Sophie couldn’t have been better! Will definitely be back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNZXNpLVdHeU5uU3hRRRAB",
            "text": "As someone who loves a good deal in the city, this girl dinner was such an amazing experience and time all thanks to TikTok ! Me and my best friend loved the pricing(✨35 dollar GirlDinner✨), the food, and the drinks were tasty! The staff were so friendly and welcoming! My biggest green flag was that this was a dog friendly bar which holds a special place in my heart!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJck0zQkpnEAE",
            "text": "First of all Giovanni was AMAZING as our waiter! The food was fresh and extremely tasteful. I had the scallops with the butternut risotto and I was so impressed by the risotto alone! Definitely coming back for bottomlesss dinner!!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcF9HUUp3EAE",
            "text": "The food and drinks were phenomenal. Our server, Giovanni, gave us fantastic recommendations. I ended up getting the seared scallops that he recommended and it's now one of my favorite dishes ever. Giovanni is also such a funny and charismatic person. Will definitely come back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3OEl1NWh3RRAB",
            "text": "Avoca was good but nothing blew me away.\n\nThe food tasted fine and their menu has enough variety although it can leave you wanting a little more.\n\nMy only complaint is that I ordered their Avoca “Smash” Burger only to receive a regular double patty burger with barely melted cheese. Had I’d known it wasn’t a smash burger I would have stated my cook temperature as the patties were a little too close to well done for my liking.\n\nThe chicken fried mushrooms were a nice dish that I would recommend as a shared appetizer for a table.\n\nNot sure if I would venture back for dinner, maybe a brunch one weekend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENDVxVW9RRRAB",
            "text": "Lucy and the team were absolutely amazing! Didn’t rush us with our bottomless brunch either. Food 10/10 drinks 10/10 atmosphere 10/10 and they let you bring your dog here! Can any place be better?!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINWJ2R0p3EAE",
            "text": "Came on a Tuesday night around 7:00 and we were seated right away! The service was great, our waiter was really nice and the food came out very fast.\n\nAppetizers were fair. The elote corn was really yummy, but insanely overpriced for corn with cheese and mayo on it (like $16 for that?? at least give us a really large portion). We also got the Buffalo chicken dip which was pretty tasty, but again really overpriced at almost $20. They tasted fine, for the price we expected to be blown away.\n\nPassionfruit mojito was yummy but REALLY sweet and tasted like artificial oranges a little bit. I got the spaghetti bolognese which was outstanding! Boyfriend got a burger (he couldn’t wait to eat before I took a picture) which he said was fairly good, but lacked a lot of flavor.\nHis burger came with truffle fries (extra 2$ but whatever) which were chefs kiss 🤌🏼\n\n3 stars for the food but 5 stars for the service, so I’ll leave it at 4. This wouldn’t be my very first choice in the area, but it was pretty fair."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3XzVIem1BRRAB",
            "text": "Great, dog-friendly (and I mean REALLY dog friendly; they have a terrific menu for dogs as well) gastropub with an interesting menu and great drink offerings, especially during happy hour . Our server, Emily, was friendly and very accommodating , one of the reasons we are returning for the third time in ten days! We went on Taco Tuesday and had three tacos for $10, the Caesar salad was delicious, but the reason we are coming back again is the Elote— the Mexican street corn is amazing, and they serve it on the  cob, dusted with cheese and seasoned to perfection. Yum!!\nMusic is great as well—love to hear a Hozier  song over an aperol spritz!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMThfQTBnRRAB",
            "text": "My best friend and I came for bottomless brunch, we had margaritas the whole time they were GREAT. We are used to margaritas for brunch so we would definitely recommend these. I had the tres golpes that was amazing. We will definitely be back to try new dishes! Natalie was the best server and we will be requesting her the next time we come!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQM29IOXZ3RRAB",
            "text": "Went for a brunch on a Saturday. Had a reservation but was running late, on calling them they assured that they will seat the guests who arrive before, i think that was very nice of them. Food options were quite good. I had the Ceaser Salad with grilled chicken, portion was good and food was tasty. I had the Fall Mimosa and Brunch Punch. Both the drinks were nice. All in all it was a good experience. Will definitely visit in summer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6anNMX3pRRRAB",
            "text": "My friend and I visited Avoca for a Saturday brunch, and it was fantastic. While there was a wait for the outdoor dining area, we found a table indoors without a problem. My friend ordered the EGG SLUTT, and I had the AVOCA EGG WHITE SMASH. I absolutely loved my egg white smash sandwich, especially the breakfast potatoes, which were cut into wedges and seasoned with special spices.\n\nThe service was excellent, and the ambiance was laid-back and not too loud, making it a perfect spot for a relaxed brunch. It’s definitely a good idea to make a reservation, as the place was almost full by the time we finished. Overall, Avoca is a great place for a decent brunch."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncHJMQmpnRRAB",
            "text": "Went to Avoca for their Gossip Girl Dinner! It was a great time and highly recommend. Our waiter Giovani took care of us our entire time. We will deff be back"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3N3ZQSUhnEAE",
            "text": "Such a great local place for happy hour! Taco Tuesdays and margaritas are a must! Can't wait to go back and bring my pup for a brunch! Will definitely come back again soon. Thanks Rory!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMS1lyX1hCbWZiY21BRRAB",
            "text": "Huge shoutout to Rory, Joe (bartender), Eileen, the hostess, and the entire staff for making my grad party absolutely unforgettable! If you're planning an event, you have to check this place out. The team is incredibly accommodating and truly goes above and beyond to make your day feel special. The cocktails and food were amazing!! I’m recommending this spot to everyone I know. Thank you so much!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKNE1Qd2NREAE",
            "text": "Such a cute spot with really good music! We sat in the backyard patio, at 2:30pm, that’s covered but you still get fresh air and a little sunlight. It’s practically summer so there were a number of mosquitos and small flies about but not enough to ruin our meal. We got 3(or 4) rounds of drinks, truffle fries, eggs and two entrées. I was able to have them remove the yogurt from the French toast since I’m allergic. The staff was super nice and the food/drink came a little slow at first because it was rush hour but then arrived at a reasonable pace as time went on. The drinks were reasonably strong and BERY good! Such fun options and the food was also very good!\nI’d definitely dine again but do bottomless brunch next time which is $29 extra for 90mins."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdHMybUV3EAE",
            "text": "Eileen slayed with all of the service. She deserves a raise. The food was well prepared, maybe slightly overpriced but still a good deal for bottomless brunch. Eileeen was attentive and great. I’d come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURELTlLTVlBEAE",
            "text": "This restaurant has become our new favorite! The customer service has been top-notch from the beginning. Our waitress was super nice and deserves a raise or promotion because she really made our day (she’s in the video). The food was amazing with lots of great options to choose from. It's also a super dog-friendly place for brunch, offering dog beds and water bowls, as well as a dog menu! Overall, we rate this place 15/10—it's just that good, especially the service! 👏🏼"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiLU0ySG1nRRAB",
            "text": "Giovani was our server for a lovely date night here in the UES. Smiles, great service, food was amazing, cocktails lovely and very well priced. Will be coming back!\n\nPro tip: the caramel toffee cake had other folks around us excited and it didn’t disappoint!\n\nCan’t wait to come back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaHZmVDRRRRAB",
            "text": "Thankfully, my friend and I stopped in here for cocktails after having a late lunch. I love the atmosphere in here, it has good music, a great happy hour deal, and fire margaritas! Thank you for the great service, we’ll be back for sure and try out the food next!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMbzZpX2VnEAE",
            "text": "THE CUTEST PUP FRIENDLY PLACE!\nPup has the mutt loaf and devoured it\nEvery server was so so nice!! Rory, Gio and both ladies were super helpful make sure my pup was cool on a hot summer day!! Provided a pad to lay and cold water!! Highly recommend! Drinks were great too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6NXBMcG5nRRAB",
            "text": "Food was incredible! Highly recommend the egg white smash. Our server, Sedona, was so lovely. She was on top on our service and made sure we were good the whole time. 10/10."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwM09xM1p3EAE",
            "text": "I recently visited this place for brunch based on the hype on Instagram and I must say the hype was not there. It wasn't bad nor was it good. A good boozy brunch each drink should be freshly made not from the tap. At times it took time for me to get my waiters attention, but he was super nice. The food was just okay. Would I revisit? No."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnM3Izbm13RRAB",
            "text": "Best happy hour on the UES. Great wine. Great giant pretzels AND cheese (I’m very picky so this is important). Giovanni was also the best server and was so kind and hospitable to us. This will be our new happy hour spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6b0ktQUR3EAE",
            "text": "Cool neighborhood spot for a happy hour or to hang out with friends. It’s chill, good drinks & service, especially Judy she’s so sweet. I really like their margaritas - strong and tasty! They also have various specials every day - taco Tue, Burger night, girls night to enjoy unlimited drinks 4-10pm which I have yet to try out."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOVDIwdEsybTYtSnpnRRAB",
            "text": "Went to Avoca this past Friday evening - best bar ever! The female bartender was hilarious! Super cool and very accommodating to my partner with allergies (and, who I think is super picky lol). Amazing spicy margaritas, espresso martinis, and more!! She took great care of us and had us cracking up the whole time - will definitely be back soon, just hope she’s working when we do! Avoca is the spot to be"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJc29XMUR3EAE",
            "text": "YES GIOVANNI HAIRRRR. Okay look. You need to come here. Yes that’s what I said. Get the following: double bet (bourbon cocktail), curry roasted cauliflower (ty Giovanni rec) and SEARED SCALLOPS (get it Giovanni rec). Coming back and getting the same things. Wonderful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNE5EeDRBRRAB",
            "text": "I came here for the first time and the food and drinks were excellent. I’m a big fan of Gossiptini and our server Giovanni took great care of us. Would definitely recommend and would certainly come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGcThlZWN3EAE",
            "text": "Weirdly enough, although we’ve heard a lot about this place, when we went it was completely EMPTY 🤨 (see pictures) the food was good and service was great but atmosphere just wasn’t what we were expecting at all. Bottomless brunch deal is not the best I’ve seen but similar to others in Manhattan. Overall would go back but during a different time of day to see if we have better luck for ambiance"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMjdmeEd3EAE",
            "text": "I wanted to gate keep this place so badly!!\nLiterally one of my favorite spots of all times!!! I hosted an event tonight and they creative a QR code for my guests!\nThe staff was so welcoming and so kind and generous!!! I am so lucky to be able to come here and have such good service!!\nAlso dog friendly!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMS1ctT3pFd2ZmYWVnEAE",
            "text": "We had my daughter's 25th birthday surprise party in the back room at Avoca and it was FABULOUS! Everything about the experience was a 10! Working with Rory in the planning of it and the service was amazing on the night thanks to Keith. We ordered platters of food which were devoured and the overall vibe was just great. We brought in balloons and a banner and a cake and they accommodated and were super helpful with all of it. I HIGHLY recommend having a party here !"
        }
    ],
    "reviews_count": 79
}