{
    "name": "da Adriano",
    "place_id": "ChIJU0dUbtNZwokRvLMgVDaVuA0",
    "grid": "MN8",
    "address": "1198 1st Ave, New York, NY 10065, USA",
    "rating": 4.8,
    "user_ratings_total": 284,
    "phone_number": "(646) 371-9412",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKR1lVcG1NbmhsVWxCc2FVUldlblU1UWxObVZGRRAB",
            "text": "We didn’t have a reservation around 11am on Marathon Sunday but the team moved things around to squeeze us in. Such lovely service and delectable dishes (we had the omelette and pancakes which were both 🤌🏼🤌🏼).\nThe fresh flowers on each table and clean / well decorated restroom were the cherry on top!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsc1gxaFVOV1l3VjFOcFVEaFdMVWwxVEc0dFNYYxAB",
            "text": "Super cozy place! Amazing italian food made by chefs who know what they are doing. Had the classic spaghetti pasta!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kYVVuZHRZVEJVWVVkZlVqbHJRMGxWWlRSc2NuYxAB",
            "text": "I like the fact that in Manhattan one can find a good place to eat an authentic Italian meal anytime of the day, fresh pasta. friendly people."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KYWVISlZNemg2VVhKVFgyeEJTa2hXWWkxSk5FRRAB",
            "text": "Nice homemade pizza.\nGiovanni was great"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sVE5sSldiRkJtU1Rsd1NWbFdVamh6ZEhwR00zYxAB",
            "text": "This is a cozy Italian restaurant has authentic dishes! Pastas were very fresh, and breads as well. The space is itself is quite small, but its a kid-friendly restaurant!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSWVVaEVYMFUxTWtjNVNFVmtkMUF0WDBJdFdYYxAB",
            "text": "Adriano is a wonderful restaurant. He brings a personal touch to his service and the business. We are so lucky to have you in the neighborhood!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkZlRqZENTbmRzVFhNdE4xWldUMGhWTld0NmJHYxAB",
            "text": "I can't stop telling people how much I enjoy eating here. The taste quality shines through. The complete staff handles special requests well. The meals taste wonderful, servers work efficiently, and staff members treat you well. Wonderful food, prompt service, and incredibly nice workers!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oelVWVjBZV2ROUTB0NmJEZERkREpuUWtwSk1uYxAB",
            "text": "We just moved into the neighborhood and this was the first restaurant we tried. It was outstanding. The food is excellent and the service is wonderful. We will most definitely be regulars here. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214blkxcGFkSEl3ZW5SU1EzbEZTblZXWm1WR1RGRRAB",
            "text": "A perfect lunch spot on the Upper East side. Everything we ate was off the charts! Presentation, quality of food, preparation and taste were outstanding. A must go place."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMk5hTEZ3EAE",
            "text": "This was already my favorite restaurant but we had them cater our bridal shower over the weekend and everyone was blown away. We told them how many people and they provided plenty of food and it was so delicious. Everyone was raving about it, they were so kind and helpful. Will continue eating here as well as have them cater for us again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkQlNXUlNYMmxXUXkxVllWZEhjbE5FTUdOTWNIYxAB",
            "text": "Delicious food, perfect ambiance."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWVJUVlBjakYyWkVkclVuUnlNMEZqY0UxNmMzYxAB",
            "text": "I’m usually not a fan of Aperol Spritz, but the one here completely changed my mind. Perfectly balanced, refreshing, and honestly one of the best I’ve had. The staff is also incredibly kind and welcoming, which makes the whole experience even better. Highly recommend this place!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wUlIxQkdPVlJzZGpVNVZsbzNiSGRTUjI1VVlYYxAB",
            "text": "Really fantastic restaurant. Everything is incredible. After the first time I went (for dinner), I had to return for brunch barely 12 hours later. It's that good. Truly a step (or multiple steps) above any Italian I've had in Manhattan in recent memory. Can't wait for my next visit!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oNFV6UmtRakpYTUdWNFdFWklNbGxmUTFneFUyYxAB",
            "text": "Incredibly kind and attentive staff. Meal was excellent. Overall delightful experience. Will definitely be coming back to dine here!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOU2JHNTZSbXRmWm5GWE16QjRiRzlHVjE4dGJuYxAB",
            "text": "A little cute and cozy place. The food was great plus the ambiance was super nice and cozy. Lasagna was delicious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214UVUyNXpha290ZFdSS2NsbG9aR0p3UWpWeVFrRRAB",
            "text": "There are many Italian restaurants in this neighborhood but only one has Alex as a server. The food at da Adriano is excellent - think grandma’s home style cooking in an elevated, cozy environment. However, it’s Alex who truly elevates the entire dining experience. This man is a natural at service and hospitality. He’s friendly, attentive, and genuinely kind. You don’t feel any pressure from him, and small talk between dishes flows naturally. As long as Alex is there, we’ll keep coming back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dmIwWTNWVXBMZHpkeFoyWndURlpxWXpoWWFXYxAB",
            "text": "My friend picked me up a Caesar salad to go from here and I have to say it was the best to-go caesar salad I’ve ever had. And I’ve had a lot. Beautiful green leaves of lettuce, finely grated parmesan, true Caesar dressing with anchovy, and, laid delicately across the top, three delicious filets of anchovy.\n\nHonestly I was shocked, most to-go Caesars are middling at best. This was superb."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWemMyY3RlRFp1V1RSdlpFOUlVVjlrYTBsSlZrRRAB",
            "text": "Excellent Italian restaurant ! I happen to go every Friday there and it will be MY first choice for lunch . I had a delicious steak cooked exactly as I wanted ! The service was excellent! Waiters are very polite and hospitable . I will be back so as to try the other delicious food they offer . Pasta and fish seem amazing too !!\nGreat coffee  and a delicious selection of desserts."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkYU9XNUxka0Y1UmxGelVHRkRUR3gyT0c1d1JWRRAB",
            "text": "This tiny spot on the Upper West Side has great authentic italian food and wines, recommend reservations, they have outside seating in warmer months, not for large groups, nice and intimate. Adriano is an excellent host for my going away dinner."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTldHUklNMnh1VUVFeE5USnJlVFpxV21RdFFrRRAB",
            "text": "Some of the best Italian food outside of Italy."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4emNFSjJhVm95VTNkQlFqaFViazE1V201a2EwRRAB",
            "text": "The chicken was served in a puddle of lukewarm water (what I assume was the “sauce”); the cut of the meat was gamey and left me feeling sick. The prosciutto and mozzarella was surely bought from the grocery store across the street, so in hindsight I wish I paid a grocery store price for it. The service was bizarre to say the least. We waited forever to be served, and we were handed an empty checkbook instead of a wine menu. The waiter shrugged and starred at us awkwardly after what seemed to be a painstaking regurgitation of the day’s specials. I won’t be returning."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WNWJ6YzJibEpoU1VwQ1JGRmhibEZSUjNWcWJWRRAB",
            "text": "Excellent overall: delicious pasta and our server was attentive and a genuinely nice human (he called when someone in our group left behind a handbag after dinner). Charmingly small  restaurant with outside seating too. We'd definitely return."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkQlJ5MVdSMVpNVkZCYWRIWnhXa3B5VDJ0NVdYYxAB",
            "text": "Quaint little Italian cafe with phenomenal food. Probably my favorite Italian in the city. The caprese focaccia is delicious, the bread has perfect balance of crispy on the outside soft on the inside with the lightest touch of olive oil and salt, and the cheese and vegetables are always fresh and delicious. The gnocchi pesto with straciatella\nis absolutely divine, as our most all of their pasta dishes. You must try the pine nut cookies when you’re here. You really can’t go wrong with anything on the menu highly recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OTldXMVphMWhmYjJWaFdrbENVbTFJV25vMlRGRRAB",
            "text": "Homey Italian restaurant that actually feels like you’re eating in Italy. Everything is delicious. I constantly crave the gazpacho."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GQlFXOWFYME5GVFRoaE5rZ3dVRE5uYmpaaVNYYxAB",
            "text": "An absolute can’t miss spot, best Italian coffee and pastries on the Upper East Side"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkaFVESkdTMmwyWkZSR2MwNDNjWFI2VURCaVMyYxAB",
            "text": "I just noticed that this place offers breakfast, and was able to try it yesterday. I was impressed! Really enjoyed the omelette, and the decor and atmosphere was pleasant. Definitely has a European vibe to it. Free refills on the coffee would have made it perfect, but otherwise a 5 out of 5 experience!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFeFZVbHFWRXhvTVVKZlVVMVhVWEEzYkZwRVEwRRAB",
            "text": "Great place ! Maki was great to us ! Food delicious!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMdXAxTkRSbVpTbWdRRRAB",
            "text": "I stumbled upon this cozy dining spot a while back after a doctor appointment in the area. Since then, I’ve been back for lunch and dinner. The food was fantastic each time. The service is always friendly and top notch. You can really see how the owners take great care in their food and customers. My favorite dishes included the lasagna and the lentil salad. The wine was also excellent. Although I do not live in the area, I will be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJRG1sNnZXMjV2bUVREAE",
            "text": "as an italian man i know coffee. This is not good coffee. And the croissant? Those burnt, stale pieces of pseudo bread should not carry the name Croissant. Respect the French.\n\nNice shop though."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMFNuaGlWWGg1Uld4VlMzUmhOVTQyV25kNmJrRRAB",
            "text": "Da Adriano serves the most sincere food.\nLove and care goes in to every dish. The food, wine, and service are all full of care.  They care about the neighborhood and the people they serve."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJRDFqWlg3bkxEdUFnEAE",
            "text": "Excellent food and service. You can tell they really care. Feels like a family owned/operated situation."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJYjk3NVhWZ1lPbkN3EAE",
            "text": "Absolutely amazing Lasagna. Terrific atmosphere. Highly recommended."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNM3Z5b3JObFl6TmVREAE",
            "text": "My second time at De Adriano. What an experience, from great personal service with the waiter from Tuscany to incredible food, we had a blast! I can’t wait to bring all my friends here"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPdnktNFRjNjl2MjRBRRAB",
            "text": "Great food, lovely ambiance and great service. Loved the place."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMUsteHlBRRAB",
            "text": "Had a great experience. Been meaning to try for a while.\n\nIt was the first time I was there, and during our meals, customers were coming in and giving the owner (Adriano) a gift for becoming a new father. I knew that second the service at this place would be excellent and a place you want to eat.\n\nSure enough Adriano was such a gentleman and we had a lovely meal. Will definitely go back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN2FMeG9BRRAB",
            "text": "Enjoyed a late brunch with my children. Excellent service from Maggie. House focaccia and rigatoni were perfecto!\nWill come again"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdWFlUU1REAE",
            "text": "Very nice!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveW9QNktnEAE",
            "text": "Love love love this place. Almost don't want to give a good rating because I don't want it to get discovered and overwhelmed. It's a quiet hole in the wall spot with great pasta and foccacia and they open early so it's good for breakfast too! Amazing. Love the cocoa short ribs pasta."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNUlTZXV3RRAB",
            "text": "My first visit here, I had the best soup ever. I wish I could eat this every day!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdjZmYmRBEAE",
            "text": "Delicious! Cozy cute great service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOG9TSzlBRRAB",
            "text": "The pasta with cocoa was so good (and memorable)!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJa2RfbFN3EAE",
            "text": "I got the caprese salad and a Diet Coke and it came out to $32 and the caprese salad size was absolutely tiny and the salad was not very flavorful at all - missing the quality olive oil and salt, and so lacking in the amount of tomatoes and basil! This was after I ripped up the focaccia and added it in to bulk up this depressingly small salad."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJanF2a0J3EAE",
            "text": "¡Cozy Italian cafe on the UES!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NDZMZC1nRRAB",
            "text": "Unfortunately, can't recommend. Atmosphere is cozy and staff are friendly.  Nothing special about the food. Very, very loud - hard to converse and waiter didn't hear the order correctly, mixing  up insalate di pollo with nizzarda di tonno. Two nizzarda di tonno were brought  instead of one, but one was clearly more elaborate than the other. Neither had sufficient dressing so, after the eggs and beets, were in the end mainly just dry greens with tuna.  Lasagna tasted ok, but plain. Overall, not a good value. Space is cramped. The waiter, while  apologizing, asked us to leave to accommodate a party of four."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bnFHeFZBEAE",
            "text": "I ate the Rigatoni (on the menu) and ravioli (off the menu, it was their special) - Rigatoni was great, perfectly balanced pasta but the ravioli was super salty. The carrots were a great side! I would come back though - seems like an authentic italian spot with very home style italian food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdVliWVZnEAE",
            "text": "I am of Italian descent and rarely do Italian restaurants stand up to the food both my Nona's served our family while growing up. Da Adriano was incredibly authentic, delicious sauce and homemade pasta. Atmosphere wonderful and service impeccable.  Planning on going back later this week!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneExXdHdnRRAB",
            "text": "Great little spot in NY. Service was amazing at this small but perfect lunch/dinner restaurant."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnLWJuRXZ3RRAB",
            "text": "Uno de los lugares donde se cena comida italiana y muy rica. Se nota la calidad de los insumos usados y la buena mano del chef. La atención es excelente, muy buen trato del personal."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnLVlteXZRRRAB",
            "text": "ES: Ambiente cálido y tranquilo. Excelente servicio, un viaje a disfrutar comida italiana.\nLa pasta es espectacular.\n\nEN: Warm and quiet atmosphere. Excellent service, a trip to enjoy Italian food.\nThe pasta is spectacular."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBXzVQUWFREAE",
            "text": "Every dish is a masterpiece. Super cozy place and caring staff. The focaccias, thr gnocchi, the chocolate cake and the tiramisù are a must. Cant wait to try more!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzemRfMW1nRRAB",
            "text": "Da italiano verace consiglio vivamente questo Ristorante! Il suo Team con un Grande Adriano titolare del locale che con la sua esperienza e la sua  professionalità da Chef ti farà sentire a casa 🇮🇹! Il cibo : spaghetti cacio e pepe, bolognese, amatriciana, lasagna e tante altre prelibatezze, antipasti , carni e pesce, dessert da leccarsi i baffi, insomma tante vaste scelte! Per me se devo dare un giudizio è il migliore che ci sia in assoluto in tutta New York ! Da Adriano Restaurant “ The Best” !! Provare per credere Signori."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaXBmYkx3EAE",
            "text": "I absolutely LOVE this place! Adriano has the most delicious dishes here! Honestly, this feels like a darling restaurant in Italy! I always feel at home. The bread, the pairing of the wine with the appetizers and the entree’s! I will continue patronizing this fantastic place because they are consistent, generous and are absolutely in the right business! Mangia!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdlBPdHRBRRAB",
            "text": "They have indoor and outdoor seating. It’s cozy and warm inside, limited tables. The staff is nice, the manager or owner was kind enough to bring us blankets when we got chilly while eating and watching the marathon runners today. The bolognese was yummy, and my friend and her mom enjoyed the focaccia sandwich and chicken caprese salad."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5bVp1cktnEAE",
            "text": "Very last minute plan with my husband! We’re traveling from California, and we would normally get a drip coffee to go from this restaurant in the morning. We knew the atmosphere was very cozy inside, so we decided to give it a try for dinner. It was amazing!! we ordered the lasagna and the tuna salad. Both were fresh and tasty. Shout out to our kind and sweet server Maggie! She encouraged us one morning to try their menu, and we were lucky to have her waiting on our table tonight. Happy to have found this gem around the block!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6dnRhUFBnEAE",
            "text": "GREAT ITALIAN CAFE RESTAURANT 🇮🇹 Randomly found this while walking in the upper east side in the morning. Glad we stopped in for brunch! Very nice quaint restaurant cafe! We had the focaccia with prosciutto and olive 🫒 pesto. Also had the salad with chicken. The overnight oats were also very healthy and delicious during the warm afternoon because the dish is served cold; refreshing and delicious. Highly recommend this place for a morning, mid-morning meal ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3aEphdTl3RRAB",
            "text": "Really cute Italian Restaurant/Cafe on the UES. I’ve been here for both lunch and dinner and each time it’s quite lively. The focaccia is a must try and the pastas are also quite good. Always love the ambiance and it has a cozy, bustling feel."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6bEx6WXVBRRAB",
            "text": "We were lost in the neighborhood and I’m glad we found this place. Cozy and elegant. We had a tiramisu and a couple of drinks. Super cute, and the service was amazing. Can’t wait to go back and have some dinner ♥️♥️♥️"
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyMlpHUU1REAE",
            "text": "Se vi trovate a New York e volete mangiare la vera cucina italiana di qualità, andate Da Adriano. Pochi piatti, ma curati e con materie prime diligentemente selezionate. Personale gentile e attento in un locale piccolo e accogliente. Musica italiana in sottofondo ed ambiente curato con quadri che richiamano l’Italia.\nAdriano e sua moglie riusciranno a farvi sentire a casa."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUbEw2bTFBRRAB",
            "text": "We stumbled upon this place totally by chance on our way back from a doctor’s appt and it only took one meal for it to become a favorite!\n\nFood is extremely fresh including the pasta and the focaccia bread they use for the sandwiches, all made from scratch on premise. The tuna tartar was amazing and so was the gazpacho and our pastas! We are foodies and thoroughly research places before deciding to try. As someone who has lived in Italy, I think its not easy to find authentic Italian   restaurants despite infine Italian options in Nyc.\n\nThe cherry on top was finding out this is a small family business and meeting Adriano and his wife who seemed to make a genuine effort to get to know all their guests and ensure a pleasant experience!\n\nWe cant wait to return!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqanFlREp3EAE",
            "text": "Loved this hidden gem! We stumbled upon this once when we were craving authentic Italian, which seems to be rare in Manhattan nowadays. Chef and his wife are so nice and comes around to your table to make sure you’re taken care of. Great cozy atmosphere, definitely a must try. Lasagna and bolognese were so good. Great selection of wine too."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcDhtZWpBRRAB",
            "text": "A really homey and cozy neighborhood Italian spot that I’ll definitely return to. The servers and owner/chef are a lovely bunch as well. The cooking leans towards more casual and everything was very solid. The slow roasted NY strip was the highlight for me!"
        },
        {
            "date": "10달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2eGVqWldnEAE",
            "text": "Un piccolo ristorantino italiano, nel lower upper east side. Un atmosfera molto bella abbinata ad servizio eccellente.\nIl menù è fatto da piatti tipici italiani e sono tutti deliziosi. Se siete in zona fermatevi per un pranzo o cena all’italiana."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNlAtZmhBRRAB",
            "text": "Amazing neighborhood spot from one of Saint Ambroes and Casa Lever’s best chefs! Chef Adriano is passionate and serves a wonderful meal and experience!  Highly recommend the focaccia breads and any pasta dish that Chef is serving that day.  We had Torta della Nonna & Cacio e Pepe, and they were phenomenal!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWXzRYbGdnRRAB",
            "text": "The most authentic and delicious italian place in  NYC.\nYou can find breakfast, lunch and dinner. I have tried all three and I can say everything is impeccable!\nThe focaccia is delicious, very very tasty; you can tell that the ingredients used are high quality and that everything is daily made (I added a picture of my favorite one - Focaccia San Daniele). Great option for lunch at the restaurant but also to get on the go.\nThe pasta they prepare is absolutely authentic, so so good and cooked on point! I loved the Home made Rigatoni with tuna (shown in picture) and I highly recomend it as well as the rest of the menu. You can also find excellent, very meticulously cooked meat dishes, I have tried the Roast Beef with Roasted Carrots (picture) and I was blown away!\nThe place is super clean, looks warm, cozy  and very elegant and the staff is so welcoming. The service is flawless, and it makes the difference along with the authenticity and high quality of the dishes!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURKc2NCQhAB",
            "text": "Since da Adriano opened, I've come in for breakfast, lunch, and dinner. The food can't be more authentic. It's Italian home cooking with a modern twist. The ambiance is cozy and elegant. What really sets it apart is the hospitality. Chef Adriano and his wife, Anja, really strive to create a neighborhood place where people feel genuinely welcomed.\n\nRecently I had the experience of hosting my husband’s milestone birthday party here. The process was a breeze. I approached them after having coffee twice during the first few weeks of their soft-launch. I had no doubt that they would deliver great food, drinks, and service. And they truely knocked it out of the park! Anja is professional, considerate and so easy to work with during planning. On the day of the event, as soon as we arrived the chef quickly escorted us to sit down and served us two plates of pasta assuming we would be too busy to eat. That turned out to be unnecessary. We were enjoying all the food and drinks every minute while catching up with our guests. Anja, Adriano, and the staff took care of everything else for us. The service was seamless. Many of our guests were curious how I discovered this hidden gem. Of course, I gladly took the credit!\n\nAs the party came to a close, we were pleasantly surprised to find that there was no mess to deal with. Everything was neatly packed, making it easy for us to take home any leftovers and extras. Anja and Adriano's thoughtfulness even extended to saving our cake topper and candles, which was a lovely touch.\n\nFinally, the food itself, especially Torta della nonna, evokes a sense of nostalgia for me. Growing up in Taiwan, the treats I enjoyed were quite different from those at da Adriano. However, what they share is the use of simple ingredients crafted in small batches, avoiding mass-produced food found even at fancy places."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4Nk5fNWdRRRAB",
            "text": "Wow! I always test a new Italian place with the classic Cacio e Pepe. It is truly amazingly good. Easily the best I have had outside of Italy.\n\nThis is a new small place with just a few tables and minimal decor. They have focaccia for quick grab and go and they have wine.\n\nChef Adriano came out to the counter asking for feedback.\n\nI am sure they will do well with this kind of quality and friendly reception. I really should have taken a tiramisu it looked soo good. Watch out for an update to this post as I know I am going back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4eEtUY2VBEAE",
            "text": "Cozy Italian restaurant with a great atmosphere. Adriano will make you feel at home, with superb homemade food and an excellent service. Great experience from the espresso until you get your dessert. The lasagna was amazing. Definitely will be back and you can be sure I’ll recommend this place to anyone who wants to get a great experience of the true Italian cuisine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcHBTalRnEAE",
            "text": "Great addition to the area. Food was fresh and authentic, service was attentive and friendly. We were especially blown away by their quinoa lentil salad that tasted as good as it looked!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6d19HLXhBRRAB",
            "text": "Da Adriano — savor Italy, enjoy life\nHeading out of my condo, strolling down 1st Avenue, traversing through a big criss-cross, and you’ll find the tiny, timid, almost rusty-look Italian restaurant — Da Adriano, camouflaging with its neighbors — some aged, brownish, rarely-visited stores — part of the reason that my mom and I haven’t sniffed it out for more than 10 years being crazy foodies! (Shame). Quite ironically, how non-descript and “Spartan” Da Adriano appears to us, a thousands more times that the dishes are crashing my taste buds, making us desperate to come back as if the aroma still lingers in our mouth!\n\nHonestly, I’m not a big fan of Italian food and Da Adriano is the FIRST authentic Italian restaurant that I’ve ever been to, and it completely overturns my stereotypes of Italian cuisine as only pizza and pasta. On the shingle, “CAFFÉ” “FOCACERRIA” and “BOTTEGA” rest peacefully with the super-stylish italic title “Da Adriano” (that signatural vibe literally steals my heart!), give that little space a bit more coziness and romance, and maybe some unique hometown memories for the Italians here in Big Apple. This is not a place where you could order a full table of lavish Michellein dishes to regale your friends or colleagues, but rather, it would always be the first and only option popping out of your mind when you are just off from work or study, and want to sit down and relax, put away your thoughts, savor and taste some not-so-fancy but satisfying enough meals. As simple as a plate of spinach, feta cheese and spaghetti, or a bowl of macaroni with black olives and mushrooms. Or a chunk of lasagna, my favorite.\n\nPasta is absolutely a major highlight. Not only does its variety dazzles me, homemade also adds an extra flavor. I can savor the tenderness yet chewiness of spaghetti, the smoothness and “fast-melting” of pappardelle, the doughiness and richness of gnocchi, the firmness yet sponginess of macaroni, but most unparalleled of all: lasagna. Lack of any word to describe, lasagna perfectly illustrates the highest realm of detectable flavor: the sizzling slow-cooked ragù with fresh tomato sauce drizzle from the top, concealing the warmness and richness of the inside — alternating layers of flaky pasta sheets, buttery bechamel sauce, zesty ground beef, and melted mozzarella. You probably don’t know what’s the best thing in the world, but I do. It’s when the steam, combined with mild fragrance, cracks out the lasagna and wafts through my nose; it’s when all those alluring colors glisten together, some layer over others — scallion-green, tomato-red, meat-brown, flour-yellow and cream-white… It’s when the fork cuts right through the middle, and scoups up a complete set of layers and seasonings, and all that goes into my mouth… Yum! I feel like the entire world has frozen for that moment… The tomato juice, the beef confetti, the buttermilk jelly melted together with the soft tagliatelle, along with the parmigiana reggiana sprinkles on top, caramelized my tongue, soothened my mind and took me to another kingdom that I have yet to discover. All I recall was the exceptional look, smell and taste of that lasagna. Healing. Tiny but delicate, that’s all I need: it revives my senses that were fallen asleep long long ago, it brings up those brief moments of joy and tranquility that were once part of my life, it simply punches me in the face and reminds me of the importance of smelling the rose. It’s not just the food itself that enchants me, more beyond, it’s the instant vibration, the connection and the resonation with the food that instills meaning back to my soul. I feel fulfilled when I eat something I truly enjoy (not for any other purposes), how amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINlBpdUdREAE",
            "text": "If you love diners, you'll loooove this place. Decent prices, great service...and classic. The hood is lucky to have this establishment."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMko2MlBREAE",
            "text": "Da Adriano is one of the best and most authentic neighborhood Italian spots in the Upper East Side. Place is impeccably clean. Coffee is rich, bold with a smooth finish. Food is always on point - with one of the best Bolognese’s I’ve had. Focaccia sandwiches are a great lunchtime option and they are made fresh daily (you can tell). Best of all - the owner/head chef of the restaurant is one of the nicest people - he knows almost all his customers by name, takes pride in his creations and with every inch of his being is full of that Italian charisma that unfailingly makes you smile."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3M1pYWXJ3RRAB",
            "text": "I will never not recommend this restaurant! One of my favorite Italian restaurants in NYC. The staff is so accommodating, the food is DELICIOUS and the vibe is great. We sat outside this time and the atmosphere was perfect."
        }
    ],
    "reviews_count": 72
}