{
    "name": "La Pecora Bianca UES",
    "place_id": "ChIJ9YlInwlZwokRDb-WWDZkU1s",
    "grid": "MN8",
    "address": "1562 2nd Ave, New York, NY 10028, USA",
    "rating": 4.8,
    "user_ratings_total": 2106,
    "phone_number": "(212) 300-9840",
    "reviews": [
        {
            "date": "6시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvMWRGUkhUQzFFU1MxTGExWkJZV1JZWlRGaVZGRRAB",
            "text": "My fave"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOek4zWnVUbEp4VGxNd2MzUmZXRmhvWkZKclFXYxAB",
            "text": "Always a good time!  Food and service was fast and excellent!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWQ1JucFVOekZMT0ZWVVowNUpiRzFvWTBSZk1WRRAB",
            "text": "Thank you 😊"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjd2QxWmlXRXBmZEZWYWJFTTJMVkpYUW5wb2NuYxAB",
            "text": "Great gluten free pasta - which is rare"
        },
        {
            "date": "수정일: 4일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0bFYzQmFla2QwWmsxV2RFNW1jVWxYYVUwNFJFRRAB",
            "text": "Very nice restaurant"
        },
        {
            "date": "수정일: 5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBN3JIM2xBRRAB",
            "text": "david was amazing! great food and amazing service."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScVJXZHpjazgzVXpsR2JqWmpkVEl3U2pKcloxRRAB",
            "text": "Amazingly delicious!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTWQwNXNVVXA2UW5NNGNUQjNMVVo0Tld0eVlXYxAB",
            "text": "Thank you, it was wonderful"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3Mk5FVnBUbXBzWDNaVlpuZDJZa2hXWkUxME1uYxAB",
            "text": "La Pecora Bianca UES is always a hit! David and staff are truly excellent and the kitchen delivers a consistently great meal any time of day. The tiramisu for two is a delight, and quite generous in proportion. Other favorites include the campanelle, garganelli, chicken paillard, fritto misto, and of course the Toscano salad. They even make a nice burger and have some good Negroni variations."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKeGRTMUNiVlYzWmtRME5qUkdRa05OU0d0Q2QzYxAB",
            "text": "Amazing Italian food! I came in by chance and it blew me away. I’m super picky with Italian food!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCcFoxWmtVa3RWY2t0U1lXTm1aM0ZuZEVReU9IYxAB",
            "text": "Nice Italian food and drink"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SNlpVcEVaWEJqUVdSS1pHeHRkVlZHVURCdVNHYxAB",
            "text": "Fabulous meal on my first trip to NY!"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJejkyMnpRRRAB",
            "text": "Great experience"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GRWRFNWFSRWxDTUdZeFFURldhVFZETFc1UllsRRAB",
            "text": "I was there today at 12:30pm. The rigatoni was the best I’ve ever had and the vodka sauce was outstanding. Friendly staff and always kept my glass of water full A++++  That’s my new Italian food place"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WclR6SnJTMjltTW1ZM2NtcG5ORTkzVmpOSVVFRRAB",
            "text": "Cristian was awesome and made sure we were taken care of and well-attended to. The food was fresh and tasty and the vibe was great there too.  Classy place with a good price point."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGcFQzaHVSVXBaTkhsbFVqRlpPWEJTVmt4Uk0yYxAB",
            "text": "Loved the place! Great food! Zucchini fries and chicken Parmesan were amazing!"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NU1XNU9WbVpvYldWbVlVZEZTRlZQT1VWcFRtYxAB",
            "text": "Muy buen servicio y comida!!"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybF8zZG5BRRAB",
            "text": "맛있었어요.\n가격은 좀 있지만 분위기도 좋고,친절하고,맛도 훌륭합니다"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURId2Z2RWFnEAE",
            "text": "점심 코스 너무 맛있게 잘 먹었어요\n1코스에서 한개 2코스에서 한개 고르면 됩니다"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMl9yc2dnRRAB",
            "text": "너무 시끄러워서 대화불가. 파스타는 매우 싱거움. 직원들은 매우 친절함"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMaXgwTEdqaUpHSEJ3EAE",
            "text": "Four For Dinner and we had a wonderful time! The pleasant waiter got everyone's order exactly right and the chef met the challenge and won. The pasta portions were generous and delicious. The pork chop was moist and tender. Very Good Mixed Drinks. Prices were very reasonable, especially for the UES."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONmQwSnhUVlF4VldObVVFUjBNSFZuYmtkS1gyYxAB",
            "text": "We had the prix fixe lunch, which is one of the best bargains in Manhattan. Also ordered a glass of wine. Service was slow, which I attributed to arriving at the end of the lunch hour rush."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OU1JGWTJRVjgyYTNWT1V6UjFSMlJ6TkRrdFFrRRAB",
            "text": "Great spot for lunch on a hot summer day! I ordered the lunch special that came with an appetizer and an entree. The rigatoni was superb, and I was able to customize my ginger lime soda. Overall fantastic food, atmosphere and service. I will definitely be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205WldDMXhSVFIzZDJKZk9VUjVibXhCWVdoUlYzYxAB",
            "text": "Great service, JP our server he’s lovely. We enjoyed the grilled Octopus and the whipped Ricotta for our appetizer. I had the Rigatoni, loved the texture of the pasta, my husband ordered the Gramigna and the Heritage pork is so flavorful.. we also enjoyed the Tiramisu dessert, I usually dont like Tiramisu but this one is so good and not so overpowering and sweet just a perfect end for our meal. Highly recommended!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdlIwcFNiRTR3ZUZoUGVrUTFOWFJtYkhFek9YYxAB",
            "text": "Desde el primer momento que entrás al lugar sentís esa calidez que engancha: un espacio con detalles cuidados, ambiente con onda y un servicio que te recibe de la mejor manera. Da gusto quedarse y disfrutar sin apuro.\n•\tLos fideos con hongos son un plato inolvidable, cremosos, llenos de sabor y con ese toque casero que reconforta.\n•\tEl tiramisú se lleva todos los aplausos: suave, equilibrado y con ese final dulce que corona la experiencia.\n•\tLa atención es un lujo: cercana, amable y con esa simpatía tan nuestra que hace que te sientas como en casa.\n\n👉 Recomendación: no te podés ir sin probar los fideos con hongos, son el plato estrella. Y de postre, el tiramisú es un acierto asegurado.\n\nEn resumen, un lugar donde todo está pensado para que disfrutes de principio a fin, y que sin duda merece ser visitado más de una vez.\n\nPosdata: eructas ¡Satisfecho!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ObGREUjBjR3hWYjNSUkxUbERlazlaV2xvMWRGRRAB",
            "text": "The quality of food is good. I like Zucchini fries and Rigatoni. The atmosphere is pretty decent. Staffs are chill. The amount of the food per plate is a bit little, so you may want to order more appetizer."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkRWNVeHRWR1IzTjAwNVdreERkVkl3YmtweGJWRRAB",
            "text": "We came here for dinner and the food was pretty delicious! We split a couple of appetizers and I highly recommend the Ceasar salad (still thinking about it!), burrata, whipped ricotta and calamari.\n\nFor my entree I got the vodka sauce rigatoni with a burrata on top. It was okay, wasn’t too crazy about it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNHFId0RnEAE",
            "text": "Great food and fabulous atmosphere!! The service was really attentive and I was super hydrated because my water glass was constantly fillled :) love that. Calamari had good taste but was thin, the breading was breaking apart, there were only a few pieces compared to the amount of fried veggies"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPZkM1Y19RcmVlUkV3EAE",
            "text": "Lovely restaurant with cozy seating and delicious food!  They have a great lunch special with 2 courses for an amazing price.  The temperature inside is perfect, the volume is awesome, and the decor is cute!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvNFVFZ3dVSEZ1TFcxVlYwRXpOR28xVWpOUU1tYxAB",
            "text": "Burrata starter and corn were the highlights. Chicken paillard was decent. Nice ambiance and friendly service."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWM2RsaERhemN4VUVSaVZHdDRaR0YzVEhWSFMyYxAB",
            "text": "It was a very disappointing experience dining at the La pecora Bianca. We were informed our table will take an hour and 20 minutes but after waiting for 45 minutes, we came back to check and they had plenty of open tables without informing us. Also when we ask to be seated, somehow they could find a spot right away. After we sat down, the food took about an hour to arrive. (15 min for the appetizer, and an hour for the main). When we recieved our food the Bolognese was way too salty, the sauce was mediocre, and pasta had zero texture. The chicken we ordered was overcooked and dry. Overall I don't see why this is such a well regarded location for the price."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbnQteW13RRAB",
            "text": "I think the food here is consistent and delicious and their lunch special is very affordable and generously portioned. They used to have a wonderful brunch special on the weekends with a cocktail and a main dish but they did away with that unfortunately. I always love their rigatoni and the soup and the ricotta toast appetizer is incredible. When it's summer, the outdoor seating can't be beat. I've always had excellent service except one time there was a British female server who was very rude and dismissive last summer."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VLaXk5X1N4eHFpT1V3EAE",
            "text": "Nice athmosphere, service was ok. Most disappointing Eggs Benedict I have ever had for brunch. Party of 4, all 4 orders the yolk was hard-boiled and not runny. Manager said this is just how they make them and offered to make them again, but after 20 minutes waiting to be seated and another 20 for the food to arrive, we couldn't possibly wait. Their pasta is handmade, maybe try that instead of eggs."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPcjhyN21Pc3NIdWtBRRAB",
            "text": "The service here is incredible. They don’t miss a beat and the food is so good. Visiting from Chicago and came here for lunch. Was so good we came back the next day. Thank you, Nicole, our server, for making these out of towners feel right at home!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VPdnotTlBja3FXc1ZnEAE",
            "text": "Food and wine was delicious! The only reason why I give it a 3/5 is the service. We waited an hour until our food arrived and even our water took a while. Ordered the following\nTagliatelle\n(beef and pork bolognese)\nSpaghetti Chitarra\n(lobster, garlic, chili)\nGarganelli\n(roasted wild mushrooms, arugula pesto, pecorino)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaHJPN3lRRRAB",
            "text": "The octopus appetizer was so good and so :) the vodka rigatoni pasta. They even gave us free dessert cause it was my birthday 2 days ago. Cheers to Elis our waiter who was so helpful and friendly!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKR05Ga3lkMEpITkU4NGNrRm5Xa015VVd4alNYYxAB",
            "text": "Pretty good food. Was a little frustrated with paying $9 for a small portion of salmon but I get it I guess. Just wish I knew the ounces to expect."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTFZFWnhlV2N6ZVVSNldUbERjRWRQWjB4ck4wRRAB",
            "text": "Popped in for a solo lunch during restaurant week. Food and service were all amazing. Can’t wait to revisit!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbG9PYnB3RRAB",
            "text": "Very good quality food that has been expertly prepared. Went for lunch and dinner recently and enjoyed both meals. The lunch special of $25 for a starter and a main is particularly good value.\n\nIt can get a little loud inside, but it's clear that they added noise absorption panels to reduce the level."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xb2FrOTNUakJsTlV0SlNEQnpUMmxLVGpBM1oxRRAB",
            "text": "Soooo yummy. Love the atmosphere and food is amaze-balls. But bigger water cups please!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSd2FuQkRPRUZ5V2s1elJtbHVZMjFzU1Zab2QyYxAB",
            "text": "Neither the peaches nor the tomatoes were ripe on the peach burrata which was a bummer because I was very excited for it. The watermelon mocktail was delish though"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNV1huTFNBaEpfSUJREAE",
            "text": "Omg this place is so0o0o cute! It's a great and cutsey little brunch place for friends or bookclub. The service is fantastic and the food is phenomenal. So many tasty treats."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbmNESzZRRRAB",
            "text": "Great food - love the roasted cauliflower, crispy brussels sprouts and zucchini frites. The pastas were delicious with decadent, rich sauces. Staff were all really friendly and attentive. Would definitely recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RFp5MDNXak4wTmxWZlMwMUZjRXhIVEV0VFIzYxAB",
            "text": "Such a fun spot in NY! We happily stumbled upon this place. Great food, great atmosphere. We loved it."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQZjQxdGVUeXFPYUNnEAE",
            "text": "The food was so delicious. Staff was nice and helpful. We really enjoyed the meal there."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmMTR6dXlnRRAB",
            "text": "This place has a stylish yet welcoming vibe, perfect for a brunch or afternoon hangout. The attention to detail is impressive—the dessert with the sheep design is both fun and beautifully done, showing the extra effort they put into presentation.\n\nThe drinks are refreshing and well-prepared, with a nice touch like the salt rim and lemon garnish. It’s clear they care about quality and aesthetics. The space feels clean and modern, creating a relaxed but upscale atmosphere.\n\nOverall, it’s a great spot to enjoy creative dishes and drinks in a laid-back but polished setting!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxcVYydFZkVFpuVlVZNFRrdEdjM1Z0VFZveVFrRRAB",
            "text": "Pretty disappointed with the cacio e pepe here. I’ve been trying this dish all over NYC, and honestly… they have a lot to learn. The black pepper completely overpowered everything, and the little bit of cheese that was there got totally lost in the mix. 🤡\nI’ll probably come back to try the chicken parm, since I’ve heard great things, but the pasta was definitely a letdown."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6dGZDb1R3EAE",
            "text": "As an avid LPB enthusiast, I have to say this is my least favorite location thus far. The food was good, however the bread with the whipped ricotta was not toasted as is customary with the dish and in fact tasted sort of stale. The pastas…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTlh6VllRM0pFYUd4R1NrSnJjMFZRUkhkTllrRRAB",
            "text": "amazing food - remarkably good service.  we loved the burrata appetizer so much, we ordered two of them!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmX0l1UzVnRRAB",
            "text": "Everything was good however I asked for a medium well steak and I received a medium rare steak. I ate it and it was very good. I also ordered a lavender Spritz , it was sooo strong, they was not stingy with the liquor....lol All in all my daughter and I had a great experience."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuN3Z5aFpBEAE",
            "text": "Amazing place. Service was super friendly and attentive and the food was really good. We started with some drinks, a strawberry and limoncello rose and an Italian beer. The rose was super fresh, excellent for a sunny day. Then we had the burrata. Delicious with peaches and tomatoes. We ordered two pasta plates to share, the garganelli, amazing pasta dish full of flavor and homemade sausage and the rigatoni allá vodka that were delicious too. The tiramisu is hugeeee and super creamy and rich. Amazing experience, thank you for everything. We came for the brunch and was delicious too. Thanks for everything again"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCclVteHpWRVZKUVUxSlYwSk5NRUZqWTBreldGRRAB",
            "text": "Lugar bastante conveniente para comer y pasar un momento agradable. Tienen mesas en el exterior y la comida es sabrosa."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoMlpLbW5RRRAB",
            "text": "Ok so this chain is really growing on me! My first review of this place wasn’t favorable but my tune has changed. Love that there’s a location in the upper east side now! This is the type of restaurant you can take friends to lunch, brunch or dinner for casual hangouts. And almost everyone is guaranteed to find one thing on the menu they’re really going to enjoy. I’m obsessed with their Garganelli - usually the vegetarian pasta dishes are so plain/boring, but this one hits it out of the park, with an interesting pasta shape and a great sauce that’s made of mushrooms and arugula pesto, highly recommend it. Even the meat lovers will enjoy this dish!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNycG9uaENnEAE",
            "text": "This hidden Italian gem offers a quiet, non-touristy atmosphere perfect for a casual meal. The rigatoni alla vodka was so delicious!! Rich and flavorful, with perfectly cooked pasta (made in house)!! The whipped ricotta appetizer was a delightful start, so creamy and lemony. Service was friendly and attentive. A must-visit for anyone seeking authentic Italian cuisine in a relaxed setting! 🍋🌷"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdFBEMjZ3RRAB",
            "text": "Came here for a birthday dinner and omg! We got the fried platter as appetizer and it was probably some of the best fried calamari I’ve had. And the vodka sauce pasta plates we got were so good! Our server was also super sweet :)"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FME9IUTVhSEYzTTI5V1duVnZTMHROUlhodE5uYxAB",
            "text": "Just Incredible! Every ingredient was so tasty and cooked to perfection. Great selection of wine as well. If you like octopus get the octopus starter, it’s so yummy ;)"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GYVZITlhMVm96ZW5KNFQwcEJRamhNUmtoamNuYxAB",
            "text": "The pasta is amazing - the vodka rigatoni is recommended! Book in advance!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPMl9sT3JOX2VXRVJBEAE",
            "text": "Everything was perfect! Everyone very friendly and the food was amazing. Ordered the chicken Parm, and brussel sprouts and it was to die for!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6dHViVGpnRRAB",
            "text": "We enjoyed a wonderful dinner. The food was excellent and service was just as good. Highly recommended adding the burrata to your pasta. The whipped ricotta is an great starter. We will definitely be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcTQzeDdBRRAB",
            "text": "Incredible food.\nThe ambient is beautiful and all the staff so nice.\nWe love every plate.\nHighly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqanJmREN3EAE",
            "text": "My wife and I came here after a friend’s birthday party. The restaurant has outdoor seating and has a heater above if it gets cold at night. We decided to eat inside. You could do reservation or without depending how busy they are.\n\nFood: For appetizer we got the whipped Ricotta ($17.00) and I got the rigatoni ($26) with the burrata ($5.00) extra but totally worth it with any red pasta. I highly recommend the whipped Rocotta! It was so good and tasty - at this location I tasted more of the honey than the truffle though compare to the Chelsea location.\n\nService: Service here is okay and I like how you can pay by QR code, but there is a 1% fee. I recommend just getting the check from the waiter.\n\nOverall: The food here is good! I feel it could be a bit expensive though. But that’s the price you pay for homemade pasta."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKYTVfYUNGMU9LcmVREAE",
            "text": "Disappointed experience, eggs Benedict are not authentic, they were hard boiled. I wouldn’t recommend it, it is not worth the money for 2 hard boiled eggs with a big side of spinach"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtbmV6RW1nRRAB",
            "text": "TLDR: We came here for brunch. I think there are better restaurants around in the same if not lower price range for brunch.\n\nThe good\n* Very cute place\n* Lovely service. Our waiter was new, but he was very friendly and attentive. Hostess was also very nice with seating. We never felt rushed.\n* Was a great place to catch up with friends. Didn't have any problems with volume.\n* Noticed lots of families and well behaved kids around! Thought that was cute\n* We shared the burrata as an app. Delicious!\n* My friend liked her french toast.\n\nWhat could be better\n* Would have been great if the burrata came with 4 pieces of bread instead of 2! (We ended up just eating burrata by itself, which was still delicious.)\n\nThe bad\n* I was really excited about the soft scrambled eggs, \"carbonara\" style. But it ended up being really disappointing, especially because it was $18 and barely edible. It was just way way too salty. My friend tried a bite and was really surprised. Secondly, it wasn't really soft scrambled at all. It was flat and dry, and not fluffy (essentially hard scrambled) which to a soft scrambled eggs fan is really disappointing! Honestly was surprised this was messed up so badly. Took a photo of it just to share! Probably one of the worst dishes I've had in the last 4 months."
        }
    ],
    "reviews_count": 63
}