{
    "name": "Magic Wok",
    "place_id": "ChIJIX39awJmwokRJQ0rjge_CEU",
    "grid": "QN13",
    "address": "11-45 Beach Channel Dr, Far Rockaway, NY 11691, USA",
    "rating": 4.4,
    "user_ratings_total": 277,
    "phone_number": "(718) 327-3570",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OR1UweEZPVzVQTWtsclVESlVjR0ZxVWxWSGQxRRAB",
            "text": "We’ve been going here for the past 10 years and due to us moving out of state we have not been back in a long time. We returned last and when I tell you the food still hits!!! The line is always busy so keep calling back. It’s cash only and best to call ahead for pick up. Of course we were so hungry no pics were taken lol"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdmRDQWh3RRAB",
            "text": "The food is delicious here you can’t go wrong it’s the best Chinese food in the area, the only thing is the store looks rundown so at first glance you would just say no. A lot of homeless linger in front of the store begging for money. They need to stop them from doing that."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNM2FYRmphamRuU21GNE1HbEZjVEpOWjNOaE1FRRAB",
            "text": "I love the food here. I dont have pictures but I've ordered from this place many times over the years. Its still great food and service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oR2RuSmhVbTF4V21KRVIxcHJkek52VGxObk9IYxAB",
            "text": "Cash only ppl\nCash only."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wUVJGRmtiamhmZFhwVGFHcG5SMjVuVURCalJGRRAB",
            "text": "I just recently moved here and all my coworkers told me this was the best Chinese spot in the area. I decided today to go and try it out and just from the video I posted you can see how moist these rib tips are. I called in my order when I was at Woodmere on the LIRR and by time I got to the restaurant it was already done and waiting for me.\n\nThe worker won’t add any sauces to your order.\nIf you have fries, they will put it on fresh when you get to the restaurant so that it’s not soggy and I appreciated that.\n\nThe barbecue sauce was nice and sweet and I almost told her to add more and I was glad I didn’t because what looked like a small amount was actually a lot.\n\nSo far, I’ve only been here once and I’ve only tried one dish, but I will definitely be a frequent customer ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOUE52dXVTanFHVDJBRRAB",
            "text": "The best restaurant around Far Rockaway period."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNTR5UlBREAE",
            "text": "The best on this side of Far Rockaway.."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMDlpYWFREAE",
            "text": "Love how this place has never changed and I hope it doesn't. Food is top notch every time I go. Sometimes I get ignored which I don't like but eventually they come around"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmeHBfR0RnEAE",
            "text": "DISGUSTING ! Orders beef and broccoli my “beef” looked like liver and it was slimey my broccoli was undercooked so crunchy I thought it was raw . Beyond disappointing if I could go get my money back I would I’m so pissed off"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROam91cWlRRRAB",
            "text": "Food was great. Service was quick. Fried chicken was popping, shrimp fried rice popping too.\n\nThere's parking but everyone double parks cause of how good it is.\n\nPrice is relatively similar and normal. Lunch special is a good deal (photos attached).\n\nCash only.\n\nSide note. We tried calling for a take out this weekend and none of the lines were working. But I think that's cause mad people were ordering.\n\nUpdate: there's pan handlers, which kinda sucks. There's an ATM machine inside, but there's a $2 fee for me. It's our go to Chinese spot now, other spots don't hit the same."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQaExIMGxBRRAB",
            "text": "I've been going to this restaurant since I was a teen more then 20 years. The foods flavor never changed.  The food has always been good especially their lo mein and dumplings 😋  when I move this place will be missed the most."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzbUw2YllREAE",
            "text": "The best barbecue rib tips/ spareribs in New york."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuZ2NtQWZBEAE",
            "text": "They are one of the better and fresher Chinese food places around here. They don't deliver and also don't accept debit/credit. I like their beef and broccoli and egg rolls."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibktpX3p3RRAB",
            "text": "Best wings fried in clean oil and the general Tso chicken is the greatest of all time (flavored with ginger and garlic) 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6b0pqeGlnRRAB",
            "text": "The Shrimp lo mein had almost no shrimp in it, though it was a pretty big portion of noodles for the price. The food itself was very good.\n\nCash only though which is annoying."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqeS1UR2JBEAE",
            "text": "For $40 you will definitely feel full after a couple bites. I highly recommend the general tso chicken it's not fried too hard and the sauce is perfect. I like to eat mine with dumpling sauce and still taste amazing and not salty and they deliver."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREN04yS1FBEAE",
            "text": "Es un buen lugar"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEc19DcVVREAE",
            "text": "NYC Chinese food fast and quick\n4 orders came out to $40"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdlBQSkF3EAE",
            "text": "love love the bbq sauce / garlic wings and chow mein with no brussel sprouts. fortune cookies upon request and the food is always fresh"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0a0lldGpRRRAB",
            "text": "I ABSOLUTELY DONT RECOMMEND!!! GAVE ME AND MY FAMILY FOOD POISONING !!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOb2NUeDN3RRAB",
            "text": "Great food\nBeen eating Chinese food for my whole life\n44 years all over nyc every borough\nNot the best I've had bit still very good\n\nThere's always someone outside begging for something\nBut other then that whn I'm around this area this is definitely the go to spot for Chinese food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWMTVERjh3RRAB",
            "text": "Dirty. Hood. Delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsZ191WVJnEAE",
            "text": "Firstly customer service is very pleasant  the server is very quick in putting the dish together ❤   wasn't overwhelming  and the food is good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsN1ktcHp3RRAB",
            "text": "They had better cooks, and it's a walking distance."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsb2NYVTVnRRAB",
            "text": "The food is great! They make great money here so they can invest in fixing the place up a little more. It would be nice if they took credit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGdGE3UWdnRRAB",
            "text": "Great food, but cash only."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGNjl5YjlnRRAB",
            "text": "The only Chinese restaurant in the area that has great tasting food 🤷🏾‍♀️shrimp and broccoli has alot of broccoli huge shrimp and taste so good my son loves their general Tos chicken"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGdmJfT0ZREAE",
            "text": "I love their boneless rib with pork fried rice. They always cook delicious food I am always satisfied with them."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4bk5pOVZREAE",
            "text": "Good price"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1NmVLSUpREAE",
            "text": "Price is good"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2eV9LbUpBEAE",
            "text": "Very good in clean fast service"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNXBtVUx3EAE",
            "text": "Friday evening and the food was NOT fresh.  The lomein were soggy and the shrimp we're a little mushy, the fried chicken not crispy. Unexceptable, obviously it was precooked food they couldn't sell.  We had to warm up the food and add fresh scallions shrimp mushrooms and dark soy sauce, to add flavor and make palatable. We put the chicken wings in the air fryer. We ordered 2 Large Shrimp Lomein and 2 orders of 4 wings=$36.  Expensive food that's NOT fresh.  Make sense why they're not as popular and why they have less operating hours.  Will NEVER go back.  Learn to make your own Chinese food.  There are enough Asian supermarkets in NY."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlc2FIVVpBEAE",
            "text": "General Tzo’s was perfectly crunchy with succulent pieces of chicken inside. My only complaint is that there were no peppers and therefore it wasn’t at all spicy.…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNejd6YVJBEAE",
            "text": "Call 30 minutes before closing walk down the block within five minutes they were closing the gates. Wow !\nfuture reference make sure this is your last option go across the street to Taco Bell, McDonald’s or better yet the corner store.\nYou will get better services.\nAlso they care about you these people do not care about anybody but themselves they set up shop in I’ll community just to take every single dime you own they would never support us so why should you continue supporting them ? I haven’t ate from a Chinese restaurant in 4 years.\nI am not familiar with the area,\nso I was giving these guys a try, and look what happened. Shaking my head.\nI ordered healthy, tasty food from the corner store right next-door, it smells very good, fresh and delicious. Yummy !"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtNHZLd3VRRRAB",
            "text": "Best Chinese food in the Rockaways. Since I could remember, we have been ordering food from Magic Wok. Chinese restaurants come and go out of business in the Rockaways but Magic Wok is still going very strong which speaks volume. The food is delicious, and the price is very reasonable compared to other fast food within the area. Lunch special pepper steak is $5.95, crispy fish with broccoli is $5.95 and chicken/beef with beef broccoli $5.95. Most importantly ,the place is clean and the service is good. Parking is available in the front via meters. It is a busy area  so it gets a little difficult at times, and subsequently people double park. I wish Magic Wok would deliver food, but we can do the next best thing which is to order via phone and pick up. Just the fact that Magic Wok is still doing well after all these years say everything about the food and services provided. Hours open from 11am-11pm."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlX3ZLRXdBRRAB",
            "text": "For the most part their food is really good and most of the time taste fresh. They do have their bad days though. Those days when the chicken wings are really little and overfried or it doesnt taste fresh. Im not sure if its the person cooking or if its food that has been sitting for a while but as long as theyre mindful of those problems their food is some of the best around."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwdmQ3b0RBEAE",
            "text": "Almost no chicken in my chicken with sprouts. $11 for a large container of cooked sprouts. Very disappointing. The tofu looked good but I’m a carnivore so I passed on the sample. The rest was ok and very typical of NY fast food eateries. Nothing special here....."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvMk1UMzNBRRAB",
            "text": "Best non traditional Chinese restaurant in Far Rockaway.  Their chickens wings is to die for, shrimp fried rice not traditional Chinese with eggs bean sprouts etc. If you want that u have to pay extra but u wont get all the stuff the real ones comes with. Best in Far Rockaway by far."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1cWVPVTJ3RRAB",
            "text": "Best Chinese take out in the area.  Seriously,  try their general tzo's. Has actual bits of garlic and you could taste the ginger. Recently it's been a bit spicier,  which is a huge improvement imho."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrcWJpZHNBRRAB",
            "text": "Tofu tasted bad. My fiance got a tummy ache after eating here. He had meat. Fries were good though but they're just fries."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVdDlyTWFnEAE",
            "text": "As far as the meal, it has always been good. As far as picking up. I've had a few occasions when something was not added or forgotten. IT'S usually 1 of 2 things egg roll or beverage."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJXzY2SGZ3EAE",
            "text": "Been going here since the place opened. The best Chinese food in the Rockaways .  Boneless Ribs, and Rib Tips are to die for! Ask them to make your Fied Rice dark for a more enhanced flavor. Get a side of Garlic Sauce to dip your Fried Platains or dip your wings!"
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBejZEMzB3RRAB",
            "text": "Fairly decent Cantonese-style roast pork and just-edible hot-n-sour soup when they remember to add in enough of the so-called hot oil, but the sliver of lobster in the amusingly named Sea Food Delight always tastes of freezer-burn; a typcal \"greasy chopsticks\" type of establishment otherwise -- best thing is that they serve brown rice (at a pretty  outrageous markup of $1.50 --  when substituting [for white rice]!!!) and that there's slightly more seating than is usual for this sort of place (you know, neiher restrooms nor AC), wih prices being generally a dollar higher compared to the usual neighborhood Chinese fast-food place...no deliveries probably because no one tips in these parts (heh, just check out the demographics all around!) 'cause it can't be the danger -- no bullet-proof glass or metal cage-like doors here. Gotta say, though: too many \"brothaz\" hangin' around day and night after day and night begging for change...really annoying, 'specially since it's the same cast of thousands all the time!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpNkxlMGNBEAE",
            "text": "No good food or service. Not for you to eat. There is all ways someone asking you for food or money. I stop going after three time. Staff and place are no good don't know how they are still open."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQydXNmN3h3RRAB",
            "text": "The food selection is slim. It doesn't have sichuan or Cantonese. Just Fuzhou cuisine. The food taste great but lack of selection."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJN0x2c3J3RRAB",
            "text": "Tasty and fresh Chinese to eat in and take out friendly stuff gives you what ever you asked not like other spots where they so cheap with the sauce good portions food..clean areas will go here now on  thanks for the good service"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5cGNYNVJBEAE",
            "text": "Listen! IVE BEEN COMING HER FOR 14 years for 1 thing and 1 thing only = CHICKEN WINGS cut up W/ HOT SAUCE & BBQ SAUCE - PERIODT! Thank me later (it comes with fries) ENJOY!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPeUl5OS1RRRAB",
            "text": "I like Magic Wok, the good is good, they're polite, the place look clean and my food is usually ready for pick up when they say . Its the only place I go to when I eat Chinese"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBNjlYUFlBEAE",
            "text": "WHATS SO STRANGE ABOUT MAGIC WOK IS THEY APPEAR CLEAN BUT UNSANITARY AT THE SAME TIME. MAYBE THEY SHOULD CHANGE THE CEILING TILES AND REDO THE FLOORING AND TABLES AND CHAIRS MAY HELP. BUT I MUST SAY THAT IT IS THE MOST TRUSTED THROUGHOUT THE ROCKAWAYS. I GIVE THEM 3 STARS FOR EFFORT."
        }
    ],
    "reviews_count": 49
}