{
    "name": "DredSurfer Grill",
    "place_id": "ChIJc_fbBa1owokRIFn1I6Vd2_U",
    "grid": "QN13",
    "address": "16-27 Seagirt Blvd, Far Rockaway, NY 11691, USA",
    "rating": 4.1,
    "user_ratings_total": 195,
    "phone_number": "(718) 471-3725",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1V1ZXZE5SSG8wVmsxQk0wWkZSRVZKVDNGcVVuYxAB",
            "text": "Placed an online order via Seamless and it was delivered no issues. Placed an order on Seamless for pick up today and the lady who claims to “run” the kitchen says shes never heard of Seamless and they don’t use it. Then proceeds to keep asking me the name of the app after I already told her Seamless. She was incompetent and rude. Will provide proof of both orders placed on Seamless so this place needs to properly train staff members on what food takeout apps you actually use"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxMmQwWlROR2hDYURJNVN6VjVibVV0V1VOVGRIYxAB",
            "text": "Stumbled on a Yearly Party over at Dredsurfers, let's just say I stayed for hourssss. Good vibes, DJ was phenomenal!! Overall a great time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KWWRGQjBTbTB5VVc1dFVFeFdNVE0zUkVabmNGRRAB",
            "text": "The worst place in n my opinion, the wings and chips we were waiting for 1 hour 20 minutes and It was not delivered. We paid in advance $65 and left without food served. The waitress is very rude and was yelling at me when I asked my money back. I'll never eat there again. I don't recommend this place!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGNVRHSlhibXhIUVRORldFOUxjbXRtYlVOVVNtYxAB",
            "text": "Didn't get food we ordered, couldn't get a refund because the manager wasn't here, loud music playing."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhcXN1M0RBEAE",
            "text": "I enjoyed the food with a nice menu. A peaceful atmosphere with a great vibe. Rum punch a must."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbTdMYVlREAE",
            "text": "Nice beachside venue for my cousin's bday party"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNFpiSHJBRRAB",
            "text": "Worst food I’ve ever tasted, I would not feed this food not even to my dog! I’m super disappointed. The jerk chicken is hard I had to throw the food away. Matter of fact, they send the opposite of what I asked for. Please spend time on your food!! The absolute worst!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiN09QbEdREAE",
            "text": "Would not recommend! Customer service is definitely 0, as if you’re not a paying customer. Don’t even bother wasting your time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiN1AyZWhRRRAB",
            "text": "Terrible customer service and bad tasting food. Don’t even bother wasting your time as you will be left unsatisfied."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNycW95eFh3EAE",
            "text": "Just terrible, they hang up the phone in your face, salmon don’t be fully cooked in the middle. I’m over this spot. I order johnnys on beach 20st now instead of these people."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMdE5tWGZ3EAE",
            "text": "It’s good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0aF9ucWlnRRAB",
            "text": "Highly recommended for the hospitality and food. Thank you!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadWN1eld3EAE",
            "text": "Food is excellent and the atmosphere is always inviting!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbGJIcFJBEAE",
            "text": "Food was okay. Too greasy for me. But reasonable.\n\nPlace had homeless people walking through"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4bjltLXR3RRAB",
            "text": "Went here last week with my good friend and her daughter. Waited  more than 30 minutes for our food. When it’s finally ready, and my best friends daughter goes to eat her fried plaintains they taste like fried fish. Her daughter is very allergic to fish and immediately did not feel well. There should be some kind of sign that the fish and plaintains are all cooked in the same oil considering so many people are allergic to fish. Very disappointing. We ended up having to throw out all the food and went elsewhere."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bXJDLWd3RRAB",
            "text": "Great tasty food on the Caribbean side. Right on the boardwalk with outside seating and a view of the inlet. New sand replenish project done and ready you and the children to rest and play in the sand. Enjoy!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4M05ibUtnEAE",
            "text": "The rum punch, fried fish and grill corn will change your life. The music and atmosphere are great additions to the vibes. ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoX2FMU3d3RRAB",
            "text": "This was worst food. The rice was mushy and the oxtail had zero season. First and last time ordering from there."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtM3NtS0VnEAE",
            "text": "Great music"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtMmZXaEF3EAE",
            "text": "Food 🥘 was way too spicy 🌶 and couldn’t even eat it. They charge You an arm and a leg for some food that’s not even that good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtNEtDM0pnEAE",
            "text": "Located right off the Rockaway Beach Boardwalk, it is one of the best located Black-owned restaurants in NYC."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlMHVuekl3EAE",
            "text": "This spot is popping in the warmer months with live band Caribbean and DJ playing the top hiphop and genres of music. Food is good too. Burgers, fries, wings, chicken meals really most of the menu is great for that outdoor beach day. Their rum punch is great👍🏾 and they also serve fresh coconuts. Overall always a vibe there with onlookers dancing outside. Really one of the best summer spots on the boardwalk."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldkxEX1VREAE",
            "text": "Always great food, great music, and most of all great people every week. Especially ladies with Junior as DJ."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNldXZ5bGRnEAE",
            "text": "Ordered one of my favorites fish wrap. I ordered 3, I had 1 and my friend and her husband also had 1 each. It was their first time there. Lived it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlbEtubVpBEAE",
            "text": "THOSE WINGS & RUM PUNCH HITTTTT EVERYTIME !!! Great vibe !"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1cjhuN2ZnEAE",
            "text": "Ordered bbq chicken, received wings for bbq chicken price. I gave them a shot, but couldn’t finish since they were so old."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxbTYyUEFnEAE",
            "text": "Great little concession that offers a taste of the Caribbean.  Charles is the man!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1LXZLaVdREAE",
            "text": "When there for lunch on a Saturday. Place was empty with lost of seating available. I got their jerk chicken meal with a cold beer that hit the spot. I'll definitely be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1Z3RLRU5nEAE",
            "text": "Decent spot to chill.  Great music on the weekend. The younh lady working the counter was pretty good.…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPcWNHeWlRRRAB",
            "text": "DJ Music 🎶 and good food and beers 🍻 beaches ⛱and Dance all day.have a good time in the heart of New York. Rockaway.…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHa01HVkp3EAE",
            "text": "Nice relaxed environment the staff is friendly/polite. Good place to relax and unwind while listening to good music enjoying the views on beach....fav place to visit with my dad."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHdDR2WTBBRRAB",
            "text": "Beautiful vibe and decor. Delicious food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHOUxfMkxBEAE",
            "text": "Nice. Close to the the beach and very good ambient. Came over baby"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhX2Z1X0Z3EAE",
            "text": "Very good fresh food. Slow service but worth the wait for great hot food."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3LUtIZTJnRRAB",
            "text": "Came here on a slow day early July . Me and my boyfriend decided too take a stroll and came across this restaurant . He ordered chicken with rice and peas and I had fried chicken and fries . The chicken had ZERO seasoning and the fries were over cooked. As time went on we continued too eat and There was A FRIED FLY IN HIS RICE . Yea you read it correctly A FRIED FLY IN HIS RICE . My boyfriend was like no babe don't say nothing but I stormed in there showed them the FLY and they gave  me my money back . It was expensive and not worth it . If the store was located somewhere else it probably wouldn't last it's just has a nice scenario because it's on the beach"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0MGVLV0RREAE",
            "text": "Be careful what you order. They carelessly ignore your order and give you something else. When you bring it up to them, they tell you it’s a “done deal”. You cannot get what you ordered instead. Horrible attitude and not worth the money. Do not order ANY WRAPS (they will throw whatever in there) and do not order the onion rings."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNMGFpNEh3EAE",
            "text": "To be able to eat at such a beautiful place on the  Beach is great,  good food and drinks close to home!  It's a dream come true without being rich or traveling on a plane!  How can I ask for more."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3NE5uRmd3RRAB",
            "text": "The food was lousy, so bad it caused me and my friend to have diarrhea. The customer service was good but the venue is not clean. Will not recommend or visit this place again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLdmV5Ny1RRRAB",
            "text": "Wandered out here from Brooklyn on a whim. Just tried the fish and chips- super tasty with this amazing seasoning. Definitely coming back the next time we visit!"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrdGJDRTZBRRAB",
            "text": "Best Concession place on the Far Rockaway boardwalk @ B16 St. . From comfort food, to dinner plates, very tasty, enjoy Beer, wine, soft drinks, big screen TV's and music. Very spacious. Sit and enjoy your food and converse with family and…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVM0l5V1VREAE",
            "text": "The food is always fresh and DELICIOUS! I cannot say enough about the wonderful owners, just wonderful people. Great place, great food."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwM2VtNHB3RRAB",
            "text": "Great atmosphere to relax, listen to music, and great food. Nice space to have a party. The staff is very welcoming"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJbnVlRlBREAE",
            "text": "The food was very good but because there were so many people in our party the food was slow to come after ordering."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBOHFtMVNREAE",
            "text": "Its ok if u wanna have some drinks. Place could look better but overall i like. I got every weekend"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrN2ZMWFd3EAE",
            "text": "Fresh Tasty Food with a Dose of Fantastic Music!"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrcmF2YThRRRAB",
            "text": "Excellent place to go to for great music & good food the owner is very pleasant.😁\nBut when the young pp takeover ! Then it get the ratchet! Time to go !🙄…"
        }
    ],
    "reviews_count": 46
}