{
    "name": "Beginnings",
    "place_id": "ChIJdYZaakVvwokRdu-7ZBCR59E",
    "grid": "QN13",
    "address": "1986 Park St, Atlantic Beach, NY 11509, USA",
    "rating": 4.5,
    "user_ratings_total": 535,
    "phone_number": "(516) 239-7483",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JMFlsbFdSVWhMY1ZOdFdVeFVOM28zUW5sbmNtYxAB",
            "text": "Do you want more 5-star Google reviews? Best of all, they’re free! We can provide as many as you need to help your business reach the top of Google Maps. Contact us on Telegram: @gthisjpeg"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kUlpHbHdPVE5QZWtsM1NIWkZSMUJWT1dFNU0xRRAB",
            "text": "Friends invited us and it was a wonderful dinner. Good friends, good food and good ambiance. Our server, Meghan was attentive, professional, and very funny. The perfect Friday night."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205NVNHa3pUVFJvY0UweFVtNVhVRU42VnkwdFVtYxAB",
            "text": "Went for our 55th Anniversary for dinner and were not disappointed."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vd2EwdEJibmRsVGtSbmVVRndMVkJOZFRCeE1YYxAB",
            "text": "So good 😊 started with clam chowder and moved on to baby back ribs every thing was so good. We tried every item and can’t wait to try more."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KZk9FZGFjRXRKTTNGU2RXeE1OWEk0ZGsxSFVIYxAB",
            "text": "Two people enjoyed their meal and Two didn't.  Nice atmosphere and great service."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VPdUhtN1cyamNuRGhBRRAB",
            "text": "The service and atmosphere were fine, but the food was not. The Clam Love appetizer tasted like all the ingredients came from a can and the massive chunk of bread drowning in the middle was a strange choice. The bolognese pasta was too sweet, didn’t taste like bolognese, and was way overcooked, mushy, and suspiciously hot (almost as if it had been reheated in a microwave…). There wasn’t any color on the Halibut. The flourless chocolate cake was way too dense, more like fudge than cake. The only way this food would be acceptable is if it were less than half the price, but it was all exorbitantly expensive. We were excited to try based on the other reviews, but genuinely do not get the hype of this place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQemt1SzdOeE95cTF3RRAB",
            "text": "food was good"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtemZ6N3lRRRAB",
            "text": "Fantastic and eclectic experience in Atlantic Beach."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJakJpZjdQNE9hYWJBEAE",
            "text": "Beginnings never disappoints!  Food and beverages are amazing, ambiance is fun, and the service is always top notch!  Highly recommend!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1N19MWlZBEAE",
            "text": "Food was exceptional as usual\nInside and outside seating was available.\nChicken milanas was delicious.\nSwordfish was fresh and tasty"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQYTZ6ZEw4a0xuTUJ3EAE",
            "text": "The swordfish fiesta was outstanding\nThe skirt steak with Chimichurri sauce was delicious and tender and the broccoli rabe was also prepared very good with just the sliced hint of roasted garlic and the mashed potatoes were very good as well\nThe music on Thursday night was very very loud. We couldn’t hear ourselves speak, but the food was delicious and the service was very nice."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdDhhV0p3EAE",
            "text": "We love Beginnings! The room is beautiful and the food is fantastic and the drinks are plentiful. The staff is unbelievably gracious and welcoming. They really make you feel like you’re at home. Ask for Megan she’s the best. Marisa and Marianna are wonderful as is every staff member there."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQydE5YckNREAE",
            "text": "Hidden gem. This place is a must visit. Great food and service every time. Lovely Library decor."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNzYySkJBEAE",
            "text": "I’ve been here twice now. The food is amazing, the staff make you feel at home, the decor is marvelous, and the events are so much fun!!! Some may consider this place pricey but it’s worth every penny. The portions are also huge and you will definitely be able to walk away with two meals for the price of one,"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaTk3bEhREAE",
            "text": "Great Tuna Tartare. Very pleasant staff. Salmon burger slayed. Double burger was a decadent belly filler. Well priced. Great ambiance."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJXzctRHBRRRAB",
            "text": "Food was great, service was great, atmosphere was lively, good luck with having a conversation"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cDhXRFl3EAE",
            "text": "We love being a part of showers at Beginnings! It is such a unique and beautiful designed space. The service and food are top notch!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfaDVfSl9RRRAB",
            "text": "Went for the first time 2 weeks ago with my wife.  They had a WICKED themed dinner and drink menu that we had to experience.  The decor was perfect, movie was playing and the food was INCREDIBLE.  Service was 5 stars all around.  Each course highlighted different flavors, textures and experiences.   I think we found our new favorite restaurant.  Can't wait to go back and try their regular menu.\n\nUPDATE:  Tried their regular menu and YOU HAVE TO TRY THE SWORDFISH AND THE FRIED CHICKEN!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbkpIR1B3EAE",
            "text": "Love love love this place"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbTVmYUFREAE",
            "text": "I drove over an hour to attend the Disney bingo event at beginnings. This is not my first time here. I used to be a local and I have attended many events at this restaurant. But tonight I was very unhappy with the service. I appreciate the manager who tried to do right by taking half the bill off but it wasn’t about that. I fully came with the intention to pay and have a good night. I walked in at 6:31 and was sat by the manager himself. A waitress finally came over, which was fine since I waited for the rest of the party to enter. I asked for tap water and when my guest finally arrived, we ordered drinks and told the waitress we needed a few mins for the appetizer. She came with our drinks and then we ordered an appetizer. It took a while to come out, but it’s understandable since it was a bit busy due to the popularity of the event. The waitress finally arrived and asked if there was anything else we’d like, we said yes, since we hadn’t ordered entrees. We ordered and the food came out relatively quick. I asked for another glass of tap water: I sat in that restaurant until 8:01, having asked three different people for a simple glass of tap water. Never came. I spoke to the manager, And again I appreciate his generosity of taking half the bill off but it wasn’t about that at all. It wasn’t until the two people I had asked for a simple glass  of water saw me speak to the manager did they finally approach us and fill the glass and apologize. As someone who grew up in this town, I have never experienced such service. I do not plan on coming back. Again I appreciate the manager trying to do right but not for the money I pay when I eat here."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBM19Hai1nRRAB",
            "text": "Ascetically this place is beautiful.  Restaurant is very LOUD. Not a place to go and talk.  Maybe when it’s slower you can have a conversation.  The food is good but comes out way too fast. Almost like microwaved fast.  You can’t have appetizers ordered and all brought to your table in a 6 min span.  The bus boys will remove your plate with food still left on it if you’re not paying attention.   Don’t get me wrong, it’s a nice place to go but there are better places around.   4 people with drinks was $490 with tip."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBemFtalRREAE",
            "text": "My favorite restaurant ever. The food is SO good and it’s such a cozy atmosphere."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfajlucUFREAE",
            "text": "The food and atmosphere are great. a little pricey. great staff. always something fun going on ."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmOWVIc1FBEAE",
            "text": "Great food and service! Very unique atmosphere.\n\nWe had the Yard Bird and the Filet mignon sandwich. Both were very good. The filet was cooked to perfection and very tender."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmLXJtcy13RRAB",
            "text": "Hosted my baby shower here and i can't say enough great things about the food & staff. I still get compliments over a year later about what a beautiful warm and inviting space this is. If you're looking to get away from the cookie cutter catering hall for your private event, this is the place to go. Ricky is knowledgeable, accommodating and incredible to work with. He was there every step of the way to make sure our day was perfect. I would recommend this place to anyone looking for a night out or to host an event. 10/10."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeHJ6X2xRRRAB",
            "text": "We had a blast with the Grinch.  Food was delicious and staff was amazing."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQZzZLQk93EAE",
            "text": "Five of us had a wonderful dining experience this evening and want to give extra screenshot and kudos to our server Carlos, who went out of his way to make this a great night!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzZ09YR3BRRRAB",
            "text": "Ever had an orgasm from food before?? Oh my goodness. The tuna tar tar was out of this world. The service was over the top exceptional, no wait time to be seated. The vibe is relaxing, the music is happy feels. Dinner with my sister was exceptional thank you. We will definitely be back soon. Bravo 10 stars 🌟."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3ajduQW5RRRAB",
            "text": "Exceptional food and drink. Large portions."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3eFpPd0J3EAE",
            "text": "Cute"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3Mlppb3dnRRAB",
            "text": "Where do I even begin? Called for a last-minute reservation for our anniversary, I thought I’d take a shot at trying to get in on a Saturday night at 9 PM and whoever answered the phone made it work for us. The entire staff made our anniversary special, greeted us with champagne and wished us a happy anniversary, I was not expecting that, but they really made our night SO special. I know they are under new ownership so I wanted to mention they are doing an outstanding job. I can’t wait to visit again for my birthday coming up. Thank you again to the staff at beginnings!!\n\nWe ordered the Spicy tuna sushi, Spicy tuna cakes, The meatloaf, Eggplant meatballs. ALL AMAZINGGG."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3eklxUDF3RRAB",
            "text": "Love this place!  I had a single burger with cheddar, and it was delicious.  Just an amazing, amazing burger.  The “salad” it came with was underwhelming, however…more like diced…cabbage?  In a light dressing.  Not quite the healthy side salad I was expecting.  Other folks in my group had the Yard Bird and gave it rave reviews.  The mashed potatoes were fantastic.  The atmosphere is truly exemplary- a beautiful interior with a literary theme; their back wall looks like a giant bookshelf, and there are fragments of parchment with scribbles hanging from the ceiling, as well as framed pictures of notable writers on the front wall.  The bathroom is semi-hidden behind a door with a bookcase on it- look for the exit sign :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3dE9PVE5nEAE",
            "text": "I highly recommend Beginnings. The food here is amazing!  Our favorites are the Bonchon Wings, the filet mignon sandwich, and Yard Bird. The service is excellent and the atmosphere is so nice. Definitely add Beginnings to your must try list!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDekoyRDNBRRAB",
            "text": "This place always pleasantly suprised me.."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4N0tYTWJREAE",
            "text": "Everything from the moment I walked through the door until I left was perfection! Staff, ambiance, cocktails, and food were on point. Upon our arrival, we were warmly greeted with smiles from everyone. Both the cocktail and food menus are extensive, and there is something for everyone to indulge. The grilled octopus was cooked to perfection and quite honestly, the best I've ever had. Our bartender Adam was very accommodating and made me the best hand-crafted cocktail (that wasn't on the menu) and crafted it exactly to my desired taste. Management is top notch and very hands-on, and the new owners are incredible. I'm sorry that I didn't get more pictures of the food but we were too hungry and couldn't wait! I already can't wait to go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyLThMU3dBRRAB",
            "text": "The library decor on the inside gives an unique ambiance. Service is always good and the piece of fish I ordered was delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyb0wtamtRRRAB",
            "text": "Went for the Harry Potter themed dinner, more on that in a minute. We have a lot to say, nothing great.\n\nI had called a month ago inquiring about pricing for the themed dinner, and if there would be any accommodation for those with allergies. My wife has a seafood allergy, and they said one meal would easily be adjusted to accommodate. We make the reservation on June 9th. The day comes a month later, we were seated and then asked about any allergies before being served the items on the menu. We mention the seafood allergy, and our waitress said that \"I was told strictly no substitutions, and no exceptions can be made\". I then said well I called a month ago to verify that and she said they cannot make an exception. She then told my wife \"we will just have to skip your entree for that portion of the dinner\" and just awkwardly walked away. We were dumbfounded that they couldn't make any accommodations. We almost left, but a lot went into coming out that night (more on that later) so we decided to have an open mind and stay.\n\nThe food was outstanding, but what made us annoyed was that they couldn't accommodate any allergies whatsoever. I'd be less annoyed if they even allowed us to get an extra portion of something else on the pre-fixe menu or even order from their regular menu (I would've paid for it). We were offered nothing. Meanwhile, mid-dinner, we noticed the table next to us also parttaking in the Harry Potter event and they had a ton of items not on the pre-fixe menu: extra drinks, meatballs, pasta, etc.\n\nNow about this themed dinner: torn out pages from the books hanging from the ceiling, wait staff in harry potter glasses and house ties, and three harry potter movies playing at different times (one stopped working and they just left it alone). No movie soundtrack music being played, just regular generic restaurant/retail store garbage. Pretty pathetic to be honest and sickening to harry potter fans to be honest. We have a 10 month old son, so we had to coordinate our work schedules and get a baby sitter. We're new, hard-working parents who dont have a lot of money and certainly dont get to have a night to ourselves. This was a special moment for us and we felt like we were ripped off and lied to. Oh, and that 20% gratuity that was automatically added? That was NEVER told to me during the reservation placing, on the website, or at all before we starting eating so that was a lovely expensive surprise. I certainly hope that didn't go to our server, because after our conversation about the allergies, she NEVER returned to our table except to serve the first drink. We had other servers taking care of us. She never even gave her name, but she had a butterfly neck tattoo for sure (nothing wrong with that, we both have tattoos all over).\n\nI called the restaurant the next day to talk to someone about this, they said no one was available to take my concern. I then left a message on their elwebsite that day, no response yet. We want to return, but we hope this gets seen first so we can feel comfortable returning otherwise we're staying far away. $170 wasted, as a good meal turns sour and awful once you're treated like crap."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNybS1XNXN3RRAB",
            "text": "Went for a Harry Potter themed night with a fixed menu. Arrived at 7:10 and didn't have our first course until 8pm. Watched another couple enter, be seated next to us, and start receiving their food before us. It seems to be the true theme of the night. Literally watched another couple sit for half an hour, receive nothing except water, and decide to leave.\n\nOur waiter actually apologized for the poor service and acknowledged that they were swamped, promising us a discount on the bill. We withheld our complaints and accepted the apology. Spoiler alert that was a lie, we received no discount, and her 20% gratuity was pre-added to the bill for an enhanced dining experience.\n\nWent for a Harry Potter themed night... The only thing Harry Potter about it was the 3 different movies playing on the wall (one of the movies actually cut off mid-stream, never to go back on for the 2 hours). You would think for a Harry Potter themed event, they would play some of the soundtrack throughout the event... no, just loud, random music instead.\n\nThe food was pretty good, though, so props to the people preparing the food. The service, however, leaves a lot to be desired.\n\nMoral of the story. If your establishment can't handle an increased amount of traffic (on a Wednesday night), don't punish the patrons with outrageous wait times because of your lack of planning and need to greedily stuff as many people as you can inside the building."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXanBfQ093EAE",
            "text": "This place has an incredible ambiance and the food is amazing. Our waitress, Jess was fabulous!! She was so knowledgeable of the menu and so sweet. She made the experience very memorable. We’ve been here a few times but this time was incredible. We got the yard bird, meatloaf, and ribs with brussel sprouts and espresso martinis. All of them were amazing but the yard bird was the best bc of how crispy the chicken was. We’ve also gotten the eggplant meatballs, chicken and waffles, bang bang shrimp, and pumpkin ravioli. This place is so good you really can’t go wrong. You’ll need a reservation and don’t be late! They also do a lot of trivia and themed nights. Definitely must check this place out!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKeG95bzVRRRAB",
            "text": "Went with a couple friends.  My buddy was craving a meatloaf and we were told to give this place a shot.  OMG it was incredible.   The meatloaf, garlic mashed and carrots were out of this world.  The Turkey burger with kimchi and an egg also hit the spot.  Server was super friendly.  Cant wait to go back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXcktxZjdnRRAB",
            "text": "I was greeted by an hostess who was also our waitress she told us sit anywhere we would like. The menu was an QR code in a little picture frame located on the table. The Food was amazing (especially the fried oysters appetizer). The…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaWEyM09nEAE",
            "text": "I had my baby shower at Beginnings and it was AMAZING. The staff was incredibly helpful and responsive while planning our event, especially Jess who helped answer many many questions. The day of everyone was so helpful and friendly to all of my guests. The food was outstanding and the atmosphere was incredible. My family and friends have been raving about it! So happy I had my special day at beginnings ❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGODVpSG9BRRAB",
            "text": "Really a fun place to go!  Definitely love the decor.  Food was good as well.  We went on a theme evening but opted for the a La carte way. I’ll be back !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbHZxdlNREAE",
            "text": "Delicious food, creative cocktails and super cozy interiors. Service is fast and friendly and it’s a very fun atmosphere on the weekends.\nWait staff are very knowledgeable about allergens - plus, they have gluten free pasta and burger buns!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPX0pPVEpBEAE",
            "text": "Delicious cocktails and dinner and excellent service! My friend accidentally dropped $ while we were leaving and wait staff were amazing in finding and returning the $ to my friend.\n\nAll photos except last 2 are by Manny SV at msvphotos.com"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJMTctV1JREAE",
            "text": "Great Place, great food, great staff - coincidentally found this place on Google while I was searching for a place to have lunch near to JFK airport. Located in Atlantic beach, just a 20 min ride from the terminals this was a perfect place.…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwNGZPRUZBEAE",
            "text": "We visited this restaurant on their \"Good Fellas\" theme night. The atmosphere was great, the place is covered with book shelves and they actually had the movie on tv... we had a 4 course meal structured to mirror what the characters would…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1aDVQT1lBEAE",
            "text": "this is my favorite restaurant in long island ! my personal favorites are the blackened mahi fish tacos, the stuffed meatloaf and the carbonara pasta. all are delicious options that i continue to reorder every time i’m there or taking out. if dining in, i would highly recommend going there for Wednesday nights when they do weekly themed events for $65 per person. every week is a new tasting menu which includes a variety of food options and drinks, and it’s an all around fun vibe. they have a great outdoor dining situation for when the weather is nice too. love it here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5X2RuRXNBRRAB",
            "text": "Had a great time. Their Yardbird chicken is always a winner and the blackened Mahi was unbelievable.  The banana rum sauce put it over the top. Every one was warrm, welcoming.  A not to miss place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4MXJ6LW93RRAB",
            "text": "What an awesome place beginnings was! This was my first time trying for my birthday and I was so pleased. Very accommodating and the food was delicious. Perfect portions and atmosphere was chill."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2cXZHcHFRRRAB",
            "text": "Great food and atmosphere. Ordered so much food. The cauliflower appetizer was delicious. Ordered a burger and a side of Mexican street corn. Street corn was underwhelming since I grew up eating this stuff. Big list of drinks, all very good."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4bmM3MDRBRRAB",
            "text": "It is so good !! A real gastro-pub as it should be. Delicious food and we'll presented. Flavors and taste were here, and really good portion. Cocktails are well balanced. And the place inside is really nice and we'll decorated. We are fan…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaHViWVB3EAE",
            "text": "Beginnings Gastropub, nestled in the heart of Atlantic Beach, NY, is a literary lover's gastronomic dream. An enchanting blend of unique culinary delights, warm hospitality, and delightful entertainment, Beginnings is a venue that has turned dining into an experience. The charm of this gastropub lies not just in its food and beverages but in its character, a testament to its apt name.\n\nUpon entering, you're welcomed into a charming space lined with shelves full of books - a sight that warms any bibliophile's heart. It's as if you've been transported into a delectable blend of a cosy bookstore and an inviting pub. This literary-themed decor extends an atmosphere of comfort, intrigue, and nostalgia, making every visit uniquely memorable.\n\nThe menu at Beginnings is just as impressive as the atmosphere. The selection is diverse and innovative, offering dishes that pique your interest and satisfy your cravings in equal measure. Whether you're a seasoned food connoisseur or someone looking for comforting classics with a twist, Beginnings will not disappoint.\n\nWhat truly sets Beginnings apart is the array of themed nights and games they host, fostering a sense of community and engagement that is hard to find. These events provide an enjoyable and immersive experience for patrons of all ages. The energy in the room during these nights is infectious, making it the perfect spot for a family outing, a catch-up with friends, or even a romantic date night.\n\nThe service at Beginnings matches the exceptional standard set by their ambiance and culinary offerings. The staff is warm, attentive, and committed to ensuring every visitor has an enjoyable experience. They navigate the balance of being readily available when you need them, yet unintrusive when you're immersed in a good book or deep conversation.\n\nAs a dessert lover, I must mention their standout dessert drinks. They are the sweetest way to round off a perfect meal, each one expertly crafted, visually stunning, and irresistibly delicious. They're not merely drinks; they're indulgent, liquid desserts that are worth every calorie.\n\nBeginnings Gastropub is more than just a restaurant; it's a gastronomic adventure steeped in charm and character. It is the embodiment of what a gastropub should be - a place of comfort, community, and culinary innovation. If you're in Atlantic Beach, NY, I wholeheartedly recommend a visit to Beginnings. It's an experience that satisfies the palate, warms the heart, and feeds the soul. Undoubtedly, it's a five-star experience that deserves every one of those stars."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSazdUdXJnRRAB",
            "text": "Love this location.  Themed restaurants are a favorite of mine and the Book Theme is awesome.  They also do a lot of different events.  Food is very good and there is specialty drinks as well.  Beginnings is good for a quiet date or to bring the kids!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLaTVuekFREAE",
            "text": "The food was completely amazing!! It wasn't not crowded. They had good space in between tables. Loved the library atmosphere."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURhdnZnZRAB",
            "text": "this food was delicious!! and the theme nights are so cool. I went to the peaky blinders one and I am definitely going to go to others"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0cWJDVEhBEAE",
            "text": "Had the ability tuna for dinner, it was cooked to perfection.  The sauce on the side, don't know what it was but it was fine👌.  Cocktails  were great,  I had the Manhattan and Old fashioned.  The boozy ice creams are awesome desserts.  I highly recommend this spot!…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoaE9fRHdRRRAB",
            "text": "I live in long Beach for 11 years,  and this one first time we have dinner at beginning.  At the Valentines day 💕.  It was my husband birthday.\nWe were very glad, that I picked this place! The atmosphere  is amazing.  Food is  soo good! Portions are big! Salad \"almost Cesar \" was a big surprise. Better then any salad I have tried.\nWe will definitely come back with friends!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBeXB2MHdBRRAB",
            "text": "Went for a book theme night. The food was obviously well thought out and planned and very delicious. We got more than your typical tasting menu size plates and full drink pairings! The themes are fun and interesting!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHbWV1Rl93RRAB",
            "text": "Love this place. Not a quiet place. Which I like. The noise actually gives you privacy (if you could understand that). Great atmosphere. High ceilings, no walls separating.\nThe bar is always full.\nReservations are a must. The staff is SUPER friendly and down to Earth. We reserved a tent table and the host must have noticed my mother was skeptical about the tent and said someone inside had canceled, would you prefer a table inside?\nJust a little extra effort that makes it nice.\nThe food. Is. Spot. On.\nThe burgers are next level.\nThe ribs are BIG.\nThe fries are amazing. Not fat steak fries and not the super skinny type. Just perfect in between.\nI always get unsweetened iced tea and I can always tell if its fresh and brewed right.\nPerfect! I only used a half packet of sugar.\nOur server also suggested that they had flavored syrups to add. I like it minimaly sweet though.\n\nA nice touch I loved is that our server made herself available walking near our table and making eye contact but not constantly, interrupting. Sure she formally checked on and asked \"how is everything?\" But I really dug the casual check-in.\nAgain, I hope that makes sense!\nAll in all one of my top restaurants in the South West Nassau Corner."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbjQtYnJBRRAB",
            "text": "Excellent service, the ladies here are very kind and helpful. The food is absolutely fantastic. We had the seared tuna with mashed potatoes and asparagus. I will be back!"
        }
    ],
    "reviews_count": 61
}