{
    "name": "Jerk King",
    "place_id": "ChIJZRfTG4NnwokRbArBWaNb1Zw",
    "grid": "QN13",
    "address": "13-30 Beach Channel Dr, Far Rockaway, NY 11691, USA",
    "rating": 4.9,
    "user_ratings_total": 347,
    "phone_number": "(347) 752-9305",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psa2FYWk1WbGd0UlZWRlkyaHpRV1pXWW5VeGRXYxAB",
            "text": "Do you want more 5-star Google reviews? Best of all, they’re free! We can provide as many as you need to help your business reach the top of Google Maps. Contact us on Telegram: @gthisjpeg"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OMldFOW1PV0ZIUmxWelpuSnNTVVpVTFdSR1lVRRAB",
            "text": "Everyone including Sean was super accommodating and friendly!! Everything on the menu is top notch.. I will go every time I’m in the area"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSR1pTMDBlalF4UTFJdGNVcGlSMWxpY3paeFRWRRAB",
            "text": "The jerk chicken taste really so good. Sean is the owner of the place, he was the one that attended to me yesterday. He is so nice and friendly. I recommend this place 100%"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WTWRGaE1ZMHRmYVhCcmFXWk5ObHBhT0VJNVZVRRAB",
            "text": "Excellent"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paVU5WSnpTVGRYYWtVMU4wRTJNVkJRVlhrM1VYYxAB",
            "text": "Great experience! The food was delicious, and the service and hospitality was amazing. Shout out to Shawn for being so welcoming"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kSE9YVnlkMXBUTTJ4VFZqaExjRnB2TTBsR1ZIYxAB",
            "text": "Blood Clock~~~  it's been a while I never had a good jerk chicken. Respect Mr Cheng 🤣"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204eGMxTk1SRE40ZGtocGFIRlVkV2hsWW5aWlNFRRAB",
            "text": "Food was fire, great customer service from owner! I tried jerk pork for the first time and it was really good, not dry or anything full of flavor and juicy. Collard greens omg 😋. Def a new spot I’ll visit again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVd2FUaHlXVk5VU0hBeFoyZFJjR2d6Wm1nM1ltYxAB",
            "text": "Hey it’s Chris, honestly this place is amazing and today was mine and my wife’s first time ever eating at jerk king and omg the food blew us away, the owner is amazing and so please pop out to this hidden gem in new York!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nemJYUnBaM1ZVV1VWNlNWcENPVGRsZUdRMVVrRRAB",
            "text": "It's  a little spot, with BIG taste!!! The food is great, plentiful, tasty, and the jerk is spectacular 😋 👌🏽 🙌🏽 ‼️💯"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WSlNFbEdOR3B6UkVObFZqUnhjVVJGY0hGWk9XYxAB",
            "text": "Great restaurant . Sheldon took care of me which is the owner. He is awesome , and they have awesome food . Best West Indian food in far Rockaway !!! Definitely 10 stars . You will not go wrong ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCNmFHRmFVblZDTFROSlpHTmtkMlJzTlRkYVozYxAB",
            "text": "My first time eating their grilled chicken, I loved it. Come to this place, you'll love it. I also ate the delicious crabs."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkSUxVVTVWMHhRTnpWSFZUWjZiMjU1UldZd1dsRRAB",
            "text": "Kind staff, delicious food, hooked me up with a nice variety in my lunch special and everything was great. Gotta come back for jerk pork some time, the chicken was very good, chow mein even better than the rice but both good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NdE1HMUhja2xDT1RSWlEweGxXRWhZTmpFNFVYYxAB",
            "text": "The Jerk is so tender, seasoned, and hot off the grille. Mac hands down the best I’ve had and I always get rice n peas…everything on my plate is delicious. The owner, he was definitely a kind hearted person. Can’t wait to come back here."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqNnJYTEZREAE",
            "text": "THIS IS THE OWNER OF  JERK KING IN FAR ROCKAWAY NY 11691 I JUST WANT TO THANK EVERYONE FOR THE LOVE & SUPPORT WE ARE GETTING FROM OUR COMMUNITY AND OUT OF OUR COMMUNITY WE APPRECIATE YOU 🙏🏽"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taaFlUaE1hVFF0VFc5b2RYSktSVWxVVkZOS2IwRRAB",
            "text": "After a long day of travel, we returned to Queens keen for a bite to eat. Saw Jerk King on the map and thought we’d give it a go! We were treated like royalty— the owner  charmed us with generous portions, tremendous value, and good vibrations. I know to come back when I’m in the area again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RMmRUVXRVMjAzUzFsalRsWjZWM1U1TlZSRlkyYxAB",
            "text": "Sheldon is amazing! He really does make you feel at home as he fixes you an amazing and hearty plate of delicious food. I tried the jerk, chicken, curry chicken, Mac and cheese, rice and peas, collards, cabbage, and Rasta pasta. I cannot recommend this place enough. From the first bite of the jerk chicken, I was hooked. It perfectly spiced and tender. The hour trip from the Bronx was worth it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cb1pqaG9YMDlOTXkwelExVkJYMHQyVEVJdFNGRRAB",
            "text": "Food is definitely a 10/10! Can’t complain at all about their food. Stop by!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Fd1JUZDRaMUZWWVhGNmRuaHBVMnBxV0hkMVpXYxAB",
            "text": "Food was delicious 😋"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbGJqZDBTUzFvYUZKeE9WRmFWMU5QU0RWVU5VRRAB",
            "text": "World class reception, Outta This World Flavor.. oh my Ghaaad, you definitely getting double the portion for your moneys worth. Respect to Jerk King Fam. It’s Home Now…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTGFUWlRRMGRMTVRBeWJ6QTRkamd3ZUMxZlFXYxAB",
            "text": "I had such an amazing experience at this restaurant today. The owner was incredibly kind and welcoming—seriously one of the nicest people I’ve ever met. The portions were huge, the food was absolutely delicious, and that BBQ sauce? Out of this world. The chicken and pork were smoky, juicy, and full of flavor.\n\nMy flight got canceled and I was having a rough day, but this place—and especially the owner—completely turned it around. He truly made my day with his kindness and generosity. The service was top-notch, and I left with a full belly and a warm heart.\n\nIf you’re ever in the area, do yourself a favor and eat here. This place is a hidden gem!!!👍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvMVdGbFhNRWMyU2tSNVptRkpWSEIxU1hwdVJYYxAB",
            "text": "I moved here recently and have been trying out the restaurants in the area. I saw “Jerk King” on Google Maps and the reviews were positive!\n\nWhen you enter the restaurant vicinity, you can smell the food cooking and see the smoke rising from the grill out front. Walking into the restaurant, you’re greeted with a smile and a warm welcome.\n\nSome polite conversation and mentioning that it was my first time earned me a sample plate of rice and peas with Thai sweet chili fried fish — along with a warm welcome to the neighborhood. I ordered the oxtail, rice and peas, and cabbage. I had never had callaloo before, and he gave me some to try with my meal-and it was really good!.\nAnd guys… he was NOT stingy with the oxtail gravy on the rice 😩😩.\n\nLet’s just say I demolished the fish dish when I got home (still crispy btw), and I’ll be saving the oxtail for tomorrow 🥰 (though I had to sneak a taste — it was fall-off-the-bone amazing!).\n\nWill definitely be eating here again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21neWNITkdWR2hMVW5SbGNrWkZNWGhZUVdwZk1WRRAB",
            "text": "This jerk chicken is a must-try. The first thing that hits you is the irresistible smoky aroma — that perfect char on the outside promises exactly what it delivers: tender, juicy meat packed with a punch of heat and warm spices. Besides the amazing jerk chicken — is the owner himself,Sheldon. He’s incredibly nice and  genuinely welcoming."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTmEwdDJWVzVHZWxScWQwdENNREZ4YkRSblMxRRAB",
            "text": "First of all the food is flavorful and the service is outstanding\nI enjoyed the jerk chicken, rasta pasta, mac n cheese and cabbage salad DELICIOUS\nPlease stop by and enjoy yourself :0)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VNGFqRkViblEzYldWcFJtMXJZMUV4Ym01R1ptYxAB",
            "text": "I’ve seen this spot before and I always wanted to try it today is my birthday. so I decided to go for it I had the Rasta pasta with jerk chicken it was so delicious definitely going back for more the service was amazing they even gave me a bottle of water for the heat and some extra food to try it’s definitely a great atmosphere thank you."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQloxaGtaSGt5Y1dWd01qaFZRVEJNVUhoQ1ZIYxAB",
            "text": "The staff was very friendly and professional, and I definitely enjoyed the food. It's a mixture of guyanese and jamaican."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WV1RGcDFlV0kyUm5relVUVndhbVprVW0wemJsRRAB",
            "text": "The jerk pork is amazing. Ordered some with rice and peas and they hooked me up with a little bit of everything. Rasta pasta, Mac and cheese etc. They couldn't have been nicer"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCcmQzaDFTMkYzY0ZOVmFIZEVZbmRuWm1KM1MyYxAB",
            "text": "Oh my gosh.. i just stopped by here out of curiosity because I was craving some chicken and rice. This place BLEW my tastebuds off the face of the earth. The owner and one of the chefs were there and they were so incredibly kind. If you’re…"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbVBhVWRnEAE",
            "text": "I went back to order their awesome chicken curry. Sheldon the owner gave me and my daughter some jerk chicken to try as well. It was sooo good!! Right off the smoker outside, lots of flavor and very tender. All the sides we had were so tasty too—collards, rice and peas and cabbage. This is Caribbean food done right!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KWE5rVjRjR3RWU1V4WFVUbHBlRmhFVFdwQ1FXYxAB",
            "text": "Fantastic food, best jerk chicken I’ve had in a while, generous portions and kind service. Highly recommended!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkSVNFNXdhMDl3T1VzdGJtbG5VRko2UTI1RlEyYxAB",
            "text": "Definitely 5 star, really big portion of delicious food, very kind owner, offer us free jerk chicken, chow mian also good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTFFYZ3hkWGhTVVVORWIzTTFNR3BSWm1saGFFRRAB",
            "text": "The service was really good. The owner/worker was welcoming and nice. Food was really good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xscmJFVTNTM1phVVdSdlZXb3dVRXhtVWpobE5XYxAB",
            "text": "I got the large jerk chicken, rice and peas and cabbage with the Jerk sauce. Jerk sauce is a must!! Affordable and good eats. I’ll be coming back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBM1lYcFhkVlF6U21GS1JFMVpOMFl5YjJaRGRVRRAB",
            "text": "Food was good, great service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUFVEWmZZa0ZOYXpSNlNFaHZXVXRRYnpsWGNYYxAB",
            "text": "I’ve been here a few times and I gotta say everytime I come in the service is pure love and kindness. I’ve had an interaction with a different employee every time including the owner and everyone is just awesome. The portions are amazing and their prices are great and fair. You get quality food made with passion. I came in real late before closing looking for oxtail and although they didn’t have it the owner hooked me up with some samples on the house, left with a smile cause it has to be the most kind act I’ve ever had done in far rockaway, they love their business and it shows. I’d recommend this place to anyone who wants real good food made by real good people. My personal favorite is the curry chicken and their oxtail and crab, great and unique flavors with every bite."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkTllXVXhjbTU1TkVoWWQwOTFZM1pwTVRacVpXYxAB",
            "text": "Shawn is the sweetest 🥺 Super generous portions for the price!!! The food is also delicious deff recommend this spot. Best customer service you can find nowadays."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213NFYxUnVaWEl4TFcxRWFIaG9XR0UzYVVaT1pHYxAB",
            "text": "We were visiting from Maryland and decided to have Jamaican food for lunch. The owner is very generous. He gave us sample platter of noodles, curried chicken and jerk pork. Everything we tried is delicious. I ordered jerk chicken. It is the best jerk chicken that I have ever eaten. Smoky flavor with just enough heat/spiciness.\nGoat curry is very well spiced, flavorful but not over powering.  Price is good, very generous serving. We will definitely be back for more."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KRFprbFNTREoyUlZwR09FSnRiVWxKZDFoWmJrRRAB",
            "text": "Very polite food nice and hot"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4cVZrbzFjamhpTlRNNFZuUjBSbkZSWjBKeFRtYxAB",
            "text": "I’m new to the neighborhood I tried about 3 Jamaican restaurants in area and I  never went back I see this place on my way to work and let me tell yu the best jerk chicken hands down authentic rice and peas was good and the festival fire 🔥 I Will be going back!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sb01IZGhjRUZqZVY5cVVYTnNRVzkyUjJsa1UxRRAB",
            "text": "Good people & they are good for the community, excellent food!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4UlZtWnBZVGxSZERWdFozazNRemRsWkU1dWRtYxAB",
            "text": "Great service and a lot of love and food is good good"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZeUwyZlpBEAE",
            "text": "Absolutely fantastic! I was driving by on my break from work and I passed by the intoxicating smell coming from the from of Jerk King and had to stop in. It smelled SO good, and tastes even better. Takes me back to my vacations in the Caribbean. The jerk chicken has that BBQ flavor and the sauces are top notch. I’m so glad I discovered this gem. Thanks again guys!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxdGFUVlpMV1pNYm1oUVJXOTFZVTVYZDFod2NHYxAB",
            "text": "Went to Jerk King for the first time. Got the jerk chicken and the brown stew chicken, both were delicious. The guy working there was very friendly, gave us a sampler platter to try a few other items. The curry chicken was really good, lots of flavor."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMHZtb193RRAB",
            "text": "I was in the area for just one night and was looking for something good to eat. I stopped by Jerk King and met Sean—such an awesome guy! He put together a platter for me with jerk chicken, rice, and Cali greens, and it was absolutely delicious. The food was full of flavor, and the service and hospitality were top-notch. I’d highly recommend this spot to anyone looking to enjoy some great food and friendly vibes."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VORDRvS3ZpanZxOTRRRRAB",
            "text": "Would you believe me if I tell you all of this was under $20. Soooooo good! Food is overflowing the plate! The owner and Luna prepared my food perfectly! My new go to Jamaican spot!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paS1drSkRUVlV0VlhwaVl6QnhWVVZKWjFkVE1FRRAB",
            "text": "Man oh Man... I just moved to Far Rock, and found this 💎 Jerk King Jamaican Restaurant! GOOD EATS, flavorful and succulent! 10 out of 10! Salute to the owner Sean 🫡"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd29pcFpBEAE",
            "text": "Best jerk chicken in Inwood! Sheldon was extremely hospitable and welcoming. Will definitely be eating there again."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcHJQRWFBEAE",
            "text": "Went over during a rainy day that I had off. Ordered the jerk pork with sauce, white rice, and cabbage. I also ordered an oxtail with white rice and cabbage meal for the following days dinner. Both meals were BOMB. A nice affordable price for a lot of food! My 2 meals cost about $36!! I had a meal here some months before, a jerk chicken meal, and that was a 10/10 too. The oxtail sauce is the highlight. Will be back again today LOL"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NeE4zRnRjVWRJWDJsM2JucEJTa3BIVVhwcmEwRRAB",
            "text": "I’ve been here 3 times within a month,\nEach time was so satisfying and pleasant.\nI ordered a $10.00 jerk chicken w/\nHard dough bread,\nand one of the owners gave me a free plate of food it was beef Lomein, fried chicken and curry chicken with a festival on the side.\nHe said for first time customers we offer a free plate of food.\nIt was so delicious I had enough for lunch the next day and enough to share.\nThe jerk chicken is so good and the jerk pork was amazing too I was hooked from the first bite.\nThe staff is so friendly and polite.\nThe young lady that works behind the counter is very nice she gives you service with a smile.\nI highly recommend you try it out and thank me later.\nThe food is 5*****\nThe service is 5*****\nThe portions are healthy and tasty.\nMake this your stop for lunch or dinner.\nIt’s was a great meal each and every time."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKZUZfTTc2dUliS0lBEAE",
            "text": "Great food. My lady is very picky and even she loved it. Sean was amazing as a guide through selections. Our main dishes of curried chicken and goat were both fantastic and the samples of brown stew, oxtail, greens, cabbage, peas and rice were all delicious. Jerk King is at the top of the food game. The prices are affordable and the portions are huge. It’s my new go to in Far Rock."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJTHN4Y3pIdTRId0RREAE",
            "text": "I can not rave about this place enough!!! First of all the staff are the best!!! So welcoming and friendly these are good people fr! The food was authentic, delicious, fulfilling, perfect amount of spice for you spice lovers and for a price you can’t beat! Definitely try it if you’re in New York, it’s one of those hidden gems in queens! Ate it all before I could take pics lol but the portions are huge I shared it with a stranger and they loved it just as I did!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyX3NxU2x3RRAB",
            "text": "One of the best meals I've ever had! We traveled from Texas and wanted to try some authentic jerk chicken. It was worth the trip! Sheldon knows how to make you feel at home, and he HOOKS YOU UP with the portions! He also agreed Jerry Jones needs to sell the cowboys. I wish I could give this place 6 stars, hope to be back soon!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VObWs5T3Y4bFlhTkpnEAE",
            "text": "Wow… I cannot tell you how amazingly inviting, kind and attentive the staff at Jerk King are. From the moment you walk in, you are made to feel like they’ve been waiting for you only, to arrive. Sheldon, the Gentleman behind the counter pays 100% attention to detail and does so with such welcoming energy, plus a smile - the same goes for the Gentleman working the grill out front.\n\nMe and my Friend each ordered the jerk chicken, the sweet chili chicken and a couple of festivals and all were very good, especially the sweet chili chicken - The juicy-crispy-seasoned ratio was crazy!!! I will definitely be going back to try their sides and other dishes which I know will be equally delicious!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJT1pzYW1KM2ZtMmV3EAE",
            "text": "The first time I came to jerk king was because Sean was grilling outside and I couldn’t resist the smell. Since then, I’ve seen them grow their menu, renovate the restaurant, and grow their team. The food has stayed outstanding the whole time through. Shawn and his brother are two hard-working restaurateurs and if Far Rockaway wants to keep this quality of food around they need to support these two in their delicious endeavor.\n\nLooking forward to them catering our next party."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNGZEVVBBEAE",
            "text": "Food deserves a high rating. Jerk chicken is Fresh Off The Grill and juicy not dry. Day offered noodles as well as rice. And they also have vegetables cabbage which is a necessity for me . I can't stand with Jamaican restaurants do not have any more vegetables . I will be coming back"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNXRpT1V3EAE",
            "text": "Thank you so much guys. Excellent Jerk Chicken AND Sides. Sauce is perfect. Friendly and kind service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLWHltWUtqd29xWnVBRRAB",
            "text": "I’m one of the pickiest eaters u will ever find, not from Qu, but I was out here visiting one of my dearest friends. We went to get something to eat a fell in jerk king a baby a the food bust with flavor, cooked well an I love that some of the meat drop of the bone. We was served by Sean, he has great customer service!!!!!!!!!! I advise everyone to stop by. I will be back\nSigned Bubba"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbDVDTTNBRRAB",
            "text": "The food is immaculate! I walked in right as they were about to close and I felt like I was part of the family. They tended to me with such care just as much care as was put into the food…\nThe chicken was super juicy yet thoroughly cooked and the seasoning was perfect down to the bone.  100/10 will definitely be going again"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbDdxZDN3RRAB",
            "text": "I am a true Far Rockaway native, and that's 1 of the things me and Shawn the owner had in common. I told him I came out to visit my sister from time to time and wanted some good jerk chicken. Shawn was the perfect host in that moment. He gave me some nice fresh hot jerk chicken and to be honest it was a little spicy for my taste, however I couldn't stop eating it. The taste was so good and gave a gave me a sample platter because it was my 1st time.  Love the food and service and will go back again soon"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4b2EyTnZnRRAB",
            "text": "I had their jerk pork with seasoned rice, cabbage, sweet plantains and oxtail gravy. I must say the food was good! They also have a few options of bbq sauces to go with your meat. Definitely going back to try a few other items"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3cllMRVl3EAE",
            "text": "When I told Shawn, the owner, that it was my first time having Jamaican food, he dropped everything to give me a whole sampler of everything he had. And man, it was all so good! You can really taste the love he puts into his food. Warmly spiced, savory, and perfectly balanced flavors that all blend with one another in the dish. In particular, the curried goat and oxtail are killer, though you can’t really go wrong. And he really hooks you up too. Gave me an absolute mountain of food, and this was after he had fed me a bunch in the store. Shawn is a gem of a man, and I’ll definitely be craving his food very soon. Thank you Shawn!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3N3RySGFnEAE",
            "text": "OH MY GODDDDDDELICIOUS!!! I have never left a review until now because this place is just too good. I was looking for a place to eat while on the road as an EMT and decided to stop by here. Customer service was impeccable. He said he’d take care of us and he Did! Mountains of mouthwatering food. Gravy DRIPPING down the side. Perfect amount of spice so that each bite feels like a warm hug. I could taste the love in every fork full. Price was nice. If you’re looking for a spot to eat look no further this is THE ONE!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMHVHMXJBRRAB",
            "text": "Good dude and great food. He let me sample some of everything, which were all fantastic. Everything taste like a flavor packed home cooked Caribbean meal. The jerk chicken was fresh off the grill and tasty."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPZWpfOVRpeHJuUklBEAE",
            "text": "Great spirit! Super Tasty food! Good Portions. Awesome owners! We had a great Experience defintly come back!\nNot suitable for Vegans but they can make a Vegetarian plate. Just a bit loud musik."
        }
    ],
    "reviews_count": 63
}