{
    "name": "Gino's Pizzeria And Restaurant",
    "place_id": "ChIJjbtPBqpowokRDqYwTTd9VeI",
    "grid": "QN13",
    "address": "10-38 Beach 20th St, Far Rockaway, NY 11691, USA",
    "rating": 4.1,
    "user_ratings_total": 588,
    "phone_number": "(718) 471-6825",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WaE0yOVZUVWRuVUU0NWVsTm1kMjVhYmtOdmNuYxAB",
            "text": "A must have everytime I come visit from California.  Always delicious and don't sleep on that garlic spinach 😋😋"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1MlUzWkRTVmhVTUhaVFpGSmllREpQYldFdE5sRRAB",
            "text": "service to fast.."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWcGJXRk9OSFZhY0VsWFVVWlVOMGN6TmxndGJtYxAB",
            "text": "Their pizza was tge bomb.com"
        },
        {
            "date": "2달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WR1lsUlZPRTVVVUhadVpYUnJWVzFSVDI1dVlsRRAB",
            "text": "Delicioso"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psbVpYSk9ibXB0ZDA5VVNsaEVOWFJmV0hOeGNGRRAB",
            "text": "Rude teach staff be polite"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SdVgwUlZabXRWT0hKWlVWTXRkUzFwZG1ONE5sRRAB",
            "text": "Bueno"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNncjVLSXFBRRAB",
            "text": "Very good pizza. Great service. Prices are good 👍…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKM2g0dW5tazctZmd3RRAB",
            "text": "The food here is pretty good. I order the chicken parmigiana with either spaghetti, linguine, or penne and it comes with a side/garden salad. They have good pizza too. The staff is ok and cool and the orders are accurate. I like to order from them and I was do order for pick up. I get ginger ale from them sometimes too with my order. The parking is not the greatest but that’s ok I still will come here and will continue. The prices are also very decent as well."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLMnU3SW5FNU1fcUxBEAE",
            "text": "Best pizza on the island and great staff. I come from California and always stop by for a slice of the pie! Delicious!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdXVlYTNnRRAB",
            "text": "Great pizza and very atmospheric place!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbmVTVmxnRRAB",
            "text": "Terrible communiciation and they told me after i showed them twice and waiting for 20 mins that they thought i was waiting for another order.\nThey still give you an attituide when you ask for it"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveWFmd2ZnEAE",
            "text": "Good food and quick service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbVBMeTdBRRAB",
            "text": "Been going there since high school"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNzdYU2pnRRAB",
            "text": "I had to use the bathroom. I got off the bus. I didn't intend to eat, but I did. They've got a nice lunch special: 2 slices for $5, but only until 3pm."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJemZ1RWFnEAE",
            "text": "Go there"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bnRqSFNREAE",
            "text": "Experience is great"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbk83VzFBRRAB",
            "text": "Pizza was fire"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cEszb05BEAE",
            "text": "Pretty good pizza, prices expected to go up in 2025. Pizza does not taste the same as 3 years ago. Good for the area it's in. Regular place. They leave the bottles for you to flavor your pizza without looking at you weirdly."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2alpMZG5nRRAB",
            "text": "The pizza was good, but not what is use to be like. The rest of my order was not so good. The buffalo wings came out soggy, the beef pattie wasn't cooked all the way, and the nuggets were very basic. The young staff was eating right on the floor and constantly touching his hair and seemed to have an attitude."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQNHZtQ19nRRAB",
            "text": "The food is good and the price is nice.....The Best pizza that side of Rockaway Most Definitely. Even the delivery guy is super cool 😎"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnODlLREZBEAE",
            "text": "Chane cheese. Doesn't melt\nNot the same"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzN3VtcGF3EAE",
            "text": "Super appetizing food, very nice service, would visit again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzMnFPb0RnEAE",
            "text": "I saw a hair on my food, never again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYak1udk5REAE",
            "text": "Always great service & food is amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURualA2MG9nRRAB",
            "text": "I love their pepperoni, pizza and slices. I’ve been ordering there pizza for years. they are affordable, and delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudEtPU0t3EAE",
            "text": "Best in Rockaway hands down"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3czYtRWRnEAE",
            "text": "Order a large taco pizza for delivery, the cheese was not melted. My son put the pizza in to oven for 15 min and the cheese still didn't melt.   I called Gino's back.  They told my son there's nothing they can do.   I called them back for a fund or another pizza.  They said they would come and return the money and never did...  The sad part of this situation, is  been ordering from them for over 15 year... I Don't understand."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuZ2J5ZHNBRRAB",
            "text": "They have yet to disappoint me in terms of food and timely service. If you are new to Far Rockaway it is a great place to dine in."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3cG9LQ0dBEAE",
            "text": "La comida es perfecta a mí me encanta la pizza de ahí pero la entrega para casa tarda demasiado casi 2 horas I love the pizza from this place but the delivery is the worst almost 2 hour for delivery one pizza..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiOFlTWmxnRRAB",
            "text": "Nice place but the Prices Change Daily"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyZ3NIcFR3EAE",
            "text": "Food was on par for the area, that being mediocre. Went here once, never went back. Inside gives off the vibes that I'm about to be stabbed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMdE1YNW13RRAB",
            "text": "Nice place it’s good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUbXFQc013EAE",
            "text": "Very good taste with good service"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJajVlY3l3RRAB",
            "text": "Almost a historic landmark in Far Rock! An institution! Open since the 1960's. Schoolkids of the 1960's are now bringing their grandkids to Gino's. Read other reviews of Gino's here. People move away, across the country but never forget. Must get Gino's when back in town. Classic NYC pizza. For real. Great pastas and dinners. Family owned and feels that way.\n\nInterior and dining area a bit rough around the edges. Appears to not have been remodeled since the mid 1970's. BUT very clean and safe. Have a public restroom that the owners try to keep up. But you see abuse by customers once in a while.\n\nAlways busy with take out and delivery orders. It's the biggest part of their business  I  bet. Read other reviews about ordering  and delivery tips.\n\nTakes credit cards. Deliveries by Gino employee."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxMjlUYVJ3EAE",
            "text": "Actual rating: 3.6 Stars.\nThis is an \"acceptable\" slice for $2.50. Moderate flavor in the crust. No particularly notable flavor in the sauce, undercooked cheese...\n\nIn my opinion, the mozzarella on a pizza slice should be cooked until it is browned. The changes in the fats, proteins and sugar caused by the heat is what gives the cheese its flavor. Without that, it's just melted cheese.\n\nThis is just melted cheese...\n\nUnfortunately, they can't heat it any longer to cook the cheese because the crust is seconds away from being at the burned point."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkeE5QMzNRRRAB",
            "text": "I have always eaten from this pizzeria. and the truth is that it seems that they made a change, everything was delicious, my daughter loved it."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0aWNPcVRnEAE",
            "text": "In for the day from AZ, and had to order a second set of food because the first was so good. Pizza is amazing. People kept coming in nonstop. Regulars."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnbElYUDB3RRAB",
            "text": "Since moving here, it's been hard to find anyone who makes good pizza. Unfortunately, the pizza here is mediocre at best. The workers are nice enough and they take debit. The sauce just doesn't taste good and the bottom of the pizza is often burnt. It's been 5 years and it hasn't gotten better so here we are I guess.\n\nGotta agree with the other review, Max's pizza isn't that great and the service SUCKS. They get my order wrong every time, I don't use them anymore either. Which is sad because Max's pizza is still better than Gino's 🫤"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPajVfVlZBEAE",
            "text": "First time and I’m sure that it will not my last time eating pizza from here. Plenty of seating for customers."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcUw3dUhBEAE",
            "text": "I gave their food one star because I have no idea how it tastes! I ordered a pizza at 8:15 pm, I gave the person on the phone my address and my phone number and they told me it would be an hour and that they would call me. Here it is 9:45 pm, 15 minutes before they close and I have no pizza. I’m calling the store to see what’s going on, no one’s answering it just rings. Then someone picked up and immediately hung up! Now my kids and I are left hungry try to figure out what we’re going to eat. Smh this is very inconvenient for me and my children. You guys need to do better as a business! Very unprofessional and I would not recommend ordering from this place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXblAtUUlREAE",
            "text": "I bought a pizza pie. Gino's pizzas are always delicious. I've been going there for years."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqN3RIeDhBRRAB",
            "text": "I stopped ordering from this place, every time I try to call for a delivery they never answer the phone and when they decide to answer they hang up. Can’t conduct business that way. I order from Boardwalk Pizza. Great pizza spot"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCNWEtV3hnRRAB",
            "text": "Well, most pizza shops in Queens, as a matter of fact all 5 boro's are somewhat alike with the look. But prices the tastes of the grub are different. As far as the pizza here I don't have any major complaints. As far as the prices. That depends on what deal you looking to get."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2by1ycEJnEAE",
            "text": "Our pizza was super large and good! However, the chicken and salads we got were mediocre at best. The man on the phone was also in a rush to hang up on me, which seemed a little rude, but the man who delivered our pizza was very kind and…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwLWRfdTJRRRAB",
            "text": "I gave Gino's 4 stars because I've only tried their pizza, which I found to be 5 star. When I've tried other items from the menu, I'll update. Overall, it's a great place! Okay, I've had time to order and sample other items from the menu,…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwNTllLUtREAE",
            "text": "If you love Italian style cuisine, then please do not I repeat do not waste your time coming here.This place is run by people that are not Italian, you can tell they just went and tried to learn the Italian way so they could try to make a business. They disgrace the business. Their pasta is horrible no flavor at all. it tastes like a cardboard. The spaghetti and meatballs will disapoint you its so bootleg.I tell you the pizza is soft and chewy. I love my pizza crispy crunchy and cheesey.I've tried coming to this place three times they keep failing me. The pizza sauce you can tell it's cheap. it has no flavor. like if they bought the cheapest tomato sauce to save money. last how you run a pizzeria and don't sell pesto pizza are you serious!! and barley have no deserts. Plz dont waste ur money."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbXZuSmpBRRAB",
            "text": "🚫☣️☢️🍕Gave this place a few chances and they fail everytime!\n1st..the guy that answers the phn always got an attitude sounds miserable always.\n2nd..the delivery is always atleast 35min to an hour more then they say mind u they're like 15 blocks from me\n3rd.. something is always wrong with the the order\nNo extra cheese when u ordered.\nNot well done when u ordered it..\nAlways \"forgetting\" the \"free\" soda\n\nBorn and raised in nyc eatin pizza in all the boroughs the \"hood\"\n\"Nice \" spots and this by far is one of the worst\n\nU might b askin why keep ordering and u would b right like I said in the beginning giving the place alot of chances asper they're the only ones around besides Max's but theyre trash also but we're done with them\nNo good pizza in this area\nMayb I should open up one and show them how it's done\n😆 🤣\n🍕  🚫"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNnbWE5OBAB",
            "text": "The pizza is good but the delivery service sucks! The guy on the phone was very rude as well. I called at 7pm and placed my order. The guy on the phone said “ Your order is going to take up to an hour to be delivered”. Its dinner time and I…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtc3NEQjhnRRAB",
            "text": "The food and customer service was good here. My biggest problem was the heavy smell, it smelled just like a nail salon in here so it was hard to breath. Never been to a pizzeria that smelled like that. Hopefully that was a one time thing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCaGRqalNnEAE",
            "text": "This place is great to deliver or dine in! I have been going to Gino’s since I was a little kid and everytime i went there food was delicious I personally love the plain cheese slice but a lot of their other food is great! I would definitely recommend for anyone in the area!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3ak1Ia0tREAE",
            "text": "Great customer service! friendly people and the food is good. i always get the pasta and its perfect every time. deliveries are never more than 30min and i live a good distance. absolute best place for a quick bite portions are amazing and its not expensive."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURldU1Hc3ZnRRAB",
            "text": "I went to get a slice of pizza and soda at this restaurant. It was slow when I went & no customers. I was standing for 15 minutes and NOBODY helped me mind you there was about 4-6 workers doing nothing just standing there. Then white customers walked in and was greeted/acknowledge automatically.\n\nIt’s giving RACIST. Google needs to allow 0 stars."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxanBMYlRBEAE",
            "text": "I have been coming to Gino's for 30 years.  Sadly I won't return.  The pizza isn't the same and the staff (which changes frequently)are rude. I observed them yesterday laughing at their customers and I dealt with a nasty cashier. Gino's should have more respect for the community that has consistently supported them through the years."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLbHRuZkl3EAE",
            "text": "Gino’s pizza is good if you buy a slice I ordered the seafood platter three years ago it was actually a large family size. Lots of seafood in it I even switched from marinara to Alfredo for $20 I was elated I ordered the same thing two…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDeUpPU2NBEAE",
            "text": "Gino's Pizza is just a place where you absolutely get delectable food and delightful service.  I truly make every effort to get to Motts so i can enjoy pizza and their other eleateries because its that good. Their are connected to almost ever individual that enters Gino and I recognize how both sides of the counter engage in very postive social interaction.  Mostly I realy enjoy their food and how other customers openly talk to the people at Gino's its healthy experience when the world is being told their lives are at risk ...the interaction is helping to foster mutual social coping mechanisms both customers and the employees at Gino's is familiar to all; everyone is ALL good as is your food and service.  Thanks Much RR & Jay"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndHNDeFJBEAE",
            "text": "A staple of the area and nearly landmark status, Gino's is consistently good New York Pizza. Period. Menu is typical NY Pizza fare. Aside from pizza, there are typical made-to-order dishes which are also consistently well prepared. As expected, this spot gets super crowded during after-school hours, holidays, and weekends. During these times, placing your order is like ordering a drink at a popular nightclub. So, be assertive. Garlic knots are good. Their version of Zeppoles is eh. Cinnamon sticks are eh. All that said, I just go for the grilled chicken salad, the pizza and knots. Plenty seating is available for dining in, but be forewarned— decor is abysmal. Place looks old and dirty, so just focus on your food and you're good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5OWZyNlFBEAE",
            "text": "The last time I was here was 40 years ago. I'm happy Gino's is still around. Yes, the pizza is still good!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwNVotSWRBEAE",
            "text": "Best pizza in the Rockaways. I've been eating here my whole life. I took my cousin a few years ago. She's not big on pizza. She always asks to go back. Best pizza,spinach rolls and beef patties."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRNHZQTUFREAE",
            "text": "Horrible horrible horrible. Where do I start.....my order was incorrect not once but twice. The first time the \"acting manager\" understood and gave me a credit I called the next day to use the credit I asked for him and the guy who answered…"
        }
    ],
    "reviews_count": 59
}