{
    "name": "Taqueria Los Carnales & Coffee shop",
    "place_id": "ChIJ_2myhERpwokRw7H0Y7JzLPY",
    "grid": "QN13",
    "address": "2-61 Beach 20th St, Far Rockaway, NY 11691, USA",
    "rating": 4.3,
    "user_ratings_total": 108,
    "phone_number": "(929) 623-2556",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWU1FVRTRNRkk1TjFkeFZHZDRkMWRDTWtGb1FrRRAB",
            "text": "I put in an order and picked it up , got home and tasted it only to realize I did not like it . The chicken seemed fake and not what I expected . The enchilada was very dry . It lacked sauce and flavor ,  I took one bite and called to express  this and asked if I could come in , return the plate(from which I just took one bite of ) and get something else . The person over the phone said they absolutely could not do that . I go there every so often and honestly this will be my last time coming to this business . It’s too over priced for the quality ."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SRk5YbGhWV05MVmpaNlRHaFVhMWRPYjNKUlNtYxAB",
            "text": "Delighted Place"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tobFkxVnhUMGxYWWt0S1FWZElOemxGU1VOSGIyYxAB",
            "text": "It was very nice."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdkxlSWVBEAE",
            "text": "The food is made fresh to order, with fresh ingredients and always tasty. Pictured are the chicken nachos. The tacos are good and the cheeseburger deluxe is good too."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204MFQwRlhSR0pvYUZKTVVHcDVTWE51ZUdSa1EyYxAB",
            "text": "I ordered tacos dorados. The chicken is boiled, unseasoned and hard to chew. I wish I can add a video so I can show how stretchy the chicken is. It made my stomach hurt and bubbly. I also ordered a chicken torta which they changed the recipe. There’s no cheese, no jalapeños, but they added a chipotle sauce to the chicken, which is not good. If zero stars was an option, that’s what they deserve.  Over priced and poor quality food!!!! YUCK!!!"
        },
        {
            "date": "2달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcVpITTVUM014TWxaMlgwNUZiRnB0WmxSRGRGRRAB",
            "text": "Excelente. Deliciosa"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWYVNXdHBkbUpaWkdoTmNrNTRjMmM0YVhSc1RXYxAB",
            "text": "Excelente servicio, el lugar muy limpio y la comida muy rica 👌🏻😎"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nNVoyZDBNMW95Y21sUmQwMTRjM3BZZVVOUFYxRRAB",
            "text": "EXCELLENT FOOD"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SQ1JYWjFNRXhOWmxOcGFpMTRlbUl5TTFWWmQwRRAB",
            "text": "Food was not good barely any meat in the burritos and presentation was sloppy"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoeWEwNXRXbUozY205SlFrdG5jMkV4VGtRd1VsRRAB",
            "text": "Soooo delicious"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGMlVrZEhhVTFwZGs4eU5IWk9hWEZsZUVwa1NYYxAB",
            "text": "Omg ,súper riquísimos los tacos de birria son exquisitos ,súper deliciosos los recomiendo ,puede comer adentro y te atienden muy amable ."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNR2V3dlh0NnRHZHdRRRAB",
            "text": "I love coming here. Great juices! Love it very much! ImThey have passion fruit juice, pineapple juice, coconut juice, horchata, and cantaloupe/melon juice etc.! 💕 It is delicious! My friend orders the Mexican hotdog and loves it. It comes with ketchup, mustard, mayo, pickles, onions, tomatoes. He said it is very good! My other friend orders the “ Tacos dorados” with chicken and they come with lettuce, tomatoes, onions, cheese, and sour cream on top. My friend says these are very good too. Maybe could use more flavor he says but still they are very good! Photos are attached! They have a good Mexican steak torta which is a steak sandwich that comes with Mexican cheese, beans, guacamole, a sauce, lettuce, tomato, it is very good and I like it!!! The yellow lemonade in the photos with the steak torta is not from them. I also love their brown juice which is “tamarindo / tamarind” !!! Their other juices are very good as well !!!! 😋"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUFZtY3RVRmhKWkZoa1JtbDNlVkpMWkdKVU0yYxAB",
            "text": "I ordered three chicken tacos they were dry and I ordered two pieces of his chicken they didn't cut the quesadillas tacos dry food overall okay"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poblNWZDNXbkYxV0ZsR1pITjJkbGROUldGU2RVRRAB",
            "text": "Avoid this place I had the pleasure of visiting an authentic taco restaurant in Harlem a few days the employee was patient and the owner came to check how we were multiple times the place was packed with people.\n\nThis place had a few customers which should have been the first red flag! The employee was on his phone and had poor customer service, super rude.\n\nSupport another small business with competent employees that are kind to customers and have decent food, this establishment isn’t one of them!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkRE9EaHZWRGhEVEVaa2JFc3paSE55TldkTVZFRRAB",
            "text": "i love the carne enchilada taco! i didnt know what it was but is really good. I also like the passion fruit juice and the other drinks. I come to eat the mexican food here because there is not many places that actually know what mexican food is really like. they have gorditas, picadas, huaraches, chilaquiles. these are foods many people dont know about but they have a variety of foods to choose from!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWVRsbFFjMFUzVEhCUk0zVTBWVmhpVVY5WFVuYxAB",
            "text": "I’ve been coming to Los Carnales quite a bit because it’s a small local spot and usually convenient when I just want something quick. The food is honestly mediocre — not bad, not great — but good enough to get you through the day. Prices are fair for a small business, with most dishes around $15–$20 after taxes, which I don’t mind paying to support local.\n\nWhat really bothered me this time was the customer service. I ordered a coffee, tasted it once, and immediately brought it back because it wasn’t right. The middle-aged man at the front refused to remake it unless I paid again — even though I didn’t even drink it. His only solution was to add more sugar, which didn’t fix the problem.\n\nAs someone who comes here frequently, I really expected better. I understand it’s a small business, but a simple remake for a loyal customer would have gone a long way. Unfortunately, this experience makes me think twice about coming back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21reWQwcEVkVkpwUVZJMmExRjFSbGhyTTFGRGJrRRAB",
            "text": "Food and service is amazing. And they even play DBZ on the TVs sometimes."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkWWVtNVpTbmR3VWtwM1dUbGtNbEYyYkhkbExWRRAB",
            "text": "Comida muy rica ,tacos,tortas quesabirria,gyros,y mucho más\nTortas matahambre y birria tacos 💯"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLSG02dkNGajZxcC1RRRAB",
            "text": "La comida siempre esta hecha fresco. Buenas porciones,buenos precios. Agradable lugar. Deliciosos churros,empanadas,tacos de camaron , birria y torta matahambre."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdUpMUWJnEAE",
            "text": "Spring rolls are really good. Al pastor tacos are great 👍they have a birria torta now and is so good!! The shrimp tacos are so good too, they come up with very good stuff. I like the variety of meals."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMEoybmp3RRAB",
            "text": "Food was average, they charge for sauce."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbTluOWZnEAE",
            "text": "Buena comida,buenos precios y muy rápido"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNva3JtVVVnEAE",
            "text": "Hice una orden de nachos cuando el delivery me entregó la orden NO TENÍA POLLO cuando fui a reclamar no me la arreglaron, cambiaron oh reembolsaron mi dinero ALCONTRARIO su servicio al cliente tienen que mejorarlo"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNva3I2MExREAE",
            "text": "Pésimos servicios, los trabajadores son súper irrespetuosos.\n\nHorrible service, the workers are disrespectful"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJc2ZUWTJnRRAB",
            "text": "The food  is so so so good ! The prices,  service and decor make it worth the travel 💘✨️ Give them a chance and please be kind to the staff as they work so hard to provide fast service!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJa3REQ3l3RRAB",
            "text": "The people here are super respectful and kind the food is always amazing. This restaurant decoration is vibrant and has a strong culture like your really in Mexico. The inside smells fresh clean and the temperature is just right truly the perfect Mexican or South American food place"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBODVLZTN3RRAB",
            "text": "It took a long time to order and I found a hair in my coffee"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfLXFmQ1VBEAE",
            "text": "If you are in the area, these tacos are sooo yummyyy!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzZ01QSkVBEAE",
            "text": "Best Mexican place. You can take out or eat in.  Food is always fresh and tasty 😋.  Staff is extremely friendly. I highly recommend coming here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYN3NXQXBBRRAB",
            "text": "Worse service I ever had in my life. No substitutions the lady at the counter was rude. They wouldn’t even me take an extra box when im trying to ofer $100 worth of food. Dont waste your time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIcmR2QTBnRRAB",
            "text": "Everything good and delicious as always. 😋😍\nWe ordered quesa birria tacos, torta de asada and this was our first time ordering pancakes, egg and sausage for breakfast and let me tell you’ll it was sooo good! My family and I love ordering from here."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3Z2R6c2RnEAE",
            "text": "Super recommendable y ambiente familiar,  la comida está deliciosa y muy variada para todos los gustos, tanto para peques como para adultos, de verdad lo recomiendo especialmente todos los taquitos mexicanos, los de birria una delicia y las aguas estan sabrosas, horchata, piña y limonada mis favoritas. Pidan las picadas para sus peques, se las pueden hacer Al gusto y sin picante🥰 si asi lo decean."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNybGV1U0VnEAE",
            "text": "The birria tacos are really tasty and I can tell that their made by a Mexican chef.  They also have other types of food like burgers and gyros and they always make it at the moment. It's always fresh and scrumptious. The aguas frescas are also very satisfying, especially the lemonade they make. The place is beautifully decorated, with imagery of their culture spreaded across the place. The prices are worth it and so is the quality of the food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMbHFIS2FBEAE",
            "text": "I have no idea what all these bad reviews are about but I can say that EVERYTIME I have ordered from Los Carnales the food is always fresh and made to order. Prices did increase a little but that is understandable, The staff is so nice as well > you wont be disappointed"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMeXJmbTdBRRAB",
            "text": "I often come here to enjoy the fried quesadillas. Everthing is made fresh always and worth the wait. I also order for delivery and the delivery guys are always nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6cjZ1a2h3RRAB",
            "text": "Not tasty food. Waiting time too long. My Mexican friend told me his food is not good tasty. Huarache doesn't look like as photo and steak taste bad."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUeDdIcmNnEAE",
            "text": "First I'll give my opinion before I ate... If your Mexican your gonna be disappointed tacos are lacking everything essential to a taco. I ordered tacos al pastor it was not fresh, it wasn't seasoned even the tortilla could have been better. No sauce of any kind unless you ask for it? In what world do you have to ask for the sauce that belongs on every taco. I order gorditas and they were honestly sad looking again no sauce no jalapeno and the meat looked like it was boiled, carnitas Gorditas should have had a lot of flavor it had none. The best thing they mad was the churros I would go back for more they were authentic and freshly made to order. I also had nachos. It was eatable to say the least. Really sad nachos even non Mexicans make better nachos you guys gotta do better... Not much competition for them so they could have easily hit a home run with the food but it was uninspiring... That night my stomach started bubbling something crazy and I have been sick as a dog for four days now. Eat here at your own risk"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUeWRDUjRBRRAB",
            "text": "Nice place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdTV6czZRRRAB",
            "text": "Real good authentic Mexican food andthe Philly cheesesteak is on point!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbWNLWmdBRRAB",
            "text": "Best tacos ever"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOdm9qSHF3RRAB",
            "text": "Mexican food is my favorite and all these “authentic” Mexican places (with no Spanish workers let alone Mexican workers) cannot compete at all. Took me a while to try it out because I was tired of being disappointed but they did NOT disappoint!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCbFk2MHRBRRAB",
            "text": "Had the cheeseburger and beef tacos w/out the fries\nTotal : $17.95\nThe presentation was exquisite, especially the tacos. The taste for the burger was good. The tacos were dry. Dry. Dry. Dry.  Soft shells.The cost was ok...I guess. Probably should've been $15. But I'm definitely going back to try their other menu items - dont be discouraged to try them out\nAlso the girl at the front was very sweet. Only reason why I gave them an extra star is because of her"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCek9Id2t3RRAB",
            "text": "We order from this restaurant all the time. I work at St John's episcopal Hospital and our hospitalist team order from here often.  The food is delicious, clean and always fresh! I have no complaints and all compliments! And may I add, the Horchata is a must have!! This spot is a real Gem in our neighborhood ,Lets support local!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NU1tcEhBEAE",
            "text": "Love this place, a great way to spend Taco Tuesday. Great and friendly service."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaWZXTnR3RRAB",
            "text": "Omg so delicious 5/5. Very authentic Mexican food with beautiful presentation. I really liked ambiance and friendliness of the workers, it really reminded me of my times in Mexico. I can recommend this restaurant to you and it is really a gem to have in the neighborhood that it is situated in.\n\nMuchas gracias, la comida estaba exquisita. El negocio estaba también muy limpio y aprecio su amabilidad durante mi breve estadía. Es muy auténtica la comida y excelentemente presentada 💚🤍❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNy0tY19BRRAB",
            "text": "No other restaurant in the rockaway area that claims to serve authentic Mexican food can compare to this spot. This is real authentic food with the real flavors of Mexico. Had the quesabirria and chorizo tacos and was amazed by the overall taste. Definitely will be coming back. The only authentic Mexican spot in the area!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROcmRLWm1nRRAB",
            "text": "The employee in the front is so rude and all I did was ask for a tea and he wouldn't sell it to me. I don't understand why he is working there if he is just bringing down the quality of service and has a nasty attitude. The food is overpriced and overall the experience was horrible. Never will I return again."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobWE3SDFnRRAB",
            "text": "Me encanta ir a este lugar para cenar. La comida está muy rica, y puedo estar en paz cuando me espero por mi comida. Realmente recomiendo ir allí si puedes!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwanJxWl9RRRAB",
            "text": "I order a taco salad with everything on it to go but when I got home they did put anything on it. They only put the taco with chicken and lettuce and alittle bit of cheese and 3 black bean."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5aHU3c01BEAE",
            "text": "The food is delicious I ordered my self tacos de birria tortas for my kids I highly recommend this place"
        }
    ],
    "reviews_count": 50
}