{
    "name": "Sunny",
    "place_id": "ChIJqWoaB6powokRYc6KV14Y5V8",
    "grid": "QN13",
    "address": "10-41 Beach 20th St, Far Rockaway, NY 11691, USA",
    "rating": 4.2,
    "user_ratings_total": 269,
    "phone_number": "(347) 926-4300",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVFR5MVZWalJwVWxWaVZscEdTMUptTVZaMVVIYxAB",
            "text": "The food was absolutely delicious"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GU1oyUlJlRlE0ZUdWbUxXRlJRako1TjBaTGRtYxAB",
            "text": "Mi gusta"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwNFltMWxVbXRUYzNocVYzSXllbVJLTlhsU1ltYxAB",
            "text": "Good shrimp hibachi!! Always fresh and\nGood"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5cnJMWVZREAE",
            "text": "Great food by Far Rockaway standards"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJamVUTnlnRRAB",
            "text": "So sad ! I got my delivery 30 minutes later and to make things worse cold 👀 never ever again"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMEstSTJnRRAB",
            "text": "This RESTAURANT IS ABSOLUTELY WONDERUL. They menu is fresh and healthy. The Staff is so NICE, Warm and welcoming. It’s Always Clean . IM NEW TO FAR ROCKAWAY and I Love This Place"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbHJUaGRREAE",
            "text": "Sadly, the portions are much smaller than usual.   We used to LOVE ordering from here, even though the cost ws like WHOA, but now it's just less for more and I don't like that about ordering out now.\n\nWelp, so the cookie crumbles lol"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBOWUzbjJRRRAB",
            "text": "I rarely give out perfect reviews ! Food is amazing !"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMTlYbU13EAE",
            "text": "Excellent service 💯"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdzVUN19nRRAB",
            "text": "This is the secret Of Far Rock.  I LVE Sunny, please continue to be the best around here."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdnV5VzNBRRAB",
            "text": "Worst Burrito ever.  With Avocado in it. Came apart. Smh. I threw up right after I ate it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuMF9fdGx3RRAB",
            "text": "Food is good and service even better.. prices are very reasonable..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3cEphVjdRRRAB",
            "text": "Just moved into the neighborhood sometime ago I really enjoy the food. The hibachi style lo mein and chicken is really flavorful. The sauce adds another layer of flavor."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtMkl1Y2dnRRAB",
            "text": "Chicken tastes like it not cleaned throughly , it doesn’t taste the same"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMdElXWUV3EAE",
            "text": "It’s very good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMcWFfQnN3RRAB",
            "text": "No taste but hot"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6X09DRzV3RRAB",
            "text": "Small portions for breakfast, A food was just okay for me"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6dDlpU3BRRRAB",
            "text": "The food is GREAT."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUdHJDZmJnEAE",
            "text": "O M O R I"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREaGFXUmZnEAE",
            "text": "Great tasty food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0aTVpQW1BRRAB",
            "text": "Just called this place to asks the cooks about a food allergy and they dead just hung up on me. Like I asked my question the day directed me to a cook and gave him the phone and directly after I ask him if he knows any dish that would be safe for my sister to eat he just hangs up. No words no nothing he just dead hung up. Pretty unprofessional and unfortunate but if this is that kind of place then ofcourse"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWek9qWERBEAE",
            "text": "Person on the phone was genuinely not very nice. Both times I called just moved here yesterday I will say however the food is brilliant and I recommend it unless you don’t like speaking to rude people."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKMFoyb3d3RRAB",
            "text": "Fantastic service. We went there 2 nights in a row to try new things on the menu while on vacation."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdklydjRRRRAB",
            "text": "DO NOT EAT FROM HERE BUG IN MY HIBACHI  #1 I ALWAYS EAT FROM HERE & NEVER EXPERIENCED THIS !!! VERY MUCH DISAPPOINTED THAT A BUG WAS IN MY FOOD !!!  I HAVE VIDEO PICTURE COULD NEVER DO THE JUSTICE . THEY ONLY LET YOU POST PICTURES THOUGH OMGHAAAAA IM SO DISAPPOINTED"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4eFAydkR3EAE",
            "text": "Food is decent. Just not happy with the time it take to deliver or even when you go to the restaurant and put in a order, it just takes a long time to me. Staff is nice and friendly"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4b192cVpnEAE",
            "text": "You better order from GrubHub or door dash if you want delivery to your apartment door. With pacific instructions!\nThey will not come to your apartment ordering from the restaurant!\nSo if you are alone with an injury, they don’t care.\nDon’t give tips if you have to come down to the lobby to get your food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbnBTTXBnRRAB",
            "text": "The food is very good and fresh and the chicken is really chicken and not mistery meat I would definitely eat from them again this place is a good look for FarRockaway they just need boba tea ☕☕☕"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbC1QLUpnEAE",
            "text": "We love ordering from Sunny! Food is really delicious and price is just right. Our favorites are the hibachi chicken and steak with the fried rice and the chicken and steak quesadillas. Depending on the time of your order, delivery can sometimes take an hour, but on a not so busy hour, can be delivered at your door in 30 minutes. Definitely recommend 👍"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoOXFfRlRREAE",
            "text": "Ordered the shrimp and salmon hibachi. Let’s just say I won’t do that EVER again. The food is MID, salmon is a small skinny piece and it smells fishy. Meaning it wasn’t cleaned. The salmon is dry too. The shrimp is seasoned and smells great, but on the bland side which I don’t mind. I got egg fried rice, and it’s literally just bland unseasoned rice with egg pieces. They give you a bunch of it too. Their brown sauce is OK but too sweet. And last but not least, THE VEGETABLES. They served the shrimp and salmon with a big plate full of vegetables underneath. I paid 19.00 I want SHRIMP and SALMON not a million veggies. It’s a rip off honestly. Wouldn’t recommend the hibachi, they give you what you ordered but with a plate full of veggies underneath. It isn’t real hibachi."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCM1lqNFZREAE",
            "text": "The regular nachos aren't what you'd get most other places, because most other places give you cheese sauce instead of melted cheese slices. Also the lo mein was subpar compared to just about any other Chinese restaurant, unless the lo mein was supposed to be healthier and that's why it was less flavorful? I'd go so far as to say a street vendor makes it better."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNbmZPaVZnEAE",
            "text": "Most of their dishes are good. Their Mexican dishes were great until they stopped serving guacamole....their burgers are not that great. The cashiers need to be trained to provide better customer service and to prioritize orders on a first come first serve basis to prevent issues."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRMTVtZVJREAE",
            "text": "The food is delicious. The girls at the front are always very helpful. However when ordering for delivery make sure to ask how many delivery drivers they have available or if they are really busy because delivery can take up to an hour and a half sometimes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcWNENGNREAE",
            "text": "I’ve bought food from here many times and I never had a problem. Hopefully it stays like that because I’ll be highly upset if I find hair or anything else in my food… So far, so good."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDaXRHMEFnEAE",
            "text": "I would give more stars; but one of my visits I was attended to by a female with a nasty attitude. I have never seen her before.  I only eat one dish here.  I enjoy it immensely and purchase it everytime I visit Far Rock.  I am, however,…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRZzUza1ZBEAE",
            "text": "Love their food and I've had almost everything on the menu. Their place is always clean and very good customer service especially the owner. Coincidentally the owner's sister works next door and she's been doing my nails and eyebrows for years. Very nice family and I will always go there."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURneU11c2FnEAE",
            "text": "Love the Food, Love the owner very sweet & nice PERSON . It's a Family Business Wife and Husband in the kitchen ,& his kids in the Summer time.The place is always clean, Food always Fresh, Music always popping. Reasonable prices and they do Catering as well..I stop by to eat Dinner every other Friday ...."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNROUlDbTNnRRAB",
            "text": "I placed my order at 12:40 pm  today 3/7/2017 I called  at 2 pm and asked the receptionist what happened to my order and she responds with \" I don't know\" I missed my lunch break and never got my food ! this is the second time this happens!…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVeTg3WE1nEAE",
            "text": "Love this place!! The food was amazing and the white sauce is to die for. They used to be generous with it but now they charge for extra. Other than that they are good."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHd3FiNE9REAE",
            "text": "The food is just ok.  The woman taking our order was very pleasant.  If you need a bite and not sure what you want Sunny is the place to stop."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtdzRxLUdBEAE",
            "text": "So dissapointed I ordered there chicken and shrimp hibachi and a long hair was in my food so much so it broke off in my mouth that is unacceptable.  If I can post a picture I would."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTajRlTzhnRRAB",
            "text": "Yesterday was my first time going to Sunny Restaurant, and must say the tacos and mozzarella sticks that I ordered there tasted so good! I truly recommend this place."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3cE42ZDZ3RRAB",
            "text": "I order from them often and the food is always good. Delivered in a  Timely manner an is worth the pay. Have not had a bad meal from them yet"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnb2NMbUhBEAE",
            "text": "Only thing thats not really bad is there chicken tenders anything i wont order or recommend ordering cause there expensive and the food don't even be all that for the price. Order honey garlic chicken before worst thing i ever did lo mein…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBNDRDdDRnRRAB",
            "text": "Buffalo wings & tacos are good. Delivery is an hour+ wait (better off picking it up)so the fries usually goes into the trash"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2dk1mSzV3RRAB",
            "text": "Food was delicious and portions were fairly priced.  I didn't like the \"fish\" that was used for the fish tacos;  so I took away one star."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtc1BqVzRRRRAB",
            "text": "Overpriced barely any \" hibachi\" chicken the term hibachi means its cooked over fire not on greasy grill ,rice was gross,oily 9 bucks for that slop, go across the street to ginos,at least you get decent food there"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHMmVqaHFnRRAB",
            "text": "Food used to be good.\n\nDisgusting and salty as hell...chicken hard as steak and u could barely tell difference between steak and chicken fried crispy hard... garbage"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVZ29XZVZnEAE",
            "text": "Don’t get there cheese fries it’s literally just crinkled fries with shredded cheese on it ☠️You better off going to new York fried chicken down the block across from the teens library , next there tables were filthy when I walked in every…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvOHM2cXZRRRAB",
            "text": "The owner is very nice n the lady that cooks with him dont know if thats his wife but I've been going there since they opened their food is always A1 great"
        }
    ],
    "reviews_count": 49
}