{
    "name": "Margie's",
    "place_id": "ChIJvzVf789pwokRiG6uAryLPN0",
    "grid": "QN13",
    "address": "108-10 Rockaway Beach Dr, Queens, NY 11694, USA",
    "rating": 4.6,
    "user_ratings_total": 408,
    "phone_number": "(718) 474-1216",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GU2VreExNa2xNWmxSRWN6WXhUMXBxWmpVMFVrRRAB",
            "text": "My sister had her birthday here. When I tell you they kept bringing food. It was nice.  The food tasted great.the sizes and portions were perfect on everything except the sausage, they were huge!!!! The fruit was great. The pancakes  breakfast sandwhiches.... everything for the group was present able"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaeVlYVnhlbll0VjAxeVJVaHZSVzAxT0haRWRtYxAB",
            "text": "Always a great meal, and great ambiance. Delicious cocktails as well."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kT1VFZFBOazFQYVdkdVZDMUNaVmRFYm1kNE1GRRAB",
            "text": "Delicious bites and fast/friendly service!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poQmQwcHVOa3hSTjB0dFIxbHlWakIyVWpGSE4xRRAB",
            "text": "The salads were absolutely amazing. Several of us were there. We had steak one with salmon and the other with chicken all were delicious. We had the wedge salad. The dressing was phenomenal. Generous portions. Their buffalo wings and tuna, rice, cakes, or superb"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sb1ZWcEdabUl5TkVWQlNuUTVja2N4ZUZwdE1uYxAB",
            "text": "Food & Service was amazing. The manager P.J. Tokash came over to our table to make sure everything was A OK. Which of course it was. He was very warm and friendly. We will\nDefinitely be back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toeGEzaG1MVWQ0VlRsalRFTk5iVXBqU1RoVVZuYxAB",
            "text": "Very nice food 👍"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213NUxWVnZVemd0TTFCTU0zUndYMkZCUTNoNVpWRRAB",
            "text": "The server was very attentive and food came out relatively quickly. Their cheeseburger was mouth watering and their branzino was delicious, but was a very small portion for the amount we paid. Only other negative was i wasnt crazy about their dirty martini, but will definitely come back to explore the rest of their menu."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214aWJUZFJlVGxmUkVvMk9VNVRjV05HTVc5bGVHYxAB",
            "text": "Food was fine and the service was somehow didn’t exceed to the expectations. Wouldn’t recommend for someone who is vegetarian!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVd1ZEQnZOV041TTJaRVExUllORGxzZVZGNU0zYxAB",
            "text": "HIDDEN GEM in the Far Rockaways NEW YORK!!!\nit won’t. break your banks vs NYCITY, BROOKLYN etc"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWcVRqUkRVVGwwU1VOeFNpMWllVUZNVEdwbFFrRRAB",
            "text": "Delicious.  The onion soup awesome.  The food is so good.  Service excellent.  Love this place.  Highly recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wd2FYWlNibGhZYkZSNFYxVndkVEpTY0V4SlNGRRAB",
            "text": "Love coming here for dinner their food never disappoints. Minus never having the lamb lol. Daily specials are great. Would recommend to anyone."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oUE5XRkZRMGR2T1hCMldHeFZPWGd6U0ZORVdFRRAB",
            "text": "Ehhhh, rough brunch experience here. Orders were messed up (items missing, wrong items brought to the table, etc). Staff was kind and fixed the errors but it generally wasn't a great experience. Feels like the place needs a lot of help dialing in consistency and quality."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TVZWRnBOVTFYVTFjMFkwcEJaamQ0UmxaSFRtYxAB",
            "text": "Everything about Margie's is amazing. From the drinks to the food to the staff. Nice place for a quiet date night or with a group of friends."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21keVlYTTNNV3hpU1RoU1VtOXlSMGM0VFdaRE9YYxAB",
            "text": "Highly recommend! Top tier food quality, delightful service, & welcoming atmosphere. I almost forgot that going to restaurants used to be this enjoyable! You can tell they really care about their customers experience and every detail has been thought about. I will be returning!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RFZXdFZRemMwV1hCbFlqRnBjVEZTT0VwS2RXYxAB",
            "text": "Oysters are amazinggg!!! 10/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psNmEzbExVV0o2YWt0RFNWTkRSMHhUTldrdFMwRRAB",
            "text": "I got served a moldy tomato with my steak and eggs. Instead of comping the meal they offered me two free irish coffees. When the check came I asked them to remove my meal from the bill and the waiter refused. I couldn’t believe it. The least you can do when you serve someone literal moldy food is take it off the bill. I’ve had good meals at Margie’s but the quality and service is all over the place, very inconsistent and this moldy tomato incident kinda took it over the edge for me. Do better Margies."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwbldtWlJUSGRYUlVaT1JsWnBUUzFUYTB0dFIxRRAB",
            "text": "Great spot!! Super cool vibe!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkb1JVbFNRekpSYjJGMGNYaENkR2d0YnpKSlEzYxAB",
            "text": "Okay, we were not at all prepared for the dinner we had at Margie’s. It’s a premium location, close to the beach, tons of summer traffic. They could serve mediocre fish & chips & still probably turn over all their tables every night. We could never have imagined how outstanding the food would be. The brick chicken was exceptional—half a chicken, crispy skin, mouthwateringly moist. Massive portions of mains and sides. The prime rib (on Tuesdays) was incredible. A huge slab of perfectly-finished meat. Also outstanding sides—oh, the chicken came with some kind of pickled peppers that were fantastic, too. Just totally delicious, a bargain for the amount of food and the quality. Broccoli done to perfection, too. Great table bread. Friendly, low-key, unassuming, and really, really fabulous food. We can’t wait to make it back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVGVEWmlhekpHVXpaMGFVc3RSR0Z2ZVdaNE9HYxAB",
            "text": "Christian was our waiter and was fantastic, had the ultimate food recommendation, also happy birthday!, the musician was absolutely fabulous, and I felt like I defeated a boss on the final level of a game as a reward dining here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WblVXbHFURnBQYVZGc2IzRkhhbUZaWTI5alZIYxAB",
            "text": "Fabulous! Food delicious and Ayesha looked after us perfectly!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kbk5HeFlibXhRVVMwelh6aHJkazluTmkxaGNuYxAB",
            "text": "Great venue - food/ drinks- service. The best"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4RFdGZHVlRm94VEZwU1RHMTROR3h2WlhWQ2JIYxAB",
            "text": "Avoiding to compare our experience a tMargie's with anywhere else, I can say truly say this was a 5 star experience!\n\nThe food, service and atmosphere were all on point!\n\nFor starters, I planned ahead for.a concert we were attending at the adjoined hotel. I made a reservation in advance thinking I could secure a seat directly after the performance upstairs. I realized the last reservation ended before the concert would potentially end but I took the risk.\n\nMy wife and I traveled from NJ (close to Philadelphia) for this concert and I wanted everything to go over well for one of our rare nights alone without our child. We left our BnB and arrived earlier than expected so we had time to kill. We decided we were hungry and said why not grab a few apps beforehand and still come back for \"dinner\" later. The receptionist accommodated our later reservation for the earlier time despite reservations being full. It seems we areived just in time considering the flood gates open just after we were seated.\n\nThe service was attentive and very particular. We didnt find any starters that peaked our interest so we wound up oreer burgers. My wife and I both had special requests and we expected them to get it right.\n\nThe wait wasn't long at all but we got an apology for the long wait. We appreciated the gesture anyhow. They had a runner to expedite and serve our food but our waiter intercepted him when I suppose he noticed an inconsistency. Nice move! I watched it all play out like a movie. He wanted to ensure the order was correct before sitting it down in front of us. The adjustments were made and the burgers were brought to us.\n\nWhile being served complimentary bread in the interim we were visited by the manager and receptionist who walked the floor to greet all the patrons.\n\nThe burgers were cooked perfectly. Im a burger snob. I wouldnt say it was the best burger I've ever had but it was the best cooked burger Ive ever had if that makes any sense. My wifes was medium with an exterior char you would assume to be well done and mine was medium well. Infirgot, we did sub the fries for truffle and got regular instead but again our waiter was on top of it. It didnt impact our experience.\n\nThe atmosphere was modern \"beachy\" vibes and the customers and staff were all diverse. Brownie points for diversity!\n\nThe culture of the restaurant was slightly above casual but the tone itself was very casual. We felt welcomed and appreciated while we were there. We shared laughs with the staff and they gave an aire of genuine concern."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrMVpGZDBhSEJwV0RCcVFUTkViVGhKYUZCaGFFRRAB",
            "text": "Truly excellent food and service. Kat was our waitress and couldn’t have been more accommodating and helpful with her recommendations. Caesar salad was outstanding, as was the pork chop. Little details — like crunchy bits of croutons mixed into the Caesar dressing to have with every bite, or a beautiful roasted head of garlic to eat along with the pork chop and its delicious gravy – really made the meal stand out. The atmosphere is very nice, but I would prefer it a little quieter, which is why I only gave four stars there, but that is just a preference.  So glad to have another good option in Rockaway."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oc1ZXNXdTM2gxZUhWUWQwZFhhV0ZQVWpGNmMzYxAB",
            "text": "Diana is the best! So lovely and took care of us. She even tried to accommodate a request for a club sandwich that was off the menu."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rNGNETkhVbkZPY0ROemMyVmFiMjk1WjNScVkyYxAB",
            "text": "I cannot say enough about Margies! The appetizers and main course we amazing. We ordered a bottle of Bordeaux to go with our dinner which was also fabulous.  Our server Diana was fantastic and very well versed in the menu and wine selections.  She had a pleasant and welcoming personality,very much enjoyed her demeanor.  The atmosphere was beachy modern and beautiful.  I very impressed by the wait staff and experience all together. I am looking forward to my next visit this summer. Oh,and don't forget to order the cookie skillet for dessert! Phenomenal!\nSincerely,\nMarialice Baran"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSM2JGRmZORTF4Y21wTGJUSjFaMFZWV0V4VllWRRAB",
            "text": "Diana was my server and was amazing. Service was phenomenal and the food was really good. Very pleasant experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMlVYTjNTWFJmVWtnM2RsbGFiVWxmVldReGFsRRAB",
            "text": "Great Restaurant and Delicious food and yummy\nDesserts.  Beautiful Rockaway Hotel"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxUmRYbEdjMFJZWkhseldIaDVZVXhxUld0aWJHYxAB",
            "text": "Food was great! Diana was amazing! Give her a raise!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psaE1UUjBVVkJtUmpGaVIxZzBSMU00VUZOSE1tYxAB",
            "text": "Diana was exceptionally kind and attentive. Thank you so much!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gc2QxaFBPVFYxWlRocE9FaHZPWEoyTlVkMmNuYxAB",
            "text": "Margie’s is no doubt a favorite of mine! It’s always a go to for my family and I when we want a relaxing atmosphere with good food, service, and drinks. From the welcoming staff, to the delicious food, it is always a pleasure to dine at Margie’s. Manager PJ always welcomes patrons with a smile as well as good conversation. We always look forward to his company and warm welcome! Definitely check out Margie’s next time you want a great night out with family and friends!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCbFVVRTNVVFJYTFc1UlJFaHVjemhuYW5CeGFsRRAB",
            "text": "Adorable restaurant with an amazing atmosphere and awesome service! Food was delicious. We split several appetizers and all were amazing! Highly recommend the Moroccan wings."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VeVEzaHlOalJFTUVSaVZVMTFkbk5EYjJORmNsRRAB",
            "text": "Great food 😋"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WbGIzSm1ZVUpJTUZJMWVWODVPSFZEVTJwdFIzYxAB",
            "text": "My fiancé and I spent our 3 year anniversary at The Rockaway Hotel and we found our new celebratory spot for dinner at Margie’s! We loved absolutely everything we had, from drinks to appetizers to desserts. The staff is so kind and the service is top notch. Shout out to PJ for being the man!! We cannot recommend this place enough.\n\n- Vic and Paul"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5amQzb3pWRWh5ZW1OTlRHRmlYMlowZG0xTkxYYxAB",
            "text": "Amazing restaurant!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCemFtOTBXRXd4VWtvM1oybE5kRkV0ZFY4MFlXYxAB",
            "text": "I stopped in for dinner yesterday. It's located in the Rockaway Beach hotel.\nThe food and the service were both excellent. I had a burger on a brioche bun with creamed spinach on the side. Everything was simply Delicious. The atmosphere is also very lovely. You can't go wrong by stopping in for a bite at Margie's."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toMmNrOVBVVlp4TUc1TWIxSTFlVmx0ZVcxRFgyYxAB",
            "text": "Diana was fantastic! Very attentive& checked on us frequently. Thank you Diana for a wonderful experience"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSc1QwRndTekJxV1hCU01XZElXbGRvU0hZMlpVRRAB",
            "text": "Diana was wonderful! Food was amazing, service was amazing!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ORFpqbFRUVlJJUzAxSU1YSnJOa28yZGtGd1NWRRAB",
            "text": "The kitchen is downstairs so there’s a huge disconnection between that and the dining area. E.g. we waited half an hour to get one extra piece of bread."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoekxWZzRZamRsYmt0VE5XVlFSbWxxYjI5aFZuYxAB",
            "text": "This place is amazing. I’ve had many steaks in my life but the filet mignon with smoked onions compound butter is to die for. The bartender Billy is absolutely amazing. Great food recommendations and an amazing knowledge about liquor. He mad the best dirty martini of a life time. Would 10/10 recommend coming here ESPECIALLY if Billy is working. Absolutely amazing"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNMWQzSTVabE15WjFacGR6WnJhMmcxY2tWTE1YYxAB",
            "text": "Diana was incredible!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMZm1ndEthcjdxN1p3EAE",
            "text": "I found this spot on a list of the best breakfast places  — and that was enough to convince us to go. We decided to make a little day of it: brunch first, then a walk along the beach.\n\nThe interior is lovely, with stylish locals adding to the vibe. The team was warm and welcoming, and the service was smooth. The food? Solid. Classic American breakfast staples — well-made, satisfying, but nothing that made us go “wow.”\n\nStill, it’s a great place to start the day if you’re in the area. The check for three people with tips came to $140."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tacmJqZEpPRTl1VmpGWmFHWjRWVGMyVUdkMWFYYxAB",
            "text": "Had a truly awesome afternoon at the pool today at the Rockaway Hotel. Diana and the staff took terrific care of us and we felt like we were a million miles away in a resort oasis. Drinks and food top notch too. Worth every penny."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOVlpYcDZXVVJTYVhkaFdWUXdNR0oxVUhwTmNGRRAB",
            "text": "The food was excellent! Everything we ordered was well-prepared. The drinks and the service were outstanding. This is the place to go if you want to eat well and have a great time!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMT2Judi1KeGF2T3JBRRAB",
            "text": "The atmosphere was absolutely beautiful and the service was one of the best I’ve had!! The food was good but I wish there were more options on the menu."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkbkxXWkhUR2hGUVRGb1NYRlRjMlp4YWpVek0wRRAB",
            "text": "Omg! Best experience ever! Casey assisted  us the whole time we were here and she is amazing!! Food is great, ambience is fun and relaxing at the same time;  food was super fresh and good, and this place is so so beautiful that you feel you’re at the city. Will definitely come back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLYVF3T0dWMHFMSlBnEAE",
            "text": "This place keeps getting better and better everytime I go.  This is what a restaurant should be, an experience that retains some down to earth warmth and modesty.  Down to earth sharp staff and the food is off the hook.  This is some of the best value for the price and quality I have seen in years!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6anJxMW9BRRAB",
            "text": "Margie’s is a GREAT spot off of Rockaway Beach. After a long day out, the family wanted a nice brunch option to recharge. We found Margie’s. While the parking is bananas, perhaps because this restaurant is located in the Rockaway Hotel. Still, the Margie’s host was accommodating to us so we could be seated asap. While seated our waitress brought over some delicious blueberry scones / muffins. They were freshly made and still warm. Butter was also provided. For our main courses, we enjoyed the chicken w/ waffles, the Margie’s burger, and the ricotta French toast. The wait staff were all wonderful and went out of their way during our time there. The decor and atmosphere were great. I’ll definitely be returning whenever I’m in the area."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQLWRycXFnRRAB",
            "text": "I took my grandma here for dinner tonight and we had an amazing time! The food and drinks were amazing and the service was exceptional. Christian took great care of us and was a delight to have as our server. We had the Tuna over a Crispy Rice Bed, Crab Cake and Raw Clams for appetizers and the Ragu with Filet Mignon and Short Rib, Butternut Squash Ravioli, Maple Carrots and Brussels Sprouts as our mains. All delicious! For dessert we each had an espresso martini and the Apple Crumb Skillet which was phenomenal. Dessert looked so good I forgot to get a picture lol. Highly recommend Margie’s for anyone looking for a great local place to eat in Rockaway with good food, drinks, and service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5MnJ2bE53EAE",
            "text": "Spent another day with my girls at the pool house and Margie’s this year. We love it! It was an absolutely phenomenal warm 62 degree Sunday. We started the day with a yoga class on the 2nd floor then headed to the pool house where we met Tom and Megan. They’re great! We had champagne and brunch at the pool house then spent the majority of the day at the pool and sauna. We ended our wonderful experience at Margie’s for dinner!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sWVN6Vm1RMlJMYkU5eVdFd3dWbU41TW5aSE5YYxAB",
            "text": "I have had the best At this restaurant every single time I have come here. I live out of state, in Florida actually, and I have had exceptional 10 out of 10 service and 10 out of 10 food every time I have come to this restaurant.\n\nBartender Ryan makes the drinks consistently every single time, manager. PJ comes to every table to make sure their meal and service was exceptional, several other servers have made our visits perfection. We eat here every single time we visit Rockaway Beach and we highly recommend it to all of our friends.\n\nThe drinks are so good, I loves the five borough draft beer and My wife loves the blackberry spritz. Ryan makes them consistent. They taste the same every single time we come here over the last 2 1/2 years."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWmVXcHlRbFZRTjJ4dWFEWmFkemQyU25kblJGRRAB",
            "text": "Margie's offered a really pleasant experience.\nThe staff was really impressive: kind, genuine and competent.  The server was exceptional.\nOne doesn't expect much from the food at a beachside hotel restaurant, but this food was really excellent.\nComplimentary buns were actually worth eating, with a nice cheese and flavorful topping. The Moroccan BBQ wings were  well seasoned and the chopped salad with chicken had everything bagel seasoning that added a nice touch.  The burger was a big hit too.\nWe felt calm and not rushed, but the environment was also lively.\nGreat job Margie's!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQaVBrYlNXOFozYk5REAE",
            "text": "Highly Recommend Margie’s Hotel and Spa!\nI had a fantastic experience at Margie’s Hotel and Spa and can’t recommend it enough. The atmosphere is relaxing and beautifully designed, perfect for a getaway. The on-site restaurant serves delicious food with a great variety of options—every meal was a treat!\n\nOne of the highlights is the rooftop, offering stunning views of the Atlantic Ocean. Whether you're up there for a sunset drink or just to take in the scenery, it’s absolutely worth it.\n\nGreat service, cozy rooms, excellent dining, and that unbeatable rooftop view—Margie’s is a gem. I’ll definitely be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaN3NyYjBRRRAB",
            "text": "EVERYONE was so genuinely nice and approachable. Attentive without being overbearing. Erin the hostess stood out so much that we had a sort of spiritual connection that made me emotional and she she comforted me and wrote me a personal note. JB made sure we were happy and celebrated our anniversary with a complimentary dessert.  And all this in Day 1!!  We will be back for brunch today...Thank you for an incredible experience ♥️"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQybzZ2Y1JnEAE",
            "text": "Everything was absolutely great!\nCompliments to the Chef!\nHad the baked Clams,awesome!\nSteak sandwich was on point,Mac and cheese was great,a little loose but delish,fish and chips was awesome,it tasted like they just grabbed it out the water. French fries, you just can't stop eating. I had a Hoegarten from the tap it was crisp and clean,nice and cold.\nAriah was a great waitress,smiles and great service.\nGreat job!👍 we will be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdzctTDVnRRAB",
            "text": "We came in by accident when we were riding a ferry from Manhattan. It's a great place. I really liked it here. Interior , dishes . The waiter served us quickly and advised us to try the fish, as I said that I love fish. Indeed, the food here is delicious, so I would like to recommend the restaurant to friends."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4LVpEQlJnEAE",
            "text": "We went here twice during our visit to the beach, once for lunch and once for dinner. The food was good both times and feels like a reasonable price for what you get.\n\nThe food tended to be on the heavy side, so I actually found the salads to be theost enjoyable items because they felt more balanced to me. We had a watermelon and feta salad which was interesting and delicious. The Caesar salad with chicken was also excellent.\n\nThe portions are quite large by NYC standards, but match what you would likely expect in other places in America. The staff was also great and the atmosphere inside the restaurant was light and airy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMeDVYUXd3RRAB",
            "text": "On a hot NYC evening you can hop off the ferry to Rockawayand walk around the  corner to check out the beach and then have dinner at Margie's.\n\nThe food was good. Service was quick and attentive.\n\nThe warm bread was dreamy.\n\nThe best dish was the clams!\n\nFollowed by the tuna with cabbage.\n\nBranzino was a little salty for my taste.\n\nShrimp Cocktail slightly overcooked, but it was made up for by a nice cocktail sauce\n\nThe carrots were a little undercooked, but I guess that's good roughage.\n\nHop back on the subway just a couple of blocks away to get back to the city."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201QlJXaG5UVzVJUjNrMk0ySkNXRnAwZG1OWlVuYxAB",
            "text": "This is a great relaxing place to eat, have a drink, and a stellar place end to your day.  The bar staff go up and above to accommodate your every wish and make a really great Dirty Martini.\nFrom the bar to our table that same service excellence never wavered. They made our dinner experience a great one. Quick to answer questions and make suggestions. I do recommend the hamburger with truffled fries.\nOverall Margie’s should be on your must try list.  I’ll be back for one or two of their weekday specials soon"
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMDZXV2t3RRAB",
            "text": "Excellent!!!\nle service attentif, les recettes bien réfléchis, c'est rare que l'hôtel et le restaurant sont de la même perfection. On voit le grand travail derrière tout cela."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5bDhPU013EAE",
            "text": "my sister and i came here for brunch, and the experience was very nice. the kind hostess chatted to us while she chose a table and then sat us right away, and our waitress was kind and gave us good info once we told her we hadn’t been there before. the chicken sandwich was pounded out thin and fried perfectly and the blackberry gin spritz was delicious, however the chicken a little bland and i don’t love cocktails served in wine glasses, but that’s a personal ick. 9/10, i’d definitely recommend trying it out!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1eWZlM0JBEAE",
            "text": "Margie’s does not disappoint!! The food was incredible as well as the hospitality shown to us. Mattie (our server) and the bus boys went above & beyond. Hats off to the manager who made us feel like family & took the time to talk with us  (and bought us a round 😁🍻)\nI eat out a lot but I can honestly say everything was above par. Thanks Margie’s, for an excellent night out. We’ve already ascribed to returning next Wednesday (yea, it was that.good.)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHemZuaEtREAE",
            "text": "Amazing modern cafe and bar in a trendy, tasteful, spacious, cool place for all ages, types of people. Dress up or down, be nice, plan your events here and don't forget to show proof of your vaccination card. The service was lovely, the host staff and bartenders and waitstaff try their best. The food and drinks are creative.\n\nOne note: I would rather add some veggies to eggs Benedict because it lacks this, also please serve cappuccino in a large cup, nobody likes super small cappuccino.\n\nOtherwise thank you!!!\n\nIt's a local gem. Go check this out guys!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtNEs2X0VBEAE",
            "text": "Margie’s is located in the Rockaway Hotel … and it is AMAZING !!!! Went to double date dinner and everything was simply perfect from beginning to end , the hospitality was great .. we had tasty appetizers, sliders and an amazing burrata cheese with walnuts and apples that is to die for and that is only the beginning . Dinner was Burger , Pork Chops with glazed carrots and the BEST rigatoni bolognese I ever had . Not to mention the drinks , they have some unique and amazing drinks . Great Big Thanks to the staff at Margie’s and to Chef Connor for coming to say hello .\n\nAmazing experience .. you absolutely have to try it out\n\n#ThisKidIsGoingPlaces\n#ChefConnor\n#SimplyTheBest"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NjlMUEpnEAE",
            "text": "We live in the area and were looking for somewhere local for dinner. Found this gem on Google!  First, our server Ryan was the best! Very attentive and personable. So service is definitely a 10/10. We had the shark bite as the drink and I can say this is my new favorite. Baked clams as the starter ... be sure to ask for a small spoon to scoop up that sauce on the plate lol. We both had the steak special and it was spectacular! That roasted garlic definitely did it for me. Seeing as I'm local this is somewhere I plan to frequent. 20/10 overall!"
        }
    ],
    "reviews_count": 64
}