{
    "name": "Johnny's Classic Quizine",
    "place_id": "ChIJnSgBiqlowokRzsxJAlDttwY",
    "grid": "QN13",
    "address": "7-13 Beach 20th St, Far Rockaway, NY 11691, USA",
    "rating": 4.1,
    "user_ratings_total": 221,
    "phone_number": "(718) 868-3268",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WQ1UxVXlhamhvY0UwNWRVZHVVME5ITUZZeFVVRRAB",
            "text": "Placed a catering order for fry chicken to be picked up at 3 pm on a Saturday, I called at 2:45pm to make sure my order was ready they went silent on the phone for 5 sec, then they ask me if I can pick up by 4pm I said okay. Went for 4 pm…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoUGFVcFZWMHRFT1dSaVJYRlBaelUyYlVSQmQzYxAB",
            "text": "It was good but not great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5YVZUTTNZa3BJU1dwVVZVNW9aMVpNZWtkaFlVRRAB",
            "text": "ALL CAPS ON. I SAW THE REVIEWS BUT DECIDED TO GIVE IT A CHANCE. AS SOON AS I SAW THEM DUNKEY LOOKEN FACES WITH ATTITUDE N DIDNT SPEAK I TURNED MY BEHIND RIGHT BACK OUT THAT DOOR. THEIR IS A SUCH THING AS ENERGY&SPIRIT SHARED THRU THE FOOD AND I DONT WANT THE BAD NEGITIVE NASTY DESPLAY MY WAY WITH THE FOOD SO 0 STARS F0R THIS PLACE."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cEx6Znh3RRAB",
            "text": "Number one you have to wait a long time for your food. The people are very disrespectful. They do not greet you when you come into the restaurant and they have a attitude and they’re nasty and disrespectful. Do not recommend this place."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQcHFlQnJ3RRAB",
            "text": "Hit or miss😬"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdHV2VDNnRRAB",
            "text": "THE FOOD WAS GOOD ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3Z3FyNVNBEAE",
            "text": "The owner and some of his staff don't know how to talk to and treat people.\nStop spending my money with him over 2 years now."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMdEpXcFZREAE",
            "text": "Nice place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUdXJ2VVZ3EAE",
            "text": "Never again will I support this restaurant.\nI placed a catering order of BBQ chicken and the entire tray was filled with back pieces.\nSuch a waste of money."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqZ0p1dDh3RRAB",
            "text": "I was at the restaurant service poor  chafe me $18. FOR A Medium size ox tail, 3 small pieces of plantain and sometimes like stem cabbages. On line have different prices. That's how you all intend to get rich. You all would never enjoy the benefit from overcharging customers.🙄"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqaXNLLW9nRRAB",
            "text": "Extremely unprofessional I will never in life order from here ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEaEw3Ul9BRRAB",
            "text": "It's always a pleasant experience when I visit Johnny's restaurants I most definitely recommend this restaurants to everyone."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxNzVENl9nRRAB",
            "text": "Customer service was terrible; it was all attitude. The fried chicken was tasty, and the mutton tasted quite fresh and dry. Didn’t taste good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxeE9ibXlBRRAB",
            "text": "I decided to patronize a FEMALE BLACK OWNED BUSINESS. NEVER AGAIN. While I'm on line people are talking about how poor the customer service is from the 2 females serving the food. For $22.00 I got less than a 1/5 of oxtails in my dish. The rest was just flooded with rice, no beans. The light-skinned female has a severe attitude problem. While walking home, I came across \"La Playa\" Dominican restaurant. The SAME dish is $18 dollars and they provided much more oxtail with less negativity. I know where I'm getting my oxtails NEXT TIME!!!!! Do Not Patronize!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNad0l1TDlBRRAB",
            "text": "Great food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwczhIUDZRRRAB",
            "text": "The owner pays $12/hr , which is illegal in the state of new york"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbVpTekp3EAE",
            "text": "First of all, How do you come to this country and and sell small cut up pieces of chicken back for jerk chicken?!! That is poor people food in Jamaica! My wife who is from Jamaica was highly insulted and disgusted at the fact that they sent this.  $13 for jerk chicken standard they sent jerk chicken back jerked with rice and barely any peas. Damn bright!\n\nTo think, Americans are sent this stuff because they probably really do not know better. A shame.\n\nDo not buy online, but go in the location first to make sure you are getting your monies worth."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaXJlZmZ3EAE",
            "text": "This food is amazing! The staff starting with the  owner are all very sweet. When you walk in, you feel welcome."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwX0tTZVZREAE",
            "text": "There food is hit or miss also\nThey do not cover there food so I saw flies flying around not sanitary"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJMHQyVUtBEAE",
            "text": "Ok"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKM043bDJBRRAB",
            "text": "The food is great! The oxtails are a most have. Paulette is very nice and takes god care of the customers."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKLVpxbURBEAE",
            "text": "This place doesn’t understand the importance of costumers or costumer services!!\nThe people that work there is so very rude an so very very disrespectful!\nThe food is good but it could be greater if the workers smiled a welcomed you!!\nIt’s so very shame!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKNHVIeUVnEAE",
            "text": "Oxtails was ok but not worth $22 for a large; pleasant workers; will stick with golden krust"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4aGNpcWRBEAE",
            "text": "Okay 👍"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNScTY3RlN3EAE",
            "text": "Food good but rude ppl\nThey skimped one lady’s plate too & she left\nWas good for the time being but wouldn’t  return no honor"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSNHFETllBEAE",
            "text": "Really good food. The owner, Johnny, is very kind. Love getting the fish, oxtail, gravy, soup, rice. Tried everything and liked them all!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSNU9TSjVnRRAB",
            "text": "Got jerk chicken and rice and peas from here . Everything was very good ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoMU4zOTh3RRAB",
            "text": "Expensive for the portion sizes"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoeFAtbEJnEAE",
            "text": "$18.00 for med plate of ox tails meat was dry and not very flavor full veggies could have been cooked more 👎never again"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtdHZISXd3RRAB",
            "text": "If you are looking for a nice Jamaican take out, try this place! Food is delicious. Service is great!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcTYzZlVREAE",
            "text": "Wow absolutely incredible. Had veggie rice, sweet plantains, and jerk chicken and just wow."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1ODlfQllREAE",
            "text": "Great Jamaican dishes"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNajYzSmNnEAE",
            "text": "Great food , great customer service n great vibes 💯"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1eFlpeW9RRRAB",
            "text": "First choice... enough said.\n\n... but to be honest and to clarify ...\n\nThis place can eat my pockets and I wouldn't care. This is what Jamaican food is supposed to taste like. You won't regret it. Trust mih."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1aHNPb0NREAE",
            "text": "Love breakfast food only time I go"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdHBHZ19RRRAB",
            "text": "Me encanta este lugar siempre me preparan la comida como yo la quiero 💯% recomendado"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVdi1YN2xRRRAB",
            "text": "Excellent soup"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpMG9UWVZBEAE",
            "text": "10/10 would recommend. Great food! Good vibes! The service is superb and totally unmatched. Cashiers  and servers provide a  warm and welcoming atmosphere for customers. I love the mouth watering dishes that they have to offer. I suggest…"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJczRIanJnRRAB",
            "text": "Great food and the staff is friendly. The place is mostly always packed, especially in the evening.....so be prepared to wait. They are not like Golden Krust, where you are only given four pieces of oxtail!! This place gives you plenty of…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVa3YyU3Z3RRAB",
            "text": "Small Jamaican style takeout , good food , oxtail and rice&peas was on point . Good customer service too"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtNk5uTUl3EAE",
            "text": "3 stars because the food is good but they are lacking in other areas;\nFood is good. Packing is bad,Long lines Prices are inflated. Service is slow and like most Caribbean places...they are often out of staple items. You have to begin with, \"what do you have today?\" Oppose to them asking you, \"what would you like?. Also in this day and age they are not flexible in their menu i.e I work at the hospital and alot of my coworkers are doing Keto. They won't honor meat alone or meat and vegetables combos etc if I want oxtail alone without rice etc you are met with...we don't do that, so my coworkers all end up at Yumzee or order out to Chipotle etc cause they have vegan, paleo, keto options. You can get a burger on lettuce etc with no bun, meat over a salad etc\n\nI also used them for catering once and that was a hassle to get the owner/chef on the phone to place the order. Took 4 calls, 2 visits plus left several msgs and he never called back. (In his defense he may not have received the msgs). Finally desperate,  I popped up unannounced and was able to conduct the business and paid. The catered food was ready on time and was delicious.  Probably wouldn't cater with them again though. When you planning a function were you are spending about $500, I shouldn't have to run you down. I have my normal West Indian caterer who I call and get it done with 1 phone call and a fraction of the cost but he was away at a function so this was a last resort situation.\nDefinitely good bones but needs to modernize and its one of the few west indian options in Far Rockaway.  There is now a buffet on Mott where you can pick your choices. Food not as good but you can stick to your diets. For West indian without rice there is no life lol but we are changing and adapting and Johnny's need to as well."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHNTZIYVh3EAE",
            "text": "The food is decent, but they are over priced, understaffed, with a bad attitude. Bad combo. Guy charged me a dollar extra for two extra pieces of plantains, (Didn't know til after I paid) when you can get plaintains 3/$1 in the supermarket. Ridiculous. No longer a supporter."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVdFoyZ1ZREAE",
            "text": "Their food is good. Wish the service could be a bit faster and better. Every time that I walk in there I want to walk right out.They are not very pleasant people. Why do they always look so unhappy? They could get 5 stars if they improve customer service."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRcjc2UWNnEAE",
            "text": "I would not recommend this place. At Grace Jerk Fest, their jerk chicken tasted like lighter fluid. I told one of the staff so after buying their food and she showed no concern. Her word were, \"We do not do refunds.\" I did not even ask for a refund."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnb0tuUzB3RRAB",
            "text": "The service can be hit and miss. The music is entirely too loud, and if there isn't someone in Manning the front, it can take some time before they emerge from the back. The food is delicious!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhNE56OFpBEAE",
            "text": "Johnny's Classic Quizine is a down to Earth Homegrown Carribean Takeout Restaurant. Prices are more Affordable than the Competition in that particular area. Most importantly, food is good with satisfying portions for the buck!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpeV96SXpnRRAB",
            "text": "They are understaffed, one person working with an attitude, do not uber eat and pick it up you still will be waiting for your food. Long lines and food don't taste as good as used to. Will be moving on"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBODl6bzV3RRAB",
            "text": "This place makes the best food in Far Rockaway. It's the only place I can eat and know I won't be disappointed.  Food always on point and delicious. Staff is clean , and the owner is real cool."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtMDg2T3hnRRAB",
            "text": "Johnny food is great period,my favorite is his curry goat meal or fried red snapper,he just upgraded the entrior so it looks really nice inside"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnOHVpWkdREAE",
            "text": "D best in da rock. Big up Johnny from mi i deh a mi knees. Fri comedy's is a laugh it off the chain still in stitches they crazy and the food crazy good. Jamaican pride. Blessings my crew. D7."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNN19QSHhRRRAB",
            "text": "Food is good but they r slow to serve and when u order over the phone never have ur order ready they make it when u get there .And there closing time is at 8:30. Not 9 . Or 10 like they have on Google search."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNReFBybHpRRRAB",
            "text": "The food is always good and the staff always and I mean they are always friendly! ... UPDATE I had a party catered by Johnny's, everything was incredible!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnZ3N2SlJnEAE",
            "text": "Aside from parking issues, Johnny's is highly accessible for breakfast, lunch and dinner with a variety of Caribbean food to choose from, whether it's Patty, cake or snack Johnny's seem to have it."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvb3BTa3RRRRAB",
            "text": "Food is always fantastic. Not really a fan of the service but it's Kool. Go early as possible they run out of things unfortunately."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRc3NTUzN3RRAB",
            "text": "Portions weren't as expected and food did not taste good. Never going back here again. Expected so much more."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0b01fY3hRRRAB",
            "text": "The fried chicken is amazing, rice always had flavor and tasty selections of what they cook during the day"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5eDQtTUdREAE",
            "text": "Great oxtails! I haven't tried the other food but I take that its as good as the oxtails! Gotta try em! 😋…"
        }
    ],
    "reviews_count": 57
}