{
    "name": "Ralph's Coffee Shop",
    "place_id": "ChIJN4cpNB1mwokRoz2EEGXJsPM",
    "grid": "QN13",
    "address": "21-23 Mott Ave, Far Rockaway, NY 11691, USA",
    "rating": 4.3,
    "user_ratings_total": 541,
    "phone_number": "(718) 327-9724",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSVJHaFBNbmN6UlRGMVNpMXJTV3hrYmtGU1psRRAB",
            "text": "Service from particular waiters is disgraceful. As a customer wanting just his food in a metal pan this lady goes crazy. The chef and some of the ladies that worked there are sweethearts, but this lady in the photo is a Un duendecillo. All because the food that I was willing to pay for I wanted it in one single metal pan. I would definitely come back to get the food and the chef is very very good. I see him work with my own two eyes. I just hope not to ever get served by this lady ever again. I don’t even know how she got a job here in America."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRVgyb3RlV1ZPZVRablR6VlJWVVZTWlRoSVlWRRAB",
            "text": "Yesterday, I was referred by a family friend to try Ralph's food. I ordered pork chops with yellow rice & potato salad! 😋 The food was absolutely amazing! And, to think, I have walked past Ralph's for the past 10 years & never knew what I was missing until yesterday! I am going back today! 😊"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JNVJtVjBORmxQTUZadWVtMVBVa3RCTUZsdk1tYxAB",
            "text": "I've been going to Ralph's since the 70s. Great place and good food. I no longer go to East Harlem just for spanish food. I just hit up Ralph's. I never eat in always take out."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xob1IyWkpla2RpVG5GV2FIUnBlUzF5ZUdOa1dGRRAB",
            "text": "I had a small yellow rice with bean and pernir. It taste great and by the look of the other food it looked like it taste great.. I will definitely go again and try there other foods..when I do I'm sure my rating will be a 5 star."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScVNsRjVNMFpGVkRCV1lrNVVZVFZrVVhwTU5HYxAB",
            "text": "I always tip the beautiful lady's\nFood is a go to when you really want great food to eat .the rotisserie chicken rice & salad is my go to combo .Amen I've never had a bad order shit put my family to sleep thx guys &gals for delicious food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205bU5XWnhkalpFZHpsNWNHcE5aVVZoVG5kS2EyYxAB",
            "text": "Soup was spoiled and old, but the service was ok"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Jek56QklPRkJJTmpKbVVqQlljVk00UlVSamFIYxAB",
            "text": "Fri 8/15/25 food was extremely salty.I was surprised because I've eaten the food a few times."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMdVh3dXoteHJTT09REAE",
            "text": "Disgusting 🤮 serve chicken my dogs wouldn’t even eat"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMHBybVhnEAE",
            "text": "Tengo muy mala experiencia en este lugar para cuando he pedido por Uber siempre he pedido maduro y nunca me mandan maduro ni he podido dar una explicación y cuando llamo Nunca contestan el teléfono la aplicación de Uber me cobra lo que es…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3eF9YZElBEAE",
            "text": "I order from ubereats chicharrones with tostones but instead I received chicharrones with rice, beans and salad  smh they could've reached out to me and let me know that they don't have tostones instead of sending me something that I didn't order and ubereats only gave a $2 credit"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMGJIenBBRRAB",
            "text": "If you're not from the area you'd probably not feel comfortable eating here. However, the food is good and the customer service is always pleasant. Structural updates to the interior as well as finding a way to keep all the panhandlers from harassing their customers both at the door as well as inside, would help build their clientele immensely."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnak1pbE5nEAE",
            "text": "Water glass had lipstick on it and asked for new glass and got a different glass with lipstick on it and in my drink it had stuff floating around in it service good though"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbXB1YTN3RRAB",
            "text": "The best and only Spanish place in Far Rockaway"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2LVBiZzRnRRAB",
            "text": "I love this place, the customer service is top tier and you’re always bound to get your food in less then 5 minutes. Best spot for breakfast and lunch. Their food has variety and it always taste good."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2a00zdHVnRRAB",
            "text": "Authentic, warm, polite and sweet server.  Enough food for two people.  Pancakes were delicious, hash browns were perfect. Coffee kept me awake and alert for 2 weeks."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtb1p2dDJRRRAB",
            "text": "Excellent service, great food."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQOHR6VzlBRRAB",
            "text": "The 0lace needs repair"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzczRQai1nRRAB",
            "text": "Hace minutos estuve alli y una de las que despacha la comida porque no le pedi la comida como un combo que yo no sabia que lo debia hacer asi me ha insultado y gritado como si estaba en su arrabal, claro q le respondi pero no tenia porque oferdeme ni gritarme y me tomaba fotos, me voy a asesorar para saber que medidas tomar."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYb2ItOF93RRAB",
            "text": "No frills hot food bar.\n\nFood is good and people are nice but beware it’s lower priced and busy thus they will be rushing a bit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuLS02OF9RRRAB",
            "text": "So I stopped by my usual spot which is Vals just to get some rice and beans for a quick bite only to find out that it’s a new company and that they don’t do takeouts. The gentleman there referred me to Ralph’s and I went there for the first time. There were a lot of people there so that has to say something. I didn’t analyze the place like I usually do with new places I go to but I did manage to see that there was seating for dine in towards the back. That’s a plus. They have a large variety of food to select from. Food smelled great and looked good. I will admit that what I did notice was the women don’t come off as friendly but it is what it is. I saw it with other people but I just wanted my food. Food was good which was only rice and they had 4 options to chose from but I will be back to try out other options."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyc2I2eGdnRRAB",
            "text": "Old Dominican style restaurant with tasty foods from DR."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyOE83bHN3RRAB",
            "text": "This is so hot I was getting sick just waiting to be called the line is long but if you want good Spanish food and fast this is the place to come too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMalp6dDlBRRAB",
            "text": "Five stars excellent food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMMG9MbjZBRRAB",
            "text": "A great place to relax and dine!! The staff are very genuine and nice people."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6dmJ5T3NRRRAB",
            "text": "Sometimes the food is way too salty. There is a seafood pasta salad that I actually do enjoy but it's not available all the time. You may be lucky on a Friday."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6Z0tQendBRRAB",
            "text": "Was very surprised didn’t know the spot existed. One of the only Dominican restaurants in Far Rockaway the manager Dammy treated me amazingly will certainly come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6d00yMUp3EAE",
            "text": "Oh Ralph’s coffee shop where do I start great service good atmosphere one of the best Spanish spot in rockaway the chicas behind the The counter serving food are very nice and helpful"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURULS1iRG1RRRAB",
            "text": "La mejor comida"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUM2JmWU5BEAE",
            "text": "Great place"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodUxIOTd3RRAB",
            "text": "This used to be one of my favorite restaurants. The food is amazing. However, it's sad that the service sucks. Sorry not sorry. The servers (all women) have nasty attitudes. The restaurant is dirty, and this is not the first time I've seen it this way (pics attached). They push in your container to give you less food. Overall please do better"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsbXR5UjRBRRAB",
            "text": "Smiling faces, happy servers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEaDVtNDlBRRAB",
            "text": "The food is really great but the service sucks. The ladies behind the counter got nasty attitudes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5d01PUm9RRRAB",
            "text": "I love how they Cook in Ralphs . Its just so full of flavor always."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5N3R6MnR3RRAB",
            "text": "When I came in I saw what I like so I got it and it was good and the Service the food was great I recommend coming here🙌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkeWRYS3lRRRAB",
            "text": "Let's start with Ralph's food is good. Ralph's has all women's servers with attitudes. Watch them carefully as they put your food in the containers. Especially if you get the round aluminum containers with the clear plastic top, as they use their fingers to make an indent in the bottom of the container to give you less food and still charge you full price. Watch them carefully and always check the bottom of the aluminum containers if you get it."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4N1lIYzNBRRAB",
            "text": "메트로폴리탄 뮤지엄을 인력거타고 가는 도중에 들른 곳.\n여유있게 카피마일 시간이 없는게 아쉬웠다."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4N2RqYjlBRRAB",
            "text": "My coworkers reccomend this place and man was it delicious. I had probably one of the best pieces of salmon I ever had and the rice and pasta salad had amazing flavor cant wait to go back!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURabUtEV1hnEAE",
            "text": "I came back to town and the first thing I wanted was Ralph's for breakfast.\nCome here for the food that will never let you down!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCcXJQSzJnRRAB",
            "text": "Great food, every time I’m in NYC this is a for sure place to eat at"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtMmZqMUJ3EAE",
            "text": "I was surprised with this location in the front looks like small luncheonett place but after I went inside it was bigger toward the back with a large variety display of delicious tasty plates!👌…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMTR5dmF3EAE",
            "text": "I love their food there. That's my number one favorite place to go eat breakfast & lunch out there in Far Rockaway Queens. Always get my original order, which is cheese grits with sausage & eggs. Extra sausages & eggs... Love it to the fullest. Let's not forget the large half & half ice tea."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkMzRXbklREAE",
            "text": "I order from here often because I work on the area and the last 4 times I have come the food was absolutely terrible, I am being charged different prices and “extra taxes” when I use my debit card. When I call the manager there is no resolution. The last time I ate there I had the pork that gave me food poisoning. THIS IS THE WORST PLACE!!! I WILL NOT EVER RETURN AND NEITHER WILL MY EMPLOYEES!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWaXJXSXZRRRAB",
            "text": "Ralph's is a staple of the community! Breakfast lunch and dinner every meal is delicious and the portions make sense for the price. If you want a home-cooked meal that you didn't have to make like a REAL home-cooked holiday grade meal take your butt to Ralph's ummmmkay"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1d3IzLVdnEAE",
            "text": "I use to love their roast pork , I would ride the bus just to get some . Last week I decided to go and get some , mind you this was the only place besides me cooking my own . The pork had no hard skin and it was extremely salty it look like left over and after taking 2 bites I threw it away . My daughter and husband had chicken and I saw my daughter running to the bathroom.  She threw up the chicken . I thought maybe my husband would have a better experience he threw his away . I spend 30 dollars on a meal that made my family sick . Lessons learn this is something Ralph and his wife would never serve and roast chicken and roast pork will only be made by me . I will not be returning I don't trust how they prepare their food ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkbWZYV0dBEAE",
            "text": "Food was great and a lot for me I couldn't finish my meal a lovely young lady helped me any my mom with our meal prep thanks I didn't realize they had parking till after I paid for street parking but I know now"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1N3JUbkJBEAE",
            "text": "Food is amazing ... I live around the area and always go here to eat breakfast early around 5:30 am and the food was surprisingly good. Even with no seasoning it was still good..lol"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoc0t2cGl3RRAB",
            "text": "This coffee shop has been around for years. The food is so good. Don't let the location fool you. They have lunch starting from early in the morning and everything is good. The owner is nice the ladies that take your order are nice. it is constantly busy but they get you in and out I promise you you won't regret Tryon at this location."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4aE1UZlJREAE",
            "text": "I just started eating from here and the turkey wing dinner is so good, I always get them.  The spaghetti and bake chicken is good too.  I'm going to try the pepper steak and fish one day."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxOXI3RV9nRRAB",
            "text": "Knew the experience wasn’t going to be good when we pulled into the back parking lot and saw 5 cats going in and out of the restaurant. Probably what they’re cooking. Went in expecting a diner. Then new it was gonna be a bad experience ones…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURneU8yRDNBRRAB",
            "text": "Great food and friendly people. It is a very busy place so expect to wait a little. You got to get their attention or else you lose your bet LOL. Been coming here for years and I love the Spanish food great taste. What I like about…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRaFpYcnpRRRAB",
            "text": "1 check-in\n\nWhile visiting family in the area I came across this restaurant and stopped for breakfast. There are not many options in this area so I gave it try.\nImmediately when you walk in you can't help but notice the obvious homeless that hang around. The staff apparently allows them to order coffee and water for free which is a nice gesture. However, the free coffee and water orders definitely delayed me in placing my order. The staff is not the friendliest. It took so long to get a staff member to take my order that I almost walked out. I commend them for proving free services to the homeless in the area but as a paying customer I feel I should be greeted first.\nOnce I was able to place a order I requested it to go due to how congested the restaurant was. The food itself was decent but not out standing. Our order consisted of scrambled eggs that they said they had no cheese to add to. Pancakes with side orders of sausage and bacon. The eggs might've been the worst I have ever tasted from a restaurant. They tasted just like grease and not butter or margarine. If I ever try this place again I would definitely avoid the eggs!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGcU1IUHpnRRAB",
            "text": "Service is pretty fast but I've seen people come in after me and kick the lingo in Spanish and service before me. They give you too much grits and the salmon might be farm raised salmon, otherwise they are ok."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtenJfdk9BEAE",
            "text": "Me emocioné mucho de encontrar un  con comida dominicana en esta parte de new York. Tienen una gran variedad de comida criolla: arroz blanco, que tenía 4 días que no comía ja ja ja, arroz con maíz, moro, habichuela roja, pollo en varias formas: asado, guisado, cerdo, pescado frito, salmon al horno, carne de res guisada.. lo único que estrañe era unos friticos maduros, o arepitas de yuca o arepitas de maíz, muy dominicano.  y los precios son bastante buenos. Al lugar van muchas personas, por que veo gente buena trabajando allí y buena disposición de servir. Me encanto que tienen también una selección amplia de postres criollos entre ellos: tres leches, flan, creo que vi pudin de pan, gelatina, entre otras opciones. El lugar abre súper temprano y vi muchísima gente comprando para llevar latinos, americanos.....la verdad me gustó mucho.\n\nI was very excited to find a Dominican food place in this part of New York. They have a wide variety of dominican food,white rice, which I had not eaten for 4 days ha ha ha, rice with corn, Moorish, red beans, chicken in various forms: roasted, stewed, pork, fried fish, baked salmon, stewed beef... the only thing that I miss it was some friticos maduros, or arepitas de yuca or arepitas de maíz, very Dominican. and the prices are quite good. Many people go to the place, because I see good people working there and willing to serve. I love that they also have a wide selection of Creole desserts, among them: tres leches, flan, I think I saw bread pudding, jelly, among other options. The place opens super early and I saw a lot of people buying to take away, Latinos, Americans.....I really liked it."
        }
    ],
    "reviews_count": 53
}