{
    "name": "Blu seafood restaurant & bar",
    "place_id": "ChIJS9H1S5RlwokRIgPfSFbw6NA",
    "grid": "QN13",
    "address": "222-02 Merrick Blvd, Queens, NY 11413, USA",
    "rating": 4.1,
    "user_ratings_total": 313,
    "phone_number": "(929) 600-5573",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVNVpHNW9aMWd0UkhOeFRtazJlakl0VTBWbE1sRRAB",
            "text": "Strong Drinks. Nice vibe."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pocWRuVnJNSE0zUkROSGNERkxlazFFWkhsc1EzYxAB",
            "text": "I Recently Went For Sunday Brunch & Sat At The Bar , We Had The Oxtail Mac & The Lobster Mac & It Was So Good , So Filling . The Music Was Great , The DJ Played A Lil Bit Of Everything . Service Was Fast , The Rum Punch Was Punching . Overall A 4.5/5 I Would Definitely Go Back ."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVM1ZWOU1VR3hOTWtKTGREQnNTRGxWVm5obFZIYxAB",
            "text": "Nice waitress, chill atmosphere, and good food."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SemRrSnBTRUZOTmkxdmNuQm9ZMlJvV2kxNVYwRRAB",
            "text": "Had a great experience here. My Auntie and I came here for an early happy hour. The place wasn't crowded. We were greeted right upon entering and seated. Server/ bartender was kind and professional. She was also very knowledgeable about the menu items. We had fried calamari (perfectly cooked) and it was delicious. Seafood was fresh. We ordered lobster Mac and cheese and salmon Mac and cheese, crab cakes, and a side of steamed vegetables. We loved everything we had. Mac and cheese was a little only but nothing that ruined the dish. The drinks were delicious and strong. What also loved was the have hooks under the tables and at the bar ton hang your pocketbook. They also have outlets under the bar that can be used to charge your devices. These little touches matter! We had a really good time. Will definitely be coming back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201NUxWSk5SV0V3TTFscFkxSnJaR05wYlVFMlJYYxAB",
            "text": "Food  looks great but wasn't seasoned, I give it  1/10. Service and waitress was great. The drinks 8/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WU04xRk1aazB6TFUxZlJYSTRRbkUwUVdVM0xVRRAB",
            "text": "The food! The food is flavorful. Happiness in a plate. Drinks are yummy and strong. Happy hour prices are great especially on Wednesday. Would recommend as a cute dinner."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oQloySnZiVVJrVnkxMlNraEVRbEV0VjJob2FVRRAB",
            "text": "Came here with my best friend craving the salmon and decided to sit at the bar. We were the only ones there, yet we weren’t greeted or even acknowledged the bartender just dropped the menus in front of us. When we asked questions about the menu, she didn’t seem to know much of anything. After about 10 minutes of back-and-forth, she finally said, “Oh we’re just serving brunch anyway,” even though we were clearly asking about the salmon and dinner options. Her attitude the entire time was rude and dismissive. Instead of coming back to take our food order, she sat down with a man who had just walked in and never returned to check on us. When we asked for a manager on our way out, she told us there wasn’t one and questioned why we even needed to speak to someone, again with an attitude. I’ve been here once and remember the food here being good, but the service was unprofessional and extremely disappointing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxcFNGZDRjMkZTVkZwV05GaHhNekJvT1hKb2ExRRAB",
            "text": "This is a great vibe! The owners and the staff are very nice and attentive. Always checking in on the table and asking us if we are good. I ordered the seafood boil, and it was very good. Would highly recommend visiting. I'll definitely be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNFFWUlFlVkZDUm1kQ1dHTnhka290U3psTmFIYxAB",
            "text": "My bf & I came here to celebrate our 4 year anniversary and once we arrived the restaurant was closed, it made us upset because we understood its labor day but we got confirmation of the reservation on 09/01/25 at 6pm also on google it stated that the restaurant was open and our plans were ruined smh"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSVMzRldTbmM1WlRSWlRrbGFWbVEyUjI5WVZYYxAB",
            "text": "I ordered Mac and cheese with shrimp in it but this is not what I expected. It looks like they just put cheese on top of penne noodles. And the fried shrimp on the side smh. The cheese is not mixed at all ! The garlic wings still are pink in the middle. I’m never ordering from here again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xadlVUVnBlRk0xYlZoRFZrZFlSa3RMYTNSdVdWRRAB",
            "text": "The service and atmosphere was perfect for a monday night date...the food was delicious..i ordered the surf and turf as my entree and the drinks were good amd strong."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOaVNEQTRhMkZEUlc1NVFrVmFUSEYwVjNObVZGRRAB",
            "text": "Everything nice. Drinks strong"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RFYwNW1SRlZqT1dOV1dqVllkMFl4ZEUxaFVuYxAB",
            "text": "Great service! Great food! Really enjoyed the mango salmon!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KNlZHZE1SekZPTWxOaFVtaFFhblJzWTIxTk9XYxAB",
            "text": "The food was very delicious and the place was very clean.   The music was a little loud.  But everything was great 👍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRM2JUVnZjVWRpZGtKT01qVjRaVFpIVkRJNFluYxAB",
            "text": "Local spot, good drinks, young urban feel"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CSVkzZFFSRlJpUnpKaFZsSjRXR05zYW5GaGMzYxAB",
            "text": "Was fantastic, food was really good and service was prompt and courteous"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201YVowcDNabWxTTXpoNldtOUxabTVvV1hOTVVHYxAB",
            "text": "Very nice"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSelFVeE9aWE5oWkRGRWVHNW9Ra1l6VkRBd1puYxAB",
            "text": "Calamari was tasty and not the usual fare.  Food a bit salty but tasty.  Very large portion on the lobster Alfredo seafood pasta dish.  Had to ask for crackers to break claws and even with them could not break claw to get at the meat.  Made that dish an epic fail."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5dFNHUkhTWEZzWlhneE9GRTNRbWRXYVRRMFQwRRAB",
            "text": "Ordered take out. Stuffed Lobster with mash potatoes and a Pina Colada. The lobster stuffing smelt so raw it was a turn off! The lobster was rubbery and had no seasoning no taste! The mash potatoes was bland and tasteless! And to top it off, they forgot to give the delivery guy my Pina  Colada! Will never order from here again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTFUyNUhZMmQwUmtJd1YybHJjMnhvVG5sdFlWRRAB",
            "text": "The girls are nice. a bit slow at the bar .. the tip is included at the table even though it say 4 or more is automatic gratuity.. they close at 2 AM.. 1:15am they bring your bill.. the server asked if i wanted a to-go drink at 1:15 when she gave the bill i said no but changed my mind at 1:17 and she said it’s already closed…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNRHh3OERtd055eGp3RRAB",
            "text": "Where do i start?  Ok this was a doordash order on a Sunday evening and the first time having food from this establishment. Food packaging was topnotch, bag was stapled no spills at all. Food was very impressive, in taste and was plated beautifully. Boneless jerk was very good, tender white meat and seasoned well 9/10. Rice and peas were excellent, moist, and flavorful you can taste a hint of coconut and didn't require any gravy 9/10. Mac and cheese was excellent. Pasta wasn't overcooked and soft. There was a nice blend of cheeses, it was a little oily, but I drained it 9/10. I don't like vegetables but the broccoli and carrots that came with my boneless jerk I devoured 10/10. The wife insists that I mention she enjoyed her meal (fried lobster and fried shrimp) as much as I did, she doesnt chime in when i do reviews. This is my new local spot"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VNeVY5ZjNscEpXYTNBRRAB",
            "text": "Been to this restaurant a few times didn’t know what to rate due to my mixed feelings about the food & service, however this last time I decided to do a take out & was completely disappointed in my food I ordered a shrimp Mac & cheese, now when you order a shrimp Mac it’s supposed to be shrimp with Mac & cheese mixed in together in a nice creamy dish right (at least that’s what I’ve known it to be).. but nope it was the opposite! They put 4 fried shrimp on the side which cost an extra $9 (🙄)  & they gave me a very oily penne cheese & pasta, literally no effort put into preparing the meal. I even gave 2 ⭐️s because this was my 3rd time visiting all the other times I came for drinks which weren’t bad, but this time I decided to get something to eat & was actually baffled at the food   Especially after reading the good reviews."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJSEh2cldhMzRDcHNnRRAB",
            "text": "Food and service are always great. Brunch menu is decent and a great selection of music is always playing."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSeE8zMGRBEAE",
            "text": "Calamari is always a hit. Please take that Cheesy seafood egg roll off the menu. It was not good.  Drinks were good and strong.  Thursday night bartender was not friendly or helpful. But that's  because her 20% gratuity was included in the bill automatically."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaDlTcUFnEAE",
            "text": "I dont usually do this but I am so disappointed. The food, atmosphere and bar service is good. You get a good vibe here but the take out service is the worse.  For several times now I have ordered food from here for pickup and it's always the same. They tell you its ready then when you show up they  tell the food is not ready next thing you know you are waiting a whole hour. Wasting my time completely."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJN052VF9RRRAB",
            "text": "Delicious food and great service. Olive served and did not disappoint. Definitely worth the try."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNU5MeDh3RRAB",
            "text": "Went yesterday evening to celebrate my birthday and everything was great!! The food was delicious especially the lobster mac and cheese omggg!!! AND my sweet sweet waitress (didn't catch her name 😒). She was awesome! So pleasant, patient and overall provided my friends and I with the best service! I told her it was my birthday and she immediately ran and got me cake with a candle and had the DJ played, what she didn't know was, my favorite song!!!! Thank you soooooooo much!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3LTdHbDZ3RRAB",
            "text": "The atmosphere was a true vibe…that’s what I like when I come back home. I had the oxtail and macaroni n cheese…I’m leaving today and hopefully I can get some to take back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dUpYM0pnEAE",
            "text": "Food was good … But we ordered henny sangria …. It was fake Hennessy…smh"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3Mk9xNGxnRRAB",
            "text": "Gotta give this spot 6 stars. Service was awesome. I didn’t catch the waitress name but I’m sure she does it on the regular. Food came out scorching hot the way I like it! Wasn’t long at all even tho she prepared us for a wait. Mac and cheese I always talk shit about Caribbean Mac but this shit was fire!!! Oxtail Mac was crazy!!! Me and friends try everything from each other. So I tried the  snapper awesome! Tried the pasta with the lobster awesome! The lamb chops was a lil small but good as hell. The cheesy seafood eggrolls was prolly my least favorite but I would still give it a 7/10. That’s how good the food was. It’s small inside so just keep that in mind and I prefer they stay that way because we all know once the space gets bigger the food starts to lack. Had a blue temple swear I always wanted to do that add the blue syrup instead of grenadine! Mad good. I had a frozen blue shark like blue pinacolada and some henessy drink. Pricing i wouldn’t say expensive but like city pricing. I wanna come on karaoke night!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcjZiTHNBRRAB",
            "text": "Had a time and the food was delicious. Dj was playing some good tunes. So glad my sister enjoyed her birthday last night. Definitely would go back again!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOU1fdWVnEAE",
            "text": "The best restaurant ever, service is off the top this is my number one favorite place to be ."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndHNHZWhRRRAB",
            "text": "I loved the food and sat at bar due to lack of space for friends birthday. Waiter was a little too anxious for me though.Next time l will\nstay seated at bar.Bartender was very nice."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnaXFELTlRRRAB",
            "text": "We were seated and waited about 30 minutes for a waitress to come over before we just sat at the bar. Bartender was nice, drinks were good. Jerk shrimp was a 3/10.\nThey add the gratuity on to the bill so make sure you pay attention."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbk1tXzB3RRAB",
            "text": "The bartender made & served the drinks really well.\n\nHowever, came into this establishment on Valentine’s Day just looking to get food and order drinks. Im from out of town & was visiting. The bartender took my order after waiting an hour for food that never came just for the bartender to return and say they aren’t making it because we didn’t order from the Valentine's Day menu is absurd.\n\nI will not return to this business. Very disappointing. Lack of empathy from management. Although I visit Queens NY about 1 a month this place was a nice spot my friend would recommend.\n\nAfter today I will kindly tell my friend NO. That’s unacceptable."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfazhyX3hRRRAB",
            "text": "The place was a bit smaller than I expected, I did reserve a few hours before I went and they were able to accommodate 11 people 👍. They said it was child friendly but i beg to differ, maybe it was the time i went (8:30 pm) and the crowd at the time. The music was good, a little loud, and not really child friendly. Food took a little time to come out but was worth it: Jerk shrimp (10/10), appetizer platter (9/10), mango jerk salmon (9/10), mash potato (10/10), French fries (10/10), pasta and shrimp (9/10), snow crab legs spicy (9/10), lobster and crab mac and cheese (10/10). My family and friends had no complaints about their food service/ servers were good. Over all (4.7/5) would go back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbDRPSk5nEAE",
            "text": "I came here with my husband for NYE and the food was delicious. We ordered the appetizer platter it did not disappoint. A virgin pina colada which was smooth a good. Finally the oxtail mac n cheese. I wasn't crazy about it but my husband said it was good. Overall very good service. Small place. Great music. Could use more frequent bathroom cleanings. Would go again."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMGZHVGZ3EAE",
            "text": "Food took FOREVER WHEN I SAY 1hr or longer I can’t believe it just don’t come here"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MDhYTzBBRRAB",
            "text": "First impressions are everything, right?  I went with my two friends for a Christmas dinner.  We live out east so we caught the LIRR and then hopped in an Uber to the restaurant.  The menu looked delicious so we came with hearty appetites and prepared to eat up as we had a 5pm reservation.  We were very disappointed to find out that we had to wait an hour to order food because they were switching out from brunch to dinner.  We were even more disappointed to find out that after 6pm, only appetizers would be available and no entrees.   When asked to speak with a manager or owner, we were told that they weren’t there.  I will not be going back!  I would love to support our black owned businesses BUT we have got to do BETTER!  Not to mention, the bartender was outside.  We couldn’t even get a drink.0"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cVpyYlV3EAE",
            "text": "Came for my husband’s birthday yesterday which was  Wednesday around 8pm. The tables were small , we planned to order lots of food. We pushed two of the small tables together . Waitress came over said because there was only two of us we can’t make the table bigger . Mind you there was BARELY anyone else in the ENTIRE restaurant. I understand if it was busy  or brunch but it was a slow night .I’ve been a waitress for 7 years you can accommodate people if there isn’t enough room for them . Food came out in LARGE trays and of course we had no room at the table to even order anything else . I ordered the twin lobster tail and shrimp which was drowning in butter. Don’t get me wrong I love butter but geeze it was alot of butter. Also there is a sign when you walk in that says “please seat yourself” that no one sees so you see people just standing at the front for awhile waiting for someone to greet them. It should be facing people when they walk in so they know to seat themselves. Anyway I feel if the waitress would have accommodated us better I would have gladly given her a bigger tip . I was uncomfortable and just wanted to leave so I didn’t take any pictures."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOTkyYmZBEAE",
            "text": "This place was super cute and the service at the bar was great. The bartender was very accommodating which was appreciated as a newcomer to this spot. There is also a dj spinning some great songs which made it a fun place to be. I enjoyed my frozen passion fruit margarita and warm Lobster Roll which had a hint of curry and a soft buttered roll."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4aFlTbDh3RRAB",
            "text": "So let me start by saying I am upset to give a black business such a low review but they’ve got to do better. The atmosphere and music was nice. Very clean and overall friendly staff but the WAIT TIME for food and drinks was ridiculous. It took an hour and a half to get our food. We also ordered the bottomless option for $21 and got one drink per hour. Now the food… I ordered the red velvet waffles and chicken. The chicken was fried well and seasoned but my waffles were COLD and hollow. I’ve never had hollow waffles. Also I wasn’t given syrup. My friend got the oxtail Mac and cheese which was good. This place has so much potential. I hope they address these issues."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxeE5XQjFBRRAB",
            "text": "\"Dive into a world of culinary enchantment at Blu Seafood Wednesdays, where the flavors of the sea come alive and the ambiance will leave you spellbound. Indulge in the tantalizing Blu Sampler, savor the creamy triumph of salmon Mac and Cheese, and let the Shrimp Head-on seafood Boil take your taste buds on a symphony of flavors. End your night with the exquisite seafood trio and experience the perfect ten out of ten. With impeccable service and an ambiance of relaxation, Blu Seafood Wednesdays is a must-visit destination for all seafood enthusiasts. Come and be captivated!\""
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtLS1pYzRBRRAB",
            "text": "The place is smaller than expected but well put together.\nThe service is not as fast as the big sit down chains.  The food was off the hook, excellent with more than average portions.  Even the vegetables were well seasoned. The manager realized we were celebrating a birthday and gave my daughter cake.  If you like seafood then go here. Some may consider the neighborhood a little shady but it is what's in the restaurant/lounge that counts.  I'm going back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNk5tOW1RRRAB",
            "text": "Gourmet STACKED & FULL hot plates at almost midnight ?! BIG TUNE a blast ya bumba eardrum ?! I LOVED EVERY SECOND!\n\nThe food was incredibly delectable, that creamy garlic butter sauce was the star of the show - we dipped everything in it. Everything was cooked to perfection, the service was kind & attentive, the prices were BEYOND reasonable.\n\nPortions are MASSIVE! I could go on & on about how amazing this place is & can't wait to go back. In the video is a Salmon Love Affair with mashed potatoes, corn & steamed vegetables, a rasta pasta with split lobster tails, crab mac and cheese & salads."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXNDlfVTh3RRAB",
            "text": "The atmosphere is good but after 10pm it's like a club (not my cup of tea). But the appetizers I had was good, drinks good but my food had was salty ( the lobster mac and cheese) and over cooked ( the lobster) bit the grilled chicken and pasta was good just to spicy for me. Overall a good restaurant."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXeTZYUEV3EAE",
            "text": "Went Saturday night, Fish taco was great! One of the female owners was amazing as far as customer service. Security was very professional. We had a wait due to prior reservations which I wasn’t aware of but we waited in the car and I can’t…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcnNhdk1BEAE",
            "text": "Surprisingly nice late night spot. I must admit I often over look places on Merrick Blvd but I’m glad I gave them a try. I was looking for a place to dine on late Friday night. This place surely delivered.\n\nWe showed up a bit after 11pm. There is a security check before entry. The place is kind of small but the it was full of energy. The drinks are pretty decent, prices are comparable to LI restaurants and the food was delicious. Aside from dinning in, I definitely would order food to go."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURObGNfMGN3EAE",
            "text": "Had dinner here on a Thursday evening, the vibes were nice and the food was on point. The service was kinda slow (1 waitress working) but overall a good experience. Had the chicken wings and  Seafood Jamboree."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXcktHZm9nRRAB",
            "text": "Looks nice but I wouldn't go here again. It was freezing inside. Everyone around us was complaining as we watched the server constantly rub her hands together. Three people came in and walked out after 4 min. After ordering our food at 5:34.... our meals came out at 7:19. The codfish fritters were sooo salty I had to send them back and they came with no sauce. My food was extremely salty. I ordered  the Hennessy salmon and shrimp.. they dumped a bunch of salty sauce over my food. I just wrapped it up but I won't revisit that meal. My cousin's food was not the best..she got a seafood boil. It was very expensive and took damn near 2 hours to come out. After this experience I would go somewhere else. It is horrible to sit somewhere with your coat on and scarf because it's cold inside. The drinks are not all that and very pricey. I WILL not be going here ever again.. even our neighbors sitting next to us agreed..we all said.. we should have went to Voodoo crab🤷🏽‍♀️..  2 stars 1 for cleanliness  and 1 because it's black owned...but that's all I'm giving."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYeV9qQkJBEAE",
            "text": "Upon walking in, the host was very kind. The place was not overly crowed at 6 pm on a Sunday. I was able to place a to-go order with ease. They have various options on the menu, which was a major plus. My wait time for my seafood boil was about 15-20 minutes. I decided to get a frozen blue Hawaiian while I waited, and it was spectacular!! Not too strong and not too weak. The bartender was very nice as well. The ambiance inside was warm and welcoming, and the aesthetics were quite attractive to look at.\n\nNow, the seafood boil was very salty in my opinion. It was good, but being that they are located in a primarily urban neighborhood, high levels of salt can be a very terrible thing for the community overall. However, the food had flavor ex. Garlic and other essentials (be mindful if you don't like much spice). I would come back again, though."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQaXRPVm9nRRAB",
            "text": "I have been there two times and both times I was very satisfied. Exceptional service. Music, drinks, food the atmosphere was A+. The Lemon Pepper Wings hit the spot. Oxtail mac and cheese. Both times our waitress was very pleasant and attentive even if it was a busy night. Kevin made sure everything ran smoothly. My friends and I will be returning very soon."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURacWFlQVBREAE",
            "text": "I had ordered rasta pasta and garlic butter salmon, it was very tasty. Overall the food and drinks were a hit. Our waitress Rashana was very attentive. I would definitely go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCeXBxZHBnRRAB",
            "text": "5+ stars for their menu. Alot of great choices. Never judge a book by its cover. We ordered lobster jamboree and curried lobster.  Our server never asked if we wanted the jamboree grilled or fried. Guess that was my fault. It came out fried, I would have chosen grilled. Not much effort put into the presentation.  Both dishes lacked flavor and spice. I had to crack my own claws. These days they should be precut ready to eat."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoMktfWU53EAE",
            "text": "Food was ok. Server was personable & friendly. I liked the reggae playlist they had on.  Bathroom needs attention."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzOXEyRU93EAE",
            "text": "Thank you Blu for an amazing experience, this is my second time doing to go, I ordered Mac and cheese with oxtail, jasmine rice, lemon pepper wings and buffalo wings the first time, everything came quickly and well packaged, the food was delicious!!!!!! My children and I really enjoyed. This time I ordered the seafood platter which included; crab legs, shrimp, corn, carrots and a few other veggies smothered in a super tasty buttery sauce omg it was so good, I had a side of mash with that, for my sons I ordered wings and fries as they requested and they tore it up. I also had drinks and that to was well made and well packaged! My taste buds are dancing!!! I’ll be in soon! Thank you! 10 OUT OF 10 HIGHLY RECOMMEND!"
        }
    ],
    "reviews_count": 56
}