{
    "name": "D’Lenny",
    "place_id": "ChIJw9LMpa1pwokROMqG6_SYOKE",
    "grid": "QN13",
    "address": "10-28 Beach 20th St, Far Rockaway, NY 11691, USA",
    "rating": 3.8,
    "user_ratings_total": 46,
    "phone_number": "(347) 727-7300",
    "reviews": [
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxV1IyeHZRalZvVHpOYWIxSmxlbTV1VEZOMk5uYxAB",
            "text": "Uno de los mejores restaurantes que he visitado, te sientes como en RD, las mujer que trabajan ahí son muy amables y el ambiente es agradable ❤️"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNVlsVnNVekZFY3pCUlJXaHhOa1JrZUd3d1UwRRAB",
            "text": "La verdad siempre pido mi comida hasta que me llegó una yaroa que me hizo vomitar Dios mío ya entiendo porque mi esposo me dice no compre comida y en la calle la yaroa con un pollo quemado y tú supiste verdad yaroa ahumada"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGdFpuWXhaR3c1VjJsVVpDMW1hWGhCUW5wU2VXYxAB",
            "text": "The food is disgusting, no love is put into the food and the establishment is dirty. I wouldn’t trust eating food from a dirty establishment, thank goodness i went in person."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucjVqM3hBRRAB",
            "text": "The best dominican food love eating there"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMzkzVGt3RRAB",
            "text": "Will not order from this restaurant again..I called at 1:40pm and my order was delivered at almost 4pm. they burnt my salmon, I asked for yellow rice and peas and they gave me rice and vegetables. I ordered steak and onions and as you can see everything was in the damn bag. I called them and the lady was not trying to hear me out."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmbW9ubTdRRRAB",
            "text": "Very clean and very friendly staff, make sure you ask for prices before you buy anything, because prices always changing. Great food, great service, if you ask for anything they there to help you!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYOWRIWjh3RRAB",
            "text": "I went to work with my sister and she with me mangu for breakfast and that was delicious my favorite plate of food in the restaurant is the 3 golpes with mangu"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYaWVpNnNRRRAB",
            "text": "I ask if she can shred the chicken and she failed to do so. Also passion fruit tasted old and sour."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuejcycmRnEAE",
            "text": "The service is slow, it always takes longer than you expect for the food to come out, but the quality is excellent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiN0pUVS13RRAB",
            "text": "Amazing & Delicious Food! The Employees are so Kind & Generous, Especially when ordering over the phone! All the way around the board, such a fantastic business!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMUp5aFpBEAE",
            "text": "Lo peor pedir para delivery dicen 20 min llega a 1:30 fría la comida y sin cubiertos"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6NEk3TnBRRRAB",
            "text": "No solo llamé antes de pedir pero pregunté que lleva el patacon nunca nadie dijo jamón NO  JAMÓN!!!!!! Y la acalpurria está cruda por dentro con carne de res en pedazos no molida.\nSegundo el delivery boy me dice que baje dejo my hija sola y llamo restaurante y después de 10 minutos luego llega el riéndose come que yo soy una muchachita. Estoy super desecantada con el servicio en total. Y el chicharrón viejo y frío .. The whole thing just Classless!!! HORRIBLE SERVICE AND COMMUNICATION if I was closer I’d take this back!!! The only good thing was the nice lady that took my order everything A DISASTER!!!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6Z09TVmZ3EAE",
            "text": "Pollo asado con arroz y habichuela 18 dolares? Normalmente esto no haría ni 12 dolares. Demasiado caro!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqNmZhRlNBEAE",
            "text": "I go to this restaurant whenever I come to Farrock to get my hair cut usually. Since I've been coming I've stuck to the shrimp mofongo which I can say is extremely good. This past Sunday I decided to switch it up and try the red snapper and boy was I impressed! They have some of the best Spanish food I've ever tasted."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5MGE3cnhRRRAB",
            "text": "We loved the food very tasty 🤤"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5ck12ekRBEAE",
            "text": "La comida muy rica pero deserción al pedir. Porque mandan la orden cómo no es.  2 veces me ha pasado lo mismo."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxb2RpN0RnEAE",
            "text": "Nunca tienen ensalda de papa o platanos disponible despues de las 3 y cuidado al comer encontre una piedra en la comida algunas de ellas tienen actidudes especial la joven de antiojos"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWNTVIRGtBRRAB",
            "text": "La mejor comida ❤️ dominicana"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWN1lYdExREAE",
            "text": "False advertisement"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaNXN5RC1BRRAB",
            "text": "Great spanish food! Great price! Great service! The owner is always super nice!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4N1pPa3NnRRAB",
            "text": "Ordered “Papa’s Suprema“, personal sandwich and side order of “French Fries with Mozzarella Sticks”. Counter person and waitress “Doris” was very polite and friendly. Doris provided great service and was helpful.\n\nThe Papa’s Suprema fries and bacon was nice and crispy, lettuce and tomato was fresh and chicken was cooked and seasoned well. I asked for the “White crema” on the side and it was basically regular mayonnaise? Plate also came with side of Pink sauce. I was missing the cheese but was later added by the cook.\n\nMozzarella sticks were house made, hot and crispy but not cheesy.\n\nPersonal sandwich was delicious.\n\nDining Table had two different kinds of hot sauces 👍\n\nWaited about 15 minutes. Longer than usual but Doris was mindful and brought all the food out together hot. She also ringed up the order fast.\n\nThank you. Will return again 👍"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoM3I2bkxBEAE",
            "text": "literally just threw up from the bacon egg & cheese. hopefully it’s just the breakfast that is bad and not every item on the menu. will possibly give another shot in the future but overall, horrible experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCby1MQ0NREAE",
            "text": "If you are looking for a good mangu and tres golpes this is your place!I can only speak to the Mangu dish, since its the only thing I have ordered along with empanadas and lemon juice. The quality is very good and tasty. I love these specific items."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlMHU2ZEJBEAE",
            "text": "This was the worst breakfast I’ve ever eaten in my life I don’t know how they have those ratings with such terrible food worst bacon egg and cheese ever home fries are undercooked and bland …… didn’t even ask for whatever extra meat that’s in there and it tastes frozen"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlZ2NTWVJBEAE",
            "text": "Buen trato"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1d3QteURnEAE",
            "text": "Food is delicious and fresh."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1dkxDSVN3EAE",
            "text": "Este es un lugar maravilloso 😍, buen ambiente, limpieza trankilidad, muy buen servicio y una comida 🤤 exquisita 👌"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1MDVIVXdBRRAB",
            "text": "I saw the new place and wanted to try it. I walked in and went to the counter . She was cleaning and looked up and said hello and went back to cleaning . I was waiting for her to ask what I need but nothing and believed me I waited . I got…"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPNTd5TTdBRRAB",
            "text": "Muy buena comida y muy buen servio. Recomendado"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPM1pfaDVBRRAB",
            "text": "Excelente 👌 atención y un lugar hermoso para disfrutar la comida en familias gracias…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXMnNicjl3RRAB",
            "text": "Delicious 😋…"
        },
        {
            "date": "5년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjNWJyaFhREAE",
            "text": "Comida muy deliciosa y sabrosa"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjeGZqTF9BRRAB",
            "text": "This food is so delicious 10/10 definitely recommend!"
        }
    ],
    "reviews_count": 33
}