{
    "name": "Bungalow Bar",
    "place_id": "ChIJUXf_vkBowokRJ5HnySRbQPA",
    "grid": "QN13",
    "address": "3-77 Beach 92nd St, Queens, NY 11694, USA",
    "rating": 4.4,
    "user_ratings_total": 2216,
    "phone_number": "(718) 945-2100",
    "reviews": [
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMRE1rY3JRM09hQ0h3EAE",
            "text": "Service was great,  thanks"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBeU1TeDFnRRAB",
            "text": "Amazing staff. Great food, beautiful views"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psYWJFbHNObU15ZWxKbmRtdDBTWFJ3T0dGS2VrRRAB",
            "text": "Bungalow Bar is a pleasant place that has a very laid-back relaxed atmosphere people are laughing having a good time you come in the entrance to bars right there and you greeted by the bartender the people are using their laptop so they have Wi-Fi they have a big game room there now for people who like to play old games I'd like to push that because it doesn't seem to be too many people in there I was there yesterday they are there every Wednesday from 4 to 10:00 its exceptional they have every game you could possibly imagine with two people there to teach you how to play them if you don't know or to actually play the games with you excellent addition to an already excellent bar the food is great the only thing I could say is that it was a little humid in there so I started to cough and the the are wasn't floating too well the fans were off at the time I was there so it might not be a fair estimate of exactly how the air quality is but it was a humid day too and a humid night I would suggest Bungalow Bar for somebody who wants to retreat for a little while take it easy"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJemNrNUhWMHhHV1RsQ05rc3dabHBwVURGalVFRRAB",
            "text": "I really enjoyed my visit! The food was delicious — full of flavor and beautifully presented. The ambiance and overall atmosphere were lovely, creating a comfortable and relaxing dining experience. Unfortunately, outdoor dining wasn’t available due to the bad weather, which was understandable, but it would’ve been nice to enjoy that option.\n\nThe only downside was the lack of parking, which made arrival a bit challenging. Other than that, it was a wonderful experience, and I’d definitely return!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTVRETTVjRTVwZUVodU5HNXBWVFY2TVMxU2MyYxAB",
            "text": "Dont order the calamari it was horrible. Hopefully they fixed the problem."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NWQxRTVlVXRLY0RnMFFtOW9WakZvYnpVek5sRRAB",
            "text": "Had to kill time flying in and out of JFK and visited twice. 10/10 both times. Food, service, value for money - all amazing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KdGFFZHZXWHBwTmxscVpub3dkRzQ1YzIxSlFXYxAB",
            "text": "When you first enter you do not imagine the place is so big inside. The outdoor seating area was a pleasant surprise. We were greeted warmly and seated immediately. Drinks and appetizers were great. The seafood is very fresh. The only reason I did not give a five star rating is that it took about an hour to be served the entree although it was not very busy at the time. Other than that everything else was great."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFMVl6VTRXRTVoVUU0eGRVMVlMVkJYY3pkVFRXYxAB",
            "text": "Attended a wedding reception there. The food and service was wonderful as well as the water views."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kSVRXUjVVV05YTlZCbExYUXlhMFppZWtaWFlYYxAB",
            "text": "It's all about the view. It's always nice to be near the water. My gf and I decided to try two different meals and share them. We selected the CT style lobster roll and the French onion burger with fries . The burger and fries were delicious,  but I wouldn't buy the dry, uninspired lobster roll ever again. The coffee was good but they served it with these huge table spoons which I thought was odd. I guess I'd go back,  since there don't seem to be tons of options in the area."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOTWVFSmtjVFEzVnpZMGJVTlNSbGxPY3pSeE9GRRAB",
            "text": "Great spot on the water. There is live music a lot of the time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ab2VGRjVVWFZWYVhwSlgyTmpNRll5WDJsd09YYxAB",
            "text": "I’d like to share my recent experience with a particular bartender at this establishment. My friend and I came in yesterday for food and drinks. We were told we could wait at the bar until we received a text that our table was ready—no problem.\n\nThis wasn’t my first visit. I had a great time previously—good food, great vibes, excellent service. Naturally, I expected a similar experience this time around, especially with football season bringing in more crowds.\n\nAfter about 10 minutes of trying to get the bartender’s attention, my friend gave up, so I tried. As I was about to speak, the bartender cut me off and said, “I’ll be with you in a minute.” Fair enough—I waited.\n\nI was standing between two customers who were already drinking. They noticed I hadn’t been helped and even encouraged me to yell to get his attention. I told them the bartender had asked me to wait, so I stayed patient.\n\nHowever, over the next 10 minutes, the bartender repeatedly returned to those same customers on either side of me, offering them refills—multiple times. At one point, one of the men even pointed at me and said, “She needs help too,” and yet, the bartender still didn’t acknowledge me beyond saying again that he’d get to me “shortly.”\n\nAltogether, we stood there for about 30 minutes without service or proper acknowledgment. When someone else finally helped us (I finally was able to get someone else's attention), we were told they didn’t even have the drinks we came in for.\n\nThis experience left a really sour taste, especially in contrast to my previous visit.\n\nWhat bothered me most is the feeling that we were deliberately overlooked. I’ve worked in hospitality and customer service for over 20 years, and I understand busy days. But this didn’t feel like being busy—it felt personal. My friend is gay, and we couldn’t help but wonder if the bartender’s repeated dismissal was due to bias against us being there \"together\".\n\nI don’t make these kinds of assumptions lightly, but I think it’s important to speak up when something doesn’t feel right. This interaction was not just disappointing—it was disheartening. Unfortunately, it’s enough to make us not want to return, and we’ll be sharing our experience with others as well.\n\nJust a heads-up for anyone considering visiting: your experience may vary depending on who’s behind the bar."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGaU9XZGFUMHROVjB3NWFWWlpkVTVCT1RSa1NFRRAB",
            "text": "Over all great experience the only issues was the host not keep track of seating the wait was long due to her not paying attention to names and order of which people  came but other then that place is amazing 🤩"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210MFVHcFFlVVk1Y0Rkc00wOTVSbVpHWmpkWk1VRRAB",
            "text": "Beautiful spot right on the water — we even came by boat! 🚤\nThe food was incredible, and our waitress was so fun, kind, and attentive.\nGreat atmosphere, great service, great food.\nAbsolutely loved it! ❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZeFQwTjBhWGwzVWxjMVUyZFFhMVJVYUhCSE4yYxAB",
            "text": "It was very refreshing and relaxing. I love it!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taSU1FUkhNbVZwU2xsWFJVMTFNWFZXYkd0TFFrRRAB",
            "text": "So sad that this place has gone downhill, especially because it’s right on my block. They used to have a great menu and ambience, but the new menu (in place for maybe a year now?) leaves so much to be desired. Everything is heavy, fried and greasy now. The drinks are now watery and bland. I was walking up to eat dinner on Labor Day, and heard the DJ playing some sort of Trump Remix song (literally saying DJT over and over)… not a fun vibe. Turned around right away, definitely not coming back."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIcTZ2U1dnEAE",
            "text": "The best plan after spending a day at the beach!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pob1FsZzVTMjFVVkd0QlkyNDRRek0wYVhKVmVsRRAB",
            "text": "Really nice local place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbU1GWldjMlpqU0dGV2FFSXRVRE4wTXpGTU9HYxAB",
            "text": "Food was fresh and delicious"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUFFtSXhTVkowWm5GYU9WRmhjRlpWYUVoblJVRRAB",
            "text": "This is a really fun place the food is delicious the atmosphere great"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUGJ6UmlSMnRrYVROblNtaFNTMDlxVUdVM1QyYxAB",
            "text": "What an absolute disaster. I think it’s really sad when owners have no care, passion, or pride in their establishments. This is one of the saddest excuses I’ve ever seen. Where can I start?\n\nOur “server” didn’t come over for 25 minutes. I think her name was Brigid. 25 minutes - no attention, no water, no silverware, nothing. When appetizers finally came out…had to wait another 15 minutes for silverware. Had to ask for water 4 times. Water came out 45 minutes into the meal.\n\nRecieved alcoholic beverages - that didn’t have alcohol in them.\nOrdered the lobster bisque and there was blatantly soap in the bowl. Couldn’t eat it.\nOrdered the shrimp and orzo salad - shrimp is advertised as warm - it was ice cold. Salad was supposed to come with feta, no feta.\n\nStaff is super incompetent, lazy, and abysmal. The worst dining experience of my life. I’ll never return and will actively be encouraging my friends to follow suit. Can’t wait for the owners lackluster and phony response trying to justify deplorable service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MVFYQlphMHhpV1RkNmMyVmtZVnBaTW1NNE1YYxAB",
            "text": "Great food, excellent service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbldWOVVaWEJ0VjJKS05WSXRSM2t6UjJkM1gwRRAB",
            "text": "Wonderful ambiance now that they have shade over the deck.  Gorgeous views looking out over the water and the grilled fish tacos were fantastic and fresh!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwa3I3am5nRRAB",
            "text": "The atmosphere is beautiful, the service was great but the seafood paella sucks. While the seafood portion was a lot, it was cold and the rice was mushy."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1bWR6ZEVaalJ5ZFVaaUxXZFdNVTB3TVVKeGJIYxAB",
            "text": "If you're looking for the perfect summer evening on the water after a day at Rockaway Beach – after a day  anywhere, for that matter – the Bungalow Bar is a place you definitely want to check out.\n\nHidden behind a McDonalds on a nondescript block,  it surprised us as we entered: the weathered wooden entry area opens onto an outdoor bar, which in turn leads to a huge, beautiful deck, open to the sky on sunny days, but easily transformed into a covered veranda in the case of inclement weather.\n\nThe night we were there, it was open to the sunlight and the breeze, and throbbing with the happy buzz of dozens of families and young singles. Throbbing with music, too – nostalgic hits delivered by a gifted vocalist / guitarist who had set up his stand at the bar and serenaded us all evening with Simon and Garfunkel, Tom Petty, Fleetwood Mac, Bob Dylan, the Beatles, and more.\n\nThe food was a cut above most places like this, in the sense that it was prepared far more creatively and was higher quality than expected – that is, it was consistently fresh and flavorful. I had a broiled striped bass filet on a bed of corn-tomato succotash and roasted sliced fennel; my wife ordered crab cakes and a steak salad. Portions are big.\n\nService, at least the night we were there, was impeccable - the young servers attentive without being pushy, and happy to be part of the team (nothing like a rude or grumpy waiter to spoil a night out!).\n\nThe manager and her assistant were out there on the deck too, chatting with familiar customers and introducing themselves to new ones like us. After learning that we had chosen the place for our wedding anniversary, the manager congratulated us and later instructed our waitress to offer us a round of drinks on the house!\n\nAs we left for the A train, the sun was setting over Broad Channel and the faraway lights of Manhattan were flickering over the water. Fishermen were setting up for the night along the promenade…. It's a slice of old New York that we never would have seen without stopping in at the Bungalow Bar. Why not do the same?\n\nChris Zimmerman"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkTGNUVkdSR0pRT0RaVlVGVnlOREZZWlcxa1ZrRRAB",
            "text": "I’ve visited the Bungalow bar twice n two weeks. Back to back. I’m not a burger person and absolutely loved the burger with the blue cheese ( can’t remember the name)."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abFIwZHpWV2xFZFhsRWJIQTFTMDFJWVZoUVEzYxAB",
            "text": "Amazing place great staff .Really great ambience. Great food great vibes..."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdVJGZGlTbWw2WmsxelVqWmlVazlvV1hWSk5FRRAB",
            "text": "My friend introduced me to Bungalow Bar for lunch this past week.  I enjoyed it so much that I brought my wife for dinner on Saturday.  The food and service were great both times (despite being it very busy on Saturday night). The menu has many staples, but done well and creatively. And of course, you can't beat eating outdoors by the water on a beautiful day. For dinner, the wait was actually less than the hostess estimated (10 minutes rather than 20-30).  I would make only one suggestion to the management,  and this seems to be a trend at almost all restaurants that offer live music: the outdoor speakers are set too loud.  I enjoyed the music,  but it shouldn't prohibit us from having a conversation without using hand signals lol. As I said, it seems many restaurants do this, but hopefully, Bungalow Bar can set a new trend.  I will definitely be returning, though."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWUVVVZEhkMjUxTVhWNlZEWlVUbkJLZDFsV04wRRAB",
            "text": "I ordered a Surf and Turf dinner. The steak was a perfect medium rare. The lobster wasn’t over cooked and rubbery.The server seated me as I waited for my guest and when I suggested an indoor table she obliged. Service was to my standards. Atmosphere friendly and inviting."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kVGQyaFRXSEJQWjBzdE9UWnRjVU5TY0RRelVXYxAB",
            "text": "Nice spot, good family friendly food and great view of the bay"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5c1lYUlhUWEpTTjNsR1FXUktVWGR1VDB4WmFVRRAB",
            "text": "I had the Tuna Poke Bowl and the ribs at Bungalow Bar—both were delicious and full of flavor. I also tried one of their mocktail teas (can’t remember the name), but it was super refreshing and paired well with the meal. Great spot for tasty food and a chill vibe!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nelQwTkRNbVpYVlRCTmFIZG9iSG80UkZCWlZXYxAB",
            "text": "The Poke bowel. Delicious!! Amazing staff. Good drinks… love this spot!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTVozbFVNa280UzB0MU1sOXBUVlJhUmtvMVVHYxAB",
            "text": "The food and ambiance were delightful, but I must admit, I was somewhat concerned by the presence of numerous small flies within the restaurant. When I brought this to the attention of the staff, I was informed that they would consult their manager, but I did not receive a response. I am curious as to whether you are aware of how unpleasant it is for guests to constantly have to ward off flies from their meals and beverages."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUE1DMW5ObUl0YjA5alIwNU5aWEpXV2sxSE5WRRAB",
            "text": "This place is absolutely beautiful with a great atmosphere right by the water. The food was really good — everything we ordered tasted fresh and well-seasoned. Unfortunately, a few of the menu items we wanted weren’t available, which was a little disappointing. Also, the service could’ve been more attentive. We had to wave down the waitress because no one came by to check in on us or offer water while we waited for our food. Overall, still a nice spot to enjoy a meal, especially if you’re looking for a scenic view."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWeGEwUTBORWxVUlRKeU9VOTVORTFHVWpGaVJsRRAB",
            "text": "Big fan of the food here but recently they changed their fried calamari quality. This time we got jumbo sized rubbery rings that tasted artificial and super processed. Very bland and difficult to chew almost like eating a fried tire. Big bummer. Hopefully management sees this and reverts back to their original ingredients."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3Z05fLU1BEAE",
            "text": "The wind howls off the bay, rustling the neon promise of another night adrift at Bungalow Bar. The wooden planks creak beneath salt-worn boots, a rhythm to the jazz of laughter and clinking pints. The place where a Wanderer might’ve settled in—gazing out at the Rockaway waters, spinning stories between whiskey sips, nodding along to the unspoken poetry of a well-run joint.\n\nThe drinks come cold, the food hits right—burgers thick, seafood kissed by the tide, tacos with just enough bite to remind you life’s got spice. The crowd? A mix of locals, wanderers, and city escapees, all chasing the night, the salt air, the sound of a distant train rolling back to Manhattan.\n\nFour stars, only because no place is perfect—sometimes the wait stretches like a long highway under the July sun, and the crowd, though vibrant, can swell too thick for comfort. But the view? The vibe? The way the place hums with a summer-night energy that makes you want to stay just one drink longer? That’s worth the trip every time.\n\nBungalow Bar—where the road meets the tide, and the stories write themselves."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYc0t1bVZBEAE",
            "text": "Food was so good. Scallops with risotto was fulfilling and creamy. Yum. Service was friendly. Cocktails were delightful as well. Looks like a fun place to be for the summer months as well as they have a boat deck and outside bar."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWVVNrWlVaVlZTTkhWelNXZFdiVkpXTkdoSWFXYxAB",
            "text": "The place to be in the summer. It has a great vibe with live music and strong drinks. Most of it it’s outside so we can enjoy some sun."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyOThtOWJnEAE",
            "text": "We were at Jacob Riis Beach, and my daughter wanted some oysters, and she google to find a location, and it directed us to this location. They escorted us through this entrance with artwork on the wall. Service was quick and very professional. Staff was on it about making sure the table was clear of finished plates and glasses. After a day at the beach. Then, to be able to eat at a location that provides a raw bar and steak dinner. Their dessert menu was outstanding. They had a live performer who sang, rap, and was a one man band. It can't get any better than this."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKXzRTRWlBRRAB",
            "text": "This was my first time at this restaurant. The bartenders were very friendly and made great unique drinks. I ordered the ground beef burger with blue cheese and chipotle and it was very delicious. I also had the garlic fries which were super tasty. Overall, the atmosphere was beautiful and had a nice view of the waterfront. The restaurant was also resting on top of the water which was cool. The service was quick and friendly as well. Definitely recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNZVU2WXlLbU15eXp3RRAB",
            "text": "Lived next to this place my whole life and never stopped in until the other day ... if your in the Rockaways dont make the same mistake the food is delicious and reasonably priced"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQREFxWWZZMkx5QmtRRRAB",
            "text": "Went for mothra day brunch, my waitress was so rude, they told me over the phone that children eat for free, when I went there they charged me for my 3 years old who didn't eat anything beside few grapes there, and after 2 times back and forth with waitress I requested to talk to the manager, I guess manger told her to remove the charge. She came and threw the bill book at us, and left without saying anything. If that wasn't for mothers Day, I would have complained about her and wiped off her tip, which was $23. They charged gratuity on there own that also 20%, like seriously, and then I get this treatment, she only visited my table 3 times in 2 hours, to just ask for refills and she makes $23 dollars from me for that? One another thing my previous bill was $150 so 20% tip came out $23, but to my surprise even after she took my child bill off that made the bill $120 she still charged us the same $23 for the tip as 20% of 120. What a shame. Like I said, I didn't want to ruin my special day, so I didn't take any action and left.\nThis place served the worst food you can think of. Everything was gone cold. Anytime I asked servers or mangers for anything, the answer was NO to everything, and they would stand and listen to me they would just be walking as answering me. I felt like I was eating for free there.\nI don't remember even one thing being tasty there, food was absolutely gone cold, fruits gone pulpy, carve station food was hard and very salty. They didn't have spoons for most of the things, some people were using serving spoons from other dishes into different dishes. Causing food contamination. I asked the manager is this hummus, it was in a very tiny bowl on the salad bar, she said yes. I said do you have spoon for this, so she said either you can pick a cracker and scoop some out with it or I can get you a spoon!!! THERE is no PARKING as well. Only street parking very tough to find. No guys please stay away from this place you will not miss anything in your life if you don't go there. You might only gonna save your peace of mind and money by not going there. 0 stars to this place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3MS1henl3RRAB",
            "text": "We arrived on Friday evening and got to see a band perform and listen to live music. I really love this place because of the atmosphere and delicious mussels. The fish was a bit dry. It was very unpleasant when we couldn't add salt and pepper, the holes are very small and the salt is coarse🤷‍♀️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNicG9LZDJBRRAB",
            "text": "Love this place.  The view is beautiful.  It looks over Jamaica Bay and the Cross Bay Bridge.  The atmosphere is laid back.  It is big space inside as well as outside.  The service is quick.  The prices are very reasonable. The food and drinks are good.  It is open year round.  I will definitely be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqd1AzVjJBRRAB",
            "text": "I have had this bar on my radar since I saw multiple posts about this place on Instagram in the past. I came in for brunch, and I think this place is super cute, and I got such a great view of the water while dining outdoors. Owen was my server, and he was very friendly. The service getting my food and drink was a tad slow, which was understandable as I saw the restaurant was having a private event inside.  They have a decent sized menu with reasonable prices, and the Meatlover Omelet I ordered tasted really good. They also make a great bloody mary as well. I was surprised that I didn't have an issue finding street parking in this area as they don't have a parking lot.  Overall, I was happy with my first experience, and I will definitely stop in again the next time I drive to the Rockaways."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdi1TQm93RRAB",
            "text": "This place gets 5 stars just for their awesome view and spacious outdoor seating. Their Shrimp Taco and watermelon salad with Salmon was delicious and my son said the hamburger tasted like it was off the grill. great Calamari. I have been here countless times and it is a hidden Gem in Far Rockaway. I believe on weekends they have a DJs around 7pm. This place is family friendly and they have a great variety of food on the menu and service. Definitely a great stop if you're headed to Far Rockaway Beach ⛱️ 😎"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0MFVYWkVObUpPYUhGRFFrWldPVXBrUkRoRVVGRRAB",
            "text": "First time visiting the place. Food, service, and atmosphere are excellent.  I had the NIGEL's Jerk Chicken, it was so good I had to order to-go for my wife. The seasoning and sauce used were top-notch. I would recommend this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaci0yRXh3RRAB",
            "text": "Location - Excellent\nGreat find hidden away on the waterfront with a gorgeous view and an even better outdoor seating on deck. Very lively indoors.\n\nParking:\nDon’t expect to find any parking at the restaurant but ample parking easily available on streets opposite the restaurant.\n\nFood was good.\nWe ordered:\n- Fried calamari - Good\n- BBQ ribs - Excellent\n- Blackened Sea Bass - a bit bland.\n\nService:\nStaff is friendly and eager to serve. Smiling faces.\nHostess - No comments.\nOwner - Such a delightful and friendly Lady.\n\nOwner advised me if we wanted window seating we could call in advance and reserve. As hostess was not exactly accommodating us even though the window seating tables were getting free one after another. But we had a nice time as the view and food was enjoyable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6aDZxUlp3EAE",
            "text": "My wife and I went here after surfing the other day and had a great time. The view is awesome, the drinks were perfectly made and the food was very satisfying. We also had an incredible server named Lauren who couldn’t have been better. We look forward to visiting again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiZ0lhUDRRRRAB",
            "text": "The vibe over here is pretty cool.\nGetting to the entrance is a little tricky because of the busy street. I ended up parking across the street and crossing over. The entrance looks like a little one door alley way. Once you step inside there's one wall with beautiful art work. Its like four different designs.\n\nThe host stand is right in front. I was greeted immediately and taken to a table. There is a bar section that's along the water and has a section for a band. The other part has tables for people to sit and eat.\n\nOur waiter was extremely attentive and friendly. There were multiple staff standing around watching the tables. As soon as you finished eating something, they immediately came up to the table to take the empty plates or cups away. I actually appreciated that alot.\n\nWe order two dozen oysters and one dozen clams. Both were extremely fresh, cold and tasty. I do wish they would serve it with more lemon and cocktail sauce. We also ordered the tuna crisp. It was absolutely delicious. The rice was not crispy on the bottom as we expected it to be. They serve it with crispy wonton chips but only two. I wish they gave more.\n\nI got the penne al la vodka with steak. It was good. I wish the pasta had a little more sauce but it was honestly still good. My daughter got the bbq ribs which came with fries and slaw. My mom got the filet migon with mash potatos, asparagus and gravy. My mom wish they would of put tje gravy on the mash. Instead they soaked the steak in the gravy. It took the sear away from the steak and sort of defeats the purpose.\n\nFor dessert we got the brownie, caramel crisp skillet and apple crumble. I dont recommend the brownie or caramel crisp skillet. They taste like the refrigerator. The skillet dessert is supposed to be hot however, just the skillet was warm,the cookie crisp was cold. The brownie just didnt taste good. I highly recommend the apple crisp, it was delicious.\n\nWe ordered the mocktails. We got the hibiscus lemonade and pineapple fizz. They were both really good.\n\nThe service here was perfect. I highly recommend coming to this place for a bite to eat. The live music was really impressive as well and made for a great vibe. The band played gin and juice which was hilarious. Overall great time. I cannot wait to come back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWSFdsRmliWGxNZG5CZmNXRXplRUZFYldsWFdHYxAB",
            "text": "We used to love this place. Sadly it has gone down hill. Burger was literally raw. My husband took one bite.  We told the waitress and she said she would tell her manager.  They didn't take it off the bill or give us any discount.  Terrible food and customer service.\n***Adding to respond 7/3/25 ***\nThe server told us she was going to tell the manager.  She never offered to get him.  Had she brought him to the table,  I would have gladly told him. When she never said anything else I figured it would be taken care of in some way.  Unfortunately my husband didn't want to say anything but instead just write the place off but I insisted. Raw or cold, we were unhappy. Refire the burger?  Even if it was acceptable to have food that had started to be eaten go back to the grill for a second time, what were we supposed do eat separately? I'm sorry you find the one star review unfair, but I find it unfair that we paid $25 for a burger that he didn't even get to eat."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1azVMallnEAE",
            "text": "This is a waterfront restaurant with amazing views, delicious food and great service. I tried the fig & pomegranate martini which tasted good and very STRONG. The shrimp tacos were ok. The fra diavalo mussels was spicy and full of flavor. I love spicy and it was absolutely to my liking and one of the best I’ve had. The seafood pasta was cooked in lemon butter and delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUeS1qdUdBEAE",
            "text": "Grab a drink and some food while you enjoy a great view on the water. Located right by the Cross Bay Blvd bridge this restaurant is fairly accessible if you're coming from Queens. Can get very busy at times with its popularity."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xTVZrdHlVbUZ5WVdwalNtUkhNMVpzTUUxM2RHYxAB",
            "text": "This was date night for my husband and I and the ambience was so romantic and we sat on the outdoor deck overlooking the bay.\nIt was a light fog setting in right after the sun had set.\nThe hanging lights from the deck set the mood for our date,\nThey offer live music and the atmosphere was amazing the guy played some 70’s and 80’s music and he had a piano and sang some throwbacks and we had a ball.\nThe food is commercial and I wasn’t really impressed with it but nevertheless I didn’t let it dampen the mood.\nThe drinks are affordable and they pour decent quality drinks.\nThe crowd was amazing and friendly we laughed and danced the night away under the stars once the fog lifted.\nI highly recommend this hidden gem in the cut nestled behind McDonald’s drive thru.\nIt’s a wonderful experience and you have to stop in and take in the breathtaking view from the outside deck.\nIt’s great for all occasions and it romantic so if you’re looking for a place to POP THE QUESTION THIS IS THE BEST PLACE TO DO IT.\nI promise you’ll thank me later."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhcFlXLU5nEAE",
            "text": "Our recent visit to Bungalow Bar was nothing short of fantastic. This wasn't our first time here, and just like our previous experiences, we were blown away by the quality of food and the warm hospitality.\n\nTo start, we ordered the soup, which was a delight in itself. The rich, flavorful broth was the perfect remedy for a slightly chilly evening. It's evident that they use fresh ingredients in their dishes, as the soup tasted just as vibrant as it looked.\n\nNext up, we opted for the fried calamari, served as a separate dish. Wow, were we impressed! The calamari was cooked to perfection - crispy on the outside and tender on the inside. Each bite was bursting with a savory goodness that left us wanting more.\n\nFor the main course, we couldn't resist trying their signature burger with blue cheese. Let me tell you, it was a match made in heaven. The juicy burger patty combined with the sharpness of the blue cheese was an explosion of flavors in our mouths. Accompanied by a side of perfectly seasoned fries, it was a complete and satisfying meal.\nThe beer at Bungalow Bar is a delightful and refreshing choice. They offer a great selection of beer.\nMoreover, the professional bartenders at Bungalow Bar truly know their craft. They take pride in their work and skillfully mix a variety of drinks, ensuring that each creation is a true masterpiece. Their passion and expertise shine through in every sip, making the drinking experience all the more enjoyable. So, if you're a fan of beer and appreciate the art of mixology, Bungalow Bar is definitely the place to be!\n\nApart from the fantastic food, the ambiance at Bungalow Bar is perfect for a relaxing and enjoyable dining experience. The staff was attentive and friendly, making us feel right at home.\n\nIf you find yourself near Bungalow Bar, I highly recommend stopping by for a meal. The fresh and delicious food, especially the soup and fried calamari, will leave your taste buds delighted. It's a great spot to unwind after a long day, and the culinary offerings will undoubtedly leave a lasting impression. We can't wait to return for another delightful experience!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbjlMZlZnEAE",
            "text": "A Rockaway beach staple, tucked behind a McDonald's yet along the water. We stopped here to enjoy some live music as the sunset outside. Reasonable and broad menu of drinks and food alike. We enjoyed the tacos, crabcakes...simple and were ok. I give credit that the young staff was hustling and doing their best and working quickly all while being professional and friendly! (understandably they seemed understaffed). Just manage expectations to wait patiently!\n\nWe loved the fun atmosphere and  friendly vibe all around. Plenty of space to sit inside and out, and loved the live music. I would would come back here to enjoy the vibes along the water and a drink. Cheers!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxR1YyNUliSEJrZUhWSFRHaHJjVlYyWjIwdFJHYxAB",
            "text": "I was there last evening with my family of six, including a two year old. The food was just mediocre. We left the requested $30. Tip. I requested a cheeseburger burger and fries to go for  my granddaughter.  When she opened the burger at home. , it was bitten in two places. . And we are also black.,,,,This is very sad and disturbing.. the staff seemed very friendly,  but this is a very disappointing experience.  Thought they were much better than that."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLaHNUWkNnEAE",
            "text": "The outdoor dining area of Bungalow Bar is well-designed and cozy with beautiful sea & bridge view. Unfortunately, it was a rainy day so we weren’t able to enjoy our food outside.\n\nWe ordered their Mussels, Fried Calamari and Fish Taco to share with a group of two. The food was not the best but the ingredients were very fresh with great portion. Our favorite was the Fish Taco, the fish was cooked perfectly, juicy and tender."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyejlqdFNnEAE",
            "text": "We ordered a few different things and they all came out great. The view from outdoor seating in beautiful and we were able to enjoy the warm weather on the patio. Will go back again...."
        }
    ],
    "reviews_count": 58
}