{
    "name": "Somtum Der",
    "place_id": "ChIJY_1BtoJZwokR-sB-pdEPW44",
    "grid": "MN3",
    "address": "85 Avenue A, New York, NY 10009, USA",
    "rating": 4.5,
    "user_ratings_total": 1321,
    "phone_number": "(212) 260-8570",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Ga05HRldTRU50TW1obVZVTnRUR0ZsWkVOUVUzYxAB",
            "text": "Unsure of why this is rated so highly. We were about a year ago now and the portions were small, the food was good but not mindblowing and we left hungry. It is also very casual so just a heads up! Won't be returning and just expensive for the portion size and taste."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMlZ5MVBNemxrWlZsSVMweEVMV2R3WVZoT1QzYxAB",
            "text": "Best service 10/10\nFood 10/10\n\nThank you mak krub ❤️"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SYWJIQk5Tbko2YVRjNWVIQjVOakJLTmtkWlVtYxAB",
            "text": "Every item I tried here was worth ordering again. You'll want to keep this discovery to yourself. The standards here are high. The team understands all offerings and provides exceptional service. This pleasant place was revealed in my digital search."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWNFJuQTRTM0o1U2pBMU9UWllhV2RhUzBNNGVtYxAB",
            "text": "I’ve been a huge fan of Somtum Der for years and it’s past time for a review! It’s one of my favorite restaurants in NY/NJ and especially when we want delicious Thai.\n\nThe quality of flavors is rarely matched in most other Thai restaurants we visit around the area. For example in their pad krapow / basil rice you can smell the aromatic basil throughout the dish!\n\nWe usually order their duck larb, whose contrast of sharp, acidic, and hot hot flavors are so good. We’ve tried this dish in many other restaurants but the depth of flavor has been almost unmatched.\n\nThis is all to say I love this place and enjoy every visit. It’s a good thing for my wallet that I don’t live closer."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOSlRVVlNiRkF3Y1hKVFNraFZiVmRrWTJGemNXYxAB",
            "text": "Tourist from Atlanta that has a diverse food scene. Recommend here by a local whom we crossed paths with. Not a let-down in any way. Best crab fried rice I’ve ever had and also what was recommended by the local to get. Happy to have experienced this restaurant."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GM00xTlJaM0JVVEc5dE56Tm1iM3B2U0hGM1RsRRAB",
            "text": "Food was good, great amount of fish sauce. Flavor lean towards salty and spicy so plan ahead. The Spicy fried rice with fish skin was mid, order the basil fried rice instead. Pad kra paw was good. Their fried egg's texture is exactly what I had in Thailand. Tomyum taste like straight out of MAMA seasoning packet."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prNVdWZFNkelF5YzNCNVNrWTVlR040WldsUGEyYxAB",
            "text": "Loud and packed but THE BEST SPICY THAI in nyc imo. Multiple variations of papaya salad and laarb. Delicious drinks and deserts. Love the raw shrimps. Highly recommended."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200eFRrWnliVWRKU1hWNllWUnFVVVZCTFdSMWIyYxAB",
            "text": "Super good food and friendly staff. A bit noisy but worth it for the food!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sQ01VRk5SMVpRWTB0QlZrbDFjSG90VTBSSVltYxAB",
            "text": "Solid Thai food. Very solid. Would recommend and return."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SVNYUnFSVUZ5TmpaelMxZFJWbU5xUW1WWFJsRRAB",
            "text": "This spot knows how to satisfy customers completely. Our entire meal proceeded without a single issue. Great dishes and professional staff created an impeccable experience. Our server displayed great spirit when helping with menu decisions. I'm grateful for this place's presence."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFM1dqaHdYMTl4Vldselh6TkpTVWRmUjNscWNFRRAB",
            "text": "Great and very authentic Isan/Thai food. It doesn’t have some of the other favorites of the Thai kitchen, but the staff is great about guiding you through the menu. The SomTom was of course excellent. The restaurant has a nice Bangkok feel and the service was great. No"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ST1JHcHVWR2RxV0dsSFJHaGZWMjlOYkUxZk5YYxAB",
            "text": "You can walk in and eat without a res. The food is amazing, especially all the salads (somtum, nam tok neua, etc.)."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMFptOXdOV3RxTUhCdlZ6VXpTamRwUnpGYVFrRRAB",
            "text": "They deserve credit for their steady quality control. Employees performed exceptionally well! Somtum Der has created the perfect home-like atmosphere. Their dishes hit all the right notes. I feel sure about coming back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxbVNtOWhlVlpCWDFWMWR6UkNUWFZxZG1GM1VHYxAB",
            "text": "One of the most authentic Thai restaurants in NYC! 🇹🇭 Every dish I tried was packed with flavor and transported me straight to Thailand. Their mango sticky rice is hands down the best I’ve had in the city, so fresh, juicy, and perfectly sweet, even when other spots are out of seasonal mangoes. I’m also obsessed with their prawn sashimi, crispy fried chicken, and pad thai. Each one beautifully seasoned, balanced, and comforting in the best way. If you’re a real Thai food lover, this place is a must-try. I’m already planning my next visit!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaR1kwbFBYM0pzUWpWb2NVNWtkRnByUjBwbE1FRRAB",
            "text": "Very good Thai food, one of the best I have eaten outside of Thailand. Can recommend this restaurant for those who want to eat authentic Thai food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25veWVGTjZNbE51YlRCcmFURm1jblpxVDNacVVVRRAB",
            "text": "Somtum Der in NYC is the real deal if you’re looking for authentic Isan (Northeastern Thai) food. The flavors are bold, spicy, and exactly what you’d expect straight from Bangkok. They earned a Michelin Star back in 2016 and it makes sense why everything feels fresh, balanced, and full of flavor.\n\nThe papaya salad with grilled pork neck (Tum Kor Moo Yang) was perfectly spicy and tangy, the Isan summer roll was light and refreshing, and the grilled marinated pork with coconut sticky rice was incredible. I also tried the duck larb and the basil fried rice both packed with flavor and spice that isn’t watered down for western tastes.\n\nIf you love Thai food and want the authentic version, this is a must-visit in NYC."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCT1NWbFFlbUV0WmxkNFVUTmhUbE0xWVhKdFdFRRAB",
            "text": "From the warm decor and splash of Thai flair, stepping in feels like a little trip to Thailand. The specials -- tender ribs and pork satay -- join their iconic crispy fried chicken and grilled marinated beef to bring bold Isan flavors straight from Thailand. This place is definitely must-visit!\n\nFollow me @foodie.elite on IG and Tiktok for more!❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcmNVcExWa2h3UkVzM04zSkNaVzlHWkhseU4yYxAB",
            "text": "I'm allergic to wheat and dairy and this place had a menu specifically for gluten free. The meal was fantastic; I got the pad thai, which I know is such a basic order, but I knew I'd receive the most authentic pad thai i can get. It was phenomenal, and I can't wait to go back."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlclktenBnRRAB",
            "text": "Have no idea why Mango with Crispy Salmon has absolutely no salmon for $25.  They should remove this misleading item from menu"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nME1tVlNhMjVaVEZaUVZWaFJOa1JzU1hOMGJuYxAB",
            "text": "Just had our dinner there tonight. We are party of 5 and they slipped in 20% tip on the bill. when I questioned about it, The waitress said: “ Oh your party is more than 4 people so we automatically add 20% tip!” I said: “ on your website, it says party of 6 or more not 4!” SUPER shady! Avoid it at all costs if you don’t want them to ruin your night out!!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWcFFXZE5YM2xLY0dScGIybFFkVGh5VW5wTmNrRRAB",
            "text": "We’re been here a few time and we love the food here but today’s the server (lady) gave us with bad attitude we genuinely ask for something specific things that they don’t have and couldn’t make it for us I personally understood that..this is my first time giving a bad review we didn’t take any pictures because we just want to eat and leave as soon as possible."
        },
        {
            "date": "3달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xRWJWcHZOMDgwY3pCdFJpMVBUMHRaUjNSTFVuYxAB",
            "text": "방콕 도쿄 지점을 방문하고 최종적으로 뉴욕 지점까지 들릴 수 있어서 매우 행복했습니다. 맛은 물론 개런티된 이산 음식의 고급스러운 맛입니다. 틀림없습니다.\n그리고 매우 친절하게 환대해주셔서 너무 행복한 식사를 할 수 있었습니다."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSlMyYzJWMVJLY1VWWFdHMUVSazV5VFZSVFEzYxAB",
            "text": "BEWARE: PRE-COMPUTED TIPS ON RECEIPT ARE INACCURATE AND INCREASED."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twSlpXYzFNRmw2YkZGTE5qTnRTbkZZVVhZMk9HYxAB",
            "text": "I went to Thailand a few years ago and I was able to taste the characteristic flavors of Thai cuisine: tangy, spicy, umami, sweet, sour, funky, pungent..\n\nI thought I’d never try them again but tonight I did.\n\nWe had the Pork lard, fried chicken, fried rice with basil, papaya salad and mango sticky rice.\n\n100% the flavors I remembered which will hold me up until I get to travel to Thailand again.\n\nAlso very friendly snd attentive staff."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKQ1pubEpTMU4xU3paMWVteFNNMFUzZG1aQlUxRRAB",
            "text": "Came here with a friend - the food was good overall, but the seating setup was a bit awkward. I was on a high sofa while my friend had a much lower chair, so I had to lean down the whole time just to talk. It was pretty uncomfortable."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tST09WUlJXbUpMTFVRNGJsTmhRaTFaZW1KNFdYYxAB",
            "text": "The food here is so damn good! 😋. It reminded me of growing up and sitting in the floor in my friends home and his mom making it and serving it to us directly out of the huge mortar and pestle….\n\nThe papaya salad was such a punch of flavor and the beef “jerky” was so delicious. 10/10 I’d eat here again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aQ1RWcFJjRU5ITVRGNmFrWlJha0pYWWt4bFRtYxAB",
            "text": "Was surprised they had no chicken but the tofu pad see ew was so good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oSU16ZG5kemRGTVU4elNDMWFjbE5yYUhGdlJrRRAB",
            "text": "My favorite Thai spot NYC!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNmQwTjRNRUZyTjNwZk9ERnVMVU52Vm5sV1ltYxAB",
            "text": "I had always been a fan of this restaurant but this time they automatically charged me 18% tips while on the menu it clearly states that the automatic tip will be applied to party of 6 or more. I think the service was fine, and usually I would tip for 18%. However, just applying that without notice is such a bad taste in the mouth, disrespectful for the patrons and dishonest. Not the kind of business I would like to support in the future"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SZmMybEJkbEZKWTJ3NWEyUnhabFJMUlZOb1NsRRAB",
            "text": "The best Thai in NYC. Better than soothr. 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsc1EyMU9aMFp3TkZGbFIwUmhXVE52YW5oc1IzYxAB",
            "text": "Phenomenal cuisine, great atmosphere, and even better service!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taQlZIcG5kVlZMYlVvMlprMXNRVmxMUlhJemRrRRAB",
            "text": "Wow, truly incredible… i’ve never experienced more authentic Thai food in New York!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WblYxTjJhMlZTVVhSbU1tZERRV3hmZEhwNGRuYxAB",
            "text": "An unforgettable meal. Phenomenal service and atmosphere."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5YVMweGhOVXhyWjBoclpHUXpTSGh2WVhGTk0zYxAB",
            "text": "Amazing food!!! Best thai food I’ve ever had. Papaya salad is a must try dish. 10/10, no notes"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201bmFYUldiRjh0UkhGcVpGQTJkVWsxY0ZOWFRIYxAB",
            "text": "The taste is good. Not enough table services."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xST2RITkJPVmhWZFU1M1UzTmxUV05OV0dGRlRrRRAB",
            "text": "Amazing- fried rice. The place is like a high end restaurant in TH. Good ambiance, will be back!"
        },
        {
            "date": "4달 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5VGVrVmhaR0kyY2t4RWJubzRYMmx2VlRoWk1FRRAB",
            "text": "202406\n生蝦超好吃但超辣 服務很有善"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGb05tbExUbVZFVjBWRmVIY3dPR2xFYzBFd2NHYxAB",
            "text": "Perfection.  A must try if you love amazing Thai food.  I go as much as I can. The som tum and Nam Tok are amazing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oeVJub3dZVWhEVTI1MGJWYzBaa1ZRVUdsV1puYxAB",
            "text": "They slipped in a tip on the check for me. Super shady."
        },
        {
            "date": "4달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwSU1FbHdSa3BpTVVKQlkxVmFlVkZ1T1VoNFNsRRAB",
            "text": "Les plats sont bons. Le sticky rice coconut est super bon."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNR09tcF9CZ2JUVmtRRRAB",
            "text": "The crab pad thai is really good if you like spice"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VQM3k2NE9kb1lpVWxnRRAB",
            "text": "Weird but good"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNNzZrcTZQclphNkh3EAE",
            "text": "I’m here to tell you, their crab pad thai lives up to the hype!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURReU4zbnV3RRAB",
            "text": "I gave it a 3 star for a few reasons. My Larb was a bit blan while my pad siew was way to salty. Other than that the other 4 dishes were standard Thai style and taste was as expected."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOS3ZvLVc5emV2eUtnEAE",
            "text": "Last night we ate dinner at Somtum Der.  It used to be my favorite Thai restaurant in New    York.\n\nThere were four in our group and we started with larb moo (not as spicy as it has been in the past), mango with crispy salmon (fried pieces of bland airy substance that did not resemble salmon at all) and Isan summer rolls (fresh and tasty).\n\nWe then ordered the pad Thai (not traditional pad Thai flavor, but tasty), beef pad kra proa (very little beef, basically a rice dish), and beef pad ki mao.  The pad ki mao is usually spicy and one of my favorite dishes. But, last night it was not spicy at all."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOQ2d0cTdrd3JTcDlnRRAB",
            "text": "Definitely one of the best Thai restaurants in the area! The food was delicious and SO flavorful! We’ll be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMai10YkNBM2J2V21RRRAB",
            "text": "Holy Crab! The Crab Pad Thai is so good! I love how each dish is thoughtfully plated to elevate your dining experience right from the get go.\n\nThen you’d find out that each dish is full of bold flavors. Somtum Der is exceptionally good (as agreed by their Michelin) because they bring to us authentic Northeastern Thai food, specifically Isan cuisines.\n\nThey don’t try to change the flavor profiles to best suit Western tastes, instead, they keep their original bold flavors. That is why they are exceptionally tasty!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMemEwZjNMbHF1eGx3RRAB",
            "text": "As a Thai person who joined the Army, and haven't ate a good Thai or Isaan food for 5 years. This place brought tears, it was amazing and it made me miss home so much."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJYi0tWlNwamZleDZRRRAB",
            "text": "Shout out to Tommy for being THE worst server I’ve ever encountered in my life:) Not only did he treat us with a nonchalant attitude as if we owed him money, he also did not even bother to ask what drinks we would like for the lunch set, and simply charged us the full amount without mentioning anything or double checking with us. The food is great, but would not come back again to tolerate his negative attitude."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VLbUlsck9rdGVMV1BnEAE",
            "text": "Went here a few years ago with my brother and his wife and just found pictures so thought I would post. We had pork skewers, Nam Tok Moo (grilled pork salad), pork larb, and the house special papaya salad. My brother used to live down the street from here and both he and his wife and swears by it. I just wasn’t that into it. Maybe it was the dishes we ordered ? It just tasted kind of bland."
        },
        {
            "date": "수정일: 1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScU9QTWtRRRAB",
            "text": "딱 현지 그맛\n무조건 또갈꺼에요\n최고"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3eEpDSkVnEAE",
            "text": "Super cute spot serving Michelin rated Isan cuisine and have been a staple in the community for over 13 years and you can tell. Every dish was super fresh and flavorful, with some unique stuff I never tried before. I loved their chicken wings, the pork neck, the pork skewers, the Taro dessert is a must try also"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneDVQYTV3RRAB",
            "text": "There’s a high bar for Thai food in NYC and this unfortunately was simply not remarkable. The tom yum soup was packed with flavor and plenty of shrimp, the pad thai was fine but on the smaller side serving size wise, and the grilled beef w/ sticky rice kabobs felt a little disjointed as a dish. It is a solid spot if you are looking for a quick bite but would not go out of my way to snag a reservation to come back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MlphdmxRRRAB",
            "text": "We love this place, been coming here for thr longest. Whenever we want Thai food this is our place to go. GiGi our waitress is the best. I believe she been out waitress most of the time whenever we are here.\nHenri"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cnJqN09nEAE",
            "text": "Came as a party of 3 (had reservations for 6:30pm) right before the dinner rush. The food was delicious. We ordered the special fried chicken, grilled pork skewers, papaya salad with salted egg, pad ki mao (drunken noodles), and Thai iced tea. The portion size was just right. We came hungry and left satisfied."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMXE2SFJ3EAE",
            "text": "I am from Thailand and I have been in the United States for 25 years. There are a small handful of Thai restaurants that I will go to in New York, and this is absolutely one of them. From the moment you arrive, you encounter our hospitality and warmth. The cocktails are creative and delicious (see Lemongrass Martini). And then the food… Glorious, glorious Thai food from the Isan (northeast) region of our country. The most delicious dishes, the freshest vegetables, the most flavorful grilled meats, the most glutinous of rice. Recently, I wanted to treat myself to an early dinner so I ordered Somtum (papaya salad), grilled beef (Nuea Rong Hai) and mango and sticky rice. I was instantly transported home to my suburban abode north of Bangkok, where my grandmother used to pound the papaya salad and grill the meats in our open air kitchen. Go. Eat. Drink. Eat more. Enjoy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYOTZMcnZ3RRAB",
            "text": "Somtum Der Thai in East Village, New York, is a great place for Thai food lovers. The restaurant has a cozy atmosphere, making it a perfect spot for a casual meal or a special occasion.\n\nThe menu offers a variety of dishes, but their papaya salad is a must-try, spicy and fresh. The other dishes are also delicious, with lots of flavors. The staff is friendly and helpful, ready to recommend what to order.\n\nPrices are reasonable for the quality of food you get. If you enjoy Thai cuisine, Somtum Der is worth a visit."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJN2JEaElBEAE",
            "text": "Had dinner here at Somtum Der NYC with my wife and we had a great experience. The food was delicious, especially if you enjoy spicy dishes — full of bold, authentic flavors. The decor is unique and gives the place a warm, stylish vibe. The service was also excellent; the staff were attentive and friendly. Highly recommend for anyone looking to enjoy flavorful Thai cuisine in the city!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2c2V5NXBnRRAB",
            "text": "This spot is a michelin-rated restaurant that offers variety of Thai dishes, with a focus on northeastern Thai cuisine (Isan), including spicy salads, grilled meats, sticky rice, and curries. The restaurant also has a laid-back, modern atmosphere that’s great for casual dining. If you’re in New York and craving some excellent Thai food, Somtum Der is definitely worth a visit! Make sure to make reservation because it can be really busy especially in the evening."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3LWZTY05REAE",
            "text": "The food at this restaurant is absolutely delicious, and I come here often! As someone who loves spicy food, I always order the spiciest option, and it’s incredibly flavorful with just the right kick. However, my friend can’t handle spice, and luckily, this restaurant allows you to adjust the spice level to your preference—whether it’s mild, medium, or extra spicy. The ingredients are fresh, the flavors are well-balanced, and the service is excellent. I highly recommend this place to all food lovers!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnM3VuSHNnRRAB",
            "text": "If you like Thai food, this is a great place!! I recommend their somtums(especially with the duck eggs)! Food is also priced decently, and this is a great place to come with a few friends to try many dishes~"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNneS1lTVd3EAE",
            "text": "Interesting Thai experience, unlike most of the Thai food I've had in my life. But actually spicy, so we take a W where we can get it. Portions are somewhat small, and oddly quite cold inside the restaurant itself. I still had a good time though, just wish they gave us more food. I was told by my boss that the pork neck and salted egg yolk salad were must-tries, but sadly I didn't see either of them on the menu. Oh well, another time then."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdXQ2MlRnEAE",
            "text": "Absolutely delicious and addicting! Som Tum Der serves up some of the best som tum, along with amazing fried rice, crispy fried chicken, flavorful tom yum, tender squid, and more. Even the desserts and Thai iced tea are fantastic. It’s hard not to stop by or order delivery because their food is just that irresistible. A perfect spot for a date, or for bringing friends and family to enjoy a great meal together."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzMlBHZXdnRRAB",
            "text": "Excellent thai restaurant for pineapple fried rice and mango sticky rice. Any add on is up to you.\n\nFelt like pad thai was a bit too sweet.\nLemon grass drink was amazing.\nSalad we ordered was a bit boring and spicy.\n\nParking was somewhat easy to find after dark.\nTables are very close to each other i can hear ppl talk. Would come back again for mango rice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURILWFYZFd3EAE",
            "text": "We decided to dine here since the reviews were high and we love thai food. The food was just okay nothing spectacular. We ordered the shrimp pad thai, pineapple fried rice, and the beef skewers. For the drinks we had thai tea. The pad thai was tasty. The beef skewers had a great flavor, however the meat was stuff and it was cold when it arrived. The pineapple rice bowl was different, it had more of a curry flavor with cashews, raisins, sausage, pork shavings. I was expecting more of a soy sauce fried rice taste. Would I visit this place again probably not."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1MVo2MzdnRRAB",
            "text": "Went for dinner with friends after track workout. The food tasted authentic. There are couple of Thai restaurants that has authentic taste & this is one of them. Service is super fast. Chicken wings with crispy chili garlic is must try. The dishes are pretty spicy and if you are not into spicy then u should order very mild."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0MnRfUmhBRRAB",
            "text": "Had lunch with my friend there and absolutely enjoyed this place! We ordered grilled coconut sticky rice skewer (very special and 100% if you like coconut rice), pork neck (really juicy and marinated with the right amount of flavor), creamy Tomyum soup (comes with many shrimps), and Thai tea panne cotta (great dessert option)! The service is great as well. 5-star recommendation!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5d2ZQVml3RRAB",
            "text": "One of the best Thai restaurants I’ve eaten at in the US, reminded me of the month I spent in Thailand several years ago.  We ordered the fried chicken, pad thai, Nam Tok Moo and   Kor Moo Yang Jim Jaew (thinly sliced pork jowl).  All of them were excellent and great for sharing.  Be warned, the Nam Tok was legit spicy at ‘medium’.  We also really loved their selection of herbal and alcoholic drinks all with a Thai twist.  Highly recommended for a night out with a small group of friends!!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQdXFiWWN3EAE",
            "text": "Some of our favorite dishes include the pork and rice cake skewer, the fried rice, and salmon skin salad. The only thing that I thought was below average was the noodle (forgot exactly which one but possibly the pad kee mao). Even though when you read the menu most of  everything has three chili sign on it, you can ask them to make hints not spicy, really appreciated that!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURweHVZQxAB",
            "text": "Spontaneous decision to show up at 6PM/opening time and was immediately seated to a pretty empty restaurant that was beginning to get busy for a Friday night. Had the papaya salad, larb and pork skewers and WOW the flavors. Service was fast and efficient but the FOOD was beyond something I could’ve imagined. Sweet, tangy, citrus, herbal deliciousness. Will come here again and again with the only difficult part whether I should order the same thing or switch it up."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybjVTbG9nRRAB",
            "text": "Food is top tier, though service isn't the best. The waiters wouldn't come by our table often even when waving at them several times. Also, my main dish came out until everyone else was done with their food. It seemed like they had forgotten about it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROOWZEbmF3EAE",
            "text": "Overall the food was good! It’s a small hole in the wall but the ambience is really nice! The papaya salad is a must! I ordered the Thai styled spicy papaya salad. My two friends that don’t like papaya tried it and surprisingly liked it! They order the chicken wings and loved it! I ordered the pad Thai noodles with shrimp. Not my favorite, it was bland. Wish I ordered something else with heat. My friend ordered a spicy noodle dish and love it! Our waiter was a bit unpleasant, I spoke 1st at the door after waiting a few minutes to be greeted. She came to take out order and no further conversation or follow up to see if the food or everything was ok."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURodl9mUUVnEAE",
            "text": "I’m sure I’ll be back to this restaurant if I’m ever around the neighborhood again.\n\nThey serve a unique kind of Pad Thai that I’ve never had anywhere else; it’s incredibly spicy, the staff warned me beforehand and I said yes to the medium spice level but I guess they could also offer with no spicy for those who can’t handle any heat. Despite having to take breaks due to the spice, the dish was delicious and amazing! It left me curious about their other dishes, which I assume are traditional or authentically Thai in flavor.\n\nPortion size was just right. Meal was satisfying. Staffs was also very attentive and made sure our glasses were always filled with refreshing iced water."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxMWVyUFdBEAE",
            "text": "Feels like home. We came to this area for a jazz event and we popped into this beautiful restaurant for a quick bite before the jazz event. The food is authentic and feels like going back to Thailand. The Somtum (Papaya salad) was prepared promptly after we ordered and it tasted amazing."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdkp5cDRnRRAB",
            "text": "La mejor comida Thai que me he comido en mi vida. Pedimos la ensalada de Papaya, otra ensalada de carne de cerdo picante y un pad Thai de carne. Lo pedimos todo extra picante y los meseros nos vieron sufriendo y nos regalaron una orden de arroz y un Té a base de leche para que nos bajará el picante jajaja. El lugar es muy bonito también y el ambiente 5/5. Si estás por East Village tienes q cenar aquí una noche."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEaklLTXRnRRAB",
            "text": "The food at Somtum Der was really good. My favorite dish was the Larb Moo salad, which was flavorful and paired nicely with a side of white rice. I also had the Sa Poak Kai Tod Der, which was also good. I thought the chicken could have had more flavor on its own but it was great paired with the sauce it came with. Their menu has a really good lunch special deal that I think would definitely be worth coming back to try. Our server was great and very attentive. We sat in the booths in the back which were a bit snug but the overall ambiance was nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuZzlqd3J3RRAB",
            "text": "I recommend Tom Yum Goong the most. The soup is creamy and rich in flavor. Pork Khao Pad Kraprao is also delicious. It would be better if the service could be more attentive."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcHVlWllBEAE",
            "text": "I was really excited to visit but for me it didn’t reach my expectation. People were great, food was good in general, but missing something special or impressive. The taste of the restaurant was mild compared to other Thai restaurant. Their style was not serving strong seasoning dishes (which was good for me tho.) In addition, u can adjust spicy levels of some dishes.\n\nThe beef in our pad Thai was a little bit dried. The taste was not that strong.\n\nThe salted egg flavor salad as appetizer was good but the same, taste was mild. Nothing ready stood out for me.\n\nChicken was a little bit over fried. The edge was beyond crispy but a little bit hard.\n\nWe also had the fish soup. Normal."
        }
    ],
    "reviews_count": 78
}