{
    "name": "Fossetta",
    "place_id": "ChIJ9RRDNShZwokRkVa5XZq-rxw",
    "grid": "MN3",
    "address": "198 Allen St, New York, NY 10002, USA",
    "rating": 4.7,
    "user_ratings_total": 153,
    "phone_number": "(646) 430-1249",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xReWRYQjNWWEZaVG5oalduRXRNRVpMTFc0MldHYxAB",
            "text": "Great atmosphere food and service. A beautiful place for a date night or night out with friends. Definitely recommend"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSQlJHRjNSbkZzZDFOVFdtbzFiRlpEZVhwMVpIYxAB",
            "text": "Outstanding. Focaccia is amazing and we loved the lasagna. When you go to the Katz line and it's ludicrous, do yourself a favor and walk around the corner for some outstanding dining! Wine, beer and coffee as well!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4alJHSnROMUpSTFhCMWQyUk1hVzF3UlUwNGNIYxAB",
            "text": "Went for happy hour, it was empty but gave us the worst seat next to the bathroom lol and the waiter took a while to get to us whenever we needed anything - food was yummy though and drinks were good so who cares lol"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0eVNHTnlSbVpyWlVJNU1sUjJhRVZ2TVhWMU1uYxAB",
            "text": "Had the pancakes for breakfast. Were nice but not great. Maybe it is my taste, but for me pancakes should be fluffy, these were a bit crunchy. Felt more like a cake than a pancake"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxU1VUVktSM1ZVY1dkNmMySjJUbEJHUkUxMmRVRRAB",
            "text": "I celebrated my birthday here and worked with the manager Josh on a custom family style menu for our large party. Not only was he so accommodating toward our dietary restrictions and budget, as well as customizing the dishes so that they met our needs, but he went above and beyond in making the night so special by printing custom menus for us and waiving our cake fee, to name a few gestures. The service itself was so good—everyone was so kind and helpful. The food was delicious (the fluke carpaccio and the labneh and focaccia were fan favorites) and every plate was wiped clean. The atmosphere inside the restaurant is so cute and cozy, which is exactly what I was looking for when planning my birthday dinner. Overall, I don't think I've ever had as good of a group dining experience as I did at Fossetta. I cannot recommend it enough, especially for special events, and I will surely be back—I need to try that brunch menu!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRd1dreHNkVlZ0WkZGdUxUaEljRzB0U21aVU9XYxAB",
            "text": "Had the weirdest experience yesterday. I arrived around 6:15 with a friend for a quick drink. We stood at the entrance for quite awhile, noticing several staff members making eye contact but not approaching. It was not busy, only about 4 tables in the place. After a few minutes of us laughing about why no one would greet us, a man came over clearly exasperated and just looked at me. I then said “… there are two of us, can we sit for a drink?” He said “do you have a reservation?” And we said no so he walked away to, I assume, check on the reservations for the night. Eventually we just decided to leave.\n\nIf they were booked up for dinner, we would have happily sat at the bar, but the lack of communication and the disdain we felt from the entire staff made us not want to stay.\n\nI’m honestly so curious why that happened, but it was so disappointing because it looked like a really nice place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUFJWOHdVa2RLZGpKQ1ozZHFiVVo1VTFoWlIxRRAB",
            "text": "Genuinely had such an incredible time! We had a party of 10 and did a set menu family style and it was so perfect. Management was wonderful in the planning process for my best friends birthday, even cut up our cake for us and everything! It was wonderful, 10/10 experience. Our server, Sid, was also so fun and made the experience amazing! Additionally, they made personalized gluten-free dishes for every course for our friend who has an intolerance. All around we had a perfect evening. Food was fantastic!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xka05HTkdiMFZxUlRSWGNGcERWSFpFUTFrM1MyYxAB",
            "text": "The Food was AMAZING  everything tasted fresh and delicious 😋 good music was playing and everyone was in their own little worlds with good vibes , will definitely come back to try the other things kn the menu"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kWmNHSk5SRUl4VG5SRVJqQlhiRFZaY1dkdE9XYxAB",
            "text": "Delicious food and great service! The focaccia was to die for."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRWQyVTVTRE0zYnpFMFpYWkxMVGRDYjJwaU1YYxAB",
            "text": "Stopped in while working, met Josh the owner, very nice and accommodating - took out on my lunch break. Grabbed a mortadella sandwich, no exaggeration one of the best I’ve ever had, simply delicious. There’s a nice atmosphere and a cool outdoor spot to sit, will def be back another night and you should def check it out too!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210TVRFeEJYelJuUWxOdlNtMVNiR1JDU2poamFGRRAB",
            "text": "I’ve been here 3 times over the summer and this restaurant is so underrated! The bucatini and crab pastas are so so flavourful, and the focaccia was also really good. The food was so good we ended up coming back the next day! The only thing that needs improvement were the desserts. The tiramisu was very sweet, almost medicinal, and I couldn’t taste the coffee. The basque cheesecake was very dry, and was not creamy and light. And I think a raspberry sauce would go better with it instead of just fresh berries. Their mocha was very good, I would get that as dessert! Overall, this restaurant has amazing pastas!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SVVNFWm1hRVZoTWtVeFEyZDJaRlZMVFVaNWRYYxAB",
            "text": "Absolutely incredible spot. The focaccia bread was outstanding — honestly better than anything I’ve had in Italy. We ordered the focaccia with avocado and the pancake with apple butter. The pancake takes 15–20 minutes, but it’s 100% worth the wait. We ate the focaccia first while waiting, and both dishes were so generous in size that we couldn’t even finish them between the two of us.\n\nThe staff was super friendly and welcoming, and even the iced coffee was top-notch. Everything felt thoughtful, fresh, and delicious. Can’t recommend Fossetta enough — I’d come back in a heartbeat."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0U01WbHJlV3d4Um1KVmVYSkplbmxpVldsaFZrRRAB",
            "text": "This place is divine. I literally have fever dreams about the foccacia bread alone."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZMVVtODNkMlpZVEVGVk0wODJWazFDU0hjeWQyYxAB",
            "text": "Fuimos de brunch un domingo lluvioso y nos encantó todo. Desde el ambiente tranquilo y la decoración hasta el baño.\nLa comida,deliciosa. En especial las pancakes que son más bien como un Soufflé crocantito por fuera y super esponjoso por dentro. La focaccia con salmón y queso crema también se llevó aplausos. Rico café americano y jugo de naranja. Una alternativa muy válida, sobre todo si pensabas comer en Katz's y la fila te desalentó (queda a una cuadra)."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPblU2TU9GdjREenRnRRAB",
            "text": "We came here for brunch and had an amazing time! The food was delicious (we had the mezze platter and all got the pancakes which were SO good). The service was fantastic and all of the employees were super friendly and kind and the vibes are RIGHT! Highly highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMU5qQjJMVlZRU2w5T2NHZHNSMngxTlhaR2JuYxAB",
            "text": "- very welcoming mediterranean spot in les. not super busy and good for conversation. lovely high ceilings, plants, good service and very flavorful food. we got the focaccia, and dips and it was fantastic for a week night dinner catchup. i would go with a big group and you’ll get. a walk-in easily and be super happy with your meal."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRMkt6QVVREAE",
            "text": "Great, great, great, specially all the baked in house breads and focaccia’s !\nThe pancakes are delicious"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VONkZ2ZldFbmNLRU9REAE",
            "text": "Very pleasant atmosphere and wonderful service. All of the dishes were wonderful and I loved the focaccia"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMLWlucW5NbHJiZUZBEAE",
            "text": "A really great vibe. I recommend the Hibiscus Iced tea!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKQ3BsckNsdHMyU01REAE",
            "text": "This place is very underrated it’s a little gem they have a great happy hour great service and food all for very fair prices not over inflated like some other restaurants a good wine selection and nice atmosphere."
        },
        {
            "date": "5달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYXl6YkNuZzVlYmtBRRAB",
            "text": "지나가다 우연히 들렸는데 음식, 술, 접객 모든 리스트가 최고임 진짜 소호 쪽 오면 무조건 들려야함\n그리고 야외 테라스 한시부터 볕이 드는데 그 때 화이트 와인 한진 하면 걍 죽음"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMXBuYlJBEAE",
            "text": "Came here for brunch with my friend who’s visiting and we were obsessed. We told our server our  situation and Paulina made us feel so special, so attentive without overdoing so and her recommendations were super! The honey focaccia with the polenta omg I never had such delicious focaccia and I love Italian food. Prices are up to standard with the are and wash rooms were clean! We came with no reservation and wait time was not bad at all. Good team and good food my favorite thing at a restaurant will be back so soon for that focaccia!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNXFmZHlnRRAB",
            "text": "The vibe was very cool. The waitresses were nice but the service was not good.\nAnd the food is not very good. It was greasy. Lots of oil! I couldn’t eat it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd3RqX01REAE",
            "text": "Delicious food, beautiful ambiance, and kind service. The ricotta honey focaccia, mushrooms, and mortadella were truly to die for. Top 5 sandwiches in my life"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvLWV2TUNBEAE",
            "text": "Lovely pasta and ambiance!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvb1l6SEpBEAE",
            "text": "Had a great time! The foccacia was delicious, the fava bean dip was a standout and a great wine selection. Staff was especially friendly and accommodating. My server had red hair and was so nice!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN3Q3X29RRRAB",
            "text": "The best happy hour spot!\nI really enjoy their cocktails, and the bread is great for sharing with a small group.\nWhen the weather is good, they open up the windows to the street!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcnJDOWd3RRAB",
            "text": "Ambiance: They have a really cute intimate set up. I love the big window doors that open when it’s nice out. Feels very much like an Italian restaurant.\n\nFood: Food was okay. They didn’t have too many vegetarian options and what they had felt a bit basic. The bread was delicious but the pasta felt under seasoned and average at best.\n\nService: Everyone there was really nice and tried their best to help us find items we could eat.\n\nPrice: I think the food was pricey based on what you’re getting. Portion sizes were good but the taste just wasn’t worth the price.\n\nInsta: @TheShahLALand"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNva3R6Zm53RRAB",
            "text": "Lovely wine, wonderful service, and although all we ate was focaccia, it was so good we felt very sad to have reservations for dinner already. Also: absolutely banger playlist."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvLU5LMWV3EAE",
            "text": "I would really give this place 3.5 stars if half stars were an option. I came here for dinner recently and I thought it was overall fine, but not as amazing as I was expecting based on the reviews I had read when researching a place to dine during my trip.\n\nThe ricotta & hot honey focaccia stole the show! It was very tasty and sized well. The arugula salad was a bit tart - could’ve used a little more dressing and maybe something sweet, even a slightly sweeter dressing to cut all the acidity. My husband got the pork chop which he enjoyed, while I got the raviolo. I asked the waitress which one of two pasta dishes she recommended, but I make the mistake of telling her I was leaning more towards the ravioli & she said to just get that. I wish she had clarified it was just one large ravioli (which I understand is what raviolo is, but didn’t realize that’s what it said at the time) and maybe explained the flavor profiles of each dish a bit more. I didn’t really enjoy the dish, didn’t finish it, and wish I had gotten the pesto instead. I was considering telling her I didn’t really like my dish (it was also cold, like it had been sitting out) but she never came by to ask how everything was (but she did for the table next to us). My husband said his dish was warm so I didn’t feel like complaining that mine wasn’t.\n\nThe ambiance was nice and the staff wasn’t friendly enough, especially the hostess, but I would come here more for drinks and appetizers than dinner."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMnRETDVRRRAB",
            "text": "Ended up at the bar alone at Fossetta this weekend, solid choice. Bartender actually listened when I mentioned wanting something close to a cab and recommended a red that hit the spot perfectly. Food was excellent too, well executed without being pretentious. Comfortable solo dining vibe with attentive service that wasn't hovering. Prices were NYC standard but the quality justified it. Would definitely return."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROeDdhTGxnRRAB",
            "text": "Great new addition to the neighborhood! The food seems to be generally super high quality and delicious, and the people and vibes are great! I came early on a weekday, ordered off the brunch menu, and even got some work done (they’ve got wifi)- a solid place to remote work a little bit during the day!\n\nEdit: came back for brunch, the pancake is honestly one of the best pancakes I’ve had in my life!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OUo3UW9nRRAB",
            "text": "Lovely atmosphere, great music, and very kind staff especially as it was 8:30 on a Sunday evening 😁"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eE9UNnRBRRAB",
            "text": "Highly recommend, really great service, staff is on it!  We went with a big group at the last minute. Accommodating and friendly.  Food was amazing! Our group did brunch and everyone was wowed by the deliciousness!  Was a lovely time together! Good times!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cUt2a3p3RRAB",
            "text": "It was relatively easy to get a reservation on a Saturday night. When our party came, we were greeted promptly and our table was ready as well.\nWe have ordered a few apps - octopus, mushrooms and focaccia with ricotta and homemade hot honey, and everything was to die for! Our entrees came out in a timely manner and were great as well.\nService was on another level! Sydney made great suggestions and made our experience memorable. She was super nice, friendly and knowledgeable.\nAtmosphere was nice and pleasant.\nOverall 10/10. Highly recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aU9XWnZBRRAB",
            "text": "Fantastic service, food and wine pairings.  Lovely ambiance. This is one of the best restaurants in NYC."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRN3Fha25BRRAB",
            "text": "A vegetarian dinner for two involves constructing a meal from appetizers, which works fine."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaXZ2czBRRRAB",
            "text": "My girlfriend and I have been here twice, both times wonderful. Manager is super nice, our waiter was great with the wine and food suggestions and everything on the menu is so good!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNzlTZ3RBRRAB",
            "text": "We had a delicious lunch here after just wandering in. The open air seating was perfect on a nice day. The bread was amazing- I highly recommend the focaccia with ricotta and hot honey!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBbmRHVU1BEAE",
            "text": "great spot for Italian food. service was quick and amazing. absolutely love everything I had. I highly recommend getting the pancake if you come for brunch. It’s super fluffy and so good with the maple syrup. for the pasta, the chicken liver was interesting and added lots of flavor to the sauce."
        },
        {
            "date": "8달 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBa3NtVm9RRRAB",
            "text": "@lydieats💕 Come get loaded foccacias 🙂‍↕️ They’re fluffy with a light crunch and the topping!! Hot honey so yum 🙆‍♀️ The other items are pretty good too but not as exciting. Vibes are good too, it’s a natural wine bar that’s both spacious and easy to reserve! Very hard to find now days.\n\n💕ricotta & hot honey focaccia $13*\n💕 tinned scallops in vieira sauce $18\n💕 bucatini all'amatriciana $25\n\n토핑 잔뜩 올려진 포카치아 먹으러 가는곳 😋 종류도 다양하고 무엇보다 빵 식감이 너무 좋다. 다른 디쉬들도 낫 배드. 뉴욕에서 자리도 넓고 예약도 쉬운 네추럴 와인바 흔치 않아요오."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBa1k3UUZ3EAE",
            "text": "Unique culinary experience! A group of us dined at Fossetta in NY recently and it was a unique take on Italian. The menu items are quite unique, with never-tried-before combinations to traditional takes on focaccia, buratta, etc. Our starters:  Smashed Pumpkin & Pecorino Focaccia, Ricotta & Honey Focaccia, Fava & Garlic dip and the Burrata with Roasted Peppers & Anchovy - they were delicious and so unique - loved the focaccia… did not like the anchovy & burrata combination though. However, very creative! My main, the Daurade on the plancha was crispy, flavourful and quite impressive. This is a dish using the white daurade fish cooked on a plancha, or metal plate, using high heat and a little smoke. Not sure how Italian this is. The broccolini added an Italian touch. If you’re looking for a unique culinary experience, I highly recommend Fossetta. The ambience added to the experience, low lighting, quiet and quaint. Great for date night."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMHZqalVBEAE",
            "text": "I loved the chicken liver pasta, absolutely amazing"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfajhqNUpREAE",
            "text": "One of the best brunch places in the lower east side! Their pancakes are some of the tastiest pancakes I ever had. The waiters in this restaurant are the best I have ever seen since moving to NYC."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfZzVDV2VnEAE",
            "text": "A really small and cute Italian restaurant!! My friend and I went there for lunch and we ordered mezze platter - labne, fava & garlic dip, marinated mushrooms, seeded focaccia and rigatoni & chicken livers - marsala cream, guanciale skin, sage. Super fluffy focaccia and flavorful pasta, especially with the chicken liver infused sauce! Atmosphere is also nice!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfemZENHRBRRAB",
            "text": "This place don’t deserve no 4.7 :/\n\nFood was good but not wow. The appetizers were the highlight. The chicken was a bit dry. Fish not very flavorful. Cheesecake way too dry.\n\nAlso half the menu is pork :/ like it’s in or sprinkled on everything and they can’t make changes"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbkpIVGZnEAE",
            "text": "The raviolo was delicious, the focaccia was light and tasty, and the antipasto was fresh and full of flavor! Great service as well!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2NFBtYUx3EAE",
            "text": "I've been to Fossetta a few times now, and every visit has been a delight. The standout dish is definitely the focaccia—my personal favorite being the hot honey and ricotta focaccia. Other highlights include the ravioli and their Caesar salad, both of which are exceptional. The white negroni is another must-try; it's absolutely delicious! Overall, I'm always pleased with my experience here and would highly recommend Fossetta to anyone looking for great food and a memorable dining experience."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2OTlMWUpnEAE",
            "text": "Found a write up on best pancakes in NYC from pancake princess. The description was too good to pass up as we have enjoyed Clinton Street bakery over the years. Made an easy reservation for brunch on Sunday. Ordered the cast iron pancake (takes a little time) and the grilled cheese w egg along w cortado and cappuccino. Drinks came out quickly. My wife described her cortado w oat milk ‘liquid gold’. My drink was excellent. When the pancakes came out I dove in. It was piping hot with an apple spread and butter on top and syrup on side. The outside was crispy, highlighting the cast iron prep. It was truly a treat. The grilled cheese came w the egg (over medium) served on top. The bread was amazing the cheese decadent. The egg was also perfect. There were a side of small pickles to help w digestion of cheese. Sandwich was not overly cheesy but more than cheesy enough. Can’t say enough good things about this place. Servers were great. All 3 front of house people were attentive, kind and personable. After 25+ years of searching the city for a place like this I am satisfied. Best NYC breakfast ever.\n\n(Side note - menu changes slightly so what is online might not be same as what is current. )"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2aE9uWjZnRRAB",
            "text": "Fossetta is a cute spot for brunch with some definite highs and a few lows. The strained yogurt was the standout—such a unique texture, and the combo of nuts, honeycomb sweetness, and fresh fruit was perfection. On the other hand, the side eggs with bacon, fried potatoes, and focaccia were all a bit too greasy, which made the meal feel heavy.\n\nThe staff seemed a little overwhelmed—they forgot one of my sides and my tea, but they were friendly when reminded. Overall, it’s a nice brunch spot, but a little more balance in the dishes and smoother service would make it even better."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEaTduUFJREAE",
            "text": "I appreciate the inventiveness of the menu, especially with their chicken liver pasta which doesn’t have a strong iron taste like other livers but still adds a unique flavor dimension! Pancakes are hefty and are almost like a fluffier cake, but they go well with the marmalade. Focaccia is understandably a must do - I enjoyed it with ricotta and honey! They have a 3.99% discount if you pay by cash here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkcDg2QlF3EAE",
            "text": "Great news venue for fusion Mediterranean and Italian. Loved the focaccia variants, especially the hot honey.\n\nPumpkin was a bit lifeless but the other dishes were fantastic. Tiramisu had bit too much liquor. Pig ears unique but not amazing. I definitely do think the highlights are the focaccia and the lasagna\n\nStaff were friendly"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5LUlmdThRRRAB",
            "text": "Super charming newer spot in the heart of the LES on Allen from the Café Colette team with with awesome focaccia options, a plethora of antipasti sharing plates, pasta and mains. Natural wine selection too! Don't miss their chicken liver pasta, crispy pig ears (such a difficult dish to find!), roasted pumpkin and focaccia with garlic cream and fontina. A total gem!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiOHBfdFpnEAE",
            "text": "Low key the best restaurant ever. I’m hesitant to even post this review because I’ve managed to walk in and snag last minute Saturday night reservations here, and, if people knew how good it was, I’d never be able to eat here again. Focaccia - served warmed with incredible flavors. Small plates - tasty and thoughtful Mediterranean fusion-y vibes (highly recommend asparagus fritto). Pasta (we got the rigatoni and chicken liver) - rivals Lilia, Via Carota, Carbone, whatever other pasta place you’re thinking of. Desserts - unsurprisingly perfect since there are no misses at any other point in the meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOOVBLRzBnRRAB",
            "text": "But I loved about this restaurant is its location because it's right next to the F train. It's also quiet which is unusual in New York City.\n\nWe had a very nice meal. The service was extremely gracious. We were first struck by these incredible loaves of focaccia that are sitting on the counter. 😋\n\nWe started with the fava Bean puree and the focaccia. We had the pate which is custom made for them. It was interesting because it was not as fatty as pate can be. I did find the focaccia toast to be a little too hard.\nThey served roasted honey nut squash with middle of herb butter and pomegranate arils that was very tasty.\n\nWe had the crispy cauliflower and red onion rings perfectly fried with romesco.\n\nThere was also a very bright salad of arugula and finally shaved fennel with a citrusy dressing.\n\nThe lasagna is very rich.\n\nI had the bucatini amatriciana which was delicious but had these salt pockets in it. Like the sauce wasn't salty but then there were these bursts of oversaltiness."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsN2VfTFFBEAE",
            "text": "Amazing brunch in a casual atmosphere. They were playing Lou Reed while we ate, which was a perfect compliment to the food, given the neighborhood! Loved the strata, polenta and shakshuka, all finished off with freshly baked focaccia.  I could eat this every day."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3ejVMUWhnRRAB",
            "text": "@fossettanyc has a pretty and spacious dining environment, and their plating is beautiful as well. I would say it’s much more American to me than “Italian”, at least for the brunch menu. We had a good time but they might be a bit understaffed as the waiters were making mistakes here and there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsNDVuZWh3RRAB",
            "text": "Fossetta is a beautiful space! The staff was attentive, service was prompt, and food was delicious. Highlights are focaccia, pig ears, eggplant, baby octopus, bucatini and lasagna. We have been back twice and can’t wait to try their new brunch menu!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsa2NqUXpnRRAB",
            "text": "We really enjoyed our dinner at Fossetta last night! The food was excellent, drinks are delicious, staff were attentive, the atmosphere is spot on, playlist was on pointe, and the overall experience was just perfect! My favorites will be the fig cobbler cocktail, fried pig ears and the rigatoni. I’ll definitely come back and bring more friends here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIa1p6TzJBRRAB",
            "text": "This is a really fun & upbeat spot!\n\nHighly recommend the hot honey & ricotta focaccia. If you order that, I would not suggest ordering the starter dips because they will suggest focaccia with it.  Wine BTG list was great. Service was really friendly and attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5cUlPSkRBEAE",
            "text": "Such a satisfying weekday brunch experience. We came for the pancake (which was one of the best I've had in NYC) but was pleasantly surprised by their deliciously crunchy home fries and super satisfying \"grilled cheese\".  The intimate vibe and attentive customer service created the total package experience and ensured a second visit from us without a doubt. Well-done Fossetta!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkLUo3aFZREAE",
            "text": "Open till tonight, left the club early to come here.\n\nThe chicken pate pasta was one of the best pastas I've ever had.\n\nRicotta hot honey on faccocia was good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqanU3bkFREAE",
            "text": "Feels like you are in Europe! Super cute atmosphere, friendly staff, and excellent food. I got the hot honey ricotta, lasagna, and tiramisu. All were great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bGZQd0VREAE",
            "text": "All around wonderful experience. Friendly staff. Delicious food and really cute vibe. I would recommend going early or making a reservation. But whenever you go, please get the pancake and avocado toast. You’re welcome."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3NUpya3RBRRAB",
            "text": "I went for lunch and thoroughly enjoyed my experience. The space offers a ton of natural light and open air concept when the garage doors are open on a nice day. The Focacci is out of this world - probably the best I've ever had! They offer a great selection of both NA and alcoholic beverages. I can't wait to go back for dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIeTVyUS1BRRAB",
            "text": "Very nice atmosphere and service, but the quality of the food wasn't as good as we expected. The Caesar salad was okay, if not a little underdressed (more parmesan + dressing would be nice), and the lasagna wasn't memorable (ground beef seemed very basic and the flavor profile lacked cheesy notes you'd expect from a good lasagna). The focaccia bread was solid though to me it felt a little underbaked compared to some other focaccias I've preferred. In summary, nice vibe and people but the food is middle of the road."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROb29Ec2R3EAE",
            "text": "Wonderful brunch spot with friendly and welcoming atmosphere. Loved the smashed avocado toast, polenta, and fossetta pancakes ! The latte here is pricey tbh but it’s worth trying. The service is excellent and overall vibe is very relaxing :)"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5OS1TV1R3EAE",
            "text": "Had a craving for a bowl of pasta and went with their Amatriciana dish. Each bite was just as delicious as the last. I had read someone else’s review that they found it salty, but I did not have the same experience and I’m usually sensitive to salty dishes. I do wish there was a stronger chili taste to it. I really couldn’t taste any. If in the area, I’d come here again and try the focaccia too.\n\nCozy, dim light - perf for date night or a group dinner where you actually want to talk without speaking too loudly so you can hear each other. I vaguely remember they offered a discount incentive if you paid with cash."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINk5hNDlnRRAB",
            "text": "🚨STOP HERE\nCame here for the pancakes, but discovered that the hidden gem is the Focaccia. We ordered the Ricotta & honey and couldn’t be better. Soft and delicious, is a must if you are a “bread person”"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsamJLQkdnEAE",
            "text": "Thoroughly enjoyed my experience at Fossetta! The food was so creative and delicious. We got the seeded focaccia which was incredible, with the smashed eggplant, the roasted pumpkin, and fried pig ear.\nThe rigatoni & chicken livers was also fantastic. Will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGeDdXNW1RRRAB",
            "text": "This place already feels like a neighborhood staple. Immediately felt at-home here. Food was delicious - they know what they're doing. We tried the eggplant, pumpkin, riccota & honey focaccia, and the trompete & chicories. Really nice natural wine selection with some unique offerings."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxczYtRVZREAE",
            "text": "My friend and I loved our time at Fossetta. The restaurant has a really warm and intimate atmosphere which would be perfect for a quiet dinner or a date night. The service was great and the food was also amazing. My favorite apps were the marinated octopus and mushrooms. The focaccia and pig ears were really tasty as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NzlDa0VBEAE",
            "text": "We visited for Sunday brunch/lunch. It's a small space with an 'outdoors meets the indoors' style, reminiscent of a European summer.\nWe started with a foccacia for the table with ricotta and honey and it was delicious. We also had a pancake to share which is very thick and fluffy like a cake, served with a generous dollop of Nutella and butter.\nEveryone enjoyed the shared food and their dishes. Definitely don't miss out on a foccacia when you go."
        }
    ],
    "reviews_count": 73
}