{
    "name": "Dhamaka",
    "place_id": "ChIJJyPbJe1ZwokRu8dDEOqAYDc",
    "grid": "MN3",
    "address": "119 Delancey St, New York, NY 10002, USA",
    "rating": 4.5,
    "user_ratings_total": 3444,
    "phone_number": null,
    "reviews": [
        {
            "date": "수정일: 5시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5T05YVjNSRFZHTkVsTVFtMW1OV05GYzBscVYxRRAB",
            "text": "Service was good\n\nIn regards to the food the waiter recommended the showstopper meal was the nalli biryani. It was not a show stopper this restaurant is hyped up. It should be removed from the Michelin star"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsNlRWcG5VbWx3YWw5T1EwMUliMDkwWkU5SWFYYxAB",
            "text": "An exceptional meal. Came here after watching Chef Chintan prepare Champaran mutton dish. Ordered the same. The cocktails were amazing especially the Avocado based cocktail. Baingan Bharta is a must try. Will definitely recommend."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRGRIQk1Ualp5VFZSaWIwMVdNeTFLVlhGTlNXYxAB",
            "text": "Food was good and spicy as expected , chicken was too spicy for me to handle but their Kashmiri was the best lamp I’ve ever had"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGRk9GRm1UMUJJWDJscmEwcDVWa2cxTjI5clJFRRAB",
            "text": "I am so happy to try the food here in Dhamaka. The food was delicious and very flavorful. I love the spicy level they put in all the food. The service was excellent and the staff were very friendly and sweet. I would definitely come back"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xweVpubHhVbmhWVjNKbFlubFVhREZLVDNCRGVsRRAB",
            "text": "Dhamaka’s food felt like Diwali’s firework which didn’t explode after flight and the dhamaka didn’t happen. Ordered methi paneer and parontha, paneer was the softest paneer ever had in US, parontha tasted like it was frozen and reheated up and raita tasted as store bought, rather than that homemade curd tangy flavor you crave with Indian food. As an Indian it is not anything extraordinary that you haven’t tasted before. The batameez dil drink was refreshing however after a long day. Overall I waking give it a 3.5 star rating compared to other places I’ve had in India and outside. The service is really good and does deserve 5 stars for that. We looked forward to this dinner all day and it just didn’t hit the spot as anticipated."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rd2QwTTVYMDlZV1RaZmJtaFZRbEJZTVZJNFoxRRAB",
            "text": "Small and cozy place with amazing mouth watering food. Reservation is recommended, but worth doing it."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xZk9UVkpkMHRwWkdrM01FUlpTMlJUT1hKeFVsRRAB",
            "text": "Seated 20+ minutes late which was kind of annoying because we had Halloween plans but bad service aside the food was so mid. We got the palak, rainbow trout, and Nalli biryani and each item was terrible. The palak was bland, the trout was just fish smothered in a mint chutney, but the most disappointing item was the $75 Nalli biryani. The rice was mushy, the shank was tough and it had no flavor. Felt like eating boiled rice. This place is a shell of what it used to be."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psb1VtVnNjbmR4VEdodVdUVlZWMk4wWDIwM2IyYxAB",
            "text": "Not your typical Indian food. Dishes are unique and packed with flavor. Many vegetarian options. The paneer was homemade. Will definitely be coming back"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WWFWSmtWV2xUTkVsTU5HMXNUMGRLWlZCaVQwRRAB",
            "text": "I liked Panner tikka, lasooni palak was let down for me. The texture and taste of paratha and chapati are different from the conventional Indian restaurant."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwTFpXSnVZVFJNTUVzNFdXZGFXSGhoTnpoUVozYxAB",
            "text": "Definitely the best Indian restaurant we have dined at."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOUmJXOTZaSEZoT0ZwVFRsYzNWWGMzWkRGaFYwRRAB",
            "text": "Had a great meal for my birthday.  Lamb biryani was extremely flavorful. Intense umami flavor.  Spinach and eggplant were great also. Will definitely come back. Service was awesome.  Beef pepper fry was spicy.  That was ok."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jdGJYSXlTSGR6TjAxek1FNTZSbTlpVDFRMlFuYxAB",
            "text": "Below average tasting food. Service was okay. We didn't get table on time even though we had a reservation. Atmosphere was awful. Too dark and gloomy. Couldn’t even read the menu. With this price point, it was a rip off."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wUVFraEJOV0pXZW5OU1ZEaEdYMVZ4YTI1MmVHYxAB",
            "text": "Best indian food I've ever had, perfectly cooked and spiced"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paQ1NGSk5iVVIxYlV0T01rUlJUbXBrTjA5aldtYxAB",
            "text": "Katherine, Andrés - thank you so much for the amazing experience we’ve had tonight! We loved each single meal and we are so grateful for your help and kindness. The food was so delicious and we will definitely come back and recommend it to all our loved ones!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWGVHNVFhbEJ6TUZwR2RFZFpaVFE1TjNGaU1IYxAB",
            "text": "Was everything I was hoping for - quirky desi atmosphere, crazy explosion of spices, additional chutney, onions and chillies, heavily buttered chapaties, and the offerings of cocktails is sure to impress. Heart and tummy both are full, can't wait to be back.\n\nP.S: Gauri was the most amazing server, an extra star just for her!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjd2J6VjBWWGQ0T0UxdlNqWjZXbWh0YURCVFZtYxAB",
            "text": "Absolutely the best Indian food in the city. Expensive and almost fusion but insanely good."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCbVpVdDBTRWRqT1dOMlVUWm9lR05UY1hScmQzYxAB",
            "text": "Good Indian food with great service."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIM2ZxTHpBRRAB",
            "text": "Haven’t had such delicious Afgani chicken and Bhopali chicken even in India, we literally licked our fingers with every bite. The dal in bhopali chicken flew my wife back to her childhood memory of dal that her naani used to make. We loved the rotis and raabri desert as well. Everything was full of distinct flavours. I will recommend reading the menu online before going."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKaGFVcGlSblU0U0RRMllrWldXSGxsUWs1a1dGRRAB",
            "text": "We didn’t reserve a table and went assuming we will get a table but it was fully reserved. We thought of almost leaving but the hostess asked us to try the bar seating and as she could see I was pregnant, she assured us she will try to give the table as soon as it is possible. And just within 5 mins we were seated and I think that’s the best feeling when you go out to a restaurant and if the staff is friendly. Now let’s talk about the food, it was delicious. Everything we tried was fresh, flavorful and delicious. We really liked the Chana Chhena tikki, paneer methi and lassi.Vibe even on weekday was lively and it is definitely a place I would come back next time. But I would reserve a table next time and come to enjoy drinks."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xORU4zcGlXVlpNV0dVMmRGTnVVeTFwZFhOdk9GRRAB",
            "text": "Service was great, ambiance was nice inside but food was awful. Food had some potential but everything had overwhelming amount of butter, cheese and ghee. Rice and crab were both undercooked. Green fish had very little fish and was mostly just green chutney."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ka1YyMTZMV05NYTBGVlRVTnBjazQzTVZkcE4yYxAB",
            "text": "The Paneer Tikka was soft and fresh, while the Methi Malai and Murgh Malai were rich and flavorful. The standout dish was the Dhaba Daal—simply exceptional. Rabadi was excellent as well. The only minor drawback was the Paratha, which was slightly uneven in texture. Despite a limited menu, the food quality is outstanding—easily among the best Indian cuisine in the area. Highly recommend and will definitely return."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSaVZsOUNOWE5YWldSeWJYaG1kMGQ0YUVNMlVtYxAB",
            "text": "Dhamaka is amazing! The food is bold, flavorful, and full of spice. The vibe is fun and lively, and the staff are super friendly. It’s the perfect spot if you want great Indian food with lots of energy and flavor."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWlNsTjVhbXhVYjAxeWJHaDRia055T1VKV2RIYxAB",
            "text": "Delicious food with authentic flavors and just the right spice. Great service and a welcoming atmosphere — one of the best Indian restaurants around!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdlYzVlRWbU51VW0xcVowOWxRVEJEYUdGMFpIYxAB",
            "text": "The experience didn’t quite meet the expectations I had from Google and Resy. The food was decent—baigan bharta was good, though the portion sizes for both the paneer tikka and baigan bharta felt small. Compared to Bungalow, I’d still recommend Bungalow over this place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZNFJFeEZibkowZVRSZk1FaEVRMHhUVVVsbk4xRRAB",
            "text": "Stop in about 6:30. We're told we had to be out by 8:00. That should not be a problem. We had the lamb shank with basmati rice. It's a wonderful dish, and we'll feed us a couple more times when we get home! The menu is exciting and varied with unusual dishes, which seems to be their whole mantra. And they've succeeded wonderfully"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVU5reEhTblZ5YjNWUlEyTnNVMVpUY1dSM1VYYxAB",
            "text": "The food was amazing and our server Vikas was very knowledgeable about all the dishes and gave us amazing recommendations!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKRVJHUktZVzk0TURSa1NYQlBiVGc0WjJJMVMyYxAB",
            "text": "Went here for my birthday dinner and it didn’t disappoint! Vikas was an amazing server, he was so attentive and even brought out a little birthday dessert for us. The lamb biryani is unreal, and the grilled eggplant is to die for as well. We’ll be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsZk9HeFJkMEY2YkZsVlpuTndiazkwZGt0bGVtYxAB",
            "text": "Had an excellent brunch at Dhamaka NYC. The Malai Murgh stood out—perfectly cooked, creamy, and full of flavor. Definitely coming back for more! Our server, Vikas, really enhanced the experience with his thoughtful suggestions and attentive service. A memorable meal all around."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUlFYbG5UalpMZEVnd2EyUkxSRk5TWjJwdFUzYxAB",
            "text": "Amazing experience at Dhamaka NYC! The food was bursting with authentic flavors, beautifully presented, and absolutely delicious. Special thanks to our server Vikas for his attentive and warm service. Highly recommend for anyone craving bold, unforgettable Indian cuisine!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KMFdUWjJablpFU0RCSFN6UlVNVXBXTTNkcWRIYxAB",
            "text": "Wow!\n\nDhamaka is a fresh take on traditional Indian dishes not usually found at most establishments of the same cuisine. We were pleased to enjoy flavors, spices, and aromas that were both unique and satiating!\n\nThe setting is relaxed with matching interior decor and a nice street view of Essex St. There's nothing very flashy and it doesn't pretend to be upscale in a superficial sense either. The focus is entirely on amazing quality of ingredients and preparation. We recommend this place for a casual night out and for couples or groups with enough appetite. The dishes are definitely best shared amongst good company!\n\nAll the waiters/hospitality staff at Dhamaka we're exceptional. It felt like I was at a restaurant that could approach Michelin star status.\n\nWe had the pleasure to be served by Vikas. He was an excellent waiter with close attention to detail. Besides taking good care of us at each moment, we were also able to engage in great conversations. The experience was definitely warmer and friendlier because of his open personality and great recommendations.\n\nUntil the next time!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kVWNVTTFUa1Y1VFdsdE5rbENTM2x0VkVRMk1sRRAB",
            "text": "Dhamaka absolutely delivers on flavor. The Lamb Biryani was hands down the best I’ve ever had – rich, fragrant, and unforgettable. It sets the bar so high that I honestly can’t imagine it being topped anywhere else. The only drawback is the street seating, which isn’t the most comfortable setting, but the food more than makes up for it. Definitely worth a return visit."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsbGFGTllPVEpPU0MxdE9HYzNOWFZJV0dGcE5YYxAB",
            "text": "Well done."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xreWN6Tk9TRXhVV0RsUGFHRlFWMUYxY21wWVJVRRAB",
            "text": "Had the most incredible dining experience at Dhamaka NYC! From the very first bite, every dish was bursting with bold, authentic, and unforgettable flavors. The creativity and execution were truly outstanding. Kudos to the chef and the entire team for bringing such vibrant Indian cuisine to life in the heart of NYC. The service was warm, attentive, and made the whole experience even better. A must-visit for anyone who wants to experience Indian food at its finest!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TFVETkZXVkZmZDBJd1ZIbFVSWFUxVkVoMFkyYxAB",
            "text": "All of the food we tried was amazing; some of the best Indian food I've ever had. I need to come back to try more dishes. Seriously, it really is that good. And Indian whiskey was the perfect way to end this amazing meal."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKNnJlcnp3RRAB",
            "text": "Much improved since last time I went"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toQmJ6RTViMkpKVm5CNVNXUmtZMDFSUjJVeVNWRRAB",
            "text": "Definitely recommend this place for the flavors and Indian spice level. Malai Lassi, Chana Chhena Tikki, and Paneer are a must try items. Malai was fresh and Malai Lassi was a great start to the meal. Paneer is very soft and fresh but the gravy was missing salt. We also tried Dhaba Dal which was good as well. Phillip was our server and was very generous and courteous. Overall good food, great service, and atmosphere."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBeFdEVkxPRzR4YUVwNk1sRnFRVmhtWVRVeWJtYxAB",
            "text": "The food is mid at best, at least, the vegetarian dishes. Really overpriced, and neither the ambience nor the food justify the prices.\nAt these prices, I would have atleast expected some good basmati jeera rice, but the rice they give is much cheaper and \"lower quality\" than basmati but they charge it as some special delicacy rice lol. I'm from north India and grew up eating chapatis and paranthas of every shape and size -- there is no parantha THAT thin. Chapatis were a joke, or maybe Dhamaka has come up with a new dish, which should be called \"baby tacos chapatis\". Stop looting people under the pretext of \"real forgotten India\". Probably their meat dishes are better, only that would justify these prices and reviews.\nMinor gripe: What even are the \"forgotten flavors of India\"?? Forgotten for whom? The owners, I presume.\nUgh, what a waste."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NMGJYaEZaRVkwUjFkS1dEQXlXR3hIVkY5alUwRRAB",
            "text": "One of the best Indian restaurants in town. The best methi paneer in the world."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTVIyczBZbXRKY0ROVU5XOW1hMUJCZGpCblNGRRAB",
            "text": "Worst customers service and the food is quite average. The ambience is not good. Everything was under average . Don’t recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4d2R6VjVjbFp1WWxwc05TMTNNV1psTXpCQ2IwRRAB",
            "text": "One of the best dining experiences I've had in NYC! Every dish was powerful, nostalgic, and truly delicious. The drinks were unique and I absolutely loved the Avocado Avatar. Our server Katherine gave us the perfect recommendations, and made our dinner a special one to remember!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RNVVtbGxPRTUxZFZNMVJsUjZjemhVTVhsdVgyYxAB",
            "text": "I enjoyed the service and the atmosphere a lot. Coming to food - we got the Bohri chicken cutlet and Macchi hara masala which were both good. The Nalli biryani is definitely something to try if you can afford that - it easily feeds up to 4 people that have had some appetizers. The flavour was too good and the meat was very well cooked.\n\nP.S. I do not see any comparable options for vegetarian or vegan dishes so maybe not a good option if you have dietary restrictions.\n\nTL,DR: A definite one-time visit for the Nalli Biryani (It is worth the $75)!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vMFNrbFJlbmRNT1ZZemExQXdOR294T1hOdWVuYxAB",
            "text": "We have been to dinner after hearing about Dhamaka from many sources. I absolutely loved the malai lassi, it absolutely stood out. We skipped the appetizer and ordered Nalli Biryani and Champaran meat. The Nalli biryani is great, absolutely flavorful. The portion size is huge and we took a togo. The Chamaparan is good. The meat is very soft and we had it with Chapathis. I don’t think it stood out. I find the restaurant a bit expensive for what we had."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVlREYzJPWFJuTlc1RVkzb3diR0oxZGsxMlNWRRAB",
            "text": "Great Indian food in New York and amazing service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKamJ6aEhkemhQUlRGT2QxVlNTbTk0T1ZKbFMwRRAB",
            "text": "massive portions. the lamb in the Nalli Biriyani and Paneer Methi were so soft and delicious. enjoyed trying the Butter Pepper Garlic Crab as well\n\nkulfi was fine"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21reVZqbDJTVlJaVEZScWJHRlhVRzVqVDB0cVUwRRAB",
            "text": "This is a good place to eat - but it's overrated. The service is friendly and warm, the atmosphere is decent. Music is bit too loud (personal preference) and can make conversations challenging. Staff is very friendly but it was odd when they started cleaning/wiping the table when we were still seated. Some of the items were good, solid choices (lassi, paneer). Some of the dishes lacked flavor (chickpea patties, paneer methi). Only having one bathroom in total was also a negative.\nI'd honestly give Dhamaka 3/5 and would not go back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21welduZHNURkJtVUd4bFRGaGlUVVZZYVhwR2QzYxAB",
            "text": "We visited Dhamaka during our to visit to New York! It’s been on my list to try their food for so long. Got chance to experience the authenticity of their menu. Initially the server is not very polite and didn’t explain the menu clearly. We were disappointed with the service.\nWe tried butter garlic crab 🦀 , rara ghost , parathas, kulfi.\nEverything is good, we enjoyed.\nWill visit again to try nalli ghost biryani🙃"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOMWJreG9TVU5YWjJoT1NsZFpVRWRhYmtOdGFXYxAB",
            "text": "I have been to many Indian restaurants around the world, and this is easily one of the best and most unique. It truly lives up to the name: it's an explosion of flavor in your mouth. Eating here makes me feel like I am in someones house in India, being transported around from region to region. If I could somehow give this restaurant six stars, I would.\n\n*\nWord of warning: these dishes are all niche, regional dishes that would be best for foodies; dont come in expecting your standard chicken tikka masala with garlic naan.\n*\n\nAppetizers:\nThe paneer tikka and bohri chicken cutlet were out of this world. The paneer was soft and had a fantastic texture. Perhaps the best paneer I have ever had in my life. The chicken cutlet had a spectacular balance of spice, and also had a great texture. They put Amul cheese in it, which is a nice touch. Before the appetizers came, I had lower expectations of the place because it looked just like many other casual Indian eateries. But after the first bite of appetizers, I was swept clean off my feet and I realized what kind of meal this would be.\n\nMain courses:\nWe had the baingan bharta, butter crab, and Champaran meat. Everything was fantastic, but the champaran meat really stole the show. It was spicy, flavorful, gamy, hot. The mutton practically fell off of the bone. We also ordered 4 parathas and 1 rice for the three of us. All were of exceptional quality.\n\nFor drinks, I ordered the Ghee Whiz (their take on an Old Fashioned). It was smoky, sweet, and strong; it has real ghee in it, and smells like a wood fireplace back home(very nostalgic smell for me). It paired incredibly well with the champaran meat. They also serve it in a really interesting way, which i took video of.\n\nDessert:\nWe had rabdi and kulfi. Both were absolutely amazing, especially if you like rabdi and haven't had a good one lately.\n\nOur server Catherine was super helpful and knowledgeable throughout our meal. Normally waiters dont give real recommendations, they just say \"oh everything is good here\", but Catherine asked us good questions before making her recommendations. For example, when we were trying to decide between the Rara Gosht and the Champaran, she told us that the Champaran will be spicier and gamier. We took this information and used it to make a better choice for our tastes, so she was super helpful. She told us that the servers here go through extensive training and quizzes, which does not surprise me given their knowledge.\n\nAfter dinner we asked for the chef, and he was super happy we enjoyed our meal. Young looking guy too; if he's this talented now, then I can't wait to see what else he will cook up in his career.\n\nI know that this review is probably quite lengthy, but for a restaurant this expensive you should know exactly what to expect. Fantastic, niche, regional Indian dishes. Strong, balanced flavors. Top-notch service. This was one of the best Indian restaurants I have ever been to, and it is certainly in my top 5. A must-visit for foodies, and for enthusiasts and connoisseurs of Indian food. If you don't have the palate for this kind of thing, you will be severely disappointed with the price and with the portion sizes. I suspect the bad reviews of this place are exactly that, so I will warn you again: if you want your standard, safe Indian cuisine, go eat chicken tikka masala somewhere else. This place ain't for you.\n\nAll said, it's a 10/10. A must experience for those who want a real taste of India."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWaFZqVmxibk5PZFdwc1FqbDZWVkJHZUVSVmFsRRAB",
            "text": "Vegetarian options are scarce, and non-vegetarian choices are even limited. Many diners were eating biryani, but unfortunately, no vegetarian version was available. The food’s quantity and quality don’t justify the price. For instance, the chapati was poorly made and excessively oily, while the entire meal was overcooked. I wouldn’t recommend this restaurant, as my experience was disappointing. Positive reviews led me here, but they were misleading."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aSVJGWjVhRTAwZVRkWFUxcE1TaTFWZURkQ1UyYxAB",
            "text": "Too much oil/ ghee in dishes that don’t traditionally need it as such. Disappointing and will not return."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTVJGTnpORGxSVHkxMFZ6QkNRVTVQTUhGMldYYxAB",
            "text": "This place is a total waste of time and money. The menu has practically nothing to offer—everyone ends up stuck with biryani, and to make it worse, they don’t even bother with a proper vegetarian option. Vegetarians, don’t even think about coming here—you’ll regret every second. The restaurant is ridiculously overhyped with what looks like fake reviews on Google. Trust me, it’s nowhere near what they claim. The food is bland, poorly made, and flat-out the worst Indian food in town. They even managed to serve me something overcooked and still had the nerve to charge double for a portion that wasn’t worth half the price.\n\nBottom line: overpriced, tasteless, and a scam wrapped up as a restaurant. Save your time, save your money, and don’t fall for this nonsense."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRWFWUk1TM0IzZWtkYVEzQnpZbTlvTTFOcFEwRRAB",
            "text": "One of the famous Indian restaurants here in NYC! The food to be honest was just okay and wouldn’t really recommend or come back here, maybe for the Paneer if they sell that\n\nFood : We got the Paneer tikka, Butter pepper garlic crab, Paneer Methi and Champaran meat. The Paneer tikka spice was decent but the Paneer itself was soo soft and yum, the best I’ve truly had. The Paneer methi was lack lustre and was just okay! My husband tried the crab which he loved and the champaran meat was one dimensional, just spicy.\n\nService : Nice and quick!\n\nAmbience : Nice but nothing outstanding!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OaFYzY3lhbGd0U0ZkTVZTMHlSRFo0WVhadFEwRRAB",
            "text": "The food here is great but if you don’t like spicy food make sure you ask for help selecting the right dishes. I love the presentation. Each dish has its own reveal. The decor is modern and contemporary but still reflecting Indian style. The service is impeccable."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WbVZuWnhjamw2Ym5wd1dVMVhUa1ZEVGxWU1lXYxAB",
            "text": "I had an amazing dining experience at Dhamaka! From the moment I arrived, the staff was incredibly welcoming and attentive. The vibrant atmosphere and cozy yet trendy vibe made it a perfect spot to enjoy authentic provincial Indian cuisine. The standout dishes for me were the spicy lamb curry, smoky tandoori chicken, and the flavorful biryani—each bursting with rich and unique flavors. The service was fast and efficient without feeling rushed. I also appreciated the variety of vegan and vegetarian options available. Whether you're coming for lunch or dinner, this place is a must-visit in New York. I will definitely be coming back and recommending Dhamaka to my friends. Five stars all the way!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSblF6aEJURWRpWW5CRVpYZDBVRU5zTVVGcVRFRRAB",
            "text": "The food at Dhamaka was absolutely amazing! Every dish we ordered was spot on! The highlight for me was the paneer tikka, which was incredibly soft, fresh, and truly the best I’ve had anywhere. We came here for a special occasion, and it couldn’t have been a better choice, everyone at the table loved the food. The flavors, presentation, and overall experience made it really memorable. A must visit restaurant!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdlJGZ3hZMnA2UVRoaFNXRmtTV2hhZG1GQ1drRRAB",
            "text": "We had an **amazing experience** at **Damaka Restaurant** celebrating my wife’s birthday! The food was delicious, and the **staff went above and beyond** to make our evening special.\n\n🍽 **Food:**\n- A **haven for non-vegetarians** with flavorful dishes.\n- **Limited options for vegetarians**, but what was available was tasty.\n- The **free onion and mint chutney** servings were a generous and delightful touch!\n\n🎉 **Service & Hospitality:**\n- The staff was **sweet, attentive, and caring**.\n- They surprised us with a **complimentary lava cake and a candle** for the birthday celebration—such a **thoughtful gesture!**\n\nOverall, **Damaka Restaurant** made my wife’s birthday dinner **truly special**. Highly recommended for meat lovers, and hopefully, they’ll expand their vegetarian menu soon!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbmJsVkxXVk5hYzJWdVlVdG9NazVKV2tKd2FVRRAB",
            "text": "We had a fantastic family dinner at Dhamaka NYC for my sister’s graduation. The menu offered unique, adventurous dishes made with top-quality ingredients, and every plate was both generous and delicious. Highly recommend for anyone craving bold flavors and something different!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CSlRsVjRWWFpHZDNSTWNXeDFiVVl3Y3pGME1YYxAB",
            "text": "Indian restaurant Top inside the Essex Street market serving up high end Indian culinary. We made a reservation and we’re set in like this corner restaurant inside the market staff was bustling about ensuring our water glasses were filled in. Our every need was taken care of the waiter made suggestionsand we decided on cocktails appetizers and mains after we were through. There was no room for dessert. I definitely would love to come back here to experience more of the exotic dishes as they were tasty and spicy like I like it.\nGo here!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjemRtZHhOVTF5V1ZwSVRGUXdiMWxQVEdoMFVFRRAB",
            "text": "Dhamaka’s menu has changed a lot over the years, but they have remained true to their philosophy of highlighting regional Indian cuisines and not apologizing for the spice level. And, they still make fresh paneer daily. If you’re ordering a la carte, you HAVE to order the paneer, which are softer and more cloud-like than tofu.\n\nI highly recommend the $45 weekend lunch menu. It taught us about Rajasthani cuisine, with some memorably delicious dishes such as the garlic chutney and the laal maas. The laal maas might be my new favorite goat dish. I’m salivating just thinking about it: lots of pungent garlic and complex, charred, smoky Mathania chilies compete with goat’s gamy aromas. The dal felt “restaurant-quality”, better than homemade versions. And the churma made me wish every bakery sprinkled it on their cardamom buns.\n\nEven when a dish is not to our preference, like the brick-dense bhatti and the overly rich gatte ki sabzi, we still had a lot of fun learning about India’s culinary traditions.\n\nCome here with an empty stomach as Dhamaka’s portions are massive. We had zero chance of finishing the food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrM09EZzBWRU41TFdKRWNHMHplVzB3WjBZdFZIYxAB",
            "text": "Had a spectacular meal at Dhamaka! Katherine made sure we had a wonderful time and had great recommendations. Will absolutely be back again soon. Favorite items were the crab, okra, and daal"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Nd2NWZDVhMHBEV0daNVZ6QkdjWE52WjI5MU1GRRAB",
            "text": "The food here is incredible, their paneer is an 11/10! Fresh, flavorful, and perfectly cooked. The service was quick and friendly which made the whole dining experience even better."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJNWRFUm1kVEExVVVNd2FtNVBZVEYxY0MwM09XYxAB",
            "text": "We were very excited to visit first time in Dhamaka and had high expetations because of the high ratings. Overall food was ok, but nothing very special and prices are too high! Paneer tikka (a starter dish) was our favorite in Dhamaka, it was so delicious - highly recommend it!\n\nAs a main course we ate Paneer Methi (vegetarian curry) and Malai Murgh (chicken curry). Paneer Methi had too much fenugreek/kasuri methi, which made curry too sour. Chicken curry was good. Malai Lassi and Badtameez Dil were both very good drinks! Chapatis were too small for the price, very disappointing and don't recommend it. Instead of chapati I recommend to take paratha, it's bigger.\n\nService was very friendly and quick! Food didn’t took long time to serve. Only prices are pretty high in this restaurant, overpriced.\n\nMeal sizes are too large (especially curries if you are going to eat it alone)! It would be nice to have an option to choose small or big meal.\n\nRestaurant atmosphere was ok, but tables are a bit too close to each others. Restaurant was fully booked when we visited. Table reservation in advance highly recommended!\n\nDhamaka is located inside Essex Market near to Chinatown. It’s easily accessible by public transport.\n\nUnfortunately we wouldn't come back, because Dhamaka feels overrated and overpriced restaurant. We have eaten better Indian food in other places."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pneFFXMDNTbk15WldkMFdrMU9YMmhpVkY5SFUxRRAB",
            "text": "We entered the restaurant well before our reservation due to change of plans, there was a super amazing girl on the reception who asked us to wait on the bar table and would try to arrange the things well before the time! The bartenders were so amiable and welcomed us with the best of their warmth!\nThe place is full of vibrancy and people carrying beautiful smiles and their hospitality is what One goes for visiting Indian restaurants!\nThey have the super amazing nimbu pani which gives you a feeling like a refreshing Mojito! Their paneer methi awestruck me as the balance of methi n super soft paneer melting in mouth gave a Punjabi rush to my genes along with the Punjabi songs they played!\nThe plain parantha was smooth like a butter had tinge of flakiness in it, that enhanced the taste more🙂\nIn the last Lassi was thick with  a chunk of jaggery and was super yummm ! I could say the place n food simply made this Saturday dinner worth remembering and visiting again👌🏻🙌🏻"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMelRvUG1IbHZMZkx3EAE",
            "text": "Wow! It’s a Dhamaka - an explosion of flavors and authentic taste. When you walk into Essex market you are like very colorful but is it that good? Let me tell you, you are in for a treat of a lifetime.\n\nWe arrived early and were seated only in time. And then we tried their drinks - Ghee infused old fashioned is the best and Avocado mix drink is outstanding!\n\nThe appetizers were amazing- Baingan bhartha with live charcoal gives you that back home delicious and earthy taste. The paratha is amazing too. The chick pea chenna cutlets and paneer tikka are to die for. The paneer is home made and the best we have had in North America!\n\nWe met Chef Vijay Bhardwaj, he was so warm and explained their philosophy of scratch kitchen. They make the paneer I house every day. All food is cooked and served in same vessels. So authentic\n\nThe main course of paneer methi and dahi bhindi is yummy. Both preparations are a first for us - superb with parantha. And the daal with the burnt garlic tadka - goodness!\n\nWe got the desserts of kulfi and rabri. The best rabri I have had.\n\nDon’t just book it. Run and go grab an open spot.\n\nThanks Vijay and team for unforgettable experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKLUt0cVc3d2FHcjFRRRAB",
            "text": "The restaurant boasts a delightful ambiance and a truly unique menu. We opted for all vegetarian dishes, and the experience was largely exceptional.\n\nThe appetizers were outstanding— paneer tikka, vegetable tikka, lasooni palak, and baingan bharta were highlights. The presentation was impeccable, with the live tadka (roasted garlic) in the palak and the coal-infused smoky flavor in the baingan bharta adding a spectacular touch.\n\nThe main courses, however, were mixed. The methi paneer was satisfactory, but the dahiwala bhindi fell short, with several pieces lacking tenderness.\n\nThe malai lassi was a standout—rich, refreshing, and highly recommended. Overall, a memorable dining experience with a few minor missteps."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wTVpsQmlibmMxVFVReE4xRjBhMWRGUmpGUVVGRRAB",
            "text": "We had an amazing dinner at Dhamaka with superb service. We had several different non alcoholic beverages and then had the beef pepper fry, the Paneer Methi, Dhaba Dal, Briyani (fantastic) and garden nimbu pani. We enjoyed everything we ordered, spice level was perfect for us. Our server was good at making suggestions and helping us order. Our bill for 4 people was $285 with the tip. If you are looking for a great Indian restaurant, I highly recommend trying Dhamaka. Reservations a must."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21keVdFTTVTRTFQTjFkaFh6a3pVVFE1WkhCaVgyYxAB",
            "text": "As someone who’s from India, this place didn’t quite hit the mark for me. The curries were too watery and the portions felt pretty small. While the flavors were definitely there—some dishes even packed too much punch, with a heavy hand on saffron or oil—it felt like the balance was off. I know it’s Kashmiri-inspired and they had a pre-fix menu, but the curries especially could be improved.\n\nThat said, the rice was delicious and full of flavor, and the bread was okay. What really stood out was the service—super friendly and attentive staff that made the experience better. Would love to see a few tweaks to the food to match the warmth of the service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScFJURmZhM2h2YzJoNVNuRTBVRTk1YkRoUk5rRRAB",
            "text": "Limited menu but such good food! Everything we tried was delicious-the hari machhi, the champaran mutton and the rabri! We also got free shots of lassi at the end. We were warmly hosted and really enjoyed the atmosphere. Must try Indian place at NYC"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJNVprdERYMmN3YTBOU1NtRnZXRTlaYzNSeGRuYxAB",
            "text": "Very friendly service, innovative drinks , however food was below average. It gave impression of amateur Indian cooking. We ordered Champaran Mutton and Nalli Biriyani. While it look amazing when they served, taste were not at per expectation. Champaran gravy was too much salty and meat quality also not great. There was a strong smell coming from meat.\nVery disappointing experience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaGY3MGRBEAE",
            "text": "Worth the hype if you want the weirdest cuts of meat turned into a flavor packed dish. I still think it’s a little overpriced but for the location I’m sure they have to charge up a bit to cover that rent.\n\nCertainly the weirdest Indian I’ve had in a while. I think I still prefer a good cut of lamb instead of goat neck lol but it’s quite the experience of weird flavors."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcXRfY3BBRRAB",
            "text": "The food was bold, flavorful, and truly unique — every dish truly felt like it had a story behind it. I had visited this place with my boyfriend while he came for a short trip from Chicago ans trust me this is a perfect spot fun dinner date . The ambiance is vibrant and energetic, with a modern take on traditional Indian aesthetics."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGM1JFTTRPRVY1TmtSd04ydHlNR056V0RZeGFWRRAB",
            "text": "The food was authentic & nostalgic. Chef had friendly and helpful suggestions, only wished that the table beside didn’t order so much alcohol which prompted me to get a bit too tipsy"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWa1drVm5XazV3V1d3elptWm1ZazB4YUhScVpVRRAB",
            "text": "I had an incredible experience at Dhamaka Restaurant, thanks to the amazing efforts of Chef Vijay and Srishti. From the moment I walked in, the warmth and hospitality made me feel at home. The food was absolutely outstanding – every dish was bursting with authentic flavors, beautifully presented, and crafted with such attention to detail.\n\nChef srishti culinary skills truly stand out – the balance of spices, freshness of ingredients, and creativity in every plate was remarkable. Srishti hospitality and care for guests elevated the entire dining experience, making it seamless and memorable.\n\nDhamaka is not just a restaurant; it’s an experience where tradition meets taste with perfection. I would highly recommend it to anyone looking to enjoy flavorful, authentic dishes paired with top-notch service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wTGFXczNWREZSU0V4eFRubDBTSFJTU2tsRGMxRRAB",
            "text": "The food was amazing. I was visiting NYC from LA and decided to eat here based on the good reviews and it was totally worth it. We had the Hariali Macchi and the Champaran Meat and both of them were amazing. Also, the rotis were great (they were like phulkas, very soft, which I have not found anywhere in the US). Overall, this place is very close to the authentic Indian flavors that you can expect outside India."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfNXBiMndRRRAB",
            "text": "Incredibly delicious meal. The quality and depth of flavors in everything left my whole group raving about each dish. The two forms of gosht, mutton, spinach dip, crab rice and biryani were all beyond excellent. Our sever was good too, helping guide us through the menu and was friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUeG9IMFZBEAE",
            "text": "I think @dhamakanyc definitely deserves more love! I can’t recall much but to be fair I did like the flavors a lot, but I just couldn’t taste anymore after a bite of each lol. It was extremely spicy! The waiter was kind enough to pity us and treated us a round of lassi shots to tone it down ♡"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQT1psZEdSdTV5VW1BRRAB",
            "text": "Upscale Modern Indian restaurant in the Lower East Side as a predecessor to Semma. The cocktails were unique with an Indian twist like a Ghee washed Indian rum & whiskey smoked Old Fashioned, Bombay Blues, & Golden Ghazal. The soft shell crab was amazingly delicious as well as the paneer appetizer & entree. Would recommend trying, very energetic vibe inside of Essex Market entrance"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyZ3J6Vlp3EAE",
            "text": "The food is really spectacular. I would say that you wouldn’t find the regular indian food menu but this place serve their food uniquely. I would say that I love almost all the food that I order except the crab fried rice. To me its a bit mushy and spicy. I come from Indonesia and I handle spices well but the fried rice really spicy in the stomach but not so much in the mouth. Other than that everything was great.\n\nThey only have 1 bathrooms and no sink outside so it’s hard to wash hands and have to get in line."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBdHFxRlVREAE",
            "text": "My friends and I visited this restaurant on a chilly winter Sunday night, and it turned out to be the best Indian food I’ve had in New York City. Since we were a group, we ordered a variety of dishes, and every single one was packed with unique flavors—there wasn’t a single disappointment.\n\nThe food leans toward the spicier side, so if you’re sensitive to heat, I’d recommend asking them to adjust the spice level. My favorite dish was the Nalli Biryani—absolutely outstanding. The Butter Pepper Garlic Crab was to die for, and the Paneer Methi was incredibly flavorful, pairing perfectly with naan.\n\nOverall, it was an amazing experience with generous portions, and we had plenty of leftovers to take home. I can’t wait to go back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfM29PUFhnEAE",
            "text": "I loved everything here and hope to come back to try more! The lamb shank briyani is divine and the butter crab makes you dream of it sometimes. Service is fairly fast which is great. Love what this restaurant is doing for Indian cuisine!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbU43TjB3RRAB",
            "text": "Large variety of dishes from all over Indian states. We had paneer, daal, roti, & rice. It was authentic and served in a traditional way. Overall good restaurant & staff is friendly. Atmosphere can be better."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQNnFyVU5nEAE",
            "text": "Today my husband and I had dinner at Dhamaka. We flew from Houston just to have dinner at Dhamaka for our anniversary. For a long time we have been following Chef Chintan and we loved his passion to serve authentic Indian cuisine. To get that experience we visited Dhamaka and it truly justifies its name.\n\nAs soon as we entered the receptionist welcomed us with a greeting. Our servers Yola and Richard were so attentive and explained the menu very well. Both of them made our day very memorable by making us feel special. They were talking so passionately about our Indian food that caught our eyes and we were so impressed.\n\nNow comes the main part 'Dhamaka' for which we specially came to New York. For appetizers we ordered Bohri chicken cutlet and butter pepper garlic crab. The first bite of cutlet took us to Mumbai's Mohammed Ali road Eid feast. It was perfectly cooked and so flavorful. The crab meat was fresh and had a nice creamy texture with black pepper. We were lucky to get Champaran meat and it was super tasty. The meat was perfectly cooked and flavorful. That flavor of garlic was making it outstanding. As we were celebrating our anniversary Yola served us Roohafza and Lassi shots which was a complete surprise and took us to our childhood. Mr. Ganesh was very attentive and we got the opportunity to chat with him. He passionately talked about serving authentic dishes and how Dhamaka is always curating best recipes to serve the food lovers. We love the food so much that we expressed our happiness in front of Mr. Ganesh and he was so generous to give us the opportunity to meet Chef Neel. Chef Neel is a gem of a person and we could express our thoughts and how the food took us back to the memory lane. Then we had kulfi and rabri, which were yummy and delicious. Rabri has a perfect balance of sweetness and texture. Kulfi was having our original flavors and not at all felt watery. I am out of words to talk about it as it's amazing.\n\nAfter this experience Dhamaka will be an emotion for us as they serve the best food along with the best experience. We have been to the Michelin star restaurants but never felt the warmth, welcoming and perfection you guys have from service to food.\n\nThank you so much for serving authentic Indian food with love and looking forward to having dinner again."
        }
    ],
    "reviews_count": 81
}