{
    "name": "Lucien",
    "place_id": "ChIJ_X--hINZwokR0nGi4dhw1JE",
    "grid": "MN3",
    "address": "14 1st Ave, New York, NY 10009, USA",
    "rating": 4.1,
    "user_ratings_total": 754,
    "phone_number": "(212) 260-6481",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWllVVlRUVmhVZWtkbVFtVllOakJpVjJwMFYzYxAB",
            "text": "Absolutely shameful!\nIf I could give this place zero stars, I would. I made a reservation 2 weeks in advance for a party of 8. Called two days before to confirm and they confirmed. Then they called me again the same day to confirm, and I confirmed again. We showed up on time at 9:30 PM sharp.\nWe were left standing there like complete idiots for a almost and hour and a half. No apology. Just empty, repeated promises: “Your table will be ready soon.” “Just five more minutes.” At 11pm, the “manager” offered us some crap sparkling wine while we waited freezing on the sidewalk. After 10min we gave up and left.\nWhen I asked why we even bothered making a reservation, the only excuse was, “We’re very busy.” So you overbook on purpose and make your guests wait an hour with a reservation? Make it make sense.\nSave yourself the time, frustration, and complete lack of respect. Go literally anywhere else."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SNVUwTlNZV1JXZVROTlVuUXRTVzlSVVdJdFZXYxAB",
            "text": "Had a cool time at Lucien , was invited by my good friend Jamal . I'm visiting from the Islands,  just visiting a brother working on a movie.  Then Lucien Bar it was , then a Movie level 3 days ensued . Highly recommended , Was introduced to Zac the CEO . Great moments .all the way from the Caribbean Isle of St.Vincent . 🇻🇨🇻🇨🇻🇨🇻🇨🇻🇨🇻🇨🇻🇨🍷🍷 By Reservations only ."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRZ0ozenpBRRAB",
            "text": "Lucien remains a bullwark of French cuisine and atmosphere right on 1st Avenue in the East Village. The food and wine selections are great. Adding considerably to its charm are its clients. During a recent visit I got into a discussion with my neighbor in the restaurant who turned out to be active in New York's gallery world. The restaurant also gets nice afternoon sun. With the staff the restaurant feels like one whole big family."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0YWFtaE9SWFUwY2xCMlJXVnlRWGQwZEVGSFExRRAB",
            "text": "Overpriced and nothing special!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWTVZtMDVXRnBITmxwTFdIcHBkV0V0TVZOclJHYxAB",
            "text": "My neighbour and I used to have espresso martinis here every Sunday night and it was perfect"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwMVpGZ3RaVTVrZWtsTlEwdHJMVmc0UkhoalNuYxAB",
            "text": "Expensive and bad service. Below average food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkeVRWVkpjRWQxZDFKQ2FrSnFPVFpCTFdaWWNFRRAB",
            "text": "Amazing little gem of a restaurant right on the corner of 1st and 1st. Great food, great, wonderful atmosphere. We really enjoyed it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21scVRVbDZiakI0VUhVekxUaENRVFUwVFdGRlNVRRAB",
            "text": "Delightful"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FMU4zY3pjbmRVVEd0T1pVOWFkMFE1Y0Y5QmJHYxAB",
            "text": "The steak was very hard to chew."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWeFIyNUVTVUkxTVVocFFYQnBWMHAxV0ZSNVFrRRAB",
            "text": "Best steak frites in NYC."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21STFpsbFBORzVwY0Y5ZmNWZG5URTFHUlhoTVIwRRAB",
            "text": "Restaurant was loud and cramped. Food was standard French bistro. Nothing to write home about."
        },
        {
            "date": "1달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoeVlqUmhUVkZvTW14Nk4yMWZlR3hXV0ZGNUxVRRAB",
            "text": "Wir waren zum Mittag hier. Das Essen war sehr lecker und der Service sehr nett."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJM1gzRktiMG8wYWpWMVZsZHFlR1JwZFZCV2NFRRAB",
            "text": "Iconic"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SbFQwUTNXVlI1TkVkMFdFRndZbUZ3UjFwaVlWRRAB",
            "text": "The rudest servers I ever met!! Maybe because it’s a French spot? The steak frites  cold and not cooked the way I ordered!! But they can charge around $100 per person on average"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxUWNqZGlSRWR3UTNSMmF6UXdWMUppYmtsWVgwRRAB",
            "text": "So good! Get the steak frites and seafood soup."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xReVpUUktTVzFJUzJVMlEwcFZXRkJYZDNaUWFGRRAB",
            "text": "I LOVED this place. Felt like I was tucked away in Paris again!!! French onion soup was delightful, on the cheesy side for sure.\n\nIt’s loud! But in a people chatting organically way. Really enjoyed that ambience.\n\nEasy to walk in for a bar seat for 1 on a random Wednesday. Much harder if you were any other party size. Book a Rez."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNad3FLa0ZREAE",
            "text": "The atmosphere is so NYC chic and right off the street. There's the sidewalk, you open the door and you are in the seating area. Tight quarters but not uncomfortable. Some might classify the space as loud or noisy but I say energetic. Come as you are. You can dress up or dress down. Nobody cares. The staff is attentive in part because the place is small.\n\nThe menu has range so whatever you want to eat is likely there. I strongly recommend making reservations for prime time but they do stay open late so if you want to chance walking in you could find a table. You could also call beforehand. There is a bar but it might accommodate 6-7 people. In other words it's crowded.\n\nThe food was very good and the portions were fair. It's French so it is a little \"foo foo shee shee\" or fancy, kind of. Translation? If you are hungry order an appetizer and you should be fine.\n\nIt is Manhattan so parking might be a challenge but there's metered parking on the street and a garage is never that far away. The location makes it that once you leave there's plenty of the NYC vibe to take in whether you are a native or just visiting, walking, driving or using mass transit. It's definitely worth checking. Going solo is fine but with a date it won't be cheap but they'll enjoy the experience and so will you."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSGFuTjNRVVpzWTFCeVRHeFRkMGRWTFhsUVRuYxAB",
            "text": "The loss of the original Lucien spirit is one of the greatest misfortunes the East Village has faced in recent years. For so many years this restaurant was a gathering spot, feeling like the living room of Avenue A. It was a rare constant in a city that changes way too quickly. I came here nearly everyday and would be greeted by friendly familiar faces who knew my name, would ask about my life and most of all, they knew the unspoken value of true hospitality. This place is now unrecognizeable. There’s an endless turnover in staff, most of who seem to arrive with no experience in hospitality, hired instead for the way they look rather than any real passion for working, who don’t know or care about who has been loyal to this place for years. The people who worked here used to be cool.. They worked Lucien during the night, but would spend their days making art, acting etc.. The old Lucien felt like stepping into a real community.. now it just feels transactional and like the staff prioritizes how many tables they can turn over/ how many tips they can make in a night instead of the experience of dining. The last night I came in I overheard the owner Zack telling a host to not say goodbye to him unless it was at the very end of the night. that moment encapsulated what has been lost, a connection between the staff and the management, the humanity and the feeling that Lucien was about connection rather than control. The last night I came in will be my last. I had to wait an hour for a table on tuesday because two new hosts sat three walk-ins before me since the other member of my party hadn’t arrived. Once the other person did arrive, they said they were sorry, but isnce we were 15 minutes late they wouldn’t be able to seat us for a while. I was there on time. It wasn’t always like this though.. There was a time, not even that long ago, where the staff genuinely cared about making the experience work, about hospitality as an art form, not a numbers game. The erosion of the community is what makes me the most sad. For years the hosts and servers would make me feel welcomed, remembered and seen, but lately not a single one of the new hosts has asked my name or acknowledged how often I come in, despite my being there nearly every week.\n\nUnless there a change in management philosophy, the last night I visited will be my last. Lucien wasn’t just a restaurant, it was a commnity, and the east village is lesser without it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tad2VETjVlSFo1Umtodk9ERXdOVE5DY0ZVdFIzYxAB",
            "text": "Great neighborhood spot. Good energy and the lobster pasta is one of the best in the city. Grab a drink with Myles at the bar if you wanna pop in for a quick drink."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ScFRsSnVhR1l0ZG1nM2QxOVRVMmRLUVc1elVuYxAB",
            "text": "The menu price online was different than the restaurant.  They need to update the prices. Atmosphere nice and the bar tender was amazing.  We heard the lady waitress say to two tables they had to go now after they were finished eating. Super rude. Food delicious but service was rude."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSFpqbHNlSEo2VG1WWVZVNHRjamsyWWtKVWRXYxAB",
            "text": "This is it!👍🏼❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0VGRHSmhTekpoT1hobmQzTmtNMTl5YXpFeVJVRRAB",
            "text": "Great French restaurant in a cute setting serving delicious dinners.  The squab was amazing and beautifully presented.  Every thing made me feel like I was back in Paris.   Wonderful menu with first rate service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVU5GTkZURkJwTVRsa1EyZ3lWVFZCU0RWVWFHYxAB",
            "text": "This is New York!! Just go!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUE9XVlVSVVJHWm1OMWRESkhla1I2VVRKdFIzYxAB",
            "text": "Always on point"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214c1RtcFhaSFIxYjI5aFkzbHZhM2cxYlZWelVGRRAB",
            "text": "We came here for lunch on the recommendation of the Ludlow Hotel’s front desk. I ordered the artichoke salad. It was one of the blandest salads I’ve had. The artichokes were way over fried and tasteless. There was barely any dressing. I asked for chicken to be added. It was overcooked and needed salad and seasoning. To make things worse, everything was insanely expensive. Do your research. I would have skipped this place if I had."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSM05sSlpTWHBXZFcxNGR6azBkelpGUzJFMGVsRRAB",
            "text": "I order the chicken it was very tasty and juicy just perfect.\nThe food runners were very friendly!\nI will be back to try other dishes!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvd1NreHpTVWhZY1ZoV1ZISmtiM0ZJVG5kS1ZsRRAB",
            "text": "Service - 3 staff and 20 min to get my aperitif ($15 for a Ricard that they did not know how to serve) on July 13 around 1.30pm. Busy day? Nah, only 3 tables with patrons. Zero excuse. The 3 ladies were more busy chatting than paying attention to their customers. Absolutely unacceptable.\n\nMeal: took pretty much 45 min between ordering and getting our 2 dishes (we did not order much).\nBad bread…how can you own a French restaurant and serve subpar bread to your customers?!\nGrilled octopus? A piece of rubber, completely overcooked.\nDuck cassoulet? The duck was definitely canned duck as the meat fell off the bone by just touching it with my fork. It reminds me of those tourist traps on rive gauche in Paris that sell you canard fermier …fresh from the can!\n\n$110 + tips. NEVER AGAIN."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psVVpHUnROVzFxVERCSFptWlNaa0pqT1Mwd1RGRRAB",
            "text": "Absolutely Appalling!\nIf I could give this place zero stars, I would. I made a reservation five days in advance for a party of 5. Called two days before to confirm and they confirmed. Then they called me again the same day to confirm, and I confirmed again. We showed up on time at 8:00 PM sharp.\nWe were left standing there like complete idiots for a full hour. No apology. Just empty, repeated promises: “Your table will be ready soon.” “Just five more minutes.” Until 9:00 PM. At that point, we might as well have just walked in without a reservation and gotten the same (lack of) service.\nAnd when they finally seated us, they stuck us at the worst table in the entire restaurant directly facing the toilets.\nWhen I asked why we even bothered making a reservation, the only excuse was, “We’re very busy.” So you overbook on purpose and make your guests wait an hour with a reservation? Make it make sense.\nSave yourself the time, frustration, and complete lack of respect. Go literally anywhere else."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aaFl6VlFOSFp4VFRCTWRraHlTazluZFdkQ1RrRRAB",
            "text": "The absolute best."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210U04wb3dPVW8wWVVFNFEwUkhZVjgxYUMxRmNFRRAB",
            "text": "Super cool little spot - Upscale dining in a chill/casual environment. Food was top quality and staff was amazing!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sUmFUUk1SVXBUZVRsQ1NWZFJUbk41YlcxQlMyYxAB",
            "text": "I ordered the steak and fries traditionnelle the dish was cold and awful!\nSpoke to employees and even requested the manger, they were all very bad."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKUGctZU9oLWRIS2hRRRAB",
            "text": "The nexus of the universe. Cracks bad 7 days a week. Great food and lots of smokers. My favorite restaurant in NYC & the owner Zac is a class act. 5 stars Bigtime"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPeVJxUEh2dnNQRjJnRRAB",
            "text": "Great steak frites"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQRFR0NmJpanJDZlhREAE",
            "text": "This place is always a vibe. It’s tiny and expect to wait (even with a resy), but it’s worth it. Great food, the service is good, and the crowd is always very chic and full of energy. This will continue to be a staple for me."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMcldrcU9WZ08zcnZRRRAB",
            "text": "Drinks: Martini,  Godmother, classic Whiskey Sour."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMalIxNFd5d3BLVjVBRRAB",
            "text": "Long time lover of lucien, consistent staple in a changing neighborhood. Warm staff and authentic french cuisine, best cassoulet in new york city"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VMeUY3LVdTODUySUpREAE",
            "text": "Really want to love these guys. Been here twice. Mussels are decent. Bread is pretty good. Crème brute is blah. Service is average plus. Anywhere else this would be dope. For NYC average."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNeXA4UFRVd2RTRG9nRRAB",
            "text": "Established French restaurant with great food and drinks."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQalRySzdCODRxQmR3EAE",
            "text": "Always top class food in here"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPV2YwUEgzc2Y3MUdBEAE",
            "text": "We had a 9:30 reservation. We got sat at 10:45. Nothing was comped. It was my birthday. Kind of shitty!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZZ2Z1UWF3EAE",
            "text": "Food is actually very good. However the atmosphere is much too crowded and loud to actually enjoy a meal — I had to leave early. They are simply overstuffing the place. I had to get up from my chair to let the people from the adjoining booth out several times since the tables were so close together. We were also seated late despite having a reservation (since they were so packed)."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveFlIOUpREAE",
            "text": "My new fave in NYC.  Great food and ambience….will go back every time I am in Manhattan"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaE5paF9BRRAB",
            "text": "A bistro with a rare family-like atmosphere in Manhattan."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaVpTRmRREAE",
            "text": "Great spot for amazing food and vibe."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMbnFQMHh3RRAB",
            "text": "Lucien is a classic French bistro in the East Village with a Parisian-style room. Known for its traditional French dishes and a lively atmosphere, it's a popular spot for both locals and celebrities. Expect a lively, crowded environment and classic French bistro fare."
        },
        {
            "date": "6달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJenVPaVFBEAE",
            "text": "Bellissimo"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJd3RmZ2VBEAE",
            "text": "We had a great experience at this restaurant. The service was attentive and friendly, and since it wasn’t too busy when we arrived, everything felt relaxed and comfortable. The wine selection was fantastic — we really enjoyed the glass we had.\n\nAs for the food, most of the dishes were excellent. We order 4 apps. The mussels were absolutely amazing, packed with flavor and cooked perfectly. The steak tartare was another standout, fresh and well-seasoned. The fraise salad, however, was just okay. It didn’t quite stand out compared to the other dishes, and the two large bacon pieces felt a bit random and out of place."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3djhHT253RRAB",
            "text": "I've been dining here for 30 years. The decor and layout have not changed in all that time. It feels so French and you will sometimes hear a French accent among the wait staff, but I agree that a place like this could not exist in Paris; diners would never put up with being made to wait interminably for a table they'd made a reservation for. It did not used to be this crowded; 15 years ago, you did not have to wait for a table if you had made a reservation. I think this place has simply become super popular despite the constant increase in prices and wait time (the owner knows what he's doing; it is one of kind). This is still THE place to see beautiful-looking people in the E.vil. The food is mostly wonderful and very French. Service is not rude, but definitely rushed. Aside from the irresistibly charming atmosphere (arty, East-Village-heyday local meets French-bistro gem) it is akin to sitting in coach. Do not come during prime dining hours if you aren't prepared to stand tightly in a poorly-ventilated, watch-your-toes, hold-your-drink/bag/coat corridor while wondering if you're good looking enough to be seated in the front. If you are up for all of that, you'll have a great time. But I wouldn't fault anyone for not wanting to put up with it."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NTZ5TEdBEAE",
            "text": "Always a nice place to have some great food ."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cHZtblhREAE",
            "text": "Came here for steak frites and had one of the most memorable au poivre’s I’ve ever had. The place is small and a little chaotic—seems like it’s always super packed so it’s hard to move through, with bussers/servers/hostesses and customers unintentionally bumping into you if you’re at the bar. Personally I enjoyed the experience because it feels as though it’s part of the charm reminiscent of an intimate Parisienne cafe. The Champagne that they serve by the glass was delicious, great wine selection, only 1 beer available. I ordered crab cakes, beef short rib and the filet au poivre. The short rib was what you’d expect: tasty, perfectly cooked to a tender fall of the bone texture and flavorful. The crab cakes exceeded expectations, tasted fresh, and didn’t get the sense there was too much filler. The filet au poivre stood out as the au poivre was on the spicier side of things which I loved. The restaurant is on the pricy side. Both times I’ve gone, I walked in, and had to wait for a seat at the bar. Recommend making a reservation."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmM2ZqbkN3EAE",
            "text": "The place is small, but popular. We did make a reservation which they seated us for over an hour after. They promised a round of drinks and dessert for the long wait.\nIt was a bit of a haggle to get them to honor the round of drinks, but they did.\nThe food is very good, I ate the salmon, my son had the chicken with potatoes. The crème brûlée was good too."
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEanRHd0lBEAE",
            "text": "Das Essen war extrem lecker und wir haben es uns richtig gut gehen lassen. Negronis, Schnecken, Austern und Steak Frites! Gott sei Dank war ich mit bekannten Leuten dort und deshalb war der Service auch super und die Rechnung musste ich auch nicht zahlen! Alleine wäre mir dieser Laden aber viel zu teuer und stressig. Aber schön mal dort gewesen zu sein! Ich sollte öfters nach Frankreich fahren."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5aHZMSDNBRRAB",
            "text": "One of the original French places in NYC. It’s a bit tight but the service is great at making it feel perfect. Gabrielle our waitress gave perfect recommendations. Best time is before 7pm for the foodies, later is more of a scene spot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKdS11S01BEAE",
            "text": "Charming little french restaurant. The space is quite narrow inside, so be prepared to share some space with other people while you dine. Our servers were really friendly. Highlights were the grilled sardines, duck confit, and tart tatin for dessert. The arugula salad was ok, if you wanted some greens, but nothing that special at that price point. Price point is a bit high."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURobDlEZ2Z3EAE",
            "text": "Lucien is a charming French restaurant located in the heart of New York City. From the moment you walk in, you are transported to a cozy and romantic atmosphere, with dim lighting and elegant decor.\n\nThe menu is filled with classic French dishes, and attention to detail is evident in every dish. The standout dishes for me were the sardines and beef tartare. The sardines were perfectly grilled and seasoned, and they were served with a light salad that complemented the fish beautifully. The beef tartare was also outstanding, with tender and flavorful meat that was expertly seasoned.\n\nIf you're looking for a classic French restaurant with outstanding dishes like the sardines and beef tartare, Lucien should be at the top of your list."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyd012dkZREAE",
            "text": "I was told that this place is very scene-y, so I was skeptical of the food. And while it is definitely scene-y - I've never seen so many pairs go in and out of a single stall bathroom on a Thursday at 7pm - the food is really good and worth the visit on its own.\nUsually I avoid fillet mignon in favour of meatier cuts, but the steak au poivre is delicious and reminded me of how good a lean, tender steak could be - highly recommend.\nI'd suggest making a res, the day we tried to walk-in, they were booked for the evening, there is bar seating you can hang out for, but we got really lucky and snagged a table from a no-show reservation.\nIn all, if you're looking for a French bistro style meal, Lucien is a great option, if you're looking to be seen, then it's great for that too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoczhPS2hRRRAB",
            "text": "4.5. Great vibe, bustling bar, great service, good food. Really fun, old-school space with a large menu. All of the French classics are on here- many fish and meat options. Highlight of the meal was the appetizer shrimp!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2M3NmYW1RRRAB",
            "text": "If I could, I would give this place zero stars!! Rude servers (Christina and Beatrice). Who argued with me about the overcooked octopus. Christina served me my dish and then took an hour lunch break. Without telling me or assigning the table to someone else. I sat there for 45 minutes and watched everyone around me get great service. Not one waiter asked me if I needed anything. This is the worst restaurant I’ve been to in New York. Save yourself and go to many of the other great French restaurants. I added a pic of the crispy small octopus. They try to camouflage it with potatoes."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1M1pMUkZREAE",
            "text": "I had been wanting to try Lucien for a long time, and so when my sister was visiting it felt like a perfect opportunity to try it out!! Seafood was delicious & fresh — the grilled octopus amazing. Be prepared to spend upwards of $20 for a simple salad (arugula, parm cheese and fennel) and $17 for a soup. Pricey, but worth it."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNmJ5aEJ3EAE",
            "text": "Great atmosphere, mediocre food. Tarte tatin was however extraordinary. Worth it for a desert and glass of wine."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4aDRPUFdREAE",
            "text": "Came for brunch on a Saturday for two people. As many reviewers have said, expect a line.\n\nI've been here a few times and all in all it's good, but some of the food is hit or miss and nothing really stands out. What you come here for is the entire experience - the restaurant is an iconic neighborhood gem, charming and quaint inside.\n\nOrdered the below\n\n-Almond Croissant: Tasty.\n\n-Croque Monsieur: the best thing we ordered. Petite in size, but delicious. I would come back for this.\n\n-Jambon Cru: this has potential. Even with the prosciutto, the eggs needed more cheese / salt / pepper. They were bland. But I will say, the texture was perfect: pillowy and soft. This is a tiny order so if you're hungry you may also want something in addition."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSOWNETldREAE",
            "text": "This is everything I love about France and Paris tucked into a cozy space with a few street-side tables and a first come first serve bar. Drinks are classically done along with stellar dishes. I come here for dinner every time I visit NYC."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfanBxdUNBEAE",
            "text": "OMG I heard about this restaurant on TikTok & had it on the top of my list for the longest. Everything was so fun. The atmosphere definitely gives sceney New York but I thought it was in the best way! I’m surprised to see other reviews not be 5 star because honestly people, grow up! This place was fun, energetic, and I loved the food! We got oysters, steak frites, scallops, and lobster pasta. Loved all of it. OK YEAH, the place is busy! Hello?? It’s in the hub of downtown Manhattan. Honestly, me and my boyfriend loved it. Great place to people watch, have good drinks and food, and have some fun. Relax people.. 5 stars.."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4Nm9pbEZ3EAE",
            "text": "We were so overwhelmed with how good the food here was. Traditional french food in a small cozy restaurant with lots of locals and french customers. Highly recommend this place and I would go back here everytime I get to NYC"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCNU15X1V3EAE",
            "text": "Everything was delicious! I had the escargots, moules à la marinière, and tarte tatin, I loved everything; there were just two things that I didn’t love, which was that the escargots didn’t come with the shell and that the waiter wasn’t great, she was very serious and didn’t find her very helpful when I asked her about what dish she would recommend.\nOtherwise, great place to go to. Definitely going back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdU9uRHdBRRAB",
            "text": "This place has a vibe that’s so rich and cozy, the experience was really great being here. The drinks was tasty and the food was delicious. Had the steak frites and was not disappointed at all. My only thing is about this place is because the atmosphere is so great and welcoming, it can get very very crowded, especially if a celebrity or two is there or drops by. So make sure you’re there early or on an off peak day."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMta3Z5clZREAE",
            "text": "What a cozy & authentic place. Food was good but there are probably more stellar options vs. what I had i.e. eggs Benedict with merguez sausages. Place has a lot of history and evidently, a beloved one based on the photos on the walls."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldktueURnEAE",
            "text": "Definitely worth a visit! We had the onion soup and the escargots (snails) for starters, which were very good. The highlight was the scallops with mashed potatoes, which was exceptional."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtcXBXRS1RRRAB",
            "text": "Great drinks and dishes. Very crowded and can’t even hear myself talking but you might bump into famous people which is why people seem to squeeze themselves having drinks. (V casual)\nWine selection is reasonably priced."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2Z3ZMX05REAE",
            "text": "I was so excited to enjoy a cassoulet, I was told that, of course, since Lucien passed away, quality was not the same. But it is just the worst restaurant I experienced in NYC so far. 40 minutes to be seated with a reservation, half the entrees menu were strikethrough (of course, included the Cassoulet). 3 back and forth to have a wine because the menu was  not updated, either the wine was not anymore available, or they brought a 5 year younger wine for the same price! Food was acceptable, but not worth the price at all… Entrees came before the appetizer we had to cancel.!!! Cherry on the cake when we discovered we were charged $4 for a white, dry, disgusting bread… Lucien should roll over in his grave! To avoid if you want to have a sense of French food and welcome…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2ODluMjhRRRAB",
            "text": "My wife and I enjoyed this little downtown restaurant very much! The food is simple excellent.. we ordered Wild Salmon and Scallops and it was amazing.. one of my tops restaurants right now!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldHJmQ1BBEAE",
            "text": "Loud that it's hard to hear yourself think.\nSo busy that you're on top of yourself and the table next to you.\n\nThey take reservations but there's not a guarantee of being seated on time.\n\nThe entrees and drinks are about what you expect for a $$$ restaurant and taste wise in manhattan\n\nA culturally historical  hip place with a young crowd but it feels very overrated and just ok compared to all the other options in the east village / LES for the price and hassle\n\nI found it incredibly wild how packed it is that they have tables on the street next to the bus station paying the same prices\n\nTry it if you're curious."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSNDRxa1BREAE",
            "text": "Este sitio es muy loco, hay que ir con paciencia porque te hacen esperar aunque tengas reserva. Nosotras esperamos 45 minutos. Es un caos total pero la comida está rica. Cuidado con los cócteles porque están fuertes."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbWJIem1nRRAB",
            "text": "Great vibe - it's a cute little restaurant with trendy music and crowd. Awesome food - we loved the duck liver pate and duck confit cassoulet."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNM2ZmTXlRRRAB",
            "text": "Apart from the service, which was sadly really slow and pretty tragic, This was an amazing experience. The food was incredible, wine was beautiful, and the perfect table ambience for a close dinner with friends"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwMjgtRXh3RRAB",
            "text": "Great vibe in this cute restaurant in soho, loved the aesthetic and the mains were very good! Starters were quite disappointing for the price though"
        }
    ],
    "reviews_count": 76
}