{
    "name": "BETTY",
    "place_id": "ChIJ6TM6XsxbwokRTNklb777efQ",
    "grid": "MN3",
    "address": "193 Henry St, New York, NY 10002, USA",
    "rating": 4.6,
    "user_ratings_total": 256,
    "phone_number": "(646) 556-5081",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oR1JUbGtSakIzY21kNFdsTndjRVkzWWt0a2IxRRAB",
            "text": "I've been here for take out breakfast but we decided to go and eat. I ordered for my husband and I but the young lady misunderstood the order and brought out only my husband's order. I had to tell her my order was missing. By the time my order came out my husband was done eating. The scrambled egg was runny which they did correct and we were happy. But I will say, eating here is so worth it. We will be góing there again and again."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kaWVTMUtNalJCYVdZeGRYZDVVbTFKV0d4aVVuYxAB",
            "text": "Nice and perfect ! Enjoy 😊"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOR2VYRkVZMUZDVURaUVltdDJORVpCYXpSNFlrRRAB",
            "text": "Delicious breakfast friendly service, cool atmosphere. Would definitely recommend 💕"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WaFJGcHFVbFZhTkdZNGQxQmFkM1Z1Y2xkNlNFRRAB",
            "text": "I love their salads and beet humus!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taQ1prUlZOSFJ0VUdjNVNGOHdWekpmU2tKV1YyYxAB",
            "text": "This was a fun little restaurant that we stopped by a New York City. We chose their brunch options. I got avocado toast and was impressed by both the presentation and the delicious taste. my fellow really enjoyed their drinks. When we went, it wasn’t very busy so there’s plenty of seating and their bathroom was very clean. Looking at their bathroom there was a sign saying they have a weekly comedy show overall super positive experience"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toa2NsTTBRVGR6TTFKa2JXMURZbFJ1YmxOSk1rRRAB",
            "text": "My mom and I stumbled on this place after our initial breakfast plans fell through. We got the chorizo tacos and pancakes. Our server was super sweet, offering a house-made hot sauce that while, strong and fiery, didn’t linger long, which is perfect for me. The pancakes were luscious. Melt in your mouth consistency, buttery and soft, and I’m not sure where the syrup comes from, but it was incredible. A man who I believed to possibly be the/an owner of Betty’s, and seemingly involved in the food preparation, greeted us after our meal where I was able to give my compliments… something I had wanted to do since I took my first bite!\n\nI’ll most definitely be back here!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUldFUm9RWFU0YUcxcmNFWk5hVzlqZEhaUGJuYxAB",
            "text": "nice neighborhood spot for a quick meal"
        },
        {
            "date": "2주 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdlFtSlJlSFF5ZFRseldXUk9UeTFrVFZaNE5sRRAB",
            "text": "Carne buona, consiglio!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOS2JFZGthVXMxTjJScVRXeFZaR0pFVTJWd2NYYxAB",
            "text": "We had the Brussels sprouts and the beet hummus for apps. I had the crispy duck for an entree.  Everything tasted delicious. Matt and Will were awesome as our servers.  Worth the visit to LES."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25scWEzVlJlWGxHVm5KWlIwWXdOMUpHT0RaT1ptYxAB",
            "text": "Absolutely amazing service here! Arnold was so attentive and great service!!! Definitely worth stopping in for a drink here :)"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVFIxWnBXbEJxUmtKSGMxRktRVEZaZEV4c1pXYxAB",
            "text": "Drinks are amazing and the food is so good. The bar staff is amazing I love Will!!! The pot pie and green curry are peak!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSU9DMTZlbEZSY0hOTVoyNHlNRWt3Y1hKR0xYYxAB",
            "text": "Charming “locals only” spot that welcomes all!\nYou know that spot that you know you will be received warmly and the food is excellent? Abby and her team are unassuming and sweet, this is the type of place I wish I had in my neighbourhood, 10 out of 10 recommend!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQllVMXZka0o1T1d0RGNGQldSakpNZGt4TmQzYxAB",
            "text": "Amazing!!!! Service is amazing, will amazing!!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kM2EwSnhaV1pIWXpOQlpGRnRPRUoxWldGaldXYxAB",
            "text": "stopped by tonight and they have the most amazing chicken pot pie, banofee pie, drinks, and staff 10/10."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSS01tTjNkemhDWVZwTWRYTnZhbEJvZEd0Q1pVRRAB",
            "text": "Such great food and the servers are so friendly! My fave in NYC!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0amJtVmhTR3N6V2xZelJHVk1NbkpFYlRWTlVHYxAB",
            "text": "Jadyn and Chloe were awesome!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twdlUwdDJOR2RvTkV0TlFtUnVXbTgwVm0wd2RFRRAB",
            "text": "My bartender, I think her name was Layne  was so kind and friendly, I felt like I was back home in the country at my grandmothers house getting pampered by love and chocolate."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WUVUyRmhaWEJGVW5wcE9WRkhNbDlXY1hGTUxVRRAB",
            "text": "Went here for brunch, it was amazing. Shout out Layne for the spectacular service she made the food taste even better ! Will be back"
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRaHZEaE9BEAE",
            "text": "What a find! LES treasure. Friendly. Sensational food & drink. Great prices. Cute place."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGQ1ltdGZNR1pzZW5STGFFSXlOVGs0VkdwcWJrRRAB",
            "text": "Recently tried this place for dinner. The food was fantastic! Beautifully served and perfectly cooked. The service side was more challenging. They were not extremely busy with approximately 12/14 people in total dining yet it took about 50 minutes to receive the amazing dinner. The music level was also an issue. One minute it was fine the next it was blaring. If the timing of the service had been better I would definitely score a 4 or 5."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kSlpFWjZkMDV6VFVkaE9XSk5TVGRQWjBWTFFsRRAB",
            "text": "Been coming for years it’s my favorite place in the neighborhood.\n- great food\n- great music\n- great service\n- great value\n\nWhat more could u ask for?"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVFdIa3dhMVprUzBKNFEyRTBhamhZTUZkQlpHYxAB",
            "text": "This place must have a fabulous brunch, because dinner service did not show any of the glow mentioned in these reviews.\n\nWe must have gotten the B team - at what point do you say to a guest “we don’t have reservations tonight” without checking (he was wrong and we did).\n\nThe lady who worked out area was inconsistent, either all over us or entirely missing.\n\nThe food was… average. The grits were pre-made in a cast iron skillet but were not heated to hot. Brussel sprouts were tasty and those who had a fish curry enjoyed it. Drinks menu was extensive.\n\nIt was a well priced meal. Maybe another day, for brunch."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBd05sY3pUbVpWZWt0U05saFJjamhYWVV4S1JGRRAB",
            "text": "Excellent food at amazing prices! The steak and eggs (5/5) was incredible and only $20. The steak was cooked perfectly and covered in a sweet salty au jus and included a hefty portion of perfect arugula salad and well roasted/seasoned potatoes. The entire dish was tasty, filling, and perfect. Incredible, also service was amazing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTVoxWjFNM05RUm5rMExXMWhObGh6Y3pBM2NWRRAB",
            "text": "This place is my second home in NYC. I am always treated with such love and care. The food is delicious and reliable - I’m always trying something new too. The staff, from the ownership, to bartenders, to kitchen, are friendly and all characters in their own right. Not the mention, the music rocks. I <3 BETTY"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsUlN5MDFTVmQ0VlZwTVRtOHlSRzlCYm10dFVtYxAB",
            "text": "Named for the owner Dan’s mother. Such a great find."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVFRGcFZOMlJyUW1kalVUVkJYMGxJWmtGQ1duYxAB",
            "text": "Great atmosphere! Jadyn was my server she was well versed and attentive I’ll definitely be coming back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wTldHRjZjVTFuVlZweGRFWnhWR1J0WkZremFrRRAB",
            "text": "We go here 1a week , we want to go more! Great deals, great food and a nice vibe."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNNE5sZDRWbFZ0UlhsdFlYZ3lVRkp2VkdGdE5HYxAB",
            "text": "We couldn’t stand (literally) the 2-3 hour wait at Golden Diner, so we found this gem close by. Very fortunate. Wonderful food, well executed, and based on quality ingredients. Everything was delicious, well considered, and intentional from the mains of eggs and pancakes, to the sides of bacon and toast, and the fresh squeezed juices. Even the glass bottle of maple syrup was given a pour spout to avoid sticky drips. I doubt one could go wrong here, and we would happily eat here again. Maybe even tomorrow."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNdFZWWlpVMlZ4YURWSlpsWkJUMjgzZG1Gck5tYxAB",
            "text": "Lovely experience! Highly recommend their tofu sandwich."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSUk1GTXpXR1pTU2t4d2FGWTRjbWd3ZFdSSlQyYxAB",
            "text": "There really is no better comfort food restaurant south of Houston! The minute you enter you are made to feel like family with impeccable service, chill atmosphere, and the most delicious food and drinks. If you are looking for one of the best meals of your life at very fair prices, come in a big group with an appetite and get one of everything on the menu. You won’t regret it! Shout out to the best bartender ever sweetheart Will (of “one in a willion fame), the dashing Darius, the gracious owner Dan, and the genius chef Abigail. You make living and eating in NYC a divine experience every single time 😍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CdE4yaDZNbFk1Tlc5VmJqTXdWR2R4TlVseWVFRRAB",
            "text": "Chloe and Will are awesome!\nHad an amazing time with wonderful service.. Highly recommended!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnd1NYbFNhR2hVY1dWbFJFUjVhbGN0WmtoaGJYYxAB",
            "text": "Really good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sNWJrcDBUbTFET1ZkVVdWUkVaa0ZzT1VKSWMxRRAB",
            "text": "A place with excellent food and lots of heart. The interior is a little cramped and gets too dark towards the back for my tastes, but I love eating here with family and friends"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swMVNXVmtTRnBNZFhjeE9GOVhZMjFEY1d0dlQwRRAB",
            "text": "After some people in a neighboring group chat recommended Betty's as a \"family friendly\" place, I thought to check it out with my kid, after a morning activity on a Saturday. At the door I bumped into another family of 4 that were in that same activity, and the host put us kinda together since the place was completely empty. At some point, because our waiter apparently was leaving and wanted to close our order, they asked us to pay, to which I did of course. I said I will be paying with a card, and they came with the machine, no receipt whatsoever, and showed me a total amount in the screen. At no point they mentioned anything about 'large group mandatory tip of 20%', that was already added and I was pleasantly surprised when the 3 percentages options of tipping were so low on the screen. I thought to myself - 'finally, a restaurant that pays their workers a living wage, and a truly affordable, family friendly place, just as the people in the neighboring chat recommended'. So with this in mind, I happily put the highest, (10%) as a tip, and later they came back with the receipt which I put on my pocket because we were still eating. I was shocked when I realized that in the end I have given 30% tip, for a 'group' that was not intentionally meant to be a group to begin with. These are the kind of scummy, stealing tactics that only unethical businesses do. It's appalling how they so casually get to do these kind of things. When places find the opportunity to tax you more and 'punish' friendship, and neighborly cordialness, you know that this is the opposite of a 'family friendly' place. I guess they want us all to be eating miserably alone and they penalize you if you seem to have a social life or a tiny bit of fun. Obviously never going back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213eGFsTjRVR0ZpWjBKYVFVcERSRFZNVlhsSGVsRRAB",
            "text": "OMG, BEST HIDEN GEM in New York!! Everything was amazing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sSlFVdGZjV2RxT1RsR01qRlJia3ByZW1KNmRrRRAB",
            "text": "Food is 10 vibes are 11"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ndFVWTklTVFJqVEVWTmMwUm1iMVZpUzAxUGMxRRAB",
            "text": "THIS PLACE IS THE BEST"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210amFIUjRhR2xYY0dKT0xYWkJTbEJGTjNsQ2VVRRAB",
            "text": "place is the bomb."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUGFVZERObTVJUldweFJWTnlNMkp5Ylc5RlVsRRAB",
            "text": "This has been my go to spot on the lower east side for a few years now.  The vibe is always upbeat and sane and great. Close enough to dimes Square to have some spill over without the pretense. I like the steak (and that there’s also a side steak on the menu!) but I’ve tried lots of their things before settling on. Seems the staff are a great friends and that friendliness is infectious.   Nice to have a full bar and cheerfulness."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZNFNtUmljRk5aWWxwNk4yeG1MVzVaUkVWeWJVRRAB",
            "text": "The waiter said to my table “you guys made us loose a table” and told us to keep quiet disrespectfully"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psSk5uQnZaR1ZXYlVWaFVuZGpNMHR0VG5BelUzYxAB",
            "text": "Good neighborhood place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WU1dWbHFWWEkyU0ZWUlFVZFBSRFpsZFdnemVFRRAB",
            "text": "I encourage everyone to visit. The dishes please and the setting complements them. The dishes are perfectly executed and service consistently impresses. Employees provide outstanding service with authentic smiles. I'm already looking forward to my next visit."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1WmQxbDNhelJvWTJabmVIQlVNbUprVldKR1dWRRAB",
            "text": "we were walking by and found BETTY. food and service A+. we’ll be back!! ((ube purée 😍))"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KaVdVNVhSRFU1UW5neWVIbE9ZMnRrZVhseVNsRRAB",
            "text": "simply the best"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SaU4zUk5URGRyWkVsTWVUUm9VbEpZWjBSUVMzYxAB",
            "text": "food was very tasty\ntulane darius and chloe were great\ni will be coming back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taYVMyRkpRVTB4VTFCVVRVOXNVRkkzYjE5blRsRRAB",
            "text": "Great good and great service!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toUVRVUjNhVlE0YW1WYWN5MUVkWE5YVG5KMWMzYxAB",
            "text": "Lovely local dive with good quality food at reasonable and affordable prices. The beet hummus is a delight. It's so smooth. Lunch combo is a good deal fir a small lunch."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxRFRGWmFOWFZETm14SWFrUlhWVXBxYjFwcFlXYxAB",
            "text": "Great Food at reasonable prices."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVelRucERZM0J2UVdRdFZIUkxSa2xqUVdkVGNrRRAB",
            "text": "Found Betty just walking by after the fireworks. Thought it was just a  \"Hole in the Wall\" to grab a quick bite. Man was I wrong. Ya it's smallish, but the wow the food and music I actually liked. Great friendly staff. The Salmon was incredible. Very reasonably priced in my opinion. Definitely will be back when I'm down that way."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vME5VTmFUQzFyVW5oWlpXdENhSFJVT0VSRlNYYxAB",
            "text": "Had a great visit here.  Darius was our server and was excellent.  Bloody Mary's were delicious and great English Breakfast.  Food came out hot and rather quickly.  I highly recommend this place for a peaceful brunch/lunch."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxMGVieGd3RRAB",
            "text": "크루즈를 타기 전 브런치를 먹기에 아주 좋았습니다. 실내는 아기자기한 느낌이고 직원은 적당히 친절했습니다.\n11월 중순에 방문했을 땐 바로 앞에서 공사 중이었는데, 공사가 끝나고 날씨가 좋다면 바깥 자리에 앉아서 먹어도 좋을 것 같네요 :)"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbHVyS09REAE",
            "text": "관광객이 아니라 그주변에 사는 사람들이 즐겨찾는 로컬 맛집같았어요. 넘 좋았어요. 깔끔하고 조용하고 모던한 낮술집이랄까. 커피 샴페인 와인 위스키 모두 마실 수 있어요. 화장실도 깨끗. 페리타기전에 30분 정도 머물렀는데\n2시간 정도 머물며 와인, 샴페인 먹고싶었어요. 서비스도살짝 주시는 센스쟁이 주인장 감사했어요."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nNU5UZHlSVzQzY1ZCWFEzaEZNVGc1WkZSd1MwRRAB",
            "text": "Came here for brunch and it was delicious. I got the English breakfast and the tomatoes were perfectly seasoned and toasted. Nothing on the plate felt heavy and was pleased with the portion size for the price of the meal. I felt satisfied but not stuffed which was nice on such a hot days. My friend and I did not eat outside but I would be open to that in the cooler months. I forgot what my friend got but they really enjoyed their meal as well. This was my first time and I would definitely recommend this to a friend and I would come back myself if I’m in the area. I liked how it was no frills and the food didn’t take long to come out either."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQVGY1WVdvN2IyM0pnEAE",
            "text": "**First timer review**\nSsssooooo, what had happened was. We were gonna stop at another restaurant but the wait was 2 1/2 dang hours!!! So the hostess suggested Betty. And boy lemme tell you she didn’t miss!! Nice little spot. Mellow vibes, soft lighting, friendly staff, and simple but effective decor. Prices are very reasonable,the food came out fast, and to perfection. A definite recommendation for anyone local or visiting the area."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3ZzUtQVBnEAE",
            "text": "Great LES breakfast spot! Came in on Wednesday at 11AM. No wait, were seated immediately. Staff was very friendly and welcoming. The ambiance of the place was comfortable as well. My friends and I all got the \"You Betty Be Ready\". Classic American breakfast, you get a little bit of everything with this plate. The meal was yummy, my favorite part were the whole mini roasted potatoes :) I heard the waitress talking about how they are also a bar, so I'll have to be back to check that out."
        },
        {
            "date": "4달 전",
            "language": "nl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMbWJuT2pabXFlLWhBRRAB",
            "text": "Met z'n 4en hier gegeten en genoten. De crêpe, pasta en de ribs waren heerlijk en de bediening heel gezellig. Je zit er misschien niet superleuk maar het past bij het hele plaatje."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NDlLZmRnEAE",
            "text": "A friend and I visited BETTY on our trip to NYC. The atmosphere is great and the staff were great too. We ordered the steak and eggs & the “you betty be ready”. We were pretty disappointed with the portions for both meals, especially for the price. The food tasted okay, nothing super special. The pot of tea presentation was super cute. Overall, I’d give our experience a 3.6/5"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPbjlnNml0cHBpQ2p3RRAB",
            "text": "I never do this but I just had to. The food, the service, the whole vibe, just so cool and so comfortable and the food is great and everyone is so cool. The tall man w the braids is so charming and nice! Everyone listened and had charming things to say, it’s just the best way to spend an hour or two. Get the fried chicken bites, a particularly polite blond waitress recommended them and, well, I got two! Oh and the music is so chill and cool, and then I got the pie. Yum!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJblptZVNBEAE",
            "text": "This brunch spot is such a gem! Loved every dish that we tried. The flavours were impeccable. Will definitely be coming back :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5X2ZTZGlBRRAB",
            "text": "We ordered two lunch specials: Salad and BLT sandwich, and French onion soup and BLT sandwich. They had an outdoor seating, which we took because the sun was shining. Menu was quite extensive also have dessert and drinks sections. Service was a bit slow in the beginning, but after we ordered, the pace was good. Friendly service and reasonable price. Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMdnRuLWJZdjZ5OTJBRRAB",
            "text": "Delicious breakfast!  The service was excellent!  Will definitely be back when in NYC again.  Recommend 100%."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQX2gtcDZYNW9tTW9BRRAB",
            "text": "love Betty's, reasonable prices and some really good dishes. The hanger steak is great, even if it's sometimes over or undercooked. Brunch items are great, everyone working there is always chill. They make a really nice teapot as well\n\nI notice the website doesn't have the cocktail menu on it, I was curious what was available around brunch time, but I couldn't find it. I hope they'll see this review and add the full drink menu to their website 🥳"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5OTZpNkhBEAE",
            "text": "I’ve had this restaurant on my list since last year. I was so excited to finally go for breakfast to try out the pancakes. When I arrived to the restaurant which was before noon, it was pleasantly quiet. I was able to sit anywhere I wanted. My waiter provided excellent service. When I saw the menu, there were so many things I liked. I was a little surprised how reasonable the prices were. I had to try the buttermilk pancakes. I ordered a side of grits and a side of scrambled eggs. I really like when restaurants lists the coffee drinks on their menus. I ordered a cappuccino. It was delicious! The pancakes were light and fluffy.  I loved how they presented the grits. It was served in a cast-iron skillet. The grits were nice and creamy. My entire meal was delicious. I was so happy to hear they serve breakfast all day. If I wasn’t stuffed, I was so close to ordering a slice of the banoffee pie. I love dulce de leche and that’s why I wanted to try the pie. Next time. Overall, this is a very nice restaurant. I had such an enjoyable meal and experience and I fully recommend this restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxbGRlYTd3RRAB",
            "text": "Betty was a great find.  It is a neighborhood gem with tasty dishes and cocktails.  It was opened late which was great for us as we just flew in from the west coast and wanted a nice meal after a long day of travel.\nWe had the fish green curry, henry street soft pretzel, sauteed shrimp and cauliflower.  We paired our dishes with the William Seward's Basil Gimlet, Hot Toddy and Manhattan.\nService was great, ambiance was definitely NYC chic and would definitely return to Betty's."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREbzd2WkxREAE",
            "text": "Place is giving Scandinavia, designey plates, good playlist. Interesting dishes. The tofu sandwich was great but a few suggestions: slice the bread thinner, it's a lot of bread especially toasted. Side of fries is a bit much, would recommend side salad."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaOGZHZGZnEAE",
            "text": "A beautiful hole.in the wall restaurant. The food was superb in both flavour and esthetic. Would 100% return and recommend.\n\nAttached are photos of the crispy duck, hanger steak, and sweet corn risotto."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1enZMM3JBRRAB",
            "text": "10/5! Happened upon this place and it was one of the best dinners we’ve had in a long time! Our host & server William was lovely, vibes were casual and cozy even. We ordered 5 apps, 3 entrees, 2 desserts and some cocktails. Every item was delicious and there was not one thing we didn’t enjoy. Compliments to Chef Abby! Can’t wait to go back! Recs: Autumn Salad, Brussel Sprouts, Crispy Duck, Shrimp & Grits, Duck Fat Potatoes, Honey Lavender Ice Cream, Basil Gimlet cocktail. Don’t forget an after dinner coffee!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLRGM0TW5QcS0tSUlREAE",
            "text": "One of my favorite restaurants in the neighborhood! Everything I’ve tried so far is amazing and the service is great as well. Here are some of my recommendations:\n\n- Drink: Lavender Bees Knees 😍\n- Appetizers: Beet hummus; crabcakes\n- Main: Steak au poivre\n- Dessert: Banoffee pie (with banana and dulce de leche; it’s perfect)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINEpTbnhRRRAB",
            "text": "Had the hanger steak Blue Plate special. $20 for the beef, mashed potatoes, greens AND glass of wine is a steal. Ordered medium rare but the meat came out quite raw. Loved the chill ambience. Service was nonchalant."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRM3JiSzdRRRAB",
            "text": "food was great, could be a bit more flavorful but still tasty overall. service was fine but the interior of this restaurant is so charming and chic. would be a nice first date spot in my opinion. we saw the head chef (abby) sitting with a table with a glass of wine towards the end of the night which i loved haha, super cosy. we got the crispy tofu sandwich, the southern fried chicken sandwich, mac and cheese, and the banoffee pie which was really the star of the night."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYOVA3bjJBRRAB",
            "text": "The waitress was really kind, food took quite a bit to come out (30-40 min), but the food is very high quality. The bacon egg and cheese with the hot sauce is amazing and the french toast is to die for. The berries were really fresh along with the lemonade. 👍"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncllHcTZBRRAB",
            "text": "Have been here twice now and it seems consistent.  Excellent food and service, these people are especially nice.   We had an infant along and they did everything to accommodate, right down to the high chair.   The menu is simple but solid, I had the Betty Burger, medium rare and it was!  Very tasty and fresh, fries were delicious.  The roasted cauliflower with a unique sumac sauce was excellent as well.  My partner enjoyed a very crisp gin and tonic that she raved about.  The service here is impeccable and the atmosphere is laid back and comfortable.   We will return, dying to try breakfast!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCOHNPYjlnRRAB",
            "text": "This is one of my favorite restaurants in LES. Every single thing on the menu is incredible and honestly has no business being so good. Great place if you want breakfast for dinner or brunch"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1Z0t1Z1hBEAE",
            "text": "Came in Sunday morning with a friend and had some delicious food, overall a good price and nice service. Steak-n-eggs were delicious and well portioned, we shared a side of grits, and the French toast. Smokey (Bagel) was good but small portioned"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJejZqNm5BRRAB",
            "text": "I ordered crepes with mushrooms and onion with a side of eggs and sausage! The food knocked my socks off. My wife had pancakes and they too were delicious. They even have a full bar. Thank you Betty for a delicious meal and service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0elptOVZRekl6YVcxQ2RHZGxWMWRaTnpodGQyYxAB",
            "text": "People kept talking about BETTY so I went to see for myself. Food this good usually costs more. The taste left a good impression. The employees strike the perfect balance of attentiveness. Everything meets high standards."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvLWZDNy13RRAB",
            "text": "As soon as we arrived we were greeted and sat. Service was great. Food came out right away. Food was delicious. Staff very friendly but the best part was the fried apple pie, it was delicious and freshly made. Definitely recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGcFo2cllnEAE",
            "text": "Pleasantly surprised by this place!  Food was good.  Service was nice.  The ambiance was just the right vibe!  Definitely check this place out if you are in the area!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMW9PWkhREAE",
            "text": "the hanger streak and ice cream with pretzel bites were exquisite. wait staff was very friendly and attentive!"
        }
    ],
    "reviews_count": 79
}