{
    "name": "Ernesto's",
    "place_id": "ChIJyaTH_pRbwokRp4SVDyxdALw",
    "grid": "MN3",
    "address": "259 E Broadway, New York, NY 10002, USA",
    "rating": 4.2,
    "user_ratings_total": 540,
    "phone_number": "(646) 692-8300",
    "reviews": [
        {
            "date": "1시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poaFUzTk1SakI0VVhkS04zVndlVVZuV25oNmNsRRAB",
            "text": "This was my husband and my second time at Ernesto’s. We were in the neighborhood and decided to stop in without a reservation. We happily sat at the bar (we prefer it anyway!) Our second time was better than the first! Our food was delicious, our bartender Ernesto (no— not the namesake) was attentive, and our wine was delicious. Make sure you ask for Jake the sommelier— we love wine but don’t know too much about Spanish wine. He was able to match us with the perfect bottle (he also had us laughing the entire meal.) Cannot recommend this restaurant enough. We’ll see you at Bartolo soon! -Diane"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5M01HNHllbXhTVUc1eVgxSkNSa2R0VDFKNE4zYxAB",
            "text": "food and vibe is amazing! feels sceney without without being obnoxious, menu is always changing which makes every visit exciting! also great for a last minute weeknight res"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xweGRWUk1RbUpzYW1kc01WRmlSM3BsTFRKQ2MyYxAB",
            "text": "I found this place to be comfortably above average. Staff members were watchful and responsive. The kitchen delivers excellence without high prices. This restaurant offers uncommon quality. I need to revisit to give them more stars."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KeE1qSkdPVkphWlZST1RESmtlbFJ5Tm5sd2VuYxAB",
            "text": "This excellent place somehow stays under most people's radar. The amount on your plate shows good value. I'm completely enamored with this restaurant! The staff showed good manners and I was completely satisfied. People who welcome food experiments will enjoy this spot."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwM01EaGFYemRSZUhZNVNVWk5kRVJ0YVRGWFYyYxAB",
            "text": "Had an Uber pick me up from here...."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wTFRITnRORTlTT1MwM2RUQmZNakpaYzBzeFQzYxAB",
            "text": "The ambience is incredible, and the food and service are even better. Robin made excellent suggestions on everything from tripe to sherry and was just such a delight. Will definitely be back"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ORWFIWjBSMFpGUkVrMGExSXpXR05sTjJkS1ExRRAB",
            "text": "A pleasant room and friendly staff but the food was up and down and the experience did not merit the bill. The highs were the croquettes (but $14 for an order of 2!) and the morceilla (but $20 for 4 pieces each 1\" long and topped with a quarter of a piquillo), the low a rabbit rice (this time a generous portion) that had a single loin instead of small pieces bone in rabbit—I was in Murcia where this is a regional specialty in May— and that instead of being \"meloso\" was overcooked and soggy. Very interesting but also very overpriced wine list: I looked up pricing on the bottle we drank and, on the list , it's close to 5 times wholesale."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aamVtaG1lbTlRTFRGdmVFRnlOMDlPZHpsVVFuYxAB",
            "text": "a beautiful space to have dinner and an even more beautiful meal. Not to mention the wine program is unrivaled. I’ve been to a lot of great restaurants around the world and this one certainly takes a spot at the top of my list."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKRVZrbFJaVGRZTlVGUWJEbExSbTFpU1RkVlRtYxAB",
            "text": "Really enjoyed our dinner here! We sat at the Chef’s table and loved watching them prep all the dishes. The small plates were all excellent and I would come back just for a dinner of pinxtos!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KU1lrTjBNa05KYmw5UkxXYzBPSHBuT0RKUk9VRRAB",
            "text": "Fine if you’re looking to burn good money on underwhelming food.\n\nFor the price, I was disappointed.\n\nThe sommelier was nice but a bit too casual, called me a few pet names which was sweet but also inappropriate. The waitress also kept trying to upsell us, and was similarly casual in her demeanor. We were a party of three and the waitress offered to add a 3rd serving, which added an additional 50% to the price of the dish we found out when we got the bill.\n\nNearly everything had way too much salt in it. We got the ham croquettes, which were the highlight of the meal for me, were so salty I had to take breaks eating. The iberico ham steak was good but the dish doesn’t come with batatas bravas as promised, but instead french fries topped with roasted bell pepper. Unclear whether the chefs have actually been to Spain. The salt cod was drowning in an overly starchy, herby yet flavorless roux and came with 3 sandy clams and seemed like it hadn’t been soaked for long enough to osmosis enough salt out. I asked for bread and they never brought it. The octopus salad was mushy and the onion and bell pepper in it were completely raw. It tasted like liquid smoke to me, and the sherry vinaigrette was very strong. The octopus was cold, too.\n\nI also told staff that I was celebrating my birthday and they didn’t offer any kind of celebratory gesture - usually restaurants will give a comped dessert or a small amuse bouche but after our meal, the waitress came to tell us that they were sold out of all their desserts except for their grape sorbet. Not complaining that I didn’t get something free, but for $90 a head, I think it would have been a nice gesture.\n\nI don’t know if this is customary for this restaurant but I’ve dined at some decently nice establishments and comparatively, this one did not meet my expectations."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwZmVYWndSRzFWYmpKWlEzTktSa3RwVTBsMVZXYxAB",
            "text": "Good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCMVVUTlVNa3RwZURGZlFqTnpTRTVCWlZwSU0yYxAB",
            "text": "Great food, drinks and wine."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSYVRqUnVjRVZsTWxWclNGOVpSV1o1UkMwNFNsRRAB",
            "text": "Food’s not good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbmNVbzFkVVJzYTJ0cWVFMDBRMmd3ZGtGVFluYxAB",
            "text": "Wow one of the best meals I’ve had in the city by far and I’ve eaten at Masa,  le bernardin and frevo etc. great food excellent !! Totally underrated!!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CelJEaEtNVVZrTTE4eWJsVlpaa28xUzA1Q2JtYxAB",
            "text": "Best Spanish food in NYC, no doubt about it. Staff is really nice and the food is so authentic"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2todmVqRXRka1F5YWpWSWFXTmlSa3QxU1hSaGVFRRAB",
            "text": "Amazing food. First time trying Basque food and definitely will come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNlozQTVVSEYzVUV0TkxWUlRSVlpuVTBKclJWRRAB",
            "text": "Lovedddd this place. The menu changes almost daily so you can come and try something new all the time. The drinks were amazing and the extensive menu offers a great variety of Basque food. Ofc can’t skip the cheesecake at the end."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKVFYxbzNkVEpPY2tsbWNqWXdSWE5OVGtGZldrRRAB",
            "text": "Our friends insisted on taking us here while my husband and I visited the city this past weekend. We usually don't frequent places like this; they're too trendy, usually too loud, and the decor is all the same. Track lighting in the kitchen, along with tables that are too close together, and a server with RBF? Dime a dozen. Despite this, I went with an open mind (pinkie promise, I did), and I still left disappointed.  The food was alright, some of it was really good, but it was dampened by the mid service. Our table didn't feel very welcomed by our server nor did we feel like we had an exceptional experience overall. If a restaurant charges this much for such small plates, I expect top-tier service. Who's in charge here? And more importantly, why are they okay with guests leaving feeling like they’re just another check to clear?"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jd1ZUUmpUVlV0WkRoMGExTnlTVVJXV0hVMFpWRRAB",
            "text": "Bad overall experience would not recommend. Rude"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xNFYxaFhUMWxxV2xWeVZVdzVVemxCTlVsSk5GRRAB",
            "text": "We came to Manhattan for the weekend and tried to fit in as many recommended restaurants as we could. I am totally disappointed we spent time and money here.  The sommelier seemed like he rolled straight out of bed and into the dining room and behaved far more pompous and sales-y than someone as rumpled should have the nerve to. Food was nice but the experience just yuck. Some of these employees must be new to hospitality, no time for it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ad1NrbGlUbTVtWTB4emEwZDJhRFV4ZDFNeFoxRRAB",
            "text": "Charged me for a cancellation fee after I ate at the restaurant. AVOID RESERVATIONS HERE"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nNE0xZFBXWEpQU2xsVFJEUkZhVFJIYWpaWGQxRRAB",
            "text": "Delicious.  Was seated at the bar that watches the cooks create culinary master after masterpiece."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMlVFUjZSRTFsWW5BM2FGVnNiV3RNWlRaTFZsRRAB",
            "text": "Potentially one of my best meals ever anywhere! Service was top notch, everything was perfection"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCclZrWTRTbDlTWVUxYWRHTnZORXQwUkhwalUxRRAB",
            "text": "I feel satisfaction in having discovered this place. You'll appreciate the perfect mood. The service quality matched the food's innovation. Exceptional tailored attention. This venue maintains high standards."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTU9XOHhXRVJZT1VWblpHMXZTM1pWZDNwNlMyYxAB",
            "text": "- Suckling pig meat is a little dry tbh.\n- Tapas is ok but overpriced compared to same level of Spanish restaurant in town.\n- Many bugs if you eat at the outdoor patio. I have to wave the whole night to keep the bugs away.\n- Waiters seem unhappy or tired from the face looking."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVlZ5MVNWSEpWUVV0UFZETjBRbU5pUVRGVmVVRRAB",
            "text": "We've been a few times and always loved it. My favorites were all the shrimp dishes. The staff is lovely and we can't wait to go back again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMYmdoc2pFMmR2YVJREAE",
            "text": "The restaurant feels like a secret shared among friends. I was impressed by the size of my meal. Warm, amiable, kind, professional. This spot has visual appeal and good energy. Overall great place, check it out."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQS2FzOWZiXzh2YmNBEAE",
            "text": "Amazing atmosphere. Incredible food.\nDefinitely try:\nGambas (shrimp)\nGildas\nTortilla\nMatramonios\nCochinillo\nAnd the cheese cake!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wV09FTmFURGRxZGxJdFdsVlRRVkoyVWtWWWRtYxAB",
            "text": "Perfect spot for a drink and a few small bites.\n\nWe went all-in with a full dinner at the chef’s counter. The service was excellent, especially the sommelier, who offered fantastic recommendations from a well-curated wine list.\n\nEverything we ate was good, with the smaller plates standing out as especially delicious and creative. Sitting at the counter, we kept spotting other small plates we wished we’d ordered.\n\nThe entrées were decent, but nothing to write home about.\n\nIf I come back, I’ll definitely opt for a table outside and stick to a more snack-style experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CbVdFWnhXbk41V0d3NGFWbENiWE52TUhkM1pWRRAB",
            "text": "Sat at the Chef’s counter in the smaller dining room. Very large and interesting wine menu with lots of Spanish wines! Love the smaller bites, I think the traditional options to start such as the tortilla, croquetas, and jamón are the best options over the mains. I would definitely come back to sit outside and enjoy some wine and smaller bites!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsQmRUVk9UWGhTY2pJd2RGaE5aV1phT1MxUVVWRRAB",
            "text": "Tremendous food - did taste much like it does in Spain. Service was attentive and knowledgeable, also manager was appropriately witty. I will return"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNWDJ0cEthb2NYMU9BEAE",
            "text": "Wow, just..wow. My friend made us a reservation because she had heard good things. We were absolutely blown away! Our server, Laura, was polite, patient, and professional. Her food suggestions were spot on. Everything we tried was a 10/10. The service and ambiance were perfect. We asked about a bottle of wine and the Somm Jake was the cherry on top of the...flan? We don't know much about Spanish wine but he talked to us on our level and made us so comfortable. The wine he chose was so spot on. He made sure to come back and check on us and we had some great conversations and laughs. I've never been so compelled to write a review but couldn't resist sharing about our perfect dining experience. I can't wait to bring some new friends here. Thank you Ernesto's!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKWDBuXzdzd2MzOVlREAE",
            "text": "Honestly a wonderful place. The food is great, the service and vibe is fantastic as well. Definitely don’t skip the Spanish tortilla! I will definitely be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VPNzYyNVdLcUpDTnl3RRAB",
            "text": "Food was so salty and seemed a bit overpriced"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNVGtnTWFyX0xibk1REAE",
            "text": "We went to Ernesto’s based on a recommendation from a friend. The whole experience from the variety, uniqueness and quality of the offerings, to the ambiance and the attentive and professional staff were  memorable. They also had great wine selection. The manager, Rachel, took special care to make everything was just perfect and guided us on our choices. The managing director, Robin, came over to chat with us and delighted us with her charm. I would recommend this for any special occasion without hesitation. They will not disappoint you. Five stars !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMcnNodFBwc055RUhnEAE",
            "text": "Very cool vibe, great food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMmFpZ05nEAE",
            "text": "I really enjoy their wines and one of the few restaurants in the area. It is on the higher end considering the location."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3aXBhSWNnEAE",
            "text": "A great Basque option in NYC. Location was a challenge for me but food was unique as only Basque food can be and worth the effort. Clean and modern setting with excellent service made it a winner. Very pretty."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURna3Nld05nEAE",
            "text": "Long time fan but finally visited for the first time on my birthday.\n\nThe staff was amazing and made for a really really fun dining experience, especially our server Matt and (please forgive me for not remembering) our beverage director who helped us pick out some lovely wine.\n\nI was cranky when I came in and left extremely happy.\n\nDelicious food, great vibe, and exceptional hospitality. I’ll be back for it all very soon."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneE1HRUR3EAE",
            "text": "I will be dreaming about this dinner! This is some of the best Spanish / Catalan I’ve ever had."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBa1pxQk5BEAE",
            "text": "I love Morcilla, the flavor was good, but toned down. The home made chips and ham was just OK. The magret duck was very, very good."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfazhPU2tnRRAB",
            "text": "First time going to a Basque restaurant and I was so so happy that I chose Ernesto's! The food was out of this world (big props to Chef Ryan Bartlow); the Bikini Hemingway was a standout for sure, but the pork and duck dishes my friends and I had for our entree really solidified the experience as one of the best meals I've had in this city. And to top it all off the wine pairings recommended by the Beverage Director, Daryl Coke, were both wonderfully unique and complimented the flavors of the food so well. The atmosphere was really lovely - simultaneously calm and enlivening (perfect for whatever occasion for which you'd come to visit). Highly recommend family style dining as well as there's so much to try and everyone deserves to taste it all ;)"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfamRldXFnRRAB",
            "text": "Here's the thing. When you're hungry, you want to EAT. You shouldn't have to pay $28 for 2 shrimp, 3 calamari, and 2 oz of cod for what you thought was a plentiful seafood meal. Not to mention the $6 for bread... because who's ever paid for bread at a restaurant? If it weren't for the bread, we might have starved!  The beef cheek was very good. And so was that seafood dish. But the portions were disappointing. The duck was raw and flavorless. The complimentary champagne and atmosphere were delightful and entertaining. The $16 cheesecake was, well, not worth $16... Otherwise, we had a wonderful evening"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfLVBfYmRBEAE",
            "text": "The food was good. Service and atmosphere was great"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMGRES1lBEAE",
            "text": "Food's alright - underwhelming given so many high ratings. Wouldn't really recommend, will have to find someplace with good Basque food. Service was alright. Unfortunately, they tried to seat us at the bar even with a confirmed reservation made days in advance. They then magically found our reservation when we pulled up the confirmation email."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfa01iMVJ3EAE",
            "text": "Following its literary namesake, Ernesto’s presents a clean, well-lighted plate. The flavors are pure and crisp, but always reminding you of the earth and its soils, its climes and seasons. Get the tiny chorizo sausages, piquillos rellenos, and gildas. Ignore Pete Wells and two servings of the potato chips with Iberico ham (the deeply rich mixture of fats with oils makes you wonder why you’ve never thought to adorn cured meats atop your kettle chips). Winter is always welcomed because it means the crosnes with truffle cream is back on the menu. Mainstays like foi gras duck and the in-season verduras always call you back."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmeDYtOUNREAE",
            "text": "Restaurante con inspiración de cocina vasca en Manhattan. Se agradece que no intenten reproducir platos típicos si no reinterpretarlos, es un gran acierto, muy rico y mucha calidad, un gran homenaje a la cocina vasca pero con su propio estilo. Y ojo, nada caro para el nivel neoyorkino, en otros lugares que se limitan a intentar copiar platos españoles con más ínfulas de grandeza te cobran el doble."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbmQteGNBEAE",
            "text": "Paletilla de jamón ,  en carta denominado jamón paletilla 5 J , se le escaparon 4J , croquetas muy buenas ,carrileras espectaculares , sobre el resto; Pintxo de tostada de gambas era de langostinos y cocidos , el resto ( bacalao , bikini , ventresca , callos )nada especial que reseñar.\n\nUn restaurante muy sobrevalorado para mi gusto , lo único vasco que tiene es el menú en euskera.\n\nSi lo que buscas es comer como en Euskadi (salvando las distancias ), no lo recomiendo."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NDdpLXNRRRAB",
            "text": "Chef Ryan Bartlow and his team are unquestionably committed to culinary excellence at their restaurant Ernesto’s at 259 East Broadway.  My wife Catherine and I flew into New York in the morning, enjoyed tea at The Te Company and dined at Ernesto that September 6th evening.  We had no problem getting a table at 5:00 pm.  We will forego with the accolades describing our dining experience because readers must come to savor in person Chef Ryan’s authentic Basque Country dishes and appreciate the dedicated service from the outstanding restaurant staff, in particular, Ella, Robin and Robbie.  Catherine and I felt we were long time friends with everyone at Ernesto’s after just a few minutes.  The food took the evening to the next level.  Here was what we had:\n\nPintxos!\nPintxos matrimonial\nCroquetas de gallina\n\nEntradas!\nCallous de Joan Madrid style tripe\nBikini Hemingway txistorra, queso, shrimp, pan de Cristal\nTartaletas de Txangurro San Sebastián style crab tarts\n\nPlatos Principales!\nRape a la Parrilla grilled Rhode Island monkfish, pastas panaderas\nCarrillera de Buey red wine braised beef cheeks, pomme purée\n\nThe wine pairings were perfection.  Thank you Ella!\n\nOne can imagine Hemingway walking through the doors of Ernesto’s to his favorite table (the restaurant was named after him) to write a few more lines to a short story, and to greet Chef Ryan and enjoy his interpretation of Basque Country food, wine and culture.  That is living life well."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2eGUtT2ZBEAE",
            "text": "We went to Ernesto’s for an event where they served us 5-course Tasting. The inside was rather dimly lit, with brick walls and beautiful bar as the main feature. It had that nice cozy, romantic atmosphere.\n\nWe started off with a couple of cocktails. We ordered Hell in a Hand Basqu-ette and Dicha del Higo. Hell in a Hand Basqu-ette was delicious with a nice kick to it, without being too spicy. Really nice drink. Dicha del Higo had amazing black fig flavor, so good!\n\nFor food, the first course was Tartaleta de Txangurro, which is a crab tart. It had so much soft juicy crab, and nice flavor from the leek. Tart made it easier to eat handheld, so good!\n\nThe second course was Morcilla con Pimientos, which is their housemade Blood Sausage. It was soft and juicy with a nice crunch. Pepper that was roasted for 7 hours was amazing with sausages!\n\nThe third course was Pescado a la Brasa, which is a Grilled Monkfish. Monkfish was a bit on the tough side, since they are a more of a tight, firm textured fish, like a lobster. Nice and flaky, and really tasty.\n\nThe fourth course was Confit de Pato, a Duck Leg Confit. Duck felt ever-so-slightly overcooked, but the tangy sauce was delicious. I really enjoyed the silky, buttery pommes purée. The sauce was really amazing.\n\nThe fifth course was Tarta de Queso, a Basque-Style Cheesecake. I love Basque-style cheesecake, and I have made a few myself. It was rich, velvety, and delicious with a little bit of tang.\n\nThey try to source the ingredients locally and create dishes with simple yet high quality ingredients. We had a nice time here at Ernesto’s."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkczluUWtnRRAB",
            "text": "We sat at the Chef’s Counter overlooking the back kitchen and had one of our better meals in recent memory. Super friendly, attentive staff with good knowledge of the menu. We started with cocktails, which were a step above the usual manhattan fare and designed to fit within the food menu. We started with the jamon croquettes that had a light, crispy batter and enjoyed the crab tarts as a compliment from the kitchen — a must get when we return. The Bikini Hemingway is simple yet refined with a perfect balance of sweet and savory and hits you with a perfect balance of textures. The Galician octopus is reminiscent of a classic pulperia in basque. The sauce work on the cannelloni was sublime, but the pasta was a bit under for my liking — only critique on an otherwise amazing meal. Nice dessert selection too!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaUplbWtnRRAB",
            "text": "What a great dining experience, it was our first time trying Basque cuisine! Quite pricey, but the food was so filling! The seafood dishes were especially excellent, as were the desserts and sweets (the ice cream sold from the cart outside the restaurant was SO good). The interior is beautiful and the place has really cool vibes, much more hip and young than I thought it would be (it’s also pretty loud inside, like bar loud). Had an excellent time here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMXA3dXRRRRAB",
            "text": "Every year I try to hit at least one NYT 100 Best restaurants of the year and time and again, I keep going to the same kind of restaurants. This year though however, prompted by an article that popped up about the famous Gilda, I was able to narrow it down to Spanish cuisine from the Basque region. I’ve never had much Spanish food but w Josè Andres all over CNN promoting foods from his country, and w the glorious Gilda skewer that looked right up my alley, I said to myself “why not?” So venture I did on a 40 min ride to Ernesto’s in NYC heavy traffic and lord all mighty, traffic is a biatch in this city. Anyhoo, I get into Ernesto’s and immediately, I’m struck at their unpretentious exterior, so much so I accidentally entered via the side door. Once I recomposed myself, I was sat in front of the bartender per my reservations of 1 at the bar. I have to admit. Being seated right in front of the mixologist was quite felt nice about the whole thing. Soon as I was ready, I ordered the Gilda. An amazing concoction of anchovies, olives, and pickled intense looking banana peppers ish thing(?). What I didn’t realize was that the Gilda is not a drink, but rather an appetizer, lol. Take 2, I got me the Pintoxito, a floral gin w olive brine that comes w a Gilda. It was BEYOND divine. New fav drink alert! Now unto the food. This place had great relishes. It comes w the Gilda and the grilled shrimp skewers. The relish topping these items adds an intensely deliciousness to the items, I tried hard not to eat too fast. Then I got the crab dip. It’s something like the regular crab dip, but Spanish style. Imagine crab dip baked in tomato and herbs w an abundance of olive oil that comes with charred sourdough bread. That’s the thing about Spanish food from this region, it is HEAVY w olive oil. I also had the peppers stuffed w braised meat stewed to perfection, doused in olive oil. And for last meal, I ordered the sheets of Iberico ham, glisteningly oily accompanied with almost wet olive oil chips. Maybe a bit heavy on the olive oil? Who’s to say? Once I make it to Basque, I’ll find out."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDNy12THdRRRAB",
            "text": "Disclaimer: this review is based on the general Spanish food scene in New York City, NOT THAT IN SPAIN!!! TWO COMPLETELY DIFFERENT STANDARDS!!!!\n\nI would say that Ernesto’s is definitely the best Spanish restaurant so far in NYC, along with the improved food quality in Mercado Little Spain. The price is definitely at the higher end, so please keep that in mind if you decide to go.\n\nWhat I like:\n1. croquetas (you know it’s gonna be good when the bechamel inside is moist and oozy, the outside is crunchy and crispy)\n2. tortilla de patatas!!!! (This one is a must. The best tortilla so far in nyc I’ve ever had. The inside is oozing out when you cut it. Hella good. Gotta give this 12/10)\n3. Callos madrileños (no explanation needed)\n4. Milhojas (riquísimo!!!)\n5. Pork collar (ibérico pork, no need to explain)\n6. Gildas (this one is good, but needs more olive oil 7/10)\n7. Patatas con paleta de jamón (chips are crispy, reminds me of Spanish aperitivo)\n\nWhat I don’t like:\n1. Txistorra - outer needs to be CHARRED more, por favor\n2. Ensalada de tomate - Where is the salt? Where is the olive oil???\n3. Escabeche - we were expecting the classic escabeche (like the one prepared with perdiz)\n\nWe didn’t order pan con tomate but gotta say that it looks good. Service was ok, could be better and more efficient. We definitely did not appreciate the 20% gratuity added to our bill."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtdW9XeHZ3RRAB",
            "text": "Ernesto's is a hidden gem in the Lower East Side. The menu is made up of  exceptionally well executed Basque favorites complimented by a surprisingly well curated wine list and creative cocktails. Prices are quite reasonable for the quality of the kitchen, and the service is impeccable. Bonus: pick Chef's counter (an entirely separate space) for a more intimate, behind the scenes experience."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyc2JLTHZ3RRAB",
            "text": "The staff and atmosphere were lovely, kind and attentive.   The food was good but like others have stated, just not as memorable as I had hoped for the price point.  It was well presented but just lacked the flavor I had read so much about.   Still wish this place the best and would recommend others give it a try. I’ve only ever been here once - it could have just been an off night."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaeUlESGRnEAE",
            "text": "It's not often that we come across a restaurant that so completely excels in each area of food, atmosphere, and service. Ernesto's was a spectacular experience all around. We sat at the chef's table/ kitchen bar and witnessed all the culinary action first hand. Watching Sous Chef Mike expertly direct the kitchen staff in creating the evening's dishes was a definite highlight. Our server Kristin was attentive and made terrific recommendations on menu items. The anchovy starter was perhaps the best anchovy dish I've ever eaten. The croquetas de jamón were as good or better than what you find in Spain: crispy on the outside, creamy and full of ham and cheese sauce on the inside. The Hemingway Bikini sandwich was grilled perfectly, and full of cheese, chistorra sausage, and shrimp. We asked Kristin to chose our main, and her selection of the grilled duck breast over potato puree with a foie gras reduction was spot on. Can't wait to return!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbHFfbDlnRRAB",
            "text": "Nice atmosphere and friendly, smart waiters, but quick-fix unimaginative food at super-high prices. $14 for two pieces of toast with each two anchovies and a little garlic sauce in it! That should cost $3! And then the papers iberico: $32 for a pile of potato chips (house-made, but not distinguishable from chips from a bag) with a pile of ham on it! Easy and quick to prepare, no refinement. The morcilla con apricot ($14) was nice, but small and another example of something that can be made very quickly. Just fry some black pudding and present it on a coulis of apricot. The gazpacho with tuna tartare ($26) was nice, and our main courses of cod and octopus were nice, but each at about usd 40 apiece. Desert was cooked cherries with ice cream, very nice but again little sophistication for this price level. Including a cocktail each the bill can at 120 usd per person, 145 with tip. Worst value for money I have ever had in a restaurant. Go there for the atmosphere, not the food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5aHRhZ2dBRRAB",
            "text": "It was my 2nd time here, and both times have been very memorable dining experiences. It’s always a good sign when a restaurant is focused on its unique point of view on a specific cuisine. You can’t get this type of Spanish food anywhere…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLNVAta1NBEAE",
            "text": "Beautiful decor, exquisite food and great service! Every time I’ve come to Ernesto’s the food has always been delicious!  The menu changes with the ingredients in season, so every time I go I always find something new to eat. However, I do…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHMXFTVmNnEAE",
            "text": "Grabbed an early dinner table on Resy after someone canceled. Nice room, lighting and music. Service was professional and nice. Everything was well prepared and tasty, fresh high-quality ingredients. Prices are pretty eye-popping $$$ for what you get. Small plate of rice with 2 clams & 4 bite sized pieces of cod, $34; small dish of pasta carbonara, $34; 4 tablespoons of roasted mushrooms with an egg yolk, $35…and so on. The food was delicious but at $265 all in for a small dinner for 2, I have to say I felt kinda ripped off. The place was packed so I guess people are fine with the prices. I wasn’t. It was good but not “forget what you’re paying” good. Sorry."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLa3RPRHV3RRAB",
            "text": "Simply put, Ernesto's was fantastic. Lots of outdoor sidewalk seating. We arrived right at 5pm and were able to get a seat no problem--but this spot does fill up quickly, so I'd say reservations are recommended. The waitstaff were friendly…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURud1BhMUNREAE",
            "text": "A true gem. This crew has it all together. Amazing food. Perfect service. Beautiful lovely space. Hospitality is a hard business and it is beautiful to see it done so well. Highlights were the wine pairing ending with a Promesa Muscadel. (This a light PX vibe. The monk fish rocked. The duck confit absolutely spot on. The blood sausage was a beautiful plate and an adventure. Respect for the Basque regional style was a through line through each offering. Focused. Anchored. Enjoyable from start to finish. Much respect. Will be back for Sherry flights and more fantastic food. Big ups to Tasting Collective for the find!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1dnE3dE5BEAE",
            "text": "Food is a little too salty, like the tripe and pork. But the pork is really tender and the sauce is amazing, just slightly too salty. Bread with the tripe is a little burnt and hard. Croqueta is pretty good. Iberico and chips is olay; meat is good, but for the chips, they are extra thin, and some are not that crispy. Flan is okay, drink is pretty good. Kinda expensive. We sit in the open kitchen area where the chefs cook, but you can't see much unless you sit at the kitchen bar. You can download the inkind app through ernesto's website for $25 off $75."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1eF9IdFNBEAE",
            "text": "What a phenomenal meal! Ernesto's is one of the best places we've eaten in NYC.\n\nThe sardines on toast was probably the best we've had at any tapas place. The homemade toast was exceptional.\n\nThe Bikini Hemingway was a very fun dish and we're glad our server recommended it.\n\nThe Iberico and house made chips is a must get. The chips paired perfectly with the fat and salt of the ham.\n\nWe split the sea bass as our main and it was decadent. The fish and sauce worked perfectly with the potatoes underneath.\n\nThe Basque style cheesecake was great. Definitely recommend.\n\nMy wife said the flan was the best she's ever had.\n\nService was fantastic and we appreciate such a lovely date night in the city."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREam9XdGJBEAE",
            "text": "What an incredible find! Authentic Spanish food, meant to be shared. Everything we had was beyond delicious - can not recommend highly enough."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0dDg3d0xBEAE",
            "text": "Ernesto’s is great for a group or just to meet someone for a drink and snacks at the bar.\n\nThe cocktails are great - try the Spanish G&T for something light and refreshing or the very flavorful Padre.\n\nThe jamon croquetas, crab tart, and tripe are also delicious.\n\nThey change their menu frequently and offer seasonal items."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbElLUUdBEAE",
            "text": "We did a Monday night tasting Menu last winter and it was incredible. We will definitely be back for another dinner. Their atmosphere is not pretentious. But their service and food feels very high end. Everything we ate was seriously so good. We still talk about this meal."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2a2J1VUlnEAE",
            "text": "The tapas were delicious and arrived promptly. I liked that the flavors were distinct and the preparations very traditional. Nothing too surprising though. Unfortunately the cochinillo (pork) was really dry for my taste. The flan was well…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMycE5xR3RnRRAB",
            "text": "Lovely atmosphere, solid cocktails, and a good wine list. The food was okay, not worth the price.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlN05peWVREAE",
            "text": "Amazing dining experience in a seldom treaded part of town. The dining room is beautiful, and the service was top notch. Our server was charming, and very knowledgeable about the food and drinks.\n\nOn to the food, which was SPECTACULAR! It’s a wonderful combination of pretty presentation and banging flavors.\nI could have eaten 10 of those anchovy toast.\nThe ham and chips was superb, and I’m still how salt on salt was that tasty.\nWe also got the Bikini Hemingway, which is like a savory sweet grill cheese sandwich with shrimp and sausage.\n\nAll in all, this is a proper date restaurant, with beautiful ambience, excellent, interesting food, a very hospitable staff, and well priced all things considered."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2c2E2aUp3EAE",
            "text": "Atmosphere is pretty cool - feels just like Spain, especially the street dining.  But the food was ok, nothing special and the wine pour was chintzy.  Prices are expensive for the quality / serving size.  And the cherry on top is the undesirable location."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwN2FxSFRREAE",
            "text": "Fun neighborhood tapas spot. Delicious foods with open kitchen. Easy to get a table, with outdoor seatings as well. Good vibes. Highly recommend the Gildas, Bikini Hemingway and the arroz meloso de gamba roja."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhZ2ZPY0xREAE",
            "text": "Great ambiance and drinks. The Basque gastronomy was excellent. Pan con tomate delicioso with the duck confit. The cochinillo was really good. The pig ears and sepias were amazing."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NHN6MGFnEAE",
            "text": "Ernesto’s is a pretty good entry to the spanish/basque tapas scene. I wouldn’t say anything that i ordered truly stood out however, but its a welcome addition to the still lacking two bridges neighborhood food scene. I really liked my sangria. I think this is a perfect spot for stopping in for a pre-dinner drink or post work snack, it isnt too hard to get a table before 7/8pm on weekdays. Theres a sister restaurant next door which i think has a slightly different menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxOW9iMEl3EAE",
            "text": "Basque food done really well, with a flare.  Dishes were came out timely and were piping hot   Nice cocktail menu and overall service very attentive.  atmosphere, totally chill."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXczhxVm13RRAB",
            "text": "Finally made it here!. We sat right by the kitchen so could see the action. Tortilla was deliciously silky, steak was tender and dissolved, sausage was possibly my favourite. Creme caramel was spot on!\n\nWas a little disappointed by the lack of the (Insta favourite) chips and iberico dish. We were instead given a plate of (admittedly lovely) iberico ham and some picos (mini breadsticks). I thought txakoli was poured from a height to aerate the young wine?\n\nBit too pricey for my pockets so not sure I’d want to go back."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHNWZHZUJnEAE",
            "text": "Ernesto’s Cafe is a medium-sized cafe attached to Ernesto’s, a Basque restaurant.  the cafe has a nice clean classy interior and  gets tons of natural light. there’s seating, both, inside and outside. there’s newspapers for patrons to read while enjoying their eats and drinks. the cafe is a nice spot on the Lower East Side to grab coffee and/or a bite with friends and chat.\n\nstopped by and dined in here  a while ago bc i read an Eater article entitled “A Tribute to the 11 NYC Sandwiches That Are Getting Us Through the Pandemic.” was the sandwich good? yes. was it worth $12 + tax + tip? No. the sandwich is the “Bocadillo” — essentially a grilled cheese and salami with hints of honey. the savory sweet flavors and small soft roll is good and the sandwich pairs well with a strong coffee. why isn’t it worth $12—this is a tiny sandwich and will barely fill you up. if you want a tasty bite, this is a good choice but it is not a great option if you’re actually hungry. not sure why this sando is so pricy as it’s just heated up in a tiny oven behind the counter and just has a small amount of cheese and salami in it. coffee drinks, pastries, cocktails, and some other savory plates round out the menu.\n\nstaff wasn’t too chatty and chipper when i ordered and ate in. otherwise the service was fine."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2LVB1akhnEAE",
            "text": "Went to Ernesto’s tonight and all the dishes were fantastic. Hadn’t been back for a few years and loved all the menu updates. Excited to come back!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNaV9MRXVBRRAB",
            "text": "Wow! The food has only gotten more amazing and delicious! 😋 I cannot recommend this place enough!\n\nGreat new Basque restaurant in the LES. Definitely worth checking out! Great food and natural wines!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtbVl6UFVBEAE",
            "text": "A lovely place with a nice atmosphere and great service. The food was mostly very tasty but the Paleta Iberico was a let down. Soggy chips with a little prosciutto on it, not worth the money or calories. The chocolate cake was just ok, nothing special. Best dishes we had were the croquettes and idelgo salad. Drinks were good and strong."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbmVMbXBBRRAB",
            "text": "Really wanted to like it, but it was simply not good 😭had to actually send a dish back, which I have never done. Asked the staff for recs which IMO is usually the best way to order, but it did not help at all. Got a grilled tuna dish with a squid ink sauce and onion sauce thing idk it was not it. Had high hopes 💔 host was really nice!"
        }
    ],
    "reviews_count": 82
}