{
    "name": "Sami & Susu",
    "place_id": "ChIJRbqLkqFZwokR3E6d0zDKAko",
    "grid": "MN3",
    "address": "190 Orchard St, New York, NY 10002, USA",
    "rating": 4.7,
    "user_ratings_total": 273,
    "phone_number": "(646) 559-2856",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFMFgweEdTa3hxWmxWZmMyTmtTVzR3YVY5Nk9VRRAB",
            "text": "Everything was just A1! The service was great! And OMG the food was insane !! Especially the delicious dessert!! I would recommend this place for a romantic night or a friends night out ! It’s great for anything !! Will definitely be going back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdmRGSjJhbDh4UjNOd2RVZHFabWh4U0dWbmJYYxAB",
            "text": "I've been here three times now and if I had unlimited $$ I'd come every week. This is such a special little hidden gem. The food and cocktails are unique and divine and the service is wonderful The atmosphere is soft, romantic, cozy and glowy. The tuna is the best I've ever had. The beets with cheese and the dips are just incredible. And, try the cocktails...another unique taste experience. You will love it here!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxak0zaExSVE00WTJoMk0yNDJWWEkzTldreGFGRRAB",
            "text": "10/10 spot for a cozy dinner. Everything from the wine selection down to the food was delicious and the service was impeccable."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOc2VVUTRiRTU2UmtGemRYRlVOVXczU2twT1FsRRAB",
            "text": "A table in the front window open to the NYC street scene. Waiter was the best, very engaging and helpful around the menu. And very accommodating as we were without a reservation."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZeGJXSnVWRkpEVEZOeVFUTnNObFJPVEZkc1ZrRRAB",
            "text": "Fresh ingredients and a creative menu with plenty of variety. The harissa chicken and heirloom salad were highlights, and the pita bread came out warm and delicious. Friendly staff made the whole experience even better"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25seFNXSnNTWEoyZEhBM2JsQnpaRFJXVFhoS2NGRRAB",
            "text": "Walked in with high hopes, walked out stunned. Our waiter treated us less like guests and more like an inconvenience. Some dishes were good, others off-balance, one we didn’t enjoy at all, not that our waiter seemed to care at all. When we chose not to tip, he actually threw at us: “Please don’t come again.”\n‏Never in our lives have we left a restaurant with such a bitter taste.\n\nמבאס מאוד."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21weFlteEZiRmQxVTB0QmRGVjRjVVJPY1hGVVpGRRAB",
            "text": "If you’re looking for a casual low lighting restaurant for a date with a friend or a couple, this is a beautiful intimate restaurant. There’s music in the background, but not too loud and there’s not a lot of people. There’s seven tables and a few bar seating with delicious plates. Some highlights are the dip trio, tuna, carpaccio, roasted chicken, and the steak. Our host/server, Gabriel was attentive and amazing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCcmVsbG5jMjloYkV0RVRHSkpkR3BYYWpKWmJuYxAB",
            "text": "After seeing so many food bloggers say this was their favorite place, we were excited to try it.  We ordered the muhamara dip, tuna tartare and the steak with corn.  Everything was good, but we were not blown away it was just okay.  We were expecting Theodora good with a 4.7 rating and the reviews.  The dip was my favorite if that tells you anything.\n\nThe hangar steak was a bit chewy and lacked flavor though the corn was delicious.  The bathroom soap was nearly empty and diluted with water.  I think the biggest mismatch in expectations is that the food would be fine for a $30-$50 pp resto but at roughly $100 pp it was lacking."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGdk5EQlpkRE5mWTJoYU1sSnpXbTlpWDFBeFUyYxAB",
            "text": "Really enjoyed this restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oVFkwUndhRmRpTTNSSVMwRldSMWh0VmpGdVptYxAB",
            "text": "Lovely little restaurant with a well considered menu. We went on a Saturday at 6pm and managed to get a spot without booking, however I would generally recommend booking.\n\nFeedback I would give to service though is they brought the food out too quickly. Both my husband and I felt we were rushed through it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSmJuQlRSemhNUTNRdFRFUmtYM2szY3paU2RFRRAB",
            "text": "honestly so impressed! hole in the wall on orchard but it fills up quickly. ate earlier so we didn’t order much but everything we ordered floored us. lobster/shrimp burek was honestly life changing (not to be dramatic). the dough was everything you would hope for and the fennel salad was so refreshing. went specifically for the seasonal creamed corn under the steak and it did not disappoint. i love corn so i ate this up😋 steak was cooked perfectly and cut easily. lamb kebab was also very good. couldn’t care less about the lamb, the malawach is what you order this for. flaky flatbread (from yemen?) that melts in your mouth. the kebab is served with tahini but they were kind enough to sub it with labneh (which was amazing, need to order it next time). everything was amazing and i can’t wait to go back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsek5GQmpWRmhUTkdzMFVtOUxUVms0YVVVMk5XYxAB",
            "text": "This was very good. It’s a very intimate wine bar which isn’t big. The food and wine selection are next level though.\n\nThe owner/our waiter recommended a fantastic Sangiovese and even gave us a sample of Hungarian orange wine (highly recommend that for rosé drinkers in the summer).\n\nWe ordered labneh, matbucha, tomato + cucumber panzanella, the chicken and steak dishes. It was all very good. I have to say my favorite dishes were the panzanella and the matbucha. Apparently they said their steak dishes with corn is tending online…the dish was very good.\n\nI’d highly recommend this spot for date nights and lovers of wine. The wine and food pairings were terrific! Don’t forget to ask your server which wine they recommend 🙂"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSE9UWjRiakkxTW1nNFVEaHFRMkpxY1dkVmVIYxAB",
            "text": "Best meal I’ve had all year. A must visit"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSV1lWOUJOREp2UjFGT2JEUm9WRGRZU1dWUVlXYxAB",
            "text": "Maybe an off night. It was uncomfortably hot in the restaurant, to a point where our whole table was pretty desperate to get out. Food was pretty mid overall, but lamb was quite good. Service was abysmal, which is very odd in a 10 person restaurant. Had to wait 15 minutes for our rez, and it took probably 10 minutes to get our check after asking for it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMGFuSTBTazlMYjBWdVlrSjZiV0ZuTUZwS2FYYxAB",
            "text": "I LOVE Sami & Susu!! My girlfriend and I are visiting from out of state and were looking for some Bib Gourmand restaurants. After reviewing several, we decided on Sami & Susu. We loved the small footprint, ambiance, and the food is simply amazing!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWFFURnJNM2hMZFZCUVNUVTFPVWt4YzBKQ2VYYxAB",
            "text": "Had a lovely dinner here, tiny tiny place with small seasonal menu. The branzino was a highlight, and the tuna carpaccio, and the chicken was good, only the salad was disappointing. Nice wines. It was extremely loud for such a small space, wish the music had been lower so we could hear each other talk. Great service. Would return!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oc1dFOHdVVXhzYWtoSFZEQjJWbkZoYVVsSlZFRRAB",
            "text": "Sami and Susu is a great for an intimate dinner with friends or partner. Each of their plates will elevate different parts of your palate, and you will want to try the entire menu sooner rather than later. Their portions are generous, and will not disappoint. As a Bib gourmand in the lower east side, it is a must try in NYC's dinning scene."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOR2UyYURqd1plMmVBEAE",
            "text": "Buena música y lugar! La comida deja un poco de desear"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMaUQxdDM2ekpQeGxBRRAB",
            "text": "Did not enjoy my experience at all"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKS3ZnNkd4eGVuazVBRRAB",
            "text": "Great food, great vibe, really good wine list.  Open Kitchen and great interaction with the staff."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLeVp6dG04d0t6ajNBRRAB",
            "text": "Great experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQWDJxNGZfNTZuMmJBEAE",
            "text": "Phenomenal experience! We got the hamachi crudo, labneh, branzino and lamb kebab. Everything was delicious. Our waiter gave great wine recs. Great ambiance. Hope to come back soon."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQdlhnTnJ3bzQ3aDNRRRAB",
            "text": "The place is tiny and easily to get crowded and loud. The food was very well implemented. The Muhammara and squash blossom falafel taste were very delicious. I’d like to go back as they rotate the menu seasonally."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKLUpwS0RKMEpUMXl3RRAB",
            "text": "Everything felt carefully considered. The food was delicious - red pepper dip, courgette and burrata, lamb kebabs. Interesting selection of wine by the glass. We loved the candle lit atmosphere. Recommended."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcDhISG93RRAB",
            "text": "I'm in love with this restaurant. Sami & Susu is cozy, has a wonderful atmosphere, the delicious food, great music for the evening. It's just the perfect place. I keep coming back because it just feels like a place without compromises. The menu is always evolving and it's always interesting. When it came to choosing the venue for my 40th birthday, the choice was easy. And the owners made it so special. I'm forever grateful. Highly recommend Sami & Susu for date nights and special events!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNVpXbmZnEAE",
            "text": "Amazing food - juicy chicken, flavorful dips with pita; burrata with pistachio pesto is a stand out."
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeVpxWEdREAE",
            "text": "Très bon restaurant, salle toute petite, plats créatifs et savoureux, excellent"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbU5Ic0Z3EAE",
            "text": "Everything was really tasty. I'm not rushing to go back but I definitely would if somebody wanted to go with me. Small space but not stuffy and you are able to have intimate conversation with a friend. Would not recommend for a date though."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNmNfaFFREAE",
            "text": "Absolutely phenomenal! I celebrated my birthday here with a party of 20, and from start to finish, it was an unforgettable experience. The food? To die for. Every single dish was a knockout, but let me just say, get ALL the dips. Every. Single. One. The hamachi was unlike anything I’ve ever had, the chicken was perfection, and honestly, everything on the table was next-level.\n\nThe wine, the service was above and beyond.  Chris and Emily were absolute stars; knowledgeable, attentive, and moving through the space like a perfectly choreographed ballet. In a small, intimate setting, they never missed a beat, always checking in with a smile and keeping the energy just right.\n\nIf you’re looking for a place to eat, celebrate, or just drink some incredible wine, this is it. I can’t say enough good things."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRM0xXZUlREAE",
            "text": "Great spot to celebrate a birthday 🎂…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneWVpbTN3RRAB",
            "text": "It is a very intimate restaurant with a fantastic staff and a small but mighty menu. I went with a group of seven people celebrating a birthday, and we ordered one of everything on the menu to share. We had plenty of food, and it was fresh and delicious! They have a wonderful selection of natural wines that pair perfectly with their food. Our server did a great job caring for us on a busy Saturday night. The kitchen is open, and the staff maintained a very clean space despite how busy it was.\nI look forward to going back! There was something on the menu for everyone."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneXZqd3ZRRRAB",
            "text": "One of the best dining experiences in nyc I had in a while! Nothing crazy fancy but everything was amazing - tasty/yet unique food, attentive but not pushy service, and cozy/romantic ambience. It is a small spot but impressively quiet and thoughtfully designed space. Will definitely coming back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMHQtbG1BRRAB",
            "text": "Sami & Susu is the kind of restaurant you hope to find and experience in any large city. It’s cozy with only about 20 seats packed in a common NYC railroad apt layout in LES. The low and warm lighting emphasizing the intimate atmosphere.\nService was stellar - warm and friendly. We felt cared for even when we were served our dessert and told another reservation was waiting. 😁\nThe food was fantastic. The first to the last bite of the pita and the muhammara dip was dreamy. We both looked at each other in amazement. The red pepper dip was creamy and rich in flavor. I want a tub of it. The citrus salad was fresh and meaty. The lamb kebab was cooked and seasoned well. The sumac onion is Everything. The Meyer lemon panna cotta was so thick, smooth and bright. All of our dishes were perfectly balanced and each bite complex and complete. We didn’t get tired of any dish which happens all too often.\nI have already told everyone about it which now I regret. Getting reservations could get more difficult. I definitely will return to try the other and seasonal dishes."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBeE1LQ3FnRRAB",
            "text": "Everything was delicious. Authentic Mediterranean flavors with creative takes, all perfectly prepared. Can’t rave enough, found my new spot for excellent food and neighborhoody vibes."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcGJ5Q3RRRRAB",
            "text": "The food is really good! Highly recommend the grilled fish and 3 dips. They use very good ingredients. You can see the chief cook in the kitchen. Love the vibe too - intimate and sweet."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNVlMWGNREAE",
            "text": "super goooooooooood definitely willing to visit here again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNHUtZzF3RRAB",
            "text": "Best food in LES for awesome Israeli and wine ♥️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYLTZTY3Z3RRAB",
            "text": "Such a cute restaurant with great food and service. Menu is small but everything we ordered was amazing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYOXZiTURREAE",
            "text": "Solid date spot — great ambiance and quiet enough for you to hear each other! Flavours are generally well-balanced and makes you feel like you’re getting a big warm hug ☺️ (skip the brown butter tuna crudo though)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuXzViMEZBEAE",
            "text": "Great chicken plate"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNucDVHX21BRRAB",
            "text": "Loved this place and would line to return!\nVery cozy, delicious food, nice/ easy-going service and an attentive sommelier."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueFoydUtnEAE",
            "text": "Very good baked paste. mushroom bureka"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuZ3Z6TTRnRRAB",
            "text": "Great restaurant - can't wait to go back! Start with the dips and freshly made pita for sure."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIM2ZLY3dBRRAB",
            "text": "Fuimos por una copa de vino, pero viendo el menú decidimos compartir un plato. Y puedo decir que encontramos una joya en la ciudad , es un lugar pequeño , acogedor , y la comida es increíblemente deliciosa , se merecen la mejor calificación. La calidad de la comida es otro nivel, la atención también es increíble , definitivamente volveremos."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMnYzTTNBRRAB",
            "text": "The food, wine, service, atmosphere, all excellent. Would really recommend this place, especially if you like something new and different. Personally really liked the wine menu, with a large variety of wines from different countries, including more unique wine countries."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3ejRDNVJnEAE",
            "text": "What a great spot to visit\nNew and existing tastes, the food was amazing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3LTVlRk5BEAE",
            "text": "Yeah this place would probably be as popular as shukette if it could fit a few more tables :)\n\nDips Platter - A+\nSalad - A+\nPork Chop - D"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3b0xMUDVRRRAB",
            "text": "Food here was excellent, everything was very delicious. Price wise is more on the expensive side but definitely worth for its taste. We ordered the 3 dips, tuna, lamb skewer, pork chop, olive chicken, and clams. My fav was the lamb skewer as it comes with roti which was really crispy n savory, and the olive chicken, it has an interesting flavor. Not a big fan of olive usually but for this i would order again. The restaurant ambience was nice but one thing i did not like was the smell of the kitchen since it is an open kitchen, the whole restaurant smelled like burning bread. Overall it’s worth to try! P.s i forgot to take pics of the rest as the food was so enjoyable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3b3BEVXF3RRAB",
            "text": "A must try. Amazing atmosphere, great service and even better food. Small menu with fantastic options."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURic2FPc3VRRRAB",
            "text": "On an island of viral flame-out hits, impossible-to-get reservations, and hours long lines, Sami & Susu is exactly what New Yorkers want and need: the well-reviewed (Michelin BG) but not-yet-viral place with unerringly delicious food at a really good pricepoint. To boot, it's no frills but chic and small. Great for a date or intimate dinner party with friends. A stellar wine list and digestifs mean its fun too.\n\nI've been 4 or 5 times over the past couple years. The menu changes seasonally and I've loved every iteration. The matzo ball soup (not on the menu recently) was the best chicken soup I've ever had. The muhamarra - I could bathe in and/or drink a gallon of. The panzanella this summer, divine. Follow your heart with the food - they know how to shop at the farmers market and they know how to season food. The head chef touches every dish that comes out 6 nights a week - quality and consistency. Whatever's on the menu, it's hard to go wrong. The shrimp bourekas a couple weeks were the only underwhelming dish I've ever had there (- good to know they're human, though!). The wine is mostly (all?) natural, funky and fun.\n\nSami & Susu is one of those places I've only been telling my best friends about because I still want to make a week-of or even day-of reservation, but I think it's only a matter of time until this place catches on in a big way."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5N3FuSjVnRRAB",
            "text": "Simply amazing. I stumbled on across this place and it was warm and inviting so I decided to step in. They were friendly and accommodating so I stayed for dinner and I’m glad I did. The food was authentic, simple, and delicious. The…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyN3BLOVRBEAE",
            "text": "Hold up! Not far from Katz’s Deli in NYC is this little gem.\n\nWhat started as a wine bar, has now expanded to food and you don’t want to miss it!\n\nFor lunch, their stuffed pita sammiches are out of this world. The lamb kabob pita was so succulent loaded with flavors, I actually licked my fingers. And for those favoring an authentic schnitzel, it is amongst the best you will ever eat.\n\nFor dinner, you will find fantastic middleastern inspired dishes and salads plus a great beer and wine selection.\n\nTell Amir Isaac says hi.\n\nTish was here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEd3JlMGd3RRAB",
            "text": "Really enjoyed this restaurant. The food was extraordinary. The menu does not give it justice for how complex and interesting the flavors are really enjoyed the lamb. Highly recommend it. It's a fun place to go. Lot of nice options of wine as well"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNad0tERTd3RRAB",
            "text": "Food 8/10\nInteresting natural wines. I really enjoyed the lamb kebab and beef tongue. We also ordered the blood sausage and pita. Each dish was unique and consisted of complex flavors. The lamb kebab was paired with tahini and cilantro, and it was also very tender. The beef tongue was soft but also nicely textured. Really enjoyed this cute little Mediterranean spot in the East Village.\n\nAtmosphere 8/10\nSuper cute interior, and their entrance is easy to miss. Only a few spots available, so definitely come early. Warm ambiance and light wood details.\n\nService 8/10\nVery nice service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKd05XVm5nRRAB",
            "text": "I had a lovely dinner one night here sitting at the window watching people go by. Had a little dinner and a glass of wine. Inside was moody, candle-lit, and cozy.\n\nThe service was just right: helpful, knowledgeable, and popped in here and there to check in and make sure the food was good.\n\nStandout dish was the muhammara and pita! You gotta try it. It was extraordinary and solid portion size for two people. It was rich with a good amount of walnut on top. The pita was baked so well.\n\nCucumbers dish I really enjoyed and recommend. The flavors from the fresh cucumber with the richness of the anchovies and bursts of ricotta shavings was very well done. There should be a few more anchovies though! I only had like one or two small ones. Balance was a little off because of that.\n\nMussels escabeche was light and refreshing."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtdnJDTDB3RRAB",
            "text": "This is a hidden gem. It’s rare to get such a high quality meal in nyc without paying absurd prices.\n\nCame for dinner which seems like quite a different vibe from lunch. We had no reso for two but were given high table seating for 1h which is pretty standard for Manhattan during peak weekend.\n\nWe got muhammara (which is similar to hummus) and radicchio salad. Both dishes were well balanced, had a variety of textures, and flavorful. Radicchio was bitter and sweet. I wasn’t sure whether the main would match up but was also very impressed. We got Schnitzel - with spices that are similar to our appetizers, but in a complimentary way. The quality matches to the higher end pork katsu places in Japan.\n\nDrinks - good selection of wine, ciders, aperitifs.\n\nThe only thing that could be better is having chairs with better back support, but it is LES after all."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcUw2MjJRRRAB",
            "text": "I recently took a date out to dinner at Sami & Susi, it’s a small place, which I like because its intimate and not too noisy, the server, Alex was great, food came out in a reasonable amount of time, mostly Mediterranean food. Absolutely delicious, like my moms homemade food but elevated. Highly recommend stopping by for dinner when you’re in the LES."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidXVQXzlRRRAB",
            "text": "Absolutely delicious! This is a small restaurant with a limited amount of tables - it adds to the ambiance. The service is great - especially considering that it’s such a small restaurant. They have some great wine options.\n\nThe highlight of this restaurant is the food. We got all the dips to start and the pita was divine. The dips were so delicious as well.\n\nWe also got a few starters which were delicious - the clams were a highlight.\n\nProbably the best dish of the night was the Branzino. It was perfectly cooked and the creamed corn paired with it was very good.\n\nHighly recommend this spot - also good to take parents here as the music was not too loud and the lighting is good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxdEptMVB3EAE",
            "text": "Amazing lunch as Pita Shop. The natural wines they have on the menu are thoughtfully selected and paired really well. We lucked out that it was Christmas weekend and they weren't packed. Can't wait to come back. Had the lamb over rice and the cauliflower pita. Every dish was phenomenal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdHN2XzRRRRAB",
            "text": "My friend and I enjoyed dinner here last night, and I’d certainly come back again. The place is very small but cute and even romantic. A great place for a date! They only serve wine, but the list is extensive and thoughtful.\nThe food was well portioned and tasty. We ordered the stone fruit salad, which was a fave of the evening. The tomato panzanella salad was fresh, but I’ve been told that it’s not a “true” panzanella from my Italian husband. I still through it was tasty! Both were very large and could easily fill two people. I had leftovers to take home!\nFor entrees, we shared the lamb kebab and the half chicken. The lamb kebab was actually more of a kofta, it was ground meat formed into a large meatball. This is not actually chunks of cooked lamb. I thought it was very tasty but seemed slightly undercooked. Not enough to send back, just putting that out there. It was served on caramelized onions and peppers with fresh parsley. I enjoyed it but wasn’t over the moon.\nThe chicken I actually didn’t like, but my friend did. First, it was a bit dry. Second, the sauce was overly rich with a sauce that tasty almost cheesy. This was probably from the foie gras, which I didn’t think was necessary. I took a few bites and went back to the lamb. It was a super heavy dish and didn’t sit well with me. But to each their own.\nOverall we had a nice time in this intimate spot. It’s so tiny in fact that you need to walk through their kitchen to the restroom!\nI’ll be back to enjoy some wine and try other options. Plus that stone fruit salad was epically delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENW9MQVV3EAE",
            "text": "phenomenal dinner. been coming here since they opened and even through the menu changes i’m always fully satisfied and never leave wanting anything. branzino was delicate and delicious. salads perfect. generally super hyped and looking forward to coming back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdk83am9BRRAB",
            "text": "A new favorite. Great wine selection. Mediterranean food, with many of the meat offerings featuring less-popular cuts. Don’t let that scare you, the food is all delicious.\n\nSmall space, definitely make a reso"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeE5yNlRREAE",
            "text": "Divine food!! Such a cute space too and the chef and waiter were so lovely to us. We got the whole room to ourselves as we were eating at 5pm on a Monday but some of the best food we have had in New York. The sashimi was a knock out and cannot wait to go back. The best dish was by FAR the lamb kofta and the waiter was so good to tell us to only get one ie not add another lamb kofta ball so we had one each"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdGZPbzJ3RRAB",
            "text": "The place is very small. Hospitality was really good and staff was very accommodating. Food was just average for us but wanted to try."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwazUtXzhnRRAB",
            "text": "Now a pita shop by day, small plates by night.\n\nThe lamb kebab pita was awesome! The pita is the fluffy Israeli style (my fave), stuffed with the smoky kebab, grilled onions and eggplant. Reminded me of pita sandwiches in Tel Aviv.\n\nVery excited to try the other pitas whenever I’m in the area for lunch, and will definitely be going here for dinner soon."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlLUx5amRBEAE",
            "text": "Just honestly some of the best food in NYC. Full stop.\n\nTiny spot, not a lot of indoor seating, wine & beer, amazing menu and thoughtful staff. Fantastic all around."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtby1YdkJ3EAE",
            "text": "So much disappointment. Been saving Sami & Susu, as I have been in love with the branding, story and feel of the place. The reviews that were coming in were raving, so my friend and I decided today as a perfect day to pay a visit. We had the tri color salad, which was decent. Then the real surprise was when we got the Lamb Arayes and chicken schnitzel. Will start with the amount of salt Sami & Susu use, this is actual food we are eating not preserving food in the fridge, my blood pleasure must have shot up from the amount of sodium. The lamb itself is just terrible the color is bland, the meat I wouldn't even feed to my dog/cat, then the extra topping of salt is just hideous. The sauce that comes with Arayes, is just more salt with a lack of acid. We move on to the chicken schnitzel $22 for a small piece of chicken thigh, come on this is NYC but that's absurd. You're basically eating breading with no chicken and more salt, and the tahini is piled with more salt.\n\nWas really expecting Sami & Susu to be a stellar joint but can only recommend to stay away.."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHdEpmWmVnEAE",
            "text": "I meant to take more photos of the food but ate it all because it was so good. The menu is extensive with lots of fun Mediterranean options. The seating inside is limited and quaint but there is outdoor options with heating lamps. The staff were awesome too. Would def come back here for more food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiMjlyNGNREAE",
            "text": "You know I’ve been here a few times and they never disappoint, I like this place because it’s a small space giving it an intimate feel perfect for a first date or date night. The food is always fresh and delicious, everything I’ve tried so far has been great, had the salmon special they were serving on the weekend and from that dish alone I know the guys in the kitchen know what they’re doing. They have an ample wine list that will satisfy any craving you have and the prices make sense, can not recommend enough."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHOTcya19nRRAB",
            "text": "The food in here is amusingly delicious! Special plates and tastes! The vibes are great, and the place is so unique.\nDon’t skip on that one!"
        }
    ],
    "reviews_count": 70
}