{
    "name": "A10 Kitchen",
    "place_id": "ChIJdZwTq3JZwokR4Q4p_NhBL5o",
    "grid": "MN3",
    "address": "162 Avenue A, New York, NY 10009, USA",
    "rating": 4.5,
    "user_ratings_total": 286,
    "phone_number": "(917) 262-0505",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twV1RrMU1MVmg2TTBaeVdtOTRNR3RvU214bVVGRRAB",
            "text": "We walked in on a sunday night and were seated almost immediately. They've got great happy hour deals and I Highly highly recommend the margarita pitcher. Such a cute spot for a dinner date, also swift and exceptional service!! Definitely looking forward to return and try the menu again🩷"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sclNEWTRWblZVYTI0d05YWTNhbWhOTWpGNVVIYxAB",
            "text": "Congratulations to the new ownership! I went for the soft opening and had such a fun time. Great cocktails, I tried the “Up all Night” and later enjoyed “Ponyo.” For appetizers we sampled several varieties and also ordered a pasta and chicken entrees, everything was delicious! Lively, very neighborly vibe and I do look forward to returning in my next trip to NYC."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4a1YxWnhZbmt0U0VocE1VRjBjRlZ1ZW5JM1pIYxAB",
            "text": "Had some amazing drinks and food at A10 yesterday.. I would highly recommend the restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxaGFsQlJhbHBXTW5SWFNVcDJkbk5SVURnMlNVRRAB",
            "text": "Great happy hour deal and good food! Only complaint was that the tables outside were kind of tilted from the sidewalk. Otherwise fabulous atmosphere ✨"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sNWVWbFdkMHhXZDFaNGJYQk5VV3MyZWxCcWJHYxAB",
            "text": "Such yummy food and one of the best happy hours! drinks are tasty, cheap, and strong :))"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWbFlUQXRablJpWTI5Mk9VaEdXRXRRVVU1RmJYYxAB",
            "text": "I have a previous review here which I had given 5 stars but I feel completely indifferent now. I used to come here at least once every couple of months and this was my FAVORITE and go to spot. I loved A10 and would have recommended it to anyone. I went today and while it still has a cool vibe with great music (and is SUPER busy during happy hour), the food and service wasn’t good. It was really busy and unfortunately there were about 20 tables (including outdoor seating) all being taken care of by one server. Due to me ~previously~ loving this place, i would always look on their website for any menu changes and today (9/11/25) they happen to offer mac and cheese, which they haven't had in a while. I tried ordering this and the server mentioned it was wrong online, they do not have this menu item and they have new owners now. I ended up getting wings, mozzarella sticks and of-course a margarita pitcher. note: a lot of their other small bites like the pretzel bites are no longer offered on the menu.\nThe wings were not good, VERY small and almost soggy, so different than the quality they offered before. The server had also forgotten the mozzarella sticks :’( and we had to remind her what we ordered after waiting about 25 min. We figured it was because she was busy or someone else would come out with them but we came to the realization they were not coming at all. Overall the happy hour pitchers are okay since you get about 4-6 drinks out of them and they are $26 (+6 for any flavor), but the food is just disappointing. There’s definitely better places to grab a bite and drinks in the area. One would think that with higher prices and a new owner they’d care about the reputation of A10 Kitchen and want to offer the best, but that doesn’t apply here. It makes me sad to say but i will not be returning. 💔\nR.I.P OG A10 I miss you."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psclYwVnRNaTB5UjA5V05XSnpWWEJTVGpjeVJrRRAB",
            "text": "We had a wonderful time at A10 Kitchen this past weekend! The service was excellent, and both the employees and new owners were incredibly gracious and welcoming. We celebrated my sister’s birthday here and enjoyed delicious food, fast service, and a great ambiance. We’ll definitely be coming back soon!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gc2FETlFaa1pVZFRSNGFub3hSakJIZFdoaVUzYxAB",
            "text": "Wonderful service, delicious and scrumptious food, a must visit."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aSlRtUnlTVnAwVVdSYVpISnpTWEpNWVRaWFVsRRAB",
            "text": "I used to love this place, but unfortunately, it’s taken a nosedive under the new ownership. What was once a neighborhood gem with solid food and drinks has turned into yet another overhyped, overpriced spot trying too hard to cater to a crowd that cares more about aesthetics than actual quality.\nLet’s start with the food: it’s just not good anymore. The ingredients taste cheaper, the flavors are bland, and it feels like everything is just being thrown together without care. I ordered a burger that used to be one of my go-tos. It used to be $12—fair for a decent meal. Now? It’s a whopping $19 for what tastes like a fast-food patty on a fancy-looking plate. The drinks? Watered down, uninspired, and definitely not worth what they’re charging.\nThe worst part is, they raised the prices across the board while seriously cutting back on quality. It feels like they think they can slap a new coat of paint on the place, put plants in the window, and suddenly it’s \"elevated dining.\" Spoiler: it’s not.\nThis is gentrification at its most frustrating. They want everything to look like a trendy cafe in some European city but forget that substance matters. The charm, the heart, and the quality have all been stripped away and replaced with an overpriced, soulless version of what this spot used to be.\nSad to say, I won’t be coming back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pabE4yTXllWHB6TW5CWmEzbHNNVkJDU1RSNFpXYxAB",
            "text": "I’ve been coming here 2.5 yrs and just recently back after a few months and everything has changed. It was like walking into a new world the only thing recognizable was the waitress and i had to ask her what happened. New owner she said which broke my heart. They strip the walls of soul and the food and music as well. They got a new chef who obviously used frozen chicken for wings. The wings that they used to serve always looked fresh and weren't breaded. Im so disappointed i was truly looking forward to coming here after being away but this was a complete shock. I hope they bring the old chef back because the frozen and under cooked food is not it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wTk5tdDFNMEZZTjA1dGFGbzFiMTk2WkU5VVRHYxAB",
            "text": "Restaurant isn’t opened… could of put an update on google"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnd1ZEaHJiRk53VEU1YU5UWlFSMkZoU2tKUVJYYxAB",
            "text": "We had an amazing time. Kind servers, great food and drink\nPerfect for our friends monthly catch up !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WemFYWjViakExUlRCYWF6Wnllbk5NTlVNd1YwRRAB",
            "text": "Decent burger. Can definitely get better in the area. Wouldn’t come back for food, but chill spot to sit outside on a busy street for a couple beers."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMFkzaEpabEJGWjFNeFZVcHVPSGMwYkhJME1XYxAB",
            "text": "Let me preface by saying we went on a Friday night which is likely one of their busiest times, however, my friend got there at 6pm and we didn’t get seated until around 7pm. However, I could’ve let that go given how busy they were. But it took us at least half an hour to get our food orders in and my friend had to go and ask for her since we had been waiting for so long. My burger was well done but was honestly a little burnt. Also it’s a B rating so do with that what you will, won’t be returning."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VOM2IxYl9NNVpldFFREAE",
            "text": "Would not recommend the steak here. Very underseasoned."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQakgzcUNIZzlpM1JnEAE",
            "text": "TLDR; incredible cocktails, awesome food, stellar service, and cute vibes. very generous happy hour hours.\n\nwe stumbled upon this place looking for a last-minute dinner before a show, and were so pleasantly surprised. The cocktails were amazing and reasonably priced. we got burgers and the fried chicken sandwich, both of which were great. The fried chicken was perfectly cooked and seasoned. our server was amazing, didn’t write anything down, but made no mistakes and was super quick.\n\nwish I lived closer so I could luxuriate on the patio with delicious cocktails.\n(the Blackberry Bangkok and the Dark Horse were amazing. real fruit puree and well balanced.)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VLR1lxS19FOHJ5V3pBRRAB",
            "text": "Went for HH and mussels. They didn’t have any seafood, so got some other food. The chicken sandwich and burger were meh and even the salad was too salty. Go for HH drinks, but not food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMmZDcU1nEAE",
            "text": "This spot is fully underrated!! Fun, laid back spot for some of the best drinks in NYC and the food never misses. The entire team is fun and energetic. You can tell they care about your experience. They also got the best happy hour specials."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvb1puRS1BRRAB",
            "text": "Love their truffle Mac & cheese! They were nice enough extend their HH menu to 8pm because of the long wait time. Can’t wait to be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeklEa0F3EAE",
            "text": "Best place for a happy hour!! Food and vibes were great. Also whoever was on playlist duty on Saturday afternoon 10/10. spicy margarita was sooo good"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdDdiRFZnEAE",
            "text": "Great place for happy hour!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfcmR2aFJnEAE",
            "text": "Closes at 1:10"
        },
        {
            "date": "9달 전",
            "language": "fil",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmOFlfU19RRRAB",
            "text": "Love kuya"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeXZhWi1nRRAB",
            "text": "Lovely happy hour"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQMXBpTGdBRRAB",
            "text": "went for happy hour on sunday, it was nearly empty! everything was AMAZING. music selection was on point, good food & cocktails, great customer service, just overall very welcoming. i will be back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcU5DTEhREAE",
            "text": "Good affordable drinks during happy hour. Pretty strong too !!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzLTRHYXJnRRAB",
            "text": "The food is absolutely delicious here!! I would’ve given a full 5 stars but the noise in here was insane. Blasting music during dinner isn’t great for the atmosphere, super off putting and not easy to have any sort of conversation."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzOWV6eEZnEAE",
            "text": "Decent food with great happy hour deals."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYNEpyS19RRRAB",
            "text": "five star food beverage. great hot music and food great. love team\nand best bar."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMTZtSTFnRRAB",
            "text": "Vibes and the hostess is cool"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYcHJmbll3EAE",
            "text": "They’re hours are misleading, we showed up within their hours presented on google maps and they were closed while the open sign was still lit.\nMy friend says I’m too picky. But it pissed me off"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNubmZtelBnEAE",
            "text": "I love A10 !! It’s such a vibe, the drinks are amazing !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIanB5endnRRAB",
            "text": "Wings & Pitcher…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIaXR2a3JBRRAB",
            "text": "Chicken sandwich, Mac and cheese, sidecar with Martingale cognac. Top tier"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINkxYckVREAE",
            "text": "Great friendly staff. Good food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIa0pIa0F3EAE",
            "text": "Why is this place so highly rated? We went during happy hour, the entire meal was cheap- we got mussels and a burger. The burger was decent but salty, the mussels had no liquid to soak your bread in. I think if you’re looking for a cheap meal this is ok, but many better options in the east village"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bWV5VTVRRRAB",
            "text": "A10 Burger and pretzels with Queso are phenomenal. Staff are also really friendly and attentive. My boyfriends and I favorite spot! ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3Z3Z1eFdREAE",
            "text": "I love this place and the happy hour is good but it’s been 2 years since I’ve been here the service has gotten worse and prices higher! You really come for the drinks but I just have to say the “skillet cookie” is a brownie!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3aE9fc3N3RRAB",
            "text": "Always super super packed. You need a reservation. I’ve tried to go 3 times (just me and a friend) and only managed to get a table once. We were squeezed in by the entrance. The seating isn’t that spacious and pretty close to other tables. I’ve seen a pretty big line outside too. The margarita was good but the size just seemed a little small to me. I tried the happy hour mac and cheese and thought the same."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaF9qZXFnRRAB",
            "text": "Came for happy hour, but the drinks were not good (way too much sugar). Food was decent though and it was a fun atmosphere, but can’t get past the drinks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiLTRiRUxBEAE",
            "text": "I went to this location today with my boyfriend. We traveled all the way from Harlem to the place because of TikTok and I regret wasting my time. I can’t believe I’m saying there a racist bar in NYC. I won’t recommend this place to anyone ever! We wasn’t allowed to sit outside in the booth because it was two of us, but it was a caucasian woman  sitting ALONE with her dog and two more Caucasian ladies sitting in another space in the Booth area. We left didn’t give this horrible business any of our money. No hospitality."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibThqZzF3RRAB",
            "text": "It’s a bit small. You have to sit close to another table, that was the only thing I didn’t like but other than that everything else was 10/10. I went for happy hour & got the jug of margaritas & it was really good! & their service is great. Music was also great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiellPRTFRRRAB",
            "text": "Food wasn't too bad. Had a hard time getting the table we wanted when we had more coming. Had to wait until they arrived to move."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNFlyOXF3RRAB",
            "text": "the happy hour deals are so good!! unfort they ran out of pasta while i was there but the truffle grilled cheese is a great vegetarian option. staff is nice and drinks are delish! happy hour was until 8pm when i went on a wednesday, only $20ish for a mojito pitcher (very effective)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMcTZxdll3EAE",
            "text": "This place is quite a gem - tucked within East Village, they’re worth checking out for their happy hour deals alone (which I’m told are available for more hours than most).\n\nWanted to go for Haply Hour Mac and Cheese but they ran out.\n\nVibes are pretty positive, service is friendly and personable.\n\nIndoor and outdoor seating available. WiFi isn’t available, unfortunately."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMemVpQk9BEAE",
            "text": "The food was alright, we decided to share a mojito pitcher. It tastes of artificial sweeteners, lime concentrate & cheap white rum. We left after drinking not even half of the pitcher. Mussels were okay"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMenFic1d3EAE",
            "text": "I always come here. Dare I say it’s in my top 5 places to be in NYC lol. Honestly, I think they have the best hot wings and mac and cheese. My friends also love their mussels. Great music every time. Our server was Ryan yesterday, and he was exceptional. Thank you. You guys never disappoint."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqNzlXRU5REAE",
            "text": "Had a great night here in early April. Sat at the bar, superb service from Grace and Florian and they were so personable - making conversation and chatting to them all night. I definitely made the most of the $7 Happy Hour Spicy Margaritas, so much so that I probably should have gone for the $21 pitcher 🤣 while my husband drank beer. We didn’t really eat - other than gorgeous pretzel bites - but the food that other people ordered looked really good. It was the first night of our trip and a great way to start. Would definitely recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSc01QTmdnRRAB",
            "text": "Been coming to A10 for happy hour for a while now but they recently raised their prices which was disappointing. Besides that, they have a really nice outdoor seating that doesn't feel like you're right on Avenue A with nice booths and heating in the winter. They are also pretty accommodating for groups of 6 or so. The most recent time I went it was 80 F in the city so it was really busy and they gave us a time limit. I recommend if it's warm to make a reservation so you have a better chance of getting in with no time limit. The food specials for happy hour are pretty good and taste really good. The burger used to be $10 and is now $12 which is sad. Everything is going up. Overall, pretty good drinks and food. Not too strong though for the pitchers."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMU9xVmlBRRAB",
            "text": "Amazing happy hour but be prepared to wait. The mojito (5/5) which was only $6 was extremely strong and had wonderful flavor. The Mac n cheese (5/5) is heavenly for only $5. The pretzel bites (4/5) while good were not worth the $10 with the cheese. I'd pass and get the Mac n cheese next time."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdkwzRmdnRRAB",
            "text": "Came with a group on a Wednesday night. We sat outside and we’re grateful for the fans in the enclosure (it was pretty closed off with plastic panels). We all split two pitchers of margaritas, some finger food and a couple of us got entrees. The bill was much more affordable than we were expecting! If you go here, definitely take advantage of their happy hour offers."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoc1pmbEhnEAE",
            "text": "Came Tuesday night with no reservation 15 minutes from happy hour ending, but the host was able to accommodate us at the bar. Super lively, even on a Tuesday, and the happy hour deals are unbeatable. We got a Mango Mojito Pitcher for $20,…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNULWZlWURBEAE",
            "text": "Stopped in by recommendation for Happy Hour and grabbed a $22 pitcher of mojitos, delish! We also enjoyed some incredible food: mac n cheese, truffle fries, and the truffle burger. This unsuspecting indoor/outdoor place had a tasty menu, welcoming service, and all around good vibes."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpM2NtZk93EAE",
            "text": "Beautiful outdoor decor and seating and exceptional food. Wow. I was blown away. Came here on Election Day and had a blast eating and having a bubbly. Safe dividers are up that still keep the ambience of the place and certainly a burger to remember.\n\nThe pancakes were ricotta. Never had anything like that but now I’m a huge fan."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxMWRpMXJRRRAB",
            "text": "Let’s start with the good: the ricotta gnocchi was delicious, and so were the French fries. The interior of the restaurant had a cool aesthetic too.\nThe bad: the portions of the charcuterie board were laughable (especially for…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwajZMa3B3RRAB",
            "text": "$20 for a pitcher of margs or mojitos?!? It seemed too good to be true, so my walls immediately shot up. I've learned the same lesson the hard way from so many different avenues of life that if it's too good to be true, it probably is.\n\nI went with my roommate, former USC Basketball Megastar, on a beautiful summer Saturday. I know what you're thinking, \"Two dudes going to get a pitcher of mojitos?\" Chill. It's 2023 and sometimes a couple silverback gorillas just want a feminine drink on a nice hot day, what's wrong with that? Okay, I will concede that every time I hear the word \"mojito\" that little clip of Brian Griffin from Family Guy pops in my head ahahahaha. I would quote it here but I don't want to be Yelp canceled.\n\nAnyways, the 2 silverbacks sit down and confidently order a pitcher of Mojitos. When the pitcher comes, my disappointment is immeasurable. Upon first inspection, it is a pitcher of ice with a splash of mojito. Why does god give his toughest battles to his strongest soldiers?\n\nHowever, the most amazing thing happened. Once we poured our first 2 drinks, there was still a solid amount of mojito left. Some sort of optical illusion, I imagine. Then, after cheersing the mojito and saying \"Kanpai**\" we take our first sip and are SHOCKED. These drinks are STIFF, no watered down danced-on mojitos here.\n\nOn their website they say the pitchers provide about 4 drinks, but I'd say it's closer to 5, maybe 5.5 STIFF drinks. I also saw they have pretzel bites on the happy hour menu which I will absolutely try next time. I, at some point, will write a review about how I think pretzels are criminally underrated.\n\nA HAPPY HOUR SENT STRAIGHT FROM THE ALPHABET CITY GODS THEMSELVES! THANK YOU A10!\n\nIG @jnov_\nTiktok @jnov__\n\n**Authors Note: I say \"Kanpai\" because it means \"cheers\" in Japanese. When someone inevitably asks \"what does that mean?\" I crack a sly smile and let them know it means cheers in Japanese and that I've been to Japan hehe haha I'm so well traveled hehe (shy monkey emoji)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4eHNEQVVREAE",
            "text": "Such a nice surprise.  Thought it looked cute and had good reviews.  The food was so good.  Nicely prepared and very tasty.  We had the mushroom truffle grilled cheese, Caesar salad that had an amazing home made dressing, asparagus and gnocchi.  Each were equally delicious.   I would recommend them all. I also had a nice glass of montepulcciano.  Mmm."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXaV9qRnp3RRAB",
            "text": "Great atmosphere inside for drinks and food before going out in east village. The burger was great, but also the ricotta gnocchi and crispy cauliflower were enjoyed by our group. Bartender makes a great spicy margarita and the owner makes sure everyone is having a great time."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXOFpDUml3RRAB",
            "text": "This gem has a cozy and intimate atmosphere with an inviting energy. The drinks are tasty, balanced and reasonably priced. The food menu is exciting with delicious and flavorful options that leaves you satisfied. The staff is also attentive!\n\nA10 is my go-to spot for when I’m in the city and indecisive (or when I crave those rock shrimps appetizer). My recommendations are the espresso martini and the rosemary fries! Oh, don’t forget their happy hours 😌"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMydVk2MEdnEAE",
            "text": "Happy Hour on weekends! Great happy hour menu from 5pm-8pm! $5 delicious margaritas.  Food menu is pretty nice too.  Great east village find with nice outdoor dining area. Friendly staff.  Again happy hour on weekends!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURleGVqaVpnEAE",
            "text": "Hands down the best happy hour in the area. The restaurant set up itself promotes an intimate dining and drinking experience vs the traditional cramped and dingy east village bar. $20 margarita pitchers that are very good, the pretzel bites…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKemZDQ0RREAE",
            "text": "Came here for drinks with friends so we didn't eat very much. The crab dip we tried was quite crabby, but delicious nonetheless. Service is quick, and the drinks are decent. Pitchers were about $40 each because it wasn't a happy hour anymore."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxMzRiSEVBEAE",
            "text": "Went on NYE. It wasn’t crowded at all we were seated right away. I got the salmon with mashed potatoes and my boyfriend got steak and mashed potatoes. The food was good we both enjoyed it. We also had the watermelon martini which we both enjoyed."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdWZtY0h3EAE",
            "text": "The drinks were good, I would recommend the strawberry margarita. The food was typical bar food, pretzel bites was a favorite. I was a little disappointed we made a reservation on opentable for outdoor seating when we arrived they didn't have a table reserved and they just weridly sat us in a  corner inside the restaurant. Overall a good place to start off your night if you plan on bar hopping."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5a3UzVjZnRRAB",
            "text": "I wanted to have myself a day in NYC and dropped into A10 Kitchen since I saw they had heat lamps. I was going to order small dishes now that NYC mandates that food is to be served along with alcohol. But Arber, our wonderful waiter, knew…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1X2VQMmpRRRAB",
            "text": "Such a nice surprise of a great meal at fair prices! Here is a photo of our very happy group of friends at the corner outside table. As a regular google reviewer (only when I have something positive to say!) my fave part of a dining…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1MHNhT1R3EAE",
            "text": "Best burger I’ve had in a long time. The mushroom Burrata was awesome. Really enjoyed this place and hope to be back soon!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhdHJDbDVnRRAB",
            "text": "Happy Hour menu is amazing and highly recommended! Make sure you make reservations if it's on a busy day because they will be packed!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpaUlDMWtnRRAB",
            "text": "My friends and I had brunch: brunch burgers, amazong pancakes and lots of home fries.  I absolutely recommend supporting this restaurant because they have: (1) heated outdoor seating, (2) very attentive and friendly staff, and (3) great food and cocktails."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpM1BITW1nRRAB",
            "text": "Outside heaters. Amazing wooden terrace for covid and perfect for social distancing. Cocktails on point. Service is great. Local spot. Check it out for sure!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSdGIzSzRBRRAB",
            "text": "Had an awesome Sunday happy hour here the other week! Most drinks were $5-6 and the appetizers were awesome! The pretzel bites were scrumptious and the mussels (for only $12) were so refreshing. I absolutely loved being able to sit outside and for about four rounds each and four appetizers a group of 4 people spent only $120! The location is perfect and the happy hour cannot be beat. We will definitely be returning to bask in the summer fun!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtOFozRWtRRRAB",
            "text": "Came by after hearing about this place’s drinks. Apps were good, drinks were strong. Very pleased with the overall experience, will return."
        }
    ],
    "reviews_count": 72
}