{
    "name": "Please Don't Tell",
    "place_id": "ChIJb67-ZZ1ZwokRRxBYr3GlFp0",
    "grid": "MN3",
    "address": "113 St Marks Pl, New York, NY 10009, USA",
    "rating": 4.3,
    "user_ratings_total": 2351,
    "phone_number": null,
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WNU1tWmFVR1JVYjBWNVVFNUZhRkJsY3pSUkxWRRAB",
            "text": "Nice speakeasy.  Can get very busy.  Make reservations for booth or bar seating."
        },
        {
            "date": "5일 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wMk5HZEZNazU0VEZoMmRVaFNWak4wVVZGQmRVRRAB",
            "text": "Une expérience incroyable! On se retrouve projeté dans l’Amérique dès années de la prohibition, on est vraiment déconnecté dans ce lieu et c’est ça qui nous fait du bien. L’ambiance est très bonne, le service est très bien, nous avons été très bien accueillis. Je recommande"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTU5IWkNOMjkzT1hOSWVDMDRWMDlDV2xsUFlVRRAB",
            "text": "We went to get some drinks after dinner but we didn't have reservation so we had to wait until they contact us for table which was about 30 minutes.\nThe 4 of us got seated on the small table, half the size of some tables that 2 people being seated (table under the bear) and right next to the bathroom and you can see the bathroom through the curtain which was certainly not nice. Since it was very dark people always hit the table we were at whenever they go in and out of the bathroom 😞\nAnd since the table was small, 4 of us were very cramp in there, not at all comfortable.\nWe had a drink each then left."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnNFNIQnFTV055UkdwRGJrZ3RSa05UUVVSTFVuYxAB",
            "text": "PDT holds a special place in my heart. It was the second speakeasy style bar I ever visited (the first being Attaboy), way back in 2014. I've only been back a handful of times since then, but every time I'm able to, I'm excited. I know the food will be on point, the vibe low-light and comforting, and the cocktails made with meticulous care and precision. It's an intimate setting where you'll sit with your party and actually be able to speak with each other instead of shouting over loud music or blaring TVs. Overall, it's a really well done cocktail program, in a cool secretive setting. The staff are very friendly and knowledgable and the service is quick and efficient. Thank you!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tadmFESlhlVWhGVDBOWVJWSk9lazUzUjNoeVJtYxAB",
            "text": "Cool speakeasy but I don't get the whole hype"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25weWF6VkdSMkpUZVd0aVZtNHdkbU01UzBONlFWRRAB",
            "text": "Very intimate and modest place, but well worth the visit if you can get in. We didn't have a reservation, but the hostess got us seats at the bar for an hour before the next reservation. So plan accordingly. Reservations are recommended. We only had drinks, but they were AMAZING!! Between my wife and I, we tried 4 different cocktails and all were great!! I would list the cocktails, but I honestly feel that you won't go wrong with any of the choices. Just find your flavor profile, or alcohol of choice, and go for it. They will also make off menu drinks, but we didn't do that.\n\nWould definitely return"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4eVZYQklVVXBTY0RodWVFeEJUa0ZZYTBSQ1NWRRAB",
            "text": "I felt it was more of an experience.\nThe drinks tasted good but they didn't make me tipsy. The service was alright."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OdE16TnRkSFprZUhsWFZHb3lUR2RZVWxoQ1ZYYxAB",
            "text": "Fun experience for a first timer.  Sat at the bar and enjoyed the show. It’s a science project happening with every drink.  I had 2 and enjoyed both.  The second one was better as I requested the flavors I was desiring, voila here is a perfect cocktail.  I enjoyed the phone and looked forward to returning.  Try the citrus ginger spicy drink for a kick."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204NFVVb3RNRTFyUnpWaWNWSm9RblJvWm5RM1FrRRAB",
            "text": "Terrible PDT experience ！— would not recommend for walk-ins🔥\nWe arrived at PDT around 8PM and left our phone number with the host, who told us that while they couldn’t guarantee a time, we would be notified via text or call once a table became available！\nWe went next door to Amor y Amargo for drinks and continued waiting for a notification. By around 11PM, we checked back and were told there were still 6–7 parties ahead of us, so we waited some more time in patience！\n\nShockingly, even by 12:30AM — nearly 4.5 hours later ！— we still hadn't received any call or message.！When we returned to the bar to ask the host，we were told they had given our spot away without notifying us at all. No explanation, no apology — just an unacceptable level of disorganization and disregard for guests.\nAbsolutely terrible hosting and service！If you don’t have a reservation in advance and are thinking of walking in or leave a phone number to wait the SMS. PDT is never your best choice！Unless you enjoy wasting your great night waiting for a call that never comes！"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SFNrNUpiMTlXY1doNE5FdGFPVTF3Ym1OcVpGRRAB",
            "text": "Dimly lit bar hidden in a hot dog store. It has that classic prohibition lounge decor, which is nice. The cocktail was decent."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJeldVTnFOVmt0VEd0SGJteFJSMGs0ZEVjeldWRRAB",
            "text": "Very rude service. We waited for 3 hours and the “greeter guy” didn’t move our position in the wait list. This happened on two occasions."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RMFYxbFZNRFkxY1c1eldFcEdOSFZMV2pGS1RWRRAB",
            "text": "Put our names down. Host told us we’re 9th on the list. Came back 3 hrs later. Host told us we’re still 9th on the list.\n\nComplete joke"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWU1NtdEdUSEpZUWpSSUxYcHZWRmRyYlRsVVduYxAB",
            "text": "Turned up with a reservation to find the place was closed. Traveled miles across New York to visit and had no notification that they would be closed. Terrible service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pndE4xOUlhakY2WTFjNFkxaGlkR3hFWWkxSFZGRRAB",
            "text": "Rude hosts. Entrance through a phone booth is a very short lived gimmick. Not worth the rude service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xveFIwZDBhMDE2YWpGU04ySnpla1JSYTBkM2MzYxAB",
            "text": "Please do tell!\n\nEverything about this place is superb. Drinks are created with the upmost fashion, taste and creativity in mind. Service is impeccable and the pricing is just right for a quiet little get away. Set away from the hustle and bustle of the city lights and noise and step into an oasis of clever drink making, classy themes and not to worry this wont break the bank!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKc1lsOWxkME4wV1hBeWJtcHNUazV2Tm1OSFZVRRAB",
            "text": "Good for tourists and people who haven’t been to a speakeasy ever! City folk should get early drinks here or chill here during the week after work! Hot dogs are a great touch!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVGJXUkRiRUZQYzBGSFlqUmxaekZDWTNGTmRtYxAB",
            "text": "Had a great time at Please Don’t Tell! Definitely make a reservation if you can. It’s tough to get a seat during peak hours, especially on weekends if you’re going solo.\n\nBig thanks to Brie for finding me a spot after a bit of a wait, coming from out of town may have helped! Once seated, everything was smooth and welcoming. The vibe was spot-on: relaxed but buzzing with energy.\n\nShout-out to Marc (the bartender, I think!) who gave me excellent drink recommendations. Every cocktail I tried was perfectly balanced and delicious.\n\nOverall, great service, fun atmosphere, and fantastic drinks. I’ll absolutely be coming back and highly recommend PDT to anyone visiting NYC."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsWmJYQnJUM05RU25GdWFWUnFXbGxoVFdWMWVHYxAB",
            "text": "Please Don’t Tell is truly a hidden gem in NYC. From the moment you step inside, the ambiance sets the perfect mood—intimate, stylish, and full of that speakeasy charm. The cocktails are nothing short of incredible, carefully crafted with creativity and precision. Every drink feels unique and memorable. On top of that, the service is outstanding—friendly, attentive, and knowledgeable, which makes the entire experience even better. If you’re looking for a one-of-a-kind speakeasy with impeccable drinks and atmosphere, PDT is an absolute must."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWk1qWTBTR1V4YWpkd1ExbENWVFp4YlMweGNuYxAB",
            "text": "The restroom is not very comfortable. Good vibes nice atmosphere! Little bit expensive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VME1FWlpiMGxwV2pWeVJHMDFjblJ0YWxGeVFWRRAB",
            "text": "Chloe made phenomenal cocktails including a fabulous cocktail featuring Japanese strawberry gin. It was a fresh burst of summer. The atmosphere is wonderful and the phone booth entry to PDT is very neat."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200eGEzVXhjVVpTWm5OSVEzaFRiREZzVkdNMFZGRRAB",
            "text": "I enjoyed my visit to Please Don’t Tell! Tucked behind a phone booth, it feels like a hidden NYC gem. The cocktails are creative and expertly made, and the intimate, cozy vibe makes it an cool experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200NFZrZEVaMmgzU1cxM1FYVlhVbE5YYTBwc1VXYxAB",
            "text": "Was told it'd be a \"quick wait\" for a 2 person party - ended up waiting over an hour with multiple parties going in ahead of us. The hot dog stand next door also skipped my party for parties of multiple people. It was literally a plain hot dog (no toppings) and still was made to wait over customers that showed up after us."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oWVRUVnRkSEJCWkdZNWNVUlJWRTVxVHpGV1RHYxAB",
            "text": "Fantastic experience,  Chloie (sp?)was amazing, so was the fellow who helped us before who's name i neglected to get.\n\nDidn't try all of the drinks but every one we did was stellar, atmosphere is great.\n\nMy favorite part is the list of recommended restaurants and bars in their menu, way to pay it forward guys!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMmJWUllha2hIVGpkSWRsQlNZbHBGV2xGc1RtYxAB",
            "text": "Went there after hearing a lot of hype around this place. We were seated at the bar. I was hoping a little more friendliness and recommendations from the bartender but I guess he just wasn’t in the mood. I went with an old fashioned with a twist. The drink was great, although apart from the entrance it felt like a normal bar."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbFlQMFN3EAE",
            "text": "We booked a week in advance and arrived right on time to find a cozy booth waiting for us! Our server was super helpful and suggested a delicious seasonal tequila cocktail and a bold rum drink both were not only tasty but also looked amazing! We decided to order a hot dog just for fun (you know, when in Rome!). The music was nice and soft, making it easy for us to chat. Just a heads up: expect NYC cocktail prices, but the quality totally makes it worth it. I’d definitely come back with friends, if only just to experience that entrance again!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WRUxVUTVWMkZrTTJSUGNreFdia3RxY0V4cWRuYxAB",
            "text": "Denied entry at 1am saying that it’s closed despite online saying it closes at 2am."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wd2JFWlJZMjlOY2s5VVVqVXRhVFZTVTFaSGRFRRAB",
            "text": "If you have ent tried a speakeasy you need to try this one! Make sure you get a spot early or you will wait a while... but its worth it!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkTGFHTkdWV3d0WjA0eGJtTklOa1JWWWpGU1RFRRAB",
            "text": "Unfortunately, the highest ranked NYC bars are often the most mediocre? Our first drink here, the Nanie Ma's Achar was not very good. However, the server then gave us another drink with a basil and tomato and it was amazing! I'd recommend this for hype and most of their staff was very welcoming but not sure a very long wait is worth committing to!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOc2IxOXlVSFpsT1hCb1ZrSnJUa0oyUm05TVoxRRAB",
            "text": "Hostess so rude. Asked to be put on list, looked condescendingly at me and then put my name down after I asked her to. Asked for waiting time, said she could not provide one. Throughout the entire interaction she tried her best to ignore me and talked to her friend about something un work related. Get better service. Didn’t bother giving this establishment my business."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKVmEyVk9SVko0VkdsdlZFNW9kVEpLYm1zMGJuYxAB",
            "text": "PDT is the ultimate speakeasy experience done right. Tucked behind a vintage phone booth inside Crif Dogs, this intimate bar delivers next-level mixology with a side of whimsy. The cocktails are absolute masterpieces—creative yet balanced, with unexpected touches (hello, maple bacon-infused bourbon in the Benton’s Old Fashioned!).\n\nWhy it’s legendary:\n🔐 Secret entrance – Punch in the “code” for that thrill of discovery.\n🍸 Seasonal menu – Constantly inventive (try the Staggerac or Coffey Park Swizzle).\n🌭 Criff Dogs delivery – Because drunk-food pairing is an art here.\n🎩 Old-school charm – Dark wood, taxidermy, and bartenders who are true alchemists.\n\nIt’s tiny, so book ahead—but worth every second of the wait. For cocktail nerds or anyone craving a transportive night out, PDT is the move. Best kept “secret” in NYC."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twR1pWbEhYekZ4VWxJeFREVkthbTh4VTJwMGVtYxAB",
            "text": "Our bartender Sam was awesome! So friendly and helpful with his suggestions."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4aWJVcHlhMHBrYVZKcFYxVlFkVkZVYzFoSWNGRRAB",
            "text": "Fantastic speakeasy! Visited whilst in the area on a walk-in basis and seated straightaway. Super knowledgeable bartenders who could advise on cocktails !!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WSFQwVk1Sa05KVkZWV1YwVllaRXRETjNka1ZWRRAB",
            "text": "I’ve been wanting to visit this speakeasy for over 25 years, ever since I heard about its famous telephone booth entrance. The legend was that you’d step inside, make a call, and be granted access through a hidden door. In reality, the process wasn’t quite as magical as I imagined, so the anticipation I had built up over decades didn’t fully match the experience.\n\nThat said, once inside, the place was fantastic. The atmosphere was intimate and stylish, with a great energy that made you want to linger. We sat at the bar, where the bartender was exceptionally kind and attentive. The drinks were masterfully prepared—balanced, flavorful, and beautifully presented.\n\nOverall, while the “secret” entrance wasn’t the mind-blowing moment I’d been dreaming of, the interior experience more than made up for it. I’d still recommend visiting, especially for the cocktails and the warm hospitality."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTWFHb3RNMDlFY21STVh6ZG5NR3hPVFMxT09XYxAB",
            "text": "Un poco pequeño el lugar, pero me encanto la vibra de que este escondido y no se facil encontrarlo muy bueno los tragos lastima que no pude probar la comida"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KQ1FXNXRlRk5UVmxVMmMwUlRWbU5VYlhaaGRtYxAB",
            "text": "Omg, what experience! Service amazing, great atmosphere,  drinks  on point, well balanced. Cozy, great variety of drinks, service exceptional.  Going back for sure, many times as possible."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GRVkycDFUVXBIZFhwdk5HdHNZVmhZUjJRNVZHYxAB",
            "text": "Very cool entrance - my drinks were very good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdE5qUnZNblZOUTFvNVoxZ3dSRGg0YWs5bFJuYxAB",
            "text": "Rude staff! Wouldn’t recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sQllXd3RNMU5EZEVkclVERlRUbWMyVEc5NFFWRRAB",
            "text": "Great cocktails here, would return."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkaE16Skdja28zTVZoZlJtTm1kMDQwVFcwMmVIYxAB",
            "text": "Please don’t go! I went this couple was before me with no resy, got in, then let them know there was like 5 ppl to follow but no where in sight. They were allowed to go in to “wait”  and i was told that I’d have a short wait. After waiting…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KVFVHbE5ZVVUxTkhsMlIzVmpRekF4WTFGdFVVRRAB",
            "text": "Interesting entry, but that’s all this place has going on.  I went with 4 other people and we each had a drink and left.  The drinks are $20-30 each, and not worth half of that.  There are taxidermy animals on the walls like a hunting lodge meanwhile the staff insisted on playing Latin music.  What a nonsensical atmosphere.  Is this a speakeasy from the 1920’s or a hunting lodge or a disco in San Juan?"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkV2NEWkJRMHhTTmpsalozbHNiMUJCZWtaTlNFRRAB",
            "text": "We got seated at the end of the bar.  Two minutes in and Joey (server) told us to move.  No issues with moving but he was extremely rude about it.  We moved and then he asked us to move again even though the hostess sat us there.  Pic attached of this guy, good luck with his attitude.   Bartenders DO NOT smile. Hostess was flirting with the server all night. We got a phone call from a friend to wish us on our anniversary and Joey told the hostess to tell us we can’t take calls at the bar, I’ve never heard of this.  This guy (pic attached) is clearly prejudice.  These guys are arrogant and cater to a “certain group”."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnNU5WWnJlRTAxWmtNMWJtOVdjM0Z5UkMxemRXYxAB",
            "text": "I went to Please Don't Tell as a surprise for one of my best friends from college. I wanted to orient him properly to a New York City speakeasy.\n\nWhile there wasn't much gamesmanship about getting into PDT -- an employee was periodically letting guests in on the day we went, contrary to reports of having to call anyone from the small phone booth -- we were immediately pretty enamored by the dimly lit atmosphere and proximity to the bar. Our bartender was extremely kind and was making masterful cocktails, to the point I had the same one for my last three rounds!\n\nI'll be back here -- such a great vibe and an awesome spot to catch up with anyone. There's this subtle feeling alot of history has taken place here. And I don't mean the political or tabloid history; you sit there wondering, damn, how many dates, reunions, and long time friendships have been rekindled here?\n\nDope place."
        },
        {
            "date": "3달 전",
            "language": "bn",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxV1ZHdExhbFJOZVRrNVpuZEViakZYVWtka2FYYxAB",
            "text": "5/5 Cha Cha Colala\n4.5/5 Cha Nom Thai\n4/5 Black Diamond\n4/5 Ichigo"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOT2RfdGpCdzhQT0xBEAE",
            "text": "An outstanding bar experience—well worth the wait. If you have the chance to get in, don’t hesitate. The atmosphere is relaxed and welcoming, with staff who are genuinely friendly and attentive. The drinks were top-notch, and the specialty hot dogs, especially the David Chang creation, were absolutely delicious. After years of anticipation, this place truly lived up to the hype. I’ll definitely be returning."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205aVYwUkNXa3RHVWtoWFowbHhOMnRLZFdaaFFYYxAB",
            "text": "Me encanta el servicio y las bebidas, me encanta la piña colada coffee y o\nSophia is incredible she brings a excellent service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkcFFXbzRRM1pWZERoeWEzQkNUMnhVWmtOQ2NXYxAB",
            "text": "KCMO love in this speak easy. Routinely amazing drinksy 2x sampling across the menu"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WWk1USkNhVm8wVURkRU1IRkRiMnR1VHpkS1dVRRAB",
            "text": "Fun hidden gem to find while in NYC!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKRGFXZFRTWFZzUXpac2NsaExkVTl5U25GRk1WRRAB",
            "text": "This place was awesome man\nI would come back here again\nDrinks are pricey but good and the crew here is amazing and so wonderful 10/10"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dU1VbHRSVEJoU3pGQmJWUklUVXROUzJ0bVZGRRAB",
            "text": "9 years later and still such an incredible spot with balanced cocktails! We loved the Benton’s tots."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twMmNHeERUWGRGV1hvdFlUWjNVbmMxU21vNGIxRRAB",
            "text": "probably my fav bar i’ve been to in nyc, definitely takes the cake for coolest entrance. didn’t eat anything here but i told the bartender what sort of cocktails i like drinking & he made me something fantastically citrusy & absinthe-y! highly recommend checking this place out, the drinks & the vibes are amazing."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJOFl2alNREAE",
            "text": "Crif dog 안으로 들어가서 무슨 전화부스 안 두들기시면 나와요 문이 나옵니다\n찾기 너무 힘들어요\n모르시는 분들은 가게들어가서 물어보세요\n바텐더가 다 유명하다고 하네요\n분위기는 최곱니다!"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucE9lckF3EAE",
            "text": "컨셉만 그런게 아니라 진짜 speakeasy\n노래도 좋고 분위기도 좋공"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0LWNId2hBRRAB",
            "text": "뉴욕에서 먹고 마신 것중 손에 꼽을만한 맛과 분위기가 있는 곳. 칵테일도 수준급이고 음식도 멋졌다. 와플 프라이즈는 인생에서 먹은 감튀 중 최고"
        },
        {
            "date": "8년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnNktmLXF3RRAB",
            "text": "비밀스러운 장소에서 마시는 맥주와 저렴한 감튀 안주. 즐거운 경험이었어요."
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnbnRIWFJREAE",
            "text": "오래 기다려야 했지만 숨어있는 바가 귀여웠고 핫도그가 엄청 맛있었다!!! 칵테일은 평범한 맛"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJdU02MjV3RRAB",
            "text": "맛있어요. 볶음 김치가 아니라 생김치를 사용해서 깜놀. 분위기도 활기차고 좋아요."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVdHREQXdBRRAB",
            "text": "정말 찾기 힘든 입구 뒤에 숨겨진 칵테일바\nGreek Deli 라는 칵테일은 정말 신선한 경험이었다"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLZjI1TWFkM3FlLTV3RRAB",
            "text": "Hidden Speakeasy within Criff Dog. Enter the phone booth, dial one to gain entrance. I do suggest reservation as they tend to get very busy throughout the evening.\n\nThis is one of the top speakeasy in Manhattan. All the bartenders are super knowledgeable and their cocktails are on point no matter what you order.\n\nPDT should definitely be on your list if you’re planning to be in the area."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJX0ttVThRRRAB",
            "text": "I finally had the chance of visiting here and it’s a good vibe. Great drinks and good food. Can never go wrong with a good speak easy. The bartenders are cool and attentive. The music was jamming and the setting is very intimate. Great for a nice date."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPeUM4ZVNQM043UVd3EAE",
            "text": "This speakeasy is the real deal.  From the hidden entrance in a basement hot dog joint, to the ambiance; from the amazing bartenders to the drinks; and yes, even the hot dogs!  This place hits all the marks.  Highly recommend for a night out and something different!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MUx6MkRnEAE",
            "text": "These were some of the best, most interesting cocktails I’ve ever had. The Fountain Cobbler is fascinating and delicious. Sam was a sensational bartender, and the food, though not at all the star, was very tasty. The Nordic Root grew more delicious and complex with every sip, and by the end of the night, might have been my favorite."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4NWIxVnpTM3A1YmxCcGJGRnBiVE5IT1V4RFYwRRAB",
            "text": "First off, incredible service.\n\nMauricio was our bartender, he had no idea it was my birthday until the very end but up until the point he was great.\n\nWe came in after wandering around east village and stumbled in, no wait, we walked right in to a semi busy bar. But not too loud. You can still hear each other without having to raise your voice.\n\nMauricio and I had a moment to talk in Spanish and he recommended me some drinks that were lovely, but truly was made this experience so worth it and a reason I would come back is because he and the other bar members gave me a card and a small custom drink on the house as a birthday gift. In New York, that feels really uncommon so shoutout to this place. Couldn’t recommend it enough . Mauricio is a gem."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYcnU2bWZREAE",
            "text": "Made a reservation for 7pm on a Thursday night. Didn’t appear to be too crowded otherwise.\nAtmosphere is great for this little hidden cocktail bar.\nTried the Shark and Black Diamond.\nThe Shark was good though not nearly as amazing as the Black Diamond turned out to me.\nThe Black Diamond had amazing aromatics and a velvety foam on top. It was quite an amazing coffee based drink.\nBased on these two drinks I wish I had time to sample more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucGVENDBnRRAB",
            "text": "A pilgrimage to one of the first speakeasy style bars in the city. It was a great bar and a well-curated experience, but did feel a little past its prime, or maybe it was just an off night.\nThey had just started with their updated menu, and the bartender seemed a little unsure about how to describe some of the drinks on the menu and was very vague when answering questions about some of the components in the menu drinks. So we were kind of on our own to figure out the menu, but the drinks were ultimately really good. The vibe was excellent and very relaxed early on a weekday night.\nStill was a great experience to be at such a storied cocktail bar, and worth a visit."
        },
        {
            "date": "6달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbE9MT0ZREAE",
            "text": "Jeden z obowiązkowych punktów do odwiedzenia w Nowym Yorku! Zmierzając do tego baru, 3-krotnie przechodziliśmy obok wejścia i nie mogliśmy trafić. Postanowiliśmy usiąść w barze obok i poczekać na znajomych. Wejście udało się zlokalizować dzięki Chat GPT. Znajomi, którzy nie wiedzieli na czym polega fenomen tego miejsca byli w totalnym szoku, na nas również ten lokal zrobił ogromne wrażenie.\nUkryte wejście, przemiła obsługa i klimat tego miejsca… zdecydowanie trzeba to poczuć i przeżyć! Jeżeli chodzi o ceny drinków i piwa, mogłyby być nieco niższe, jednak mimo to, warto tutaj przyjść"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdGNERDRnRRAB",
            "text": "As a lover of a good speakeasy and hotdogs, there's no way that bias can't creep into this review. With that said, you need to go to Please Don't Tell.\n\nI had been trying for a couple of years to make it into PDT, but the timing just never seemed to work out. Finally, one Saturday night - four of us went into Crif Dogs, and picked up the phone to try our luck. It worked, and at about 11:30 we were brought into a very full, but not uncomfortable, Please Don't Tell.\n\nWe pretty much tried every dog (and tots) on the menu, and a bunch of cocktails as well - and the experience was nothing short of fantastic. The prices are reasonable for Manhattan, the service was great, and loved everything about the cocktail menu - there was something for everyone.\n\nI know it's difficult to gauge whether or not you're going to get in - but on the bright side, if it's full, you're still at a hot dog stand and a short walk from McSorley's.\n\nIn my opinion, Please Don't Tell lived up to, if not exceeded, the hype, and was a surprisingly reasonable check at the end of the night."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VLRzg1c203dTZuWHhBRRAB",
            "text": "Most of the drinks here are very good and unique. Unfortunately the service is much worse than it used to be. From forgotten orders to mixed up orders (gave an alcoholic instead of the NA drink requested!) it really brought down the experience and was extremely inconsistent with the price point.\n\nI really think the drink recipes themselves are very good, but the execution was sorely lacking."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIeklmZ2tBRRAB",
            "text": "Absolutely amazing bar. If you can get in, do it. Chloe was our bartender and she was amazing. Super down to earth, helpful and accommodating. Drinks wer excellent and the exclusive hot dogs were delicious (the David Chang dog is a must). I will definitely be back. Waited so many years to visit and it lived up to my expectations."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzaFByMHl3RRAB",
            "text": "Love speakeasy’s? Cozy Vibes? Amazing bartenders? This is the place to be!! I had a blast of time at PDT, they serve the most creative cocktails out there, and the bartenders are super fun too. We went there to celebrate my girlfriend’s birthday - they gave us complimentary champagne and birthday cocktail for her. The best part is the entrance of this place is such a cool experience - definitely a must try if you’re in town and love cocktails."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdzdxd1hREAE",
            "text": "Went for the cocktail class at 3pm and it’s about $100/person. They show you how to make 3 types of drinks and you got to take one for the road. Of course you drink each drink made which means you’ll be feeling nice nice! Super cute place and excellent service From beginning to end. They open at 5pm officially so we went back after around 7:30pm to have some more drinks and try their food. The Hanoi dog was excellent and the truffle trots EVEN BETTER!\n\nLoved the experience and neighborhood. Absolutely will recommend and cannot wait to go back"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBZzlINDRRRRAB",
            "text": "You will find the entrance to Please Don't Tell (PDT) Speakeasy by entering Crif Dogs and locating a phone booth inside on the left wall. It's recommended to have a reservation as this bar is well known and popular. Simply pick up the receiver in the phone booth and dial \"1\". This is essentially a doorbell to let them know you're looking to come inside. The drinks are clever and well crafted. The space inside is cozy and intimate. You can order food from Crif's along the lines of custom-made dogs, tater tots, and similar fare. The attraction, however, is clearly the libations that range from classic offerings to the outrageously eccentric yet delicious 😋. For example; I ordered the Fountain Cobbler - St George Absinthe, Four Roses Bourbon, Lustau Palo Cortado Sherry, Coconut, Root Beer Cordial, Lime, Maple, and Peanut Butter! I mean, WOW! WHAT A COMBO! It's hard to describe the flavors you experience in this one-of-a-kind cocktail, but it's one you'll never forget (definitely in a good way 😉). Plan ahead, reserve a spot, and be on time! Your reservation can be forfeit outside of a 15-minute grace period for, you know, life in general. Go treat yourself. This place is definitely worth the effort."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNXJTbFhnEAE",
            "text": "Love this speakeasy cocktail bar! Really enjoyed the drinks and intimate atmosphere.\n\nWe got a few drinks which were all perfectly balanced and so well crafted. Also tried the Chang Dog (couldn’t resist a bacon wrapped, kimchi adorned hot dog) and tater tots. All excellent. Bartender was super friendly and had a great time all around. Definitely try to make reservations beforehand."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNk9DQzJnRRAB",
            "text": "What a great experience! I found this spot with a quick search of bars in the area and loved the idea of a “speakeasy” where you enter through a phone booth.\n\nThe service, the food, and the drinks were all great! I really enjoyed myself and my friends had a blast. I can’t wait to go back.\n\nI highly recommend a splurge on the caviar tots. They were mouth watering!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcFBMbVl3EAE",
            "text": "Very cool speakeasy entrance.  Person at the door requested my number and said that it might be a while so I shouldn’t stay and wait.  I got the call 2.5 hours later 🤯\nFor one person!\nWhen I was brought in the bar was half empty.\nDrinks were good and decently priced for NYC."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYX2N6SU9nEAE",
            "text": "Came here without a reservation on a Tuesday night before dinner time. Service was quick & nice though the place filled up pretty fast. I had Suntory Time Machine, Fields Forever and Chang dog. STM is amazing and the rest above average. Overall great experience"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKOE5yQUNBEAE",
            "text": "Such a cool experience. Loved the speak easy entry point through the phone booth. Drinks were all so unique and everything we tried tasted amazing. Service from the doorman to the bartender were great. Highly recommend and will definitely visit again if in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bG9PUVB3EAE",
            "text": "Please Don’t Tell is a cool speakeasy hidden behind a phone booth in the Crif Dogs restaurant. You need to enter and dial the phone to get a host to come out. After you enter, the place is a small cozy bar with an extensive cocktail menu and great bar food.\n\nWe tried a few different cocktails and they were all equally well done with lots of interesting flavors. The food is also top notch with high quality hot dogs from guest chefs like David Chang and other tasty dishes like tater tots.\n\nHighly recommend making a reservation first as I’ve tried multiple times to come here and it can get full quickly without one."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKSVoyaG9SMUZhU25CWFFrbFZNVXBXVUdOSWMxRRAB",
            "text": "The phone booth entrance is very cool but that’s where the positives end. The service was painfully slow and it took a long time to get our initial drinks. We were never asked if we wanted another round so we decided to just close out which took a lot of effort to do so. If you’re looking for a speakeasy cocktail experience there are a lot more bars in nyc that have a great experience, service, and cocktails. It’s simply not worth it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoOFpfdS1RRRAB",
            "text": "Excellent speakeasy inside of a hotdog store. Definitely get reservations first! We enjoyed some of the best cocktails in NYC, including a couple with Japanese whiskey and a classic rum cocktail. All of them were an experience with multiple flavors, appearing and disappearing after each sip. Truly masterful mixologist work here.\nThe vibe is business casual and the service was efficient. Great place for a date or a small group of friends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqdWZqZmNnEAE",
            "text": "I'm a little stingy with five star reviews, but this place is just the coolest. I am 100% a fan of secret doors, but even without the tiny telephone booth, PDT is great. Crif Dogs is awesome too, so no complaints there. The staff is super friendly and helpful (shout out to my guy from upstate), and the menu is solid. Then, when you actually get to PDT, anyone who's telling you it's all about the cocktails has their head in the sand. The hotdogs can be made bunless (some sort of lettuce wrap thing), and they're exclusive. The tots, too, are fancier than the varieties found at Crif's, and are delicious. Get the bacon tots and thank me later. The bartenders are knowledgeable, personable, and otherwise unobtrusive. I got a specialty drink and a custom crafted cocktail (a Cuban sour? Delicious? Rum and apricot and lemon and the frothiest egg white known to man?) and regret nothing. Most folks I saw were together in groups, but I went solo and sat at the bar for two hours and read a book (it went great with the drinks and the tots) and wasn't bothered in the least. Make a reservation - this place was FULL on a Monday at 5:30PM."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcmZyTE9REAE",
            "text": "What a fun experience for a bar! We first started with chef’s choice (aka the cashier chose) of a hotdog that had elote on it and was one of the best things we ate while in NYC! We then tried the Slings & Arroz (Scotch, horchata, allspice dram, cinnamon, walnut, egg) which was interesting, more of a desert so we probably shouldn’t have started off that way. The second was much more my speed and we both really enjoyed the Black Diamond (Rum, crème de cacao, orange rum liquor, cold brew, alchermes, dulce de leche, macadamia), probably because the bartender suggested this one and they can do no wrong!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNDhLSHlRRRAB",
            "text": "Like many speakeasies in town, this one has an interesting entrance by a hot dog shop. Then there is an old phone booth where you dial (1) which is the bell for the speakeasy.…"
        }
    ],
    "reviews_count": 82
}