{
    "name": "The Wayland",
    "place_id": "ChIJZeSUWndZwokRwwxbW4B4nHM",
    "grid": "MN3",
    "address": "700 E 9th St, New York, NY 10009, USA",
    "rating": 4.6,
    "user_ratings_total": 871,
    "phone_number": "(212) 777-7022",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZM1VFNUVkR2gyYkc1UlNXNHRZME5tZWtWeVNrRRAB",
            "text": "Great local bar. Didn't have anything to eat, but the atmosphere was wonderfull."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0Mk0zSkhORWh0UzFGc1dEaFhNMDFxVEhsNlZYYxAB",
            "text": "The nuts and the burger. Incredible. Drinks are fantastic"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VWNHZFBjRWs1VDIxemFYUmxiVXRrVkRKcWVYYxAB",
            "text": "Best spot in EV !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xc1JGZHpjVjl3VlVGdFgwbFNYeTA0VFdWV01HYxAB",
            "text": "Danielle and Dez went ABOVE AND BEYOND for me. I have never met employees who care so much about the establishment and the patrons. They deserve the world and made me experience here so incredible"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFMWRsSnNXRXBDVUZrd2RHTXRTRUZGTWxObGEwRRAB",
            "text": "Great bar with rustic vibe. Very knowledgeable bartenders. 10/10 Martinis."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WeVFXcEpabnBHWlV4YVp6TnpaVEU0VW5OTFlrRRAB",
            "text": "Exceptional drinks. The smokey old fashioned is phenomenal with a true campfire scent. I had the smash burger and it was just delicious. Not too overwhelming and not too thin."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwblFtZEZSMHh2WmxaQlVHMURhbFZoV2s5cmVWRRAB",
            "text": "Outstanding cocktails and great food to go with the bevs. Must try the garden marg and we enjoyed the watermelon crush for their summer drink. The smash burger and fries were super yum and the country and honky tonk music is always spot on. We love this east village bar!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xobWR6RnBRbGR0WDNZd1JFcDRPWG8xVlY5MGMwRRAB",
            "text": "I saw hot nuts were advertised on the menu so I was eager to gobble some up, however when the waiter presented the hot nuts they were not very hot at all but in fact were very sticky and glistening with glaze. The nut glaze got all over my fingers and then I wiped them on my pants leaving a sticky mess. Overall the ambience was great but would skip the nuts next time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUmFqTnBTRkZDWTJsMlZUTkNhQzExVTBoamNYYxAB",
            "text": "Interesting on YouTube"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zeVNtOUlhM0ZqU2xWS2JFOTRabkZTZVhoQ1NuYxAB",
            "text": "Great ambiance"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KRlV6aHpTbFV3YlRkbFVEWnBOV2Q0T0c4M1luYxAB",
            "text": "Classic bar, highly recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aaldrcFBjbkpVVjI5aE5sOXRSemxtV0dkcFFVRRAB",
            "text": "It’s a nice pub. But the staff behind the bar have a volatile attitude for no reason. They are rude and aggressive. There’s a lot of other reviews saying the exact same thing about rude bar staff"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201WU1qVmZZemR1VEdaTk5WbFJSV3BqWXkxQlFXYxAB",
            "text": "Excellent Service , Food , Staff, & Location A True 5 Star Establishment"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOeWhocGF1dnYzQWNnEAE",
            "text": "Nice date spot"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQejgyTHVMak9hc0JnEAE",
            "text": "love love love this place. kale marg - 10/10"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKTDAwOHZhck92dHpBRRAB",
            "text": "After a long day of walking across town, these happy hour drinks were exactly what we needed! Sitting by the window and people-watch in this lovely ambiance was perfect. Not too much noise, great service, would come back!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnenByaVVBEAE",
            "text": "This happy hour was absolutely enjoyable! While the cocktails were a bit on the sweeter side, the ambiance and service more than made up for it. I’m really looking forward to them introducing some small plates or tapas options to complement the drinks in the future!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3cnIzNWZREAE",
            "text": "The Wayland was a delightful discovery. I was captivated by the vintage charm and rustic vibe of the place. The cocktails I sampled were flavorful and perfectly balanced. Although I didn’t get a chance to try the food, the menu seemed intriguing. I’d certainly return just for the cocktails—they’re reason enough to visit."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPdjItT3ZRbjdtTDdRRRAB",
            "text": "The best oysters in the area with a variety of cocktails to enjoy with your friends"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJXzQtTU9jdWR6MkNREAE",
            "text": "Top tier cocktails in the East Village, great service too"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VNZVMtUGlKMGZ6MWt3RRAB",
            "text": "Service was friendly, but the drinks were mediocre and they have the gall to charge you an extra $1 if you want a drink on the rocks"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvazhMeFJnEAE",
            "text": "Great happy hour"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbDZPWUh3EAE",
            "text": "Such a cool atmosphere!\nGreat cocktails. And such a cool vibe."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJN0xQVmxnRRAB",
            "text": "Tienen un happy hour oysters maravilloso, versiones de cóctel deliciosas como margarita con kale y bocadilllos como el de pollo que recomiendo muchísimo, delicioso!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJODlHVFN3EAE",
            "text": "Love the cocktails wanna try them alllllll."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBdGVqa0dBEAE",
            "text": "Amazing experience. The bartender Jennifer is the nicest person and makes the best drinks. I can’t see myself going anywhere else now. Highly recommend coming to see what the bar has to offer"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBeE9UZnFRRRAB",
            "text": "One of the best cocktail bars in the city!!! The bartender - Josh, did a great job in recommending me just the right cocktails!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcExIQWlBRRAB",
            "text": "Cool place with cool drinks. Good snacks but small sizes"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYcnRUR0xnEAE",
            "text": "Such a great bar, the cocktails are creative and brilliantly made. The atmosphere here is decent. Upmarket, buzzy but not pretentious.\n\nWell worth a visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcG9qVzN3RRAB",
            "text": "Great spot for a drink w/ friends"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3MmQ3OFd3EAE",
            "text": "Nice ambiance.  Good drinks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3b3JtTjVRRRAB",
            "text": "I loved this happy hour! The oysters were not the freshest - but the salads were really good. HOPING they add French fries to the menu"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiMnVxZzlnRRAB",
            "text": "Green drink marg was incredible. Great music, fast service, and good atmosphere but no A/C. Beware if you run hot. Will be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNieExQa0dBEAE",
            "text": "The Wayland has never not been a vibe - I've been coming here for years. Sitting at the bar with a refreshing Honeydew Spritz will turn your day right around. I love the open air atmosphere, and at night there is live music depending on the day. It's just a solid jumping off point for any night in the east village"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyMDVHNjlBRRAB",
            "text": "We organized a party last weekend for my son's upcoming wedding. The open bar was great, and the drinks, like the espresso martini and old fashioned, were well made. We also enjoyed delicious food, including thick bread, cheeses, cold cuts, and tasty oysters. The staff were friendly and patient, helping make the event a success. This place has become a favorite with its amazing cocktails and cozy atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMOTRLZDFBRRAB",
            "text": "If it’s possible to master the elusive art of bartending Jenny at the Wayland has done it. immaculate vibes, relaxed yet stylish decor, clean bathrooms, cold beer.  All around excellent bar. Cheers 🍻…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMc08zckV3EAE",
            "text": "The Wayland was a pleasant surprise. I loved the vintage and rustic atmosphere. The cocktails I tried were tasty and well-balanced. I would definitely come back. The menu looked interesting; I didn't try the food, but the cocktails alone make it worth a visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcHFhX0JnEAE",
            "text": "Very cute restaurant. They open the front when the weather is nice which brings the outdoors in. They also have lovely sidewalk seating. It's not great for groups larger than 6 and even 6 it can be a bit tight. Happy hour menu is pretty good. Definitely a fun spot off the beaten path to meet up with friends or a casual date night."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUMU5YVkRBEAE",
            "text": "Wonderful neighborhood spot with a good happy hour"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUalptNFhBEAE",
            "text": "coolest bar in alphabet city. delicious food, epic cocktails, perfect vibe."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXeWR5R053EAE",
            "text": "개짱\n근데술취한사람들은왜이렇게시끄러울까요\n가게노래소리좀만줄이면좋겠음\n근데진짜개짱\n칵테일도맛있고가격도적당"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaa0pIT3NRRRAB",
            "text": "Made a reservation for 8 people for 4:30pm and the only spot for large groups is the bench by the big window, which is exactly the spot I wanted. The rest of the restaurant has smaller tables for 2. Overall, the vibes were warm and homey, but elevated.\nTheir cocktails and all the food we tried were delicious!\nThe service was top notch; our server was very attentive and lovely. One of my friends is vegan and they were accommodating and were able to confirm if something was vegan for her.\nHighly recommend checking out for a chill spot to catch up with friends over some delicious drinks and food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcFA2NkdnEAE",
            "text": "A reasonable priced restaurant by NYC standard and a cute little gem around the area.\nArrived without a reservation but the hostess was really nice to arrange a seat. Love the happy hour menu, oysters, margaritas were well made. Fantastic!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLOWIyUHdRRRAB",
            "text": "The presentation was nice. I’m not a cocktail person, but my husband loved the drinks here.…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBcE5DR2pnRRAB",
            "text": "The Wayland is a great brunch and drinks spot when it's not crowded or when there are only a few folks at the bar. It gets excellent sunlight especially in the Summer. The drinks and the food are both prepared well and the service is generally good depending on the mood of the bartenders or the wait staff.\n\nI recommend getting a window seat next to the piano as it's pretty comfortable there. A seat the bar isn't bad either, but you leave yourself open to a rowdy experience.\n\nOverall, the Wayland is a terrific spot, but if you really want a superb cocktail go to MACE diagonally across the street, but be warned that the drinks are NOT cheap (but worth it)."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdS1ESml3RRAB",
            "text": "Amazing late night bar. Cocktails and other libations are awesome. The best part about this place is the energy and vibe to close and get it done - whatever you are into.  Smoked and Roasted  - The Moxie were very good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoN1pxaUxREAE",
            "text": "Cozy atmosphere, friendly staff, nice cocktails. The cocktails are relatively reasonably priced ($15) given location and quality. The anchovies were really tasty! Would go again."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqNGRib1F3EAE",
            "text": "Took a small group here on a Saturday night around 8PM. The vibe instead was crowded so we sat outside, but it was nice. There was an outdoor \"bar\" seating area flush against the restaurant façade, so we weren't on the sidewalk or in the street. The service was surprisingly quick and effortless, the drinks were pretty good. I particularly loved the School Lunch - a super grown up pb&j (with booze, obviously). I've heard good things about their food (the sausage & ricotta toast really had me pondering) but we just went for drinks. The watermelon gose wasn't anything particularly flavorful, but the I Hear Banjos! was great too, fruity and tart without veering into dessert cocktail territory. Drinks are on the cheaper side for this area, $16 for a specialty cocktail. I'd recommend for small groups or a casual hang."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWci1fWXFnRRAB",
            "text": "The Wayland is an absolute gem of a neighborhood bar! Initially drawn in by their enticing happy hour, I quickly discovered that this place is much more than just discounted drinks. The ambiance is charming, cozy, and incredibly welcoming – the kind of spot that feels like a second home.\n\nMy experience was made even more delightful by the friendly bartender, Francisco, who not only served with a genuine smile but also shared insightful recommendations about the menu and his favorite places in the city. It's evident that the staff takes pride in creating a warm and inviting atmosphere.\n\nNow, let's talk about the Pernil sandwich. Wow! Unexpectedly ordering it turned out to be a game-changer. It's quite possibly the best sandwich I've ever had, and I've had my fair share in NYC. The casual order turned into one of my favorite meals in the city. Kudos to The Wayland for elevating the bar food game.\n\nAnd, of course, the drinks! My wife had the best Manhattan she's ever had in the city. The Wayland certainly knows how to craft exceptional cocktails, adding another layer of excellence to the overall experience."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtelplZmRBEAE",
            "text": "We came here on NYE and did the open bar package, and are so glad we did! We had a great time - the staff here are really incredible. They were attentive all night, we never were without a drink. Cocktails were very good, highly recommend…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvcTRudklBEAE",
            "text": "Great happy hour prices. It wasn’t busy on Wednesday night, music is not too loud so you can actually hear your date. Vibe is very romantic, oysters was fresh, food is amazing and cocktails were good, too. Cozy and comfy place. We had 5…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3ME8zT3JnRRAB",
            "text": "My wife took me here as part of one of the many stops for my birthday, this place is so rustic and feels very mid century. The menus have many different unique drinks to choose from. The drinks are strong and are really good! They also serve food but we only had drinks. Really cool atmosphere and all the staff were incredible!!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBZ01ITFF3EAE",
            "text": "The explosion of bars serving serious, well-made cocktails in New York has been well documented and for the most part, sincerely appreciated. Yet, inevitably, several of these institutions add a dash of pretentiousness to their muddled, swirled and strained concoctions. So where can one enjoy a serious drink without the attitude? Enter The Wayland. Located in a part of the East Village that is no stranger to a great cocktail bar, The Wayland’s tag line says it best: Small But Strong. Every drinker will be sure to find something pleasing on their concise list of 7-8 house specialities and if not, all of their bartender’s are well-versed in the classics and then some. Quietly boasting one of the better Happy Hour menus in the city ($7 Sazeracs and $1 oysters) as well as an incredible roster of well-priced sandwiches, The Wayland is a great example of what a cocktail bar should be: strong, inventive and cared for drinks that are meant to be enjoyed not quietly worshipped; it’s a bar after all."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXNTUzMzVnRRAB",
            "text": "Great atmosphere and really good cocktails. The happy hour drinks and HH oysters were perfect before heading out to dinner!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRM292YXN3RRAB",
            "text": "We host my friend’s’ surprise engagement party at The Wayland! They were so generous and gave us a great space. They were constantly checking in and making are we had everything we needed! Plus amazing food and cocktails!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdU9mcVB3EAE",
            "text": "Loved it! Great atmosphere,  friendly,  attentive service.  Awesome food! Cauliflower was tasty,  a bit spicy,  crunchy.  Sausage bread... well,  it's sausage and toasted bread,  what could be wrong with that? $1 oysters during a nice,  lengthy happy hour.  Bartender was great.  Drinks are inventive and delicious."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjX09IRk5REAE",
            "text": "(Reviewed during COVID-19). Cocktails (single and double serving) to go! All come with a bag of chips. We got the mezcal and pineapple. Head to Tompkins Square Park after for some people watching."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRaE1lRmRREAE",
            "text": "Visiting from the UK - came for happy hour! The cocktails were yummmm (we had the margaritas which have chili salt around the glass) and my boyfriend had the fresh oysters for $1 each. The place has a really cool vibe and a cool decor of exposed wood and hanging lanterns, kind of like a hipster hobbit home (with a cool bar!)"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZNGJiclJREAE",
            "text": "Amazing margaritas and oysters! We came in early, but the place got crowded less than an hour after opening. The service is really dependent on the barman serving you, but all around great cocktails!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURta3JLNlRREAE",
            "text": "Happy Hour oysters were really good here! The decor of the restaurant is really nice and the staff are friendly. A cute intimate spot or place to catch up with friends."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVZ09XUi1RRRAB",
            "text": "The not so secret bar of Alphabet City. This place has a great rating for a reason. Lovely staff, great drinks and food menu. 100% recommend the margarita and from the food menu the Brussels hash."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOLXNiRkRREAE",
            "text": "Great atmosphere, great drinks, but not for strollers after 5 PM, mostly because it's difficult to maneuver around all the cool people out for the night!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpOG9hQ3JBRRAB",
            "text": "Fav place to grab a drink or two and there crispy cauliflower amazing !!!! I also tasted the  Burger omg to die for so tastttty must have the burger !! I also put a drink bc they have such yummy drinks"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvNTYtUDBnRRAB",
            "text": "Great place.  Went for brunch and spent a few hours. Did not feel rushed. Nice atmosphere and interesting drinks. Food was very good, only disappointment was that they were out of the sausage bread.  Blueberry corn cakes were delicious.  Very accommodating and friendly staff."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvaWF6eEFnEAE",
            "text": "Sat at the bar first as I waited for my guest. The bartender (guy) was extremely friendly and funny! Made me an excellent margarita. I really enjoyed his presence!\nWe later sat at a table, I wish I could say the service was extended, but our waitress seemed uncomfortable and made us feel awkward. I’ve never really had an experience like that. It’s hard to explain, but every time she came over it was like she was just starring waiting for us to talk. The whole table which was 6 of us, felt the exact same way. She showed no initiative.. however the food was phenomenal. The cauliflower and braised beef dish were my favorites! the drinks are very cool as well! They also have live music here! But that night we went I believe the band was a bit late so we missed the show! I would definitely come back and enjoy the bartenders atmosphere again!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxcDhQbHdRRRAB",
            "text": "Great cocktail bar to converse with friends. Francisco the bartender was amazing at making recommendations and crafting some great tasting beverages."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwOElEdGRnEAE",
            "text": "Good drinks/food and great vibe! I really enjoyed the potato wedges and aioli."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRZ0k2d253RRAB",
            "text": "Nice service and great oysters only $1! Only at 5-7 pm, it’s their happy hours."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlNV9Qa0pnEAE",
            "text": "The cocktails here are wonderful and the location and vibe are really nice for summer. I would recommend the garden margarita, it’s extremely unique and is my go-to."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXMzVhc0FREAE",
            "text": "A true hidden gem in the city. Home of I Hear Banjos, my favorite whiskey cocktail. If you like smoke and booze, this drink is for you."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBM1BUeV9RRRAB",
            "text": "Wednesday is great for the jazz band playing all night. Also a great place for the cocktails. They are 14$ but worth it. I had my Canteloupe with rum and Aperol. Other to consider are the sours..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEc3NMTUFnEAE",
            "text": "Cool spot for drinks. Staff are super friendly and accommodating. The vibe is great. Only downside is the “surface area” of the bar is not great with the layout, and you sometimes have to wait a while to get a drink. But it’s not terrible. Would recommend!"
        }
    ],
    "reviews_count": 72
}