{
    "name": "Beauty & Essex",
    "place_id": "ChIJJWCTb4FZwokRLe7HgJSuHFI",
    "grid": "MN3",
    "address": "146 Essex St, New York, NY 10002, USA",
    "rating": 4.4,
    "user_ratings_total": 3880,
    "phone_number": "(212) 614-0146",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwNVNtbzJZMVpDTmxCVVNreDRXSFpmYjBkV1RWRRAB",
            "text": "Amazing brunch experience. Oddly empty for weekend brunch which is a real shame, but great for those who hate the usual claustrophobic NYC dining experience.\n\nEverything we ordered was amazing. The ambiance, unique setting and food were all impeccable. Definitely marking this place down as a favorite to bring out of town friends to."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCemNtVjBlWFJPV1VGU2VHVkxRMU5yVW10SGFIYxAB",
            "text": "Spent my birthday here and could not have felt more special. The customer service is completely in a league of its own. The staff was so on top of every second of dinner, the food was DELICIOUS, and the atmosphere is absolutely beautiful and peaceful. Cannot recommend this place enough - they keep their own standards so high, they can only surpass yours.\nThank you so much to everyone tonight that made me feel so special."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWVduVTNjRk5OTm5SWU0yZHBObGwxU2pnMldWRRAB",
            "text": "Movie!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5VWJtNWhaR05YT1ZCU1UxVnhaekE0VEVoRVVXYxAB",
            "text": "Went last night to celebrate my sisters 21st and was very pleased!  Our waiter Zach was awesome with great energy and was on top of everything. We enjoyed every drink, food suggestion, and the atmosphere was 10/10."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWGRTMWhkemhZVWtSMllXNTFNVXBqVlVzeVZGRRAB",
            "text": "From start to finish, everything at Beauty & Essex was amazing. Randy, our server, was absolutely incredible — attentive, friendly, and truly made our night special. Edwin, the manager, also went above and beyond to make sure everything was perfect.\n\nBefore our dinner, I spoke with Kayla about setting up a pre-fixe menu and drink package, and she was so helpful and patient with all my questions and requests. Thanks to her, my sister’s birthday dinner turned out amazing!\n\nEvery single person we encountered was kind and welcoming. The service, food, and atmosphere were all top-notch. I highly recommend this place to everyone looking for a great dining experience!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WclNETnZkSEJ0ZW5NM2MxQXhYM1J6ZVhoV1QzYxAB",
            "text": "We had a lovely experience at B&E! The ambience was so awesome. The drinks were amazing. The food was delicious - standout menu items for us were the wonton tacos, lamb chops and Kyoto carrots. Our server was super friendly and helpful. 10/10 would go back next time we are in NYC!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210a2RsRkpkbEkwZWxkZlgycElNbmRUYkVSV2MzYxAB",
            "text": "I had an amazing time at Beauty & Essex! From the moment I walked in, the vibe was electric — great music, a gorgeous atmosphere, and an incredibly welcoming staff. Our waiter was so kind and helpful, really elevating the whole experience.\nFood highlights:\nFish Tacos – 6/10: A nice kick of spice!\nMac & Cheese – 7/10: Super comforting and cheesy.\nChicken Meatballs – 10/10: Absolutely delicious — a must-try!\nSalmon – 10/10: Cooked perfectly and full of flavor.\nCarrots – 6/10: A little on the sweet side, but still tasty.\nThe drinks were just as impressive — especially the Lychee cocktail, which was a standout!\nI truly loved everything about this restaurant and will definitely be back. Great food, great service, great vibe — highly recommend!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwaUpEclJREAE",
            "text": "What an amazing time\nWe had !!! Nicole ~just a peach ., accomodating  , personable , sweet as pie and very professional .. Andres ~ not only looks like a model, ,, treats guests like celebrities, superb customer service , very exquisite... both are truly an\nAsset too Beauty & Essex ❤️❤️ loved my experience with my daughters . Had the BEST TIME!!!! look forward  to the next time\nBack with m husband ..😃"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRNFRVOTRNMjVsYWxOWllqSlBZVVJhVjB4cGVVRRAB",
            "text": "It's a lovely venue and the food was of good standard. I did not appreciate the fact they didn't accept payment on phone and as a result of that, we were held back until the manager spoke to us and found it hard to believe none of us on the table had a tangible credit card with us.\nAfter we exchanged some words he went to send us a payment link but that was a bizarre ending that has affected my experience to what was before a pleasant evening"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4aHV5bXRnRRAB",
            "text": "A hidden gem. Great atmosphere but don't be surprised by the prices - you are paying for a high quality culinary experience that is not easily matched in NYC."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twSUxUaHJZa0Y2T1ZkNlNqQjRjRXc1TjFaRVpIYxAB",
            "text": "The food and atmosphere was great! I would definitely recommend."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWaVgwUjFaSFl0TFRCdlpuZGZXVXhwUTFGSlkwRRAB",
            "text": "Inolvidable cena con amigos de New York q nos sorprendieron gratamente tanto con el lugar, su decoración,  el ambiente....en fin. Será dificil devolver el nivel de la velada."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjeFpVUnJZakpOZUdKbU9FWlhjbVkyUVhaeVgxRRAB",
            "text": "Great dinner experience! From the moment we stepped into restaurant it was an amazing experience. Our waiter went above and beyond to make our dinner a memorable experience"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMlVWWTBja3RxVUVoTlZFZFRaVWhvWkhGVGRVRRAB",
            "text": "I had an amazing experience at Beauty & Essex! The atmosphere was absolutely incredible! so vibrant and welcoming. The food was delicious, every dish was packed with flavor and beautifully presented. The service was top-notch, and the staff made us feel right at home. A special shoutout to Manager Edwin, who came by to greet our table and showed the best hospitality."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201WmNqTnFjRWxaYnpOWmVqUkdVVzR5UW1kalZsRRAB",
            "text": "Amazing service, the food was delicious and the ambiance just adds to the experience. The black bottom butterscotch pot de crème was the star for me. Definitely will be coming back here again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RmRtSk1NVlJ2U0hKSVlVNUxPSEowV2sxNVMyYxAB",
            "text": "Was a bit busy so our server wasn't very attentive and our meals too forever to be served"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VMlRHczFiMFZtV0RKWGNEZ3lObU5VYUVwdmRGRRAB",
            "text": "Very relaxed atmosphere.  Just wanted to realax and wind down"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SSFdtaDNjMDVuVFRKUGRYbzFUbTluV2twd1YyYxAB",
            "text": "One of the best meals, with some of the most subpar food I've ever experienced in NYC. Allow me to explain: the Hospitality is off the charts - Ahmed and the team were exceptional. The small but detailed touches of hospitality truly made our anniversary celebration one that will never be forgotten. The chef coming out with a candle and a cupcake to wish us a happy anniversary? Mind blown. But...the actual food itself? I genuinely can't say there was a dish that had me feeling like I gotta come back. We had combined Restaurant Week (birria empanadas, short rib meatballs, and \"LES\" doughnuts) with Rhode Island lobster rolls, beef wellington, truffle mac n cheese, and onion rings. Unfortunately, my wife said that the onion rings were her favorite. If anything, we might come back for a drink amongst the gorgeous ambiance and maybe consider some light snacks. 11/10 for the service and hospitality"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xRlFXeGpRWFpWZFRKdVNYZENkRUptYW5oaExWRRAB",
            "text": "Was expecting more"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CRlMxRlVWMmxJTmxsc01ITXpUVTVuYldweVQzYxAB",
            "text": "During my recent visit to this charming restaurant, I was incredibly pleased by the kind and attentive service provided by our waiter Randy. His suggestions turned out to be all hits, enhancing the dining experience. The food was flavorful, filling, and each bite was thoroughly enjoyed, making for a truly satisfying meal. The ambience was lovely and exactly as portrayed in the photos—cozy yet vibrant, creating the perfect setting for a date night, a night out with friends, or simply enjoying good food and great vibes. I was so stuffed from all the delicious dishes that I didn't have room for dessert, but I definitely plan to leave some space next time to indulge in the delightful Wonder Wheel dessert. Overall, a fantastic spot that I highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkWVJtUlhjV05sYTFsYVNHZHpPRmt4VFRoWk5GRRAB",
            "text": "First off, the food was good. Have no complaints about that. The service on the other hand was not as good. The waitress forgot one of our guest drinks and never came back to give it to her. We had to ask three times and then the food came out Cold for two of our guests and by the time they brought out new food, everybody else was done with their dinner. The manager came over to apologize, but I think there could’ve been some compensation offered for the wait…..anything like a free drink or dessert something it was very inconvenient and nothing was offered\nI just think the wait staff and the management did not handle the situation well and needs training. It was not a smooth dinner at all"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wS2RsOVVlWHBpUm5BNFkzUmhSbVpGWlU5aVNFRRAB",
            "text": "The speakeasy-style ambiance of the restaurant was absolutely captivating, making it an ideal setting for a romantic date night or a delightful dinner with friends. My friends and I had the pleasure of dining during Restaurant Week, which has been extended until the end of August 2025. Among the delectable dishes offered, the Birria Empanadas, Gochujang Salmon, and the “LES,NYC” doughnuts stood out as the best from each category. The doughnuts were so delectable that we couldn’t resist ordering them separately. In a last-minute decision, we decided to try the lobster Mac and cheese, but it had a twist, resembling a truffle pasta rather than traditional mac and cheese.\n\nOne thing that ladies should definitely take advantage of is pictures in their gorgeous bathroom!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psRVJqUmphR0ZHVVZad1IzQTBMWFF3VEdSZmFtYxAB",
            "text": "Brunch Bliss at Beauty & Essex 🌟\nWe just wrapped up an unforgettable brunch at Beauty & Essex, and we’re still swooning! From the moment we walked in, the vibe was chic and welcoming—but what truly made the experience shine was our phenomenal server, Jonathan. Attentive, warm, and effortlessly cool, he made us feel like VIPs from start to finish.  And he play my birthday game!!\n\nI had the frittata, which was a dreamy blend of fluffy eggs, fresh herbs, and perfectly roasted veggies—light yet satisfying. Vicki went with the shakshuka, and let’s just say: bold flavors, rich tomato goodness, and the ideal amount of spice. Both dishes were beautifully plated and bursting with flavor.\n\nAnd can you say BACON. The best bacon ever, Smokey with a very light maple glaze.  It was perfection!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaclZWbDFhRTlyZG1oTFdsaGpkV2hXUXpSbWExRRAB",
            "text": "Beets are so underrated, thank you for elevating the beets and goat cheese dish!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xONE5tTlNUM0ZXWDE5d1pVTnRVazFSTTNGbExYYxAB",
            "text": "Sitio increíble para una cena romántica, el restaurante es super elegante con un ambientazo y la comida es de otro nivel, todo es alucinante y si puedes luego de la comida tomarte una copa en la barra es una noche perfecta !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21saVZtUlJZWEI0Y3pKUlNETk5NemRMVXprMGFsRRAB",
            "text": "Food is GREAT, service, professionalism, ambiance, and welcomeness is NOT. Way too crowded in dining room, my chair touched the tables chair behind me. Our waitress was nice and took care of us but the assistants who poured water and helped were incredibly rude. The leaf on our table folded mid way through the meal and made a few things fall off. We asked for help and they seemed annoyed that we needed to get our table back to being straight like a table…. Like I said the food was so amazing but the hosts didn’t greet us, we waiting an extra 20 minutes past our reservation time and service was extremely slow. I’d go back but maybe To-Go."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VelRYaEljalkwTXkxSVlXUXpPVGhyT0ZGSFJXYxAB",
            "text": "Beauty & Essex is hands down worth every cent. The staff was amazing and knowledgeable. Their recommendations were spot on and nothing less than perfect. The tomato soup and grilled cheese was absolutely my favorite.\nThis Speakeasy is neatly disguise as a pawn shop upon entry. I definitely will be back again and again and again!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FdGFIRmxjbFZuVVdGWk4zTTVhM3BsV21wbU9VRRAB",
            "text": "I came here for a friend's birthday and it was a cute spot! Hidden behind a pawn shop, this spacious restaurant is great for a night out with the girls or on a date. Service was a bit slow (it took us ~15 minutes between the time they said they would seat us AND when they would actually seat us + some of our food arrived late), but they were very patient with us as a big party.\n\nWe got complimentary celebratory drinks, which were good but very sweet. For food, we ordered the soup dumplings (which were underwhelming), the tuna tacos (also okay), oysters, and kale salad. All of their food was alright. The only dish I would say I liked was the kale salad. Overall, the vibe here is good but the drinks and food are mediocre."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SWVJscERiVU5RYmtReWJsRlNkak5TVnpWcGMzYxAB",
            "text": "We came to Essex & Beautyy to celebrate a birthday, but the experience was ruined the moment we stepped through the door. We were “greeted” — if you can even call it that — by an unbothered Gen Z staff member who clearly had zero experience in hospitality. No smile, no warmth, no professionalism. On top of that, despite arriving on time for our reservation, we were made to wait. If I hadn’t spoken up after 25 minutes, I’m certain they would have left us standing there even longer.\n\nOur host in particular was incredibly ignorant and dismissive — the very first person you see when entering the restaurant, and yet she acted like she couldn’t care less that guests were arriving. Why is someone like this representing the place? The birthday atmosphere was gone before we even sat down.\n\nWhen we were finally seated upstairs, the room was half-empty, making the wait even more ridiculous. Yes, the food was good, but the attitude and incompetence of the downstairs staff completely overshadowed it. Those girls made it unbearable to even want to spend money here. We will not be returning."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5dldVcGlXamhzY2pCUFJ6SjVXRXBoU0ZOVlYwRRAB",
            "text": "Highly recommend! Our waiter Brendan and the Manager Jesse had incredible customer service, and the food was INCREDIBLE. If you’re looking for a great spot, definitely come to Beauty & Essex. 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNk1VVkpPRW81TWxwRWRXUk1SbGRCT1V4eldGRRAB",
            "text": "Went to Beauty & Essex for Restaurant Week and it’s a solid ⭐⭐⭐⭐⭐ from me!\n\n🥂 The vintage-meets-modern American vibe is on point. Every corner is photo-worthy — retro mirrors, spiral staircases… even the bathroom made me want to linger a little longer 😂\n\n🍽️ Every dish was perfectly executed — not a single miss.\n🥗 Highly recommend the Kale & Apple Salad — it was a table favorite!\nMy personal pick? The Peruvian Chicken — especially the zucchini underneath. So tender and flavorful."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWR1ZsbE1ZM0JyTlc1MFZXaDVjRmRsU21wU2ExRRAB",
            "text": "Honestly I was so exited to go here for birthday cocktails (spritz tower + cocktails and lite bites)  at the bar before dinner at another spot. But the bartender totally ruined the vibes. He was rude to me for no reason -  I felt like I was putting him out. Didn’t feel welcomed at all. Overall cocktails were good and happy hour deals are great. But the service made me have to take a minuet to myself before the next spot to not continue the nasty energy I received. Overall wouldn’t go back. How hard is it to be nice? Still tipped 20% because I work in the industry but for the first time in a long time I considered going lower. It’s one thing if you’re bar is busy but this was super slow hour, no reason :/"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xaGJ5MUpZV2xSUkc5Wk1sTmxZVGxoUjB0TFJuYxAB",
            "text": "At Mohegan Sun , the experience starts out with a 10 rating as the interior is beautiful and initially service is great. then it starts to make a downward trend resulting in a 6 out of 10 . we felt forgotten about as the place started getting busy and the server took on to many tables , after the food arrived iu felt the waitress disappeared and i was unable to mention that my salmon dish was not hot nor warm. it was disappointing.by the time she came back we were getting our bill and she mentioned she would let the kitchen know and see what she could do with removing it from the tab. and nothing was done. i want my water refilled all the time. why would i want to wait isnt that included in the high prices we pay isnt just  for the food the service and ambience is part of that as well , $13 for a can of beer.  the crab cake corn dogs. we make much better at our little pizzeria. and the pawn shop ?   it isnt a pawn shop its a front display. and please dont have your staff eating next to us. these 2 staff must have eaten more then the 4 of us that s when you know it isnt worth being there."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGc2FtWnFhbHBKUWs5ZlVXVnNNR3RQYUdVeVZIYxAB",
            "text": "It was one of the better meals we had in Vegas.  It can be a little dark inside so expect that.  The whole place serves smaller plate dishes to share. We went for our anniversary and enjoyed the experience.   The service was great. They even adjusted some of the entree based on what we told them our preference was without needing to ask."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWemNFUjFXRlZoWTBkM1pVdGhhMFZHVGtFMlVXYxAB",
            "text": "El trato es incomparable único muy agradable..?"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zdE5VaDRYMDFXWW1kR2NWOTBObGhqYzA5MlkyYxAB",
            "text": "Great vibes. Great food. Cute storefront. Beautiful interior. Champagne in the ladies room y'all"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kdk4ySTNlazVEUjJsekxXSTVRMDFJTW01VWFVRRAB",
            "text": "Such a hit for a bachelorette dinner. I thought the speak easy was the reason to come and then we all had the best meal we’ve had in a long time. Definitely add to your bachelorette itinerary."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcldXUjVPVjkyYzE5eVNYSmFha2hMWWpjMmIzYxAB",
            "text": "Jimmy was amazing! Will definitely be back.\nEvery dish was better than the last."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poa05tZHhVR05hY2pSc1pGUkZNMGxDZGxSc09YYxAB",
            "text": "Good  nice"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VNUxXWTVURGhxYkZOTlRIWlFNSEJqV1VveVdFRRAB",
            "text": "This place was recommended to us & we're glad we came! Great & interesting food, excellent service (Billy was our main server), cool atmosphere. There was a parking garage within a 2 minute walk. We enjoyed the blackberry cocktail, the woodsman, a latte, espresso martini, bone marrow, sliders, salmon, beef Wellington, lobster mac & cheese & the butterscotch creme de pot. WAY more than we needed but a super enjoyable date spot after an very long travel day!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMVZURjBXR1YxTTFkbmRraHZkVjlzVEZaYVFYYxAB",
            "text": "Great Speak easy restaurant, you enter through a vintage guitar store and the door is in the back of the shop. Did was a fusion of Asian and American with a French presentation. The only downside were the cocktails needed to be stronger the cocktail I had was the Old dirty bramble. Great flavor, complexity and texture were great on the palate on but needed to be a touch stronger. Food we had Peruvian chicken, Korean style fish taco, grilled shishito peppers."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kbk56aFpTMmxqTW10b1QyNWtWMHRvUzFkc09IYxAB",
            "text": "where to start… service was incredibly slow. long wait between ordering/drinks/starters/mains. they forgot items or brought wrong items out multiple times. they served undercooked salmon (it was… mushy and sticky). it was SO COLD inside the restaurant. the lights were so dim we couldn’t even see what we were eating: it was 1 small candle for a 9-person round table and food on black and dark blue plates. the music was like 2010s pop? it didn’t really match the ambiance.\n\nall that said the women’s bathroom was pretty cool, the drinks were interesting, and the entrance was pretty."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaS11LWxBRRAB",
            "text": "My cocktail Beauty Elixir was a hard zero. Strawberry purée tasted off, prosecco abysmally flat, and the parched cucumber cut as if for a kid's lunch box was a pathetic excuse for a garnish. Everyone was friendly though."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsNmMxVk9iRXN0WVhsUFEydFhUVGRxVkhkT1EzYxAB",
            "text": "The bacon is amazing with the Oreo pancakes. Brendan is the best server ever. Free donuts for a celebration of winning a baseball tournament."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SQlZHeGZlV0ZpVEZoUVJFbDJaVFZmWkZOTWVXYxAB",
            "text": "Delicious, fantastic food.\nGreat drinks\nReally cool atmosphere"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ORVh5MXVaWEpGVmtKd1UzWjRiblpUV2pGVVVVRRAB",
            "text": "Very disappointed with our experience - I wanted to give my wife a great birthday meal - saw a commercial advertising this restaurant at Mohegan Sun and thought what a cool thing to do - turns out this was not the place to experience a great event  - very expensive, small potions of food - no acknowledgement of my wife’s birthday (after we told the waiter) - and sub-par service. With all the cool restaurants at Mohegan Sun I love eating at - Beauty and Essex will not be one i ever go to again - and if asked I will be more than happy to share my disappointing experience. Very, very disappointed."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SWGIwMTZiM1J0Y1RWc2FHeEJZamw2U0ZKdWVrRRAB",
            "text": "Super cool hole in the wall\n\nFood was extremely exotic and very strong flavor. We did not enjoy.\n\nService was extremely slow 🐌"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sc1NGTnFRMk01ZW5jdFQyOXpTemxtYVZZd2NFRRAB",
            "text": "A classy & buzzy restaurant tucked away inside a pawn shop - Beauty & Essex is a lovely restaurant that offers the hip vibe from Tao with a sophisticated dining experience. The ambiance is warm & upscale with two stories complimented by pristine chandelier spiraling a staircase. It’s definitely loud & you can’t really listen much while dining. So let the food & drinks talk while you blink, smirk & banter with your peeps.\nWe tried the tasting course - definitely hit or miss but menu is mostly pleasant. Standout items were grilled cheese bacon tomato soup dumplings, gochujang salmon, strawberry shortcake & black bottom butterscotch pot de creme.\nService is quick & sharp - they also gladly let you bring your own birthday cake, cut & serve them to you.\nOverall, there’s certainly beauty out here but with its flaws - you just gotta appreciate it :)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLN3FsTGVudk1qNE1REAE",
            "text": "Beware my fiancé was really sick after eating from this restaurant on 5/30. It wasn’t our first time eating here so it was surprising. We called the very next day and asked to speak with the manager and was told we’d receive a call back. That never happened and it shows how much this restaurant cares about its patrons. We will not be frequenting again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSVRYVXpTbWRsVXpKMGFVMUtVMHhvYlRaVGVIYxAB",
            "text": "Amazing atmosphere, cocktails, and management. Cannot say enough good things about Beauty & Essex! Truly a hidden gem"
        },
        {
            "date": "수정일: 2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1dk8ySHJ3RRAB",
            "text": "진짜 존맛탱 ㅠㅠㅠ 굴 꼭드세요 고추장 타코도 맛있고 토마토 스프 샌드위치도 졸맛"
        },
        {
            "date": "8년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnb2JpMlN3EAE",
            "text": "분위기 좋아요. 입구가 기타파는 악기점처럼 되어있어서 더 멋져요. 음식도 오이스터, 립, 튜나 시켰는데 넘 맛있었어요. Goegeous!"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwNDdINmxRRRAB",
            "text": "기타 가게인줄"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNScUtPRmZ3EAE",
            "text": "분위기👍👍👍👍…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaGJMRWt3RRAB",
            "text": "Dined here in April 2025. A great little hidden gem of a place. The front is a 'pawn shop' so from the street looks non-descript. Once through the door you open up to the bar and the dining space and stairs to the  upper floor. It has that speak easy charm and the decor is fitting for the ambiance. Obviously reservations are strongly recommended. The service was exceptional. Had a group of eight and we were accommodated on a large round table and it was perfect. The food was equally good and served elegantly. I opted for the fixed 3 course menu and it had ample choices to enjoy. Definitely a good NYC find and dining establishment. Recommended for anyone wishing to experience something different yet very New York."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRlZWaHVVRXBxWVV0SE5qVXRUa0p4TTNGaGVXYxAB",
            "text": "This restaurant has a fantastic ambiance with stylish, thoughtful decor that creates a warm and inviting vibe. The food was absolutely outstanding—our highlight was the perfectly cooked salmon, bursting with flavor. My boyfriend couldn’t stop raving about it! We also enjoyed the chicken meatballs, which were tender and delicious, and the kale and apple salad was a fresh, delightful surprise. Highly recommend this spot for a memorable dining experience!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNcWp5by1SejUzMnJBRRAB",
            "text": "Beauty and Essex showcases what a great dining night should be with a touch of exploration. We went during restaurant week (8/25/24) and was given these specific menus but given the option of we wanted anything else outside of the pre-fixed menu. It’s a speakeasy that opens up to beautifully decorated interior restaurant that stands out. Let’s start off with the food. The food is great! There are specific standouts here that I should mention.\nThe Thai style deep fried shrimp 🍤, it’s so crunchy and delicious. It’s an explosion of seer and savory that lots of restaurants cannot get right and this one does 🙂. The sauce. Nuff said.\nThe grilled cheese, smoke bacon and tomato soup dumplings were also very delicious and soupy.\nThe Mac and cheese was very good and wasn’t so overwhelming.\nThe lamb chops were tender and nicely season and the wine reduction gave it a nice sweet finish with the mash potatoes.\nThe strawberry shortcake shots was delicious and not super sweet.\nThe Garden Party drink is probably one of the best I’ve ever had. The taste I can’t describe but sweet, creamy almost coquito like. And it’s non-alcoholic. Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvekk2Z3ZBRRAB",
            "text": "Had such a fun and memorable night at Beauty & Essex! The vibe is super cool and the food was delicious — every dish had great flavor and came out beautifully presented. The whole place has this stylish, energetic atmosphere that really adds to the experience.\n\nHuge shoutout to Ella, our bartender — she was amazing! Super friendly, made us feel welcome right away, and crafted some incredible drinks. You can really tell she knows what she’s doing and cares about giving guests a great time.\n\nDefinitely recommend this spot for a night out — great food, great drinks, and even better service. We’ll for sure be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKeUUtTnUwajlfeHRRRRAB",
            "text": "Unique atmosphere, unexpectedly pleasant retro style, delicious food, amazing selection of drinks and polite staff. Absolute must go! Good for corporate, family or friend gatherings!\n\nMust try: Lamb chops, strip steaks, onion rings. Oh, and classic  “old fashioned” 🍷"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmMHREWmZnEAE",
            "text": "Heard a lot about this place and the food was definitely worth the hype!!!\n\nEverything we had was delicious.\n\nAppetisers:\nKale & Apple Salad\nThai Deep Fried Shrimp\n\nEntrees:\nRib Eye Steak\nMac & Cheese\n\nThe steak was so soft and juicy, accompanied with the Mac & Cheese it was the perfect combo, good size portions too.\n\nService and atmosphere were really good, decent crowd.\n\nNot as expensive as one would expect it to be.\n\nWould go back for their steak…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaTlhM193RRAB",
            "text": "Great restaurant with beautiful ambiance. When we came in at 5 PM on a cold day it was a little chilly inside. The food was good. Little French Dips was good, but not great, but to each their own. Everything else was tasty. Service was very good. Very attentive and polite staff."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdlBEaXZBRRAB",
            "text": "Delicious. Everyone at the table loved their food. Particularly impressed with their tofu dish. The chocolate peanut butter cake was ridiculously good. The speakeasy entrance was really fun and the place itself is beautiful and feels luxurious. My main complaint is the it was loud and dark which made it hard to have conversation at a big table. The service was fine but nothing of note and they did bring out the wrong entrée so I had to wait until they made my did while all my friends got their food."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzN0xMYTJRRRAB",
            "text": "My daughter took me here as part of my 40th birthday celebration, I am a professional in the industry and not everything impresses me. We are also big foodies and love good ambiance, food, and service. This place did not disappoint at any time of the night! speakeasy with lots of vintage decorations, the doors open to a cozy yet elegant environment. Lots of details that set the mood for a great night! The staff was attentive and the food was well-executed. Will definitely come back and spread the word!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJd3JUYzdRRRAB",
            "text": "Ok, I have such mixed feelings here. The walk in off the street into the shop is awesome. The entrance with the grand staircase and chandelier was crazy. We sat at the bar while waiting to be seated and I loved it. The oysters were wonderful. The cocktails were wonderful. The rest of the food was eh…ok. Chicken meatballs were dry and bland. The ceviche was not really sure it was ceviche. The desert was wonderful. And our server was delightful. Service was prompt and not rushed. I want them to do better with the food, because I want to love this place"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRal8zOWF3EAE",
            "text": "I can't help but rave about my amazing 35th birthday celebration at Beauty and Essex, all thanks to the incredible Manager Edward and Server Aldo. This restaurant surpassed every expectation with its delightful cuisine and exceptional service. When I shared that I had worked there 15 years ago, they went above and beyond to make me feel special, turning my birthday into a truly memorable occasion. I highly recommend Beauty and Essex to anyone in search of an unforgettable dining experience. This place is a must-visit!\n\nEverything on the menu is great so I can't name a dish to try :)"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2eEpxZ0NnEAE",
            "text": "I wish I could give Beauty & Essex more stars and I hate giving out bad reviews. I was expecting for this place to wow me and instead it not only underwhelmed me but also left me dissatisfied. Let me start off with the appetizers. The crispy rice on my spicy salmon tartare was stale and the quality overall was lacking. On top of that, the bone marrow came in cold. However, the main courses were good but did not match the price point. Now, onto the service. The waitress was not attentive at all and completely rushed us. Our appetizers and main courses were brought in at the same time which honestly is unacceptable for an upscale restaurant like Beauty & Essex. I made them send the main courses back. Lastly, while the ambience is pretty, it felt way too crowded and we had to wait 20 minutes for our table. For the amount of money that you’re paying for this place, both the food and the service should be much better than this."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfeV9Lak5nEAE",
            "text": "The entrance through the pawn shop really sets the speakeasy vibe, creating an intriguing atmosphere from the start. The kale and apple salad was one of the tastiest I’ve had in a while—light, refreshing, and full of flavor. The chicken meatballs were unique and had a wonderful depth of taste. To finish, the dessert shooters were a fun, delicious treat. Our server was great, though the hostesses at the front desk were a bit rude and ignored us for a few minutes when we arrived. Despite that, it's definitely a spot worth checking out!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcHYyRVhnEAE",
            "text": "It’s one of the speakeasy restaurants but definitely has a very good ambience, this is inside a pawn shop, you open the door and it’s a restaurant!! They have a chandelier at the start and a huge dinning room where you have your food!! The food was good but I’ve had better in NY..it’s a must visit for the experience and the ambience"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnel9YamdnRRAB",
            "text": "My boyfriend took me here for a Valentine’s Day dinner. Restaurant was busy but the staff were nice. Food was interesting for sure but arrived to the table cold. Not sure if we liked spending that much for cold dishes."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdDZhU2d3RRAB",
            "text": "It exceeded my expectations.  Food was delicious.  Service was amazing.  From the front of street,  you don't expect such a beautiful place. Very nice atmosphere.  Give it a try and you will love it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPdWV6SW5YOXREaXZBRRAB",
            "text": "The food was good and decent portions. Drinks were also nice. Service was excellent.\n\nBe careful where you sit. They really cram you in and if sitting on a throughway you will get bumped quite a lot."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJV2gwSS13djhfU1RBEAE",
            "text": "Sunday brunch has an amazing coconut fruit parfait. The mango at the bottom with the goodness in the middle & sugar blueberries on top was having in my mouth. But my favorite out of everything was a cocktail option I was able to make into a mocktail, it originally had passionfruit but I wasn’t a fan so They were able to take the passionfruit out and only put coconut cream with lime It’s a must try.!!! The grilled cheese tomato basil dumplings were super yummy."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmc2ZHbUF3EAE",
            "text": "Decent atmosphere. Made for Instagram decor. Cocktails were good, but plenty of other places in NYC are better. The food was alright, but not memorable. If you’re coming to Beauty & Essex it’s probably for the IG pics."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfN2ZiXzBRRRAB",
            "text": "The interior had some luxury details, and looked as if it could be a nicer steakhouse. However, there were many young girls (late 20s) there, which made the place have more girl's night out vibe.\nLittle noisy. The place also smelled a lot of food (anchovis?) at certain point (wonder if they had issue with ventilation during our visit). Close between the tables.\n\nOur waitor was attentive at first (less people), but it was hard to catch his attention later when we wanted to pay. Not very welcoming.\n\nThe food was ok, but could be better. Asked for medium, but got medium-well done steak. My steak could have been more tender if cooked correctly. The apple & kale salad was nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMMU9qYUlBEAE",
            "text": "The food was good, but the overall experience was not. Our reservation was for 8:45, but we got there early and were given a table right away (the table was not in the main dining area). While at that first table, we ordered drinks, then were advised by the waitress to order the appetizers and mains all together, and explained that our order would be phased in 2 courses. While waiting for the food, the table next to us got up and alerted us of a big roach going under our table. The manager moved us into the main dining area immediately. Shortly after moving to the new table, the appetizers and food came all at once. It felt from the start like we were being rushed. After another complaint, the manager comped our appetizers due to the restaurant's error. We also overheard the table behind us complaining about another issue, and they were comped with a couple of shots. The drinks we ordered were a hit or miss; the same drink came in too sweet or two strong. Don't think we will be coming back. It seems that the overall quality and service of the place has greatly declined."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURubGRpcmNnEAE",
            "text": "I recently had the pleasure of dining at Beauty & Essex, and I must say, it was an unforgettable experience! Don’t let the pawn shop at the entrance fool you; once you step through the hidden door, you are transported into a vibrant and exotic atmosphere that sets the stage for a culinary adventure.\n\nThe food was absolutely delicious, with a diverse menu that caters to a variety of tastes. Each dish was beautifully presented and bursting with flavor. The cocktails were equally impressive, expertly crafted and perfect for complementing the meal.\n\nThe staff at Beauty & Essex truly made the experience exceptional. Our hostess was incredibly friendly and welcoming, and despite the restaurant being packed, we experienced minimal waiting time for our reserved table.\n\nOverall, I highly recommend making a reservation at Beauty & Essex when visiting NYC. It’s a delightful blend of fun, fantastic food, and a lively atmosphere that you won’t want to miss. I can’t wait to return on my next trip."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKLWVXVDhRRRAB",
            "text": "You enter through a pawn shop and are immediately struck by the vast size of the restaurant. The dress code here is “smart casual/ trendy.” We had an excellent meal, every single thing tasted delicious. The waiter recommended 6-8 plates for the 4 people we had at our table. My favorites were the kale salad, roasted beet and whipped goat cheese toast and the small French dip sandwiches. The service was amazing too. Highly recommend this, it’s a super cool spot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMDduUGt3RRAB",
            "text": "Probably one of the best meals I have had in years. Everything was delicious! The beef Wellington first came out overcooked, but the staff made it right quickly and gave us dessert on them. Our waitress gave us fabulous recommendations. The grilled cheese dumplings were to die for. Great place for a nice dinner. Definitely will be back! Oh, and the speakeasy feel added an extra layer of fun."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsOTRDZGlBRRAB",
            "text": "We went as a group of 15, got seated late but the manager more than made up for the mishap. Very professional and nice of them.\n\nWe had a more private space in the back on the first floor which was amazing. The food was amazing. Our group was big so we had to do a tasting menu ahead of time which was great - they were very helpful in choosing.  Drinks very good. Atmosphere very chic and cool.\n\nAlso to note we had someone with an allergy that they went above and beyond for to make sure they ate well still.\n\nHighly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbjhpandnRRAB",
            "text": "Amazing place, a friend took me there, otherwise I'd never found it - hidden behind a pawn shop is an amazing restaurant with a welcoming vibe, great interior design and a cuisine on a level with other Tao group restaurants. They have a couple really great chefs creating there. Seafood was fresh. Chicken meatballs tasted a little bit IKEAish, but the sauce made up for it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabExQZzlBRRAB",
            "text": "Absolutely exquisite dining experience at Beauty & Essex! From the moment you walk through the unassuming pawn shop entrance, you're transported to a world of opulence and elegance. The atmosphere is electric, with stunning chandeliers and luxurious decor setting the stage for an unforgettable meal.\n\nThe service is impeccable—attentive, knowledgeable, and perfectly timed, ensuring that your glass is never empty and your needs are met before you even realize you have them.\n\nAs for the food, it's a culinary masterpiece. From the Grilled Cheese Smoked Bacon & Tomato Soup Dumplings to the succulent Beef Wellington, every bite is a harmonious blend of flavors and textures. The cocktails are expertly crafted and the wine list is expansive, leaving no palate unsatisfied.\n\nDo yourself a favor and finish with the decadent desserts ... the perfect end to a flawless evening.\n\nIn summary, Beauty & Essex is more than just a restaurant—it's an experience that excels in every single category. Highly recommended for those looking to indulge in the finest dining New York City has to offer. 5 stars all around!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiMHJUdFNnEAE",
            "text": "I always wanted to come here. Loved the idea of a guitar/ jewelry store that opens a door to a restaurant! Super cute!! Visited during restaurant week. The kale and apple salad was really good and I mean really good. I'm a picky eater and usually don't like kale, but compared to the other options, that was the only thing I would get, and at least I'd get my veggies in. It was the best appetizer, and everyone at the table agreed. The salmon was a little on the salty side but tolerable. The chicken dish was really good. And Everyone loved their dessert! I would definitely recommend and will be coming back here!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROd2JhaWF3EAE",
            "text": "Went here with a group of 8 for restaurant week Sunday brunch/lunch and it was wonderful! Service was excellent (deeply apologetic for the delays in food service since they were backed up, and gave us shots & donuts for free), atmosphere was great (good not too loud music), gorgeous venue itself (and really cool speakeasy entrance at the front that leads to the dimmer intimate restaurant area), and HUGE food portions (almost everyone took something home). Will definitely be coming back for dinner, drinks, or their regular $35 Sunday brunch!"
        }
    ],
    "reviews_count": 83
}