{
    "name": "Rosella",
    "place_id": "ChIJj_wLYalZwokRULTcqVFlZlg",
    "grid": "MN3",
    "address": "137 Avenue A, New York, NY 10009, USA",
    "rating": 4.7,
    "user_ratings_total": 362,
    "phone_number": "(646) 422-7729",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwNVFrSmphR2t4TjJOR1YzUmxkemN6WkRkNVZFRRAB",
            "text": "Ate uni with maple syrup on a piece of sourdough toast to Skepta at this place. 10/10"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201UGJERmlWRlExWDBsR1JGQXhWMHRPVmpKSmVtYxAB",
            "text": "Rosella has decent, if a little unbalanced and over the top, Japanese food. It has a nice atmosphere and is a popular restaurant in the East Village.\n\nThe issue I had is that our server actively pushed the more expensive menu items on us. When I ordered the salmon avocado roll, he said, \"This is the $9 avocado roll.\" Later, he recommended additional items for us, and pushed a $55 uni and pork bowl (think the uni was domestic, from Maine, and it was kind of rick and cloying) and a $30 glass of sake, which was ok but not great, without mentioning the price. In their defense, they comped us a ceviche dish, which was ok.\n\nI don't mind splashing out for Japanese food, and have been to a bunch of Michelin starred Japanese restaurants. But there's a certain amount of quality expected for a $300+ Japanese meal for two people, and one of the many omakase places in the neighborhood could easily do better for that price.\n\nIt's also the antithesis of hospitality to push more expensive items on diners without mentioning what the price is. It's the principle of the matter. I actually liked the more basic items better, at any price. The whole experience left a bad taste in my mouth, and won't be back soon."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wdGJFdHVjWFJrTVVWM2FtUTFXV0pIYm5wdVdFRRAB",
            "text": "Easily the best sushi restaurant in East Village!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aaU5GTjBZbkJqWVVGVE5VTmZUbk5TWW00NVEzYxAB",
            "text": "Best restaurant in NYC by far, I selfishly don’t want you guys to blow up so that I can still come easily but you guys deserve all the credit, 10/10 amazing food and service and presentation and music"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsd2VYaDVURlpMVG5oMUxYVm9jRlJDVnpaUmNsRRAB",
            "text": "It’s been over 12 hours since dinner at Rosella last night and I am still trying to process it all. I have never experienced anything quite like it. I think last night’s meal has got to be the best meal I’ve ever had in my life. A carefully curated wine list, all the wines served at precisely the right temperature, a bougie and rustic sushi bar, friendly members of staff (shout out to Danny and Michael) full of personality, and the ceviche. Oh my goodness the ceviche. Plantain chips with a spicy seasoning? Corn? Bluefish? Lime ? It felt like an explosion of flavour - sweetness, acidity, umami, creaminess everything coming together so seamlessly. I am in awe and I probably won’t stop talking about last night for a while."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NU1uVmpObmhOUVZGcmJFbFFXREl6VVZVNE1uYxAB",
            "text": "I went for my wedding anniversary. We sat at the sushi counter which was a great experience. The chefs were so nice and offered some specials rolls/course for our anniversary. The food was delicious. We had a great time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aSlVFVkVRa2wzYlhSNmJIQkhObVZHTmpSVE4xRRAB",
            "text": "Insanely good! Augustus our chef was absolutely amazing. He recommended great options we would never normally pick - all of his reccomebdsrions blew us away. Loved it !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RlFrTlFhV0YzVGpjdFlYZEdWRTlLWm5SbmRYYxAB",
            "text": "love the sushi and wine pairings."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKMk0yWkNaVUZ1U0hrMVJqTjJZM2g1VDNScUxWRRAB",
            "text": "The food was fantastic, the hosts were friendly and laid back, and the space was comfortable and chic. Honestly, this might have been the best Omakase I've ever had. Usually, fancy Omakases are good but they tend to not have a lot of dynamic flavors outside of three or four super rich cuts like butterfish, king salmon, and wagyu. The dishes at Rosella were crafted carefully to incorporate a diverse array of flavors that created a wonderful bite that was different from the last. Truly magnificent. Can't recommend enough. Would definitely go again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnek1HaE9iMUp1U201d05uUlJiblExVW5wRFEzYxAB",
            "text": "This was my second time at Rosella and I dream of my next visit. Everything is perfect. Food is INCREDIBLE. A must visit in the city. A shoutout to Michael -you're a gem!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WbGFHOVBRMjl6TnpZeWRXY3RjVEJwTVd4ZlRYYxAB",
            "text": "Absolutely amazing food. I loved the laidback atmosphere and the attitude of Jeff and the rest of the folks working there. Michael, our server was incredibly helpful and funny. If I ever have the opportunity to eat here again I would in a heartbeat. Ps the sliders were unreal."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWSU1WWlNVWEpaTUU5MWVDMXpjMWxOYjBjMk5GRRAB",
            "text": "The XO dish is extremely salty and heavy and not balanced.\nEverything else is 5 star, service is amazing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVGFtTndTMjl4UWpkcFFUWlhkMUJwTjBnelFXYxAB",
            "text": "Easily one of the best places for sushi in NYC. Creative dishes, friendly staff, they really know what they’re doing. You won’t be disappointed by any dish!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oS01UVXdlVEJHUlU4emFYcFlhbFZsYVRjeU9WRRAB",
            "text": "We were looking for a new sushi spot and stumbled across Rosella.  It had solid reviews, so my wife and I checked it out.  WOW!!!  What an incredible experience we had.  The food was amazing!  My tastebuds were dancing and having a party in mouth.  Everything we tried was fresh, creatively inspired and thoughtfully prepared.  We were guided through the evening by a lovely gentleman named Michael, whose dulcet tones guided us through the menu and by the time we asked for our check, we were relaxed and satiated having enjoyed one of the most lovely dining experiences we've had in years."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vM1pYVXlUVzlsUTFGNFpHOUdSekJuVm1wMVYzYxAB",
            "text": "Okay so food is incredible, no doubt. And the service is top notch. Shea is so amazing at what she does - probably the best service I’ve received from an individual in the restaurant business ever."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSdXZYODZnRRAB",
            "text": "Been a few times and don't have enough great things to say. The team is attentive and fun. This time we rolled up without reservations and they were able to squeeze us in (Praise).\n\nThe food is absolutely some of the more delicious and consistent Ive had. The space is fun, wine selection covers a wide variety of small and local producers. Must try their house salad. jeez."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wT1ptMUpjVFE1UkZOblYxRjRlRE5KYkRjd1JWRRAB",
            "text": "Although strictly a la carte, each Rosella experience is “one-size-fits-one.” Staff are communicative and friendly, relaxed and confident, completely familiar with the vision and mission in a way that allows for flexibility and improvisation.\nThe quality of your meal here is as delicious and entertaining as any one star Michelin restaurant in Manhattan.\nHappy hour pricing is very approachable, but nothing is over priced on the main menu. There is an eye to the value proposition with each item."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaQ1dteG5kR041Tlc5b1NrRmtSWFl4VEdwVGIzYxAB",
            "text": "Fantastic locally sourced fish and sushi dishes. Great bartender (Michael) was super friendly and helpful. We've been a couple times and look forward to coming back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOQlVXeHFZbEUyWlZwWUxVOVRTamhITTA4MUxVRRAB",
            "text": "It's no secret that Rosella is an East Village standout, but it's taken me a while to visit finally. I met a friend for an obscenely early dinner, but we were glad for it. There were still plenty of people in the dining room, but the staff were super attentive.\n\nMost of the seating is counter seating, either in the window, at the bar, or in the back over the sushi chef. There doesn't seem to be a bad seat in the house. There is a happy hour menu, which we ordered a couple of things from, but we were primarily focused on the fish.\n\nTo get a feel for the menu, we ordered several things. The tuna with pesto and watermelon was terrific, a must-try. My friend said he never seeks out pesto, but this was something special. Next up were two spicy tuna handrolls, which were as promised, spicy and with a nice crunch added for texture.\n\nNext up came the sushi, and while my friends were a little delayed by the kitchen, our server was quick to offer us their cucumber salad with yogurt and microgreens to keep us munching. All were delicious and consumed quickly.\n\nIn terms of beverages, we didn't stray from sake, which was offered on the happy hour menu, but there were many options, including a house-made orange wine from LI.\n\nAll in, this is a great place to meet a friend, and have a quick bite or sit and chat while you graze the menu. Either way, you will not be disappointed by anything; it's a lovely spot."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1TVNFcGhkV3BsVFhWSVZFNHlhakJYVFRCNWNuYxAB",
            "text": "wonderful menu, service and accommodation of special requests. this is truly the perfect blend if destination dining and neighborhood spot"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNNFl6UkJhV2x5VERBNGQxUkJaRzkwWWsxU1JuYxAB",
            "text": "Our favorite restaurant. Every time we visit we are surprised with new dishes. Each dish is so unique but simple and it touches every pallet in your mouth."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213eVZtWXpOWGMwT1dkWlYyUmxZelZZTmxCaU4yYxAB",
            "text": "One of the best sushi spots in New York. A big thanks to Maija she did everything incredibly. I would recommend everything. My favorites were the cucumber salad, the miso soup is a must, the salmon bagel sushi was incredible & service was 10/10."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkalpucGxNRVprYmpRM1dGSldhbVpRWTJKWVoxRRAB",
            "text": "Delicious and fresh local sushi."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKd1RHdzVaMlJMUm1OU1lsY3hSbUpLUzFOQk1IYxAB",
            "text": "food vibe and service all on point !! shout out to isaac  and tj for giving us an amazing experience 🙏"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toeVkwSTJhV3gxVVV0TU5XVkZURWRPV0dVM1VHYxAB",
            "text": "The most wonderful spot. Considerate, knowledgeable staff, delectable food, warm, intimate space. We loved it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ocFNrdHdlVTlwTUZSTFNtOXljRmRTZFhGRE0yYxAB",
            "text": "Everything about our dinner at Rosella was above five stars.  I had already expected an amazing meal based on some recommendations provided by friends, but this was even better than expected.  All of the food we ordered and some of the ones ordered by our man behind the bar Michael (who was attentive, funny, knowledgable, and gracious (letting us have some wine samples to compliment some of our dishes), was extraordinary.  It was hard to pick a favorite among what we ate except the XO Grits were unlike anything I have tried before and well worth the price of admission.  Even the ambiance, which blended a mix of the style of Japan without the sometimes pretentious overtones you get with most upscale sushi restaurants.  The best review is if you would recommend to others and go back yourself, which I would do in a heartbeat.  If you get a chance, visit this restaurant."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxalYxRkJObWd0TVhkZllXTkdSRkkzTWxGS1gyYxAB",
            "text": "This is one of the best restaurants I’ve ever been to in my LIFE. Food - wine - service - vibe - is all operating at a 10/10. There is not even a sliver of a chance that you’ll regret going to Rosella."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WVpXUTVTbFozZDBOR01Xd3hNakZqWW1ObFkzYxAB",
            "text": "We celebrated our anniversary at Rosella and had an incredible time. The vibes are so fun, it feels like hanging out with a bunch of friends who love good food and sake. We had a mix of sushi and small plates, everything is super fresh and delicious. The everything bagel roll is amazing and the salad is wildly addictive. The sake selection was excellent and we got to try some very interesting and delicious dessert sakes at the end of the meal. For dessert we had the chocolate mousse with raspberry sorbet and basically licked the plate clean."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdVoyeEVUVFpHWTNsQlJFVmhibmh5VVd4U2QyYxAB",
            "text": "Amazing food, service and atmosphere!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSNmVrSnJVbVZXZFhkaGRUUnBVemR2YmtocVUxRRAB",
            "text": "Simply the best at an affordable price point. Try to grab the sushi bar."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNcUloNy1hNmVIRWdBRRAB",
            "text": "Loved it all"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQN1Y1ZW1xM3QtNTN3RRAB",
            "text": "I truly don't know that I can express how enjoyable a meal this was in terms of experience. The staff is incredible and felt like we were the best of friends. They're so attentive to a degree that I'm surprised they don't have the star over their sister restaurant (not that I've been). And the layout of the restaurant works so well because you're in constant contact with someone who seems like they want to chat with you in such an intimately personable way.\n\nThe food itself was astounding, even more-so than I had anticipated. It's a bit pricey but for the experience was worth it. The bagels-on-Hudson and shrimp nigiri were a must for me. The former worked so well and was such an interesting idea."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKajgzT0tkbmE2Uy13RRAB",
            "text": "Best sushi in the city."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJYkU3UC13LWVyRnNRRRAB",
            "text": "Took my out-of-town parents here so they could experience fine dining. They had an amazing time—excellent food, phenomenal service and a cozy but not cramped space. Our server was one the most knowledgeable I’ve ever had. She even had anecdotes about the local farmers who sourced one of the ingredients. And don’t skip dessert!\n\nWe were not rushed at all, which I find to be rare in New York. I highly recommend this place!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQYUs4NmppNzdHYTFnRRAB",
            "text": "I love this place! I've been twice, both times it was an exceptional experience from beginning to end. Food is fantastic but, the service really takes it over the top. Everyone working there clearly enjoys it. Never change, Rosella!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJYkV1OExrc1oyb3FnRRAB",
            "text": "This was one amazing culinary experience. Reservations were full but we walked in at 5pm on a Wednesday and got seated at the window with a nice view of Tompkins Square Park. Our friendly and knowledgable server Michael curated an exquisite offering of deliciousness for my wife and me who are not very adventurous when it comes to food. The ceviche was out of this world. My wife is gluten-free and she was very well accomodated.  We chatted with Chef Jeff and Sous-chef Maija who were working in the middle of the room but took the time to come by and check on us. It was an outstanding evening and the highlight of our trip to NYC!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveE03ajdBRRAB",
            "text": "Wonderful service and a delicious meal with interesting ingredients, particularly the miso soup, endive salad, ceviche, and coconut sorbet!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvaWJHZWhRRRAB",
            "text": "I've been wanting to try Rosella forever and my expectations were exceeded! Everything was amazing, especially the ramen, shrimp nigiri, pickled mussels, and spicy tuna roll. 10/10 experience"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdFpmVkRnEAE",
            "text": "The consistent and overwhelming deliciousness of food was only overshadowed by the friendliness of the staff, highlighted by our bartender/waiter, Michael.\n\nWe started with the happy hour menu (stretching until 6:30pm — score) which featured a crunch and kick your solidcore instructor would appreciate. It’s hard to go wrong, but don’t miss the tuna handroll that looks like an icecream cone and tastes like tokyo.\n\nBefore you move onto entrees, don’t skip the miso, and start asking the staff for their favorite drinks. We went from an oregon white to sake to a chilled red, a journey that normally requires 10k united miles and a Xanax, but this time was accompanied by early career aspirations of love and a friendly new migrant to New York from Texas.\n\nWe’ll be back. This is the night out you regret not taking."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJLVBtSzZRRRAB",
            "text": "A transcendental food experience in New York.  The folks at Rosella have nailed marrying fine dining with a casual, approachable and all around friendly atmosphere.  Jacob made us feel as if we’ve known him for years and guided us through the perfect tasting menu of their offerings (don’t sleep on the new happy hour).  Sarah is the de facto friend who makes sure your wine glass is never empty, approaching with new and exotic offerings specifically tailored to your palette.  Unforgettables include the uni toast, fish sausage slider, mussel nigiri, and miso carrot cake.  I will never be the same after the farro miso soup.  Rosella, you have my heart."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJd0ppcC13RRAB",
            "text": "You want a unique sushi experience? This is the only place you will get it, from the unique miso soup to uni toast and everything between your taste buds are going to a ride of a lifetime. The best part was Shea who walked us through our entire dinner experience. She also guided us through all the flavors of what was on the sushi and the blend and balance of it all. Thank you for giving us an unforgettable adventure of a lifetime!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdF92YW53RRAB",
            "text": "Great experience in the EV. Serving delicious local high quality raw food and wine"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJeDhURUlREAE",
            "text": "We’ve been here a couple times and each visit is better than the last. The food is insanely good. I recommend giving them a budget and letting the team choose your dishes for you. As incredible as the sushi is, the salads, grain bowls, and deserts shouldn’t be missed either. Chef Jeff is the best!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbEwyVDVRRRAB",
            "text": "Amazing food and service.  Audrey was our server.  Knew the menu and made great recommendations!  Coukd not ask for a better experience!  I will be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3b3NQRm93RRAB",
            "text": "🩶🤍 JUST M A G I C  🤍🩶"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MUkybUdREAE",
            "text": "Fabulous innovative sushi. Natural wine.  Small venue. Pricey but worth it."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcmJ2MkR3EAE",
            "text": "Exceptional!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNy1DbmpRRRAB",
            "text": "I'll definitely visit here every time I'm in and I highly recommend you do the same I can't recall the drinks I ordered but they were amazing (taste and strength).  I walked into the well-lit establishment and the first thing I noticed was the music playing in the background. A wide range of music was played throughout the night and everything fit."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBdDYzT01nEAE",
            "text": "One of the best restaurants in NYC hands down. From the food, to the atmosphere, to the staff, all around 10/10. Highly recommend! Can’t wait to go back"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNE02MklBEAE",
            "text": "Amazing and unique food with unbelievable guest experience- every server is aware of every ingredient and the entire menu is divine!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYekp5ckpREAE",
            "text": "Saved this place on my map for a long time and finally got to visit for our anniversary. We sat on the chef’s sushi counter and the experience was incredible. Food and service were both top notch. The flavor was amazing. Wine was great too. We will have to visit again."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdVp5R1NREAE",
            "text": "Rosella delivered one of the most exceptional dining experiences I’ve had this year! Every dish felt thoughtfully crafted, but two sleeper hits stood out: the house endive salad, so good I couldn’t resist drinking every last drop of the dressing—and I’m not ashamed to admit it. And the pickled mussel sushi? Pure magic. I closed my eyes while chewing, and for a moment, it felt like I’d transcended—an out-of-body experience I’ll be chasing again. Outstanding food and impeccable service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaUlmWTNRRRAB",
            "text": "Came here with a group of friends after we were able to get a last minute res on a busy Friday night. The outdoor seating is really cute and comfortable. Our server was friendly and helpful. We ordered a couple dishes to split and everything tasted great but the portions are a little small for the price. Dessert was delicious!! I’m glad I tried it, it’s a nice place for a special occasion."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmN01xNEZnEAE",
            "text": "Finally after walking by so many times (I live down the street)  I was able to slip in last minute for a Friday night dinner with my parents who were in town visiting. My mom had mentioned several times how much she wanted to try Rosella and we were able to snag a last minute bar seating for the three of us. Just by quickly observing, you could tell what an amazing flow this staff has together- everything is clean, perfect volume of music was going, everyone was warm, welcoming, and the space is really cozy and feels intimate and cool without being pretentious or relaxed. Celia was incredibly kind to us as we were squeezed in for a quick dinner in between another reservation- but never once made us feel hurried or rushed.\n\nWe came for light bites as we have been eating our way through Manhattan and have been in a week long food coma- this was the perfect night for Rosella.\nThe miso soup made with farro was creamy and layered with flavor and such a cozy way to start our meal, we had the salmon avocado roll and spicy tuna both were absolutely phenomenal -my dad had the fish slider and loved it- he’s usually a very harsh critic so we were relieved he had the same experience we did..\nCelia brought over the most incredible endive salad since she said we ordered “light” and we all agreed it was by far the best salad we’ve yet to have in New York. As a California native who has been here for almost 7 years constantly hunting for an amazing salad that ticks off the boxes- this one hit. The dressing I can’t even describe was punchy and fresh but still light- the crunchy endive and the amazing shiso leaves …I will be dreaming about that salad.\nWe also had to order the coconut sorbet - which was dressed with basil oil and quite simply blew my mind. I used to have many ideas of what my last meal dessert would be but all of that is out the window with this sorbet. Wow is all I have to say. Celia yet again surprised us with another treat- the carrot cake- which was an absolute joy visually with the matching confetti plate, incredible edible flowers, and the perfect not to sweet frosting. The only negative thing is I live two blocks away and work 4 blocks away so it will take a lot of self control to not come every single day.\n\nSeriously between the amazingly warm staff who took such great care of us and made sure we felt how special this was, to the incredible food bursting with unique and stunning flavors, to the cozy ambiance I cannot wait to be back and to tell my people how much I loved it. Thank you!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdThDWTRnRRAB",
            "text": "Literally my favorite place to eat in New York. The best, most unexpected flavors that I can never stop dreaming about. Every single dish here is always incredibly thought out and tastes amazing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1aGZPeXNRRRAB",
            "text": "The food was just superb, excellent quality of products and preparation, also original, maybe not your regular sushi but very interesting combination of flavors. Loved everything, and the sake was good too. It’s pricey though, so you gotta…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNExLVXJ3RRAB",
            "text": "Food experience was great. But the place itself is tiny, feels crowded. The chairs are very hard to sit on. The drink selection is not that great also. But again, food was amazing. Typical East Village crowd, no one was dressed up. Foodie destination for sure, but not if you are looking for a fine dining experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkNHVTaDhRRRAB",
            "text": "Wow.... we just got home from a dinner from this place and we are absolutely blown away. Andrew was a culinary rockstar and knows flavor like the back of his hand. He had perfect recommendations and paired everything wonderfully. The entire atmosphere is totally fun and exciting, the people who work there were super passionate and seemed to be enjoying their job. Great music, incredible food, and friendly service. We will be returning!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfLTlHQkFREAE",
            "text": "Wowwwww.  I was so amazed that the food was so outstanding , our server James was so delightful and entertaining!   I tried things I never ate before and was blown away   My daughter and I enjoyed every bite. A must to come here.   I will be back with many Friends"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyemJlLUl3EAE",
            "text": "Rosella isn't bad. It's just vastly, vastly overpriced for semi-creative Japanese fusion. Dozens of restaurants in the city can do the same thing, and many don't charge as much as Rosella does.\n\nThis is sushi/Japanese designed for rich white people who can afford to travel to Japan but still can't tell you what omakase means, and the prices--and clientele--reflect that. Why else would Rosella charge $21 for a Spicy Tuna Roll? Six average-sized pieces containing nothing particularly unique besides avocado, jalapeno and spicy mayo. Oh, I forgot, they added an herb or something in there. I didn't realize dill now cost $21.\n\nWe let our server order for us, and he got us almost everything on the not-very-big menu, so I can say with confidence that we tried the best that Rosella had to offer. If you want sushi--whether traditional or fusion--this is NOT the place to go, as not only are the rolls overpriced, but also there are only three options in their \"Little Roll\" (re: teeny-tiny 6 pieces) category, and three options in their \"Big Roll\" (re: average-sized 6 pieces--this ain't futomaki), and none of them are that special.\n\nYou're better off trying the cold and hot dishes. I quite enjoyed the creative Ceviche, which came with scallops and kiwi, while the Crudo with monkfish liver was great. Just be prepared to fork over $23+ each for portion sizes that would be classified as snacks at other restaurants. Also, why the hell is Laksa on a Japanese fusion menu?\n\nRosella shines best in its desserts. The Miso Carrot Cake was moist, fragrant and beautiful to behold, while the creamy Coconut Sorbet came mixed with ginger and lemongrass with a lovely basil drizzle. Get these, whatever else you do.\n\nBottom line: Rosella will undoubtedly appeal to hype-following foodies who blindly spend on omakases while having no actual idea what omakase means. For true sushi, Japanese and general food aficionados, the main impression it will leave is a dent in your wallet."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXa3FpLVpnEAE",
            "text": "My new favorite sushi spot in NY. All the dishes were phenomenal, the fish was so fresh with awesome flavors and the broth the noodles were served in was out of this world good. Excellent service and with a great list of unique wines they were happy to recommend pairings for the dishes. Such a great gem of a place!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldHR2WGZ3EAE",
            "text": "I am SHOOK. One of the best sushi places I’ve ever been to. Everything had so much flavor and was SO UNIQUE!!!! Not only was the food out of this world but their customer service is spot on!! Hannah accommodated us so much to make sure we had the best experience/could fit into a tight schedule. TJ was our waiter and he was AMAZING. We let him run with what we ate and he did not fail us. I cannot recommend this enough."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKamZ2R013EAE",
            "text": "We adored Rosella. We sat at the bar and our server was truly exceptional; he tailor-made a menu for us complete with wine pairings. He was extremely knowledgeable about the food and wine. The rolls and sashimi all had a unique touch/ingredient that elevated them above normal sushi, but don’t sleep on the fish sausage slider. Every bite was incredible- this easily broke my NYC top 10 restaurants for both the food and service. 5 stars, no notes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5eEs2ZXlBRRAB",
            "text": "Recently popped in and wow what an exceptional dining experience. We were seated by the window rather than the bar and felt like we didn’t miss out. Our server skillfully made suggestions for us and paired our meal with some amazing sake. Will definitely be back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4MGYtNEZ3EAE",
            "text": "Cool buzzing spot. Found the nigiri better than the big rolls - fish was overpowered by other ingredients in these. Prawn was the pick of the nigiri. House salad was great. Best dishes of the night were the fish sausage slider and the prawn laksa. Wine list is great and it’s a fun crew that looks after you. Not on the cheap side but worth a try if you can snag a booking!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2N0pYb19nRRAB",
            "text": "Phenomenal sushi at a neighborhood gem tucked away on Avenue A.\n\nFast service, extremely fresh / tasty sushi and sashimi, and good sake that enhanced the dining experience.\n\nLove the minimalist ambiance and open-but-understated vibes.\n\nLooking forward to dining here again!\n\nEdit: went again. Still AMAZING. Also had the carrot cake this time and it was deliciousness in every bite. The counter service was excellent and our server was legit hilarious - was cracking up every time he was telling us about a menu item."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKLV9XS29nRRAB",
            "text": "Food:\n• Spicy Apples - Wasn't sure what to expect when I saw this on the menu and was extremely pleasantly surprised when I took a bite. The combination of apples, spice, cashew salsa, yogurt, and dill somehow created a flavor/ texture experience unlike anything I had ever tried before.\nDefinitely start with this dish!\n•Spicy Avocado Roll - Even though this roll sounds simple, it packs so much flavor.\n•Spicy Tina Roll - This is one of their \"Big Rolls\" and is like the best quality spicy tuna roll you could ever imagine with melt in your mouth tuna, avocado jalapeño, herbs, and spicy mayo.\n•Sushi & Sashimi - I love Rosella's selection of local sashimi to explore! We had the fatty bluefin and the Spanish mackerel and they were both incredible!\nLaksa & Lobster - This spicy and savory soup with shrimp, lobster, and mushrooms was incredible!\nDrinks:\nOne of my favorite parts of Rosella is definitely their beverage list that focuses on local wines. I tried a wonderful skin contact Riesling from AmByth Estate and some insanely good wines from Ryme Cellars including their Fiano and the \"Hers\" Vermentino.\nRosella also has a great sake selection and we got to try the Tajima Fuku Chitose \"Happy Owl\" Yamahai Junmai, which went super well with the laksa!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkbFo3QlVREAE",
            "text": "Different manner to eat sushi.\nThis place target is to serve local fish sushi and in my opinion was one of the best experience I have.\nI would recommend the shrimp nigiri that is simply amazing.\n\nTip: the brew their own soy sauce.\n\nAlso a good selection of skin contact - funky  wines.\n\nSo terrible the outdoor seating, cold and with zero atmosphere but I thanks the waitress that tried to make a little better out stay during dinner."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5ejlERjlRRRAB",
            "text": "Everything at Rosella was amazing. The welcoming ambiance, friendly and knowledgeable staffs and the food! The menu seems to change very often (depends on the availability of fish) so I won’t go into details about the dishes we had. But I’d…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNldFk2VmlnRRAB",
            "text": "Unique sushi experience with US and New York focused fish. The restaurant offers multiple courses, nigiri, rolls, and desserts.\n\nI have been twice and have really enjoyed the ceviche each time. Incredible flavorful. The Nigiri is excellent and some cuts are different. For example you won’t find bluefish at many places.\n\nThe large rolls are big and filling. The preferred the spicy tuna over the AvoCaho. The lobster one is extra but give it a shot.\n\nThe cantaloupe sorbet and carrot cake are both great options for dessert and highly recommended. They also have a nice selection of wines, sake and beer. They had two teas for purchase.\n\nYou will probably spend 100+ pp. the vibe is cool and it is intimate. Sit at the sushi bar for nice interaction with the chefs. There are similar prices sushi places that will give higher quality fish form nigiri or sashimi but rosella makes up for it in the options and creativity. Highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdThiRmZ3EAE",
            "text": "Learned about this establishment from Eater and loved the thoughts about nontraditional sushi. A very different vibe from the orthodox edomae sushi restaurant. Foods are good and you might also have the chance wining some bonus dishes (we were blessed to have the spicy avocado little roll and mushroom sushi gifted from the chefs). You should come if you don't mind try something that is not ordinary."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREazhHdFJREAE",
            "text": "A hip, semi-fusion Japanese restaurant. Intimate atmosphere. Our server was quite charismatic and friendly. All dishes were great - really enjoyed their spicy avocado sushi. Expensive but worth it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCeGVhUjRnRRAB",
            "text": "Over the course of the omakase tasting menu, we enjoyed 15 unique dishes which at worst were delicious and at best changed my perspective on how food can make someone feel. Just the texture of the warm, soft, fresh salmon warrants a visit. For a special experience with extraordinary Japanese food in a cozy restaurant in East Village, this is the spot. Reservations are required about a month in advance as there are only six seats per night for the omakase."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2cWRiUzB3RRAB",
            "text": "I had such a great time in Rosella. The format is standard sushi, but the menu is reinvented to evoke the diversity of foods in NYC (sadly it's not long enough to cover all of it, but it still goes a long way). The place takes you away from the city, and the omakase takes you in for at least two hours. The chef Jeff and my waiter James were both great in their jobs, but also very interesting people to talk to. As a patron sitting next to me at the 4-seat bar put it, it's like being at a friend's house while you're being served awesome food. The outdoor seating seems great for people watching, and I would recommend the omakase to anyone looking for a unique sushi experience with great flavor and value."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2OVp6c1FBEAE",
            "text": "The salads and ceviche were super yum. I found the nigiri and rolls to be just okay. Didnt like the ramen or fish burger. Super cute restaurant overall and the service was great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaczVHZkNnEAE",
            "text": "A tiny yet decadent sushi spot that's blown up. With a good selection of sake to accompany the meal. Uni XO mazemen, chirashi and salmon crudo definitely stood out. Not a big fan of the bagel roll, cream cheese just overpowers everything and leaved after taste. Blend of traditional dishes with unique ingredients highlights chef's vision."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aXV5aXN3RRAB",
            "text": "Wandered by and the vibes looked great so we put our name down… best decision ever!! The menu is small and every single item is intentional and inspiring, you truly can’t go wrong. Freshest ingredients ever, amazing presentation, and the staff were so so knowledgeable helpful and fun! Get the soup and do yourself a favor and throw in the spicy avocado roll as well"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHdzh1ZElBEAE",
            "text": "There is good sushi and then there is Rosella!! The journey your taste buds go through is nothing less than spectacular. The staff is wonderful and welcoming. If you're ever in the mood for something new and innovative when it comes to sushi, come here. You won't be disappointed!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoeV8zYXRnRRAB",
            "text": "Two words: clean eating.\n\nPerhaps it is because the fish is sourced right from our waters here in the US, but I found the rolls to be very light and easy to eat. Obviously it’s not omakase or anything extremely unique, but thought the place was a nice hidden spot that serves solid sushi.\n\nNote: service was excellent!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEM1pTaG9BRRAB",
            "text": "Rosella is exceptional. The food is absolutely top notch and amazingly creative. So many things on the menu sound like questionable combinations but always take you on a wild taste rollercoaster. Egg, caviar, maple dessert? Yellowtail, red and pickled green strawberry pesto crudo? What? But yes, absolutely yes. Bluefin, coconut milk ceviche? Yes. Also, why is the miso soup the best I've ever had in my life?\n\nThe drink menu is superb and the staff is so knowledgeable that they do incredible pairings. The staff is also super friendly and attentive.\n\nLove this place, always a rich experience from walking in the door to stepping out."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1NTVPUGpBRRAB",
            "text": "Very nice sushi place, with American sourced seafood. Showed up at opening to get a walk-in seat, and servers were kind while I waited for my friends who were delayed on the train. In the mean time I was sampled multiple sakes before…"
        }
    ],
    "reviews_count": 81
}