{
    "name": "Balvanera",
    "place_id": "ChIJvRNghoFZwokR8r6CDQqyalA",
    "grid": "MN3",
    "address": "152 Stanton St, New York, NY 10002, USA",
    "rating": 4.7,
    "user_ratings_total": 781,
    "phone_number": "(917) 746-1660",
    "reviews": [
        {
            "date": "1일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0dGEyRjFOR2d4TVUxb09GUkpNVlJ6WDJzMGRYYxAB",
            "text": "Venir a New York y comer en este restaurante Argentino me lleno de admiración! Que bien sommelier Nicolas Que nos hizo una gran degustación de vinos y las delicias de la carta que nos fueron trayendo!\nMe encantó especialmente Mollejas, tartare, entraña, la ensalada verde y las papas que delicia!\nGracias por tan brava atención\nAgradecidos de venir hasta acá y sentirnos en casa!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRlozVnJOak54VldkUFltbEhVMEZOY2xodE1XYxAB",
            "text": "Celebrated our daughter's birthday this past Saturday night. Service could not have been more attentive, food could not have been more succulent. We have visited this restaurant a number of times as we visit from Washington and are treated as old friends each time we do. We picked from among the Argentinian steaks on the menu and were and were rewarded for doing so. Ambiance is always warm and welcoming. Balvanera must be on your list!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSVFuSXlXbkoxWTB4aWRrbDNSbTV3TURCWmRuYxAB",
            "text": "I don’t understand why this place isn’t more busy. Everything is done with such love <3"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ScGIySlJlRXhIVEdOWFUySmtiamN3WkU1YVZFRRAB",
            "text": "Excellent dining experience, our waiter was new but took the time to explain the dishes on the menu and his suggestions were phenomenal!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKcVFsZEpYMlZxUkhobVFuRmhUMFUxY2xOeFNWRRAB",
            "text": "10 out of 10. Coming back"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVVFVbEhVRVV5TkVwUFkxWm9ha05qTVUweVpWRRAB",
            "text": "Delightful! Despite my limited knowledge of wines and meats, the staff guided me perfectly to one of the best dinners I’ve ever had. Everything was excellent — top to bottom.\nPerhaps just a bit more attention to the outdoor tables, as service there can take a little longer, but overall, absolutely outstanding experience. ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psc1JHNWZPR056U0U4eWN6UlhlQzFpTkVGalVsRRAB",
            "text": "Simply delicious…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkZmNIQkVXVGhDYlRaV1JGbGlaa3R6YkZWRE4zYxAB",
            "text": "Absolutely phenomenal experience at this Argentinian. the manager, who was truly outstanding, professional, and passionate — Can’t wait to return!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1eGIxcFZTRGgzT0RGemRUUm1kalJ1Y0c5SVNGRRAB",
            "text": "The place impresses on many levels. Their culinary approach succeeds beyond most others. Friendly and quick service. We noticed exceptional cleanliness!! All parts of our visit were wonderful & I plan to come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMlVXSTNPREE0WWpGR2NYcFZSMEkzV2poaU1tYxAB",
            "text": "Great coffee great service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaeFRpMW5OREoxTWpScmFqbDZXV1pMUXkxRGVYYxAB",
            "text": "This place balances all aspects of the dining experience. The ambiance, staff attention, and meal quality are top-notch. Cheerful feeling throughout. I look forward to catching up with my friends on staff. Make a point to try this restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxSU0xUklUVFJLWTBOUWRsTkRSV0ZNUTNSRlUwRRAB",
            "text": "Went to this spot for brunch and it was amazing!\nNicolas really made our experience special with great service and attention. Highly recommend the brioche with dulce de leche and the steak and eggs, cooked perfectly medium rare"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SYU1uZDFVRWRQVWxJeVZYUXRUMGRmZW5OU1RHYxAB",
            "text": "El mejor resto Argentino en USA. Oh, MUST have Torrejas de Lola ! Must have it !! 😍😍😍…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poNVJWbFZibFkyVm5CWU1XZFdRVjl5V2toME5VRRAB",
            "text": "You'll think about coming back. Nothing that would surprise an experienced diner. We found the service entirely acceptable. The establishment feels rooted here. Visit this place as soon as possible."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkTmEybExhR2hzZGtRMU0zTkJPRTFyYmtoVWMyYxAB",
            "text": "Amazing food. Great ambience. Very satisfied"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MWNYUjNNSHBIZFhCclVYQTNSSEpKWTFKRVJsRRAB",
            "text": "Have to give this a 5 star rating. Excellent,  juicy, tasty Argentinian steak, grilled to perfection! We tried the rib eye and skirt steak. Superb service, superb gelato (try the mix of 3 flavours - matte, mango and dulce de leche). Go expecting to pay...it ain't cheap! Recommended joint in East Village."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoak5VSklkRFp5U2poNlRsVTRjSFoxT1hsRVQxRRAB",
            "text": "Excellent experience at Balvanera! Emmanuel gave us outstanding service, and the chef’s seasoning and flavors were absolutely perfect. Authentic Argentine taste and warm hospitality — highly recommended!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kT05HTjZTMVp6U1dZMFRtWm9kVWhLWms5V1UxRRAB",
            "text": "In a nutshell, electric chair worthy!\n\nI’m a huge snob and pride myself with a taste for meats. I’ve been to Don Julio in Buenos Aires rated #1 in the world, and many others, including locally. I’m mostly disappointed when I go out for steak. I rarely ever feel compelled to write a compliment.\n\nWell, this is the darn best Ribeye I have ever had. And the price is top deal. Add Monday BYOB with no fee, just a killer deal."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMmVWZHJkWGR5UmxSelFtUllTRTVZZG1GR01tYxAB",
            "text": "Absolutely phenomenal experience at this Argentinian gem. From the first bite to the last sip, everything was top-notch — rich flavors, perfectly grilled meats, and an authentic atmosphere that transports you straight to Buenos Aires.\n\nSpecial mention to Nicolò, the manager, who was truly outstanding. Warm, professional, and passionate — he made us feel like VIPs the entire evening. A rare combination of great food and even better hospitality. Can’t wait to return!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbVpXeFFTWFoyYUZST2JqWndkMVZrVWxKeFNXYxAB",
            "text": "Last night in New York and we found this fantastic restaurant .\nWhat an absolute gem !\nsensational flavours\n\nWe shared 5 of the starters and each one was delicious .\nThank you so very much for the wonderful friendly service and outstanding food\nHighly  recommend"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aek1ubFpWMU5JUjFOSFoxSlRNa2MxVDFWdmEzYxAB",
            "text": "Excelencia de servicio"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkeE4td3dnRRAB",
            "text": "One of the best steaks in NYC. I wouldn't even bother going to Keens or Peter Luger. Truly a hidden gem."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GbWJGUnNZMWxFV2pScVdXVk1hV0pKUjJaSlRWRRAB",
            "text": "Take it from an Argentinean. The steak here is perfection. Quality, perfectly cooked and serve with grace. The entraña juicy and flavorful. The bife perfectly cooked, warm red interior for a medium \"a punto\"  done right. Highly recommended"
        },
        {
            "date": "4달 전",
            "language": "nl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WblQySnhTVXQyTkVkMFNrb3RkRU4wUzNkaFRYYxAB",
            "text": "Heerlijk gegeten!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNUFF3c0RBcDZiaENnEAE",
            "text": "Excelente ambiente muy buena atención y la comida muy deliciosa"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQYXJrT3VjMlpLUUVnEAE",
            "text": "The Argentian Feast was to die for. Such great quality and value for so much food. Have already made plans to come back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJN1BwczNlc29MUXV3RRAB",
            "text": "Perfectly cooked Argentinian steak. Might be the best in the city. Staff is super friendly. Small chill spot. I’m surprised they don’t have a Michelin star or bib gourmand. Sangria is delicious, they have a wide selection of wine as well."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQREYxcHUzNGJUeHp3RRAB",
            "text": "The food and vibe of the place are great but the service here is fabulous. I’ve been several times and something that always brings me back is the staff. I usually come when Emanuel is working and he is extremely personable and attentive -…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKbXFfS2ZJejlhQlpREAE",
            "text": "I came here with a friend a few weeks ago, the steak was very good if you're looking for an Argentinian steak house in Brooklyn look no more"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMQ1ZnZUNPaE1qek1REAE",
            "text": "Delicious first meal in NYC!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZb1k3anZnRRAB",
            "text": "Next level food… the breaded steak (brunch) was incredible. Dessert was awesome. Highly recommend and would visit again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZc3YzdE5nEAE",
            "text": "Server who was also the sommelier was so helpful and attentive.\n\nBeautiful and quiet to sit outside. Enough space between tables. Beyond five stars\n\nDessert and dessert wine- incredible. Only thing is you cannot taste the cardamom in the cake easily. Beyond five stars.\n\nFood - we choose all veggie options. Many options and very filling and tasty. One was a bit to salty. So is give the food 4-4.5 stars."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcF8yUDFRRRAB",
            "text": "This restaurant is lovely. The atmosphere was calm, the food was really good and the wine too. Excellent service. I dont have anything bad to say about this place."
        },
        {
            "date": "6달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcnN6R19BRRAB",
            "text": "Ottimo carne"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNUpDSHZnRRAB",
            "text": "Good food, great service!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcl9IUUpBEAE",
            "text": "We loved our first dining experience at Balvanera, it definitely won’t be the last! The staff were all extremely nice and easy going. Our waiter had great wine recommendations and took the time to walk us through the menu. Every dish we had was a 10/10 but our favorite was the Setas mushroom dish. It is a must order. Can’t wait to visit again!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveTUySVhnEAE",
            "text": "Balvanera is a gem! The atmosphere is charming, and the Argentinean food is absolutely delicious. Highly recommended for a memorable dining experience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOWMzWFp3EAE",
            "text": "Great food. We live in the area and have been meaning to come for a long time. The steaks were amazing and the food was great. A bit pricier than expected but overall nice time. Our waiter Emanuel was 10/10."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvLUtiQ3VnRRAB",
            "text": "Deliciosa comida argentina en NY; los cortes, el ambiente y una buena Quilmes te hacen sentirte en Buenos Aires"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbl9HUFpREAE",
            "text": "Amazing food. Service. Price. 🔥…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMDgzajB3RRAB",
            "text": "Arguably the best Argentinian steak in New York. The meat is Argentinian, cooked with perfection. A reasonable selection of Malbec, the appetizers are very good especially the provoletta and the beef tongue"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJZ2Y3UzVBRRAB",
            "text": "The food was just ok"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbVBuRzFBRRAB",
            "text": "Superb. The burnt beet small plate is incredible, as is the lamb chirozo. Excellent service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MmZqN053EAE",
            "text": "Great food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ck43bHBnRRAB",
            "text": "Relaxed atmosphere, fantastic food and great drinks."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNGJ6dm5nRRAB",
            "text": "I wish I could give this place more stars! From the food to the service to the ambience, everything was 10/10. The manager Michael is a delight and our server was so kind and knowledgeable on the menu which helped our decision making. Can’t wait to return and bring friends!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRLXR1bDNBRRAB",
            "text": "After a long day of having fun in Soho with the family I had the task to find a place to have a great time and enjoy some food.  Found this place and went for a 20min walk to get there, reservation was required and we didn't have one but that wasn't a problem because Nicolas was so attentive and nice to us that he arranged a table for three in just minutes.   Great, the music was awesome, Cerati in the air!  An Spinetta LP in the wall, asked for a couple sangrías, Provoletta, Argentinian Rib Eye medium rare and jamón ibérico.  I could go into details but in one word all I could say is \"perfection\".  If you are planning a day in the Soho, go to Charly Garcia's corner, do some shopping around, visit a musum, enjoy the Washington Square Park and finish the day in Balvanera!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnZy1UTlJnEAE",
            "text": "11/10 experience. My girlfriend and I were shocked by how well we were treated at Balvanera. Alex, the manager, was such a great presence and made the ambiance incredible. The staff are extremely well mannered and the food is so damn good. Go, go, go"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURna3RQaXl3RRAB",
            "text": "Balvanera is a hidden gem on the Lower East Side. The food is expertly prepared, with each dish leaving you craving more. Their wine list is outstanding, thoughtfully curated to perfectly complement every course. Beyond the food, the service is exceptional. The staff makes you feel at home from the moment you walk in and throughout your entire meal. Alex and Jason, in particular, go above and beyond to ensure a wonderful dining experience!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnN0wtamlRRRAB",
            "text": "This place is incredible. A lowkey neighborhood spot with a well curated ambience, friendly staff, and fantastic food. Best place to go for some excellently curated wine and Argentinian steak. Been coming here as long as I’ve lived in NYC and I  couldn’t recommend more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUX2Q2d0V3EAE",
            "text": "This place is a beauty! The interior is very warm and gives you a feel of a very elite setting. The octopus was good, cooked well and dressed perfectly. We got the salad and the rib-eye, the salad was so earthy, fresh, sufficient to share and just delicious. The steak was cooked well, it had a good amount of marbling on one side, it was soft, it was juicy, it was good! Glad we came to check it out!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbWU3ZmhnRRAB",
            "text": "Had a very enjoyable meal here on a Friday evening. Thank you to Arturo for great service, making the evening even more special! Everything we ordered was delicious, but we especially enjoyed the skirt steak and croquetas! The atmosphere in the restaurant also has a great vibe. It was nice and lively."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdzVYNjdBRRAB",
            "text": "All the appetizers were absolutely perfect, with creative combinations that strike a delightful balance of flavors and textures.\nHowever, the steak as a main course fell a bit short of expectations, and the wine selection didn’t quite meet the standard I was hoping for. That said, the atmosphere is wonderful—inviting and stylish, with a warm, welcoming vibe.\nThe service truly stands out; the staff go above and beyond to make you feel at home, even taking the time to learn and remember your name. Such thoughtful touches make the experience memorable and worth a visit!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "zh-Hant",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuak9tYV9nRRAB",
            "text": "非常好吃的餐酒館，\n基本上來說...\n特色會是前菜們，\n\n可以點爆前菜，\n像是炒蘑菇就很簡單但超級好吃，\n塔塔或玉米餃都非常棒～～～\n\n整體是很舒服的一間餐廳，\n適合約會或朋友聚餐～～～"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURILXM3Mm13RRAB",
            "text": "Amazing restaurant. The food and service are outstanding. The food is solid. I would revisit just for the plate of mushrooms (Setas) alone. Brilliant! The octopus was amazing. The ensalada verde was great as well. Can't wait to come back here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqd1lLamd3RRAB",
            "text": "My husband has a knack for picking amazing restaurants. We needed something close to a venue we were going to later on in the evening and he picked this place. We couldn't decide what to get so we felt the Argentinian feast was the best option. We started with the empanadas and they were little pockets of deliciousness. I'm still dreaming of the Provoleta which is baked provolone cheese with honey, fresh oregano, pumpkin seeds and tomato confit. Next we had the blood sausage (morcillo) and chorizo. I never tried blood sausage before and really enjoyed it! Also the housemade chorizo was exquisite. The trio of meats were perfectly seasoned and cooked. They had a beautiful char and still managed to be ridiculously rare as requested. The accompanying chimichurri and salsa Criollo were delightful. Even the watercress and roasted red pepper on the plate were divine. The french fries were crispy and delicious. Instead of looking at the wine list, we told our attentive server what our usual preferences are and he provided us with a bottle that complemented our meal and was very tasty. The service was great and the food was top-notch. I only wish I had room for dessert but I know my limits. Hopefully next time!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfaFotV1NREAE",
            "text": "Great place for an Argentinian steakhouse meal. The ribeye steak was very a perfect medium rare, and well- seasoned.\nProvoleta and the grilled sausage were both delicious, and the corn empanadas were warm and soft.\nGood selections of wines with an Argentinian focus that has more than just Malbecs.\nSeating is a bit tight, but the overall cobe is very warm and relaxed inside.\nNeed a reservation on the weekend"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyeU9MX1NREAE",
            "text": "A great place for Argentinian meat! Octopus was nicely cooked and paired with nice, slightly spicy dressing. The steak and potatoes were good - just good meat. The chorizo pan was good too, though the presentation was a bit funny - it was a burger instead of actual chorizo in a long hero-style bread. The price is also much cheaper than most places for what you’re eating.\n\nQuaint little restaurant tucked away in East village, with unassuming exterior. The interior is quite charming with mostly wood decor."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1c3J5RU1REAE",
            "text": "Loved everything from the food to the service here. We got the steak tartare and provolone as apps and both were great. The skirt steaks we got - entraña - were fantastic. Very good quality meat, seasoned and cooked perfectly. Strongly recommend!\nThe waiters and waitresses there were also great, polite and welcoming. Also love that the restaurant was pretty spacious for the lower east side. Noise level was good, you and your friends can have a conversation without having to yell."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEOFotTkN3EAE",
            "text": "Restaurante pequeño, con ambiente agradable y buen trato por parte de los camareros. Quizá las mesas están demasiado juntas y cuando los camareros tienen que atender las mesas están casi encima de la de al lado.\n\nEn cuanto a la comida, de sabor todo muy rico. Las empanadas muy buenas pero extremadamente pequeñas, podrían ser mucho más grandes. El ancho muy bueno, muy buen punto de la carne y podría traer un poco más de guarnición. Lo mismo para la tarta de chocolate, muy pequeña para el precio.\n\nLo recomendaría pero creo que cantidad/precio podría mejorar."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBblluZ1VnEAE",
            "text": "Great Argentine-inspired food. I tried several savory and sweet brunch options with some friends, and all the food was really good. The food is prepared with a higher-class flair than in Argentina (where I grew up), and even though the authenticity is lost, I think the food tastes better this way. The service was really friendly and helpful."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxMGRUWUFnEAE",
            "text": "Went here for brunch. The burger was super juicy and delicious. The ham and cheese empanada was really tasty as well. I just felt bad for my husband because he ordered the eggs and skirt steak. If you see the picture the steak and potatoes are hidden underneath the eggs. The steak was tiny. I ate a piece and it was like gum. We also ate indoors but I was still harassed by mosquitoes so next time I will apply Off before coming here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMGV5aUt3EAE",
            "text": "Love this place! Been twice for brunch and it was wonderful both times. Their sangria may be the best I’ve had in the city, dry (which I prefer) and simple. All of the food great as well. Steak cooked perfectly. Surprised it isn’t harder to…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSMWNfQktnEAE",
            "text": "Love the croquettes and quesos for appetizer. Decent steak. Didn’t like the flavor of the octopus. Delicious dessert and sangria! Great service.\nI just don’t like how they placed all appetizers all together and tell us to eat the queso first. By the time we ate the croquettes and octopus, it was already cold."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtMzdtVnNnRRAB",
            "text": "Amazing cozy spot.  It is very small. You feel so comfortable and relaxed. Almost like in somebody's dinning room. I am not Argentinian food guru but we enjoyed all the food. Our server Fabiola G. was sweet, helpful, professional, and…"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlZzlPdTZnRRAB",
            "text": "Extraordinaria experiencia!\nLa arquitectura y la ambientación son ideales para que uno se deje llevar hacia un viaje gastronómico muy agradable. Nos sentimos muy cómodos desde el primer momento y la iluminación es perfecta para una cita o relajarse en pareja o con amigos.\nDegustamos los platos que se adjuntan y la presentación, calidad, cocción, sabores y texturas supera largamente cualquier expectativa previa.\nAlgo para destacar son los vinos de los distintos terroirs que permiten hacer el maridaje (accord o pairing) con cada uno de los platos.\nCabe destacar el servicio y la atención de todo el personal es excelente y con gran conocimiento sobre vinos.\nEn caso de ir en pareja o grupos, sugiero pedir varios platitos o entradas y pedir vinos por copas, para que sea una experiencia superadora.\nLo mas destacable es el pulpo y las carnes. Pidan la entraña, la salchicha parrillera con chutney y el ojo de bife (ribeye) que no se arrepentirán. El jamón serrano es español y de muy buena calidad. Todo en general es de altísima calidad y muy recomendable.\nEn conclusión, imperdible!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPZzVQZFpnEAE",
            "text": "visit 1: The berry best\nHad a wonderful brunch last weekend at @balvaneranyc in the Lower East Side. The Argentinian steak house is serving up some delicious options. The waffles with berries and chantilly were so yummy. The streak and eggs was quite a fancy breakfast meal as well. Plus there was bottomless mimosas or sangria for only $20!\n\nvisit 2: Such an eggcellent brunch\nI’ll always return to @balvaneranyc for brunch. I need to try just about everything in menu. What I’ve had so far had always been amazing. We did bottomless sangria again and we ordered Torrejas Lola -\nsweer milk brioche, dulce de leche, caramelized banana, berries - and Huevos a Caballo -\n2 sunny eggs, skirt steak, papas, fresh chimi."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzcXBEdGJREAE",
            "text": "Went at ~1:30 on a Saturday for brunch. Make sure to make reservations as the place is small and was packed. However, the service was phenomenal and our waiter was very attentive. Used the Pulsd deal for brunch and would highly recommend if…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXNmNlYXZ3RRAB",
            "text": "Really enjoyed our dinner here! Great environment, it wasn't busy when we got there around 6:30pm (which was very nice) and it got busier when we finished (and we understand why). Delicious food, nice service, would recommend and would…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPb0tyekFREAE",
            "text": "Discovered this place by accident but very glad that we did, had a espresso then ended up ordering a glass of wine and empanadas my wife had a sangria which was amazing. The empanadas were really good I liked the beef ones with the spicy green sauce. Our bar tender just recently moved over from Argentina and the restaurant was a very pleasant atmosphere it had a simple old school vibe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxd29fZ0x3EAE",
            "text": "We enjoyed a delightful brunch at the restaurant, where we savored sangria, empanadas, and huevos a caballo. The overall experience was excellent, with a superb waitress, inviting ambiance, and stylish decor. I highly recommend this restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNON3N1eFB3EAE",
            "text": "Amazing from start to finish. I had my birthday dinner here and the food was fantastic. The sangria pitcher was yummy. The steaks are absolutely delicious directly from Argentina! The empanadas alwere flavorful and nice as a snack. The octopus appetizer was perfectly grilled and delicious. Our waitress was super cute. I will be back 100%. Thank you!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBallfSmpnRRAB",
            "text": "Fantastic white wine vermouth spritz with olives. Refreshing and sour. Great sweet corn empanadas and steak was perfectly cooked"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNUtYQU5REAE",
            "text": "Excellent Argentinian place, with perfect service.\nGreat advice on the choice of food, excellent meat, large choice of wines.\nThe atmosphere is cozy and warm, and the food simply excellent for a very reasonable price"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfczhfSV9RRRAB",
            "text": "Balvanera is now one of my favorite Argentinian restaurants in the city. Walked in on a friday night with no issue. Food and service were excellent. We had the raddichio salad, morcilla, ribeye and the setas (assorted mushrooms).\n\nFrom beginning to end the food and service surpassed all expectations. The morcilla and ribeye were perfectly seasoned and grilled and the setas and radicchio were excellent sides. We had a couple glasses of their malbec as well. Our server had great enthusiasm and energy, we will definitely be back!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNmJhYWJ3EAE",
            "text": "Thank you Alex for the hospitality and Arturo for the wonderful service. Everything was delicious and the atmosphere was perfect. We will definitely return again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2c191WHFRRRAB",
            "text": "I'm not a big fan of Argentinian-style empanadas, but I liked these a lot (carne, humita), moreso than I liked those I've had in Buenos Aires.\n\nTorrejas Lola was delicious. The brioche by itself is great, and with the caramelized fruit and dulce de leche it's more delicious. One random bite of it was too burnt, otherwise a nearly perfect meal."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJNjZiQ193RRAB",
            "text": "Great tasting food but small portions and very expensive. Two tiny empanadas 12$ and a mixed grill meal for two people (barely enough) is 65 with an appetizer and grilled cheese plate."
        }
    ],
    "reviews_count": 78
}