{
    "name": "Kafana",
    "place_id": "ChIJoRWJ3XlZwokRG88-orPcMUc",
    "grid": "MN3",
    "address": "116 Loisaida Ave, New York, NY 10009, USA",
    "rating": 4.4,
    "user_ratings_total": 1156,
    "phone_number": "(212) 353-8000",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVM2RGaHJYMVl4YlRaRVYwOWZRamQ0ZWpGZlNtYxAB",
            "text": "The kindness of the staff was very poor."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWMFFrRjBkRWQ2YW5aSFJsRkxTMnRXZDNaTFZHYxAB",
            "text": "Our server's recommendations all turned out to be excellent choices. The employees were quick yet pleasant, making me want to return with my family. The servings are hearty and the pricing stays reasonable. The menu features genuinely excellent items. I'm protective of the current atmosphere."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUFgzZHhhbWg0VlZWWFpuUklWVVZ6YjIwd00xRRAB",
            "text": "I found this hidden gem just days ago and it's exceptionally good. Each person ate their entire meal - it was that tasty. Restaurant staff showed authentic friendliness while serving promptly. They serve excellent meals in a relaxed atmosphere with fantastic staff and visible happiness. I value this restaurant's consistency!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjNU1HMTBhVTVzVXpoVFVuWXRhWEoxTW10eVJrRRAB",
            "text": "Amazing food, and an incredible wine list. If you are not familiar with Balkan cuisine and wine, just ask the staff for recommendations! They are super knowledgeable and have never steered me wrong. We come here a lot and brought our families recently for a celebration, and despite the meat-centric menu they had tasty vegetarian options as well. This place is a gem in the east village."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kck5YUndjVTE1UVZWUlVrTm9hMWhxZWtOdlRWRRAB",
            "text": "Great food and great service."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkamMxZHBUVE01TlZJNWNFSkNSMUJ1ZEVsaFQyYxAB",
            "text": "Such an amazing place with authentic balkans food"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wRGRUbHBYMXBMWlRoVE5qZFBSSFY1V2tkMFpXYxAB",
            "text": "great food. great wine. great hospitality.\nbonus points from old new yorker ... serving past 10pm."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKa1MzaFpPVVZJUjFGTU5rZE5kakY0UTJ4Q1ZtYxAB",
            "text": "Dimitrije gives the worst service ever. I have never met someone in the restaurant industry who hates their job like he does."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvazVmdFRREAE",
            "text": "Floored by our evening at Kafana. This is our new favorite restaurant. The service was welcoming, attentive, and informative. This was our first Serbian/Balkan meal. We are hooked.\n\nMy wife had the burger. It's made of ground meat stuffed with cheese and ham. No bun, It was excellent.\n\nI had the lamb and spinach soup which was lighter than it sounds. Very good. Great for sharing if you're order a lot of food. Great on it's own if you're into something light.\n\nI'm going back for the roasted pepper app. If you love roasted peppers, then this app is a must.\n\nI overlook chicken on the menu for other options. We had the chicken kabob and it was the best, anywhere.\n\nMy son had the smoked pork sausage. It was dry but flavorful.\n\nThe bread basket comes with a type of spicy adjika that is a must. I don't know if they bake their own bread but it's some of the best, anywhere.\n\nThe cucumber, tomato, and feta salad is a must.\n\nI haven't seen a larger natural wine list in NYC. We had a fantastic orange wine (Maurer Oszkar Karom) at $80 that was summer in a bottle. I highly recommend it. I can't wait to go back to learn more about Balkan wines.\n\nThere were two guitarist playing live music at our Friday night dinner.\n\nThe room can be noisy from loud conversations that surround you, so be prepared.\n\nWe simply can't wait to go back to explore the menu and the Balkan wines!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paVU9WcHdSWGxPZEhsNFIyaFBNMmhNTUZKbVNrRRAB",
            "text": "A long time ago, I chose this restaurant for lunch with a friend. I remember the delicious, unique Serbian dishes. Yesterday, I suggested to my husband that we go to Kafana. I made a reservation, and we went there for dinner. My order was: Karadjordjeva, Cevapi, Dimljena vesalica, and Rolovane dive alive and dzigerica. All the dishes were delicious. The portions were quite large. I also ordered a glass of Yellow Muscat dessert wine on the recommendation of our waiter. It was very tasty and aromatic. The restaurant has a very cozy, homey, and welcoming atmosphere. The interior is seemingly simple, but it gives the restaurant an ethnic feel. The service was also very good. It felt like we were visiting hospitable hosts rather than going to a restaurant. I would also like to point out that the prices are very reasonable! Visit this restaurant and you won't regret it!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSNVUzbFNOR1pyY25seVJscDBWRlkyWTNSblVrRRAB",
            "text": "Perfect!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOT01UbHROa28zYkhSa1RHVTNSa000ZFdoMlRsRRAB",
            "text": "This restaurant excels in so many areas it's hard to prioritize. Not once have I been disappointed by their food. The staff cares about more than just your order. Workers display authentic niceness. The restaurant maintains standards across the board."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213elVIQkdUMVpCYW1NME5GOTFOVWhMVVZrNGVYYxAB",
            "text": "Amazing food, friendly staff, and a pleasant atmosphere. Highly recommended!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GWWJHMUJRVTlMWlhoWmIzVk1YMGt0TWs1WVFVRRAB",
            "text": "THE BEST service and wine list!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWd2IzQjJNV1ZxWkVaS1NqRXRPRVp0TmtSellXYxAB",
            "text": "I did not expect food to be this good! We've got nothing alike in California and I am already tempted to go back tomorrow. And I am not the Serbian person who thinks Serbian food is the best food in the world - I just obviously like it and when I want it, I want it to be good.\n\nMy little family and I spent 5 months in Belgrade a couple of years ago, and I spent an inordinate amoutn of time chasing the great kafana of yesteryear. Kafana NYC does a far better job than many in Belgrade, fortunately or unfortunately.\n\nANd the wine list was enough to get this mostly non-drinking gal to enjoy a glass.\n\nYUUUUUUUUUM!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oR1dscEtSMUl4TnpOeFRsYzNZVXhOWkc5MFUzYxAB",
            "text": "Came here with my gf for the schnitzel and it did not disappoint! The food and the sodas we had were incredible (I especially recommend the schnitzel and lamb chop) and everyone there were really friendly. Definitely would come back here with more people to show them this spot!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oQlVEbHpZVUpIVUVoblYxODJYMmRMYURBelowRRAB",
            "text": "Horrible experience! Obnoxious waiters, overpriced and meh food, and terrible seating."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOSmNVdFlORkV4Tm5OVGNFZGxOemhZTUVFMmRWRRAB",
            "text": "The bread basket with the red pepper dip were fantastic! The cheese pie was yummy, the spinach pie was not as good as it looks, it is just a little underwhelming. The baked beans tho were super salty, and when I told them about it they said they’ll change it, so they took it away and came back with a supposedly new version which was just as salty :’) so I didn’t feel comfortable telling them again and just left it almost untouched.\nThe drinks however were really good and it is a lovely and gorgeous place, so I guess a great choice for drinking and small bites"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoQ2JqTTVVRUl0ZERWc1luUlJWSGQyWm5GRU9FRRAB",
            "text": "Not really a kafana (would be too much to ask). Great food. \"Cash only\" is weird, it's 2025. The waiter was rushing us a bit, even though it was a quiet weekday."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nemVtOXBWbGRmWVMxak4yRm5iVlZHTFVsTVRtYxAB",
            "text": "Relaxed atmosphere, wonderful service and delicious food. We always leave with full bellies and full hearts! Cash only. Make a reservation. The menu is authentic to Balkan cuisine, with plenty of salads and a few vegetarian options. If you are not a fan of Balkan food, the fish will not disappoint. Check out the live music on Friday nights for a cozy and fun experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkS1JsOTVjVzVNYTFjMFp6QXhTVGxFVFMwMGMxRRAB",
            "text": "Excellent!!! Food, Service - Marko, the waiter was amazing; we will come back soon. Love everything about Kafana ❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25weE5tUjNNMXBpU2t0cmFtSTVWVkZCWVUxd0xVRRAB",
            "text": "Kafana stands out as a quintessential New York institution, boasting exceptional cuisine, including the best Čevapi in the New York area, and an impressive wine list that offers a remarkable vine experience in lower Manhattan. Well done, Team Kafana."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KV2FFZzVTRXR0UWxoUVpVUXhhRWxDWmtGTldYYxAB",
            "text": "Great balkan restaurant, super foods. My dad and I are from Serbia and I looked for restaurants with the same background, so my dad would feel \"at home\" in NYC. It was a great find, we had a blast at Kafana, the waiters are supernice, the foods are almost as good as my mother's (but noone makes better Karadjordjeva than my mom, sorry Kafana). All in all, I recommend this place to anyone curious about balkan foods and ambience. Thank you!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZNU0yaE1VRmgyV2pWcFQxODFaR2xaU3pKMlExRRAB",
            "text": "I love Balkan cuisine and this is some of the best I've had! We got the cevapi, mixed grill, celery root and beet salad, cheese pie, and red pepper salad. The cevapi was probably the best I've had, with tender sausages and fresh bread. The texture on the cheese pie was also out of this world, and it gets a deep flavor from the oven.\n\nYou're always in for a treat when you order a non-leafy green salad at a restaurant like this, and the red pepper salad didn't disappoint! They mentioned it was the house special, and it lived up to the name, with savory, gently roasted peppers dressed with oil and garlic. We were also given sourdough with ajvar at the top of the meal, and both were excellent. Don't sleep on the dessert menu either!\n\nWe were able to make a reservation for a party of four at the last minute on a Saturday evening without hassle. Service was great, everyone there was very friendly and the server did a great job of explaining the menu and suggesting an appropriate amount of food for the table. Just make sure to bring cash, they are cash only!\n\nWe'll be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poc2RXcFZZMnBUTnpSMlFrcFpRMmRrWTBKak9XYxAB",
            "text": "(4.5/5) - CASH ONLY Balkan restaurant with a great vibe! By far the best seating is indoors. Try to call / reserve. The meat platter is the best thing to get. Grilled veg is great. Bread appetizer that comes free with the red pepper spread (Ajvar ) is fantastic.\n\nAs someone who grew up around this food, some of it is good, not all of it wowed me, but it’s pretty solid.\n\nGreat to switch up and try new things! Lovely staff. I liked the salads, cheese mezze and the meat mains."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210Q2NpMUNNbU5hTkdSSWRUTXRlaTB4UldSZlprRRAB",
            "text": "Great Serbian food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWQlNHMUJlR1p5VUZVeGNWbFpUVjl0YlRsaGIyYxAB",
            "text": "Every dish demonstrates the difference skill makes in cooking. The restaurant's appearance sets the right mood. The quality shows throughout. The workers recognized me from day one and continue with their attentive service. I discovered this enjoyable place while searching reviews."
        },
        {
            "date": "2달 전",
            "language": "hr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twQlNqUm9VbDlFTFVkNlZ6WktXVzltWWxCc1RuYxAB",
            "text": "I tako luta covjek svijetom, otuđen i od sebe i od svojih, i onda vidi ta poznata slova, ćirlicu. Кафана. I sa praga, u isti mah osjeca da je kući, da je opet svoj, ta energija dobrodošlice, nasmijana lica, šala na naš način, kao da nikad nismo ni pošli. Kao da smo još uvijek tamo negdje, čak i miriše na kuću! Definitvno mjesto koje treba da obidjete, atmosfera na nivou, konobari koji budno prate sve, ne smije čaša da je prazna! Hvala braćo!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NeE5IWjVPVjlEZEV0Nk5WUlNRbmhZYTB0YVkxRRAB",
            "text": "My wife and I took a group of 6 people to celebrate our son’s birthday and it was a wonderful experience. The service was great it felt like we were at someone’s thank you, Kafana for a great experiencehome. Food was fantastic Serbian fare from a pre fixe menu. We were treated so well in every way.\nThank you Kafana!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jdFRHMXNUM0JOWWtWNmQycFJNMXBIVEd4b2ExRRAB",
            "text": "This place is killer. Authentic Balkan food and vibes. The food was incredible: the mixed grill was delicate, smoky, and rich. The fries and salad were great sides. And the desserts and coffee were also incredible.\n\nServers were a highlight, super personable and fun! A great place to introduce your friends to Balkan culture."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCNVRtOTNVRWRmVFd4VVZsRkpORVV3YjIxdFNVRRAB",
            "text": "Delicious authentic Balkan food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cd09FTXRTMlUwTVdWdVVUUlBkWFExT1ZkYWJuYxAB",
            "text": "Kafana was my first time trying Serbian food and it was a good as it was advertised. The appetizers and side dishes were delicious, especially the lepinja sa kajmakom (bread).\n\nKeep in mind, this place is cash only. It can be an inconvenience but don't let that discourage you from haves a great meal, just plan ahead. The staff is very friendly too."
        },
        {
            "date": "2달 전",
            "language": "hr",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxeU9EbEdRbFpHV2tnd1kyaDVSakZaWHpCTWMyYxAB",
            "text": "Činilo nam se da je samo salata bila današnja"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kaWJtcEpiMTluV1hOaU4xVmhabkoyY2psbFFtYxAB",
            "text": "Amazing food, service and vibes. True Serbian restaurant!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4aWZMMzB3RRAB",
            "text": "While the service was slow, the staff was friendly and things started moving after that. The traditional bread and cheese was good while the cevapi completed this fine lunch. Rounding it off was a glass of Prokupac, a red wine made from an indigenous grape from Serbia that was reminiscent of Pinot Noir with the sour cherry notes usually associated with Sangiovese.\n\nThe restaurant is cash only so be prepared to bring some."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGd1pGZFdRMUZsVW5GS1ZsSmpiVXhWVVRkMmExRRAB",
            "text": "Great restaurant! 5/5"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwS05GUTFNbk5FT1dnNVMyaHhibkpOV0dSUlEyYxAB",
            "text": "Lose yourself"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWmFrSnFUMUkwWVZweGJIWlpNVzlSUWtwYVNHYxAB",
            "text": "If you’re looking for hearty Balkan comfort food and a warm, laid-back vibe, Kafana delivers a memorable experience steeped in Serbian tradition. Nestled in Manhattan’s East Village, this rustic gem feels more like a friend’s home than a restaurant — the kind of place where meals are shared slowly and stories flow just as easily as the rakija.\n\nAtmosphere:\nKafana embraces its identity with wooden furniture, vintage Eastern European decor, and handwritten chalkboard menus. The ambiance is casual but full of character, making it perfect for a relaxed dinner with friends or a cozy date night. It’s not a large space, so reservations are a good idea, especially on weekends.\n\nFood:\nThe menu is rich with traditional Serbian dishes. Start with the mezze platter — a flavorful spread of kajmak, ajvar, and cured meats. The ćevapi (grilled sausages) are a standout: juicy, perfectly seasoned, and served with pillowy lepinja bread. For something heartier, the sarma (stuffed cabbage rolls) and veal goulash are deeply comforting.\n\nVegetarians won’t be left out — dishes like grilled vegetables, cheese-filled pastries, and baked beans are all flavorful and satisfying.\n\nDrinks:\nA robust selection of Balkan wines and house-made rakija (fruit brandy) rounds out the experience. The staff is happy to recommend pairings if you’re new to the region’s offerings.\n\nService:\nFriendly and low-key, the service feels genuine and unrushed. The staff clearly takes pride in sharing their culture, and that warmth comes through in every interaction.\n\nOverall:\nKafana isn’t just a meal — it’s a cultural journey. Whether you're Serbian or simply curious about Balkan cuisine, it’s a soulful, unpretentious spot that gets the details right. Come hungry, leave happy (and maybe just a little buzzed from the rakija)."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25scllVMXFWMXBhYlZwalZXcDBhbXB5YzBZNFVGRRAB",
            "text": "One of the best places in Ny."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200dE9FcHNRbkEwUVVsTU9VVXdSa3RpVjI1bVFuYxAB",
            "text": "Absolutely delicious food – the house special was a standout! Friendly staff, flawless presentation, and a cozy, welcoming vibe. Highly recommended – will definitely return!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTlJrbG1NRzE0YzBnMVJIaElTRnB4UVY5SlJVRRAB",
            "text": "A true taste of Serbian cuisine in a quaint LES cafe. Excellent wine list. Take your time, settle in, and have some great proteins!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GSWNHZzFjUzFpWkRWamRGODFTRzlpUlhWVE5XYxAB",
            "text": "Great place, good wine selection. Friday night fun night, live music."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201NmIzaG5OMFIxZW5sTFVqTkRibkZWVWtWc2JrRRAB",
            "text": "The best ❤️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTU5WcFZNRmd3WkV3NExWUndWM2hYZVc5VFEwRRAB",
            "text": "great authentic food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CWVNraDNVRVp4TldoUldIRTNaVjkwWldoR2VVRRAB",
            "text": "Kafana is a hidden gem that beautifully captures the essence of Serbian cuisine and culture. The warm, inviting atmosphere makes you feel right at home, while the staff is friendly ( specially Milos ) and attentive. The menu offers a delightful array of traditional dishes, and the flavors are simply outstanding! The grilled meats are especially noteworthy, perfectly seasoned and cooked to perfection. Don't miss out on the homemade desserts—they're the cherry on top of a fantastic dining experience. If you're looking for authentic Serbian food in a cozy setting, Kafana is a must-visit!"
        },
        {
            "date": "4달 전",
            "language": "bs",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RMlVWcEpaRmN3V0hKQ2JteDVUM0p5VFVoSmQzYxAB",
            "text": "Nisam normalno jeo u Njujorku, dok nisam došao u ovu kafanu"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZM2JqbHNWMFIzVlVwaE1HUkRWR0psUzFGRFVHYxAB",
            "text": "We are more than pleased with Kafana! This was our first time trying Serbian food, and everything we ordered was made so well. All the servers worked hard to ensure all customers were taken care of. Kudos, Kafana. We will be back and bring more people with us. Also, please remember to bring cash, as this establishment is a cash-only location."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKcFEwWkxlamhuZDFaRlNqVkNWSFl4U0hwV1ZXYxAB",
            "text": "We had he most superb meal and time here at Kafana, food we had little prior experience of that was just amazing from start to finish. Friendly and helpful staff and we felt welcomed and looked after brilliantly. Would highly recommend to anyone going to nyc and looking for something deliciously different."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VlIwTk5aUzB0V0ZOYVJ6VTRkbVJmWmxKalUzYxAB",
            "text": "We came here for the Serbian food and we weren’t disappointed! The lamb shank was outstanding, so what’s the spinach pie, cabbage salad and the pork stew. Small place, but lots of charm."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gc00ybFBVaTFVZGw5Q09IUlVRMlpXTlhwUGNFRRAB",
            "text": "Unbelievable food. Highly recommend this to anyone interested in Eastern European food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKaUk5UENhdVBQNmFnEAE",
            "text": "4/5 (complimentary) Bread with Ajvar\n4/5 Sopska Salad\n4/5 Lepinja with Kajmak\n4.5/5 Fried Spearing\n\n4/5 Mixed Grill -- a very large amount of meats, I would say easily suitable for 3-4 if you are ordering apps. Everything on the platter leans a bit on the salty side, smoked flavor is however excellent. The sausage variety on the platter was probably my favorite!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURva2VYaUh3EAE",
            "text": "Very authentic atmosphere of a Kafana in former Yugoslavia back 50 years ago.\nFood is great and people seem to love to hang out at this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUbkxqNUhnEAE",
            "text": "Arrived with group of 6 to be told the pre-fixe was a requirement for party of that size, no choice for the more interesting options on the menu, and we were missing two items! Also everyone shared from the same one plate they brought out per course, no personal main dishes… $60pp for family style sharing. The included gratuity in the circumstances felt like a lot considering the servers were not that attentive, but the restaurant was very busy until around 9pm. They were very accommodating for nut allergy and brought nut free dessert which was very nice. The food was decent but nothing special for pre-fixe, would not have chosen the fries if we had the choice! Very cool to try Serbian food, wish we could have had more variety. The meat was very nice and the highlight of the meal among the courses. Felt a bit like highway robbery for what we ended up getting. I would try again with smaller group, and be prepared to pay in cash!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNycW9xMG9RRRAB",
            "text": "Tried Serbian food for the first time at @kafananyc in the very East of East village! I’m not well versed in this cuisine, but the food and vibes felt very traditional. It’s a small place packed with people so can get pretty loud but chill."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUN3YyWHZRRRAB",
            "text": "Welcome to Serbia 🇷🇸 in New York! Restaurant has been around for about 15+ years and this was my first visit.\n\nThe food 👌🏾 great portions worth all you pay for and Oh so yummy 😋\n\nThe atmosphere felt cozy and quaint like you transported back into time to grandma’s delicious diner in Europe somewhere.\n\nI mean ☺️the dishes were made so well and approved by a native of the country so I say, well done 👏🏾\n\nThanks for a yummy experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5ODh2OEZREAE",
            "text": "I loved this spot. Having visited Serbia last year, I was missing the food from the region - and Kafana delivered. It’s a got a small cozy vibe and the server was great. We started with some complimentary bread with some traditional red pepper paste which was excellent. For food, we started with cevapi - every country in the Balkans has their variation on these - and they were excellent. The star of the night though was the schnitzel - which was rolled veal with ham and cheese inside and a thin layer of bread, almost like a savory strudel. Delicious! We’d started with beers prior so continued with a local one here but they have a lengthy menu of regional wines which I look forward to exploring on a future visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzaHNpMzVBRRAB",
            "text": "I love everything about this place from the food to the wine and beer and not to mention the rakija my go to is the Ćevapi, punjena pljeskavica & sir meze favourite beer is jelen and juice cockta & jupi. I’ve celebrated birthdays, Valentine’s Day holidays anniversaries at this place. It’s my favourite place. The staff make you feel like you’re at home just can’t get enough! Also perfect place if you speak the language to practice. They have both outside and inside dinning and open early on the weekends. Volim vas!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqanVPdmdBRRAB",
            "text": "We came here on a Friday night and the restaurant was at capacity, highly recommend getting a reservation in advance. This spot feels so homey and has authentic Serbian cuisine. It’s cash only, so make sure you have cash before you go, there is an ATM within a block of the spot too. The portions were huge, we got two mains and the roasted peppers appetizer and couldn’t finish the food between two of us. Overall, great food, service and vibe"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKM2RiTVNnEAE",
            "text": "My first time trying Serbian food and let me tell you it was delicious, I’m very picky about food but when it comes to try new restaurants i am very excited, every dish I had exceeded my expectations. Had some Orange wine from Slovenia. Definitely going to try more Serbian food.\nThey had some live music which was great, good music, good ambience, good service. The only thing I would recommend is the bathroom, wasn’t in the best condition but overall my experience was great. 10/10\n\nONLY CASH ALLOWED for my Apple Pay folks 😌."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURONXRyOTl3RRAB",
            "text": "Delicious food; tried several appetizers desserts and mains (pictured). Each was lovely. Atmosphere was also great, along with the service. 100% recommend if you're into breads, cheeses, and meats (the eastern Europe staples)."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBOWJDM0x3EAE",
            "text": "Absolutely adore this place. It’s a must visit, the food and service is incredible. The only thing I didn’t love on the mixed grill was the liver - but that’s not their fault - I do t love liver unless it’s processed a garbage, hahah. Like liverwurst.  The wine prices are way more than reasonable and the people who work there are amazing. Will definitely return. A place you can go for lunch and spend almost 5 hours, which we did."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bzQ3M29nRRAB",
            "text": "Fluffy, round loaves of lepinja are crisped on the grill before they are sliced open and filled with creamy kajmak cheese and, if you like, a few thick, purplish slices of dry-aged pork loin. A plate of roasted red peppers topped with pickled feferons, the half-spicy, Chartreuse-colored Serbian chiles. And of course there is a great version of the Serbian burger, pljeskavica, pressed until it reaches the edges of the loaf of lepinja that serves as a bun. The patty can be left alone or stuffed with ham and kajmak; in either case, a bracing schmear of ajvar, the heat-packing relish made from red peppers, is almost mandatory. This may also be the time to mention that Kafana makes excellent French fries, or “pomfrit,” as the menu has it."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3LXZMbHB3RRAB",
            "text": "Everything is really good with this place, but the service, they are kinda rude. Just because the food is authentic Serbian food I’ll come back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIaXBYZjFnRRAB",
            "text": "I never had Serbian food but basing on my experience with Balkan food the food at Kafana felt traditional and authentic. The feta spinach pie was extremely good, and we also enjoyed the kebabs and wrapped schnitzel. The Greek style salad was a bit too cold and small considering its price.\nWe also had some wine from the Balkan, the restaurant holds an impressive wine list.\n\nAll in all it was an enjoyable dinner and I would recommend giving it a try. We managed to get in on a Friday night with no reservations but the restaurant was definitely busy, so I guess we got lucky.\n*This is a cash only restaurant*"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3OXNPTGh3RRAB",
            "text": "✨Zeljanica - this spinach and feta phyllo pastry is nothing like the Greek version, thick thick layers of phyllo dough stacked up to a pillowy pie, very comforting\n\n✨Girice sa urnebes sosom - tiny fried fish that you can eat from head to tail was very crunchy and well seasoned\n\n✨Karadjordjeva - pork schnitzel rolled with ham and kajmak, a dairy similar to whipped cottage cheese, the pork was a little too tough to eat\n\n✨Cevapi - very meaty grilled sausage but not too salty\n\nI have to mention the complementary bread comes with pepper jam was good too"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaFB5ZDNRRRAB",
            "text": "•Zeljanica - A delicious spinach pie made with phyllo dough, spinach, and feta. It was like a cloud of fluffy cheese!\n•Cevapi - Flavorful sausages served with raw onions, simple but really good!\n•Karadjordjeva - This was my favorite dish of the night.\nPork schnitzel rolled with ham and oozing with delicious kajmak cheese. Also the French fries it came with were amazing!\n• Svinjska - Extremely tender braised pork shoulder with creamy mashed potatoes.\nDrinks:\nKafana has a deep collection of wines from from countries that were previously part of Yugoslavia including Serbia, Slovenia, Croatia, Hungary, and Friuli, Italy (on the boarder of Slovenia). There are a lot of interesting older wines to choose from!\nWe started with the Simcic Sauvignon Blanc Opoka from 2006, skin-contact wine from Slovenia. The wine still had some of its original fruit flavors of juicy peaches and citrus, but there were a lot of interesting savory and tertiary flavors as well!\nWe also had to try a wine from the iconic Friuli producer Radikon. We got the 2020 Slatnik, a skin-contact wine made with 80% Chardonnay an 20% Sauvignon Blanc. The wine is made with about 14 days of skin contact, and is then aged for 1 year in barrel. It was delightfully aromatic and perfect with all of the delicious food!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGX2JIZDd3RRAB",
            "text": "Incredible spot, not one bad bite. We had the sausages, beans, spinach and feta bites, and a bottle of wine. Large wine list! Couldn’t recommend enough, the staff is super friendly, and well priced"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2eHRDakpREAE",
            "text": "As someone who had never previously had Serbian food, I honestly had no idea what to expect. I was not even fully sure what all the items on the menu were, but thankfully the very helpful staff explained and answered a lot of questions…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLMjRuWnZCZy11U0p3EAE",
            "text": "One of the best meals of my life! Great meats, great Serbian specials, and the natural wine list brings everything come together. We felt immediately comfortable and the whole space makes you feel like you’re family!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdzgzS2NnEAE",
            "text": "Kafana is truly a lovely place with great servers and employees. The food was delicious and definitely got everyone full, the size of the portions are huge!\n\nWe got the Braised lamb, Pork neck, and schnitzel. All dishes were superb and highly recommend them!"
        },
        {
            "date": "8달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnM0tDTThnRRAB",
            "text": "Siamo stati portati in questo ristorante da nostro figlio che vive a New York per festeggiare il mio compleanno. È stata un'esperienza fantastica! Cibo molto buono, vino e rakija di qualità, grande simpatia e disponibilità da parte del personale. Senz'altro torneremo"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2dWFyRGVnEAE",
            "text": "So proud that there is a great Serbian restaurant in Manhattan! The food is really good, very authentic, from Serbian style barbecue to sides and appetizers such as prebranac (baked beans Balkan style), ajvar (red pepper salsa), gibanica (cheese and spinach pie) and many more… I’m pleased to see people all over the world enjoying the food here. The staff is nice, we got some free rakija shots before we left. Definitely try rakija! :) Kafana was a great choice to take my New York friends to, and they loved everything they tried!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dklTZHpBRRAB",
            "text": "For an amazing Serbian and European food this is the best spot in Manhattan❤️\n.\nSuper fair prices\nYou have to pay in cash tho so have that in mind\nDuring summer they have outdoor seating so thats cool.\nGreat polite service - and the most important food is soooooo gooood\nCevapi,girice,salads - amazing stuff\nWould deff come here again👍🏻😇"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtNnUzRmxBRRAB",
            "text": "If you like to experience Serbian food like Cevapcici and many others then you just found a hidden gem. The restaurant is very well booked and once we tasted the first bites we immediately understood why.\n\nAll food is traditional Serbian food. From sugar for the coffee to the coke, I found nothing that was not an original Serbian product boosting the experience to the maximum.\n\nWe found some of the best Serbian wines on the list at a very fair price. The service was very friendly too. One of my top three favorites in New York."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQM3JiOHBRRRAB",
            "text": "We had a wonderful experience at Kafana.\nThe staff went above and beyond to accommodate our needs and preferences, especially Milos was really friendly and professional. And the food was outstanding, cevapi are must try!!!! Recommended 10/10✨"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuallYXzd3RRAB",
            "text": "This was my first experience with Serbian food and Kafana set the bar high! Everything we ate was fresh, well made, and served with enthusiasm. The crew at Kafana is very energetic and friendly.\nAt the end of a big dinner, we had this wonderful assortment of desserts. Definitely a gem in LES"
        }
    ],
    "reviews_count": 76
}