{
    "name": "Plado Tasting Bar - East Village, NYC",
    "place_id": "ChIJN3WABWJZwokR0QK0c7049GM",
    "grid": "MN3",
    "address": "192 E 2nd St, New York, NY 10009, USA",
    "rating": 4.7,
    "user_ratings_total": 410,
    "phone_number": "(646) 850-5151",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ObFVXaDFiMG8xYm0weVFWaDJZbXd6WDJsc1gyYxAB",
            "text": "Great food, very rude service."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toZmNWZFNORXBuYjNoc1luQkpkRUk0U1dGblUyYxAB",
            "text": "Delicious dishes with unique flavour combinations. I’d suggest getting 1 per person and sharing everything to sample as many as you can! Great service too."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkUVJFdE9XbGxvWTNKdGRWUXlNVEYxTUZKMmVGRRAB",
            "text": "I haven’t stopped thinking about their lemon prawn pasta. Can’t wait to go back and try more of the menu! 🤤"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201elgwRjVUbVpQZW5kS1QzbFFhV3h2T1ZWVFYxRRAB",
            "text": "Special thanks to Johnny & Ricardo for the reccomendations and excellent service.\n\nI think I found this place on Reddit. They have a massive tapas menu from all over the world, different culinary fusions and choices and blends.\n\nTheir speciality, the gnocchi, was my favorite. Second to that was the amazing Tuna. As a notorious sweet tooth, I enjoyed both the Tiramisu Creme-Brullee and the Bread Pudding.\n\nI hope to be back to try even more of the dishes."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GV2MwTmZhVzlqUkRnd2VqWkZkVEl0ZUMxVlprRRAB",
            "text": "It is tasty and the drinks are good. Don't go here if you are really hungry tho, just  if u want tastes of food. 3 scallops and a 1/2 cup of a vegetable base =$30 . Bread not included.…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWeVRYazFNMXBNUjNaU1QxSllVbnBOYjNFek1VRRAB",
            "text": "For this restaurant to have a dress code is ridiculous. They don’t even enforce it, so don’t bother leaving your hats and tank tops at home. The “flatbread” is definitely a frozen pizza. The cauliflower and broccoli (broccoli??) wings have zero flavor and come with barbecue and ranch sauces that are SO obviously store bought. It is bizarre how good this place looks and is reviewed compared to the quality of some of the dishes. The pastas and dessert doughnuts are actually decent. Service is wonderful despite it all. Thoughts with the surely hardworking men in the kitchen who likely have no choice but to cook this."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205VlkzZDJMVWhJV214WFRXVmZOR3BQUlZkbVZsRRAB",
            "text": "Gnocchi Dish was excellent and restaurant was cute! everything else we had was pretty sub-par, I will say the sizes of Tapa dishes were solid. Extremely loud atmosphere, weak happy hour drinks, and rushed/impersonal service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ka1NEQnplamQxTkRaYU1VVXRaR2w0UmpCRGEyYxAB",
            "text": "Best in the neighborhood"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VemNGSk5RbDl5WldsT05GOVNiRlJzUzNaTE9FRRAB",
            "text": "Lovely bar"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GV1RUZHNjM0JyTVVVdE5FczBWMmhPUjNsRVRYYxAB",
            "text": "We ate outside so easier to hear and talk. All of us had the Restaurant Week menu which was terrific, plenty of food, and a good value. Will def return."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkQmVXSkRObFZtY3pscVYzSnpSV2MxTFV3MWIwRRAB",
            "text": "Absolutely loved this place in the East Village area. Great food. Staff was superb and attentive, and loved the ambiance. Highly recommend to go on a date or just to have a fun time catching up with friends."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210MmQyRnJZVjlMWWxVM2JtZExWVFYyWTE5YWFHYxAB",
            "text": "Nice palace to enjoying with your friends and family staff is friendly and best palace for party amezing service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GQ1VYRkZlblE0YWpCdFRqbDFZMjAxZVc5dGMzYxAB",
            "text": "What a great find! Thoroughly enjoyed cocktails and chat at the bar - cheers for Paper Plane well done and a gin twist on Naked & Famous. Knowledgeable bar keep and well stocked bar 👍🏽 Service was a delight to chat with, knowledgeable about the food and kept a pulse on our needs. 👍🏽 The tapas style plates invite you to share servings and experience something new. Our table of 4 ordered 6-7 plates to share and everyone had plenty to enjoy! 👍🏽 Our favorites: sliders 🍔 roasted cauliflower and octopus. There is so much to choose from on the menu. Good luck on saving space for dessert!\n\nAND do yourself a favor and pop in during happy hour. Good prices on Classic Well Cocktails and appetizers you will actually enjoy!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdFJtcFBObXBMZDJGd1drUTRWbkpwZVZwdVdWRRAB",
            "text": "I wish I took pictures but I was too busy having an absolute blast with my friend. Our server was very attentive, and was an absolute AUX King, the music and lighting really set the vibe. Food is portioned very well to be sharable!\n\nWe had (and I highly recommend): Happy Hour wine bottle, Italy vs. Spain board, Taro Gnocchi, Lamb Meatballs and Pistachio Lava cake sort of thing.\n\nWine was a medium body red, my friend and I really enjoyed how it paired with the Italy vs. Spain board. The board comes with olives, honey ricotta, meats and this crunchy but fluffy bread. 😍😍\n\nThe gnocchi and meatballs are low in salt and i personally felt like this made the dishes feel less heavy than they otherwise would’ve felt so I’m not complaining. Also if you like your food a little saltier I really don’t think its a big deal to ask for some salt on the side.\n\nPistachio dessert was baked in house 😱 it was so good, comes with raspberries and icecream so it’s tart and sweet. So good for summer.\n\nI would suggest this place for a date with a long time boo, 2-3 girlfriends catch up date, if you’re trying to impress someone cute without breaking bank."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKMk0xaFRhVjltVFhONVEyRnJSVWx0WjA4NFNWRRAB",
            "text": "Good happy hour deals, reliable tapas and sangria. Laidback vibes. Would come again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrMWVIUlpkVGRuU0VGUlExaHhNMWx6WTI1c1ExRRAB",
            "text": "Happened upon this place while looking for a restaurant in the East Village and very happy we did. Had trouble picking from the menu because everything sounded excellent. Portion sizes are somewhat large for tapas which was a pleasant surprise.\n\nHighlights of our meal were the taro gnocchi and halibut carpaccio. Both were incredible - the taro gnocchi was the best thing I ate on this trip.\n\nWould absolutely go back to try some other menu items."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCclMwTlBOMFV0ZUU5NFVtOXNlV3BIVEd0dFVGRRAB",
            "text": "The Esquietas (corn) really hit. The char was perfect, just a tremendous dish. Some of the other plates fell a little shorter for me, but I could see going back and having a very different experience. Such is the nature of tapas. And I would go back, too. 4 stars seem harsh, but here we are."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0alVHOVVZeTF3TFVGbVpHcHdlblF3YjBKbFVVRRAB",
            "text": "Excellent food! My very picky grandmother-in-law left so satisfied we returned two weeks later."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZM1UzQk5WR2hwYjFKQmR6bFNOMnRhZWxWR1pWRRAB",
            "text": "If you go here, as long as someone else is paying, then you won’t be annoyed. The taro gnocchi was good. Way too small of a portion for the price. I feel like I was given a tapas portion instead of the meal portion. Sadly was not very notable or memorable in general. There are too many other places that are worth it in nyc for this to be a place I go back to. As for atmosphere. We sat outside by the bike racks. So it’s not great or romantic. But that’s not their fault. A so so place for too expensive of prices."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJRGFuYTZMb2ZUQWtnRRAB",
            "text": "Amazing food, service and atmosphere.\nI hope they will get Michelin star one day"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNeXc2LW5VeF9xWGN3EAE",
            "text": "I believe this restaurant will reach out Michelin or “the plate” level in near future. Just leaving this comment here."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VLR2I3dF9jdGVpbW1RRRAB",
            "text": "Been here a few times - Food is always good, but gosh the service is terrible. Every time we go, we feel like an inconvenience to the wait staff. Saddens me because we enjoy the food, but we won’t be returning due to how uncomfortable the experience always is."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZX0szcVpBEAE",
            "text": "Me and my boyfriend came here for our anniversary dinner. The food and service were great! Highlights were the taro gnocchi and scallops."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMmZpZG5BRRAB",
            "text": "A true hidden gem of NYC. When I have friends, family, or colleagues visiting NYC, this is the type of food, drinks and experience they go home raving about. Then request to go back when they’re back in town. Everything is fresh and made in house. They recently helped me organize a work dinner party for 19 ppl with ease in their intimate and comfortable downstairs room. It’s also the perfect date spot where you can geek out on every dish and drink they bring out. Pro tip: Do not leave without trying the Taro Gnocchi and sit at the bar, promise you’ll have fun."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJekpuQ05REAE",
            "text": "Love it. Great food. Chill atmosphere. Highly recommended."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdEtDR2RREAE",
            "text": "Great find and a place I would definitely eat there again"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cnBUOTFnRRAB",
            "text": "Relaxed and the food is great!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcmV5V3BnRRAB",
            "text": "We visited on a Saturday evening to celebrate our anniversary and had a fantastic experience. Arriving at 5 PM, we found the atmosphere cozy and intimate—perfect for the occasion.\n\nEverything we tried was absolutely delicious, and the cocktails were top-notch. The ambiance and music added to the charm, making it an even more enjoyable evening. The bartenders and waitstaff were incredibly kind and attentive.\n\nOverall, a 10/10 experience—highly recommend this place!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRZ3FmYWVBEAE",
            "text": "The best tapas place ever!! We came here five times already, never disappoint us"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRZ19hSVZ3EAE",
            "text": "Fabulous tapas and service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnb01iSXRnRRAB",
            "text": "The food and cocktails are great. The atmosphere is perfect for a date and they always play awesome music. It’s a tasting menu so I’d recommend a few dishes per person. Service was top notch!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMXBiMDZBRRAB",
            "text": "Excellent . One of the best meals I had in a while. Every dish was excellent no matter what you order from the menu. Cocktails are great too. Highly recommend"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMklyVGdnRRAB",
            "text": "It's always a great experience to come across a good restaurant just by chance.  But imagine what it's like to luck into a really great restaurant.  You'll have to trust me when I say that I've eaten at some of the world's best restaurants, and our meal at Plado was one of the best.  I won't bother enumerating the plates we shared because they were all so good, but the strachiatella with artichokes was like nothing I've ever tasted.  Creamy, chewy, sweetish, and tart.  But the most impressive thing was Plado's logistics.  We ordered all six of our courses up front and each was served hot (when appropriate) and promptly after the previous one.  Very efficient and welcoming."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBazZmVUxREAE",
            "text": "Dropped in with a friend for Sunday lunch without a reservation. The wooden interior created a cozy atmosphere, and the staff were friendly and attentive.\n\nWe lucked out with their happy hour from 12-7pm, so we started with cocktails and ordered some snacks: zucchini croquettes and sliced prosciutto with ricotta and toasted bread. These finger foods paired well with our drinks and offered good value.\n\nNext time, I'd love to try their main menu and appetizers outside of happy hour. Solid spot for a casual bite and drink!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdEp1dzZRRRAB",
            "text": "Great staff that really makes you feel comfortable, and they clearly know what they’re doing and enjoy being in the space working with customers. The vibe is chill, stylish. friends night, date night, or solo hang.  Good happy hour. Chill music. Classic East Village cozy ambience."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBa0xHSzBnRRAB",
            "text": "Love it!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMXVUQjVRRRAB",
            "text": "11/10 every time!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfaklTcmVREAE",
            "text": "Incredible beef tartare, mussels, gnocchi, ravioli, and short rib! Came here for a date and it was beyond lovely!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOHVPa1FBEAE",
            "text": "Food was delicious 👌🏽 will be back for more!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdHVxVTh3RRAB",
            "text": "Wow! Absolutely loved everything here. Came for 3:30-4:00pm on a Saturday was quiet however staff top notch and all the food recommendations was perfect! Drinks and food 100%. Octopus, gnocchi, chorizo flatbread all flavorful and delicious! Highly recommend. Kudos to the chef. Wish I took pictures of the food."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdHZLYjlnRRAB",
            "text": "Amazing Food and Service !!!\nThe Octopus, gnocchi and chorizo flatbread were amazing delicious !!\nThe drinks Ohaka and Perfect Pear where delicious !!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdHBLUlB3EAE",
            "text": "Great food and great drinks. 10/10 drinks and service was great!!! Everything was excellent! Will was great and super personable. Definitely a must"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUR2eV9rbBAB",
            "text": "Wine bar vibe with an excellent tapas menu. Really enjoyed the taro gnocchi, which were soft and chewy with a delicious cream sauce.  As well as the short rib, fatty and tender, and charred octopus.\n\nLike all tapas spots, you wish your money went a little further but overall an underrated spot in my book"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dmV1QTdRRRAB",
            "text": "Had a wonderful meal my first time at Plano\nHighly recommend you try this hot spot"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdHRENXJBRRAB",
            "text": "Plado Tasting Bar is a delightful find in Glen Cove, offering a culinary experience that impresses on every level. The concept here is sharing and tasting, which is perfect for a group outing or a date night.\n\nThe menu is varied and creative, with dishes influenced by Mediterranean and Latin flavors, all prepared with top-quality ingredients. Each plate feels like it’s crafted with care, and the portions are generous enough to share yet small enough to encourage trying a variety. Their seafood dishes, especially the octopus and tuna, are incredibly fresh and perfectly cooked.\n\nThe ambiance is warm and inviting, with a modern yet cozy feel. The staff is attentive and knowledgeable, always ready to recommend pairings and explain the origins of dishes. The cocktails are also fantastic, Angel was our bartender he was so kind and professional.\n\nPlado Tasting Bar is a must-visit for anyone in the Glen Cove area who loves flavorful, thoughtfully prepared dishes in a relaxed and enjoyable setting. A wonderful spot to savor and share!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzOGE3ckZBEAE",
            "text": "Plado Tasting Bar is such an inviting and beautiful restaurant. When I went it was around Christmas time so the decorations were incredible. It felt very warm and homey. I went with a large group of friends and we all shared the Tapas and had a very fun time all together. The food was so delicious and they cater to any allergies you have or dietery restrictions. A lot of unique and different tastes that I tried that night! Would go again with a large party!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNkpyX2J3EAE",
            "text": "This place is worth visiting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuM2VhUl93RRAB",
            "text": "I’ve been to Plado 10+ times. Plado is great for solo / small group dining, all the way to having a big group of friends in their expanded downstairs space. Plado has something for everyone with a great diversity of vegetarian, seafood, and meat dishes. The drinks are also excellent, and the wines are tasty. Nothing better than having some small plates and drinks on their patio."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINGJmUDlRRRAB",
            "text": "Good food, good service, good variety. Can't go wrong here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINUl1Q3RBRRAB",
            "text": "This review is specific for the Gelato cart. I had a hard time finding reviews about Plado Gelato, so I hope this helps someone out. We rented the Gelato cart for our wedding and it was AMAZING. So many guests raved about how good Chef German’s gelato was and the cart itself was beautiful. It was so fairly priced and Kristin+team were communicative, flexible, and so easy to work with. We were so happy with our decision to go with Plado’s gelato cart and i would highly recommend them to anyone!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURteWFpZ3VnRRAB",
            "text": "Amazing Italian/Spanish Fusion Tapas bar! The food was very flavorful. Great service.  Everyone was very attentive.  My favorite dishes that we ordered was the arancini ball, the tagliatelle pasta dish, and the short rib meal but it was all very good! I recommend starting small,  we ordered too much food.  1 entree per person with maybe one lighter appetizer would have been plenty for 2 people.  We walked out of there so full with so many dishes. What I love is that only one dish came out at a time, which was nice to actually enjoy the food.  Recommend making a reservation ahead of time, the place is not that big."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3d0xxMjlRRRAB",
            "text": "We were a party of 4 and wanted to try restaurant week before it ended for the summer. After doing some researching and looking through the menus, the food on this one looked really interesting. After calculating how much of a deal we would be getting for food (not including drinks) it was just $3 dollars cheaper. However, we thought maybe the portion size would be a little more than the regular menu to justify the tiny deal for restaurant week.\n\nFood review:\nGarden Salad ($15): It was a great salad and was really flavorful. The ingredients mixed together complimented each other well. However, the portion size was the same as the regular menu.\nCavoletti ($13): I love brussel sprouts and thought they did a great job on make them crispy and flavorful. However, it was a bit oily. Portion size was same as regular menu.\nMillefeuille of Aubergine ($16): This dish was good too. It was cheesy and the tomato sauce was good as well, reminded me a little of eggplant parmesan. It was a bit oily, and portion size was same as regular menu.\nChorizo & Wild Mushroom ($17): This one was a bit too salty, but if I ignored the saltiness it was good. It was cheesy and the mushrooms enhanced the cheese and bread flavor. This was also the first dish where I felt like the size did justify the price.\nBrisket Croquette ($16): The taste of the crispy outside with the shredded beef inside was good, and the cream complemented the dish. There was no difference in the portion size.\nVeg Medi Paella ($22): This one was not worth the price. It was not flavorful and it was even saltier than the Chorizo & Wild Mushroom flatbread. I was hoping that someone would have came to check up on us (which most of the restaurants i've been to they always do ask) so i could have said that the flatbread and the paella was salty, but unfortunately that did not happen\nChef Daily Selection (I think it's $12 based on the dessert menu): It was a tiny piece of cake that I don't think was worth the price, but the taste was good. It was warm and the fruits and sweet sauce complemented the cake.\nGelato Tasting ($12): This was 2 scoops of ice cream of 4 people, so I guess it would have been $24? I have never paid $24 dollars in my life for 2 scoops of ice cream. There wasn't anything special about the taste. I couldn't even remember the flavor.\n\nService: The restaurant week menu had a mandatory 20% tip, which I am okay with. However, the same way that 20% tip was mandatory, the same way I expected good service. The waiters did not come check on us throughout the course of the meal, which I have never experienced before in other restaurants if it was a multi-course meal. I would have said something about the saltiness if they had asked. Also, they forgot the limoncello/coffee which we would have totally missed out on if my friend did not browse through the menu again.\n\nAtmosphere: It was hot. nuff said.\n\nOverall: So the portion size was not bigger, it was the same as the regular menu. So to me, restaurant week was not worth it as there was not a huge discount compared to other restaurants I have got to over the past few years. The mandatory 20% tip would have been fine if we were checked up on and the drink was not forgotten (i know people make mistakes however given that we were not able to change the tip, the service quality should not change either).\n\nThe whole meal for 4 came out to be $318 for 2 plates of the each item above, the ice cream was only one bowl though for 4 of us."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoamRXRmVBEAE",
            "text": "The perfect small plates place.  They have a great mixture of Spanish, Italian and American dishes.  Each dish was unique and the service was impeccable.\n\nThe dishes came out at the right pace.  They continuously replaced our personal plates with new dishes.  They kept the water/drinks flowing.\n\nI took a pic of the menu.  Take a look."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxN01mNFlREAE",
            "text": "Came here for my birthday.\n\nI’m honestly disappointed with the food. Our server who at first was very accommodating with the recommendations. So we went with some of his choices.\n\nThe Esquites, corn salad was very seasoned & delicious. It was a great start. Ordered the baked oysters, very good. & the crab cakes were delicious!\n\nBut the risotto was undercooked. We waited for our server to come back. The rice portion was off, & we could even feel the rice grains. When informed the waiter with the dish, he had told us that it’s supposed to be cooked “Al dente”. We returned the dish.\n\nThe ribeye was nothing great. Completely bland. & the lamb ribs were bland as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqOWU2OUVBEAE",
            "text": "Please visit this place. We had an amazing experience. Thanks for small plate that we were able to try multiple dishes. Shrimp Risotto was amazing, it's supposed to be that way as opposed to other reviews. The brisket croquettes had a very unique taste to it. Taro Gnocchi just as what reviews say is heavenly.\nPlease try dessert. I was at awe having Orange Biscotti Parfait and Coconut Lime Brulee. One of the best desserts and perfect portions for the price. 💞\nHighly Recommended"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMXJQZG1nRRAB",
            "text": "Service was great! Space was tight.\nWhat we ordered:\nCauliflower Steak - a bit bland but a good veggie option.\nCharred Octopus - love this, just wish the portion was bigger!\nShrimp Risotto - from the specials menu and this was a hit.\nNew Zealand Lamb Chop - meat was tough and bland, otherwise tasted fresh."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4dTlibXlnRRAB",
            "text": "There is nothing better than small plates to share. Plado has an excellent wine menu that pairs incredibly with the food options. The service is excellent, the menu is well laid out with lots of options no matter what you're craving. The highlight was absolutely the cheese plate & watermelon carpaccio!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2NC1tNmpnRRAB",
            "text": "They've really perfected the melt in your mouth texture, every dish we had was so tender and soft. The taro gnocchi was so unique and chewy. The short ribs were my favorite, it paired perfectly with the vegetables it came with. We also had the charred octopus and meatballs which were also great. But do yourself a favor and get the Tokyo rose cocktail. It is now my favorite, and I wasn't expecting this place to have good cocktails based on their impressive wine list!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTOWVyMEtnEAE",
            "text": "I'd like to extend my gratitude to German and Plado. The dining experience here is seamless and the food here is beyond exquisite with rustic tastes and smells that place you in Italy. From the delicate cheeses and meats to the Taro Gnocchi to the Chorizo Seafood Paella. Everything was great. Please see the attached photos!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMXRER2V3EAE",
            "text": "We picked it for its tasting menu, and it was great. Watermelon was a perfect start after a hot day, and the dessert was excellent along with everything inbetween. Leaving photos which describe it better than we could :)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxNTRTS0dREAE",
            "text": "Plado Tasting Bar was an excellent dining experience. The menu was split into different categories with a plethora of options for both vegetarian and non-vegetarians alike. The style of the cuisine is a fusion of Mediterranean and American. Food was fresh, delicate, and bursting with flavor. The drink menu while not exhaustive was complementary to the cuisine. And the service was top notch, everyone moved with a purpose.\n\nThis place is really really popular, so make a reservation in advance."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtejduWlFBEAE",
            "text": "Great service with decent food, I would recommended the meat and cheese the most.\nThe bread is crispy, and the portion of cheese and  meat is also really decent.\nThe paella is good, the mussel and shrimp are pretty trash, but I personally would prefer a dryer paella.\nThe truffle spaghetti is OK, but I would recommend trying other things first.\n\nThe cocktail and beer are pretty nice given the price of $13/7.\n\nThe service itself is also great, a recommended bistro in the area!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXb3RhMVp3EAE",
            "text": "Amazing food and environment ✨\nI highly recommend this place. We had the full experience because we were 8 ppl so we could order a little bit of everything. It was all great! The chef himself came to our table a couple of times asking how the food was."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxMTlMSXlRRRAB",
            "text": "I keep a list of around 15 of my favourite restaurants to send to friends visiting the city. Plado is at the very top.\n\nThis restaurant is by far my favourite spot in the city. Every dish I’ve tried is beyond delicious. Whether you try the starters, pastas, or meat, they are all fantastic and priced really well for the portion let alone the quality.\n\nA must is the taro gnocchi, and my other favourites include the artichokes, eggplant and burratta, and smoked lamb. But you really can’t go wrong with anything.\n\nI’ve been to Michelin starred spots that can’t hold a candle to this gem. The fact it’s run from a small kitchen while the owner serves alongside the staff is even more impressive. A 6/5. An absolute masterpiece."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkdTVuS0lREAE",
            "text": "A friend and I met up here for brunch and I was pleasantly surprised. The food and service was good and the restaurant was cute. They serve both small plates and brunch options (on weekend afternoons) and we tried a little of both. My friend made us a reservation for brunch. I walked in a little after 1230pm and there was no one there except the staff and I. This was fine except they do require a credit card hold for reservations (or maybe it's Resy) which is a little strange and not needed.\n\nI started off at the bar with a latte. The coffee was good and served as a much needed caffeine dose.\n\nAfter my friend walked in, we moved to a table, which was slightly too small and was also right next to the table behind us. But the acoustics were fine, and I couldn't even hear the person sitting 6 inches or so away from me.\n\nWe started with the vegetarian \"wings\" which were battered and fried cauliflower and broccoli served with a sesame BBQ sauce and a thick parmesan /salty cheese flavored dip. Or maybe it was an aioli. The battery wasn't as crispy as I would have liked, but the dish was delicious. Definitely get this if you're with someone who doesn't eat meat.\n\nNext, my friend and I shared the Ranchero which was on their brunch menu. This was delicious! The sauce was flavorful and well seasoned. There was enough spice on it that I didn't feel the need to ask for hot sauce. It came decorated with chips and those provided a great crunch.\n\nFinally, we had the French toast with coconut, banana, and Nutella. This is where the small table became an issue as there were too many dishes on the table.  If you go with a friend or order multiple dishes, I recommend asking for them to be brought out staggered. I was worried the French toast was going to be too sweet but it was not! The bread was cooked perfectly and the accompanying whipped cream was not sweetened which helped cut through the chocolate. The raspberries on the side provided a good tart note.\n\nOverall the portions were big enough for two and the food was better than most brunch options in Manhattan, imo. I would recommend this place for a quieter brunch in the East Village."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNdWFlMFNBEAE",
            "text": "Great staff -- Angelina\nThe food was so good I wish I had an endless stomach!\n\nTry the fried artichoke\n\nAtmosphere was very warm\n\nGreat date or meeting place\n\nPaella!\n\nEverything was the right size\n(Its a tasting menu)\n\nDid not see any kids..\nIts was Saturday night, date night.  Very high on the romantic scale tonight..."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSd0t6SGFBEAE",
            "text": "Love this place! Chill vibe, delicious tapas and inventive cocktails. We got the eggplant, octopus, short rib and cheese board. Absolutely recommend"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1X3ZELUJREAE",
            "text": "Second visit: both service and food were disappointing compared to the wonderful experience we had last time. The server gave me a lot of dirty looks after I grabbed menus for the table myself (we had already been waiting for 5 minutes, and had to head out at a certain time). The server also gave me more funny looks when I asked for a box for some of the vegetables. The dishes were also very hit or miss. The burrata tortelloni (which had been incredible last time) wasn't even made with burrata this time around, it was clearly made with ricotta (which both me and another member of our table are not fans of). The mille feuille eggplant was overcooked. One of the dishes we ordered never arrived (but at least it didn't appear on the bill). At least the artichokes, octopus and shrimp ceviche were all top notch. I thought this was going to be our go to spot in this neighborhood, but given the experience the second time around, we'll explore other options.\n\nFirst visit: Excellent service. Every dish we tried was incredible. Would absolutely eat here in future."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtNjZIY1pBEAE",
            "text": "OK experience. Some of the food portions were quite small and for the price the flavor just wasn't there for me. The butternut squash dish was underwhelming. Chorizo was solid, had a lot of flavor and was my favorite along with the arancini ball was great too!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPdE9EVHFBRRAB",
            "text": "Superb tapas spot in the East Village!!\n\nIngredients were fresh and cooked to perfection. Favorites included the Eggplant mille-feuille, lamb chops, and octopus. But seriously everything was AWESOME!!\n\nGood service and wine too. Ideal for dates or small groups."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNd1pXZ1FREAE",
            "text": "Everything was excellent. Service was friendly and attentive. Many items on the menu and was hard to choose! All items were very flavorful and delicious. Expansive wine list. This is definitely a go to place for any occasion. Good pricing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGay02Z21nRRAB",
            "text": "Amazing food at this lowkey neighborhood gem.\n\nWe got burrata, tuna tartar, smoked Scallops, squid ink pasta, and Millefille aubergine. The burrata and Scallops were standouts. Perfectly seasoned."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpMC1tbmZnEAE",
            "text": "Wow!!! That’s all I kept saying all night. German the executive chef has an amazing talent for getting your palate dancing. Every dish came in front of me was so beautiful.\nWhere do I start and how can I mention every item was better than the first. We had over dozen items with pairing it with the right sparkling and different wines. Every thing was paired so well with the right tapas. German Rizzo cooks with love and has passion that shows in his food.\nOmg all I can say! You must go once in life time for a life time experience."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVdWFpMkFREAE",
            "text": "My favorite Tapas Bar in the city!  Wide selection of food, and the ambience of the place is amazing. German Rizzo, Executive Chef is very creative and always offers interesting specials."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbEtMOTZBRRAB",
            "text": "Wow! This is going to be one of my favorite spots from now on. Every dish was so delicious and drinks as well. Taro gnocchi and aubergine were my favs!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNWRUM2N3EAE",
            "text": "Excellent food, service, and wine. Varied menu suitable for vegetarians and picky eaters. Small intimate environment with open kitchen concept."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2cU5yMmZBEAE",
            "text": "I read about Plado Tasting bar and decided to go yesterday. So glad I did. We sat downstairs and it was like an indoor garden. The service was amazing and loved all the different drinks they had. The food was fantastic too. We had the cheeseboard, the Arancina, the vegetarian wings and the carpaccio. Dessert was great too- had the S’mores N more! Will definitely go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkMUxiNjZnRRAB",
            "text": "Me and my Fiancé were lucky enough to get the place to ourselves this Super Bowl Sunday. I picked this restaurant for our upcoming trip to NYC and when we walked in was greeted by a cozy and intimate decor or the first floor. We had a reservation but I saw the bar and since everyone was out watching the game we could kind of have it to ourselves. We were taken care of by the owner because she let her staff have off for the night which is lovely (coming from my restaurant background) she was pleasant and we got to learn a lot about the restaurant, the brand and her husband the chefs passion for making great food. We had a mix of some regular menu items and some happy hour. We had a small meat board with olives, bread, ricotta, jamon and salam. We also had hummus with these delightful little Italian crackers. We got brisket croquettes that were too die for. AN INCREDIBLE espresso martini, pisco sour and a gimlet. We finished off with a play on a Lindser tart but with a soft Bundt cake raspberry jam and unbelievable pistachio gelato. She gave us limoncello on the house as a palette cleanser. We were so impressed and followed her recommendation of our next place to watch the game. Overall 10/10 experience !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eGZLR1BBEAE",
            "text": "Fantastic wine list, especially if you prefer Italian wines. The food is incredible—I highly recommend the Mediterranean salad and the carbonara. The cheese board is a generous portion and can probably satisfy one person for a full meal. I enjoyed the service/the staff and have dined here twice."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlNjl2ZnRnRRAB",
            "text": "Omg. This place is amazing!! The staff, the food the atmosphere. One of the best meals I've had and I've eaten all over the world! That short rib.. I'm still thinking about it!!"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwbGRPU3RRRRAB",
            "text": "The best spot I’ve discovered in a while. It’s a two floor restaurant with the best food you can eat. The smoked salmon is so good, and the scallops are awesome. But the best thing they have is their staff, especially Kelly, thank you so much!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVMGM2Q0p3EAE",
            "text": "The thought and attention to flavor and detail at this restaurant are unforgettable. One of the best meals I’ve had in awhile and chef German is a gem. The perfect ambiance coupled with generous, warm staff made for the perfect evening. Will return on my next visit."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtaXZ2LWhBRRAB",
            "text": "I found this place on google. I love tapas and wanted to try a new place around my neighborhood. Since the first time I went I felt in love with the place. The decor is beautiful. When you go to the bathroom, there’s a voice that says Italian words, so you can learn some Italian. As well. The food is so savory and delicious. My favorite dish is the Truffle Gnocchis. I had my birthday party at Plado and I have to say best place to have a private event. Kristen, the manager, sent me a customized menu. She’s very nice and gave me a great deal. It was a family style including drinks. Everyone was so happy with the amount of food we got and the drinks and the price was very reasonable. The service as well is great. Johnny is very nice and very attentive waiter as well as the rest of the waitstaff. I love this place and highly recommend, food is delicious, the waitstaff and as well as manager are very accommodating and hospitable and the drinks as delicious as well."
        }
    ],
    "reviews_count": 83
}