{
    "name": "Bacaro",
    "place_id": "ChIJ1bOSqylawokRw1zMPdY1HLg",
    "grid": "MN3",
    "address": "136 Division St, New York, NY 10002, USA",
    "rating": 4.4,
    "user_ratings_total": 388,
    "phone_number": "(212) 941-5060",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GMVpVRkhWRXB4VFhSd1VVZEpialZIUVdWb2NFRRAB",
            "text": "My favorite place in nyc"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxYVh6UlpXbWR4Y1RCVmJteHBZbVZSV1c5eFIzYxAB",
            "text": "Was pretty disappointed in the happy hour portion of pasta. Considering they charge $10 for pasta and tomato sauce I imagined it would be a larger portion than the one provided."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMU1XRmlWVGRsYjJoRGFFdHZaekZ3WnpodVluYxAB",
            "text": "An experience of intimacy unlike any I’ve previously deserved"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tReFMwbFZkbUl4ZUZwUGNtMVVjMHAyVVdkNFUxRRAB",
            "text": "Decent food, smart restaurant and good atmosphere. The service was the worst I have ever experienced in my entire life. The red haired waitress berated me publicly (and very loudly) in the restaurant for not tipping her at the end of the meal - which was a mistake on my part as I’d pressed the wrong button accidentally on the card machine, however when I tried to correct myself and tell her I did intend on tipping her but I just made a mistake, she started shouting at me. I was actually just trying to reduce the tip slightly as she was so unbelievably bad as a waitress. We certainly paid the price in the end getting shouted at."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWU9HSTRXR1I1VWpocFdVNUxkVEpuUjNsNFUyYxAB",
            "text": "A place with lots of character. Authentic and delicious Italian food in a very cool underground setting. The cicchetti and pasta are excellent. Very attentive service. Highly recommended for a unique experience!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205Zk5WcGFhblF6ZERWclZXWnFVVFpGVlV4WWRWRRAB",
            "text": "grey is the best host eva"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CQmFXdFpWUzFVWW1KbFJrVkxWMkpGZDBjd1dGRRAB",
            "text": "I have been here multiple times but only ordered one dish: the squid ink spaghetti, it is the closest thing to the one in Venice. It was delicious. Will definitely come back for more. :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoeU9HZGlhWEpLZUcxVlRGSnJUalJOTXpWeFltYxAB",
            "text": "Overall rating: 4.5\n\nSuper popular Italian place that seems to be best for group of friends or a date. Very tight on the main floor, but the bottom floor seems super romantic\n\nI went with a group of 6 and the underground feeling transported me. I had the duck cavatelli and it was good. But was it $$$ good. Eh. I’ve had better. The service was also a tad rough. They were very busy and it was hard to order, get a drink and close out. Not sure if this is the place for me."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMVoxcERVSGQ2VkhSRmExQnJRVmx1Ulhac1EzYxAB",
            "text": "We had a dinner at this restaurant with my wife and we had very good fine dining experience. Thank you guys ❤️five star"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQaVRwcG5PaExtcEJ3EAE",
            "text": "A small restaurant that gives off a nice cozy ambiance. The food and drinks were good and reasonably priced. My spaghetti nero did not look like the photos but it tasted decent so I’m not complaining."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJZ0tTNDNnRRAB",
            "text": "Romantic atmosphere, good capacity for reservations for large groups, and the squid ink pasta, gnocci and cocktails (my fav is the Fig Dark and Stormy) are great."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncXNxbEh3EAE",
            "text": "Amazing atmosphere! So romantic and peaceful. Went for Valentine’s Day and my girlfriend was blown away. Slightly limited menu but the food and drinks were amazing."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndk03MkFnEAE",
            "text": "My husband and I went for Valentine's day dinner to bacaro was nice I love the basement very cozy and warm romantic vibe appetizer was great the entre not so good maybe because of the steak was too fathy."
        },
        {
            "date": "8달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBaWJMSVZBEAE",
            "text": "Stupendo, piatti buonissimi, l’atmosfera molto accogliente, personale gentile e professionale, consiglio vivamente di venire"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBc3Y3RE13EAE",
            "text": "Laughably bad service and food was mid"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBelpTRU9REAE",
            "text": "Excelente lugar. El ambiente bohemio me gustó."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQNHVYZnJ3RRAB",
            "text": "Great Food. Friendly Staff. Amazing Location."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQN2NhN3Z3RRAB",
            "text": "I’d been here once years ago for a private party in the downstairs but had never been for a meal. Wow was I missing out. Was able to snag a last minute table upstairs (fully accessible) and when I say every bite was better than the last, I mean it.\n\nFrom the happy hour special crostini appetizers to the meatballs and salad apps to the main steak, it was foodgasms all night.\n\nSpecial bonus to the delicious wine that also flowed with each course. I was so focused on the delicious food, ambiance and conversation that I didn’t take any pictures except of my main. Shoutout to the server who kept topping off our wine free of charge."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIMU9hWWVREAE",
            "text": "This is one of the best Italian restaurants in the city. The food is fantastic. The fritto misto is a hit, and the eggplant parm is excellent. The salads are always fresh. Everything on the menu is good. The service has always been wonderful to me and my family. It’s a blessing to have a restaurant this good nearby. Many surrounding restaurants have wine lists that are heavily, if not entirely, focused on natural and organic wines. These are great for people who enjoy stemmy, funky, and fizzy wines. Bacaro, however, offers an extensive list of classic Italian wines, which is a nice change from the natural wine trend that has taken over the Lower East Side."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdTlEa1J3EAE",
            "text": "When I got there they couldn’t find my reservation which I made through Resy even though the details were correct and they acted as if they were doing us a favor for still taking us in. Then they sat us down at a ‘shared table’ even though there were tables for 2 that were still empty. We ordered the stracciatella with figs and it came without figs… I raised this to the waitress and she went to “check” and didn’t come back until 20 minutes later, so I asked another waiter and very nonchalantly said “Didn’t they tell you? We’re out of figs”. I asked if we could see the menu and the waiter rolled his eyes at me. Then I ordered a medium rare steak but it came very rare, almost seared and it tasted like nothing. Very disappointing experience with inexperienced staff who clearly couldn’t care less. I hope the owner of this restaurant turns things around or I don’t see it surviving very long."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbU9QY1V3EAE",
            "text": "Food was alright—the pasta itself was good but I would’ve preferred larger portion sizes. The bread and olive oil was served cold, which was disappointing. We got the panna cotta for dessert, and that was incredibly bland. Service was okay."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURud3RETzdRRRAB",
            "text": "The atmosphere was great! While the food was okay, the dishes could have used a bit more flavor, and the pasta wasn't as fresh as I'd hoped"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuOEk3REtBEAE",
            "text": "Great place for Venetian cuisine. Great service. Great food. The downstairs is a delightful warren of spaces"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMnFfckhBEAE",
            "text": "Delicious squid ink pasta!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieTREdllREAE",
            "text": "Very solid Venetian food served in a spot with great ambiance. Squid ink pasta is hard to find, and this is a great spot to get it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURya05DYnhRRRAB",
            "text": "This place is a JOKE!!! My “chicken Milanese” was literally a breaded chicken cutlet you get at the bodega with wilted mixed greens on top and a side of mayo. No effort at all"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMcUw3YlZnEAE",
            "text": "Loved the burrata, mussels, and spaghetti con vongole! Service was good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6NXJTd25BRRAB",
            "text": "Had a very rude waitress (pink hair), she came to the table slammed the water glasses down and was visibly angry to be serving our party. Also charged us for more drinks then we ordered and would not adjust the check at the end. Overall, the food was good and the scene was nice but the attitude on the server was too much"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6cHV1dnNRRRAB",
            "text": "I’ve been coming here since the very early days … even forgetting for years at a time before once again becoming regular….and it’s remarkably consistent, naturally hospitable and perfectly charming. Its like the deep sea prize fish beneath the swarms of small school fish activity  buzzing around what has now become Dimes Square."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6aUpTQzlBRRAB",
            "text": "To start the atmosphere is awesome. We sat in the basement and it was very cozy and unique. The service was amazing. The wine was all Italian. She got the chicken and it was crispy and lovely, she also got the potatoes, again, lovely and perfectly cooked. I got the mussels as an app and the sole filet with broccoli. The broccoli was the highlight for me as its prep was perfect. We got deserts which we normally don’t do, she had the lemon sorbet and again, excellent, I got panna cota, excellent. If I had a complaint, the music was eclectic and sometimes a little loud and just jumped genres a bit much…if I had to complain. But I’m giving this 5 stars."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6dk0yQnp3RRAB",
            "text": "Chilled red wine at top of wine list totally rules. I had the chicken milanese. I know people are going to ridicule me but it wasn’t salty enough!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUZ29YMkpnEAE",
            "text": "service was fine food was just ridiculously lazy broccoli was floating in its own oil, salad is just a pile of leaves chicken millenese was decent and the only thing edible, but you’re in the neighborhood so idk if the foods why you’re here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbktyenFBRRAB",
            "text": "Ana was amazing in coordinating our special dinner. Great service & ambiance in the cellar! Linguine with clams, gnocchi & eggplant parm were the best. Thank you for a special night!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqa0txWEd3EAE",
            "text": "Stellar ✨"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREa2NPbjJRRRAB",
            "text": "Was more upscale with better ambiance than viewing online conveys. Would definitely return. Great vibe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5c1p5SkJREAE",
            "text": "Food was great but the waitress had a weird attitude"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5N3M3NC1nRRAB",
            "text": "Over hyper and over priced. The last straw was automatic gratuity because service did not deserve that. Poor wine service, slow service overall and cold maître d'. Many dishes sold out which could mean they're popular or they don't know how to plan ahead.  Best dish was Nero spaghetti but still needs a protine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5N29xeTl3RRAB",
            "text": "We were here for a 9 ppl birthday dinner party on Saturday night, but the service was so bad.\n\nWe waited for half an hour to order food and need to wait servers for 20mins.\n\nCake fee is $3 per person/wine open is $4 per person but no one helps to serve us (we keep asking but no one comes, so we open ourselves)\n\nThe manger gave us 20% off after complaining, but hope they can get more staffs especially when you charge 20% tips for large groups"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5b3FDTjR3RRAB",
            "text": "My girlfriend and made reservations for a Saturday night dinner at Bacaro to celebrate our anniversary. Their main dining room is in the basement and it is rather small. We were seated no more than 18 inches from another couple which really ruined the atmosphere. The space is cramped and it was so loud we could barely hear each other.\n\nThe food was good overall however we found a hair in one dish and they did not automatically compensate us which was frustrating. The service was overall ok.\n\nWith so many Italian restaurant in the City, I don't anticipate returning."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0MTkzNW53RRAB",
            "text": "Love love love this spot! Great ambience, well curated menu, exceptional service and amazing food and drinks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0aHR1YWxnRRAB",
            "text": "Came here to celebrate my boyfriend’s birthday. Nice romantic atmosphere. Great food and great service. Would love to come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNON0wzR09BEAE",
            "text": "excellent atmosphere, friendly service (on the casual side), great food, great cocktails and fair priced."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxcW9tSml3RRAB",
            "text": "Great apps: stuffed zucchini flower, crab salad, beans. Enjoyed the ambiance and bar on the first floor."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWdzlPNldREAE",
            "text": "when i walked in asking for seating, whoever was hosting last night around 930pm told me there was only availability outside. i waited for my friend, who is white, to come, and told her what happened. i then asked my friend if she could go in alone and ask. we were then offered an amazing table downstairs."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWd3FmVVN3EAE",
            "text": "Quaint, cozy place with great food, drinks, and service. We made a reservation and the only available option was outdoor seating. It was about 35 degrees and they had heaters but it was still chilly. The hostess quickly grabbed us once spots opened at the bar, and we enjoyed a great meal there. The bartender was very friendly and attentive. This is a great date night option."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWMGZ6MVRBEAE",
            "text": "The atmosphere is great and the service is very good. But I don't know if it was due to cultural differences, but the food was not very good. It's probably not a cuisine that suits my taste, but you can go there for drinks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsam92cTN3RRAB",
            "text": "The downstairs at bacaro is sooo romantic and cozy. The pastas are great (the cavatelli duck ragu is delicious). The service there was seamless for the area. Honestly the place is quite the gem"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsaHFpd0RREAE",
            "text": "Cute ambiance! Great funky-chill background music… Love the style, awesome little spot : ) . Especially the downstairs “cave-like / wine-cellar”;  Appetizers were great! The only thing I was disappointed in was the garlic shrimp and polenta entree. Polenta was delicious however a little TOO MUCH garlic and the shrimp were small, dry and bland. The Gnocchi Pomodoro was excellent, the linguine con vongole was on point! Will definitely be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGOHR6ZTFBRRAB",
            "text": "We were sat outside without the heater even though it was a 'warmer' day but we were chiveriling the entire time, fair, cuz we opt in due to our first choice had to wait an hr. Anyways, Spaghetti Nero was so good, a must try, and also the steak even though they were a bit cold by the time served and a bit too salty for us. Fritto portion is divided into 5% of shrimp, 5% of calamari and 90% of olives n others, cant complain cuz it tastes good just you know and right portion as an appetizer for two. The potates are crispy and steaks taste good but are bit too salty for us again. Honestly, dine outdoor in cooler weather isnt ideal for people who enjoy food as an experience rather than just filling up an empty stomach or spending time with friends. Actually would go again but will ask to use less salt next time😅"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1a0tPTEhnEAE",
            "text": "Food was very good, and ambiance nice - but bizarrely they served our main course just minutes after serving the first course. We were not finished with the first course and the second course got cold. Plus there were plates all over the place. Very strange particularly for an Italian restaurant.  The waiters were attentive but perhaps too attentive trying to clear the table too soon as well.  Seems like these are easy things to correct."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcWE2Mk5nEAE",
            "text": "Walked in with a party of 5 without a reservation on a Saturday night and of course there was only outdoor seating available. It was chilly but the space heaters worked well so we were comfortable. The waitress that served us was attentive and welcoming. We had no idea what to expect of the food but all of the dishes were tasty and satisfying. I’m pretty picky when it comes to fried calamari but I quite enjoyed their fritto misto antipasti and would happily order it again! My only critique would be for the bacalao with polenta that was flavorful but just way too salty.\n\nSpecial props for the fact that the bathroom inside was super clean and featured a large vase of fresh lilies! Just shows that the owners/managers care about the details!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtMEtQT3N3RRAB",
            "text": "I came here for my friend’s birthday. They have large tables that are great for groups. Also the layout of the place allows for privacy for groups. The design of the space was very inviting, it had exposed brick and gave out wine cellar vibes. We shared salads and rice balls and got a pasta entree each. The salad was 4/5, rice balls 5/5, seafood spaghetti 4.5/5. We also got tiramisu at the end and the texture was different from the ones I’ve had before. It felt like they have leaned into the cream cheese and butter. I liked that it wasn’t too sweet. Overall, I would recommend this restaurant to friends."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbE5LZklREAE",
            "text": "Great basement restaurant with good Italian food. The basement was inviting and cozy, and the staff was welcoming. The food was good, but nothing remarkable.\n\nThe spaghetti nero was salty and a bit of a one note. The cavatelli with duck were much more interesting, and I would recommend it. The fried zucchini blossoms with ricotta were decadent, and I also enjoyed it.\n\nThe gelato on the other hand tasted store bought, rather flavorless, and I was rather disappointed seeing how other reviews praised the dessert."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKODd1bWJnEAE",
            "text": "Come to Bacaro for its truly unique ambiance, replete with exposed bricks,  candlelit lighting, and a maze of dining nooks that are reminiscent of a speakeasy. The food and drink options are great, but the service needs some work.\nFor appetizers, we ordered the Zucchini Blossoms (good, but a tad bland), the Green bean salad (flavorful and refreshing), Fritto Misto (interesting mix of calamari and shrimp), Spaghetti Nero (very fascinating), Garlic Shrimp over Polenta (quite good but wasn't amazing), Eggplant Marinara (quite tasty and flavorful), and the Tiramisu (was straight out of the refrigerator, felt a bit firm). All in all, the food was quite good but lacked the wow factor.\nThe service needs some improvement - I recognize that it was a busy night, but the interactions could have been better (their response to our question about the specials could have been handled better - they didn't have any, but the way they responded was odd, they brought out our entrees while we were still working on appetizers and the small tables couldn't accommodate all the plates).\nNonetheless, Bacaro gets a lot of things right, and there is potential for it to be a truly special dining experience."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzNmVlVmtBRRAB",
            "text": "Had dinner here last week. Very pretty restaurant with two floors, though main dining is downstairs. The food was fine, except for the broccoli rabe which was way over cooked. The staff was superior and immediately said they would cook up another batch or take it off the bill. The dessert on the other hand was excellent!!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBcnYydlJBEAE",
            "text": "The atmosphere and decor here is absolutely incredible.\n\nIt looks like you entered an old rustic cellar and there are small semi private rooms in the back.\n\nPlace is good for groups and has fantastic food.\n\nStaff was friendly as well.\n\nHighly recommend the pasta Nero and rice balls"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlN3VINm5RRRAB",
            "text": "Although I visited here by chance, it was great. Looks very popular to NYC local residents.\nThey have good wine list and nice interior design. Gnocchi was also good. Wonderful dinner with good atmosphere."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhZ3ZUSXlRRRAB",
            "text": "I didn't quite like this place. Food wasn't tasty and honestly wasn't impressed. The servers were nice, cordial and helpful. I came out of the restaurant a bit dissatisfed about my overall experience.\n\nAlso note that gratuity is automatically added to bill for group dining, I'm not sure if this applies to 1-person dine in. I had the indoor, basement style dinner.\n\nOverall just a 2-star experience"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxcjlxVmNBEAE",
            "text": "Some of the best Italian food I’ve had. Get the duck ragu, mushroom gnocchi, marinated ribeye, and mozzarella. The Ripasso red wine is also a great choice for full bodied dry wine fans.\n\nServers are attentive. Atmosphere is classy and intimate. Highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSa3MtSmV3EAE",
            "text": "This is one of my go-to Italian places in NYC. The atmosphere of the dining area in the cellar is lowkey and romantic. Service is always exceptional too. The only thing that I would imrpove is the food. Don't get me wrong; it's great and one of better Italian food places you can go to in NYC, but for example, the gnocchi I had are too hard and better for fried gnocchi dishes. That said, the desserts are always perfect and our personal highlight."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwbEpTTllnEAE",
            "text": "A great dinner date or group spot. I was there toasting a birthday but there were several groups that visited.…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBa1p2Q2RREAE",
            "text": "Came here for a birthday with a party of 12. We started off with a meat/cheese platter - pretty standard. Then we ordered some of the razor clams, which were pretty good. For my entree, I had the steak, which was overcooked and a bit bland. Plus it took forever for the food to come out. Not worth the high price tag for mediocre food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLdjgzbGxRRRAB",
            "text": "This restaurant is a hidden gem!\nWe ordered the gnocchi with mushrooms (superb), the eggplant marinara, and the fritto misto. All fantastic. But the best part was the panacotta - the best I’ve tried in my life. Nice amd cozy atmosphere, and good service as well. Returning for sure!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4bV9hSzJRRRAB",
            "text": "Cute little spot between Kiki's and Forgetmenot that we discovered while waiting in line. Waiters were quick and wore masks the entire time, and menu can be pulled up via QR code on that is taped to the table. We tried the tequila cocktail…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxcnN6QlpREAE",
            "text": "Excellent ricotta cavatelli with duck ragu. The spaghetti with clams is a notch below but still very good.  The crispy mashed potatoes were enjoyable but I'd try something else next time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NHZibHBBRRAB",
            "text": "Truly Italian top!\nQuality of the food is outstanding, it will be regular and suggest to many friends .\nPlease give it a try ,VONGOLI- one of perfect dishes!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhb3VMNWJnEAE",
            "text": "A favorite hidden gem perfect for date night. Ask for a table in the lower level, it looks like an old wine cellar down there and it's quite romantic. The wine is great and the food is even better."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1a19DalR3EAE",
            "text": "Very nice rustic restaurant with good Venetian food and excellent service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaX2VIeEhnEAE",
            "text": "Food and service were awesome. Authentic Venetian food. Went with family early Sunday evening so we expected it to be sleepy but the basement eating area felt a little empty and dark. There was one other table there and it felt a bit like we were eating together."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxejc3cjhBRRAB",
            "text": "It's alright. The drinks are good but they're also ~$15 so they should be.\n\nWe ordered the meat and cheese plate, which for +$20 was plated the same way you'd plate $6 worth of cold cuts at home. Decent bread, but it's bread and it wasn't served warm.\n\nFor main I had an ink pasta. Which was one dimensional, salty with no balance. Honestly seemed like they just wanted me to get excited over black pasta and there was no reason I'd rather eat that than a spaghetti marinara.\n\nLot to be desired especially for the high price tag. If the restaurant wonders why I didn't mention any of this while I was there, the most honest answer is that for around $60 a person for main, shared app and cocktail I should just be able to come and enjoy. It would've been too much work to have a retry.\n\nI think there's much better Italian food in the city."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNleDk3X3N3RRAB",
            "text": "Super tasty. We had the gnocchi, ragu, and sole which were all amazing. The service was excellent and the atmosphere was vibrant. Prices were very fair. Went on a weeknight at 9p without a reservation and was seated immediately."
        }
    ],
    "reviews_count": 71
}