{
    "name": "Le French Diner",
    "place_id": "ChIJMa8x7oNZwokR3k3Elyw0VC8",
    "grid": "MN3",
    "address": "188 Orchard St, New York, NY 10002, USA",
    "rating": 4.5,
    "user_ratings_total": 494,
    "phone_number": "(212) 777-1366",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVd1RuRm5SREYyVFdwM2NURlVlbmhOZVd4TGFFRRAB",
            "text": "Every dish is well made with its unique mix of flavors. Yum. Will be back. Wine selection is excellent."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KS1JpMHRWMnhPVDJSamRHRllRVmQwWmtST2EwRRAB",
            "text": "I love this place."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5dGIxRnVOWHAzTTFsell6ZEpaRUpFVm5OZlkxRRAB",
            "text": "The steak tartare was roughly chopped and tangy without overdoing it, while the hanger steak arrived perfectly seared with blue cheese crumbles and those addictive crispy cheesy potatoes. Straightforward portions that delivered every time.\n\nThe compact space on Orchard Street has a no-nonsense cozy vibe, complete with French hip-hop tracks and a chalkboard wine list featuring simple labels like “Bordeaux” or “Chablis” for solid picks from small French producers, leaning natural and biodynamic at reasonable prices around $50-70 a bottle.\n\nThe staff stayed efficient, handling walk-ins smoothly and offering spot-on recs like a crisp skin-contact white; it’s dependable bistro fare in the LES. Five stars."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dlEyZDJlbUZqTFZaTmVHWmZNMVJIUlVKa1IzYxAB",
            "text": "Le French Diner is one of those rare hidden gems that captures everything you love about dining in New York — cozy atmosphere, impeccable food, and genuine charm. This tiny bistro brings Paris to Manhattan with every dish. The menu is concise but perfectly executed. The staff are warm and unpretentious, and the intimate space (barely more than a handful of tables and bar seats) makes every meal feel special and personal. Whether you’re stopping in for a glass of wine and a bite or a full dinner, Le French Diner never disappoints.\n\n⭐️⭐️⭐️⭐️⭐️ — A true NYC treasure for lovers of great French food and authentic hospitality."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xORlFrbFBWVTVuVURaMWIyMVpSWEJ5UkZCWVJGRRAB",
            "text": "Le French Diner is a hidden gem. The food is incredible — simple, flavorful, and cooked to perfection. The space is small and cozy, giving it that real Paris bistro feel. The staff are friendly and the vibe is relaxed but lively. Perfect spot for great wine, great food, and good conversation"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WT1YzTkZiMWRQVjJSb1kyWlZjWGwzZGtSSFowRRAB",
            "text": "Very good food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJMU1ESkhWSEkxV0VOR2IybFZlRXBXUWtOTVMyYxAB",
            "text": "Perfect French food in an unpretentious atmosphere. Line up by 5 to get the first seating. Don’t skip the octopus or the duck."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GS2FVbGpZWFZ0UlRSeWRIRlZkaTFoWkdsSVYzYxAB",
            "text": "Booking system is a failure - they should digitise to avoid mistakes"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzeFYySnBkMFJDUjNSdGMwVlpTSGQ0WVRRNFFYYxAB",
            "text": "Great food, good wine and intimate vibe - reasonable prices and worth the hype if you ask me. Definitely try to be there 30 mins before they open. The space is tiny, but the steak is top notch!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTVgwZFdUVlpKYzNRMFltazVhMXBSTUZCYU1rRRAB",
            "text": "Consistently good. Great food, great service, great atmosphere. No frills yet elevated. Good music too lol."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sVFNrTTBRMFJxUkZSMWVWVmpURmx4ZWxwcGNVRRAB",
            "text": "This is a tiny restaurant with a tiny kitchen that serves amazing food. The menu is selective and everything is well executed and tastes great. The service is friendly and attentive. Once you get in, you’re not rushed, just a great cozy dining experience. We had a few glasses of wine. And the staff always pour a little first for us to try and make sure we like it before he did the full pour. For food, we ordered octopus, buckwheat crepes, scallops, skirt steak. Everything was delicious. We especially love our steak. It was very flavorful and perfectly cooked and came with potato au gratin. Over all a very fun and pleasant dinner."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSE1rczNVSFpwVWt4WFZYSmxlRnAwYkhOS05IYxAB",
            "text": "Amazing wine selection! Everything we ate was so simple yet gourmet. Get the soft boiled egg and the steak tartare for sure."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSRFQydGZTR3R3ZG5KNFZVWlFOVkpZYVVoUWMxRRAB",
            "text": "The dishes tasted fresh, the staff helped us well, and we had no complaints. This place has earned my repeat business. Their diverse dishes all deliver on taste. You can feel comfortable about the hygiene here. A completely satisfying dining event!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSU4ybzVUVEZTWXpBMmVWbENOa056U0RneWJHYxAB",
            "text": "Really good spot. Good for a date night. Don’t skip on the octopus. Highly recommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkT01UaE9SRzV2WkRsT1pFSlRkV1pCVDNaRFRWRRAB",
            "text": "Fab must go"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUVNUSTVXREJ5U0dORVVFOXBObXAyWkdneWRHYxAB",
            "text": "45 minutes for the duck that was charred on one side raw on the other."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oRlgxZFBja1V6ZFdsS01FOVJkbFJRWW1wcWFFRRAB",
            "text": "Crossposting this from my Yelp review.\n\nAvoid if you value your time and expect to be treated with basic respect.\n\nAfter 12+ years of dining in NYC, this was hands-down the most bizarre and disrespectful restaurant experience I've had. I've never bothered to leave reviews before, but had to make a Yelp account just to post this given how rudely we were treated.\n\nWe arrived ~25 minutes before opening (so ~5:05pm for a 5:30pm open) and were the fourth group in line.\n\nDespite being well within the 18-person first seating capacity (only 10 people ahead of us), we were told to wait 1-2 hours longer because our group of 3 didn't \"fit\" their first seating arrangement perfectly, so we had to wait for the next seating.\n\nThey made us step out of line, and instead wrote down my name/phone number to call back later. Then, they proceeded to seat multiple groups behind us with no issue. The entire rest of the line (probably 10-15 people deep at this point) ended up somehow walking in with no problem.\n\nApparently, if they sat us right then and there at the counter, there would be one seat open/leftover (yes you read that correctly, a single seat), which was the end of the world for them. Based on their actions, they clearly think that filling every single seat is more important than treating customers fairly or honoring a first-come, first-served system that they've instituted themselves.\n\nThey said they didn't want to make more people \"wait\" on a busy Saturday night, but for some reason, it was fine if they made the 3 of us wait another 2 hours because we didn't fit into their game of musical chairs?\n\nAt one point, I even offered to dine standing by the high table so two in my party could sit on the high-chairs (thereby leaving 2 seats open for another couple behind us) but they still refused.\n\nAnyway, they eventually called us back at 7:30pm--2.5 hours after we arrived. We had already left as we absolutely were not going to be spending a dime there based on this gross disrespect, so we turned down their offer.\n\nTo the management team - if your business model is ruined by one empty chair for an hour, maybe clean up your finances instead of wasting your customers' time and treating them like second-class citizens, especially when they take time out of their day/week to wait outside your restaurant. Crazy concept I know, but it seems like most other restaurants (both highly/lowly rated) in this city can do it, so figure it out.\n\nI'm not naive enough to think this review will magically change anything, but I do hope that any future new customers will be aware of how they may end up being treated. I would recommend you take your business somewhere they actually value and respect your patronage (and treat you like human beings at that).\n\nBonus: After reading some other reviews, this doesn't seem like a one-off--they just like to randomly power trip and arbitrarily treat you like trash if you're not a regular or industry insider (as this place likes to be known to serve), so expect to be treated like an inconvenience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMFpubEZia0l0ZERWeE1EQkdlbWxTUVdrd1MxRRAB",
            "text": "It was nice, menu is quite limited and the place is tiny (seating for only 16 people in total). It takes them about 30-40 mins to get you what you order since there’s only 3 people working. Def recommended if you’re looking for a unique restaurant experience"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taaGIxWjVlRFV3UmtSNFYyNUdTRXRyVEdaWFVtYxAB",
            "text": "Extremely small (almost cramped) and the food was overly salty although I've found that seems pretty common for French food\nService was a bit slow"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaM1kwZ3pVMDl6VERWRVZsOVhURGhFWXpoS2VIYxAB",
            "text": "for the amount of hype surrounding this place it didn’t blow me away, that being said it was really good. the ouef mayo and socca de nice were my favorites, both outstanding. green salad was great, refreshing and light. the steak tartare was good but definitely not the best. it’s different than others being that it’s cubed instead of minced. the escargot was my least favorite dish, the escargot itself was so small and it was very garlic forward (fine for me but come prepared with mints). hanger steak was cooked perfectly (medium rare) and i loved the onions/potato on the side. came on a monday just after 6:20 and was seated immediately, thank god (i was praying the whole way there). i don’t think it’s worth a long wait but i would come back. it took a while for food to come out but once the first thing came it was pretty quick after that."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SU2F6SnJWa3RzY0VWMlZrZFBkMkZMWlc1eFNWRRAB",
            "text": "We arrived really hungry. Despite that, I found the food here to be average. Maybe my expectations were too high. Grilled octopus was too tarred and salty. Pork steak was average. Seared scallops was very good. Also, be prepared to wait an hour for your food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdmJuQmtaRU5FU21sVE5rNTRaMEU1YlhwR2RIYxAB",
            "text": "By far one of the best place I had. This assumption comes from me staying here for a year and exploring. The music in the resto is also amazing. Attentive chef and crews. Worth all the wait times!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSlFWQkRORFF0VDFKUmRuTnVhME5RYTFOVmRGRRAB",
            "text": "Le French Diner is simply one of the best restaurants at which I’ve had the pleasure of dining.  The intimacy of the experience is worth several pieces of praise itself.  But that aside, the food is unbelievable.  Best octopus I’ve had in NYC and the Hangar Steak is incredible.  I cannot recommend this place enough."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvdFJVSTNjbE5GV0dNelNGUlhVbGw2TUhFdE1VRRAB",
            "text": "It was an amazing experience. We had the best seats in the house, got to watch the show and enjoy a delicious dinner."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VMcW45NzdYcUlLcjhnRRAB",
            "text": "after reading so much praise for this spot, I had high expectations. the food was only aight. well executed, but nothing exceptional, especially for the price\n\nsteak was really good but it was $50 lol. I could get much more for similar quality at keens. duck was a bit too game-y, escargot just didn't have enough complexity in the flavor? small menu\n\nour server was nice enough to seat me w/o my full party present bc the restaurant had extra space and offered me wines to sample.\n\nintimate, open kitchen"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VOX0puYkRoOHJucW9nRRAB",
            "text": "NOT worth the hype; the octopus was way too salty; there were only 2 options for red wine by the glass; and the steak we ordered medium rare came as medium with cold, soggy onions which, upon complaining, were brought back poorly re-heated with the same (now medium well, and charred) steak. No effort was made to improve the horrific dish we were served, perhaps due to us being in young, female, unthreatening company. Absolutely doesn't live up to the name, and puts to shame the hype it has been given.\nGo somewhere else, thats it"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5c1FrZDJiVk51TFVkaGJUQTRkVnAyVTBwQ1MzYxAB",
            "text": "As a great wizard once said: « Fly, you fools! » - we ended up being literally insulted by the owner, who is a very rude character."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLYXcwYzZCdVlHUDNRRRAB",
            "text": "Finally got to check this off my list and was blown away! The dishes were Devine and it was such a cozy cool vibe"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPYlZoSWlkd3VEa0d3EAE",
            "text": "My husband and I went stood on line from 5 to when the owner came out to take first 18 people. It was painless and we chose our seats at counter.  We ordered a Languedoc which was truly horriblely thin and light.\nWe bought another better bottle which was better but not great.\nSo having lived in France and Switzerland near French border for 10 years we are quite savy.\nWe ordered the hanger steak, octopus and scallops. The food was quite good. The wine not so much. Somehow the bill was over 400$ because of wine so id say go but order the heaviest red he has by the glass. We left both bottles half full. The owner is cool and attentive and overall it’s a cute place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJWFc5T212cFlYdmlBRRAB",
            "text": "A true gem!  It’s not frequently that you go somewhere where everyone knows what they’re doing, they enjoy, and do it very well.\n\nThis was my first time and I Intend on repeating and often."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLWFZzYWU2bDhuOHpBRRAB",
            "text": "Just the best spot ever. Great vibe, great food, casual but so delicious. Tartar and green salad should not be missed."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKZWIzTEdOc19HTTZ3RRAB",
            "text": "Fui hace años y recomendé siempre a los que pasaran por NY ! El Octopus grill y Los scallopes (Vieras)!! Y la panacotta  son exquisitos !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQLVUtOF94NXVYaEh3EAE",
            "text": "Practically perfect in every way."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvalpMUlBREAE",
            "text": "Fine dining in a cozy casual setting"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvX0t5T2RREAE",
            "text": "I've been wanting to try a french restaurant for a long time. I just loved the vibe. It's like experiencing a little piece of Paris in Manhattan New York. It's not a big space at all, but I didn't mind, it's part of the experience.  I had the grilled Octopus and my husband had the steak.  It's was all very delicious. Next time I will definitely be trying a new dish. I totally recommend coming to this little cozy french restaurant. It was a great experience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbHRMSXZnRRAB",
            "text": "Food is fine, nothing special - steak was extremely tough. Thought it was odd they wouldn't let me stand in the restaurant (front was empty) for 10 minutes while I waited for my friend in the freezing weather. I offered to wait outside if that area became busy with people, they said I was not permitted to wait inside. Just strange to be in the hospitality business and be inhospitable. Many, many restaurants in New York. Food is much better at others, service is much better at others. Will say the vibe is very cute and cozy though! Probably would have liked it a lot more in my early twenties than now in my mid-thirties."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cHNEOThRRRAB",
            "text": "I really really wanted to enjoy this meal because of how exclusive getting a table feels. In the end, it was a fine meal that wasn't worth waiting an hour to get a table for.\n\nThe menu is small so we got most of it: grilled octopus (will never not enjoy), oeuf mayo, socca de nice (not a dish I was familiar with, interesting), escargot (always interested in this and this was just as buttery and well-seasoned as I wanted), rabbit leg confit. We also got a cheese board which we usually don't do and in the end it was an interesting mix of cheeses. One thing I particularly enjoyed was how many of the dishes came with an ample amount of bread, which is unusual. Service was quick and super nice.\n\nThe restaurant is small almost to a fault, so everything is very cramped (especially going to the bathroom). To have such a small restaurant and still be walk-in only is an interesting choice I don't particularly agree with, because inevitably everyone waits at least an hour to be sat."
        },
        {
            "date": "7달 전",
            "language": "gd",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NXJiR1B3EAE",
            "text": "The Frois Gras"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdDhmMzZ3RRAB",
            "text": "Amazing food + atmosphere! My favorite date night spot in the city."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnaXN1UEJnEAE",
            "text": "Absolutely fantastic experience. Been wanting to go here forever and it was well worth the hype. We had the escargots and the steak, both of which were phenomenal. We got in the line outside at 5 pm and sat down right at 5:30. Cannot recommend enough!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnd2FxZWRBEAE",
            "text": "Teeny tiny little restaurant , food well worth waiting for, very charming! Not handicap accessible however, just to note"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnLW9PYXpnRRAB",
            "text": "Great food.  Classics with a twist.  Get there around 5 if you want the first seating"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBZ2ZxZWNREAE",
            "text": "Very interesting vibe. Get online at least 1 hour before they open or you won't get in. Maybe 18 seats. But well worth the wait and the very cramped atmosphere. The food was phenomenal. Delicious takes on French standards.\nCasual dress, be foodie. Surprisingly well organized for such a tiny location. And very charming staff.\nIt's like going to your Friend's studio apartment for dinner with a small bunch of people you meet while waiting for him to get home, but your friend is an absolutely excellent chef so you are all excited with anticipation"
        },
        {
            "date": "8달 전",
            "language": "de",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBbnBMbkRnEAE",
            "text": "Ein sehr, sehr kleines französisches Restaurant, alles ist sehr einfach gehalten und auf das Nötigste beschränkt. Die Atmosphäre ist angenehm und die Stimmung top. Die Speisekarte ist sehr klein. Das Essen ist gut. Leider war das Onglet ein bisschen trocken. Ente, Oktopus und die Schnecken waren aber sehr gut. Der Service war sehr nett und immer zuvorkommend."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBby15bE1REAE",
            "text": "Their mayo egg and steak are both excellent! The panna cotta didn’t taste like a panna cotta, tasted and texture felt like a vanilla yogurt"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBdGZmQ013EAE",
            "text": "Rude bartender, I really wanted to try this place and the attitude I just received for no reason ruined that. There’s no reason to be rude and humiliate people trying to spend their money at your establishment."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMFpITDNRRRAB",
            "text": "I really wanted to love this place but was very disappointed with the food. The vibe was great and server was warm and friendly, but the food did not live up to all the hype and the price.\n\nWe started with the escargot with anchovy butter. Did not taste the anchovy at all, and was not salted enough so it didn’t bring out the flavor of the escargots. And the escargots were tiny.\n\nThen we got the grilled octopus. It was extremely charred. To the point that it masked the flavor of the octopus. And sauce was light and nice though.\n\nFor main we shared the hanger steak. This was the highlight of the meal. The potato was to die for and steak was well cooked and juicy. Though, one side of the steak was better than the other.\n\nAnd for dessert we got their only dessert, panna cotta with sour cherries. All I can say is skip dessert please. It tasted like Trader Joe’s yogurt with sour cherries. Not worth it at all, just walk a couple blocks and get ice cream around the area if you are craving sweets.\n\nNot sure if they had a bad night but the food was just ok. Not too good, not too bad. Would not wait in line for this. If it really was just a bad night, work on your consistency. Part of being a good restaurant is being consistent."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfODhXOXZ3RRAB",
            "text": "Tiny and intimate space for delicious French cuisine. The hanger steak was absolutely delicious and the grilled octopus was memorable too. Friendly staff. If you wanna secure a spot for the first seating of the evening, I'd recommend arriving 20-30 minutes before opening."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmeE4zT0l3EAE",
            "text": "exceptional meal, everything you want nothing you don’t"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmM1p1eXJ3RRAB",
            "text": "Delicious octopus, and wonderful atmosphere! A really delicious meal, small so go with a tiny group or two"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMaFlfWEh3EAE",
            "text": "Do not let the exterior fool you. Yes they could clean and wash their sign and make the entry more inviting-but this is part of their appeal.\nVery small restaurant-bar seating plus 4 tables. I choose to sit at the bar. The barkeep was friendly and knowledgeable of all menus. Started with the cheese board. Very very delicious. The chickpea crepe was delicious as was the octopus. I had ordered the steak and it was very good (loved the mushrooms) but the star of the night for me was the pork chop. The pork chop was cooked to perfection and the side of spicy mustard was the best I have had and worked well with the chop. Seriously-do yourself a favor and order the pork chop."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucElyTnJRRRAB",
            "text": "Awesome service and meal. Octopus was so simple - as close to perfect as I’ve had in a long time. I could eat the ouef mayo everyday. The escargot was well prepared but more salty than I have usually experienced. I’m still thinking about the chilled Grenache by the glass - sipping that alone at the bar on a rainy Sunday evening almost made it feel like I was in a Parisian hole in the wall. Go for the vibes. Go alone - it’s verrrry small."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbHJEQnhBRRAB",
            "text": "One thing I love is a great environment and delicious food\n\nThis place was both of those and then more! I went to celebrate a new beginning and treated two friends.\n\nBetween three of us we had about 5/6 items and we felt great.\n\nI loved this place. I look forward to going again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6MGRTbjRRRRAB",
            "text": "I came here to meet a friend for dinner on a Monday evening.\n\nWe were greeted by a bartender who seemed to have a “too cool for school” attitude. My friend and I sat at the bar and shared the escargots (which were okay) and the steak (which was good). The options for wine by the glass were slim… too slim for a “wine bar” in my opinion.\n\nNot an amazing place that I would make it a point to go back to, but wasn’t horrible. The place itself is cozy and cute as others have noted."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MmJmemdRRRAB",
            "text": "Literally the best Grilled Octopus & Hanger Steak of my life! My bf and I had such a fun night. The owner and the LES community vibes felt like a warm hug 🥰"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1dnBIRm1RRRAB",
            "text": "Incredible. Love love loved our dinner here. This is a very tiny restaurant so I recommend showing up between 5:30- 6 to ensure you can get in. Escargot and the steak were highlights of our dinner, although we didn’t have one bad thing. Wine was also excellent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURabXQzenV3RRAB",
            "text": "One of the top French spots in nyc to try ! Everything we ate was 10/10 and the service was excellent. Definitely get the socca de nice and the grilled hanger steak which comes with gratin (best I’ve ever had). Can’t wait to come back and try other things on the menu :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aDdYZWdBRRAB",
            "text": "Le French Diner is a cute, classy restaurant. We were here on a Saturday night. Regardless the food was amazing and the wine selection was simple and great as well. Every bite will be worth it! Mushroom appetizer was killer, as was the specials that they had that day."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqcFlfWTJnRRAB",
            "text": "Found this place on Instagram reels, googled it for a bit and found stunning reviews. It absolutely lived up to the hype. Atmosphere is intimate; food is succulent. On a Tuesday around 8:30pm, there were empty seats so I’m not sure how tough it is to get a spot on a weekend"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPOE5HT0p3EAE",
            "text": "Le French Diner is the definition of hole in the wall.  Very very French restaurant in all the right ways. Echos the little cafes in the back alleys of Paris.\n\nEverything dish is exquisite, and the owner is attentive and friendly. Spots are hard to get, so make sure to come early. Octopus and steak particularly stand out.\n\nThe kind of place you would consistently come back to. Full five stars with no reservations.\n\nAlso make sure to order a drink!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhaG9mdllnEAE",
            "text": "This one of the best meals we have had.... We got there just a few minutes after they were closing, they very generously said they would seat us, we  been to a play and taken a Uber to eat there. They didn't make us feel rushed and the food was excellent. My wife is Greek and loves octopus, theirs is the best one I have ever had including in Greece. Next time I am in NYC it will be on top of the list.\nAnd back again still excellent"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqOHF6dUZnEAE",
            "text": "It’s a tiny restaurant that only accepts walk in. Totally worth the wait! Perfect for a date or even with friends. Everything we ordered was delicious. This place is a must!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1ck9lZkVREAE",
            "text": "Went to Le French Diner around 6:45pm and got the unique table for 4 people. Great selection of wine and the octopus is a must try. Would definitely recommend it and hopefully will go back soon"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0a09EQ1B3EAE",
            "text": "I’m in the middle of my dinner, and I have to say that this place is mesmerizing. It’s tight, but it’s cozy in all the right ways. The food has been fantastic and the chef is outstanding. If you have the time you need to come here."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVOGI2YkJREAE",
            "text": "We went there for a late dinner. At first I thought I wrongly entered a different restaurant, because it is very tiny and looks more like a bar. I immediately got curious, because usually this means the food is so good that it overweights the whole look.( which was still cool by the way) the waiter was super friendly and quickly seated us. We were 4 and as I remember they dont take reservations. We ordered octopus, tomato salad and beef tartare for starters. Let me just say, the octopus was not only perfectly cooked, but it was the most flavorful and tender octopus I have every had on any restaurant or continent. For mains we took the duck and the steak, which were also delicious and for desert their pana cotta ( or was it cream brûlée? I don't remember, I was in food coma) anyway the waiter was really nice and communicative. We are coming back for sure! Thanks!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoM0xPR3l3RRAB",
            "text": "Hands down the greatest egg, of any style, I’ve ever had. In my life. Cut it in half to enjoy it longer. Actually, it was the best octopus I’ve had as well. Like, perfect. This place is tiny, zero pretense, great vibes. 10/10"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURldU9hWnlBRRAB",
            "text": "Steak tartare, escargot, and steak with au gratin are to die for. This was my third time going and it thoroughly cemented itself as one of my favorite restaurants in NYC period. It is the perfect hidden gem and such a cozy atmosphere that really makes you feel like you're \"in the know\" when you go with how few seats there are. Wine list is great and fairly priced as well. Can't wait to go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkb012R2xBRRAB",
            "text": "Est. 2014\n\nLayout/atmosphere\n*Intimate to say the least (bathroom located right next to prep station/kitchen); ten seat bar & three tables; brick wall with chalk writing; open kitchen; French hip hop plated over the speakers\n\nService\n*Good considering the hectic nature/cramped conditions and a three person staff\n\nFood/drink\n*Steak tartare (with garlic toast) - Good; tartare had some spice to it; the bread (possibly sourdough) was over toasted/almost burnt\n*Grilled octopus (aioli, piment espelette) - Good; lemon & aioli complemented the tender fish well"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMm9uWXZnRRAB",
            "text": "The other reviews are spot on. The food is incredible, the wine list is spot on, and the vibe is killer. They don’t do reservations but the wait list process is great and they’ll call you when a table opens up. Make sure to get the flatbread appetizer and the octopus! I’ll def be going back often!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyMWNfWGJBEAE",
            "text": "We had a wedding reception there and it was pure perfection! Small, tight place, but the food, service and atmosphere was terrific. Could not have asked for more!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNFLS1ib3ZRRRAB",
            "text": "What a cute little place to eat! Entree options are limited but it was absolutely delicious! Staff was great! Best French food I've had in a while!"
        }
    ],
    "reviews_count": 71
}