{
    "name": "Spaghetti Incident",
    "place_id": "ChIJa00rEYRZwokRP-GRuN-bLTQ",
    "grid": "MN3",
    "address": "231 Eldridge St, New York, NY 10002, USA",
    "rating": 4.5,
    "user_ratings_total": 874,
    "phone_number": "(646) 896-1446",
    "reviews": [
        {
            "date": "5일 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnM2JtTnJhMkpxYUV3dGQwNUViMnBzTm14MllsRRAB",
            "text": "Un’ottima Carbonara a Manhattan  ! Ambiente molto piacevole, intimo e perfetto per una cena tra amici o in coppia. Gli spaghetti sono spaghetti veri! Il servizio è impeccabile. Ho anche bevuto un ottimo calice di vino. Super consigliato !"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBdFZuSnJkbVJZWkVsbllXZFdjVGRNVlhoTFYyYxAB",
            "text": "Bad worker"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdWRISlhVa3BPZVRoMFVWVkNWMWxET0dKeFkwRRAB",
            "text": "Wow, this was delicious. The artichoke arancini was sooooo flavorful. I got a very basic spaghetti chitarra but was blown away -it and was so fresh, (with fresh pasta), perfectly sauced, and tasted divine. The homemade mozz/arugula salad was also delicious. I am so happy I tried this place. We went early, were not rushed at all and pleasantly surprised with how amazing everything was."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WaVpYWjVOMnBLVkc5RFprZHVXSFV5ZFVoeE5uYxAB",
            "text": "Wonderful place with tasty food and friendly service. Everything was reasonably priced. We went on a weeknight around 6pm and there was no wait which was pretty surprising given the quality and pricing. Definitely worth checking out the next time you need a pasta fix."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSYVVHWllXVEV5ZEcxbU5uQkxVMVIyT0ZWVmQzYxAB",
            "text": "thank you for the delicious pasta and your friendly welcome!"
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOYVpVNUtZbUZWYlhaMU9HcDJOV1JVVkUxQ2RuYxAB",
            "text": "Ristorante gestito da italiani.\nPasta ottima.\nAccoglienza e servizio ottimi.\nDa migliorare la location interna.\nUnico neo: non si può vedere in un ristorante italiano, gestito da italiani, un caffè con la cialda..."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNNVZWUkZTMFZVWTFOS2JVTTFOMTlKUzNvM2NXYxAB",
            "text": "Love the pasta here. I am vegetarian and always get the spinacine. Prices are good. Only thing is, the portion could be a little larger. It’s a cute place and never been crowded when I’ve gone there. The arancine are always amazing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VME1HNUZUbHBHV1cxMlJsbFNWbDgyYUd4TU9HYxAB",
            "text": "Our NYU twins introduced us to Spaghetti Incident, and it has become our go-to restaurant when we come to the city. The food is authentic and DELICIOUS! There is something on the menu that everyone will love. Great atmosphere and vibe. Wonderful owners and staff are dedicated to your great dining experience. Must experience and enjoy!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNFExTjRMWEJYWW1WUU5XMWtZMTlzTTA5YVMyYxAB",
            "text": "Amazing atmosphere, and even better food! Really enjoyed the lasagna."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCb2VWODRWRGgwY21vNGNUZDZSbmQxVlRSaGRsRRAB",
            "text": "everything was so perfect. so cute and cozy inside; great cocktails, great food, amazing service. I got an espresso martini and spaghetti, and my boyfriend got a negroni and the carbonara. everything was absolutely delicious!! will come again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KbFdFSnFielp1TTNaYWR6ZFpSVzUwZVhOek9HYxAB",
            "text": "Service was absolutely fine here but the food is not good. Like pre-frozen tomatoes in the ‘fresh’ chopped tomato sauce. Don’t waste your money!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oVE0ydE9ZM0JPUjBsTlZEWkZaWHAxVmtKU1NWRRAB",
            "text": "this has quickly become my girlfriend and I’s  favorite restaurant!! We come in about 3-4 times and have always had a fantastic experience! The food is consistently delicious. The specials are the incredible! The staff is so is kind and we will be back very soon!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoR2FGOUtSMVF0TkV4d1pFMDJiSFpmVVVGNmEwRRAB",
            "text": "Spaghetti Incident is the definition of a hidden gem. If you blink while walking or driving by, it's likely that you'll miss it! However, it is NOT to be missed! Super small & intimate, rustic with the exposed brick walls. I make it a point to visit whenever I happen to find myself on the Lower East Side. I've had brunch & dinner here on separate occasions, and if you happen to get a seat by the window on a breezy spring day - it's really delightful.\n\nThe pasta is made basically in front of you as they have an open area kitchen & your meal is super fresh. The burrata appetizer is wonderful, as is the flight of arancini & my go-to suggestion for your meal is Pesto di Cavolo Nero (Kale Pesto) but there really is no wrong choice on the menu - let your tastebuds be your guide! If possible, leave room for dessert & get the Budino al Caramello because it basically lives rent free in my head. Food is phenomenal, only to be outdone by their incredible & attentive staff.\n\nThey were once a cash only establishment, but after a recent visit, I learned that they are no longer cash only!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJUFJyS1RXbUpMY2ZREAE",
            "text": "Chill Italian joint with a friendly atmosphere. The price was affordable for a dine-in restaurant and the food was delicious. A reservation is needed. Dessert is pictured below. Panna Cotta, chocolate cake and tiramisu."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMYTRtX0NxNXRMMjh3RRAB",
            "text": "Great pasta, great wine, great service. Loved the down to earth friendly vibe in the lower east side!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMMkx1cUQwMzQ3TDN3RRAB",
            "text": "Super good food and friendly service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMVYxRmZXVEJ0YW5jM2FtNHRZeTFOYTJkVWJFRRAB",
            "text": "We got here with an enormous group super late. They not only got us drinks but fed us AMAZING pasta at 11:00pm. This place is delicious and everyone who works here is a literal angel. I love them."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyd2ZHUXhnRRAB",
            "text": "A great visit to Spaghetti Incident. The servers were kind and patient while helping us decide on the menu items. I had the Tagliatelle di Porcini (which I can't see on the online menu). We sat outside, the tables were quite small for fitting our plates, water, bread, and other condiments."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQLWwwZWFOMmRtYzd3RRAB",
            "text": "I've been coming here to Spaghetti Incident for almost 7 years straight and the service is amazing, the food is so fresh, and the ambiance is very relaxing and old fashioned... it makes the whole restaurant feel like I'm back in Italy. I Love This Restaurant! And I know others will too!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPbVB3T0MzdU9mU2lBRRAB",
            "text": "From the moment you step inside Spaghetti Incident, you’re greeted with an atmosphere that feels as if you’ve walked into a cozy, rustic home, warm, welcoming, and far from pretentious. Over the past 10 years, this spot has remained a staple for me, not just for the amazing food, but for the genuine feeling of connection it provides. As someone who creates food videos for restaurants, I’ve been to countless places, but this one is hands-down my favorite.\n\nI still remember when they went viral for their pasta cones all those years ago, and I’d drive all the way from New Jersey to New York City just to grab a to-go order. Sometimes, if it wasn’t too late, I’d stay and enjoy the meal in-house. That was the start of my love for this place. Since then, Spaghetti Incident has only cemented its place in my heart, it’s where my partner and I have shared countless meals, and we still make our way here together, just like we always have.\n\nWhen the pandemic hit and there was a real risk of the restaurant closing, I felt devastated. It was heartbreaking to think that such a special place could be lost. But when they made it through, it gave me hope and inspired me to start a page supporting local businesses.\n\nThe food? Simply put, it's the same high-quality, comforting, and perfectly executed Italian dishes that made me fall in love with the place in the first place. Our go-to order is always the Chitarra and the Bucatini, and they never disappoint. It's hard for restaurants to maintain that level of consistency and passion, but Spaghetti Incident does so effortlessly.\n\nThis place isn’t just a restaurant; it’s a part of my story, and I’m grateful for every moment spent here. Whether you’re a first-timer or a long-time fan, Spaghetti Incident will always make you feel like you’re coming home."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VLYmloYkxfLWVfREJREAE",
            "text": "Service was truly horrible. There was this young Italian waiter (who I always see smoking depressed outside when I walk by the place) who tried to start an argument with me about getting a drink. I had just paid for a wine, and was about to sit down. This place should treat their customers better.\n\nShame on them, people wont come if this young waiter is yelling at customers."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOFp5YXlBRRAB",
            "text": "Carbonara was the best I have ever had!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJa3NQX1dREAE",
            "text": "This is honestly one of my favorites! 10 out of 10 experience every time go. I am partial to a carbonara but they have a plethora of other wonderful dishes. 🍝✨"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMDZfekNREAE",
            "text": "Fantastic experience, gorgeous delicious dishes. Can’t wait to come back and try everything else!"
        },
        {
            "date": "7달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OFBUaDhnRRAB",
            "text": "Great chitarra pasta"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3OUo2aE9BEAE",
            "text": "I loved the cozy atmosphere and our server Tommy was the best example of the restaurant. He knew the menu fully and assisted us with choices. The menu was so exciting to read over. My meal was a sample of two dishes split with my companion. Both dishes had pasta that was aldente and was not to my expectations. I wish i knew so i could have asked for something else, sadly. I wish it was better to call it my favorite."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRN0t6bW9BRRAB",
            "text": "excellent establishment, I came here with a big group (10 ppl) and the atmosphere was so cozy. Food was excellent and their wine by the liter was amazinggg. Staff were so so nice. 10/10 experience😊"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnanVqeExBEAE",
            "text": "passive aggressive server. lots of attitude (tried to hustle our group out at the end, lots of small passive remarks the whole time, etc.) would not go back nor recommend this place for group dinners (unless you and your group want to whisper). and food was honestly average."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbkpDNjZ3RRAB",
            "text": "Be careful! Very inconsistent service.They cannot handle deliveries and onsite customers. Who loses? Delivery customers! Prepare to wait and wait and hope the food is cooked and hasn’t leaked and edible. This place used to be amazing and now it’s less reliable than a chicken snd rice truck"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBaTdLcjVnRRAB",
            "text": "Great italian place! Loved their house wine. There were very unique pesto pasta - the name is forgotton unfortunately - which is highly recommended!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdGUtRmdRRRAB",
            "text": "One of my favorites in the neighborhood. Try the Chitarra, so good. Excellent arancini, salads and tirimisu, too."
        },
        {
            "date": "9달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfc0kyQWtBRRAB",
            "text": "Sehr leckere Pasta in einem kleinen, aber gemütlichen Restaurant."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmaU1TNlVREAE",
            "text": "We loved it thank you"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQejQzTktREAE",
            "text": "Feels like the last good spot in the city for great, reasonable $ pasta that delivers every time. Never change, spaghetti incident!! It’s my favorite not just because of the food (everything is good but you ever just want some delicious spaghetti and meatballs?!), but also because it’s so homey and intimate."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQNGUyU1JREAE",
            "text": "We came here on an anniversary dinner after exhausting the nearby popular options, and this place shined. Awesome chewy pasta with rich, deep, meaty flavors."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNnRhdHB3RRAB",
            "text": "Great food, service and ambiance - would recommended"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNdWRuQ0lnEAE",
            "text": "They sat me down at the counter right behind the microwave and a roll of paper towels. I order the carbonara and a nero something or other red wine. It arrives quickly and I dig in. The carbonara, what can I say...it made me reminisce of an Italian childhood I never had and now I miss my imaginary Italian family which is sad. The wine came in a regular glass...I mean not a wine glass...which I wasn't expecting that because it's how my nana used to serve me home made wine at our country home in Tuscany...I mean my imaginary Italian nana, obviously...she pretty much raised me. Back to the restaurant- the atmosphere is cozy but people kept bumping into the back of my seat. My total was $27; I gave the waiter $40 and he asked me if I wanted the change. Sorry buddy but yeah, I do. Overall 4/5. Miss you nana."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYZ2Ria2d3RRAB",
            "text": "Great place for fresh made pasta! Love the sauce and texture of the house made pasta. The tiramisu is also amazing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdXNfaW1nRRAB",
            "text": "We started off on the wrong foot but the situation was quickly rectified, so lots of credit to the small team for that.\n\nFood was excellent\nBathroom is clean\n\nIt’s a small place but it all seems to work like a choreographed dance.\n\nI was pleasantly surprised by the reasonable prices.\n\nMy only complaint is that the calamari was a bit tough."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYLTlydnJBRRAB",
            "text": "We just happened upon this restaurant on a walk. We loved the food, and the service was very welcoming and fast! Cozy setting, a little dark."
        },
        {
            "date": "1년 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYelBIcnNnRRAB",
            "text": "我們點了chitarra\n裡面的馬茲瑞拉起司很多塊\n給料大方\n細麵條麵條軟硬適中\n羅勒番茄醬汁也很新鮮\n另外一道Lasagna千層麵附上現刨起司\n肉醬與麵層層交互 搭配的很剛好\n吃完不會很膩\n餐廳環境燈光較暗 很安靜\n適合少人小聚\n餐點都很好吃"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdUtlbnZ3RRAB",
            "text": "Calamari (special) was excellent and the tagliatelle ai porcini was solid. Euro style portions. Homemade pasta is always a big plus! Great service too!"
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYc05LY3RBRRAB",
            "text": "Ragazzi italiani, locale serio e buoni prodotti.\nCarbonara ok io ho preso degli gnocchi agli spinaci crema di zola e noci OTTIMI"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURual9yMTl3RRAB",
            "text": "We had such a beautiful evening there with our friends. The food was amazing. Best pasta I had in NYC and the staff was so welcoming. I definetly will be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNWNUZDd3RRAB",
            "text": "Staying at a nearby hotel and just googled “Food” and was happy to find this place. It was a very nice atmosphere and our waiter, who I believe was also the owner was very kind."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIM2RDX1VnEAE",
            "text": "Great classic pasta! Chill vibes for casual hangouts"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNILVl1MEp3EAE",
            "text": "Good prices for good food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdXY2T1BnEAE",
            "text": "Final night in New York and again, Jim was looking for meatballs. Whereas I needed something vegetarian. We dined at @spaghettiincidentnyc near our hotel.\nFiestly, we were served were slices of sour dough with balsamic and olive oil to pour at our leisure. Nice way to start a meal.\nI ordered pesto and Gorgonzola arancini balls with a side bowl of spaghetti sauce. Jim had meatballs. For the first time, I ordered a dessert which was amazing. #budinoalcaramello\nNever heard of it before and I’ve gotta try and make this when I get home. Delicious. Not overly sweet and I nice serving size.\nHayto was our host and graciously let me take home one of the menus.\nA thoroughly memorable way to end this #usa2024 trip.\n\n#thewanderingreviewer #usa2024 #newyork2024 #spaghettiincident #spaghettiincidentnyc #italianfoodnyc #italianfoodnycstyle #lastmealinnyc #aranciniballs #pestoandgorgonzola #spaghettiandmeatballs"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINHZ5b0R3EAE",
            "text": "Nice small restaurant. Great pasta! Friendly service."
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3eUxPNmx3RRAB",
            "text": "Salmone & Asparagi / AMAZING"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6NHVpdVZnEAE",
            "text": "Homey Italian food at Spaghetti Incident. This cute little restaurant in the Lower East Side features fresh homemade pasta. I ordered the Chitarra, which included homemade mozzarella. Quite flavourful. I would definitely order the dishes they recommend. I had come here previously and ordered the Tagliatelle ai Porcini. It was not as good. Their recommendations are the way to go."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiME9lTVF3EAE",
            "text": "Google to the rescue! We were hungry and in an unfamiliar neighborhood in lower Manhattan with it being super hot out. Didn't want to walk around to find a decent place to eat. This jewel came up on Google maps. It's tucked away on a side street and we would never have found it on our own. And it was a fantastic find. They had a nice outside seating area, but we decided to eat inside due to the heat. It was wonderful inside. Cozy, funky décor and intimate. Went with my wife and 13 year old grandson, but if you were single this would be an ideal place for a date. Easy to hold a conversation there. Not a boisterous rowdy crowd there. Civilized noise level with everyone enjoying their meal along with unobtrusive conversation.\n\nWhile the atmosphere was nice it was the food that was the star of the show. We told our waiter we had just gotten back from Italy (Rome and Palermo) two weeks prior and our meals were as good if not better than some of the places we dined at while there. Unbelievable. We had eaten at A Taste of Italy on 23rd street, which is supposed to be authentic Italian (it is not, it sucks) and Spaghetti Incident blows it away. This place is real authentic Italian.\n\nStarted out with and order of mixed (three types) of Arancini. Beef Ragu & Fontina, Pesto & Gorgonzola, and Artichoke & Parmigiano. Our taste buds thanked us for ordering such a delicious appetizer. They also thanked us for ordering Carbonara. Absolutely mouth wateringly  delicious. Best we have had (wife and I ordered the same meal) in NYC. No problem holding it's own even in Italy. Grandson had a serving of Lasagna. He too indicated it was as good as anything he had while in Italy. I took a bite and had to agree. Monstrously flavorful (but not overpowering) and done just right. Deserts were Chocolate Cake with strawberries and Budino Al Caramello. OMG good. Service was perfect to top it all off. Oh, and there's more. When the check came I literally had to check to see if we were really in Manhattan. Great meal, nice sized portions and a check that was at least a third of what I though it would be. Am I being punked? Wow, it was really reasonable. Highly recommended. No brainer...next time we are in the neighborhood we are going back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxd0xEaFh3EAE",
            "text": "This eatery would be an adorable choice for a date night. They offer a variety of delicious pastas, and I found the desserts particularly delightful. While the appetizers are decent and the main courses are good, the overall ambiance makes it a charming spot in the city."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyN3NldGlRRRAB",
            "text": "Really enjoyed the food here. It was delicious and had good portions. If there's anything \"spicy\" on the menu think white people medium at most. I got a daily special with jalapenos in the pasta and all I felt was a minor tickle at the end. Service was fast and super helpful. Really cute spot!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURncFl1SGx3RRAB",
            "text": "Romantic atmosphere,but overall the food was not great. The place is very small and very busy. We did not have a reservation, but they were able to seat us at the bar. The bar area is nice because you get to watch them prepare the food. The…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdjYtQVl3EAE",
            "text": "Food was terrific!\nIt was fresh, made very well and in a timely fashion. I strongly recommend this place for someone looking for quality.\nOne down side, they only take cash. So be prepared."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJd015bXJRRRAB",
            "text": "It was a 5 star evening until the check came. I had no indication ahead of the dinner that the restaurant was cash only. Sure that’s my fault for not looking ahead into this and it wasn’t a big deal until I couldn’t use my card to get money…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0MWQ3LXVnRRAB",
            "text": "Ok. So I'm glad I found this spot. The food was cooked fresh. The spaghetti carbonara looks much better than what I got. Looks like the eggs got too hot, but very tasty all the same. Crab and Italian arancini was delish! The salad goes without saying, you! You'll enjoy this place!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtdmVDZV9BRRAB",
            "text": "Most excellent pasta ever. I am a fussy Singaporean who loves good food and believe me this place offers one of the best. Warm service and great food. Nothing more my son and I could ask for!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoOS1qQzhRRRAB",
            "text": "Went here on Valentine’s so service was slow and inattentive. They didn’t bring us individual plates to have the bread (we had to take from another table). If you plan to eat here, DO NOT get the burrata app, tasteless. Most of the dishes were heavily under seasoned, especially their pasta special that day which is a seafood one. Their arancini was super fatty and cheesy and just made me bloated and stuffy right after. Also the seating area outside has bugs and mosquitoes 😭"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhOF9xWUFnEAE",
            "text": "SOO GOOD! I’ve heard a lot about this place and decided to try it for date night with my husband. One of favorite places for great pasta. The burrata was also one of the best I’ve had in awhile. Cute spot for date night or dinner with friends. Highly recommend!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZbzVTazNnRRAB",
            "text": "Very nice atmosphere. Cozy restaurant. Food was ok. The brussel sprouts we're amazing. Meatballs were just ok. Pasta was done well, but not like it wasn't he best thing I had ever eaten. I wouldn't go back unless I really really was forced to."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJaC02TXV3RRAB",
            "text": "Every time I come here, I am impressed, happy, and satisfied with my pasta. Lots of varied options for spaghetti (surprised?) and a nice range of arancini options as well. The fig toast was also lovely, and felt appropriate for Sunday…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnc3FQSnpBRRAB",
            "text": "Excellent service and excellent food great place to take a date. Update: This place has not changed except for one thing, the place is as great as it always has been. Back to that one change... I think they may have added one or two menu items and the food.... THE FOOD TASTE BETTER!"
        },
        {
            "date": "2년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1MU5mdDFBRRAB",
            "text": "Sono stato qui ad Aprile, ero in viaggio con la mia compagna e desideravamo provare i famosi spaghetti and meatballs. Nessuno dei locali ricercati ci convinceva, poi abbiamo trovato questo e devo dire che siamo stati molto fortunati. Una sera, in una giornata di pioggia, abbiamo mangiato un buonissimo piatto di pasta con delle “meatballs” davvero buonissime. Il proprietario Italiano Doc è stato simpaticissimo, molto cordiale e si vede che ama il suo lavoro. Complimenti, quando ritorneremo a New York passeremo sicuro di nuovo di qua !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6anJHS2NnEAE",
            "text": "I’m sad to write this review. I came with my brother for a special dinner for his visit to NYC. The wonderful Italian man with salt & pepper hair started as our waiter. The burrata wasn’t great but no big deal. Our pastas came. My brother’s $22 dish was a portion so comically small we were shocked and expressed as much to the disengaged long haired Asian boy who took over waiting on us (? very odd and did not like the switch up). He shrugged and never addressed or remedied it - busboy turned waiter? It ruined our whole dinner - it just felt disrespectful and my brother was hungry. This is a cheerful solid place nothing more nothing less - to skimp on a pesto spaghetti is pretty sad. Serve proper portions or at least train your staff to address customer complaints and be professional. I used to come here often and now I just won’t because it felt so wrong."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKa0pQZEpnEAE",
            "text": "We had the worst experience. We ordered chef’s special and explicitly mentioned it to be vegetarian. However our pasta had anchovies in it. We complained and pasta was replaced. However the restaurant did not seem to know the difference between vegetarian and non vegetarian and after knowing we are vegetarians they should have checked the ingredients with us. It was an allergen and against our religious beliefs.\nPlease double check the ingredients when you go here.\nWe did not receive our money back for this incident which was not appreciated."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNibVpQZG5nRRAB",
            "text": "Watch out that gratitude is automatically added even for two people and they don’t tell you. But food was good"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBNmE3aG9RRRAB",
            "text": "The first time I came here I had a delightful Lamb Ragu. This time it was a Squid Ink Taliatelle with shrimp, calamari, and asparagus.  They also accept credit and debit cards now. Autumn is a good time for eating pasta outdoors."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDbGRiWklnEAE",
            "text": "Everything on the menu just taste very delicious! This place is my fav spot for spaghetti! Salmon asparagi in creamy sauce is one of my favorite dish. Friendly service."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxaC1iYjZnRRAB",
            "text": "Awesome experience here! I got the Fettuccini truffle special which was amazing! Homemade noodles on the dish were delightful with the perfect amount of mushrooms and truffle, very tasty. The restaurant itself has a really cool, chill vibe with a great music selection. Staff were very nice and friendly. Would recommend!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJOHZ6bnVRRRAB",
            "text": "Causal atmosphere with friendly staff. Arancini tasted heavenly good! Tried carbonara and it was amazing! Will definitely come back again!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxeElpNjd3RRAB",
            "text": "DELICIOUS! Best Pasta in the Lower East Side! Went here for a date night and I was absolutely blown away by how great the food is here! I will definitely come here again!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3Mm9xSWF3EAE",
            "text": "Great homemade pasta! Loved the slight bitterness of the kale pesto sauce! The fried rice balls were good too but the goat cheese one did scare me a bit..."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHNU92NXN3RRAB",
            "text": "Great food. Price to quality is good (although they do add a 3.75% fee to use credit card). The servers are friendly and knowledgeable. The pasta always cooked to perfection. They are flexible and can make certain dishes vegetarian or vegan upon request."
        },
        {
            "date": "수정일: 4년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVa3NlT3NBRRAB",
            "text": "Je suis venue en juillet 2019, et j’ai apprécié mon dîner dans cette établissement ! Première fois pour un arancini, je m’en souviens encore ! Les pâtes au saumon était délicieuse avec les câpres. Les serveurs étaient conviviaux et professionnels !"
        }
    ],
    "reviews_count": 76
}