{
    "name": "La Contenta LES",
    "place_id": "ChIJdZGxHYFZwokRj85WGKuKF2k",
    "grid": "MN3",
    "address": "102 Norfolk St, New York, NY 10002, USA",
    "rating": 4.6,
    "user_ratings_total": 1030,
    "phone_number": "(212) 432-4180",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4MVRYTjNXbHBPVjFKSmNEbFFVSE52WkZwd09GRRAB",
            "text": "We travel every year to NY for my wife's birthday and out of the 3 to 4 days we are there we visit  La Contenta 3 to 5 times at least, one when we arrive in between and on our way back to the airport is always our last stop, I have been in the industry for over 40 years and question the reason why we are there so much with so many restaurants available? The mezcal and tequila drinks are the best anywhere in this city, I can only compare them to my own drinks with the freshest ingredients and great mezcal and tequila selections, but there are also other great mezcal and tequila bars which are really good too. The food is great the branzino with the spicy serrano salsa is fantastic but we mostly drink lol and there are also other Mexican restaurants with great food mmmmm so what is it about La Contenta that makes us want to be there so much? I can only think of is that they treat us the way We treat guests in our restaurant, they make us feel special, they remember us every time with a warm and open arms feeling. It is hard to put into words but we love La Contenta east and Brooklyn ( THE WEST LOCATION IS TOTALLY DIFFERENT) My wife told the owners that when she passes she wants some of her ashes put in a corner of La Contenta is that level of hospitality of this wondeful Mexican Institute !!!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GSmMzbDJXQzFFT1dNMlFXMVlVV2wzYTBGc2FrRRAB",
            "text": "10/10 definitely will be going back to enjoy my time at La Contenta. Came with my fiance and we definitely enjoyed our time there. Small but very friendly and comfortable. Would highly recommend the passion fruit ceviche. Music selection was also a hit. Ate every bite with a little dance"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wUU1VSmtWM2hVT0hodVUyUlFkbFZQTmpJMlExRRAB",
            "text": "Was disappointed with this place. The service was EXTREMELY slow. They also didn’t bring out our chips (we ordered chips and salsa and chips and guac) until after we had our entrees? And it’s OUTRAGEOUSLY expensive. Like the tiny guac bowl was $15. And the entrees (which were nothing special) were like $25-$30.\n\nI liked the ambience of the place and the drinks were good. But the food is mid and incredibly overpriced which is unacceptable in a city with so many better food options."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poaVdUVlZURGhKVUc1Tk1teHJNazVyZFhKSk1WRRAB",
            "text": "Delicious Mexican food in the lower east side. I loved my michelada and chille relleno with seafood. It’s a bit of tight space but that adds to the cozy vibes. I would def return and try more of their menu!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOQ1pqZGxiREZwZWw5d2NEWjRaa3BqVUdkWGVGRRAB",
            "text": "Delicious food 10/10\nExcellent Service 10/10\nthe best atmosphere 10/10\nAnd lets talk about the cocktails, just Perfection 👌"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdlZXbFpSMjV1WkZWc1RGbHNiVWg2VWxZeWRIYxAB",
            "text": "If you’ve been to the Lower East side location you know it’s good!\n\nI had shrimp enchiladas and they were amazing!  Everything here is good!  So good I forgot to take a pic!\n\nThis location is on the northern end of Greenpoint so it’s not busy!\n\nStaff here is also very friendly!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFNE5uRnBiVWRZWm5GRVpFbE5WVGxJUkRSc1duYxAB",
            "text": "Such a surprise. This place is unassuming at first, but the food was great and the bartender was amazing. The drinks are some of the best I have had in 15 years in NYC"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kaFdHdG9kekJ1Ym1kdlVYVTBVMUpTWTNSb2RIYxAB",
            "text": "Nice place great cocktails and food was v good . Could have been a bit hotter for me but that's just me"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FMlpTMHdTa2Q1V0dGdGJUa3lhMDlEVVhrMFJVRRAB",
            "text": "I love the vibe here :) servants are super kind and friendly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xa1NVVTVNR3BLZUhKTGRtRjNWbnBVTFRGNmJYYxAB",
            "text": "Great service and cute place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkamNsUm9NakJuYWt0aldHWTVablpSUVRKVWRuYxAB",
            "text": "Great Service! Great food! Great drinks! Our waitress recommended a drink for me that now it’s my favorite Thank you so much! Blackberry Gimlet"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOdVZrUXhSbTB4TFVFd01tdFFaRmh2V25sT1luYxAB",
            "text": "WOW\nTRULY INCREDIBLE EXPERIENCE HERE\nANTHONY, OUR SERVER WAS EFFORTLESSLY PERFECT\nTHE FOOD IS FANTASTIC\nCOZY VIBES"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVU1ITklZa0pGZGxWWlRWQkJMV1ZOUjBsZmNHYxAB",
            "text": "My sister and I visited The Back Room (next door to this, unclear if management is shared) around 8:45pm on August 2. The bouncer/security guard standing in between La Contenta and The Back Room checked our IDs and checked my small black reusable cloth grocery bag. Since there was cake in it, he said I can't take it in and he would hold onto it for us and went into La Contenta and kept it. We went in to The Back Room, had a drink and then left for dinner- about a 10 min walk away, we forgot the bag. We came back at 10:45 after dinner and asked for it. The security guard had changed and no one knew where the previous gentleman may have kept my bag. Another employee of La Contenta even told us \"you need to be responsible for your food\". I lost the bag, it had cake and gifts for my sister that I had just brought back from Brasil. Please don't take people's things if you don't have a proper system for keeping track of them. I'm really sad. No one was even interested in helping us and looking around to see where the bag may have been kept. No estoy contenta con La Contenta..."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMVZteFVVbmh6Y21jMk9DMVFSWFJsUVZoemJXYxAB",
            "text": "the birria tacos were really oily but didnt really realize they would make me throw up by the end of the night\nsorry😞"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaNWMwOTFjSEpNVlRCclNrTkhjVmN3VG01cVJsRRAB",
            "text": "Great food. Good service but a very small and cramped space.\n\nAnd it was very loud.\n\nThe food was great. Especially the seafood slider."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aQmNVbzBSMjFEWnpKWVNGVkJXbUZxTWpGQ01FRRAB",
            "text": "A great find, tucked away on the lower east side!  Small, quaint and authentic with excellent service, very tasty margaritas and the food, oh the food.  We started with Margs and Nachos, both top notch and then tacos all of the way around.   I had carnitas and then fish tacos, tasted the polo tacos, they were excellent as well.  Best Mexican in some time.\nThese people are sweet and accommodating, we would be back!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKc1ZGVkhMVVJDUTNsclpXUlJjbXhVV2xKM2NWRRAB",
            "text": "Went for drinks and apps and the drinks were great, but the apps were a bit disappointing. Good music and atmosphere but don’t expect authentic Mexican for appetizers at least."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JMmVFRlJUakJNV0hSV2JHSlRaMUJUYmpFeFUzYxAB",
            "text": "I felt mislead by the pictures and reviews on Google. Nice staff but the space was so small and the food tasted rushed. We got the chicken nachos and my friend said the chicken tasted like Trader Joe’s chicken teriyaki. We also got the birria tacos and it was anything far from birria. It didn’t taste great. Drinks were great though."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twNmIxQlpaRmhaTFZOdlNFbGlRbkZKWlROS2MwRRAB",
            "text": "The food is hit or miss. The service is extremely slow, we waited 40 minutes for some guacamole. The tables are tilted and wobbly. Would not recommend this or the sister place next door Vallarta Tropical."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KVU9YcDZNMWh2YVZoU1ZXdGhiVXh0VG1SRE5HYxAB",
            "text": "the outside seating very hot and there were flies everywhere. I also only got two tacos for my $20 meal. They added a 25% gratuity for my group automatically."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWFVqbHRjVjlKY0RaQ1gwTXdjak5HYlVKV05WRRAB",
            "text": "Best Tortas i’ve had around these parts, didn’t get to try their cocktails this time around but promised myself will have a couple on my next visit. Music couldn’t get any better. Definitely recommend this spot for great local vibes!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMFdHUkZlVXcxTlRGcVdsWlpWMEZmTFVob1oyYxAB",
            "text": "The food and drinks was very good.  I had the steak tacos with rice and beans, it was very tasty and the mango margaritas were very good too. The service was excellent. The place is small but cozy. I would definitely go back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKT05FWlZRa1ZtVEd4c1h6WkZZakJzVVc1eVdtYxAB",
            "text": "Decent- but pricey for what it is."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGakxWVTRjekJZYkVNeVNFZzVhV1Z2Y1U0eVkzYxAB",
            "text": "Vibes amazing"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25scGVtMU9lRlZrYjFRMk1VeFJlbEJ3YVZGdUxVRRAB",
            "text": "U planned my birthday party at La Contenta LES and would highly recommend everyone do the same! We were a table of 8 - and the offer for a prix fixe for that side group is great. They worked with me to select a menu and it was very easy to communicate with them. The night itself was great, everyone was so nice. The food is always excellent (I’ve been many times already), and the portions were huge! Would definitely celebrate another occasion here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVMk1YaDVUWFJ6TVZCVlkyUlZlbU5wZFhKc1ZHYxAB",
            "text": "I love their drinks! The food could do some improvement. Overall a good time"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpNXR2blZnEAE",
            "text": "🇲🇽 excellent Mexican food 🌮 😋 👌 🇲🇽"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMQ0h5b0dUODdfZ1V3EAE",
            "text": "Came from Philadelphia with the family on a day trip. We started with an order of guaca which was good. The nachos with chicken were better had to double them. Next we all ordered different types of tacos. From steak, chicken and carnitas. Price point was high for the amount of food served, but hey everything is expensive. They definitely need to make the order of taco to 3 and not 2. Looks like a favorite spot for locals. Would i revisit hmmm maybe just for the nachos."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNT24yTS1jdExLdVVnEAE",
            "text": "We recently hosted a 50th birthday party at La Contenta in the Lower East Side. From the moment we began planning, Maria was amazing to work with—warm, attentive, and so genuinely committed to making the evening feel intimate and unforgettable.\n\nThe atmosphere at La Contenta was cozy and welcoming—exactly the kind of vibe we were hoping for. The food was outstanding and the drinks fantastic. The service was flawless all night.\n\nIf you’re looking for a spot to host a special event—or just want an amazing night out—La Contenta is a gem. We’re so grateful to Maria and the entire team for helping us create such a joyful and memorable celebration"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBNGFUMWxRRRAB",
            "text": "Cozy indoor and outdoor seating. Well crafted cocktails and excellent mezcal selection. Tasty tacos and great happy hour food and drink options."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKZmEyUE9qa3V1UVBBEAE",
            "text": "One of my favorite places"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJZV8wOWJqck1xeVVREAE",
            "text": "Small business but very friendly and very fast service. Great happy hour. Bartender was a great host 👌"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKRGNwYV93cWUtZGF3EAE",
            "text": "Wow! This place is so fun! Everyone is so welcoming. Rafael & Rigoberto muchas gracias. 😁"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKUG55OF9IeWNMMTNnRRAB",
            "text": "Food and service were on point. Fantastic and creative cocktails. Shout out to Rafael for taking care of us!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZa2ItUl93RRAB",
            "text": "I promise the service is 10 STARS and I could not give a better recommendation. The food is supper WOW! I recommend the carne asada tacos (it comes with rice and beans) you will be full when you leave! COME! You will not be disappointed"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvallYeVhnEAE",
            "text": "Beautiful atmosphere but the food was ok. I admit I have a high bar for Mexican food, spending a lot of time in LA Texas and Mexico, and this spot didn’t quite hit the spot for me."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMzczYUlREAE",
            "text": "The menu changed within the last year. More choices on the drink menu than food.  The waiter was extremely careless and although the spot was empty… the food took at least 30 mins to arrive. When the food did arrive (Nachos) it was cold and very small in size. Wont return."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOS1XRGtRRRAB",
            "text": "Fantastic service. Delicious food and good drinks. They did  not go cheap on the drinks."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3d0t1Zy1nRRAB",
            "text": "Great place on LES. Great service."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNkpuWHhRRRAB",
            "text": "It's a nice, sweet, space with excellent food. The carne asada tacos are great."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3LWIyNlhnEAE",
            "text": "Just ate here was disgusting. Actually was gross. Also just burnt 75$ for poop soup or what they call traditional birria. Definitely never coming back"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NVBPdC1RRRAB",
            "text": "Great food and great service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbDZHTXJnRRAB",
            "text": "I visited this place for the first time nine years ago, and I was impressed by their drinks and starters at that time.\n\nBefore I share my experience, I want to give a big shout-out to the warm and friendly service. The staff is incredibly nice and always there to help ensure you have a great experience. They are polite and treat you well, making it easy to consider coming back.\n\nNow, let's talk about the food. The whole experience was fantastic, but I want to highlight the dishes we tried that day.\n\n**To Start:**\nWe ordered fish tacos and classic guacamole. I’m not a big fan of fish, but those fish tacos were really, really good. The guacamole was fresh and tasty, a perfect match with their totopos.\n\n**Main Course:**\nI really wanted to try their Pollo en Mole Poblano, but we arrived too early for it. However, it was very kind of them to open the lunch menu for us before 4 PM.\n\n**Enchiladas Suizas:** Five stars! I loved how they were prepared. They had the perfect level of spiciness, enhancing the flavors without being overpowering. This is exactly the amount of spice I enjoy in a dish.\n\n**Huarache de Camarón:** This dish included masa dough, grilled shrimp, bean purée, Swiss cheese, and roasted salsa. The roasted salsa was incredible—so rich in flavor. Five stars!\n\n**Branzino Veracruz:** This dish featured Branzino with Veracruz sauce and Mexican rice. It had incredible, rich flavors. It was lightly spicy, just enough to enhance the experience. Five stars!\n\nI am a big fan of desserts and always look for something interesting and memorable.\n\nI ordered their Tres Leches cake made with pulque and corn flour. I wasn't sure what to expect, but I was very happy with my choice. The flavor was different—not too sweet, just perfect. It was a unique experience that I really enjoyed.\n\nWill I come back? Absolutely! I can’t wait to try their Pollo en Mole Poblano. I highly recommend this place!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRanNicDJRRRAB",
            "text": "Great spot! Incredible tequila selection (only part of it is pictured)! The food was delicious. We had queso fundido and the steak with a twice baked potato and spinach…simple but wow. The flan was tasty but the texture was a little sturdy. Not too too busy on a Saturday night but it was starting to get busy around 7pm. We will definitely be back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURncXEyY2NREAE",
            "text": "Had a reservation at 7:30pm and didn’t realize there were two entrances. Went to the right side and the host let me choose which table I wanted to dine in (the left or right entrance). Decided to go with the left entrance given it was more quiet and less busy. Ordered our drinks at the bar while they got our table ready. We got the El Mixteco which was tasty and a classic Pina Colada. Got seated at a corner table next to the window which was pretty small and tight. We shared a guacamole and chips, birria tradicional de res (which we had no idea it was a stew) and enchiladas de camaron with a side of rice and beans (extra cost). The entrees were pricey given it didn’t come with any rice and beans (which was $6 extra). The enchiladas tasted better than the birria. The service was great though and very attentive."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBcTdpWUp3EAE",
            "text": "Best Mexican restaurant on the LES."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMk1MWkt3EAE",
            "text": "Totally brilliant boutique Mexican joint on the LES. Great Guacamole, Great Frozen Margaritas, Great Tacos, and great atmosphere/service. Just go. And get the spicy salt on your marg."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBbThLTFZ3EAE",
            "text": "Came here for my birthday and I cannot recommend it enough! The authentic and original food and drinks are made with passion and makes coming here feel like home"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBck9uU3J3RRAB",
            "text": "We had carne asada and carnitas tacos. Amazing flavor."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfbF8tUVVBEAE",
            "text": "Very small yet quaint spot to go for authentic Mexican food. Wonderful drinks served by Lupe (best bartender in the city). Staff is great and they really make you feel at home."
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNbkwzLXRnRRAB",
            "text": "오 맛있어요! 식당은 작지만 친절하고 맛도 좋고 분위기도 좋아서 좋은시간 보냈습니다"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMHRlcnlRRRAB",
            "text": "Came here for a cocktail making class hosted once a month by bartender Alex!\n\nHe’s the best - super knowledge about Mexican spirits & a great teacher. We had so much fun making 3 cocktails, one of which we created ourselves.\n\nWe also loved the food that came along with it, while we enjoyed our drinks! The class is hosted once a month and can be booked through Leisurely app."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyLU5MRXRnRRAB",
            "text": "Overall good experience and recommend if you’re in the area. We thought the food was great and reasonable prices for nyc. Guac was good, and good size portions. The tacos de carnitas weren’t spicy. I really liked the mole on the chicken and the shrimp enchiladas had a great sauce. The inside of the restaurant is small. The music was too loud, hard to have a conversation. If they could lower the music I would give it 5 stars. Maybe sit outside if you go and want to have a conversation"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwMEtubzBRRRAB",
            "text": "I had an awesome experience at this hidden gem Mexican restaurant in the Lower East Side. It was a pleasant surprise! The nachos were fantastic, and my fish tacos were absolutely delicious. My friends enjoyed their chicken tacos and quesadilla as well. The only downside was that the music inside was a bit loud, making it hard to hear each other. Despite that, I would definitely go again for the amazing food and overall great atmosphere. Can’t wait for my next visit!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NGM2Si1nRRAB",
            "text": "Great Mexican spot on the Lower East Side! We booked a table for 12 last minute and they were able to accommodate us which went well. Service was great and the food was really tasty. For New York, the prices were very reasonable and no one went home on an empty stomach.\n\nThe guacamole was on another level. A must try when you go! Their chicken mole was delicious, and they included plantains in it as well. Whether it’s date night or for a group, La Contenta is a great choice!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoaGZUMlJnEAE",
            "text": "Bookmarked this spot for dinner and was so excited to finally go. The staff was very friendly and very busy during the dinner rush (6pm-9pm) but we were never rushed to leave. The food totally fulfilled my expectations and it was just damn good. The cocktails are so spirited and the smokiness of my amber colored drink was superb.  Guacamole was one of the best I've had in a while. The hanger steak with chimchurri sauce was excellent - flavourful, tender and just delicious."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1dHE3MUpnEAE",
            "text": "The waitress is the best waitress I have had the entire week in Manhattan (ask for Karen)…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtblp2VC1nRRAB",
            "text": "Went with a couple girlfriends for my birthday. Small restaurant, tasty drinks and really good food. The staff is also really nice and always had big smile on their face.  The portions were small but we only got appetizers and were full (we each got a taco app and the nachos to share). I really like this place but would recommend going somewhere else if you have a big appetite"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlaTRiekd3EAE",
            "text": "Came here for brunch on the weekend, loved it! The food was amazing, drinks were strong & good, and the service was great! My only complaint is the outdoor dining smelt like a public restroom. Of course we can’t always control what people do in the LES after hours, but cleaning it before opening can help."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbGN6andRRRAB",
            "text": "Very good Mexican food. Wanted to give it 5 stars but it fell short. Great guacamole, nachos, tacos (chuck full of delicious beef) and margaritas (watermelon with jalapeño). The shrimp ceviche tasted weird and we sent it back. Great arugula salad, decent salmon entree as well as shrimp entree but I didn’t care for the thick dough it was served on topped with puréed black beans. I asked for a side of rice and beans, but it wasn’t Mexican rice, just long grain white rice with corn kernels and it was cold and had no flavor. And again the black beans were puréed. Not great dessert choices but glad we arrived half an hour before happy hour ended. Loved the authentic Mexican vibe and music and it was nice to dine outdoors surrounded by greenery. Great staff. I would actually go back when I’m in the city."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwcU1tVWVnEAE",
            "text": "Amazing Mexican food!! We choose here from the high Google reviews and it definitely deserves 5 stars! Really delicious authentic Mexican food. Everything we ordered was really delicious. Only a small place with a few tables and chairs. Really cool atmosphere inside. Very happy to give 5 stars!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLdDVYZW5RRRAB",
            "text": "The outdoor booths are the most intimate little bubbles, made eating out feel relaxed.\n\nBut let's get into the staff, everyone is so courteous and friendly. I loved being able to ask questions in Spanish to my waiter as well. He recommended which cocktail to pick off the menu and it was a great pick indeed, The Mayan Express, try it.\n\nI hadn't been here in a while but I feel like the food has gotten even better. The tacos were incredible, I had the skirt steak ones and the meat was sooo tender and the Pollo en Mole Poblano 🤤, I felt like I was transported to Mexico.\n\nI will definitely be returning more regularly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMMUtiOFd3EAE",
            "text": "Second time here. Still great!  Fantastic vi be, great food and the best drinks!  Plan to spend a little time sipping your drink and enjoying the atmosphere!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLbUl6RWJBEAE",
            "text": "Very friendly and attentive staff at the restaurant. My gf and I had a private booth so we felt really comfortable dining out. The appetizer nacho came with an unexpected surprise as we didn't expected its interesting plating, and of course it is delicious!. Indoor space is somewhat cramped but has a great atmosphere."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPLWFTekNREAE",
            "text": "cheap drinks. big plates. very solid mexican spot for LES and the price ranges are stellar as well. the salsa they use on the chips i think was the same on chile quiles and it was fire. overall it's pretty standard fare and i would def…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqM1l2WHp3RRAB",
            "text": "Food was great! I got carne asada tacos and split some nachos with friends! I normally don’t order carne asada tacos because I’ve had some with overly chewy meat but these were super yummy! I only wish the price included some rice and refried beans is my only comment. The nachos were good as well. Our waitress was polite as well. The music playing was really enjoyable too. Will def be back"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3aS16Zkt3EAE",
            "text": "I loved La Contenta. The inside was a bit smaller than I was expecting, but the bar was lively, and the music was good. If you come in on a night, expecting a quiet intimate experience, just know that the music can get loud.\n\nI end up just getting the tacos here. I tried the fish and the Carnita. This is one of the best fish tacos I’ve ever had and the way they dressed up the supporting cast was the chefs kiss. It had a refreshing creamy pop of favor withevery bite. The Carnita had the Umami taste I was expecting. wow they also had a nice green sauce that was mild and blended well."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXLV9fMDFRRRAB",
            "text": "As you can see from all our reviews… we’ve been in a few Mexican restaurants… but absolutely nothing like La Contenta. We got there and the first impression was it size!!! Super small, we went there on a Saturday brunch but it wasn’t crowded as we were expecting. Someone greeted us and gave us a table right away.  We had a torta cubana, pescado tacos, a Mexican coffee, a virgin michelada and churros (duuuhhh). I couldn’t understand how flavorful that torta was, it was amazing, all the flavors bringing childhood memories from Mexico. The fish tacos were very fresh, it didn’t have the classic fishy taste, and the batter was perfect. Churros also tasted like churros from back in Mexico city, we definitely have to go back for dinner. And here’s the thing, after aaaaaalllll of these Mexican restaurants all over NYC, I think we finally found our favorite, food, service and drinks were on point. Wishing there were more stars to give this guys."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMcWZ2bTFRRRAB",
            "text": "Yummy pulque drink, very tasteful. Nachos with chicken were yummy too. Your average nachos, nothing out of this world. Super friendly service! Grateful for indoor seating having AC in this blazing heat!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbGJfTmhBRRAB",
            "text": "La Contenta serves delicious Mexican food in a relaxed atmosphere. The sevings are moderate, and the dishes are prepared with quality ingredients. In particular,  the enchiladas with salsa verde are especially good,  and the huevos rancheros are tasty too. The mixed drinks are divine.  The servers are helpful and friendly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcHFlTFlREAE",
            "text": "Happy hour drinks, nachos, guac, and tacos were delicious, nicely portioned, and reasonably priced. There’s a lot of competition for Mexican food in NYC, but this place does an excellent job. I highly recommend and will definitely be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwM29lTXJRRRAB",
            "text": "Very nice ambience. Great food.\n\nDrinks were amazing— get the spicy marg or habanero.\n\nThe enchiladas were some of the best you can find in NYC. The Baja fish tacos also were delicious.\n\nThe guac and chips tasted great (but wish they gave slightly more guac)"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bzRTSVhnEAE",
            "text": "De los mejores Restaurantes en NY 100% recomendable, la comida y bebida son deliciosos y la atención es excelente, un ambiente muy agradable, vengan y no se van arrepentir."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MWIya3R3RRAB",
            "text": "Had a birthday celebration here and the food was so delicious. Staff super friendly. The place itself was LES style, seemingly cramped but as a native I know that’s just how things were built back then. Glad my sister made the reservation to eat here ✨"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyOTVIWEpBEAE",
            "text": "Nice place to go during night to take some cocktails with your couple or friends they have a Lot of options on drinks. Staff is very friendly and they have some great micheladas!"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvMlBqLUdBEAE",
            "text": "This restaurant didn’t live up to its 4+ star rating that’s on Google. Although it was a very small restaurant, the Decor was nice inside.\n\nThey sat the four of us right by the kitchen and the light from the kitchen was glaring uncomfortably into my eyes and my friends eyes the entire dinner. Our table was also just a few feet away from both the bathroom and the kitchen which was pretty unsanitary.\n\nThe best part of the meal was the Chips and Quac, otherwise my rating would have been lower. However, the waitress tried to charge us $2 eventually for getting more chips which wasn’t right.\n\nOne of my friends actually got sick from the Chicken Tacos and Mojito she had and we believe it was a small case of food poisoning. Two other friends also had the Chicken Tacos and they didn’t really like them either.\n\nI would not recommend this place for Mexican food and will not be going back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1LWItV0VBEAE",
            "text": "Great place for a casual dinner and delicious tacos. Service was awesome and the chef whipped up some impressively good vegetarian tacos loaded with yummy veggies and made with fresh corn tortillas. Don't miss the crispy fish tacos either!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOX3NQN0dBEAE",
            "text": "Omg so good. The bartender and chef are so skilled. The Mayan and Oaxaca Express cocktails were out of this world, just like the fish tacos appetizer, the Chile rellenos & chicken mole mains. Tequila shots were delicious too. Basically what you’d expect in a very fine restaurant in Mexico. Oh, and super friendly & personable servers & great ambience. Beautiful bar with maybe every tequila & mezcal that exists ? I’m a bit obsessed and will bring out of town guests here. Oh… dinner for 2 with shared appetizer, cocktail & 2 shots came to 115 usd before tax & tip. Steps from m train !!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURseS1ybUF3EAE",
            "text": "First the cons- the place is small.  Maybe 5 tables, a few bar seats, it feels cozy but you may have to wait for a seat if it's a busy hour.\n\nPros- Everything.  Went for brunch with a friend after watching a movie across the street at Essex Cinemas.  I'm so glad I found this place online!  I got the chilaquiles with added chicken, my companion got the tres leches french toast with an absolutely delicious berry compote.  Bloody Marias were tasty, if on the smaller side, but were very reasonably priced so I didn't mind.\n\nVery nice server.  Looking forward to going again and trying more of their food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNXJmU3B3RRAB",
            "text": "Truly a hidden gem. Jose the bartender made some great drinks and was very nice and friendly. Owners were also very nice. Was recommended by some friends, we are from Denver! Had some delicious brunch."
        }
    ],
    "reviews_count": 80
}