{
    "name": "Death & Co East Village",
    "place_id": "ChIJKU1MNJ1ZwokRQ7eiWK511vI",
    "grid": "MN3",
    "address": "433 E 6th St, New York, NY 10009, USA",
    "rating": 4.5,
    "user_ratings_total": 2039,
    "phone_number": "(212) 388-0882",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SblRGOXRSMHhQVTNWMWFFRjZOMFl0TmxGclVHYxAB",
            "text": "This was the one spot I wanted to visit in New York and every expectation was blown out of the water. Kyler was phenomenal and went above and beyond for us. Drinks were top notched! The apple cider donut bites were amazing. Wished I lived closer!"
        },
        {
            "date": "1주 전",
            "language": "da",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wME9VcHZTa2xmU2kxMFpGRldRbms0T1VneVFVRRAB",
            "text": "Great cocktailbar"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xac1pWRlJaVTV3WW5ObVNHUTNTbDlYUzB3eFRuYxAB",
            "text": "The lady who greeted us at the entrance was wonderful — such a lovely person, and her warm attitude really brightened our evening. Unfortunately, the drinks here weren’t very good and just didn’t suit my taste."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KQlJWaDJSRVZQTnkxamJtTmhSbE14U2xOMFVVRRAB",
            "text": "One of my favorites"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSVdWWkRMV0ZGZGtKWldIWmFPRkpJU2pVNU5uYxAB",
            "text": "Such a great bar in the east village. The vibes were great and the drinks were so delicious. Shoutout Taylor our server who was extremely knowledgeable on the drinks and was incredibly kind and attentive. 10/10 would go back again!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVVRtZFVTRmQyYzA5WGNVRmFTVlp4WWtkTlgwRRAB",
            "text": "Amazing cocktails!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5UmJqTjBhMUZPYzBSelNrTldOVzlKWDJOYWEyYxAB",
            "text": "A milestone completed and boy oh boy was it good. The cocktails were out of this world and the service was next level. Bravo!!!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKU1dUaHlPR2RNWWkxSk0wVTRNWGxZU1ZwUlUzYxAB",
            "text": "Lives up to the hype. Keon was my server, rocked it."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KNmRVWTFUREJoUTJkbGNFSTFWVlJuVFZwV2VXYxAB",
            "text": "bartender is hot"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NM2RESkROREU0TUZFNVNXTjZTMll4V1hCV1pXYxAB",
            "text": "Amazing experience!!! 10/10 recommend. Especially if you sit at the bar! Everything was wonderful- the hostess was very friendly and professional, the bartenders really appreciate their craft, you can tell. You can’t go wrong with any drink. We walked in last minute, probably one hour before close and they were able to squeeze us in and I am so grateful! Just go and see for yourself"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SbVpuWmhTelZoVlZKTllsTlJjMGRPYVdaaFFrRRAB",
            "text": "Dream bar of my having read their book and followed them for a long time. Drinks were otherworldly, staff was super impressive in both their menu knowledge and genuine charisma, and the bar itself is just a hidden gem in the cocktail world. Cannot recommend enough, prices were not as expensive as they should be, and any chance I get to go back I will be taking"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JMFdFOUdUV0Z4YUVWeWJ6VXRkelpXZFZScGVWRRAB",
            "text": "Seriously good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5dlJFOVJjek5aWmpGQmVERjFNRlV0ZWxZMVYxRRAB",
            "text": "Solid drinks. Bartender was very friendly and informative. 5 starsssss"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcU5IbFFlbWxST0RKNWRUWlZUMHBGU25kNVYyYxAB",
            "text": "Wow! We  were looking forward to a nice evening with artisanal drinks, but we had a horrible customer experience! Courtney, the manager was quite unbelievable! I was really upset that my visiting brother asked for a gin and tonic or some equivalent, and she gave him a really snide look and after a second drink suggested he leave- he was completely calm and we left perlexed.\n\nI think that if you are comfortable with all the drinks on the menu you'll be fine but they won't be happy if you go off menu and the is not what it used to be. But if you ask for suggestions based on what you like and they are not libations as sophisticated as what's on the menu it could result in an embarrassing experience where you are treated poorly. If that's okay, you should definitely come! I was sad because this is a place that I've come for years! This young group of servers as well as very inexperienced manager Courtney Sheenhan has a very obtuse and novice understanding of customer service. They apparently could not get the receipt due an Internet outage so I asked for a paper receipt and she said she could not provide it to us. So we paid $150 for two drinks each but have no paper trail.  It's really disappointing for all of us when the night was full of enjoyment from the start. We won't be coming again and frankly the drinks have really degraded, not special at all. The place down the street Amargo was WAY better! Stirred drinks super collection of bitters.\nFind a better place. Sadly Death and Co has become a place of sad cache. Adieu!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOcFoyNU5URXRHZUdGTVJreHlPRlJpWjNocVZrRRAB",
            "text": "Hostess at the door was lovely. Waitress inside was not nice at all and didn’t really know how to advise us and neighboring guests on the menu.\n\nIf guests at your cocktail bar annoy you then maybe don’t work in the hospitality industry.\n\nYou can’t call yourselves one of the world’s leading cocktail bar if your waiting staff is ignorant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsVFNVTTVaMEpMVkd4elJWcG5aMHROWnpWRlpWRRAB",
            "text": "Best cocktails & service!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaSU9XODJXSEk0Y0hwd1psQnRjVlI1TUhkaFNsRRAB",
            "text": "Really cool spot/speakeasy, with an even cooler entrance! It’s not obvious from the outside (and we initially missed it!), and it’s fairly small and dark inside. I messed up our reservation and had a spot for the next day (8pm on a Monday). The hostess was kind enough to put us on the guestlist and texted us not even half an hour later. The menu of drinks is truly impressive. Probably 30-40 cocktails ? … it was difficult to pick one! I had their drink of the day. One cocktail came at about $27, including tax and tip. There’s also wine, beer and spirits if anyone does not want a cocktail (in a cocktail bar…) –I would definitely come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210UU0ybzVNV0k0VDNKbU5rUnRhVmRXV0hkaVRHYxAB",
            "text": "Closes at 12:30. Exactly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkUllqRkZOV2xuVDNGekxUVmFiekJYU25VNFgxRRAB",
            "text": "They know what they're doing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taNlQyNVZUbE5HUW1NM09UTjVUemt0U2pWVE0yYxAB",
            "text": "I'm a repeat offender."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toRmFYZDVWR1pWWTBNM1VuVkdMVmMyWVU5UFZsRRAB",
            "text": "Great drinks and service, nice vibe and ambiance."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210ME5IZzBUV1pCYW5OUmJFa3RUSFV4UVc5cVpYYxAB",
            "text": "Delighted with the staff!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wd1VFZGtURFpNU0RCRmVFVmtPV2QwWTJwNmMxRRAB",
            "text": "No idea why this place has good reviews. It’s not cool at all"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdmNFNTFaR2xUUjA1UmVqaHNXVEpTZFRCcVVWRRAB",
            "text": "Great place for a drink.\nAmazing atmosphere."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxb2FFSldTVkpvTld4V1ZtRmpTME14ZURZMWVGRRAB",
            "text": "Experts at work."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsamExUXdkRFJoTkZSWFZucEtkVzR0UW1ndFJtYxAB",
            "text": "I’ve been waiting for years to come to Death & Co., ever since I randomly found and bought their first book in 2019. In the following years I bought the other 2 books too and they all sit fiercely on my cocktail shelf. I finally managed to come to NYC and Death & Co. was the first name on my to-visit bars.\nMy expectations were high and they were met by their staff (very very special shoutout to Amanda, the lady who welcomed me at the door. Guys, she deserves a raise, really!)\nVibe is awesome, cocktails were great. The bartender also gave me a Death & Co. pen as soon as I told him I was a fan.\nI obviously came back 2 days later.\nWell done!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25adWNtaG1VM2s1VldGdlUxaFpia1ZVY1VWNFZWRRAB",
            "text": "Service was commendable. Drinks were excellent."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GaE0yWkpUVkZVV0VzMFkwbDJOSGR0TTFSMk0xRRAB",
            "text": "Easily one of the best cocktail bars I've ever been to! Drinks are amazing and staff was excellent. So professional but still friendly and welcoming. Bartenders are super helpful, will help you navigate the menu or craft something based on your preferences. So attentive and wonderful. Anytime I have friends visiting me I bring them here. Quality is excellent, if this place isn't on your list, move it to the very top!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210WFowTkViRkpLWmxZeVRuWkRObXcyY1ROVmFWRRAB",
            "text": "highly recommend the yamazaki 18 year"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WV1drcGtXVFUzZDB4dFlqaGxTelpOZGs5S0xVRRAB",
            "text": "Excellent experience, friendly staff and delicious drinks."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVFVFMDFNV1JqUVd0dE5GUnVUemxNWmxsRmVYYxAB",
            "text": "Great rum"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210TFVWODVURWxLWWxaUlgwTmlUR1ZFZWxkTmVtYxAB",
            "text": "We visited Death & Co on a Sunday night and had the best experience, all thanks to Kyler. This is exactly the kind of place where you trust the bartender to get creative, and Kyler absolutely nailed it every single time. Every drink was unique, balanced, and perfectly crafted. Thank you, Kyler, for making my birthday such a special one!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGMExXbGZNa05qUm1ZeE9HWndWWFJtZDFOT1IxRRAB",
            "text": "Loved the vibe and drinks. We had to put our names on a waitlist to get seated on a Friday night, but we only ended up waiting for around 20 mins. Very cozy and intimate and the service was excellent.\n\nThey do have a 2hr limit before your table is up and best believe that they’ll  bring the cheque as soon as your time is up, lol!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KRFZqQTJSazV3YW1wT1JVUlBkbVJsYUZaeWNsRRAB",
            "text": "Good drinks"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMlNXUnJaVGRZV1RKTVVEVTVjVFoyTW5WV1UzYxAB",
            "text": "Def overhyped, and the host makes you stand behind near the restroom forever while they said “we will seat you once seats open up.” Bunch of open seats and nothing. Be aware of this false promise, and overall drinks are more or less on par with dozens of other bars in the city."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0b2IzbHVaVWxTVkUxU04yVlZVR2w1VlU0elYyYxAB",
            "text": "Been wanting to come here for years, was not let down."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFdFdIVnRUM2hZTlVOVlduZENNV2RGVEcxMk9XYxAB",
            "text": "Nice speakeasy. Candles only. Nice cocktails"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tScVp6TmtRVTEzVnpaRloyaDFaVE50VTFaalRVRRAB",
            "text": "Went for a last minute drink at 11pm on a Saturday. The wait for 2 was reasonable, given how busy the venue was inside.  As we sat down we were quickly given menus and spoken to by a bartender. Cocktails were nice with a generally interesting flavor profile. Cookies were delicious, and appeared to be made to order.  Would I go again?  Absolutely."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWaVF6bERaM1V5V205b00ydFRNRlpRUkVkdWIyYxAB",
            "text": "Fun with great drinks! On the pricey side though and it can get crowded."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25neE56YzRWRkoyYm5RMFN6TXpSbEJpYUdWWk5rRRAB",
            "text": "Right from the beginning the hostess was so welcoming and professional. The atmosphere is otherworldly and the menu was extensive (in the best way) and varied. There's something for everyone. Jane was killing it , she was in her element. My partner and I work in the rum industry and wondering how she was doing it. It was like magic. The menu itself was a feat we had so many questions about. Didn't try the food but that's on my bucket list for the next visit. Must go at least once!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkc1pVdFpUekZTZVZkSExXVmlSbEJXY1ZaSlNsRRAB",
            "text": "Two of the best cocktails I have ever had; the king slayer and the vendetta. They are really innovative with their cocktails, provide a excellent service, and it was a pleasure being able to visit on this trip to New York City."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cHBPMG9BRRAB",
            "text": "This renowned cocktail bar stands out as one of the city's most iconic spots. Since they don’t accept reservations, arriving early is advisable; otherwise, be prepared for a potentially long wait. Their cocktails are extraordinary, with many crafted recipes so notable they’ve become the standard in mixology. Make it a point to visit—it's absolutely worth your time."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGZk1GazFRakp2YURsTlREaDZTRU16TjNwWE1HYxAB",
            "text": "First time here - 5 star experience. Wednesday on March 20, 2024 a little more than a year ago. I had arguably one of the best Buttermilk Fried Chicken in NYC.\nFast forward to today, Friday June 27, 2025. Ordered the Buttermilk Fried Chicken expecting something remotely similar but I left very disappointed. Felt like I got a whole different dish. Ordered the same drink Kyosho Cure twice and even the drink tasted different the second time within an hour.\nProbably coming back for the Director's cut drink which is hard to mess up. But definitely not for the food."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDOS1ua3dnRRAB",
            "text": "Excellence is in everything they do, it will always be a consistently great evening coming here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5MGQxSk9SREpZY2xOclZtbElXVWM1U2xGVlJsRRAB",
            "text": "Best bar in the world. Just tell them whatever you want and feel like having and they will create something specifically for you."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JMGNFNUVaRFJIYlVVeGJEazFTRFZhWTNGRmJVRRAB",
            "text": "Big fan of cocktail bars and was excited to finally try this place but it was a pretty big disappointment, I would not recommend it.\n\nAtmosphere: it's a small place but the noise level was unacceptably loud. For an intimate, dim speakeay-type setting I expect to be able to talk to someone right next to me or across from me, but it was a strain the whole visit. The place was packed of course, so why not turn down the music so people can have a conversation?\n\nAlso the day was humid, and the vents were dripping water onto the tables and guests (and if you're unlucky into your drinks). Their only solution is to send waitstaff around with a rag on a stick (I kid you not) and lean over to wipe the vents down every now and then.\n\nDrinks: very underwhelming to be honest. Turtle Power was tasty and I love to see the rare avocado drink, but didn't quite rise to the occasion. Wicked Game was my favorite and legitimately good. There was a mushroom-based drink (Momento Mycelium?) and while I very much appreciated the effort (big fan of savory drinks) it missed the mark. Traded sips with other people so got to try a lot of things and everything else was forgettable in my opinion.\n\nFood: can't comment on most of it since I couldn't really hear the other people in my group who ate but I got fries and they were ok (very overpriced though). The green sauce was good, wish there was more of it.\n\nService: they seem to be high on their own hype, got the impression like they were doing us a favor to tolerate us in their venerated establishment. Service was kind of slow. They scoffed at our table asking to hold one (1) menu so that we could be ready to order another round during their strict 2 hour time limit and they would not allow it.\n\nSince it was a birthday party someone brought a cake and we were told we'd have to pay a cake cutting fee. This turned out to be a $7 fee PER PERSON so we ended up paying more in cutting fees than the cake cost. It also didn't come out until like 90 minutes into our visit so we felt rushed."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxc05FVTVPRUk1ZG1ZelVYSmpSV1pvYm01NVIyYxAB",
            "text": "Very nice contrail bar 😎"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSQ1duRjZXR0pCUlhwQ1ZtTndXSEF0Ymt0MmVIYxAB",
            "text": "Great solid cocktail bar.  Nothing overly exciting but all well executed.\nBiggest complaint was my server.  He was very attentive and nice but when I told him my no list: coffee, bananas and melons I was given a melon cocktail.  The guy next to me said olive allergy and to simply put a twist in his martini...he got it back with an olive."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210b1pWRktVRkEyT1ROR2VFZEdXV2RHYmpsSFMxRRAB",
            "text": "Got here on a Saturday evening and it was amazing. James helped us and he was incredibly knowledgeable about the menu and offered suggestions that were to our tastes. The whole experience was wonderful. We also got the chicken tenders and marinated olives both of which were perfect bites with our drinks :)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJeVU4WWlPaS1ib0h3EAE",
            "text": "As they say: this place deserves all the accolades. Absolutely fabulous night and honestly I didn’t expect I’d get lucky enough with a weeknight walk in. But you never know! Worth trying :)\nTreat yourself to at least two different cocktails."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbnRTU193RRAB",
            "text": "It was a nice one-shot experience; cocktails were generally nice and inside atmosphere was ok. But it was too dark than what I would normally prefer.\n\nI am curious about their other cocktails that I haven’t tried yet but given that there can be easily a line even before they open (we got there around 5:45ish Saturday and had to wait for like half-hour), I’m not sure if (personally) it is really worth a revisit.\n\n칵테일 무난하고 안에 분위기도 그냥 적당히 괜찮은 편이긴한데 줄이 항상 긴거같아요. 그 줄 서야하는거 생각하면 굳이 또 오고싶다는 생각이 막 드는곳은 아니었습니다."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPdjlsWnFXeTkyTUpREAE",
            "text": "Atmosphere: 8.5/10\nEast Village. Classic Death & Co ambiance—dimly lit, intimate, and sleek. The space feels like an upscale basement speakeasy, with a moody, timeless design and a striking backbar. The crowd is diverse and lively, though the music volume can make conversation challenging at times.\n\nDrinks: 8/10\nRecommendation: Moving Target\nTrue to the Death & Co brand, the menu is extensive and thoughtfully organized by flavor profiles like “Light & Playful,” “Boozy & Honest,” and “Elegant & Timeless.” The laminated menu is high quality, and the cocktail selection is impressive. Drinks were solid. Considering my experience at the LA location, I would call the drinks “hit or miss”. The moving target is a well balanced drink and tastes good! Glassware is refined, though presentation and garnishes are kept minimal. Nice coasters\n\nService: 8/10\nThe staff is friendly and attentive, maintaining professionalism even during busy hours. Water is promptly served upon seating. Prices are average for New York City. The service here was more attentive than at the LA location. Be prepared for a potentially long wait; on a Saturday night, a two-person party waited over two hours."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdXI3bXhBRRAB",
            "text": "This place is of course legendary, and I’m just sad it took so long to finally come here.\nThe menu is fun to read through, and really spans the styles of cocktails well- they even had a flip, which was amazing.\nAs expected, the bartenders are really helpful and if you’re not sure what you want from the menu you could safely just have a conversation with them about what you like and they’ll pick or style something for you.\nIt seems the menu changes every six months or so.\nDefinitely on the slightly pricier side for cocktails bars of this genre in NYC, but the quality is very high."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPV051T2ZhaGNQcTRnRRAB",
            "text": "Had a great time at Death & Co. The cocktails were top-notch - expertly crafted and full of unique flavours. The atmosphere was stylish and inviting, and the service was attentive without being intrusive. Definitely a must-visit for anyone who loves quality cocktails."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvc3F2YnlnRRAB",
            "text": "Cocktails are always a hit here. Strong but not overpowering of the flavors. We came on a Tuesday night and it was not too crowded with great music & vibes. The cookies dessert was okay and comes with milk but the cookies we got were a bit overdone/burnt so they hardened quickly while arriving warm.\n\nAll their tequila based drinks are fun and unique!\nHostess at the door was great and even told us that their Seattle location in Pioneer Square would be opening soon! One star off service because our wait staff was checking on us very frequently while we were not even halfway through our drinks and kind of interrupted our flow of conversation."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPdk1wdDJpak5panpnRRAB",
            "text": "We are so happy we finally made it here. We didn't have a reservation, but we arrived 5-10 minutes before opening and were able to be seated at a table. I would say by 30 minutes after opening, they were already at max capacity. So definitely make a reservation or arrive before the open and wait outside. We didn't get food this time but we did get drinks and they were great! We will definitely be back and try the food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPT04tcExPM3BIWEdnEAE",
            "text": "We were too excited about being here to take photos of most things, but the shishito peppers were incredible and the burrata with beets was pretty good too. The tahini cheesecake is certainly an experience! I wish there had been a bit more variety in the cocktails, but the ones we had were delicious.\n\nWait time was quoted as 2.5 hours when we showed up around 7:30pm, but we ended up getting in after about an hour due to a canceled reservation. There is a nearby bitters bar you can wait at, and I’m sure the wonderful front of house person can give you even more recommendations for nearby bars."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyNV9PYlVnEAE",
            "text": "Death & Co East Village is a legendary NYC cocktail bar. Known for its expertly crafted, innovative drinks and dimly lit, intimate atmosphere. It's a destination for serious cocktail enthusiasts seeking a sophisticated and memorable experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJWGUzYjZCb1ktOWZREAE",
            "text": "Drinks and vibe are incredible. Jovante & Keon took great care of us. This bar is no longer on the bleeding edge IMO, but delivers a beautiful, refined product in a special environment. This is a 4.5 just for being stale, but such an icon in the city as well as delivering on its prowess. At this point in time, certainly worth a visit, just not worth going out of your way for."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5ak9MTmt3RRAB",
            "text": "It's been on my bucket list to get here.\nGreat speakeasy-like atmosphere, and the bartenders know their craft.\n\nTucked away in the Lower East side, if you don't know the name, I recommend a quick online search. A great cocktail brand that lives up to the hype.\n\nLoved the small bites as well. Two cocktails was enough for me, but I could have gone all night. The menu was great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3b3NHeTJBRRAB",
            "text": "This legendary bar lived up to its reputation comfortably! If you want the full experience, sit at the bar and engage the bartender in conversation. They know what the hell they are talking about, and it elevated our experience tremendously. The drinks are superb, carefully thought out and unique unto this place. Tiffany, our bartender, gave exquisite recommendations, and we were able to curate our experience exactly to our tastes.\nQueen of the night, knives, edge, rolling, blackout, and adrenaline rush, were all exquisite and catered to my whiskey, spirit forward palate.  The ambience is incredible, and there were a variety of liquors I had never seen before. Definitely one of the top bars in New York City, in the world. I only say that after visiting all of the bars listed in the top 100 in the world 2023 that are located in New York City."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5eWR5MFpBEAE",
            "text": "Finally a bar with amazing bartenders that consistently deliver well made drinks. The atmosphere is amazing, it isn’t too loud so you can have a conversation, and the staff are friendly and efficient. I’ve had so many good drinks here but personally love the planet caravan (it’s may not be on the menu but they still make it)."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBdzUzV1J3EAE",
            "text": "I live on the West Coast, but I was told Death & Co. is a place I needed to visit on my next stay in NYC. I made reservations for a Sunday night. The vibe is very dark and intimate. The bar is staffed with very competent and creative mixologists. They know their craft and make an effort to be personable and knowledgeable. I had a Tripwire, and my wife had the Cornicello. We both enjoyed our respective drinks very much, hers on the sweeter side, mine a bit more spirit forward, but well-balanced. The bartender acknowledged the anniversary we had listed on the reservation and volunteered to make us a special drink to celebrate. I told him how she prefers her cocktails, and he improvised a nice celebratory drink on the spot. It was great, but more importantly, attentiveness and engagement are what made a lasting impression in the moment. High marks all around!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLWG55ZkxPOWNlUnJnRRAB",
            "text": "Top tier craft cocktails in a dark and moody setting. Large menu with many different drink options to choose from."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvamZEY0RnEAE",
            "text": "Almost every drink was tasted, and my personal favorite will be Obsidian Sun, which taste like a refreshing, apricot flavored, and not-too-sweet pudding. Naked and famous is also one of my favorite classics! The lamb burger was juicy and tasted (a little bit small and looks lonely on the plate though). Don’t really like Cyborg because it tastes like the fever medicine that I grew up with:(\n\nKeion was very nice introducing me the differences between Chartreuse."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROMnRpTjhRRRAB",
            "text": "We just happened to stumble on this place while we were in the neighborhood and waiting for our reservation at a restaurant. We got there just a few minutes before they opened and there were a few people ahead of us in a small line, but we were able to get in and seated right away.\nSince we were headed to dinner we only ordered drinks but the ones we had were delicious! The vintage egg nog was easily our favorite.\nThe atmosphere is great. It’s dark and cozy and I just loved it."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNlpLSkhREAE",
            "text": "Ever since I started mixology as a hobby, advancing my bar and knowledge/reading their books I been wanting to come to this bar. I tried the Penicillin, my favorite cocktail, along Pink Matter a strawberry brandy combo with hints of spice, good stuff. Good presentation, prices between 20$-30$, the waiters were efficient and attentive, the bar itself was dark and moody to set the tone. Would definitely go again when visiting New York."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYcTRTZFRnEAE",
            "text": "Death & Company in New York City is a renowned cocktail bar known for its expertly crafted drinks and intimate atmosphere. The dimly lit space features stylish decor, creating a cozy vibe. The extensive cocktail menu showcases both classic…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2Mzl1Uzh3RRAB",
            "text": "Honestly I have never gave a review to any place ever but I guess I should make that one of my resolutions after my time at this wonderful establishment last night! I like to do my due diligence and research spots before going somewhere and this spot was recommended by many. Marvin was so amazing and it was entertaining hearing him recommend drinks to other patrons and be so knowledgeable on anything alcohol related! Both of the drinks I ordered were amazing and I would recommend this spot to both lifelong New Yorkers and tourists if you’re into cocktails."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cTgtdWN3EAE",
            "text": "Visiting Death & Co was an unforgettable experience. The atmosphere was intimate, with a perfect mix of sleek sophistication and cozy charm. The staff was incredibly knowledgeable and welcoming, guiding us through the menu with expertise.\n\nI tried a few cocktails featuring mezcal, and they were absolutely incredible. Each drink had a perfect balance of smoky depth from the mezcal, paired with unique ingredients that created rich, complex flavors. The craftsmanship in every pour was evident, and it was clear that the bartenders are true artists.\n\nIt’s not just a bar; it’s an experience. I’ll definitely be back for more of those mezcal masterpieces."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5eDh6Y2xRRRAB",
            "text": "After poring over their cocktail books, we were thoroughly looking forward to an in-person visit! Sitting at the bar is the move if you’re interested in the process and the ingredients. We really enjoyed speaking with the bartender, asking questions, and watching the drink preparation. When my husband asked for a rye recommendation for an old fashioned he talked us through options and poured the last of the bottle into a shot glass for us to try on its own, which was a special touch and made the evening that much more memorable!\n\nWe had five drinks between the two of us, trying from all the different menu sections, and enjoyed all of them. If you think to, definitely look at menu ahead of time and have some options in mind. There are a great number of options with some truly interesting and unique ingredients to consider.\n\nWe realized too late that they now do limited reservations ahead of time, so if you’re planning a visit check those out well in advance to avoid the stress of walk-ins/wait times. Luckily we showed up at opening time on a Friday night, joined a line of 20ish other hopefuls, and were able to snag the last seats at the bar without a wait.\n\nThank you Death & Co!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ak52aTdnRRAB",
            "text": "Intimate and dimly lit spot for cocktails. Pretty good drinks. The legacy Honshu Punch was especially my favorite. Ideal for groups of 1-4. Very prompt service from the bartenders too."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqaUt6aWpBRRAB",
            "text": "If there’s one cocktail bar I return to again and again and again, it’s Death & Co. This is a NYC cocktail institution of the highest order. The atmosphere is exactly what you want in a cocktail bar - dark and refined. And the bartenders…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyZ3R5RzZnRRAB",
            "text": "Not a quiet spot at all, but loud and lively! Make sure you’re ready to speak loudly with your friends. That being said the drinks were FANTASTIC and our server was phenomenal. From start to finish we were taken care of. It was a little hard to talk but it was very easy to drink. 🎉"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIaEpmMl9RRRAB",
            "text": "We were able to walk in on a Thursday evening. The place was dimly lit and a little loud, but not so much that we couldn’t keep a conversation. There’s a wide variety of drinks and they were all really good."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bUk3XzF3RRAB",
            "text": "Drinks were pricey so come with your bucks  but they are really good and the bartenders are personable. I should have seen if I could\nget the book. One of the bartenders was talking about Caroline Shaw, then he came to us talking about J. Cole, since we were there for his show at MSG. I tried the Oaxacan Old Fashioned, Naked and Famous and a Doctor Isley, and a Mai Tai."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKMmZLS2l3RRAB",
            "text": "I don't think people are exactly flocking to this place for the food, but what I've eaten has been good. Those COCKTAILS, though! That's what it's about! And the atmosphere! My husband and I took our son, who just accepted a position as an Assistant Professor and has been a HUGE fan of Death & Co for years. Perfect place to toast to his new career! We were glad we arrived early because the place is small and a line does form, so be ready for that. Make a reservation, if you can!\nService has been super both times we have visited! Oh, and I loved that they had my info in the system from our first visit, so when we arrived the second time they knew my name. Nice touch!\nWe'll be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodnNxOHhBRRAB",
            "text": "Speakeasy vibe bar, make sure to drop your name in waiting list, plan at least 45 minutes.\nDiverse menu, friendly staff and fast service.\nThere s something about the music in the background that is so addictive, it's hard rock but soft at the same time.\nHad my Manhattan drink and I enjoyed the experience.\nLittle pricey though."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlclotUFRREAE",
            "text": "Such unique cocktails. Beautiful flavors. Got there early enough that we were first on the wait list and the wait wasn't bad at all. Bartender was awesome and helped my wife find a drink that was still interesting but fit her somewhat more sweet tastes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoek9MSmxBRRAB",
            "text": "This is a unique cocktail bar that has become one of the most famous in the city. They do not take reservations so it's best to come early or expect to wait hours to get in. The cocktails are all phenomenal and they literally wrote the book on many of them. Definitely try to stop in, it's worth it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodUpuVEhREAE",
            "text": "The cocktails here were really good. Ended up here for a boys night and all of us thoroughly enjoyed our drinks. We got there 30 minutes after it opened and there was a 2 hour wait. We put our names down and about 1 hr 40 minutes later,…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnN0t1dWpnRRAB",
            "text": "The bar is iconic for a reason  Even after all of these years there is still something magickal about Death & Co . You can always count on getting a great cocktail paired with a dimly lit situation.\n\nI had a really great Negroni last time I was there.\n\nNote: Make a resy or you may have to wait to get in"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPazZfaXNRRRAB",
            "text": "The cocktails here are genuinely exceptional. The bartender was helpful and friendly, but also knew when to just leave us to it. After being unable to choose my 2nd cocktail the bartender's recommendation was excellent. The snacks are superb, although be aware they are very small. I will certainly recommend this place and return."
        }
    ],
    "reviews_count": 83
}