{
    "name": "Casa Adela",
    "place_id": "ChIJ5xneO3FZwokRyyN-P0ch-Wo",
    "grid": "MN3",
    "address": "66 Loisaida Ave, New York, NY 10009, USA",
    "rating": 4.5,
    "user_ratings_total": 2175,
    "phone_number": "(212) 473-1882",
    "reviews": [
        {
            "date": "6시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSQ1VGUlFVbTE1VkhSdGJVSXhjbEV6YzNSU1JWRRAB",
            "text": "You can zelle here!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNExYTk5USHBDWHpWUWFtd3hkM1ppTW1sWmQwRRAB",
            "text": "4.5\n\n4.5\nReally liked the food here, flavorful but not salty for me. This time, also ordered Bacalao; yuca with onions; mofongo which has pernil mixed in, and crispy chicharron on top (less pricey than the mofongo with pernil or chicken entree). Flan was so good and only $3. Chicken chicharron were crispy and tasty but were not meaty pieces. Pernil sandwich was pressed, kind of plain.\n2 hours from being outside/waiting for a table to finishing our meal. I did notice that once seated, it took a while for our order to be taken. There were only 2 people attending to the tables but staff is very nice, homey feel when eating there. Kitchen was busy- noticed a lot of pick-up orders too.\nSmall restaurant, tables near each other; with a small restroom."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMllsOWZXRVZNVEdSWVdFZDFURkZHT1hoWGEyYxAB",
            "text": "Staff needs to understand this is suppose to be a professional setting not have a screaming match while on the phone and plus choice of language, great job"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoTE0xVnZUamhGV2paNlVFWjZlSGQwVGxWeGQwRRAB",
            "text": "I expected run-of-the-mill but got remarkably good. This establishment shows real quality. Dishes look and taste incredible here. Their workers demonstrated care that guarantees I'll return. I'm making plans to come back soon."
        },
        {
            "date": "1주 전",
            "language": "nl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tobmRtbzJjWFphVjJKaVFrTmtMVmhMWVhoTVgzYxAB",
            "text": "De LES (Lower East Side) verandert door de jaren maar een plek als Casa Adela neemt je weer terug in de tijd. Als ik wat stabiel eten nodig heb, dan eet ik graag rijst en bonen- Ger rijst vind ik heerlijk. Ik kon hier kiezen tussen 3 soorten bonen en nam de roze bij de gele rijst. Geroosterde halve kip erbij, en je kunt hier zo een paar keer van eten. Geen poespas, gewoon lekker eten. Vlakbij een bushalte van de M9 overigens."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdWVreE5OVUZ1UVZObmFIbFZZM05yVTBaeVJWRRAB",
            "text": "I got the pillow guisada and I want to eat it when I am sick, when I am well, really just all the time. The Maduros and tostones are so good!! Definitely will have to come back the next time we are in the city."
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wb2FYWk9SMGxIYzNwUGVESm9aMEZRWTBaRk4xRRAB",
            "text": "Servicio, ambiente y comida excelente!\nLo recomiendo."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205bmMwYzFVekpGVEZWUWNGWjRPVkZsTWxCd2EwRRAB",
            "text": "SAVE CASA ADELE? Who will save you when you eat here? I dont write reviews and this is my first but I wanted people to stop writing reviews that makes this place sound like it is the it factor. It definitely was not maybe before but today was not that day.\nWanted to have dinner thought it was a good idea to try Puerto Rican cuisine since I'm PR what a disappointment. Restaurant needed some work. We were served small plastic cups with our water that you buy at the 99 cent store. Hmm hello whats the deal? You can visibly see that the inside of the restaurant needed some cleaning as we had a few nats flying around.\n\nHonestly didn't give me the home PR vibe like people on here keep telling you. What part of PR did you grown up in cause San Juan doesn't look like that. Also service was slow took 30 minutes just to get a Cubano. Come on if the pernil is done all you needed to do was a blancha(Toasting). So waited for a cubano that was smaller than a hero bread. I dont think my husband left full and enjoy his sandwich as so many claim. Then gave part of my food to another customer all the while the manager saw the mistake and did not fix the problem so I ate my 1/2 chicken cold and alone. Had them deducted the maduro. The pasteles con carne and alcapurrias were cold, hard and small. I would say it was a waste of a date night and I'm still hungry. Not a spot for a Saturday night.\n\nA few pointers - 1. paint the inside of the restaurant if you want to hide the dirt or the wear and tear inside the restaurant.\n2. Buy a dishwashing machine if you don't have money for a dishwasher. Get a clue no plastic 99 cent cups.\n3. Get better waiters because the older ladies unfortunately are slow and your losing money from not cleaning and serving the tables fast enough.\n4. If your going ro represent PR then do it right wear our colors proud instead of letting people see this nonsense and think it's okay cause it's not."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NNFFUbFRXbTUwTVVSUVJYWlBhM2huZFhWUFIxRRAB",
            "text": "Service slow, waitress was not attentive (yet left her a very good tip), small space only about 6 or 7 tables. Came one hour away for a Puerto Rican experience and was so disappointed.  The only thing that was ok was the food. Recommendations ? I recommend take out for the locals within a 10 block radius anyone outside of the 10 block radius it is not worth it.  I gave three stars just for being Puerto Rican cuisine, wish I can give 5 stars but the hype is not worth it. Service sucks, and to small of a place."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOT2RVTTFPR2RWTjI1UWRuazNTWGxWUlhObGJuYxAB",
            "text": "Awsome 😋"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SbFdVVTRWbkpyUTBZek5tb3lMVEpCY2tOeWQzYxAB",
            "text": "Mi familia y yo fuimos aquí después de mi examen estatal. Bienvenida por su dedicado y guapo nieto Luis. Nos sentamos a comer. Mordí un pastellio de carne. Mis ojos se hincharon como el aroma de\nDe achote, un ingrediente en nuestros platos me salió por la nariz y el sabor a crujiente con carne tierna me llevó atrás en el tiempo a la cocina de Mami Abuela. Traeré de mi lado a mis primos, el último de los boriquas de mi tribu. Nacido y criado en Nueva York. ¡Mi primera vez allí tuvo un impacto! ¡Me encanta este lugar!\nQue Dios los quide.\nPor cierto, mi esposo Mike solía ir cuando servían el desayuno. ¡Dios, envía a alguien a arreglar el plancha!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oSVZHRkRjR1ZFUzFaT2MwMVJlVmRZZEY5aWJWRRAB",
            "text": "They made me feel at home.  I loved the Restaurant"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSVdXaE5lbVpTTkhOVWNtVm5RM2xTUTBSV1IxRRAB",
            "text": "On a rainy windy day I was craving a warm dish and the sancocho hit the stop! It was absolutely delicious and didn't disappoint! I will definitely be returning for the other things on the menu. The coffee was espectacular and the flan- yummmm! So happy I found this spot- true Puerto Rican flavor/ sazon!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ORldtdFdZVXR6YkROcFdGcFZSR0Y2YWpjdE5IYxAB",
            "text": "It was like the way your grandma used to cook"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWMU9FeEtlbXR0YVZsQlIyOTJWRFJYVjJOdVRXYxAB",
            "text": "Love this place!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21scFFWTnJibkZaWjBWWE1rMUdiMEl6UW1JM05IYxAB",
            "text": "I look forward to passing through Manhattan on the way home because I know I can hop off the FDR and be at  Casa Adela's in minutes.  Just thinking about the food makes me hungry, and I can't wait for my annual visit.  Eveything is good, my game plan? Order everything 🤣\n(You can always take home leftovers).  Save room for flan and the best coffee in town."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWE5VUkVRek4zWmxGV1pUWjRSa1JWTm1adWFGRRAB",
            "text": "Great food, reasonable prices. staff needs to be more attentive"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNeFprSnpiRUZrTVZSR1dHMVlSWFpsT0c5d05YYxAB",
            "text": "Excellent food, real Puerto Rican food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KRVkyMHROME00UjBWeVMxaGtNbFI0YTJ4VmJWRRAB",
            "text": "This tiny family owned and run restaurant has limited seating but the food is worth the wait.\n\nWe had the chicken stew and chicken mofongo. Both were amazingky deliciious and food for the soul. The fried plantains were a perfect compliment to our dinner."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxWU0xZ3RTV3hEUWxkVFZUUlVlVXBTU2tSeWVrRRAB",
            "text": "4* for the LES Puerto Rican nostalgia. Pollo guidsado was good, rice and black beans bland. Overall a good experience"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNeFgwdEdlams1Y1ZoclVtdGlhazR6Y0RoR1gyYxAB",
            "text": "Delicious Puerto Rican food in a fun, casual environment. From the friendly welcome and service to the great food, I enjoyed it all.\n\nPortions were extremely generous for some dishes and went to about normal. The Puerto Rican friends I was with shared that the portions were smaller than they expected, but they still enjoyed it as well."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcjlYQzNnRRAB",
            "text": "Check my YouTube channel aboricualifeinusa for more..The food was good not great like I imagined it..The alcapurrias needed a bit more seasoning and the pastelillos filling was a bit salty..The star was the bistec encebollado. Rice and beans was ok. The place is small and you have to wait outside to be seated. The place only takes cash. This is an institution around here. Keep up the good work.Take this review not as negative but constructive criticism. I have been to many restaurants and I would hate to see them fail or go away.Puertorican food is something else. Acho PR es otra cosa."
        },
        {
            "date": "수정일: 1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMMUp6R2lnRRAB",
            "text": "Excelente comida ,amabilidad y servicio. Me encanta."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25seFJXOTNSMEpGVUhGeGN6azRXblpGWWsxWk1VRRAB",
            "text": "This spot caught my eye by chance and kept my attention. The flavors here are noteworthy. The chef knows what they're doing and the place feels like a retreat. The staff shows kindness and flexibility, and meals arrive quickly. Regardless of the crowd, I recommend this restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWVFtNXFXRzFoUzIxVlZVUkRiazR5VnkxaWJuYxAB",
            "text": "We been eating here since 1979 it always been good my wife and mother has been here since"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWS2FUWkNUVmRmY0RsMmJrNXFRMU01VEdSUVlXYxAB",
            "text": "Delicious authentic puerto rican food in a place that feels like home! The staff ready you like family and the whole place smells amazing!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkVmRHZ3RZMkZuZFU5a1JGaFNORU42YjA0eGFHYxAB",
            "text": "We walked about 20 minutes to get to this restaurant. Went there because of the reviews. We were not disappointed. Food was fresh, home made and delicious. This is not a fancy restaurant at all, but the food will not dissapoint you."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Rd1dsUmtNVFpMZEZwbk1HUTBNM2hXUWtRM1YyYxAB",
            "text": "Was in the area meeting up with my coworker, saw this REALLY small hole in the wall spot and wanted to support local boricua. The woman that helped me initially was very friendly but her shift ended I guess and a man took over. He was very rude, ignored me while I was on line to order. I sat down and needed time to think about my order while I waited for my guest to arrive but I was threatened if I didn’t order I couldn’t sit at 1 of (4) EMPTY available tables. I’m going to be honest, support if you want, I will never return based off service alone. Food is average, but service is shot. I felt so uncomfortable after the interaction I just took my food to go and was told they don’t bag your Togo orders for you. So I had to do it myself…I see why this place needs saving, if staff views work as play time"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGdldETmpSRWRtWmkwdGFEQnJSa015Y1dWSGJsRRAB",
            "text": "Small restaurant worth the wait."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SRGIwOXBabWcxWldka1ZUa3pPRXh0YWxWcU9FRRAB",
            "text": "Not trying to be bias because my god family is Puerto Rican but the food was just like my ma's cooking. This place was close to my hotel. I found it from a YouTube video I watched by EduardoToro_PR.\n\nFood: I had the chicken stew and chicken soup...they both was absolutely amazing. Chicken was beautifully seasoned and tender. The both was out of this world. The tostones were amazing as well. The rice and beans were awesome. I tried mofongo for the first time...sorry but im not a fan. The prices for everything were actually really nice for this economy. But I still give the food 10/10.\n\nService: they guys in the restaurant were super cool. Service was quick even with all the food that I ordered. They were hustling. Much respect to them. 10/10\n\nAtmosphere: when I say it felt like a mom and pop shop place....I even felt like I was at home. From the guys working, to the people eating and even outside the restaurant, everyone was just vibing and chill. I was even watching a soccer game which was awesome.\n\nI recommend this place to everyone. They also accept cash too which I like because I used cash my whole trip. My photo didn't include everything."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMGNqTnpNekp6Y0dKUlJHSk1hekZPYVVWa05IYxAB",
            "text": "Great cozy spot . Authentic mofongo and pernil and the empanadas were amazing. Hole in the wall spot with great service. Cash only establishment. Would definitely return!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1NVptNVRREAE",
            "text": "2nd time, and it was great or greater than the 1st. I am going to become a revolving member.  Loved it 😋"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTlRsWm9PRGRzVTFsT1RFeG9hRXRsUm05MU4zYxAB",
            "text": "Casa Adela balances quality and value better than most restaurants. Their ingredients are top-notch, flavorful and freshly prepared. This restaurant created moments of pure culinary alchemy! Rightly, the staff shows unwavering niceness. I'll return for more."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvMGQxSmxVbEJFYmpSV2IyOUhSSGw1TVdSRFkwRRAB",
            "text": "Being a New Yorker, and Puerto Rican, i have to say, this place is 100% legit. I remember growing up, having my grandmothers cooking, it literally taste the same. You have that same old school Puerto Rican love in that food. This is a most go again type of place. Thanks again Luis!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xTmRraFlOMnBUZFhka2EzVTJlVGROY0dSTVMyYxAB",
            "text": "Their chicharron de pollo is some of the best fried chicken I’ve ever had in my life."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxaFFqSktUV2xMV2pOYVltVkJTREl0Y1cxNVdtYxAB",
            "text": "El lugar es pequeño pero la comida grande en sabor estaba super deliciosa,100% recomendado,lo visité hoy y valió la pena el viaje desde Manhattan."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVlJtRkhUWFYyWlY4NGVHeDFSVEI2Y1RKS1QwRRAB",
            "text": "Great food and service. I accidentally left my bag in the store and they ran outside to give it back to me, very much appreciated."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBcXBuSjR3RRAB",
            "text": "Excellent food, feels like home, and made with Love. I can't tell you this is my favorite Puerto Rican restaurant! The rotisserie chicken is made to perfection 😋\nI have now been coming her for years! It's become one of my favorite Spanish food restaurants 😋 But I just had the Alcapurrias and this was not good made this way. This looks like a Colombian croquetas, not  Puerto Rican. Please don't mess with the recipe of anything.  It was perfect as it was. Also it was over cooked, and dry."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTGFtaENSMk0zUXpCYWFuUjJkV0ZaYUVFd09XYxAB",
            "text": "I think this is one of the best spots for latin cuisine in NYC. The Puerto Rican food here is off the hook!! The best rotisserie chicken in NYC in my opinion. Soft and moist bursting with flavor.  I also like the chicharon de pollo, pernil, and mofongo."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SQk5GTkhZMlpzUzFCVVkyWlpabUZPUkd4T1dWRRAB",
            "text": "Good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wc2RsTlRhblpWUjFKV2FuZElVSGhZWmtOcWMxRRAB",
            "text": "The food and the service is outstanding. No wonder they’ve been here over 50 years. The atmosphere cultivated by the staff/family is warm and convivial. Not to mention the prices are exceedingly reasonable for the quality of food. The food is made to order I just don’t have enough words for how good the entire experience was."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kc2FFWnVTRXRJY2pOdVRGRnNjMWRYUW14YVluYxAB",
            "text": "YUM!\nThis really felt like family dining. No extra frills or pretense. We came in as a group of 5 and as soon as we sat the guy serving us made sure to ask us if we were planning to order the chicken so we could put some aside while we studied the menu.\n\nWe throughly enjoyed our time and went home full."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxdTd6SndRRRAB",
            "text": "I used to love this place.\n\nThey open at 11am. I called 3 times first to make sure they were open. No one picked up. We went anyway.\n\nWe got there at 11:45am. The restaurant was empty and we’re greeted by a woman who hits us with: “You are too early.” 😐\n\nShe goes on to say that yes, they’re open… but not with the full menu. That we should zcome back at 1pm.\nA 1 hour and 15-minute wait?? Excuse me??\n\nAs we’re leaving, we mentioned that we called three times before coming.\nShe snaps back with:\n“We disconnect the phone on Saturdays because people only call for delivery and we don’t do delivery.”\n\n🫤 We literally just proved that not everyone is calling for delivery. But fine.\n\nNot a single apology. No accountability.\n\nOpening a restaurant without being ready for customers = loss of business = loss of a customer"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SFJrbHNhR1JPYXpOUVRHaHJRMkZ3Y25SYVJsRRAB",
            "text": "Waited over 30 minutes. Ok, fine. Got a table inside. Waited another 20 minutes for anyone to come to us. Mind you, its 8 tables maximum and almost all had already gotten their food.\n\nFinally, get to place an order. No water. No bread, nothing. Placed the order. She comes back 10 minutes later, sorry, we dont have pernil. Bro... waste of my time. By then, i said, screw this place. Im out.\n\nToo much time wasted. Too hot inside. Sad. Cause the food looked good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMmJHcFljall6ZFZvNVdWbzVkMFk0VkZkTWJrRRAB",
            "text": "I WANT TO SAY, ONE BIG, THANK TO THE OWNERS OF CASA ADELA🙏🏾♥️🇵🇷🇵🇷 FOR YOUR DELICIOUS FOOD, THANK YOU FOR BRINGING PUERTO RICO TO NEW YORK CITY FOR YOUR LOVE. YOU'RE A BIG HEART, AMAZING CUSTOMER SERVICE. VERY WELCOMING. I AM GOING TO BE A CUSTOMER FOR LIFE THANK YOU FOR YOUR AMAZING HOSPITALITY. HE MADE ME FEEL LIKE I WAS BACK HOME IN PUERTO RICO. THAT FOOD MADE MY STOMACH FEEL SO HAPPY. THE FOOD WAS MADE WITH LOVE🇵🇷🇵🇷🇵🇷❤️🙏🏾"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pselRqZEthR2xHYkRjelEwNHpiVkJuZFhOU2VuYxAB",
            "text": "IM SO PROUD TO BE PUERTO RICAN ISLA DE ENCANTO BEST PUERTO RICAN FOOD TASTE JUST LIKE THE FOOD BACK ON THE ISLAND SHOUT OUT TO THE OWNERS SUPER WELCOMING FRIENDLY I LOVE IT PLEASE COME SHOW LOVE TO CASA ADELA 10 STARS GRACIAS POR TU HOSPITALIDAD🙏🏾🇵🇷♥️QUE VIVES PUERTO RICO🇵🇷🇵🇷 TEAM CASA ADELA"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOblIwcFhOSGRqY1hjd1NEQnJNMk5CWWtkVVYwRRAB",
            "text": "I wish I can cursed!!! in this platform but I’m gonna keep it classy… the food was amazing,the flavor was on point everything look and was delicious portions are perfect, food was warm and tasty it definitely reminded me of Puerto Rico.place was busy but wait time was short server was on point in top of everything. Is definitely worth the trip. Definitely be back again"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tndGVFazNVRlJJUWs5aWNYRnVkelJ3Ymxwek1uYxAB",
            "text": "Lady's and Gentlemen this restaurant in  my expirience ,is no were near what I have reed in the reviews sorry!.\n1- There's no air-conditioned it was 85 degrees outside and when I walked in this restaurant it was unbelievable Hot like 95 degrees.\n2- Flies flying around literally.\nWith this expirience I definitely will never go back and will be sharing my expirience.Because what I see on Instagram and other places that this restaurant advertisement is very misleading💯.I was in shock to walk in and expirience all this.People you can not run a restaurant with out AC ON A 92 DEGREES Weather.Bad Business practices.AND THE FOOD IS NOT CONSISTENT,ITS A HIT OR MISS!.\nTHIS IS MY HONEST AND SINCERE EXPIRIENCE.GOOD LUCK AND GET IT RIGHT PEOPLE."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SFFWRlpWMU5TVVZwa1FqQjNPR0ZFY0U1WVkzYxAB",
            "text": "Only reason I gave a 3 is because place was small other than that food was amazing and fresh and the people were so nice helped me with my titi who is 83 I would definitely come back here 👍🏾👍🏾"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201VE4xWmhjRWxxTUdZdFN6SkRaVzg0WnpKWWNFRRAB",
            "text": "Casa Adela....ay ay ay\nQue hònor de Orgullòsidad me dio ay.\nComo yo puedo empesar\nSe me sueltan las lagrimas en pensando que\nLuchadora era esa señora boriqua acho.\nAdela si se la busco con mucho sacrificio La mano de óbra de Adela se síente en el ménu completamente. Yo me qúede con las ganas de ese viento boriqua.\nUn de amor de casa.\nQue me senti lo mas chèvere.\nCuando escojí me asiento me fijè de uno quadro en la pared de ADELA.\nMi gente senti là Fè de Madre,\nAbuela Querida\nY una esposa batalladora.\nI love you ADELA.\nI never met you. But through your stories and the reflection of the community i can perceive the type of \"Luchadora\" Hard Worker you were pushing what you felt inside to see it in full fruition.\nDoña Adela Echo Pa Lante.\nThank you for your vision.\nYour vision brought inspiration to the lower east side.\nYou brought Boriqua Empowerment that has stretch from your generation to the next all the way passing through my generation and on to the next.\nFrom the very beginning i was excited to be in one of the pillars of NYC puertorican history.\nI quickly felt like i was definitely in my tribe element\nShout out to the Family..\nEL Barrio loves you.🇵🇷💯\nYa really put love in that food..\nI will be back .....\nTake care Casa Adela....\nThank you for inspiring me totally.\nAtaja🇵🇷"
        },
        {
            "date": "11달 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNmRXQmh3RRAB",
            "text": "Everything good 근데나능페루비안칰흰이더마쉬따\nThe beans here is insane must try"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCb1ZGOUxaa3g2ZWtVdFMxbHVOMU5FZUZSVU9XYxAB",
            "text": "Great puerto rican food. Highly recommend the fried chicken, we had it as side order and it was still in big portion. Roast chicken was also good. Each food can be in sharing size. Yellow rice was nothing special, but the pink beans add more flavor. Place is packed with guests. Cash only, but still taxed."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kd1oyNHhRVVYxZFZOZlVHWktPVzUxYzJSZlZHYxAB",
            "text": "I went here 6/21 to eat lunch and i got the Roast pork with rice and beans the lady serving us was nice… it’s a small family owned restaurant… the food took about 20 minutes and it was good… after we finished we were waiting for our check then there was almost a fight outside the store with a lady and one of the workers!… but other than that the food was very good and I would recommend anyone to come and eat here!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdFdYaGhja1Y1WjNwc01IWkxZVlV3UW5VNVkyYxAB",
            "text": "Small place but amazing authentic puertorriquen cuisine!! Everything was delicious and the house \"pique\" was awesome!!! Needs to be bottled!! Looking for 🇵🇷 cuisine like abuelita?? Here's the spot"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOdmN6TkZUemN0ZGtkQ1V6QmlVbTgzVFdkd2NtYxAB",
            "text": "If you're looking for authentic Puerto Rican food , this is the place you want to be at . Over 50 year's in the community,  little spot with a big punch . Only 4 tables , so sometimes there might be a wait but we'll worth it..."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KeVIxQmhXbkowV1RVeFNITlVXVlJUTkVvMVkxRRAB",
            "text": "This place feels like being back in Puerto Rico. The food has rich depth flavors and arrives at your table in less than 10 minutes. The service is good and they were playing bad bunny. Need I say more"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUE1ISnFVV016WmpGWVdVMDFTblIyY0cxNE1sRRAB",
            "text": "Im born and growing in Puerto Rico, im moving to Boston a couple years and let me tell u something this is the best puerto rican restaurant i never trying here in USA the food taste like home, prices very good, the staff are humble and friendly people and definitely going back with my family"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYeklHZEdBEAE",
            "text": "First came to this place for brunch/lunch and it was so good! The food is delish - we shared tostones, maduros, and yuca for the table as well as the fried chicken cracklings and it was all excellent though I will say super filling so plan accordingly. I also got the chicken sandwich which was SO good and perfectly breaded and seasoned. Just a note that fried orders will take a little longer so make sure you get them in first. Also certain things, like the pernil, aren't available until later in the afternoon (maybe past 1pm) because of the cook time required. Also note that this place is cash only! All in all, a super affordable and filling meal with great service and the best hole-in-the-wall atmosphere you could want."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJa2JITXd3RRAB",
            "text": "Omg you gotta try this place out if you love Puerto Rican food, it's delicious and comforting the shrimp monfongo was covered in this garlic sauce I nearly ate the plate. Definitely a must try and I'm definitely returning for more."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNEp6WFFnEAE",
            "text": "Local Puerto Rican cash only spot. Simple diner vibes. Very delish. Can’t go wrong!\n\nWould recommend 1 main plate to share and then a side. The avocado salad was really nice to balance all the hearty flavours.\n\nThe chicken was well seasoned and super yummy!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kc2RUVXhSa0pJUjBwT2MzQkZWbll3YlhsNVQwRRAB",
            "text": "Casa Adela\nEst. 1976\n\nLayout/atmosphere\n*Puerto Rican restaurant; six tables; TV; cash only\n\nFood/drink\n*Mofongo (deep fried greed plantains mashed with garlic, roast pork & crackling) - Good; not too salty, crispy skin"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbk91Y25RRRAB",
            "text": "The food was amazing!! Being Puerto Rican and living in another state with no authentic food around me, this hit home. The seasonings were spot on!\nThis is a cash only establishment!! A shout out to the owners son for his assistance !\n\nI highly recommend this restaurant!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWQ01teFhTalJwZFdkU1QxWlNaVVp4ZHpGbllXYxAB",
            "text": "We came here at 6/21/25 we got seated fast and it only took 15 to 20 mins for the food to come and the food was very good I got a mofongo and there was almost a fight but overall I would recommend this place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMllmZGdBRRAB",
            "text": "This Puerto Rican restaurant is a true gem, offering an authentic taste of the island's flavors right in your neighborhood. With only six tables, this small restaurant can get pretty crowded. While there's no printed menu at the restaurant, you can easily find their offerings on Google. The roasted pork and octopus salad are standout dishes, prepared with precision and bursting with flavor. With over 44 years of experience, it's clear they've perfected their menu. The restaurant radiates a charmingly nostalgic vibe, reminiscent of 1980s Puerto Rico, complete with handwritten receipts and waiters calling out orders. The attentive staff is more than happy to guide you through the menu and ensure a memorable dining experience. Just remember to bring cash, as it's the only form of payment accepted here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMX1BiNDN3RRAB",
            "text": "We came on a Sunday around 2pm. The restaurant was packed with people from all cultures and everyone seated seemed to be enjoying their meals. I was so excited to eat here that  I couldn’t even decide what to order. We ordered to go. We ordered the rotisserie chicken, pernil, arroz con gandules and potato salad. Everything was delicious, perfectly seasoned and fresh. Must try location. Authentic Puerto Rican food with old school New York vibes in the cafe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOVptNTl3RRAB",
            "text": "Food and service were awesome.  Mofongo was garlicky and had delicious pieces of pork mixed in. The pernil was flavorful and the alcapurrias brought me back to my childhood. The employees standing in the background talking loud, cursing and acting hood  took away from the charm of this spot with the pictures on the wall that play homage to old Puerto Rico and Adela."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsd0x2RkxREAE",
            "text": "Right off the jump you can tell this is the definition of a local place with people constantly coming in and out to grab to go orders. It’s a very small CASH ONLY restaurant with only about 5 tables so expect a wait. As a party of 2 on a Monday we waited about 20 minutes, but we’re encouraged to look at the menu and put our order in so the food could come out soon after we sat down (took about 10 min). We ordered 2 half chickens which came with beans and rice, a side of roast pork, octopus salad, and a chicken noodle soup. The chicken was solid and flavorful, I chose the yellow rice while my friend chose the yellow rice with peas (I recommend the ladder if you like beans). My friend and I both chose the black beans, let me tell you as a non bean eater these kind of wowed me in a simplistic manner as they had a subtle yet complex flavor to them. For me just a side of the roast pork was perfect as it was very good just rich. My friend got the chicken noodle soup which was very good. We were both shocked at how big the portion was with not just broth actual chunks of chicken and vegetables. The octopus salad was the only thing I would not get again while good I just did not think that it was worth $19 dollars. Overall this is one of the best most satisfying meals I’ve had in a while. Also, with a total of $60 it does not hurt that the price to food ratio is outstanding even keeping up with places outside the city. If your anywhere near the area you need to go here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4OVlyMGxBRRAB",
            "text": "It was our first time to Casa Adela and i can say we were very impressed by the food! We were 2people and had a whole rotisserie chicken which was cooked fantastically (very nicely favored but not too much!). We also had mofongo which was delicious as well.\n\nIt's a small restaurant with only a few tables and it gets very crowded so you might have to wait quite a while to get a table (no reservations). The staff is very busy because they do lots of pick-up so the food tends to be slow.\nFood prices are very affordable but remember to bring cash!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEcFliZ0hBEAE",
            "text": "I only ordered what my grandmother would make so that I could compare and have that home-cooking comfort! Nothing is ever as good as grandma’s cooking, but needless to say this is close #2!!! Arroz con gandules, mofongo with pernil, and alcapurria was my favorite but you cannot go wrong with anything. A small, cash only place that has a true homey neighborhood feel. Just waiting to go back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaMjhtWkZREAE",
            "text": "The food was very good. We had pork chops, yellow rice, plantains, and beans. We ate everything and left nothing In our containers at the end of the night.\n\nWe took the train over from Manhattan to the area just for this restaurant. It had been recommended to us by a Brooklyn Native.\n\nLocated next-door to a liquor store on one side and a home on the other. Nice and quiet area and not too many people out.Because Of the decorations, the place is easy to find and is highly visible from the outside.\n\nWhen we walked up, there was a man outside tidying up . He greeted us and let us know that we were in the right place for a good meal. He asked us what we wanted, told us history about place and then led us inside so that we can see the menu.\n\nWhen we got up to the counter, we were greeted by the cashier who was very  were very patient as we tried to figure out exactly what we wanted. Everyone we talked to was extremely friendly and didn’t mind giving recommendations according to what we said we wanted to eat.\n\nWhile we were there, the inside was packed with what looked to be families  from the area . All of the tables were full. There was not any outside seating. Many people were coming in getting take out orders. Looked to be a very popular spot for the local community.\n\nWe wanted to wait and take our time eating but took our food to go instead.\n\nKid friendly.\nNot dog friendly as there was no outside seating.\n\nNot good for groups. Great for eating alone."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzODYtUnJ3RRAB",
            "text": "So far it’s the only place in NYC that I approve to eat authentic Puerto Rican food. And I’m Puerto Rican. They’re chuleta kan kan was the highlight. Definitely coming back and having some alcapurrias!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtX3VLM1VnEAE",
            "text": "Great place, you won't be disappointed! It's a little wait but once you are in, all your worries go away... it's like going back home, the place where you grew up. The atmosphere is filled with those familiar aromas and you want to stay forever.  It was cold in New York but at Casa Adela, UT was warm, cozy and a celebration. You feel like part of the family. You can pick your food with your eyes closed, all their menu is just excellent! Fair priced. Very good experience,  next time in New ayork, we will stop there."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHbTlTRnpRRRAB",
            "text": "Casa Adela is a small, charming family owned Puerto Rican restaurant nestled in the East Village. The food and service will both warm your soul whether you love Puerto Rican food or new to it. We had (pictured) the Cuban sandwich, it was…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwbVV6RlphV1JOTlROTVNrMVBOa2gwY0cxM0xYYxAB",
            "text": "The people and the food brought a tear to my eye. It was perfect"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbjlpLU9REAE",
            "text": "First of all I’m from Ponce, Puerto Rico and we came to casa Adela restaurant thinking that there was going to be good food, well NOOOO, about the shrimp mofongo the sauce was good but the mofongo was dry. My husband had steak with white rice and beans and it looked like they ran the steak through boiling water, it was pale and bland, he said the beans were good. The rice portion was like a portion for a 8 year old child. The place is ok, not so organized. The server wasn’t so cheerful. I learned my lesson not to believe every reviews. I also wanted to buy pasteles but I couldn’t because they didn’t have any, they only had frozen pasteles to be sold, I mean how I’m going to buy something that I can’t taste before purchasing it smh. The only thing that we saw that looked good was the chicken which lots of people was eating chicken lol. Would we go back, I DON’T THINK SO!!!! NO WE WON’T BE GOING BACK!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBb0pIdjBBRRAB",
            "text": "Amazing food and incredibly friendly / hospitable team. The chicken stew served with yellow rice and peas has become one of my go-to New York winter meals."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtaHMzd0N3EAE",
            "text": "I am a Puerto Rican that is married with a lovely Russian man and who is finally moving in to NYC after years coming to the city for, sometimes long or short visits, and I have to say this: I am so grateful and satisfied of having found this gem of spot. Is just marvelous, so authentic and cozy. The food was just a huge hug to my soul ❤ and I can't wait to come back. I am definitely a forever customer from now and on. My husband favorite dish of the one we tried was the Cuban sandwich, he said was even better than his favorite Cuban sandwich he had ate in Miami. I can't recommend this place enough!!! Again thanks for the delicious food and great attention and service. See you soon!!! 😎"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyaDlUdTh3RRAB",
            "text": "My first visit. Tasted the roasted pork shoulder with plantain which is rather unique to Puerto Rican and fried chicken with yellow rice which are the same as served in other restaurants.\n\nBut the West Indian sauce is really nice and adds to the taste of fried chicken.\n\nThis is a small eatery with limited seating capacity. It has nevertheless a wonderful character."
        }
    ],
    "reviews_count": 78
}