{
    "name": "Pig & Butter",
    "place_id": "ChIJQTLkJRdZwokRHqE4jIcLljU",
    "grid": "MN3",
    "address": "42 Avenue B, New York, NY 10009, USA",
    "rating": 4.2,
    "user_ratings_total": 273,
    "phone_number": "(929) 919-4494",
    "reviews": [
        {
            "date": "수정일: 6일 전",
            "language": "ru",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taQ2MwcFhUalZHYjNCd2IzZE5SMmt3YUhwUVZYYxAB",
            "text": "Приехали за 20 мин до открытия, чтоб занять очередь. 1 друг опоздал и нас не посадили за стол. Сказали ждать всех. В итоге другие люди зашли и заняли все места. Нас так и не посадили. Мы ушли. В кафе нет интернета, что тоже нас расстроило\n\nСвободных столиков больше не было. Нам предложили сесть за бар. Но мы хотели именно стол"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aclRpMHhURjlvVm5abFprVmxkV2hXYmpCVlNVRRAB",
            "text": "Our experience at Pig & Butter for my best friend’s 40th was nothing short of incredible! From the moment we walked in, Bartender Mike made us feel right at home the moment we walked in—warm, welcoming, and mixing drinks with true artistry. #PurpleRain He didn’t just make drinks—he served vibes, shaking up what felt like love & laughter with every pour. Our server River was an absolute rockstar, handling our party with top-notch service. A true hospitality hero! He juggled through our vibrant crew of 18 with the grace of a brunch ballet, never missing a beat and somehow keeping the drinks flowing, the plates full, and the smiles constant. A special shoutout to the genius behind those PB&J pancakes topped with bacon—sweet, salty perfection. Overall the cozy, quaint atmosphere was the cherry on top—a perfect space filled with great people surrounded by great energy."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNeFdqRk1SbmxMYkRkNFlrWndWR2xtWkhOemFYYxAB",
            "text": "Great food and friendly staff. The crepe pancakes were some of the best. On the downside I feel the service staff could use some help in terms of clearing tables and collecting orders in a decent amount of time."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSQ1dFWnhlRE16VVRsUlNFTlhPV3Q1WVZWQmVsRRAB",
            "text": "I was searching for a brunch spot while on the verge of being hangry and found Pig & Butter, it did not disappoint! the menu was unique and the “not your usual chicken and waffles” was so good, I left no crumbs. Definitely coming back ✨"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oQ1VHWXlXVzFyTnpCTE5EQnpWVFZ5Y1ZoNlpFRRAB",
            "text": "No service"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWaE5YTnpRbXhrTjE5Vk9XcEZZWGt6Um1GS2FtYxAB",
            "text": "I really wanted to like Pigs and Butter, but this was one of the most disappointing dining experiences I’ve had. While our waiter was respectful and clearly just following instructions, the customer service overall was terrible — mainly due to the owner’s strict and unwelcoming policies.\n\nThere are no substitutions allowed on the menu, even for reasonable requests. The food itself was not tasty, arrived semi-cold, and portions were questionable — for example, $12 for 1.5 deviled eggs. Brunch items were served on saucers instead of plates, and to make things worse, syrup was pre-poured for you — any extra syrup costs $2.\n\nTo top it off, there’s even a $3 per person “cake cutting” fee, which just adds insult to injury.\n\nOverall, this was a horrible experience. The atmosphere and service policies make it hard to enjoy anything, regardless of how polite the staff may be. Definitely not worth the price or the frustration."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVFQzWm9Sek14UVdZdFdFZHFkMUJIVGtGVlJYYxAB",
            "text": "Absolutely loved Pig & Butter! I don’t eat pork, so when my brother’s friend suggested it fr brunch (the best meal option ever), I was unsure. So many options that are pork free! We had deviled eggs- so delicious! They were seasoned and the fresh dill was perfect. I had the Korean Short Ribs of Beef & grit. This was my most favorite meal of the entire 12 days I was in NYC. The pickled onions, the two different sauces- gochujang and chipotle, the runny egg….. and I’m country- my grits are savory and cheesy and that is exactly what they served! I can’t wait to go back to visit just to go here again! My brother had the French toast, he said it was good and enjoyed the berries."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJdFkwVnlRbVpOTWxoUlVFbEdYMnAyVGxsaE5tYxAB",
            "text": "I wouldn’t recommend. The food was salty extremely so to the point of making you nauseous and ofc you wouldn’t know until you tried which we did and it was cold we were told since it was served you have to pay even if you didn’t eat it…. The tostadas was stale refried, the chicken was dry and hard even to chew, the drinks were average there was one worker at the bar and the server it’s horrible don’t recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVFZYcE1VMU5rZUdSalVXTnBjbkJVVTNSemJXYxAB",
            "text": "There are so many good spots nearby, but we were excited to try a new one this weekend. Unfortunately, it was disappointing. Sadly the food did not meet the same standard of the ambience and hospitality.\n\nMy friend a I were in for the brunch. His fried chicken was soggy and overcooked, and the smoked salmon “omelette” was meager and cooked like a frittata (classic way to hide the limited measurements of ingredients). It was about a half a centimeter thin with overpowering pickled red onions and dill scattered on top as if to try to fill the empty space. It tasted as if the pickled onions hadn’t been strained— the whole thing was overpowered with pools of vinegar.\n\nThe staff was friendly and attentive at first, but it wasn’t clear who was really taking care of us, and no one asked how the food was or mentioned that my friend ate all the way around the chicken on his plate (half of a chicken and waffles) even when they cleared our table. This led me to believe that FOH is aware of the food quality issues and feels helpless to counteract them. After all— food quality is not their job.\n\nSure, the ambience and service was good, but food is the weightier variable when considering a rating. Overall I would not feel comfortable giving Pig & Butter a three."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21seVgzWXdkek0wWlhwalp6aGtWbkpqU25Vd2EwRRAB",
            "text": "Great food, better vybes."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aVVRFZHdkbWwyUm13M2VsOVdkR1ZPTFVOTGVGRRAB",
            "text": "The experience showed me what the fuss is about. This restaurant offers good vibes, helpful service and flavorful food. Truly, the staff demonstrates consistent kindness. Their meals left me wanting better quality. The restaurant impressed me unexpectedly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vMFVtSlRkREJCV0hSUmRVRnpUa1EyY21wNlkwRRAB",
            "text": "Small,  pretty little place. The staff was pleasant and polite. Food was not the usual boring breakfast/brunch. It was quite delicious 😋 . My husband and I shared \"The sweet Delores\"  and the \"PB &J Waffle\". Bothe were delicious but the sweet delores stole the show. We had ours with mango mimosas."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4UFdqTXpOR2RRYUhGalFscDVlR3hHZG5GUFFVRRAB",
            "text": "Good food, excellent service.  (Heard it was black owned?) Would recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKVmRFNURhQzFEZHpSMk5qVnNWVE5ET1RGb1dIYxAB",
            "text": "LITERALLY GO HERE GO SPEND YOUR MONEY HERE!!! First off “The Conductor” WOW PHENOMENAL!! My taste buds loved everything about it. Second, the chicken was so tender and juicy and the cornbread “buns” was like Heaven in my mouth literally. That kitchen did their big one with that one!!! The service was amazing, River was insanely sweet and making sure I was taken care of and even chatted with me a bit and I appreciated that so much!!! When I come back I’m definitely going back here!! This place is a 100/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNVYweEROVVIxT0VKMVExWmxZMlE0TVVGYVRuYxAB",
            "text": "I definitely did NOT see J-Cole here\n\n(this place rocks)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTVdUTTVlRXhFZFdaV01qaEdkSGszWTJaaGJXYxAB",
            "text": "Amazing place! Lowkey Owned by two hot sistahzzzzz 💃🏽💃🏽🎶🍑🇺🇸🇰🇷"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxblVIZG5UekprWDIxRVEwUlVWbUUyYkRWdWVXYxAB",
            "text": "Food wasb good not great.. interesting tasty items and drinks"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwRmFGTmxRak5WUzNkck9GOVpWRXhPWTBOMFVHYxAB",
            "text": "4/5 stars\nThis place is unique for sure but definitely a good place to eat! The service was very friendly and the food was excellent! The not your usual fried chicken and waffles was so good! Cooked perfectly! The short ribs was a dream! The Mexican scramble was really good too!\n\nHonestly if you’re in the area this place is worth going to so please check it out and enjoy!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kaVVtcG5aazVZYkd0NGVrTm1jVzFHUVRBemNIYxAB",
            "text": "We drove an hour and 20 minutes to try this restaurant and were pleased with the warm greeting upon arrival. We seated ourselves and had a wait of about 15 minutes before our server took our drink orders. The deviled eggs were decent, with a nice touch of dill and caper –\nThe Asian-inspired orange chicken and waffles were an interesting combination. While the waffle was tasty, it was a bit too thin and could have benefited from more syrup. The chicken had good seasoning, with a noticeable flavor of sazón, but the breading didn't adhere well.\n\nHowever, the Spanish tuna toast was a standout – I absolutely loved it! On the downside, the music was to loud, making conversation difficult. Despite this, I'd definitely return for the tuna toast.\""
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGdVptcFhSSFZYV1RCTU0yRXdla04yU1ZGWWNYYxAB",
            "text": "Did I need brunch at 2:30pm on a Monday? Yes I did, and it was delicious."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLRFl5UFQ2ODlXR0J3EAE",
            "text": "I love pig and butter. bloody mary is amazing!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKSFB4NU9MNGFXc2RREAE",
            "text": "Had the chicken and waffles - so good! And different from other typical brunch options. We also had the French toast. Would highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOR0Q1NzZ1bVpqbHdRRRAB",
            "text": "I must say it is five star across-the-board the owner was a delight. Our waiter was very patient and attentive. The food and the flavors were unique!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJV0Q0dkNkeTZ2b1BREAE",
            "text": "Really liked the brunch staff and food here at the bar on the weekend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMT0ZoNXlvdUpqcU5REAE",
            "text": "Pancakes are otherworldly !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMN3o2UHJyemZLRUJ3EAE",
            "text": "From the minute I walked in I was met with such a sense of quaint charm! There was a DJ there that night, and the music met the ambiance perfectly. The hits kept coming, and I felt like I was in a friends living room vibing out. The drinks are both complex and simple, but delicious. You may wait a few ticks for it, but it’s definitely worth it. Lastly the food… each dish was different, yet all were amazing! The flavors, the textures, everything seemed to complement the other. Most notably the jerk chicken sandwich. All in all it’s a 10 out of 10, and I fully recommend it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPN0swUGZadmZMU3BBRRAB",
            "text": "Great service , little nook tucked away in the LES. Despite not having reservations my 1yr old and husband stepped in on a random Monday and enjoyed ourselves. We had the French toast and the conductor. Do we the syrup was placed on the side so you can control your portion I would’ve preferred that personally . The chicken could improve and rid the red coloring and soften the breaded pancake our was a bit stale but everything overall was satisfactory. Can’t beat the tasty classic mimosas as well ! Fair price point , dope space and music creating a chill space for brunch or whichever you prefer . I would give a 5 if this space was bigger it’s a shame that it count be but it’s perfect for the neighborhood!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaGY2NnVBRRAB",
            "text": "The food here is incredible. Whenever I order it for my office people always give compliments to the amazing food. Very flavorful, fresh, and delicious. Whenever I get the chance to cater for an event, this restaurant is my go to!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJanNEZnBRRRAB",
            "text": "Definitely worth it!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZM1BfdERREAE",
            "text": "Amazing place for spent time with family or a couple"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbmVyTWdRRRAB",
            "text": "Everything was great, but the hotcakes were way too sweet. The only reason I went to the restaurant was because of InKind, and when I was about to pay, they told me they only accept InKind payment if you request the receipt."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTURvemF0TxAB",
            "text": "Amazing drinks and food! Such a unique and innovative menu that puts a spin on classic favorites. Also Happy Hour is a steal!!\n\nWe live around the corner and this is one of our favorite neighborhood gems."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOWJ5MDJnRRAB",
            "text": "Love the brunch one of my favorite places if not my favorite to get brunch in the city"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvd3FPaVFnEAE",
            "text": "If you are a foodie and enjoy a good time in a sweet cozy and lively atmosphere than\nPig & Butter Is The Place To Be. The Food Is Delicious and The Owners Are 2 Amazing Black Women. Their Hospitality is A+ Also If You Are Into Music R&B Mondays With A Live DJ Your Sure To Have A Great Time.."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOXBTeDVRRRAB",
            "text": "I really enjoyed the food and the atmosphere. The service was very good as well. The place is small, but after being seated, it made no difference.  Thumbs up for sure"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaXBMaEFnEAE",
            "text": "I absolutely love the food and drinks here. Everyone that has served me gave great service and was very pleasant. my favorite dishes are the chorizo scramble and the Hylton burger. This is my go-to spot in the City!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcjczUnZBRRAB",
            "text": "We’d been waiting to try this spot out and finally got the opportunity when we randomly were in the LES. We were able to snag the last two seats at the bar and were seated soon after the space was cleared. It seemed like the wait for a table was anywhere between 20-30 minutes.\nThe restaurant is small and basically run by one waitress which seemed totally doable as the bartender held down the bar that seats about 8 people. The food was good and the fries were even better. My partner’s cocktail was delicious; I think it had mezcal in it (I don’t remember the name. Sorry!)\nThe highlight for me def were those fries and my iced Vietnamese coffee! Both were delicious and so satisfying. My partner’s burger didn’t come with fries and I low key hate when restaurants do that. ALWAYS ADD THE FRIES\nWe were in and out in less than an hour and definitely would return or recommend.\nGo here!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJN2FxM05nEAE",
            "text": "The server was nice. However, it took him too long to bring our drinks. We had to remind him a few times. The food was not great but edible."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3eExXZllnEAE",
            "text": "I discovered this restaurant on Instagram and decided to check it out while exploring New York. The vibe was super chill, and our server—who was also the bartender—was friendly and had some great menu recommendations. I went with the pancakes topped with coquito cream and honey, while my partner had the chicken on cornbread pancakes. Both dishes were delicious, and the drinks were just as good. Safe to say, we’ll be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NS1EdVFREAE",
            "text": "This place is LIT! Drinks and Food were Super Fire!\nAmazing ambiance and great customer service!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3bzZYZm5RRRAB",
            "text": "After a lovely day out with my girlies to the spa the only thing we could think of this spot. When I say this place is pure excellence 🙌🏿 it truly is. This place truly embodies what it is to have an great experience. The food is everything, the place is a whole vibe, and the staff is truly amazing. You hear people talk about staff going above and beyond but they do more than that. The bartender and server were attentive and had the right mix of thoughtfulness to let you know that you were more than just a table. Never felt so cared for in such a setting!🥰 A plus we got to meet the owner (shows you what Black Royalty 👑💪🏿)The food and service we had made us feel like we were home. Don’t play yourself by not making your day or night shine even brighter… go to Pig & Butter its a must!!! Thank yourself in advance because you are going to keep coming back"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MEttMU1BEAE",
            "text": "Super cute and laid-back place.  Good music and friendly bartender/ waiter. Good happy hour!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRajRhdVFnEAE",
            "text": "I attended  an Alumni Mixer for the New School. This is the first time visiting this establishment.\nI found the space very tiny,and I wondered what it's like during normal service.\nI do apologize if my opinion was merely a first impression and that I did not experience  your establishment on a regular day or evening. The good food,drink and atmosphere was favorable and I did not intend to diminish your business  in any way."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRejduQjVRRRAB",
            "text": "Checked this place out after searching for and discovering it was black owned (black lady-owned to be exact). It's a really quaint spot that you can easily walk by if you aren't paying attention. The cuisine is a fusion of American brunch with an Asian twist. I had the chicken & waffles while my wife had pancakes with chicken sausage. We enjoyed the experience but I will be honest and say the food itself was not the best brunch we've had. Nothing was bad but they tend to trend towards really sweet so if that's not your thing then you be overwhelmed like we were. All in all, I still recommend tourists to check this spot out and support."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfa01XLTFBRRAB",
            "text": "This spot has been raved about, so my sister and I were excited to try it - our excitement was for nought.\n\nThe space was unheated to the point that a constant draft blew straight to the back seating area every time the door was opened; service was haphazard (the server was slow, inattentive - he literally overlooked my waving hand despite looking in our direction- and confused my order with that of the person sitting at the next table); the \"runny\" eggs suggested by the chef were not at all runny; and the overall meal was salty. Also, the supposedly fresh coffee was watery and quite old.\n\nAn overall disappointing experience; one that we'll not repeat."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTUNRN0lvRxAB",
            "text": "I hate giving bad reviews, but unfortunately this place isn’t great. Service is quite poor, very slow, not super attentive, seems a bit disorganized and chaotic. The scramble portion size was embarrassingly small given the price. We left quite hungry. The chicken and waffles flavor is decent. Not special, but decent, but also pretty small portions. These are things they could fix, but as of now I wouldn’t return."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneW9TdTdBRRAB",
            "text": "My girls and I decided to check out Pig & Butter in the East Village recently and had a great time catching up and trying out some of their menu items! \t We ordered:\nKorean short ribs & grits (a very saucy dish, not very filling) Truffle honey pancake (crepe style pancake, very flavorful) Parmesan truffle fries (shoestring fries, flavorful) \t Drinks:\nEspresso martini (very strong, should’ve ordered a shot of RumChata with it) Mary with a kick Bloody Mary (my friend enjoyed it, they also have a green one that’s less spicy) Dirty martini (very dirty, very strong) Vietnamese iced coffee w/ a shot of RumChata (didn’t really taste the RumChata but it was still good). \t They take walk-in’s only and offers happy hour after 4pm. The space is small but cozy with a handful of tables in the back and seats at the bar. We were lucky that they had a 4 seat table available upon walk in while we saw parties of 2 still waiting to be seated so keep in mind you may need to wait a little. I would come back here for happy hour for sure!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbk5tRnNnRRAB",
            "text": "The Spice Between the Sweets is one of the best cocktails I've ever had. The pancakes are fluffy with a very forward honey flavor, amazing. The Mitch and Deviled Eggs were good too. Wish I had a fridge in the hotel so I could try more menu items 🥲"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOUxPM0F3EAE",
            "text": "I was not pleased with this place . Waiters were so rude and snobby ( all men ) and the food was not good . Poor quality !"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncWZTNWpRRRAB",
            "text": "I really liked this place and the food that was served. The reason for my rating of the food was because the fries were too skinny for me. I prefer my fries to be thicker to savor the taste; but the burger I got from the brunch menu was so good. The atmosphere and service were really good too. My only suggestion is to avoid a big group because the place is small. I think it's best for a small group, like 3 to 4 ppl."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQb1kycEd3EAE",
            "text": "I came here solo while visiting NY on a Saturday around 10:30am. The place is so cute & I sat at the bar. The inside is small but perfect for smaller groups, a date or solo. I had the lychee lemonade & the Mexican chorizo scramble. Everything was so good! I would definitely come back! The food took a little while to come out & it was fairly empty but not a big deal personally. Also, loved being able to support a black woman owned restaurant!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIcnJESGF3EAE",
            "text": "My girls and I sat at the bar and enjoyed an amazing brunch! This place was a plus because we were able to support a black owned business! All of the staff were absolutely amazing and friendly! The bartender, let's just say the bomb!!! Everything we ordered came hott and fresh and to make it all great, the music was jamming!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuazdtWDJBRRAB",
            "text": "I came here yesterday, and was so glad that I did. The food was delicious, and the staff was very kind and attentive. I’m glad I came by myself though because the restaurant itself is very narrow and small. I ordered a cocktail, deviled eggs, candied bacon, and French toast. After tax and tip, my bill was $70. Overall, I would return again for another solo outing or a date."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIZ0t6djNnRRAB",
            "text": "Very small! We only came here because Clinton Street had a two hour wait. 😣 I would never come here again. The food was not my cup of tea. The photos online don’t match the food they serve. They also only had one server/bartender and he wasn’t able to be attentive because it was only him there. I honestly feel like the only reason they get business is because Clinton Street Bakery is close by and when people are starving they venture out to other places. You may love it but I definitely was disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYeDRxcXBnRRAB",
            "text": "Definitely a go!!! Went to this little gem Sat 19th, after the Tompkins Park Dog Parade. I love when solo diners are met with a smile.\n\nGot a seat at a table inside right away and man is it a cute restaurant: bright and cheery, lots of funk playing, an extensive eclectic menu: I honestly want to try everything, and it's reasonably priced!\n\nI got two gin drinks, the Las Flores which packed a punch and the Fizzy Rose (pictured in the champs flute) - sweet but not strong. I ordered the Korean short ribs of beef and grits which was really interesting in a good way. All the flavors came together for me, the lime aoili, the pickled sweet onions, the tender beef, grits were mmmmm!!! I didn't want this dish to end. After I finished, I popped my head in the kitchen to thank the chef who was working alone with passion, cooking their heart out for you. So cool!!! Will return asap."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMODVyb0pBEAE",
            "text": "Planned our stop here for pride weekend for brunch and greatly enjoyed the Asian inspired cuisine pig and butter has to offer, with a pleasant bartender at the front who welcomed us with a smile and the amazing mimosa ($5-7 for those don’t sleep) she made sure we were taken care of and atmosphere was nice and cute, would definitely go back as they offered quite an interesting menu, DJ was in house for the day and playing great house music !! Come try and you will not regret it!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCODdtRGp3RRAB",
            "text": "This place feels like going to your cousins house where you know you will be greeted with a warm hug and delicious food. The sandwich was chopped chicken, which is fine just was unexpected. However, VERY delicious. It’s labeled as “spicy” but it’s LES spicy not Harlem spicy. The spiked blood orange lemonade was truly what dreams are made of.\n\nThe seating is very limited, but I appreciate the minimal frill and focus on good food and drinks. We’ll definitely be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCLTd2RGtRRRAB",
            "text": "Had brunch here today and it’s a small place so there was a wait for a walk in party of 2 but we killed time at one of the many nearby bars so it was no big deal. Next time I’d get a reservation. I moved to NYC about 4 months ago and I can easily say that the two women servers were the friendliest servers I’ve encountered in the city. Hands down. I sat at the counter and watched as the two female cooks did a lot in a small space and it was enjoyable watching them cook and prep everything. We had a burger and the fried chicken on cornbread pancakes and both were great. I’ve also never had a tomatillo Bloody Mary before and it was excellent. The rest of their cocktail menu looked really good and they have all day boozy brunch!!! I can’t wait to come back for that and to try the rest of the menu.\n\nSide note- I was impressed with how clean the bathroom was."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMG9HNVpREAE",
            "text": "Initially, I read and heard great reviews of Pig & Butter for brunch, and so on a quiet Sunday, I decided to go and check it out for myself.\n\nNo reservations, just a walk in. Ate at the curbside dining shack. The indoor dining atmosphere was loud and quite claustrophobic. The staff were attentive and efficient with orders.\n\nWe ordered a Fried Chicken & Waffles, The Conductor, PB&J Waffles, and Vietnamese Coffee. The entrées were mediocre at best, with the waffles drowning in syrup, the Fried Chicken tasting bland despite the flaming red color exterior of the chicken.\n\nThe Vietnamese iced coffee was topped with cinnamon spice and quite exceptional in taste, perhaps the only saving grace to a mediocre meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiNmVEOVZBEAE",
            "text": "This place isn’t anything special. The short rib and grits was okay there were too many sauces on the dish and the grits to meat ratio could have been better.  I had way more meat than grits. The mimosa tasted like apple juice and orange juice mixed together. I didn’t like it much. The service was okay. The place was small and busy which I understand but more effort could have been put in. I had dirty silverware and didn’t even get a chance to mention it to the server."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPNHNpbkdREAE",
            "text": "Excellent!\n\nThe food really hit the spot, drinks where perfect and the staff where friendly.\n\nThe menu is interesting with an array of intriguing items it's hard to pick.\n\nI would definitely be recommending this place for anyone looking for brunch"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNleGJxS2lnRRAB",
            "text": "Easygoing dining vibe and friendly staff.\nFried chicken was crispy but pancakes were a bit soggy. I prefer crispy crust waffles. There were several dipping sauces in the chorizo fries plate. Very flavorful but for me food were a bit overpowering."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYa3J6SHZBRRAB",
            "text": "Cutely designed cozy & small space. Unfortunately, they were out of the burger and that’s really what I wanted so I just got some deviled eggs and an espresso martini. I would definitely skip the deviled eggs they weren’t memorable. Nonetheless the great espresso martini and friendly server/bartender made the experience nice ! (To the owner please find a more constructive way to reply to reviews. You come off as argumentative and it’s gross. I found a few egg shells in my deviled eggs so if I tell people to skip them that’s how I feel! ) -1 star for your poor response."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfX3N6bmd3RRAB",
            "text": "So I was on the hunt for a black owned business on my last trip to NYC. Trying to find any fanatic food places in the city is a VERY daunting process 😒However, this place somewhat made up for that. The food was very different and I really enjoyed the dishes for the most part. As much as i love truffle i never thought truffle could work with pancakes but it does...WELL. I just wanted more of the truffle flavor and some more salt. I had to add my own and it really balanced the dish that much more. The Char Shue sandwich was 10 out 10. Best dish I had the whole time I was in NYC. And the sparkling rose cocktail 🍸 I had was perfectly mixed by a fantastic bartender. Over all I would go back. Just be prepared for a wait it very small and crowded but then again so is new york so take that with what u will"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWOHZHcHB3RRAB",
            "text": "Good greasy eats in a non-fussy environment. The staff are wonderful! They are personable, friendly, attentive and upbeat. The fries are shoe string fries, and the parmesan cheese ones are delicious."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUQyM2Y1RRAB",
            "text": "My family and I were visiting the city and made reservations here. The staff were very accommodating and had our table ready a few minutes prior to our reservation. The customer service is excellent, as is the food. We had bottomless…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHdV96U2RnEAE",
            "text": "I ordered the fried chicken butter maple syrup. Def 10/10. It’s more on the sweet side. The chicken was crunchy yet juicy on the inside. I also Vietnamese hazelnut coffee which was amazing! Staff and owner were personable. Food was cooked really quickly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCNzVyNkJnEAE",
            "text": "Although the space is small, the food is really tasty. We also ordered the bottomless mimosas. Would highly recommend. The only bummer was the lack of heating in the peak of winter. We were super cold!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURodmNlQkZREAE",
            "text": "Eggo sized waffles with less than .2 lbs of chicken on top. Burger is tiny (see champagne glass for comparison). The decent flavor in the food, with the exception of the burger being a bit too salty, does not really compensate for the…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCd0tERXJ3RRAB",
            "text": "My wife and I went to this restaurant for the first time this past saturday. Due to the smallness of the establishment, we had to be seated at the counter. Seated at the counter, we were admiring the calmness and efficiency of the cook as she prepared the mouth watering looking meals. Only to find out after doing a Google search that she was also the owner.\n\nThe food tasted just as delicious as they looked.  I ordered Chicken & Waffles.  The chicken was cooked in a red sauce that tasted fantastic.  My wife ordered the Bacon Egg & Cheese which was tasted great except the egg was a little runnny. (she likes her eggs fully cooked.)\nOverall, though it was a little cramped, we loved the ambiance of this Pig & Butter. The 90's music being played in the background also added to this.\nI'm glad we discovered this place and will definitely be back for brunch when we're in NYC again on a weekend!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhMXB2VUp3EAE",
            "text": "Tasty brunch fare! Came here with two friends and renjoyed The Conductor - I'm normally a chicken & waffles fanatic, but this was a tasty substitute with the chicken, cornbread, and syrup. Friends had The Sweet Delores and Garlic, Mushroom, & Goat Cheese Omelette, and we ordered fries for the table. We all agreed that food was good but the one gripe we had was portion size - for $8, we expected a full plate of fries, not the pile pictured. Compared to other brunch places from this same area, it was definitely less. I will say that my dish was enough to satisfy a craving without stuffing me but again, the price for the portion ratio was not as satisfying.\n\nSide notes: outdoor dining is very cramped. Wait staff was a bit too attentive - coming to check on us every few minutes, taking dishes the second they were done, and bringing the bill out almost immediately made us feel unwelcome and rushed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMteFktU1ZnEAE",
            "text": "I had found this establishment through Thrillist's list of top 20 Black-owned restaurants in NYC and it did not dissappoint! I went on a first date there last Saturday around 3pm for Brunch. We had to wait a bit since there was a large party in the back. The server was doing a phenomenal job keeping up. All of the food arrived quickly and tasted amazing! I had the French toast and omelette. My date had the bacon and chicken & waffles. We shared the truffle fries. We both also had the $18 bottomless mimosas (for up to 90 minutes). Every plate was honestly cooked to perfection. The chef/owner is speedy and skilled. The music was perfect for brunch and the vibe was very chill yet fun. This is by far my favorite NYC brunch I have had to date. I will definitely refer this place to friends and family!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNleS1UelpBEAE",
            "text": "I wish I remembered the waitress’s name but she was great! We felt welcomed and had a great brunch. I’m def recommending my friends to come here and I’ll be back too to try the other foods on their menu. Also their Bloody Mary looks…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCLTVIYlVnEAE",
            "text": "Small spot. Wait can get long.\n\nSpiked coffe was good. Aquired taste if you dont like thay already\n\nFood was flavorful, but different than expected.\n\nBest dish was the fries. Love shoestring fries and the chorizo was well seasoned and crumbled well.\n\nWorth the try to check it off the list. Average spot,  but not necessarily a good repeat."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfbGR2UDlBRRAB",
            "text": "I’ve walked past this establishment many times. It has always seemed inviting and welcoming and I love their signage they have on the street. Today I decided to stop in for brunch: this was my only day off to get brunch because I work in the industry and I had high hopes. First, I walked in and the door was extremely difficult to open and the bartender made me walk back over to shut the door. Me and my friend sat at the bar and at first we were very excited to look at the menu and order drinks. We had asked the bartender several questions and were wanting to get mimosas in a larger portion and instead of him explaining why they don’t offer it he just bluntly said “no, I don’t made the rules here”. The cocktails were the best part of our experience, however I had to ask the bartender 3 times for water and to remind him of our coffee order. He seemed more interested in talking to his female coworker and had a vibe shift between speaking with her vs customers. As someone who manages and runs a night club and has 5+ years in hospitality, this service was extremely unacceptable-  there were less than 8 people in the restaurant. When our food did come out, it was lack luster in taste, presentation, and overall bang for your buck. I had ordered a side of bacon that never came out but luckily the bartender had completely forgotten that and didn’t add it to the bill.  Overall extremely disappointed in the experience and would not go back, nor would I recommend this place to anyone."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXOGJHd1NBEAE",
            "text": "For such a small restaurant I’m shocked at how bad the service was. It took more than 20 mins to get drinks, the waffle was pretty dry and took us 10 mins after the food got there to get extra syrup and even get silverware.\n\nI would try this place again since the chicken was solid but beware of the service."
        }
    ],
    "reviews_count": 76
}