{
    "name": "Benemon",
    "place_id": "ChIJw1RDWoNZwokRYAFf9LI9bd8",
    "grid": "MN3",
    "address": "108 E 4th St, New York, NY 10003, USA",
    "rating": 4.5,
    "user_ratings_total": 486,
    "phone_number": "(212) 614-3006",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdVpsSlpPR1pOYms1dGNFMW9kRmxzVkRaUFJYYxAB",
            "text": "I'd been wanting to try Japanese beef curry for months, and since I was on vacation in Manhattan, this restaurant popped up on the map and it was absolutely fantastic. The service was incredibly fast, the food was absolutely delicious, the prices were great, and the place is lovely. I'm already looking forward to my next trip to Manhattan so I can visit them again."
        },
        {
            "date": "1주 전",
            "language": "ja",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVWRVSlNNamRyUkZsRFFubzFUREZGUlUxbU0xRRAB",
            "text": "We had a party at Benemon and everything was fantastic! We ordered a ton of food — all of it was amazing. The drinks were just as impressive — I tried a yuzu-flavored drink and a peach one (don’t remember the name) but both were delicious! The sake called Biho was also incredible. The place was busy with a great, lively vibe, and the service was amazing — attentive and friendly.\nすっごく美味しい日本食で、スタッフも日本語喋れる人が多くてビックリ！\nCan’t wait to go back!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OTmJHZE9hVk5IUzBsRWJWQTJaMnhsTW1KeVMzYxAB",
            "text": "Delicious unagi don! A whole eel grill covered with rice amazed me! Garlic beef steak is the must-have! Also recommend the non-alcoholic macha drink!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjd00xSmZORmhwUVRoRFYweHNjMHhGVm5WUFFuYxAB",
            "text": "One of my favorite neighborhood spots! Food is excellent, I always get the oyako don and fried chicken. Definitely recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5U2JHUnlZaTFhYzNWVlNtRnRjRVp2UkZkV2JYYxAB",
            "text": "Waiter seated us 5 minutes before the kitchen closed, and our food still came out quick and tasty. In my opinion, this is the most bang for your buck unagi in manhattan. For 29 dollars, you get a large portion with a light char. Great texture and flavor.\n\nGet an entree plus a small plate or you will be hungry."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSSVpWSkVaVTlVZGtKd1IzWjVSbUp3ZURORGFGRRAB",
            "text": "The food was great, the atmosphere was great and the service was great. Especially Jhon’s service. He even introduced me to one of my new favorite drinks called Manomasume!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdWFXSmphRmcwUVVsTFEzTnFOVXhTTTJwRVptYxAB",
            "text": "Terrible food, very surprised by this. Service was good though. I got the katsu and they just douse the overcooked meat in mayo and other sauces. Rice not seasoned. App not impressive and also drowning in sauce. Drinks not memorable. I only came by word of mouth. Please don't spend money here."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taSFRGb3pUbUU0UTBsVVJDMUVPVFIwY1RkRlduYxAB",
            "text": "Food was delicious, especially the rice in the donburi. Drinks were also good.\n\nService was disappointing. We ordered a drink each, one app, and a salad for my wife and the yakiniku don for myself. The app and my wife's salad came out before our drinks. We had to ask about our drinks to get them. 40 mins later my food is still not out while two tables that came after us had already gotten there food and my wife was finished with hers.\n\nWhen I asked about it to our server, he says he will check on it. He obviously forgot about my order because I literally seeing him check our table and put my order in on the POS, but instead of owning up to it he comes to me and tells me that it was because the beef is taking a long time to cook. I finally got my food 10 minutes later and the beef slices are paper thin. You're telling me this took 40 minutes to cook?\n\nPeople make mistakes. But when you make them you need to own up to it and not lie to your guests. That is what really irritated me. And if you're going to lie, lie better. Don't tell me thinly sliced piece of beef takes 40 minutes to cook."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wa01tTkxaWFJrVEdSRlZXcDVXVEpTVUVwNU5WRRAB",
            "text": "Really dug this place.\nNot familiar with a lot of the restaurants  in the neighborhood but this was suggested and they didn’t disappoint.\nI was THRILLED that music wasn’t loud and conversations could happen without much stress or strain.\nStaff was very friendly!\nThe food was great - my party had gotten many dishes to share and all were solid choices."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kWlowTkJZM1pNUVdwMFFVRTJXV1JrY25kcGIwRRAB",
            "text": "Major dining pet peeve: Restaurants that are stingy with AC on hot summer days. Come on, we all have electric bills to pay, and we all know how high they get from May to Sept. But no one wants to sweat like they're doing HIIT while trying to enjoy a plate of hot food. Oooo, weak pee in my gnocchi....tasty.\n\nBenemon is another stingy-with-AC restaurant. On a sweltering day with 251,000% humidity, the air conditioner was barely on, the fan was non-existent, and perhaps most insulting of all, they served us tepid, room temperature water. We had to ask for ice, which they (begrudgingly) gave in small cubes that melted instantly.\n\nThe food was fine, but not worth the suffering.\n\nWe started with Beef Carpaccio that was a bit too cooked for my liking, and Tuna Tataki likely drowned a painful death in the too-sweet miso-nut sauce. The Soft Shell Crab was pretty good, but I could've used more than six tiny legs. My Katsu Curry featured cute, sausage-shaped  cutlets, but most of the dish was just sticky rice and gravy that I could've made myself.\n\nIn attempt to avoid feeling feverish, I also got Yuzu Shiso Spritzer to wash everything down. It was fine, but if I hadn't desperately needed more ice than the staff wanted to give, I wouldn't have bothered ordering this.\n\nNot worth the sweat or the schlep."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WR01qSjFkREJ6V0drM2ExSnlWR0o0ZURCdlVXYxAB",
            "text": "This place rips - so good"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMVGlpSV9ubHV6ZXpnRRAB",
            "text": "Wonderful Japanese donburi and curry. Highly recommend the eel! Cozy atmosphere, friendly staff. Will definitely return!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKX2NvTmJSLXNYbTN3RRAB",
            "text": "A perfect meal with great service"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNHVhVDZ3RRAB",
            "text": "Nice cozy Japanese restaurant with great service. The matcha cocktail and tuna tataki were delicious! Also tried the chicken and veggie donburi which were good, but not mindblowing. Would be curious to try the other menu items which may be better."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzX09Ya0d3EAE",
            "text": "All the appetizers were great and well seasoned. The beef yakiniku was solid. I thought the curry was fine but would have much preferred a whole pork tonkatsu instead of the many small ones"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3eU1TNGJ3EAE",
            "text": "Drinks were really nice, appetizers were really good too, we had the squid, tofu, and beef, all were awesome. I didn’t like the Japanese curry much but that’s a personal choice."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cDk2VkVREAE",
            "text": "Food was kinda hit or miss. The  edamame, adegashi tofu, and soft shelled crab was good. The tuna takai pieces were small and over-sauced and looked nothing like the photos online. Service was good and the restaurant is located in a nice cozy spot."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURna09YY0NREAE",
            "text": "Yuki gave us awesome drink suggestions and made them with care and precision. Thank you!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndWJ5UHJBRRAB",
            "text": "Was ok. Nanban and potatoes were the best dishes."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnM28tVG1nRRAB",
            "text": "This place is my new favorite gem. Every fish was full of flavor."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdkw2ZnlnRRAB",
            "text": "Good food, beautiful lighting, and nice music"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLczU3Mk1nEAE",
            "text": "Great company!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQeHRQMmFnEAE",
            "text": "Food was amazing!! Will come back for sure\nWe had the Tuna Tartare as an appetizer and Yakiniku don, Katsu don and the Katsu Curry as the main dishes"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeGEyWnl3RRAB",
            "text": "Very well done takes on classic Japanese fare, and very reasonably priced. We had the Katsu curry and the Tsukimi Tori don. Both flavored very well without being too rich/overwhelming. Highly recommend."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcmJMTTJBRRAB",
            "text": "Just a heads up that they might randomly close super early. Website and Google said they close at 11 on a Thursday and we walked in at 9:50 (well over an hour early) and they said no more customers. Pretty unprofessional IMO. Worse, the guy had the gall to try to tell me \"well, it's not that early\""
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYOC1hUTlBRRAB",
            "text": "Very satisfying weeknight walk-in dinner here. It’s a small space, dimly lit, but cozy and not loud. Service was sweet and food excellent - shared starters included a delicious Tofu Hijiki Salad and juicy, piping-hot Kara-Age Fried Chicken. For my main I had the Yakiniku Donburi beef-and-onions rice bowl - savory-sweet and very flavorful. A bottle of terrific Kansansui sake rounded out the meal very nicely. I’d definitely go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYOGQzLTRRRRAB",
            "text": "Very good Japanese food with very fair price"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURubE1iemNnEAE",
            "text": "The staff were very nice and accommodating.\nIt was our first time and we will come back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubHJUUHZBRRAB",
            "text": "Amazing and flavorful food, intimate setting, and great attention to detail throughout. There's plenty of options in the city, but only one Benemon. Also, the Salty Pork Belly is a must!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIaTQzX0JnEAE",
            "text": "amazing cocktails, sake, and food! Vibes!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINzRHaEt3EAE",
            "text": "They have happy hour and serve shochu cocktails. We had karage, hobo sticks, st"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3d3YzeGp3RRAB",
            "text": "This a cute restaurant. Came on a Wednesday night and it was quite quiet. The appetizers were all really delicious. We ordered the pork belly , tuna tataki, and soft shell crab (this was my favourite). For mains we had the Katsu and una tama don (so much umamami and was creamy). The prices were very reasonable! We each got a different cocktail (high balls) and they were not bad. The staff was really attentive and was very accommodating with allergies. Would definitely come back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bUtuMXZ3RRAB",
            "text": "Ordered chicken karage, maradame salad, sliced beef, curry katsu pork and una tan don.\n\nChicken karage was breading was lighter than most (what i like) , salad was surprisingly my favorite appetizer, and beef was really tender.\n\nCurry katsu the breading was too thick and pork was dry.\n\nOverall was good but nothing mind blowing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMa29EY0hnEAE",
            "text": "Definitely a gem in NYC! Authentic Japanese comfort food, excellent quality, beautiful presentation, amazing value!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMNlo2OUNREAE",
            "text": "Food was good, drinks were amazing. (Peach Fizzle something) Was very refreshing. A total recommendation. However was charged for the regular priced drinks as oppose to the happy hour price. Server didnt realize and I didnt say anything."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6OG9YSTFRRRAB",
            "text": "You craving some EEL/Unagi, come here!!!! The Giant Unagi DonBowl is the reason you come here!!! I'm glad they don't cheap out on the Eel. Bedded on top on a perfect amount of rice, with shredded nori/seaweed to compliment it 😋 Best Meal I had in New York by far!!! Me and the wifey ordered almost the whole menu, well worth it! Pictures doesn't do it justice. Everything is delicious!! High quality Japanese food 🤤\n\n11/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6MklfUWdRRRAB",
            "text": "Absolutely delicious food. Elevated Japanese people food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUc3NhQmNREAE",
            "text": "Great food and amazing value as is hard to fund in NYC these days!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUbkxTSVVREAE",
            "text": "This place never disappoints. It truly is comfort food while staying elevated and refined."
        },
        {
            "date": "1년 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNULUkyVzJnRRAB",
            "text": "氣氛絕了 已加入口袋名單 幾道招牌菜都很讚"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqeGJhR3dRRRAB",
            "text": "Delicious food! The waiter was also efficient and friendly. Highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqNXNpaTdRRRAB",
            "text": "Servers are all very kind. Black miso chicken dish was quite small"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbXNXeElnEAE",
            "text": "God the meat at this place is insane. I got the squid to start and the popcorn chicken and both were soooo delicious. My partner got pork and I (who never ever eats/likes pork) loved their pork belly so much I ordered it for myself"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqcDZ5bDhnRRAB",
            "text": "Benemon has quickly become one of my favorite restaurants in New York and always hits the spot when I’m in the mood for Japanese comfort food. I definitely want to come back and try more of the menu, but it’s hard not to get the same thing every time because it’s so good.\n\nI recommend making a reservation, because it can get pretty busy!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqemZib2V3EAE",
            "text": "Wow ,what a cute little place ! Came here on a Spring Day with a friend.  The exterior and interior of the restaurant are very charming looking like you are in Japan.  They call this Japanese comfort food and I guess it's true. Get the Anchovy Fried Potatoes appetizer. Tasty and unexpected with Parmesan cheese . The Gobo sticks are earthy but I like trying something different and we enjoyed them . Tempura is crispy and good.  The main star of the menu are rice bowls .My friend got the Oyako Don dark meat chicken and really enjoyed it. I got the eel and egg Una Tama Don and it was so delicious and satisfying.  There's no dessert unfortunately but service is really fantastic.  Chill soundtrack too. Also got a glass of the Yume No Kaori sake for $14 , it was bright and fresh just like the menu says.  Perfect for the meal. Also don't be afraid to order the sake , it's not too strong and tastes great . My friend also had a draft Sapporo beer . Such a relaxing meal. Definitely recommended."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMU8tRTN3RRAB",
            "text": "Hola a todos amigos de Google Map!\nHace un tiempo que habiamos ido a este nuevo Restaurante para mi, ya que mi Esposa habia ido con unas amigas. Por eso ella me lo recomendo mucho, amigos.\nDebo decis que el lugar fue muy acogedor, desde que entramos nos brindamos un excelente servicio, cómo el servicio en la mesa tambien.\nLa comida fue genial, siempre me encanta que los Chef dejen su sello particulas en cada plato que uno come y sobre todo la presentacion de cada uno de los platos que nos sirvieron...!\nLes recomiendo mucho que vayan, el ambiente es muy bueno, hay como un clima formidable dentro del restaurante.\n\nHi all Google Map friends!\nA while ago we had gone to this new restaurant for me, since my wife had gone with some friends. That's why she highly recommended it to me, friends.\nI must say that the place was very welcoming, from the moment we entered we provided excellent service, as well as the service at the table.\nThe food was great, I always love that the Chefs leave their particular stamp on each dish that one eats and especially the presentation of each of the dishes that they served us...!\nI highly recommend you go, the atmosphere is very good, there is a wonderful atmosphere inside the restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5bDc2VTlRRRAB",
            "text": "Benemon is like a good shirt you can dress up or down- it’s there when you need a dinner reservation day-of, but is also fancy enough for entertaining guests. Their menu has stayed relatively static for the past few years, but offers consistently interesting dishes at a fair price. Ambience is always cozy and bustling with patrons. Excellent intersection of quality and price. For all the above, Benemon is one of my fav restaurants in the city!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkaElIV2t3RRAB",
            "text": "Great food and service. We had a reservation and were sat right on time. Will be back and highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROZ3RxQ1NREAE",
            "text": "Excellent spot for discovering unexpected Japanese fine meals.\nI strongly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROdUptRDd3RRAB",
            "text": "One of my favorite lowkey Japanese spots in the city. Great food. Atmosphere. Service. Love taking friends here who are visiting. Great cozy food in the winter."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1aExYZXpnRRAB",
            "text": "I came here for dinner last week with my boyfriend, it wasn’t busy since we came right when they opened. Servers were friendly and attentive. Enjoyed the oyako don, rice was a little more wet than I usually enjoy but that is probably just how the dish is- since there’s eggs and other stuff in it as well. My boyfriend loves fish so he enjoyed the tuna more than me. The steak was so good though, cooked perfectly and the sauce was lovely. Serving sizes are small for the price but this is how NYC is… loved the food, everything was great! The indoor atmosphere was chill and relaxing :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdlpuaGl3RRAB",
            "text": "Nice place for a quiet date night. Went with the small plates since they seemed more interesting. I'd recommend the beef tataki which is quite flavorful. The cocktails and sake selection is nice. For cocktails, the Summer Echoes is aptly named."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2bUtyNVJBEAE",
            "text": "Super cute place with delicious food. The highlights are definitely the appetizers, especially the gobo sticks, beef tataki, tuna tataki, and soft shell crab. We also tried the pork katsu curry and una tama don but thought they weren’t anything special. Would come back for the appetizers."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwZy1MSjdBRRAB",
            "text": "Benemon is a place that I've been too a few times over the years but I've never been much of a reviewer. Thats changed lately and I feel like they deserve the shout from me .\n\nTheir ambiance is insane. Their decor speaks to my soul, I could sleep on their wooden grounds. But that isn't whats important. The food is.\n\nThe sliced pork belly is simple but delicious(The cuts do seem to change depend on who the current chef is though HAHA)(I'm adding another picture of a previous visit as we speak to prove my point)\n\nAll the dons are good(the one shown is the nanban, but the best is the oyakodon according to previous experience)\n\nBest item is the creamy baked salmon hands down. I come here every 3 months for a reason. And its primarily that item.\n\nCome get it. You won't regret."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlN2F6LU13EAE",
            "text": "I thought the food felt like home. It wasn’t anything surprising or unexpected. The pork katsu were a little dry, and the steak lacked garlic flavor as expected.\nBut good vibes and kids friendly; and easy to get seats on a Tuesday night without any wait."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2MHVqSnpnRRAB",
            "text": "The overall experience was good! We came here on a Friday night around 6:30 and wait around 30 minutes which wasn't too bad considering how crowded the restaurant was. The staff were friendly and apologize for the wait. The food were pretty…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhdzZfNTVRRRAB",
            "text": "Benemon in the east village serves tapas, donburi, and Japanese curry dishes. They do not take reservations on the weekend and we saw the reason why; by the peak dining hour customers were lining up for a seat!\n\nWe started with small plates of tuna tataki; seared tuna with Cajun spice, sweet miso-nuta sauce, and smoked pork belly with shishito peppers served with spicy black kaimi sauce. Both dishes are delicious yet we commented that the sauce for the tataki has overpowered the main star which is the tuna.\n\nFor our main entree, we shared Nanban Don; crispy chicken tempura glazed with Nanban sauce served over rice, and the tender stewed beef with savory curry served with rice. We found both dishes delicious and filling.\n\nThis place serves solid Japanese comfort food. The outdoor dining added quaintness to the ambiance. With awesome customer service and price points, we will be back here!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1eUpTSHh3RRAB",
            "text": "Good food at pretty fair prices for NYC! Lots of different options for a variety of Japanese dishes (curry, rice dishes, etc), so there is something for everyone. I had the vegetable don which was surprising in that it was just tempura vegetables, rice, and a side dish of ten don sauce, but the tempura veggies were really well cooked and the sauce was delicious. Simple, yet effective!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPNlltV293RRAB",
            "text": "Appreciate that they were able to accommodate us (party of 3) without a reservation on a Thurs evening. Nice environment but we thought that the dishes could have better flavours/textures. Especially the curry katsudon- usually it comes in…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjbVpLMnRnRRAB",
            "text": "Cozy place and had a relaxing time. Staff was diligent and friendly. Had a pork Katsu curry rice bowl with solid texture to the curry and fried pork cutlets. The individual pieces were still steaming and delicious even to the last piece! Would recommend and come again!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBOHJ1Tm13RRAB",
            "text": "Very nice Japanese Tapas restaurant.  Price is not expensive. They don't take reservation and it is crowded after 7pm.  We ordered the Ai No Hime sparkling sake and it was awesome.  Food and service are good.  Donburi (Japanese rice bowl) is delicious.   We had the Una-Tama Don and it was tasty."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbjh5enhRRRAB",
            "text": "Favorite restaurant in NYC! Got the nanban don and it was life changing. For appetizers, we got the tuna tataki and the tofu fire. Both were amazing. The price was around $40 per person but definitely worth the price point. Definitely give this place a visit"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3cXVqYm13RRAB",
            "text": "We were looking for an izakaya in NYC and Benemon popped up on our radar after doing some online scouting.  Aside from your usual Japanese tapa styled dishes, Benemon has an excellent selection of donburi and curry to choose from (in case you actually want to get full).  On this particular night, we had the gomadare salad, edamame, and karaage chicken to start.  My wife had the shirmp & anago ten don and I had the pork katsu curry for our main dishes.  Food is always delicious here and there are plenty of beers and sakes to choose from.  We've never experienced a long wait at Benemon, and the service is quick and friendly.  The decor is rustic modern with a very impressive looking sake display at the bar."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1bWNUeFFnEAE",
            "text": "I got a seat at the bar and had fun talking to the waiter about their sake-based cocktails. In addition I ordered their tonkatsu which came in a bowl with rice and curry in a very aesthetic way. Overall the pork tasted good and the curry gave good flavor.\n\nI do need to return one day to try their sake flights."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpcGFLWFRREAE",
            "text": "Food - 5/5\nSpot on! Tapas style and also entrees available. Personal recommendations are the garlic steak and tuna tartare. The steak is medium rare, coated with garlicky savory soy sauce. Out of this world! Must have!\n\nAmbiance - 5/5\nOutdoor dining available. Very cosy set up with ceiling heater. Music in the outdoor tent too!\n\nService -5/5\nFamily owned business. Everyone is so friendly and attentive.\n\nMust eat if you’re in the Lower east side"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cFAtNEtBEAE",
            "text": "This place was amazing. We got a variety of small plates and then a few mains to split between 4 people. The sake selection was also great, I would highly recommend asking the server for their input."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOMHRUdnFnRRAB",
            "text": "I would say the ambiance is great, I can see why people have date nights here. The service is decent. The food is okay. I came from queens to try the unagi don because I didn’t see any places that will give you a whole piece like this. The eel was hard to break apart I would say, like kinda rubbery? Not sure how to explain it. The sauce is as expected. There are a lot of reviews saying the food is oily and I would say those are pretty accurate (especially for yakiniku). There’s not that much rice. We don’t drink so we can’t really comment on that. Either way, our overall experience was okay and it’s sort of try it once type of place."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHakluaHRnRRAB",
            "text": "Really friendly servers at this place! I came here alone and they still offered me the warmest hospitality.\n\nI ordered the unatama don and tofu. The eel dish was delicious and I loved how the egg was still runny. The tofu was a little mediocre and expensive for what it was, but not the worst.\n\nOverall, I had a great experience. Will be back to try the infamous unagi don!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1cTh6S3V3RRAB",
            "text": "We were in the mood for some donburi. This place hit the spot. The shrimp and anago tempura donburi was excellent. That tempura batter stayed crispy after sitting on the steaming hot rice and after we poured the sauce over it. That really impressed me.m because some places don’t make it right and soggy tempura stuff is horrible. The yakiniku donburi is (obviously) a yakiniku version of a gyudon. It was very tasty. Other than that, friendly staff and clean place, which is always a plus. I’d return for some donburi. I’ll also try some karage and some other things next time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGaDhhNzhnRRAB",
            "text": "A favorite local spot. Cozy vibes and amazing “comfort” food. Big portions, full of flavor for the main dishes and the Anchovy Fried Potatoes are a great starter to share!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpNHFiTGdBRRAB",
            "text": "Cute little place with some great tapas! We ordered to share among 4 people:\n\nSmall plates\n- Gobo sticks\n- Kara-age chicken\n- Soft shell crab\n- Hot squid (one of my favorites)\n- Tuna tataki\n- Salty pork belly (another favorite)\n\nEntrees\n- Una-tama don\n- Tskukimi tori don\n\nEverything was absolutely delicious!!! I was VERY tempted to order more of the small plates and skip the entrees, but I'm glad we didn't. Service was great too, but a little on the pricier side. I'm glad they're open with outdoor dining though because I can't wait to go back again."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcUlHU0h3EAE",
            "text": "I came here for dinner with a friend, its a nice, cozy and quiet place, the servers were so friendly. Ive been craving for unagi for a long while and definitely enjoyed it alot. Loved the food, everything was so great."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXb05MMHZBRRAB",
            "text": "Nice Japanese restaurant! The sauce is too sweet but the fish is tender and fresh. The chicken is so juicy and tender as well, highly recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPMkttRDJRRRAB",
            "text": "Fantastic eating experience. Portion sizes seem small for the pricing, but the food is prepped so well and it's shockingly filling, so no complaints! We got beef taking, tuna tataki, and nanban don... All great! The sake selection was diverse as well."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNazdXeXpnRRAB",
            "text": "It's a tiny cozy place.  If you have large group, prepare to wait.  There's no reservations allowed, so first come first serve and this place gets packed fast. The food arrived quick, as expected from the Tapas-styled place. Prices could be…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNScHVfMFRnEAE",
            "text": "stumbled upon this spot and was pleasantly surprised. intimate decor makes for a perfect date spot. the food was delicious - highly recommend the pork belly and shrimp tempura! would come again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbE5UQ19BRRAB",
            "text": "Almost want to gate keep this place but out of the goodness of my heart I will share my 5 star review.. I enjoyed the una-tama don big time although I am a bit biased as unagi is one of my favorite fish. We also ordered some Kinoene sake and that was very clear and smooth (recommended to us as a good starter sake for those less knowledgeable).\n\nService was thorough with dietary restriction and was great at explaining the best parts of the menu.\n\nDefinitely coming back here the next time I’m in New York. I enjoyed the meal thoroughly and need some more eel ASAP.\n\nThanks Benemon 😋"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDc1lqX2NnEAE",
            "text": "This restaurant is more like a Japanese street food. Beef tataki and their tuna tataki is a must try. And their donburi is a good portion for the price."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRb2R6dWZREAE",
            "text": "It wasn’t busy at all but we had to call a waiter to get some beer, water and sake. Staff didn’t pay attention and weren’t friendly. We felt like we were begging for food and drinks.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOejR5OHV3RRAB",
            "text": "The restaurant is small so make reservations ahead of time  if you can.\n\nThe food was amazing! Would highly recommend!"
        }
    ],
    "reviews_count": 80
}