{
    "name": "Trapizzino",
    "place_id": "ChIJE46otIZZwokRlpOttitF5JM",
    "grid": "MN3",
    "address": "144 Orchard St, New York, NY 10002, USA",
    "rating": 4.5,
    "user_ratings_total": 798,
    "phone_number": "(212) 475-2555",
    "reviews": [
        {
            "date": "2일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kcFMwcHBkVk14U0UxV1JHWmxTMGxCTkd0aGNGRRAB",
            "text": "Restaurante italiano con encanto donde la especialidad son los trapazzinos, una especie de bocadillos con pan de pizza con forma de triángulo y rellenos de diferentes cosas, muy buenos.\nLa pasta buena también\nPero la atención de Junior fue sin duda lo mejor, muy amable, profesional y siempre con una sonrisa.\nRecomendable"
        },
        {
            "date": "4일 전",
            "language": "hu",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sQ1JrTkZiMHB5TW1ObWQwWnRUMWwyTUVGME5FRRAB",
            "text": "Elképesztő finomat ettünk, rendkívül kedves a kiszolgálás. Az olívaolajos torta fenomenális."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ONWJIcG5jSHA0WmxKeU4wUjRjRmx4U2tsR2RtYxAB",
            "text": "Delicious food, great ambience and amazingly kind waiter! Would come here again definitely!\nThe olive oil cake is to die for!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xNWVsTlNXR3R4Uldvd05HVjVVRkUxU1VkemFuYxAB",
            "text": "amazing taste and vibe!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKeGJraHljQzFLY0Y5M1NuYzBZVVJ2YTFGRmJXYxAB",
            "text": "What a delicious meal! We started off with the arinchini which was flavorful and tasty! We then continued with the Trapizzino which was again delicious and had great texture. The cacio e Pepe was also really well done: a creamy bucatini. Highly recommend! Just note the atmosphere isn’t the best."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONGEycFZhWFZTWTBoUU1Xb3RhRGhhYlhKc05GRRAB",
            "text": "The food was delicious and came out quickly. I’d never had anything like the pizza pockets before. Wonderful fresh bread and a nice meatball. Staff was super friendly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUVRFVnVNM1JxV1Zaek1qa3pRM2RrWTNkcVRGRRAB",
            "text": "Plain and simple: Trapizzino hits the spot. Went with a friend and we ordered far too much (yet ate it all). I can’t recall the quality of the drinks we ordered, but I’d argue that you’re not coming here to be wowed by their mixology. The food is where it’s at. A little cramped, yet still worth a visit."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WV2NsTmtWMWR2VUZjd2VWUXpOR0ZZYUV4NmNuYxAB",
            "text": "I happened to come by on a whim. I tried a few things on the menu & the trapizzini was definitely something different but amazing. Jaleel helped me with pairing my glass of wine & I had a great time. I will most definitely be back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnMlpqUjNVREpQYzI5Q1FUVkdVbUp1U1hJMVJWRRAB",
            "text": "Trappizino is the local hangout corner spot. I usually drop by the evening start with the coffee that immediately turns into amici spritz in the summer or a glass of red in the winter along with a seasonal Trappizini or some fresh cheese.\n\nI don’t normally write reviews but I wanted to give a special shout out to Kelman, Henry and Junior who make it feel like home. The classic Italian way- sometimes I just drop by to say hi to them!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twNmNHcERWV2syTkV3dGJrbHlXbnBsUkVZelgyYxAB",
            "text": "We celebrated our birthday here with a group of 16, and it was perfect from start to finish! 🎉 Giuseppe was amazing — he helped us schedule a table last minute and was so kind and accommodating the entire time. Truly above and beyond service.\n\nThe food was phenomenal — we did the Roman Feast and everything was incredible. The risotto balls and the ragu pasta were especially delicious, and there was more than enough food for everyone. Honestly, we couldn’t even move afterwards because we were so full (in the best way)!\n\nThe staff was super kind, the atmosphere was great, and it was the perfect spot before heading out to the clubs. If you’re looking for a place to host a big group for a birthday or celebration, this is absolutely the spot. 💯 We’ll definitely be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3dGEzZDJOamswWjNBMWIxQTVjQzFHVGtKWmFIYxAB",
            "text": "Excellent service, wait staff over the top friendly and helpful!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FNWQyTlZXVGwxU2xKMGRITXlkbmRrVWt0UmJHYxAB",
            "text": "My mom and I came here for lunch and it was so good! The service is so kind and attentive and the food was amazing (loved the sandwiches, patatas, and olive oil cake was wow). We had such a lovely time and cannot recommend enough!"
        },
        {
            "date": "1달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOV01tWnJaVkExY1ZwTGVHOWZlVTB3YjNWQmVVRRAB",
            "text": "Вкусно. Быстрое обслуживание."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tReVZWQmxXRmhaVW13MkxUbFJiRVZwVm1kalVXYxAB",
            "text": "First experience I had here was several years ago. Food was still good, but experience with our server wasn’t optimal. We had someone who needed to leave early and so we wanted to split the bill, and the server first told us he couldn’t, then later said he didn’t know how, then sighed and said he could if we really wanted to. Most of our table did not appreciate being lied to straight to our face. We ended up paying with one card and splitting it amongst ourselves, but almost all of us had been servers at one point or another; we all know how Toast works. Splitting it would have been easy. He also told us he would comp two of the drinks because they took so long to come out but did not, and charged us for an extra Peroni we never got. He gave us cash for the Peroni we didn’t receive but the other two drinks that were supposed to be comped stayed on the check.\n\nOnly food complaint is that the rice in the suppli was hard, but it’s basically impossible to find these made correctly outside of actually being in Rome. Oxtail trapizzino was great though!"
        },
        {
            "date": "2달 전",
            "language": "fr",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTWRuRlZXalZsUW1vM2IwMVhOVEZMUjJWMGFHYxAB",
            "text": "Les quantités ne sont pas en rapport du prix. C’est un très mauvais calcul de donner si peu de pâte quand vous demandez 20$ pour un plat.\nC’est bon mais vraiment ridicule en quantité…"
        },
        {
            "date": "2달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KRk1FUndlRmt3WmpSVE1FMVJTVmRWUWxKS1pHYxAB",
            "text": "Très bon et raisonnable pour le prix\nService souriant"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4bGRqQXRNWFJOWVdkdmVXazFNVTR3VFdkZk5uYxAB",
            "text": "Food was great"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSa1NXeE1MVGRuVVc5b01FbHZaM2cyY1cxWVVsRRAB",
            "text": "I used to love Trapizzino when I lived in Italy, and I was so excited to stumble upon it here in New York! One bite instantly brought me back to Rome, the trapizzino was absolutely delicious. The service was just as great: Gabriele was so kind and welcoming, which made the experience even better. My friend and I had such a wonderful time, and we’ll definitely be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJMmNXSktaRWgxUm5OTmFGOXBjRGxXUmxaU2VrRRAB",
            "text": "I love this place- it’s great for snacks, lunch, and dinner- cocktails are amazing. The vibe is right and the staff is so nice!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aa1lUQXpUeTFHV0VWbGJFaDRNWGhUTTI1blVWRRAB",
            "text": "The restaurant as a whole was lovely and prices were fair and cheap! The service was quick and the servers were very kind. When a mistake was made, which we didn’t mind at all, they were so quick to help and compensate by giving us a free desert. Only doc off points for the atmosphere because at night my friends and I encountered someone not too fun from the street while sitting outside. Otherwise such a lovely restaurant and experience! Will be going back %100!! Also I definitely recommend the “doppia panna” (baratta and anchovy trapizzini) as well as the “coda alla vaccinara” (the oxtail trapizzini)!!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcU1lTUd3EAE",
            "text": "The best carcofi & tallegio supli 🤩🤩🤩🤩 A few weeks ago I ate a caponata trapizino, it's crazy delicious"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOeGNEaEdVMlpwVGtodmJGTmZORVp1WTFVM2RFRRAB",
            "text": "Genuinely never post reviews. Waiter spilled an espresso martini on me, didn't apologize. Didn't take anything off of the bill for the mistake. Shirt is ruined. Waitress forgot our drinks order 2x. Food was ok, probably better for a fast lunch but really just not that great."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGeVN6TnBNbWc1ZHpsSVpGZHNRWGxaVjJKckxYYxAB",
            "text": "Excelentes! Nuestro lugar favorito en La zona, las alcachofas fritas son extraordinarias"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VeE4yZERiVXh4UVhWdlkwTlpOV05OTlV0eFVFRRAB",
            "text": "Shame we couldn’t actually try the food. Sat at table waiting for service for over 20 minutes with no menus or water. We did remind them but to no avail."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OaGFsRXpjVGRGWTJGaE5sOUdkMnRYVFRkQk9WRRAB",
            "text": "great pasta, delicious wine, great service, lovely atmosphere. my parents occasionally stay at the Hotel on Rivington and this is a perfect casual dinner spot when they do, just a block away. When I didn't like a side I ordered, I was consoled with an extra glass of wine on the house, and consoled I certainly was."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3emFpMVJTRGxXUmsxb2NraFBXakZRUmtOb2FXYxAB",
            "text": "It really surprise me, really tasteful."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prNGMwOHRUSEEzYjBGSFJtNVRjRGgxYzNGb05VRRAB",
            "text": "Cute place with outdoor dining, but very slow service, even though it wasn't busy."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdlMyODRWbXBRVDBSV1YydFBia2wyUm5CdWFtYxAB",
            "text": "It's just like the one in Rome. The food is delicious. The atmosphere is welcoming and friendly. I recommend for anyone who likes Italian food and Pizza. A real good original food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKelJHbHdOVWd4ZFRkTFExOUJSV3R3U0ZseU1sRRAB",
            "text": "After waiting forever for hot sauce this is what the waitress  brings me ...  After giving my advice to never offer hot sauce that's almost empty,  she responds \"but it's still good \" smh !!! 🤦‍♂️ 6-10-25"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOM0RfdER5ektDVERnEAE",
            "text": "The best of Roma in NYC"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLTFlyOGVqNjZESGx3RRAB",
            "text": "Excellent food and service. Recommended 💯"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJWDRncVN6M0tTT1B3EAE",
            "text": "Awesome atmosphere and even better food. Especially good for a lunch."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJSDZxckRhLWZtOXN3RRAB",
            "text": "Went for dessert after leaving Close Up Jazz club up the street. Exactly what we wanted. Olive oil cake was perfection as was the chocolate tart. Quick & welcoming service. Got espressos and wine, too. The other diners’ meals looked so good- will be back for dinner or lunch. Cute atmosphere."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNQ1ZscHpsanZMMGR3EAE",
            "text": "Wine was good, olive oil cake was good, Luis was great!! Ragu pasta could use more meat tbh"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMN0d4b1BPbjdHVEVREAE",
            "text": "Get an espresso martini and be prepared to talk all night with your friend. That's what happened to me. And the olive cake."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKbmNqLVgwODUyaWJnEAE",
            "text": "One of my favorite restaurants in NYC! My go to dishes are the eggplant parm trapizzino, the broccolini, and the orange wine! Always a fun and tasty experience!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKLUQ0TGkyeE9LV1JREAE",
            "text": "Fantastic! You might get a little messy trying to eat it, but boy does it hit the spot! So authentic, so delicious, and not even that expensive!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQYTA5Njc5ajlfM0hREAE",
            "text": "We walked in and it smelled like cleaning products. Ordered 2 espresso martinis and a tiramisu. The drinks were watered down and the tiramisu had a weird taste to it, I’m assuming they stored it in the fridge next to cheese or something like that. After a couple of sips, I realize that I’m not going to drink it and it’s the worst espresso martini that I’ve ever had in my entire life. I politely asked the server to remove it from our check. The sassiness that I got from him? Oh my God. He started arguing with us and told us how he was losing money because of us, also suggested that we go somewhere else next time, and we will!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VNZThnN2Jnakp6U0ZBEAE",
            "text": "Certainly did not meet my expectations. From the food to the service, everything was underwhelming. Overrated.\nWe ordered trapizzino oxtail and meat ball, they were served very late: the portions are so small and the oxtail was bland, the meat ball was okay."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VONjh5ODNEeXBhVGNBEAE",
            "text": "Lots of flies buzzing inside while we were eating which didn't make for a great environment. Almost $10 for a small trapizzino felt too pricey."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMZnBrY2JzbXEyOEl3EAE",
            "text": "The food was very good; I got the Eggplant Trapizzini and the pesto pasta with the lunch special, which was a great deal for getting to try a lot of food. The service was also great too! Def try the olive oil cake!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNaVc2b2lTeGNTSVBnEAE",
            "text": "I stopped by while out enjoying my Saturday and luckily grabbed a spot outside (it’s usually pretty busy!). The trapizzino, a triangular Roman-style pizza pocket stuffed with classic Italian fillings, was unreal. Proper comfort food. I’d give it a solid 4 stars.\n\nIt’s a great spot for a quick spritz or to cozy up with a few small dishes and soak in the vibe. As night falls, it really gives those Italian café feels. Definitely worth a visit if you’re nearby!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdmUyRkdnEAE",
            "text": "Very good food, cute atmosphere.\nI am taking off a point to make aware of a dinner combo that makes no sense. $30 for Trappizini and 1/2 Pasta. The combo does not make it clear that it is a 1/2 Pasta. Ordering a Trappizini and full pasta would also be about $30 or less in some cases and you would get more food. Very bizarre decision by management.\n\nOur server was very lovely and comped our bill partially to make up for the confusion. So if you come here, don't order the combo, just order the items separately.\n\nI got the Pesto pasta and Oxtail Trappizini along with broccolini to start (very good)."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvejhqY3ZRRRAB",
            "text": "Had a trapizzini very flavorful but small. Tables are small. Service could be a bit more attentive."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveVpuT2p3RRAB",
            "text": "The food is good, especially the rice ball."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNva3ZXSExBEAE",
            "text": "Great option for a quick spritz stop or just to cozy up with some dishes to whet the palatte and enjoy the atmosphere. Gives italian cafe vibes especially as night falls."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNzYyYlJREAE",
            "text": "Delicious, unique food for reasonable prices. So comforting and filling."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaTZudFl3EAE",
            "text": "Cold spring drizzling Saturday afternoon, cozy place to get hearty food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOGNxbU1REAE",
            "text": "Great food, drinks and service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMnBmNU53EAE",
            "text": "Just stopped by to get a quick cappuccino and tiramisu.  Service quick and attentive.  Cappuccino delicious and tiramisu twas tasty.  Will definitely try to come back for a meal"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3alpEaVF3EAE",
            "text": "Ended up here while waiting for a table at Russ & Daughters nearby. We stopped in for some coffee and small bites while we waited. Oh man, I wish we were hungry enough to go back afterwards. This place was one of the best food experiences we had while in NYC. Coffee was outstanding, desserts were fantastic (particularly the olive oil cake), fingerling potatoes were perfect, and the Cacciatora Trapazzini was out of this world (my picture doesn't do it justice; it's a small handheld sandwich). If I ever returned to NYC I would go here in a heartbeat and wished I had more time to go back on my trip."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREeXZEYnVRRRAB",
            "text": "Started with risotto ball, it was average. Continued with ox tail sandwich, it was very flavorful. Pasta wasn’t on lunch menu, but chef obliged. Pesto was great! Ended with Espresso Martini."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURic1lXSDl3RRAB",
            "text": "Mmmm, Roman street food. Crispy focaccia stuffed with savory fillings. I love when my food comes in pockets.\n\n- Pollo Alla Cacciatora: For the \"white sauce\" lovers in your crew\n\n- Polpetta Al Sugo: A meatball worth remembering\n\n- Doppia Panna: Unique, tart and savory\n\n- Coda Alla Vaccinara: Probably the best of all the trapizzino, IMO, because that oxtail melts in your mouth\n\nFor apps, you can't go wrong with the Slow Cooked Broccolini or the Marinated Mushrooms.\n\nSo why the 3 stars? Our server screwed up our order and ended up putting in for 2x the trapizzini we asked for. They kept arriving piecemeal in one long tray after another, and we got so overwhelmed trying to fix things, that we ended up just throwing up our hands and accepting them all. But we weren't thrilled about paying nearly double for what we had planned to get.\n\nAlso, they need to stop being cheap and just turn on the damn AC. I basically melted into my trapizzino."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBc2ZMdEhBEAE",
            "text": "Ohhhh yesss! European service in American. It's absolutely awesome.\n\nI was traveling solo and in my first 48 hours. This was the first one restaurant that actually engaged. I applaud that. The staff were the best I encountered in New York.\n\nHaving eating trapizzino in Milan and Rome. I can confirm this place is just as good! Missing the warm Italian sunshine, but then again, I did visit in February.\n\nIf you haven't tried it before or have had it before. Add trapizzino to your wish list for NYC."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOE9qZ0R3EAE",
            "text": "My girlfriend and I were waiting on a reservation at Russ & Daughters so we sort of stumbled across this place. We tried the ricotta toast with pistachio and honey, and the espresso.\n\nEverything was great, and the location was a nice little spot near Beastie Boys Square (before the scaffolding went up)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0MWJISEN3EAE",
            "text": "Portion size was disappointing I would’ve been hungry if my girlfriend finished her food, the food was average, a bit pricey, however service was fast and drinks were good.\n\nThey need to improve on portion sizes, because if you disappoint new customers how can you expect to keep them around. The restaurant business model is based off of keeping old and new customers satisfied and happy, not infinite growth or constantly new customers."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwM2NyX3NBRRAB",
            "text": "We visited Trapizzino, which is famous for their trapizzini, randomly. The decor & ambiance is adorable and cozy.\n\nBoth appetizers we had were delicious. We got their signature Trapizzini and Classico Suppli.\n\nTrapizzini is authentic street food from Rome. We had braised oxtail and it was flavorful with tender texture.\n\nTheir Classico Suppli was impressively satisfying. It’s too good to only have one order with its crispy layer & cheesy and flavorful filling."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURta3RUbXlBRRAB",
            "text": "This is a lovely restaurant in The Lower East Side.  They serve Italian Street Food in a beautiful setting.  The music that was playing transports you to another place and time.  I had the Ricotta Toast which was absolutely 😋.  I drank a Peroni which is an Italian Lager.  The service is very good.  The waiter was super attentive.  The prices are very affordable which is rare these days especially at such a nice restaurant.  I plan to return and try some more dishes."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPMGRDaHdBRRAB",
            "text": "Awesome sit down spot for Italian street food with a great happy hour deal. The meatball and red sauce trappizinni (filled dough pocket) was dope, and so were all three types of arranzini. The special and cacio e pepe were the best rice balls. Solid Negroni too. Definitely coming back!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwaHFtNzNBRRAB",
            "text": "Surprising and offbeat Italian place with a unique menu. The main 'trapizzino' option is a sort of sandwich/pizza hybrid and perfect for someone who wants the flavor of a great pizza without the scale. They also have a deep-fried risotto option which is definitely worth trying. Great for sharing and very reasonably priced."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMzZTaDJRRRAB",
            "text": "Great place in NYC! I didn't know what didn' know what trapizzinos were prior to my visit but was pleasantly surprised. Picture this: fluffy, freshly baked almost like pizza dough pockets filled with the most mind-blowing combos of fillings you can imagine. I'm talking meatballs, gooey mozzarella, zesty tomato sauce—pure bliss in every bite.\n\nNow, the vibes at Trapizzinos are cool and relaxed. It's not a fancy joint, but that's what makes it so darn awesome. It's like stepping into a bustling street food stall right in the heart of the city. The staff is super friendly and always ready to dish out some killer recommendations if you're not sure what to try.\n\nOne thing that sets Trapizzinos apart is their commitment to top-notch ingredients. You can taste the difference, my friends. The dough is light and airy, and the fillings are so dang flavorful.\n\nThey've got a few tables inside, but if those are taken, you can grab your trapizzinos to-go and find a cozy spot outside to chow down."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNROF9qeWd3RRAB",
            "text": "Cute little wine bar w/ yummy small plates- lentil soup, salads, pizza pockets, crispy rice balls, pastas, desserts & coffee"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNTdub1dBEAE",
            "text": "The coffee was fantastic. The food was delicious. Evelyn our server was super nice and professional."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NHBMV1RREAE",
            "text": "I stumbled across Trapizzino after a gym session and it turned out to be a hidden gem in Lower East Side. This Italian restaurant specializes in Roman street food, which is a refreshing change from the usual Italian fare found elsewhere. The atmosphere of the place is perfect for a cozy and relaxed dine-out experience accompanied by a glass of wine.  The food was excellent, and a good value for the neighborhood. While dinner and drinks in the East Manhattan area can add up to over $80,  most food items on the menu are under $15!\nI ended up  trying an appetizer, their signature trapizzini and rigatoni, for under 45$ including tip. Not bad at all for a three course dinner."
        },
        {
            "date": "10달 전",
            "language": "pl",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MGZYelFBEAE",
            "text": "Nie twierdzę, że jedzenie jest złe, choć nie jest też niczym szczególnym.. Natomiast porcje są ŻENUJĄCO małe. \"pizza pocket\" za 10$ są na trzy kęsy to kradzież. Ponadto mięsa nie ma w całej porcji, a jedynie posmarowana odrobina na górze.."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4bUw3Tkl3EAE",
            "text": "Heard a lot about this place since it makes unique sandwiches. The braised oxtail sandwich was delicious minus the small bone that I almost broke my tooth on. Other than that it was a delicious sandwich. The bread was the star of the show. It was a cross between pizza dough and a roll. I want to try the other sandwiches when I come back. Cool spot."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyM0tpZmt3RRAB",
            "text": "Best Italian street food I’ve tried. My favorite is Coda Alla Vaccinara, which is 9 hours oxtail wrapped in soft but firm pizza bread. The Suppli risotto balls is a must try too."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPaU5TX2lBRRAB",
            "text": "This is my one of my favorite restaurants in New York. So classy and understated. I’ve taken friends here and for dates. The food is also flavorful and enjoyable. Customer service is amazing."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVc0p5MEJBEAE",
            "text": "I wasn't sure if the New York location would be able to live up to it's Roman counterpart. But I was pleasantly surprised! This place is just as good as the original. Great atmosphere, friendly service, tasty wine, and absolutely delicious Trapizzino's. I will be back (often)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUczRIdXhBRRAB",
            "text": "I don’t understand the hype. It was edible, but not delicious. Nothing special. I sat at the bar and the service was meh."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsb3FmTEF3EAE",
            "text": "Got take away - food was tasty though portion size is on the small side, broccolini needed maldon. Service super friendly"
        },
        {
            "date": "2년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1bVBIQzJnRRAB",
            "text": "Wow 🤩! Juste wow 🤩! Petit restaurant. Le vin 🍷 et repas excellent! J’approuve. Belle soirées entre amis. Le service est très bon! Bravo 🙌!"
        }
    ],
    "reviews_count": 72
}