{
    "name": "Crispiano",
    "place_id": "ChIJiSTpMuZZwokRkqSExdmSAyg",
    "grid": "MN3",
    "address": "130 St Marks Pl, New York, NY 10009, USA",
    "rating": 4.6,
    "user_ratings_total": 258,
    "phone_number": "(646) 368-1103",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0aWFITnBiV2xUVnpsclEyMWFjazVtVFZaRGJXYxAB",
            "text": "Crispiano is my favorite restaurant in the east village! The food and drinks are amazing, and the atmosphere is so incredible. The staff make the vibes of the restaurant everything I’ll never stop going!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poUlpXTkJiRjh6VHpGNlpVaDFObnBPZHpBek1VRRAB",
            "text": "The best customer service in new york city! All the drinks are great and food is delicious."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoVFVrTm1lSFZGY2tkZlFUaEdSVU10UkU5dk9IYxAB",
            "text": "Great place, ambience and super nice staff!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4NFVXVkxOWE5IZHpoNVNHaFJiR3N3VFd0emJFRRAB",
            "text": "DO NOT GO TO THIS PLACE IF YOU WANT TO BE YELLED AND PUSHED BY A BRUTISH MIDDLE AGE MAN.\n\nWe saw an empty table outside and walked up to the waiter he said it was ok to sit down, only he needed to clean the table. It was 3 of us and there were only 2 chairs and one of the waiters said they had another chair but the owner asked him to say they didn’t have any more. I could literally see two empty chairs stacked up that weren’t being used outside. When a table left, we grabbed one of the chairs and ordered our drinks and the owner comes and takes the chair right from under my friend while she was sitting and kept insisting it that there were no other chairs available. When we asked about the stacked up chairs and confronted the owner from taking the chair out from under our friend, he kicked us out, refused to serve us and pushed my other friend with his own hands saying we are not welcomed. I am so shocked that the service and at the fact that he felt so comfortable pushing my friend and placing his hands on her. If he doesn’t want to be accommodating and is not able to regulate his own feelings, he should not be working in hospitality."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aeFQwNW5OM3BXU2kwek5GUlJNakZsWDJVeE5IYxAB",
            "text": "Waiter was MEAN and PUSHED my friend unprovoked. Do not come here unless you want to get yelled at by an angry old Eastern European man."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSUVVGQktRMk5HVFdoQlJsZzVUbmQxTXpCRmRFRRAB",
            "text": "Great service, thanks to Art personally."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sZlMyeDFORGx1Y3paclpXcDNXbnAyWVc4MUxVRRAB",
            "text": "Horrible all around. There were ants in my food. I’m highly suspicious of the hygiene of the place. The service was also poor - our appetizer was brought out well after we finished the mains."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGMlRYbzBlSEF4TlRjMFdGaERlRkJFYXpsWlluYxAB",
            "text": "food was pretty good but we got sat outside even tho we reserved which wasn’t great"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kweFRGaFZWRU14TUdWWmJWcEplVzVaV2xFMlFVRRAB",
            "text": "Really, really unfortunate.\n\nTo start, they sat out party of five at a four top, and asked our poor friend to squeeze in between our table and another's...\n\nWe were then moved midway through our meal, right after we had ordered another round, to accommodate another party of 6.\n\nDuring the moved they were very gruff and starting moving the tables before we had all gotten up, banging our friend in the foot.\n\nEven after that, while finishing our last round, and a friend was still in the restroom, the server tapped the table and asked us to go to make more room.\n\nThe whole experience was so sour, and after letting the staff know that we weren't very happy with the level of service, we were told that there was some kind of permitting issue with their outdoor dining section, and so had to mismanage their bookings rather than rebook or cancel...\n\nThey said that the issue was the week prior, but we made our booking the night before... They were super upset about it and just tried to say it wasn't their fault. At no point were we impolite or trying to be rude. The whole situation was very very disappointing, and clearly poor decisioning on managements part.\n\nThe meal itself was lovely, but the entire experience turned out to be exactly the kind of night you don't want for a dinner with friends."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pST1ZuWmxlbGx1TlZjeU4xcElZVVIzVjNWUlJIYxAB",
            "text": "Lovely place however was charged for an ENTIRE BOTTLE OF WINE when we just ordered off the happy hour menu. Called immediately after, called again a few days later to get our money back. He said to come in person the next Week so we did. Wrote a note down for the manager with our number & name. ZERO RESPONSE. Nasty… stop stealing peoples money thanks!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNM09IbDRWek5zVlY5T1p6Vk9Wa3hvYVhwbFdsRRAB",
            "text": "We rented the space out for a private party and the Staff and drinks were phenomenal!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OellYUkVYMU0wTVVaTmExWTRZbFZEUTI1VWVXYxAB",
            "text": "The Table Seating: 0/5\nMy friend made reservations and we weren’t seated in a regular table, we were seated on bar chairs, which we didn’t mind until we found that the tiny plank of wood of a table wouldn’t fit all of us. The workers there didn’t seem to have expected us and crammed us at a small table seeming to hold 2-3. Why do I say that? My friend was sitting at the end of the table, which was the only walkway in the tiny restaurant, it was a fire hazard and no one could past comfortably within them getting up and moving. Nothing on the workers, they were great, the restaurant shouldn’t have let us make a reservation if there were no seats available.\n\nTemperature: 0/5\nIt was hot and sticky, even the dive bar across the street was colder. My friends and I were touching arms, so there was even more body heat, I even used the menu to fan myself but obviously there was no room to place it on the table and was taken away.\n\nFood: 3/5\nPizza was good, not enough sauce for one of the pies. Wish I could describe it more, but I was hangry at that point and it would’ve been more enjoyable if there was even room to put the dishes of food on the table, but there wasn’t so we were forced to scarf down the dishes to make room for the others because the waitress was just standing there with the hot food.\n\nDrinks: 2.5/5\nIt was okay, average, nothing memorable.\n\nExperience: 1.5/5\nWould not come back, it was so hot and I usually do well with the heat and humidity, but this was excruciating. Not sure if the AC was on, but the doors were open so if it was, it was all being let out. Also, I will say the restaurant seems to favor larger party’s more than smaller party’s, we asked to sit at the tables but we told we couldn’t but there was room even when we left. All in all, wish we had a better experience here, we had high hopes."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aelVsbHlRM0UxUkV0Zk5EazNhelJETlc5d1UwRRAB",
            "text": "Great vibes but atrocious food. Bruschetta came out on pita like bread covered by a soup of tomatoes. Carbonara had no taste and was filled with oil. Worst Italian food I’ve had. Absolute baffling this place has 4.7 stars. Most overpriced scam of a meal I’ve had in the city. Worse than tourist traps, this place just sucks in people who want the vibe and glam of a cool spot on St Marks."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVWNFaG1YMHR4YVRoTlgyUXdjMjFhYjFKck0yYxAB",
            "text": "Maybe I ordered the wrong thing but margherita pizza was a little dry and the crust tasted like ash."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMWEZrS1BacWRUNUJ3EAE",
            "text": "Cozy atmosphere, amazing pizza!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvOGZfeWJnEAE",
            "text": "So much fun! Kinberlin, Mina, Meryem are the best! Definitely go and sit at the bar! Cant wait to come back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcnVlV3hnRRAB",
            "text": "Good food but it's too loud"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvanFIa0N3EAE",
            "text": "Very tasty pizzas! Great service! Highly highly recommending"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeUtmTkxREAE",
            "text": "My boyfriend & I came last night for an after dinner drink - We thoroughly enjoyed the focaccia bruschetta and the mussels with white wine sauce. The mezcal cocktail was tasty. Service was friendly and warm. Thank you!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOWFDTXR3RRAB",
            "text": "Great spot in East village for some amazing cockatiel and great pizzas and pastas ! Went here with friends and we had an amazing time! The atmosphere is fun and lovely and the service is great! We ordered some of their highly recommended items and did not regret it! Diavolo Pizza and the Ravioli were my personal favorite in addition to their delicious cocktails.\nCan wait to go back for their happy hour!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbHFTdXNnRRAB",
            "text": "We only wanted something close and convenient, and thus we found this wonderful intimate Italian restaurant. We only had a few glasses of Chianti and pizza... both were delicious and worth returning to try what we really wanted. Two things made our dining experience incredibly memorable... first, was Merissa, she was delightful, full of thoughtful recommendations and just a pleasure to be around.  She really made the evening a night to remember! Second... there was nice young man in his mid twenties that we began chatting with, but nothing particularly engaging given our distance from the bar and the people around us. He offered us slices that he couldn't finish, and we did the same when we couldn't finish ours... it was just a fun local restaurant experience. We wanted to introduce ourselves, but he had already left. When we asked for our check, we learned that this young man \"took care of the bill,\" and we had no way to thank him... he wasn't local to the East Village, and we'll never know. We experienced humanity at its best in New York that we will always be thankful. We are truly blessed! Thank you again, Merissa!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJb3FQLXFnRRAB",
            "text": "I had a birthday dinner with 8 people and it was the best time! We did the Prix Fixe and it was so much food and all so yummy! Would totally recommend. Best birthday ever!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbE1XQ2Z3EAE",
            "text": "I hosted a birthday dinner with 15+ people and had the best time! The service was great and they were very quick with anything we needed. We did the prefix option and they came out with so much food it was great! Everything was super fresh and tasteful. This is a great restaurant to book for a night out or group dinner."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bzhuWmpRRRAB",
            "text": "if you want happy hour drinks, then sure go here even though it takes a minute but despite the online menu and social media there is no happy hour for pizza which is super disappointing"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aUtudHdnRRAB",
            "text": "Artan was awesome! He was so attentive to the dietary restrictions of our table and made sure we were well taken care of. We will be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ME11MURnEAE",
            "text": "To start off our server Artan was warm and accommodating!\n\nOur table shared the mussels, which were so fresh and full of flavor.\n\nI enjoyed the mushroom pizza, the margherita pizza and the bolognese! The pasta is homemade and you can tell.\n\nI highly recommend this Gem for lunch or dinner if you’re in the area. We will definitely be back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3LVlUVEFnEAE",
            "text": "Tartan was the best server ever! I loved the environment and the food/drinks were amazing! Coming back and telling everyone about this place :)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MElDb2ZnEAE",
            "text": "Wow! Tim, Niko, Artan and Henry are amazing!! Hosted our monthly company party, Great prefix menu!! Amazing spot!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbDZyemdRRRAB",
            "text": "We went for dinner and had the best dining experience. The staff was very friendly and attentive, our glasses were never empty. And the food was amazing.  The eggplant was hands down the best I ever had!  It was so tender and full of flavor.  The mushroom pizza was equally exceptional.  I will definitely be back for more. 10/10 recommend."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRX0l6ckdBEAE",
            "text": "Interesting eatery in East Village. We were in neighborhood and stopped in. The eggplant appetizer was exceptionally good. The pizza was good, but I want to go back to try more on the menu. If the other dishes are anything like the appetizer we had it will be impressive."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNUwyWmRnEAE",
            "text": "Do not go here. Absolutely no reason to. Reservation wasn’t ready on time, had to wait 25 minutes. Food is was exceedingly mediocre. They double charged us for our my beers (kinda our fault for not checking first but still :("
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRN01YUUZ3EAE",
            "text": "Honestly this has become my go to spot every sunday. 0 complaints, phenomenal food and service"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRN05xcG9nRRAB",
            "text": "Me and 2 friends arrived to an almost empty restaurant, and immediately ordered a bottle of wine. We ordered food and apps shortly after. Food took 40 mins, and they forgot 2 of our dishes. We reminded them multiple times, and received all our food an hour after ordering. The carbonara was the gross, no one at my table wanted it, and we left without eating it. Meatballs were dry, tomato sauce was watery, and oven pizza was soggy and undercooked. This was my second and last time here , and both experiences were bad, as they forgot my order both times."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRcElySnBBRRAB",
            "text": "Pretty horrible experience and this was the second bad experience back to back. The first time was a pick up order the system had messed up. They fixed it and i understand technical issues can happen so not a big deal. Came back about a month later with some friends for sit down dinner and were treated poorly the whole night. They messed up 2 entrees, had to remake one of them which took over 30 minutes for that item to come out. One dish was so bad and we wanted to send it back. At the end they never asked how our meal was, came to check on us, didn’t refill the bottle of wine, and we had to flag them down just to pay the bill and get out."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnaFlTd0dBEAE",
            "text": "Lovely experience, Artan was a lovely bartender - great night out & evening 💗🤗"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBallpaFRBEAE",
            "text": "I celebrated my birthday in January at Crispiano and it was literally one of the best birthdays that I’ve had! I did a private rental of the space that included food and an open bar. The food was amazing and there was more than enough to accommodate my group of 25. The drinks were crafted beautifully (Thank you so much, Kim!!!)! We were able to connect to the sound system and dance while eating amazing Italian food —I mean, does it get any better than that?! My guests were thoroughly impressed. This wasn’t even the best part of my experience! From the hospitality that Harry showed through the booking process with answering my 10,000 questions and making sure I felt comfortable in selecting the restaurant, to the AMAZING AMAZING Artan who treated myself and my guests like family during the event and made sure the night flowed seamlessly - I cannot thank you enough!! Everything I thought of, Artan was already in the process of handling. As an event professional, it is very rare that I am wowed but Artan, Kim, and the team at Crispiano managed to do that. I will not only be back, but I am also thinking of other events that I can host here and I suggest you all do the same! Thank you Crispiano, for making my birthday one to remember!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMGY3UjdRRRAB",
            "text": "Arthan is the best server I’ve ever had. Best place I’ve ever ate at"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMS1ldkdREAE",
            "text": "I went yesterday for my birthday and the staff was very accommodating"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOVp6aGhnRRAB",
            "text": "Placed a reservation via Resy with this restaurant on our recent trip to NYC.  We arrived at the restaurant only to be told by a rude server that the restaurant had been fully booked by a large party and that we needed to find another restaurant (in NYC on a Saturday night).\n\nWhy allow online bookings when you are full?\n\nOne to avoid."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmc3BpdHhRRRAB",
            "text": "Was craving pizza so my bf & I had to stop in for some slices! So goood! We also ended up ordering their bruschetta, spaghetti & salad which didn’t disappoint! The cocktails were strong too."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbk9EZTVnRRAB",
            "text": "I went to Crispiano with two of my friends and it was the perfect spot for good food, good company and amazing drinks. The food was fresh and extremely tasty, and one thing was honestly better than the next. My favorite was probably the burrata and the vodka pizza. The bolognese was perfect too. The atmosphere was cozy and fun, and we had an amazing time. The owner was so welcoming and I will definitely be back soon!!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmN00ySXFRRRAB",
            "text": "This was the perfect cozy restaurant in the East Village for delicious and well priced food. We had amazing service and the food was awesome and a great portion. Would definitely recommend this spot to anyone looking for comforting Italian food without breaking the bank!! And amazing happy hour deals!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2emJlekFnEAE",
            "text": "Thoroughly impressed! Out of our entire trip to NY this was the only place I felt compelled to review. We had the margarita pizza as an appetizer, did not disappoint. The smell of the fresh basil was an appetizer to the pizza itself. They had carbonara for my husband, a rare find. He nearly licked his plate clean. The penne in vodka sauce was cooked to perfection. The kitchen knows what they’re doing! Highly recommend!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MHBLNi1nRRAB",
            "text": "The gnocchi is delicious, not to be missed!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQb2QzOVh3EAE",
            "text": "The food was great. Starting from the pasta and pizza - all the food was great!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQb2EycVhBEAE",
            "text": "the food—simply divine! The pasta is clearly made fresh in-house, with each dish bursting with authentic flavors. I tried the vodka burrata , and it was rich, creamy, and cooked to perfection. The tartufo pizza had the perfect crust—crispy on the outside, soft and airy on the inside, with just the right amount of cheese and sauce."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQM3MtNklBEAE",
            "text": "Great service from the waiters, missing a few heaters for dining outside"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYaWJfZmJnEAE",
            "text": "Seriously good Parmigiana, great vibe, friendly staff. Small, cozy spot with a great funky soul playlist. Love it!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuNDd1QUxREAE",
            "text": "A really good spot to get together with friends for drinks and food. They have a really nice outdoor sitting area and very cozy indoor also. Aperitivo hour is a must visit; great choices and great prices. Erik is there to take great care of his customers and he has a vast knowledge on cocktails if you need any recommendations."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucmNlc3F3RRAB",
            "text": "I’m back at Crispiano, and it never disappoints. The pizza is one of the best in the East Village, and they’ve recently introduced new cocktails to the menu: exceptional. The service is super fast, and the staff are really friendly, making you feel right at home. I can't wait to come back! Highly recommended"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINHBXcUlnEAE",
            "text": "Very good fried calamari. The pizza and bruschetta crust were tough. They make a good mojito, but the lychee martini wasn't balanced. The arugula in the salad and garnishing The dishes was yellowing. The kids enjoyed their pastas. The service was earnest but uneven."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0M3Azbmd3RRAB",
            "text": "Amazing food! Best steak gnocchi I have ever tried! Service is great, the ambiance is very chilled. The pomegranate spritz is 100% great!  The chef amazing! Definitely will be coming back I recommend you to come here. Oh and let me not forget to mention the Nutella pizza and tiramisu!! Obsessed"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdzVxd2RBEAE",
            "text": "Great service and upbeat vibe. Went on a Saturday and the whole street was blocked off to give more space to the shops on that block. Absolutely recommend. Wouldn’t given it 5 stars but the pizza took quite some time to come out and it wasn’t as crispy as I’d like it to be. Otherwise, everything was great!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4aGZ5TG9RRRAB",
            "text": "All of my dreams have been answered with this immaculate authentic Italian place in East Village. Incredible atmosphere and AMAZING PIZZA. Better than we had in Italy two weeks ago. Low key vibe, just walk in. Great outdoor vibe. Highly recommend 10000/10 💘💘 chat with the owner Gent if you’re lucky such a nice guy 🙂"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0eEktUDV3RRAB",
            "text": "Loved this spot! Highly recommend for a large group dinner - there is a $70 pre-fixe with unlimited wine and beer or $85 one that includes aperol spritz\n\nThe music is fun and the atmosphere is super lively! The service was great and the food is delicious. Pre-fixe includes 2 apps, a salad, 2 pizzas & 2 pastas. GF options available as well"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKM3RIQi13RRAB",
            "text": "A 10/10 dinning experience 👌🏽\nWe were visiting NY and a friend urged that we go try this Italian wine bar, and honestly it was such a vibe! The atmosphere, energy and the reminiscent music put us in the best mood from the moment we walked in. The gnocchi and sweet diavolla were to die for and the apperols transported us to Italy. The street they’re located on is so lively and cool and the staff offered top notch hospitality/service - from the busboy to the owner. Can’t wait to come back next time I’m in New York! Thank you Crispiano!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubGNDamp3RRAB",
            "text": "I had such a lovely experience at Crispiano. The food was delectable. My vegetarian friends had ample choices and decided to start with a scrumptious Kale & Avocado salad.  I had the Sweet Diavola pizza and Fettucine Bolognese, which was more than satisfying. This was followed by heavenly tiramisu. The lovely bartender Kimberly, kept my appetite going with a bevy of delicious Lychee Martinis and Negronis.  Overall the staff was very welcoming and attentive. And the music selection was a vibe. I am glad I found this gem in the East Village."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3eTRpV2p3RRAB",
            "text": "Delicious! We tried to Caesar Pizza which was on the happy hour menu and it was good! The vodka sauce was also delicious. Will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3Nk1xMFJREAE",
            "text": "I wanted to like this place, the pizza actually was very good, I got the 4 formaggio, but I just have a hard time giving my business to places that purposely try to deceive you. I ordered a glass of wine thinking it was $9, but apparently after 7pm it’s actually $13. For a very average Sauvignon blanc at that…still kinda steep regardless. The $13 is hidden in small print in the top right corner of their main menu. Wine is not listed anywhere else except their “happy hour menu” which is on the back of their regular food menu. Honestly it just felt sneaky and for that reason I won’t be returning."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwX09HLTh3RRAB",
            "text": "I dined at Crispiano on a Thursday summer night on their outdoor space.\n\nMy friend tried the arrabbiata pasta (tasty and spicy) and 2 of us got the pizza, burrata and funghi.\nWe also tried the bruschetta that comes on the focaccia bread instead of the regular bread, it was delicious.\n\nIncluding a beer and a wine we spent about $35 each"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlamVXX2tRRRAB",
            "text": "An amazing atmosphere coupled with incredible New York style Italian food. Great for the family but also would be perfect for a casual date night. A yummy assortment of Italian wines plus a fun cocktail menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucmVXWEJ3EAE",
            "text": "Originally stopped in for a quick beverage but ended up staying a few hours.  I thoroughly enjoyed myself.  The ambiance, great decor, the friendly staff... I lost track of time for good reason.  My cocktail wasnt bad as well.jk. I felt more like a 'partner' than a patron.  Definitely returning!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMUlleWJnEAE",
            "text": "This place is so good I want to gatekeep it but I’m sure everyone will find out about eventually. Food was way above expectations - the red sauce was some of the best I’ve had in NY. Happy hour spritzes were delicious and crazy cheap. I hope they don’t change things."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPelBPR2pBRRAB",
            "text": "LES’s new hidden gem! This new pizzeria/restaurant packs quite the punch. Whether you order pizza, pasta, or any of the appetizers, your taste buds are sure to thank you. My personal favorite was the Tartufo pizza pie. The truffle was amazing! The atmosphere is perfectly balanced here so you can meet a date or a group of friends for a bite of pizza and some beer! Definitely my new go-to spot in the LES."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNocU55SERBEAE",
            "text": "The vibe here is unreal! Each of the owners work so hard to make this spot special. They are all very kind. The service is incredible— and somehow the food is even better!\n\nReally tasty spritz and wine options. Amazing wood fired pizza and ultra flavorful pasta options, among others. You won’t be disappointed with this local gem!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoajctMzdRRRAB",
            "text": "Food: 3,5/5\nService: 4,5/5\nValue for $: 4/5\n\nThe pizza dough was great. The Penne Alla Vodka lacks any real flavor and is, as a result, unfortunately very boring. The bruschetta should be prepared much earlier. Right now it's just quickly thrown together pieces of tomato on focaccia bread - would much prefer a more original recipe to this."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPd1lueXdnRRAB",
            "text": "This place just opened up and we were not disappointed! My boyfriend and I got the Margherita pizza, Tartufo pizza, and the Caesar salad and everything was so good! We got take out but the pizza still had crunch to it. The pizzas are personal (~12\" or 8 slices each) but two pizzas definitely filled us up and we still had slices left over. Not to mention the staff was super personable and attentive. Definitely will be back soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOalpITm9RRRAB",
            "text": "It's a decent pizza/pasta spot. The best is the pesto because they use a very fresh pesto and heavily slather it on the pizza. The other pizza was good too. The dough was not the classic neoplotan style pizza  and no charred taste but the pizza didn't a huge \"flop\" factor which was good. The Arrabbiata pasta was average, the sauce was good but Arrabbiata isn't traditionally a challenging sauce to perfect and the pasta itself was giving barilla."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaa2JmSGpRRRAB",
            "text": "One of the best spontaneous meals we’ve had. Stumbled upon crispiano on a Sunday evening and we were wowed by the food, aperitivos and the great Fabio, who mans the bar. He has the most infectious laugh and is a great host, I highly recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNHU2WTl3RRAB",
            "text": "Incredible pizza 🍕  in NYC with a vibrant atmosphere. Drinks, appetizers and pizzas were all very good. Everything is fresh and has lots of flavor. Nice place to sit down for pizza."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bzlIeENBEAE",
            "text": "Me and my friends are always looking for happy hour spots to go, and this place is perfect. Great deals and great drinks. The service was AWESOME. Luks and Sebastien were AMAZING. I’m obsessed with them. We always felt properly checked in on without feeling interrupted. 10/10 will definitely come again."
        }
    ],
    "reviews_count": 71
}