{
    "name": "Il Posto Accanto",
    "place_id": "ChIJKzk6b4JZwokRJFfnxFnxV4Q",
    "grid": "MN3",
    "address": "190 E 2nd St, New York, NY 10009, USA",
    "rating": 4.6,
    "user_ratings_total": 559,
    "phone_number": "(212) 228-3562",
    "reviews": [
        {
            "date": "12시간 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WYVZHRmpTWEpEVEU5VFJFc3RhVkIyTlMxS1NHYxAB",
            "text": "food was good, but small portions for the price. would return for the tiramisu"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSamRHd3RiRGhzZFU1cU5ucFFXVFZ0TVRoTFRHYxAB",
            "text": "Just went again for the first time in a while was previously my favorite but we just had a lamest most under seasoned over cooked food. Every time I go in I have some weird passive aggressive interaction with the owners husband but Ive continued going for years it was very disappointing"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201S2RTMVVTSGRTYld4eVVYbFRiM0V4YnpOS1NIYxAB",
            "text": "Quiet and lovely little restaurant with wonderful fresh pasta"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRFVuTkJUVnB0TldjNFZtNUVSSGhGVFdsSmVFRRAB",
            "text": "This was recommended by a friend, absolutely loved it!\nDon't go there if you are looking for a fancy premium experience, but the food is great quality and the wine list is very nice.\nYou have to call to book which I found at first being annoying and bold for New York, but it also makes it very authentic.\nOverall highly recommended and I will be back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRNFJrTkRZbTlLTmsxNVYwOHpUWGwzUjI1YWVXYxAB",
            "text": "Thoughtless. If I had to describe my experience in one word, that would be it.\n\nI called twice, a week in advance, to make sure my best friends and I had a nice dinner to celebrate our brother’s upcoming wedding. When we arrived a few minutes early for our reservation, the “manager” casually told me there was no record of it and that another party of five was ahead of us.\n\nAt first, I thought he was joking. Who dismisses a customer like that? When I confirmed the phone number I’d called, even showing him my phone’s call log, he acknowledged it was correct but showed no concern, turning instead to chat with other patrons and staff. When I tried to have a calm conversation to understand what went wrong or how they’d fix it, he brushed me off, asking if I wanted to wait for a table or not, and that was it.\n\nBe aware!! This restaurant doesn’t take online reservations or provide any confirmation number or email. It’s literally call ahead and hope someone writes it down. Clearly, that system isn’t working!\n\nOverall, the manager on duty (a Black man wearing glasses) was rude, dismissive, and disinterested in resolving the issue or acknowledging their mistake. If you care about customer service or want any confidence in your reservation being honored, I’d steer clear of II Posto Accanto."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMlVHTmtWVzF5WVZaNGNuZzFNeTFNVG5aS1RsRRAB",
            "text": "The salad was great but the pasta was very mediocre. Small portions for the price."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214UGQwaFZWVUpQZDBRd01UaGFSbFZHTlMxc1ZGRRAB",
            "text": "Great dinner here last night. Food is deliciously rustic and unfussy with top ingredients, vibrant flavors & generous portions (market-sourced specials esp worth considering). Well-curated, reasonable wine list, too. A bit loud and tight, but convivial with a festive buzz. Friendly, efficient service and co-owner Julio is a great host. Just a terrific neighborhood spot... reservations recommended !"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toV1JsbHlWVEZQVjFNemIyTmpjWGwzWHpaVVVFRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nI’ve been coming to this restaurant for almost six years, and it never disappoints! The food is truly authentic — real Italian pasta made the way it should be. The atmosphere is always warm and friendly, and the service is excellent every single time. The owners are wonderful people who make you feel like family. It’s one of those rare places where everything — the food, the people, and the experience — comes together perfectly. Highly recommended! 🇮🇹🍝"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZeFlsUTVaakJKUkVGZlNVSnhYMFpvWlZsTVEwRRAB",
            "text": "We had an amazing meal last night. We sat outside and the weather was perfect.\nThe food was delicious and fresh and we will definitely return'"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWdlpteGZXR2R6VlhaWWRXdG5jMEZmVnpSTlNWRRAB",
            "text": "Oh my god. Some of the best Italian food I’ve ever had. Amazing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RMUxXMW9NVTh3UzNGV1lqZHJSVEp3YkMxaFVuYxAB",
            "text": "Yum yum yum!! A lovely authentic Italian spot in the East village with friendly staff and curated dishes. Highly recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWFVrMHROR3gwWnpSZmNtdHFNWEoyVEVKT1FsRRAB",
            "text": "Went with 10 friends for dinner - after we were given an extra order of calamari - which one side of the table started eating as we didn’t realize it was extra. Literally while someone was taking a bite off the plate the waiter came to forcefully remove the half eaten calamari. Not only did he take both orders off the table but he spilled the oil of one of the plates onto a guest. Their solution to first to gaslight us about what had happened and then the manager gave us a card of the restaurant and told us to bring him the dry cleaning bill.\n1. As having worked in the restaurant business for over 15 years I know that once a table starts to eat a dish they didn’t order the  restaurant leaves the dish for the table.\n2. Having a bad attitude about a mistake that the waitstaff made is one thing - but forcefully removing it while someone is mid bite is completely insane.\n3. And though, as the manager said “mistakes happen”, I do not think asking a customer to return with a dry cleaning bill is the solution that was warranted. Not that oil comes out of clothing at all.\nComping us for the calamari was the only additional action taken.\nHonestly I’ve never seen something so rude as and poorly handled. Shame on you."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21seE5XTk9jRmxYYm5kaWQzTkdTWG8yY0hGQlZHYxAB",
            "text": "Exceptional Italian food, good service and hospitable owner"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twZlFrTnRkRzh5VFVsSGVscGtiVzFQWm5kamQzYxAB",
            "text": "I had the absolute pleasure to dine with my best friends for my 25th birthday at Il Posto Accanto, and I could feel the love in every bite of delicious food from this beautiful restaurant. From my dirty martini to the squash blossoms, scallops, and lasagna - I felt my heart fill alongside my tummy as the night progressed. We felt welcomed and a part of the family. Thank you Julio and crew, and if you dine here - TAKE SUGGESTIONS! The food is picked and served with purpose🤍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SUU5XSlVWMWgwYmxCRlJraHFNMjlqVEdoR09HYxAB",
            "text": "I had moments of pure joy throughout my meal here. The establishment maintains spotless yet cozy spaces. Staff members provided outstanding service as well. All the food was remarkably good, presented perfectly and expertly paired. I encouraged visits to this restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4eWFqRXhUVEZmUkdaRFJFeHRUazQxTldsSWVsRRAB",
            "text": "Fell a little flat on flavor"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JelpWbDBOMFY2V0VSbmVuUk1NbkpRT1VZNU1uYxAB",
            "text": "This place is the real deal.  Pass by the gentrification Johnny come Latelys and try the most amazing calamari ever.  Got Kids? Best Meatballs in town.  Beatrice Cooks like Mama (If your mama was Italian) and Mayor of 2nd Street Julio runs the front of the house, and the rest of the nabe.  Skip the fancy places with expensive publicists and JUST GO."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWE56TlFUR05tUW1vM1UxOU9aVFYwY3pkT05WRRAB",
            "text": "I’ve eaten here three times, and all three meals were lovely. Interesting wines by the glass, many vegetarian options, and creative seasonal specials, including often a slow cooked pork or boar ragu. Service by a friendly and attentive team. Tiny, cozy; a neighborhood gem."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rMFZFWmthbEpMWlVSeWNFMUROR1ZCVlhaZlRVRRAB",
            "text": "I don't think I have ever enjoyed a meal in an Italian restaurant more than my meal at il Posto Accanto on Tuesday night.  It was fantastic!  The oxtail tortelloni, stuffed squash blossoms and grilled calamari were especially fabulous.  And the wine selection is terrific.  I can't wait for my next visit."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsVFdsWlpaVk5PU1Zac2VGODViVk5JUjBORlEyYxAB",
            "text": "Il Posto Accanto is such a gem. From the moment we walked in the atmosphere was warm and inviting, and the food is absolutely fantastic. Im still thinking about the fried anchovies appetizer. It was a highlight! Everything we tried was delicious, but what  really stood out though was the service. The staff made us feel so welcome, and the owner Julio came by a few times to check in and make sure everything was just right. That kind of genuine attention made  the whole experience special. Highly recommended!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJelJUQlBha1JDV0U1Slh6Wk5aSE5hT0U1b2JrRRAB",
            "text": "I had a wonderful experience dining here for a second time. The food was delicious, and Julio's wine suggestion was on point. I love that the menu changes often, which provides your taste buds with a different experience each time you visit.\n\nSituated in the middle of the block, you don't get any of the avenue traffic noise, even on a busy East Village summer evening. The restaurant has a great neighborhood vibe. If you come on the later side of the evening, be prepared to see the domino table set up and a nice, friendly game taking place between some of the regulars."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OUVVUbEJjSGt3YjJwVGRISXRUMFV5YUU5d1NYYxAB",
            "text": "Oh.My.Gawwwd.  This place feels like Nonna is in the kitchen putting her love into every dish.  The pasta was handmade, heavy and fresh.  The food was so delicious and authentic.   The selections are not basic and every bite makes you feel like you're eating dinner in Italy.  Dishes are truly a masterpiece and service was impeccable.  The owner came by several times and ensure we were happy and satiated."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oSldFWkNhV2RUY1RWamVVSmFRVWxSUzBFeldVRRAB",
            "text": "People seem to love this place but i was so disappointed. Posting so other diners are aware - they don’t have prices on their specials list and the prices are INSANE - $28 for 4 small sweet grilled peppers, same price as a plate of burrata with prosciutto?? I felt the sweet peppers was a deliberate attempt to price scam. Pastas tasted like airplane food especially the tortellini - don’t order those."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kVVVVaFpSekpFYm5CVE5uTmFUMVJ2ZEcwM1NuYxAB",
            "text": "Amazing service, INCREDIBLE meal, great atmosphere, can’t ask for more than that. Owner came over to introduce himself and was so kind. Will 100% be back!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMbWFtSXlBRRAB",
            "text": "Unsolicited advice by the owner! Ate multiple times at this spot. The food is good, the portions are small but delicious. The last time I was at the restaurant, I went to dine by myself and when I said table for one, I guess it’s the owner of the place who said I can sit at the bar counter. That was completely okay, but he offered advice saying - “why do you want to dine alone, you will sit there and later you will realize you are getting suicidal thoughts.”\n\nWhile I understand that sometimes restaurants cannot seat a single party at a table (especially during a weekend rush), shaming for dining alone is absolutely NOT OKAY. Not everyone who dines alone is lonely or sad. It’s 2025 and not sure when this perception will change!\n\nNot dining here again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMFFVdGZOV0pHTnpWNVZUUnNlalprYzBac1RsRRAB",
            "text": "Excellent Italian food. Will be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wU2JqWnNUbTQzY1Y5R05IQTRNV1ZsYlVOM1dIYxAB",
            "text": "Absolutely legendary place, been coming here for years almost every day! Pasta, salmon, chicken, bread — all is out of this world. Best food in the neighborhood! 🙌✨"
        },
        {
            "date": "4달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQMy13TUdtdnNlWV93RRAB",
            "text": "Il sapore delizioso di tutto ciò che mi hanno offerto da mangiare!!\nGrazie per la qualità eccellente, la gastronomia da santuario."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKVGl5cVNGdnNxMXRnRRAB",
            "text": "Delicious and great service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toRU4wOXBTRWx3YlcxcGNtbGhlRlZzYldwek4zYxAB",
            "text": "Worst Italian restaurant I have been to, service is horrible, I lived in Italy for over ten years I have never tried anything so bad !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZdFZsSXhhRzFLVkVKcWRuRjRjRlJsTURkUVVXYxAB",
            "text": "All foods I ordered were delicious!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQT1AxWldvak92ZXB3RRAB",
            "text": "Simply the best! From the carefully procured local fresh vegetables, meats, seafood to the excellent wines, Il Posto is hands down the best experience in the city for Italian specialties, wines, and all around fun! Go! You will thank me!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOZVFvTWpmcl9YSjRnRRAB",
            "text": "Nice ambient Italian restaurant food was good enjoyable"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKYVF1TVRUOWJYZlF3EAE",
            "text": "The best food I have ever had."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZM3ZEanNBRRAB",
            "text": "Cozy, Tasty, and Perfect for Last-Minute Plans\n\nIl Posto Accanto is a hidden gem that comes through when you need it most—especially for a last-minute group dinner. We walked in with no reservation and were seated quickly, which is a rare NYC miracle in itself.\n\nThe food is rustic and satisfying. Think simple Italian done right—perfectly al dente pasta, rich sauces, and quality ingredients. The small plates are ideal for sharing, and the wine list is full of great finds without the crazy markup.\n\nThe vibe is relaxed and unpretentious, with that cozy, neighborhood feel. Service was friendly, if a bit scattered at times—but nothing that took away from the overall experience.\n\nNot a life-changing meal, but definitely a dependable, delicious spot you’ll be glad you stumbled into. Would absolutely return—especially with a group."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZZ3V1SzZ3RRAB",
            "text": "Definitely a local gem, outstanding Italian cuisine"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMC1HQnNRRRAB",
            "text": "While there is no question the food was delicious, unfortunately not always enough. We were a party of three and while we sat for a little bit while enjoying a cocktail, once we placed our order things moved at a pretty good pace. Aside from several mistakes with our order (side veg. brought w/ apps., one soft shell crab instead of two, wrong pasta dish) servers appropriately tried to make amends. The worst was at the end of the meal when we were not only rushed, but insulted. We finished our two courses in a little over one hour, and were planning on having dessert, when the table was being hastily cleared and we were essentially being told that we needed to finish up and leave as people were waiting to dine. My companions were so upset they just wanted to go and finish our meal and evening elsewhere. The server was extremely apologetic and offered us an aperitif, but the damage was done. As if that was not bad enough, as we were leaving I made mention to one of the owners of the situation to which he told me that I was in the wrong and how I had 'stiffed' the waiter (I left 20%) and after calling the server to confirm he proceeded to apologize profusely, embarrassed that he missed it on one of the three receipts (I left the tip for the table). Shame on the owner for his lack of hospitality and terrible manners...and usually it's the food that causes one not to return!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMDRlYzBBRRAB",
            "text": "The fettuccine ragu was fine, but not enough to charge $30 for the entree."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvc3BPdWN3EAE",
            "text": "Basically the best restaurant in nyc, especially cos it’s not showy, the menu is funny, it’s been around for ages, and the cavatelli dish is so good. Shhhh"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNHFHX0dnEAE",
            "text": "The home of Bea . Hospitality like eating at your favorite relative. Never a mediocre dish."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMFlXbVh3EAE",
            "text": "Food was amazing!! We got the calamari appetizer, and the chicken and potatoes. Service was great as well. The waitress was knowledgeable about the menu and helped give suggestions. A little pricey but the food is quality so you get what you pay for."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ajVpcFFBEAE",
            "text": "Best pasta"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eVlyeGxRRRAB",
            "text": "Finally made it to Il Posto Accanto. Tucked away in the East Village, it’s is an absolute hidden gem for authentic Italian cuisine. From the warm, welcoming service to the thoughtfully curated wine selection, every detail adds to the charm of this spot. Their famous Sunday lasagna lives up to the hype—rich, comforting, and packed with flavor. Every dish we tried was exceptional, delivering that homemade, rustic Italian taste. Whether you’re a pasta lover or a wine enthusiast, this place is a must-visit. It is advisable to reserve in advance by calling them."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bnQzc3ZRRRAB",
            "text": "Had a perfect evening here. Very flavorful food, excellent service, great ambience. You can’t go wrong with this place and wish I learned of this gem earlier. I will be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ODlpWC1nRRAB",
            "text": "This is a charming Italian restaurant gem in Alphabet City / East Village.  We went early to try the wine selection.  Many tables were reserved already at 5:30.  Strong neighborhood vibe.  Dinner was outstanding.  Highly recommend for a date night, dinner with old friends or a place to take your young adult kids in the East Village that doesn’t have sticky floors…. Quiet, relaxing, friendly."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdnVmQmhnRRAB",
            "text": "I love this place. Am here each time I am in the area, not large not loud, purely authentic Italian cuisine. As pure as it gets…..oh, and don’t even think about putting Parmesan on seafood, if you forget it is noted on the menu.  The food is served properly, so you should expect to eat it properly."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnaVk2T2JREAE",
            "text": "One of my favorite restaurants in NYC. You won't be disappointed."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneC1ENUVnEAE",
            "text": "Excellent and varied foods.    Great experience.   Fun place.   The brunch on Saturday or Sunday is the best, I think, possible in NYC.  The carbonara is a great standard."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNneWRxTVVBEAE",
            "text": "Wonderful!  Food was amazing!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNzRpSmJBEAE",
            "text": "Incredible experience here. I had the smoky spicy chicken parm, which was delicious, but I was happy to taste from everyone's plates. The lasagna was also notably amazing. The staff was so accommodating and welcoming as well!"
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNl9Yc0JnEAE",
            "text": "Eccezionale! Non ci sono altri modi per definire questo luogo di pura cucina Italia autentica come spesso non riesce più a trovare nemmeno in Italia.\nE poi Beatrice, fantastica e unica. Grazie davvero per un pranzo memorabile. Un must nella Mela."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3enFyWXJBRRAB",
            "text": "25 years in the game, Il Posto Accanto ages like… fine wine. This place has won me over and does so time and again with each visit. I’m a regular of several years and I only wish I learned about them sooner. I’ve tried almost everything on the menu and have yet to be disappointed. Ricky’s recommendations and wine pairings are sublime. Julio & Bea are 1 of 1 characters and beneath all the humor and charm, they are two of the warmest kindest souls of all time. I join my best friends here at least 4 times annually for fellowship over food that never misses and a perfect vibe. I was reluctant to give away New York’s best kept secret, but this is too good not to share. You’re welcome."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNThxRzl3RRAB",
            "text": "My favorite two dishes were the Calamari which was a variety of preparation that I have never eaten before and it was great!, I also liked the squid ink with sea urchin that was incredible. The meatballs were great, & the marscapone was the best dessert with olive oil. The pumpkin spice crème brûlée was rich and delicious along with the olive oil cake. Service was great, atmosphere was even better! One of the best Italian restaurants I’ve been to in nyc!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNULV9MajhBRRAB",
            "text": "Lovely establishment that is a tru neighborhood restaurant with original Italian food. They alway treat you as a friend. The food is good, the ambiance very relaxing. I love eating a the counter. Great grilled Calamari and excellent bolognese sauce."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsaGE3Tmh3RRAB",
            "text": "Very wonderful find. This lovely Italian restaurant doesn't have an overly authentic feel , however, the food was very tasty, and the service is some of the best i have experienced in NY so far. The calamari is definitely a winner and was cooked almost to perfection and full of flavour. It absolutely did not need the additional chilli oil that was offered.\n\nThe main was perfectly cooked and packed with flavour, though I would have like to have more shrimp inside .\n\nOverall I would definitely recommend this restaurant.  Though  you are best to make a reservation as the restaurant is very busy.  I was seated at the bar because I just turned up."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aXJLbTdBRRAB",
            "text": "Lovely spot, we had a romantic dinner outside on Saturday evening. It was quiet and very pleasant even though the place was packed. The vegetable were perfectly  cooked with a lot of flavor. The salmon was delicious. Very good meal."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMycVlDbjdnRRAB",
            "text": "😚 👌🏼 WOW! This restaurant! Amazing! Got invited her by a good friend and sold some\nHigh expectations about how amazing the food was here, and it did not disappoint! The food was spectacular! Real authentic Italian! The bread basket alone I could eat lunch alone on with real quality Italian breads. We needed several baskets 🧺 🥖 we got a few appetizers that were mouth watering and delicious. The bruschetta was so refreshing , fresh & bright, and full of flavor. The calamari was excellent! Probably the best we’ve ever had! And the peppers! 🤤 all so good. We had an order of squid ink pasta that is by far the best in all of NYC! And there ragu was scrumptious 😋 I tried the meatballs on the side and I’ve found non better. This place is a real home run for every dish and their service is top notch. They’re so kind, attentive, and welcoming! This could be 10/5 ⭐️ because the whole experience is that good! Do yourself the favor and secure a table , whether reuniting with family & friends, going on a date , or needing a good dinner for oneself; THIS IS IT! 😋 🍝 🍷 you won’t be disappointed and the memory of the food here will continue to make you salivate 🤤"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4M3NteXhnRRAB",
            "text": "Visited here for a family dinner. They have both indoor and outdoor seating. Place was reasonably busy. We ordered few pastas, salad etc. Service was pretty good and also food was tasty."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cWYzeENREAE",
            "text": "We didn't have a reservation so we had to wait ~20 minutes for the table. The food was great! We got a complimentary Bruschetta since we had to wait(Thanks!). We ordered Grilled Calamari which was probably the best I've had in NYC. The spicy olive oil to go with it was quite exquisite. The Eggplant Croquettes were crispy on the outside and moist on the inside, quite perfect. We ordered a few pasta dishes which were good too. We will be back to try out more of their menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaU5yQ2pBRRAB",
            "text": "Authentic Italian delicious food and we were suggested excellent pasta and maon courses that go well with appetizers. However, there is a fire department very nearby, so sometimes the noise can ruin the atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREeDduOThRRRAB",
            "text": "My best girlfriend brought us here and it is fantastic! Great atmosphere, amazing wine list and the food is ridiculous! We met the owner, Julio, and he is so warm and welcoming and FUNNY! Next time we visit NYC we are coming back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5bjhibk53EAE",
            "text": "My favorite spot in Manhattan. The food is amazing! The owners are the best! The wine is life changing! I feel like Im right at home every time I walk through the doors. I couldn't ask for a better place to be."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3dkl6UENBEAE",
            "text": "Last night, I had the pleasure of catching up with an old friend at Il Posto Accanto in the Lower East Side, and I can confidently say that this restaurant is an absolute gem. From start to finish, every detail was perfect, making it one of the most memorable dining experiences I’ve had in a long time.\n\nThe homemade bread was the perfect start to the evening—homemade, warm, and utterly delicious. The chicken liver crostinis and soft shell crab were both exceptional, showcasing the restaurant’s commitment to quality ingredients and authentic flavors. But the highlight of my meal was my entree- a squid ink pasta with sea urchin—a dish that was nothing short of divine. Every bite was a testament to the skill and passion that goes into the cooking at Il Posto Accanto.\n\nAs a coffee lover, I was thrilled to find that the authentic Italian espresso lived up to the high standards set by the rest of the meal. Rich, robust, and perfectly brewed, it was the ideal way to end an incredible dinner.\n\nA special shout-out goes to Sandro, one of the bartenders/staff members, who made our evening even more enjoyable. Sandro was incredibly friendly and hospitable, sharing his knowledge on the cuisine as well as his own background from Tuscany, Italy. His knowledge and passion for Italian food and culture were evident, and his recommendations were spot on.\n\nOverall, I give Il Posto Accanto a resounding 10 out of 10. If you’re looking for an authentic Italian dining experience in New York City, this is the place to go.\n\nLooking forward to returning and reliving the experience all over again!\n\nGrazie, miei amici!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2OGEtUFpREAE",
            "text": "This East Village gem offers a true taste of Italy. The daily menu of “piatti del giorno” is highly detailed (and entertaining to read), celebrating seasonal flavors, exquisite produce, and the freshest seafood from the Union Square Greenmarket. We especially enjoyed the mussels, the calamari, burrata with tardivo “the queen of chicories”, the grilled swordfish fresh from the market, as shown on the chef’s must-see Instagram posts. The ambiance is lively but not too noisy. There are spritzes and Negronis and a well-curated (and reasonably priced) wine list focused on Italy. We will be back soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucThiNm93RRAB",
            "text": "My favorite restaurant in the city. 10/10 meal every time, especially if you try the special. They never miss!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzemZ1UFJ3EAE",
            "text": "Super cute spot. Very small and I would definitely make reservations. Food was amazing - smaller portions but delicious. You can tell the chef is really passionate about his food. Our waiter was great and attentive."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHLTdEelFREAE",
            "text": "I went for my birthday dinner. I called for a reservation and they took us right in. The decorations were nice and the food was good. There’s specials to choose from and only wine/beer for drinks. We got fondue, meatballs, and the ravioli."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZcmJuVmJBEAE",
            "text": "I come here almost every week. Authentic Italian food. Chef picks the best Ingredients in the city. Very simple food and wow you so many levels. Lunch, dinner, weekend special brunch all good. Don't miss Sunday special lasagna. It's insane. Now vegan menu is available! Pics are special ox tail Bolognese, eggplant croquet, and polenta"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcmNtQ1JREAE",
            "text": "Second time visiting this place and it’s five stars both times. The quality of the food is outstanding. Previously I got the oxtail pasta, it was fantastic. This time we got a seafood pasta and the ricotta pasta in cream sauce. We had aperol cocktails that had mint in them which was so delicious. Everything we had was flawless. Great environment, chill but not stuffy. Quiet but not a library. Perfect place for a date night or family dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbk9QSnJBRRAB",
            "text": "Went last week and absolutely loved every moment. A fantastic Italian restaurant that’s not overrun with any specific age. Julio, co-owner welcomed us as we entered and checked in during our dinner to make sure everything was great. I had the clams and linguini, and will likely be coming back again for it or trying out one of their specials which takes advantage of the nearby farmers market’s vendors. Really enjoyed the pistachio gelato and espresso to close out the meal! Thank you Julio!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNbHNucnRnRRAB",
            "text": "We absolutely love this place. It is our regular place we go whenever we’re in New York, which is at least once per season.\n\nThe location is quaint and you feel like your having dinner in you great grandmothers house. The food is out of this world good, and every time they have something new and unique.  Amazing wine and beer selections to pair with every bite.\n\nDuring the warmer months the guys in the neighborhood gather out front by the fire hydrant for a cigar and some people watching.\n\nVery entertaining Instagram posts, and a real slice of a neighborhood joint that you will fall in love with and keep coming back to like we do."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNmN1S0VBEAE",
            "text": "I'm adding this place to my 'favourite restaurant in the world' list. The atmosphere and decor is amazing; the staff are super friendly and helpful; the drinks menu has something for everyone; and the food is EXQUISITE! I wish I could eat the artichoke burrata starter every day! The pastas are delicious ( mushroom fettuccine especially! ).\n\nHighly recommend!! Can't wait to go again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdnRPUDFnRRAB",
            "text": "This meal was SO good! I got the oxtail tortelloni and days later, I’m still thinking about it. The apple tart dessert was incredible too. Great atmosphere too. I will definitely be back again."
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3ODlDY1VBEAE",
            "text": "This is amazing Italian food. Words can not describe the good vibe and hospitality you get from this lovely restaurant.\nIt is perfect for a lazy summer brunch/dinner/bar.\n\nPro tip: go for dinner on a Sunday and ask for the lasagna, you will never eat a better one in your life!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXOW9QOTdRRRAB",
            "text": "All the ingredients taste so fresh, everyone working is so friendly and offers an enjoyable atmosphere.\n\nEvery day they offer specials. I recommend following their Instagram to see what’s could be on the menu that night. We had a delicious artichoke with burrata, fresh tortellini, then this handmade sciatielli in a wonderful tomato/basil sauce. A special vermicelli with mussels was on the menu that we also enjoyed. Can’t wait to be back again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSd1p5aVh3EAE",
            "text": "One of the best restaurant experiences I’ve ever had in Manhattan. The food was delicious, the specials menu was so fresh and creative. And the service was kind and welcoming. Felt like regulars the moment we walked inside. Reservations a must. Can’t wait to go back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2aElYU0NBEAE",
            "text": "amazing authentic italian experience! the rigatoni alla vodka with guanciale and marscapone ice cream with olive oil were life changing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dV9UeklnEAE",
            "text": "I went there for lunch 2 weeks ago and it was just as good as I remembered. I had two specials that day. As an appetizer I had a soft shell crab, battered and fried to perfection and served over a green salad with a light vinaigrette. It was crispy and delicious and perfectly paired with the greens. Afterwards I had black spaghetti dyed with squid ink and tossed with sea urchin. That actually had an interesting flavor that I can't say I loved, but was very good. And I washed all of it down with one of their house reds. Because it was lunch time and because they were playing soccer on the TV inside.... I sat out side in the covered seating built during the pandemic and people watched as I ate."
        }
    ],
    "reviews_count": 78
}