{
    "name": "Via Della Pace",
    "place_id": "ChIJyddCkZxZwokR9bmyHm7Yevo",
    "grid": "MN3",
    "address": "87 E 4th St, New York, NY 10003, USA",
    "rating": 4.6,
    "user_ratings_total": 943,
    "phone_number": "(212) 253-5803",
    "reviews": [
        {
            "date": "4시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abFZFTmxXRXBVYUc5YWFHeFRaM3BJYWxOc2VVRRAB",
            "text": "A home away from home; great atmosphere and delicious food. I like the chicken Milanese and whatever pasta I feel like eating with it."
        },
        {
            "date": "10시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0ZmFFWlVYMkZUYW5BNFUyNWZSRlJtYzI1cmRtYxAB",
            "text": "Authentic Italian( Roman) restaurant with delicious pastas, excellent wine list and very welcoming owners and staff ! Can’t wait to go back!"
        },
        {
            "date": "3일 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KNVZpMVhUM2h3WjBwdWEzSmZUM0Z6VjA1a1ZtYxAB",
            "text": "Wer in New York einmal Lust auf italienisches Essen hat, ist bei diesen Lokal goldrichtig. Anders als in Little Italy - wo man bestenfalls mittelmäßiges Essen zu völlig überteuerten Preisen bekommt - findet man hier klassische und authentische italienische Küche, die einfach Freude macht. Die dafür aufgerufenen Preise sind - vor allem für New York - völlig fair (21 $ etwa für Pasta alla gricia). Der Service ist - von einer etwas missgelaunten, weiblichen Bedienung abgesehen - äußerst freundlich und aufmerksam. Zuletzt ist auch die Einrichtung des Lokals sehr gemütlich und stimmig. Wir haben uns richtig wohl gefühlt und kommen sehr gerne wieder!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WYWIwTkxXVTUzUzI4MmIyNVVVR2RXYzNkb2VXYxAB",
            "text": "The manager is not understanding at all. I had called to discuss an issue I had regarding my reservation and he hung up the phone on me and was not willing to even discuss anything with me."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205aVlYQmxSemhWYm5kWU5uWlVNV2x2WVdjdFluYxAB",
            "text": "Friendly wait staff.  Eggplant was delicious."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWc2JHWnJVRGRDTW1VMVoxSTNXa2hVVDNKNE9IYxAB",
            "text": "The perfect low key dinner spot!  Delightful food, outstanding service, quiet and unassuming.  Can't get much better northern Italian!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KclFVOUVibVZEU1RSYU1FbHJSbFZSZG5ndGNYYxAB",
            "text": "Seldom in life have I experienced a dining experience so satisfying that I am still simultaneously contented, bewildered, and awestruck the following day. Such was my initial experience at Via Della Pace, where Campo Dei Fiori meets the East Village.\n\nThe food is sublime. From brilliantly executed bruschetta Romana and crispy, salty fried zucchini flowers, to glorious pasta and decedent dessert, punctuated by perfectly brewed, strong espresso.\n\nI’ve been to perhaps more than a hundred Italian restaurants in my decades living and working in Manhattan - from the “hot” places to neighborhood institutions, show-stopping client expense account extravagances and humble locales. Via Della Pace delivered something few others ever have: the unrestrained joy of dining. Within those walls I felt twenty years younger, as my wife and I savored each moment of our conversation, elevated by each bite, sip, and scent.\n\nI would love to thank the proprietor when I return. I hope these words will suffice for now."
        },
        {
            "date": "4주 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214NmJYSm1XRXRJY1VKdU9GWkdkekk1YVU0eVpGRRAB",
            "text": "Ottima trattoria italiana. Servizio impeccabile. Personale gentilissimo. Ambiente tranquillo e soprattutto cibo buonissimo. Tanta varietà a prezzi più bassi rispetto alla media di New York. Assolutamente da non perdere."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSa1IwczJXbGd0TUVKTWEzUnFibEV3Y21SUFVVRRAB",
            "text": "Unfortunately everything that could’ve went wrong went wrong for us tonight. Not sure if it’s just a fluke, because the other reviews suggest something great. But we had an unenjoyable and strange experience.\n\nOur service was practically nonexistent. We went 20 minutes at a time without any interactions, 2 items we ordered never showed up, and we were overcharged on our bill.\n\nWe asked for a receipt after paying via the toast tablet, which the server was holding without us being able to see, taking our cards from each of us to scan (we split the check), but the server never came back to give us our receipt haha. He clicked the no receipt option for us too which is weird. He just disappeared after charging our cards ha. We still tipped 20% because in the moment we weren’t sure what was going on. But I regret tipping at all frankly.\n\nThe table next to us was also having a negative experience. We could audibly hear the couple complaining about the same server, but we weren’t sure why.\n\nTwo tables down from us, the patrons each left their plates practically untouched. And they got the same dishes as my partner and I. Lasagna and the carbonara. Both of which were bad.\n\nOf the antipasti that actually showed up to our table, also disappointing. The meatballs were so fatty it tasted like tailgate hamburger meat, they were so chewy and tough. The sauce was good though. We were both confused. We didn’t want to make a big deal about it, because we thought surely this is just a mistake because no Italian place would make meatballs like this.  So we waited for the other courses to come, but as I mentioned. They had an off putting quality to them.\n\nThe 2 pasta dishes we ordered did not taste homemade, at least not made anytime recently. I hate to suggest such a potentially offensive and arguably sacrilegious accusation, again hopefully it’s just a fluke experience considering the other raving reviews to say otherwise, but our pasta tasted way undercooked, and as an Italian and frequent pasta enjoyer… it didn’t indicate being made fresh as the server claimed.\n\nI’m likely going to reach out for my receipt since the server went MIA when we asked for it. Items didn’t show up so we were likely charged for those and what we did get tasted “off” for lack of a better word. I can’t recommend this place, at least not from this experience.\n\nI feel bad for saying these things but it is what it is."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWTVdFODRXVXhDYWtKbWRsaFFOWEl0UmpSNVpYYxAB",
            "text": "It's not easy to find pasta alla gricia (a Roman classic) in New York.  Before this last trip I uncovered this restaurant that showed it on the menu, so I visited the other day. The bartender, hostess and the waitress were speaking Italian, which I took as a good sign.  A dish of fresh spaghetti with abundant pecorino & pepper and way more guanciale than you would get in Rome, more than I use when I make it at home.  In short, excellent!  Paired with a glass of montepulciano it was an outstanding meal for reasonable price.  Reminded me of Taverna Boccaccio by Piazza Barberini in Roma."
        },
        {
            "date": "1달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkTk5WOVlNMlJ3YmtGRU1VcGtibnBJZUhrd2JGRRAB",
            "text": "Soooooo good !!!! Grazie per averci fatto sentire a casa ❤️🇮🇹❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25adlJHVlNMVEk0VW1kMllrOUZjV0ZKUjBkVlJWRRAB",
            "text": "Proposed here and with the help of the staff it was extra special, food was incredible to boot"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oclF6ZHBlRlpTVUVOUVFWSlJaa2d3WjJKcVJVRRAB",
            "text": "One of the best Italian restaurants in NYC. Lively but intimate atmosphere. Simply put … authentic cuisine. The best meatballs I have had anywhere in the world. Including Milan, Turin, Genoa. Their tomato sauce is perfection . 💚🤍❤️…"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdlYycHVXVVI1WWpOVlNpMUdXazEwUjFsclQzYxAB",
            "text": "Los platos estaban bien, pero lo mejor eran los postres. Pedimos el tiramisú y el volcán de chocolate y estaban muy buenos."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkeFpuZDZRVTFRTTIxbWFqbHNNWFowUVY4dE0xRRAB",
            "text": "Nice place. Good food.  We had reservations. No one in restaurant when we arrived. Sat us right next to a family with a rambunctious child. No reason to seat us there. They did. I won’t go back"
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wNFNqRnNUbEJmZUZkRFMyaFBPVVJ5YkROc1FXYxAB",
            "text": "Nulla da dire se non che il locale è carinissimo e ben arredato soprattutto per chi è Laziale, il servizio è molto buono con camerieri educati e professionali e il cibo è di prima qualità. Ho fatto i miei personali complimenti da ottimo cuoco al Titolare Giovanni da Caprarola, persona coi superpoteri quando è dietro al bancone!!!\nLa sua amatriciana è da urlo, la carbonara a dir poco eccezionale ma la Gricia non la trovate così buona nemmeno nel miglior locale di lungotevere a Roma, una vera sorpresa! Straconsigliato"
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGWllrVnZaRXBQYkdadGRIaHFWbUV4VlRkU2VFRRAB",
            "text": "Esperienza stupenda.  Ambiente che fa stare bene e servizione cibo impeccabili."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aMk16UjZkV0ZrU21Ka2FESnRYMjlxT0dNeFIzYxAB",
            "text": "Pasta was amazing! Generous portions, great quality ingredients. Plus the patio is beautiful."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kemFIQm9WaTEyT0ZweFFWbDBTVWhxZGpRM2NrRRAB",
            "text": "Absolutely phenomenal experience. The atmosphere, the food and the larger than life presence of Giovanni, the owner, will make Via della Pace an authentically Italian evening in the heart of New York."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTmNrWTJSV1YwY1ZWcUxWZFNPR0V6TkZaUFdFRRAB",
            "text": "Finally we made it here after going to Round 2 of US Open.   We live in Philly so coming here has been on my list for 4yrs now. Ever since Berrettini promoted.  We actually know the owner G from him supporting Berrettini.  Full Circle.…"
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWU1sZzFiRVJEVkZCc2VUaFlUM0pzU0VGb05HYxAB",
            "text": "Durante la nostra vacanza a New York, siamo tornati a cena 2 volte, cucina romana con piatti autentici, proprietario e personale gentilissimi. Cacio e pepe da leccarsi i baffi!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wRE5VVktNREp2UTNoS1ZHeFZMVkJWUWtZelRIYxAB",
            "text": "Great Chicken Milanese. Extremely Italian spot. Half the people in there were speaking Italian and drinking gorgeous little spritzes. Total vibe"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMmRqUXRSV3RVZGtSTU0yUXdRakozYVdGbVFVRRAB",
            "text": "This restaurant is amazing !!\nThe place is really cute and the owner is super friendly and funny !\nAnd of course the food was delicious :)"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6NVl2U25nRRAB",
            "text": "Update.  Back for work.  I had to return to this restaurant because I love it so much.  Not just the food, but the atmosphere too.  Tonight I tried the carbonara (delicious), and intentionally saved room for the creme brulee.  It was fantastic. The custard was set perfectly.  The flavor was perfect.  100% sure I will be back.\n\n~~~~~\nI was in NY for work and had dinner with my colleagues.  The food was fantastic and the service was lovely.  I cannot recommend this restaurant enough.  We had several kinds of bruschetta for appetizers, along with pastas and gnocci for the main course.  It was all delicious.\n\nAlso, another review mentioned cash only.  No longer, they take cards now."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBODZuNFN3EAE",
            "text": "Amazing place and atmosphere, best italian food quality price. Marco and Giovanni the owners are great and super friendly and funny! Truly suggested.. very beautiful place also with a tiny interior terrace!"
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sa1EyVldTVTV5Y25oRk1HZ3pPV1YxU1VaMlEwRRAB",
            "text": "Un ristorante insolito, niente a che vedere con Little Itay, ad immagine e somiglianza del proprietario, dove si mangia ottimo cibo italiano, in un ambiente romantico e nostalgico di Roma. Polpette al sugo che mi hanno fatto tornare alla cucina di mia Nonna e una meravigliosa carbonara. In più...sono  tifosi Laziali come noi."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KcWMxRTRka3hETjNKT00waEpObW8xVlhwTFZVRRAB",
            "text": "ACTUAL Italian Food!! Unbelievably good!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5S2VWVTFWbVowVGxRelExQnZTR0ZhYkRkNk1YYxAB",
            "text": "Italian taste in NYC - Must Try!!!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcS1TckF3EAE",
            "text": "DESTINATION NIRVANA ! On our first dinner visit here we were hoping to run into a few of the Italian tennis players after their matches at the US Tennis Open. OH WELL ! We didn't see any tennis stars but the food, drinks, service and ambience were beyond sensational. Before we finished our 2 week vacation in New York, NY we knew we had to return here. On Wed, Sept 11th we decided to turn up cold turkey at 5.pm....we couldn't get a reservation. YEAH BABY ! The kind host told us we had a table until 7pm. At this point we had the entire beautiful dining room to ourselves...but not for long. A fun server named Luca soon came by to help us. FIRST UP ! A really nice ice cold beer would be great...I chose the same one as on our first visit. In the meantime our good mate Flavio the colorful food runner brought us a glass carafe of water and 2 glasses. Luca returned with my ice cold Five Boroughs Tiny Juice IPA in a lovely tall glass...it tasted very refreshing. WHOO HOO ! And then Flavio brought us Complimentary Artisan Bread with dipping sauce....many restaurants do not hand out free bread anymore. OH YEAH ! To kick things off we ordered 1 x Suppli Cacio Pepe ( fried rice balls with cheese and black pepper ) Appetizer. We tried the fried rice balls on our first visit....totally delicious. Not to be confused with arancini which we also love. Our rustic Italian artisan bread tasted lovely. ENTREES ! My wife ordered Lasagna Alla Bolognese ( typical lasagna bolognese style ) while I had to have the Pinsa Fichi e Prosciutto ( Roman flat bread with fresh mozzarella, Parma prosciutto and figs ) on the SPECIALS. WHOO HOO ! Out came our Fried Rice Balls appetizer courtesy of Flavio the polite food runner. TOO DELICIOUS FOR WORDS ! In fact we ordered 3 more...one serve of each variety to take back to our apartment. Just after 6pm our entree meals hit the table. My wife loved her well made Lasagna Bolognese heaps but not quite as much as the unforgettable Baked Rigatoni on our first visit. THE BEST FLATBREAD EVER ! My Fig & Prosciutto Roman Flatbread totally nailed it....brown and a bit crispy underneath but delicately bready on top with the prosciutto, figs & fresh mozzarella. When our server Luca checked on us again I ordered another beer...this time a Montauk Easy Riser Belgian White. It came out pretty quick...ice cold in a lovely tall glass and tasted very good. By now the beautiful dining room was virtually packed out. THERE'S TIME ! At 6.25pm we ordered desserts...1 x Tortino al Cioccolato ( chocolate lava cake with vanilla gelato ) and 1 x Gelato ( pistachio-chocolate-vanilla ). I tried this Italian gelato trio on our first visit and it was as good as it gets. Our decadent looking desserts arrived promptly and disappeared almost as fast....Made in Heaven. We paid the bill by credit card and headed for the front door thanking Luca, Flavio and Gabriele along the way. The interesting looking dude behind the bar was Giovanni Bartocci ( the co-owner with his business partner Marco Ventura ). I told Giovanni we loved our 2 dinner visits to their fabulous restaurant. I HAD TO ASK ! Do you identify more with Roman or Italian....the instant reply was Roman with some Italian. Giovanni was born in Rome. HOW GOOD ? As good if not better than any Italian restaurant we have dined in world wide !"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzblBmd2xBRRAB",
            "text": "ITALIAN TENNIS STARS ! A few days before we jumped on our flight to New York, NY my wife read an article about an Italian restaurant in the East Village, Manhattan being patronized by many of the Italian tennis players competing at the US Tennis Open. HUGE TENNIS FANS ! And we had fabulous seats for the first men's semi-final on Friday, Sept 6th. The article mentioned Matteo Berrettini, Jannik Sinner, Sara Errani, Jasmine Paolini, Flavio Cobolli, Lucia Bronzetti, Lorenzo Musetti & more. I jumped online to book a dinner reservation but the article had blown the place up....fully booked for the duration of the US Tennis Open. OH WELL ! The very next day after we touched at LaGuardia Airport on Thurs, Sept 4th we decided to turn up here cold turkey soon after opening time...5pm because they stated on their website they take walk-ins. BINGO ! When we arrived out front around 5.30pm we were surprised by the rustic appearance of the exterior. BUT THEN ! When we entered a very sweet hostess named Margherita greeted us warmly beside the ornate full bar where a couple of patrons were dining. A TABLE FOR US ! And yes Margherita said they could accommodate us for dinner and led us through to the magnificent dining room with an amazing glass skylight above. WOW ! No Italian tennis players in sight but what a beautiful setting for dinner. It was now in the 2nd week of the US Tennis Open and most of our fav players had already been knocked out....Medvedev, Alcaraz & Rune. HOWEVER ! The very next day we will be watching the Italian and world number one Jannik Sinner play Jack Draper from Great Britain in the first semi-final at 3pm. WE ASKED ! I asked our charming server Caterina if Sinner had been in....yes was her reply. FIRST UP ! I needed a good ice cold beer preferably a hazy IPA. Soon after a busser named Gabriele brought us complimentary artisan bread & dipping sauce plus glasses of water. The craft beer I chose....the Five Boroughs Tiny Juice IPA arrived in a pretty glass. It tasted very refreshing ! Then Caterina took our dinner order...1 x Suppli al Pomodoro ( fried rice balls with tomato sauce and mozzarella ) Appetizer, our 2 entrees 1 x Rigatoni del Pirata, ( baked rigatoni in a pink rum sauce with sausage & mushroom, topped with mozarella cheese ) and 1 x Gnocchi Tricolore ( basil pesto, cherry tomatoes, fresh bufalo mozzarella ) and 1 x Insalatina ( mixed green salad ) Side.We noticed a steady influx of new diners no doubt with dinner reservations. Very soon our fried rice balls arrived and tasted fabulous...very filling. WHOO HOO ! A few minutes later our entrees hit the table.....they looked great and tasted even better. My wife went nuts over the flavor of her baked rigatoni and I had no complaints about my gnocchi. DESSERT ! We always leave room in our tummies for a sweet finale. My wife ordered the SPECIAL DESSERT - Creme Caramel. I am a sucker for gelato so the Gelato - pistacchio-choccolate-vanilla sounded too good to resist. My wife also ordered an Espresso to enjoy with her dessert. My wife didn't mind her creme caramel....probably not her best choice. On the other hand my gelato trio of pistacchio-choccolate-vanilla tasted out of this world...the chocolate was as dark it gets, the pistacchio actually had little chips of pistachio throughout and the vanilla had something going on too...like rose petals. Having just got back from a 2 week vacation in Italy where we tried heaps of incredible gelatos....this was as good as it gets. So we didn't see any Italian tennis stars but our dinner was super delicious. The next day we watched Jannik Sinner beat Jack Draper in a very exciting semi-final and then on Sunday Sinner beat the American Taylor Fritz in the final. VIVA ITALIA !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OeFJGQlNhVkZ1VDFGWFN6WXhNV05LV2psSU9HYxAB",
            "text": "Great atmosphere and vibe. However, my caccio e pepe was so salty it was challenging to eat (and I usually add salt to most dishes). Might come back to give other dishes a try but this was a disappointment"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxVlVVbDNSMjlPVWtzNVQyVjZTVXhuYTJ0dlRWRRAB",
            "text": "Amazing food, good service. Great vibe… highly recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WaFVETjVZVWRZWkVocFdWZERNRlo2ZERGWmFWRRAB",
            "text": "Awesome historical Italian ambience with tasty food and speedy excellent service. Highly recommended."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21seFRFZFhWVXBxTFhWVlRuSnJWVEZpTmtaT05VRRAB",
            "text": "The outside of this spot does not do the experience justice. The inner dining room is cozy and very well decorated to match the Italian theme. The food tasted very good and the wait staff was courteous. Pricing was about what I would expected, I would call it neither outrageous nor a bargain. Its conveniently located next to a theater which makes it a great pre-show dinner option. I definitely would return."
        },
        {
            "date": "4달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBM1pVSmpiMW93VldOaE9WVk9hM05CYkU0d2ExRRAB",
            "text": "Grazie Giovanni 😉"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taTmRqZHdXVGhIY0VsMloweHZVR3BhV1dKeVZGRRAB",
            "text": "We enjoyed our meal here. Food, service, and ambiance were all great."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzeWFVSlZhaloxWTNad1lqSldiVFJ5YzA1cGVrRRAB",
            "text": "Via Della Pace has a vibrant atmosphere with delicious authentic Italian food. Service was attentive and helpful."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odE1GVXlObUpEWWxGMk0yMDNWSEZZT1hkb1VWRRAB",
            "text": "Pastas are excellent and authentic Rome style pastas.  But the pizzas are not so Roman.  The Fiori Di Zucca was over battered and very greasy tasting.\n\nThe place is beautiful.  The main dining area is the best with the beautiful skylight.\n\nService was ok.  They forgot something I ordered and I had to remind them.   Staff is very busy and sometimes it's hard to get their attention."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWbE9ITTRTbkI2VGxONllUbHljelZ1TUVWS1lVRRAB",
            "text": "I was giving a reading next door at KGB's and went twice on the same day.  Once, alone, before the reading--and then as a member of group of five afterward.  Very easygoing, warm atmosphere, enhanced by staff who were motivated to please you."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWNU4wUkdRMjFwTVZsWkxXRnpMVjlpWkhSaWRFRRAB",
            "text": "The Cacia e Pepe with Guanciali at Via Della Pace is hands down one of the best bowls of pasta I’ve ever had. To take such simple ingredients and put them together, like Michelangelo took paint to a ceiling … is truly beyond’s words. I’ve made and ordered this dish a hundred times and have never had one that was on par with this."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFdE1qaEJORTlXWmxCTFp6STNlRWxqZDJwalZIYxAB",
            "text": "Great vibe and amazing atmosphere. Food doesn’t hit the same mark."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLVDAwWU95bzlhWVFnEAE",
            "text": "Good food and drinks, cozy place to hang out and feel like home"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNdm0tck9sdFBlOEJBEAE",
            "text": "I work at a bakery with close connections to Via Della Pace and decided to try it out for the first time and it was so so worth it. Daniela was so sweet and caring about our experience. I got the rigatoni, the caprese, and an affogato and I would rate all of these dishes 10/10. Honestly, I would just come here for the ambiance but the food and the service was perfect. Will definitely be coming back, I’m sure. Thank you guys!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMTGhwNHpHMS1UeFZBEAE",
            "text": "EXCEEDED EXPECTATIONS. Food was exactly what I wanted. No frills, smallish menu, all traditional, I’m sure everything is good. Went with no res which you probably shouldn’t do, but got seated quickly anyway. Got the carbonara and the cacio e pepe, both amazing, and bread came to the table complimentary. Ginger margarita was a 10/10 SPECTACULAR. Could drink 20. Gelato was a highlight. Service AMAZING. So attentive and food came out fast. Perfect date night spot!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLWHhzNnl5bHJtMlJnEAE",
            "text": "I was extremely hungry after the theater show and I was trying to find a place on google for 30 min and I didn’t like anything and THEN this place was the first I saw outside, so I just entered.\n\nFirst (great) thing that you’ll see is an amazing and charismatic bartender 🍸 he is a gem 💎 of this place, an energy.\n\nAnd the food was amazingly delicious!\nI was surprised how good is home made ravioli and how fresh was burrata with melon 🍈😻\n\nI love this place! Plus one to my favorite list of places!👏🏼 highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdkxlTjlBRRAB",
            "text": "Ristorante veramente ottimo… in tutto…. Cibo al top dagli antipasti, i primi , i secondi…. Tutto squisito… non ti aspetti di trovarlo a NY. Meglio che in Italia. Personale gentilissimo… provatelo non resterete delusi"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZalBta0pBEAE",
            "text": "Amazing experience at Via Della Pace, the food was incredible and the staff so kind, thank you Flavio!"
        },
        {
            "date": "6달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvX2REeW1RRRAB",
            "text": "Camerieri fantastici e atmosfera ottima."
        },
        {
            "date": "6달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcHI2SUl3EAE",
            "text": "Da Giovanni a Via della Pace sei a casa. Cibo ottimo cucinato con ingredienti di qualità. Pasta fatta in casa: difficile anche in Italia trovare una carbonara eseguita a regola d’arte come qui. Personale cortese e attento.\nASSOLUTAMENTE DA PROVARE!!!!!!!\nConsigliatissimo"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvOU9XTEN3EAE",
            "text": "Good food"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZMjhyZlJnEAE",
            "text": "저렴"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cks2UnVBRRAB",
            "text": "A wonderful Italian restaurant! The restaurant is deceptively deep. My group of four ate in the back room where there was a huge sky light window. Lights along the walls and candles on the tables were the main source of light in the room since it was already dark when we got there. It was a busy night so it took a while to put our order in and get our meal, but our waiter was very sweet and comped one of our drinks. I ordered a Ginger Margarita and Rigatoni All’amatriciana. They were both delicious. My choice of a margarita was an odd pairing for the pasta I got but I loved them both nonetheless. Google claims it is a cash only restaurant. That is NOT true. They accept cards."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCZzlEMUNnEAE",
            "text": "This place offer an authentic Italian atmosphere. Via Della Pace has a grotto for outdoor sitting in the summer.  The back dinning room is romantic yet family friendly. The staff is friendly and offer a knowledgeable suggestion. We sample pretty much everything on the menu to offer a comprehensive review of the restaurant and menu. The food is fair. Not great. We didn’t enjoy our experience. It lack the robust Italian flavors. My opinion of the food is in comparison to my travels through out Italy, as well as other local pricey Italian restaurants in NYC. Surely you can find better Italian in NYC.\n\nThe prices are exceptionally reasonable $20-$50 depending on appetite."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiODVlcWZREAE",
            "text": "Cozy place to enjoy dinner with friends. Is my second time visiting the restaurant.\nAs an appetizer, we order burrata with Parma prosciutto, Emiliana ( red tomato, shave Parmigiano, Parma prosciutto in top of bread) Pugliese ( goat cheese, roasted peppers and avocado. From the fried rice ball\nSuppli de sanso al pomodoro\nSuppli caccio e pepe\nAnd suppli fungi all of them amazing rich and flavor and crispy.\nFrom the pasta, spaghetti alla carbonara ( my favorite) and Rigatoni alla Amatriciana. We also have a Pinsa Romana, Prosciutto E Recola ( flat bread with tomato sauce, Buffalo mozarrella, and Parma Prosciutto). Everything was delicious. You need to try their peach ice tea.\nIf you go in a group reserve in the back but also you can also enjoy the company and recommendations from the bartender 😉.\n\nEs:\nLugar acogedor para disfrutar de una cena con amigos. Es la segunda vez que visito el restaurante.\nComo aperitivo, pedimos burrata con prosciutto de Parma, Emiliana (tomate rojo, parmigiano rallado, prosciutto de Parma encima del pan) Pugliese (queso de cabra, pimientos asados ​​y aguacate De la bola de arroz frito\nSuministro de sanso al pomodoro\nSuppli caccio e pepe\nY proporciona hongos, todos ellos increíblemente ricos, de sabor y crujientes.\nDe la pasta, espaguetis a la carbonara (mi favorito) y Rigatoni alla Amatriciana. También tenemos Pinsa Romana, Prosciutto E Recola (pan plano con salsa de tomate, mozarrella de búfala y Parma Prosciutto). Todo estuvo delicioso. Tienes que probar su té helado de melocotón.\nSi vas en grupo reserva en la parte de atrás pero también podrás disfrutar de la compañía y recomendaciones del bartender 😉."
        },
        {
            "date": "10달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmc2R5NW1nRRAB",
            "text": "Un restaurant en plein cœur de East Village qu’il faut connaître. J’ai testé plusieurs italiens sur new york et c’est de loin le meilleur. Des produits de qualité pour un prix plus qu’abordable ici à New York City.\nLarge choix de différents spritz et autres cocktails mais aussi de pâtes très bien exécutées.\nLe service est convivial, nous avons directement eu une table sans réserver. L’ambiance est sympathique !"
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaF83TmdBRRAB",
            "text": "Ringrazio in primis 2 ragazzi romani che lavorano in Canada  incontrati In giro x NEW YORK che parlando mi hanno indirizzato da voi RISTORANTE, VIA DELLA PACE   il giorno dopo siamo andati a cena x vedere e provare siamo stati accolti con modi gentili come turisti stranieri ma quando hanno sentito che eravamo ITALIANI ci hanno parlato in ITALIANO perché i camerieri parlavano tutti ITALIANO ed INGLESE i proprietari sono 2 ROMANI BRAVISSIMI abbiamo cenato e vi posso dire solo  una cosa sembrava di stare in casa mia e il cibo era cucinato da mia moglie ,e il giorno dopo ci sono ritornato a cena Ve lo consiglio con il ,❤️se vi trovate a NEW YORK e avete nostalgia del cibo ITALIANO grazie a tutto lo staff e propietari e ringrazio i 2 ragazzi ROMANI che mi hanno indirizzato da voi 🌈❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMeWItektREAE",
            "text": "A perfect dining experience. There was literally nothing short of excellent across all conceivable metrics. The food, service, and dining area were all irreproachable. We had fried rice balls with mushrooms and cheese for our starter, and then rigatoni with red sauce and a burrata topping and spaghetti carbonara with guanciale for our entrees. They were simply spectacular. To drink, we both enjoyed a Peroni. Our server, Matteo, was impeccable and made sure we wanted for nothing during our stay, and then after we had paid the bill, he surprised us with a special treat. He was a joy. Also worthy of special mention is the gorgeous dining room, with a skylight that afforded us an excellent view of the surrounding buildings. As twilight gave way to dusk, and the lights began to come on in the cozy apartments above as I enjoyed my dinner, I felt like a prince. I really can't overstate how much I loved it here, and I very much hope to return to this excellent restaurant in the future!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsNEtmQTB3RRAB",
            "text": "Bellissimo locale, ottima birra, ottimo cibo e ottimo personale. Un piccolo angolo della capitale a New York City. È la seconda volta che vengo qui, nel 2017 l'altro locale era più ampio e dispersivo, questo, oggi, un po più raccolto è accogliente. Si parla ovviamente anche italiano ed è raggiungibile sia in taxi che con le biciclette a noleggio. Credo sia aperto tutti i giorni e si possono vedere le partite di calcio in TV, soprattutto quelle della Lazio. Lo consiglio comunque a chiunque necessiti, nel caos di New York, di una boccata d'aria di casa."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBcEtIYzF3RRAB",
            "text": "Excellent food, fair service and poorly made cocktails. I ordered a steak rare and it was cooked to perfection. My husband ordered the lasagna and he was very pleased. The portions are small but sufficient and my steak didn't include a side…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIanJuWDh3RRAB",
            "text": "Great food, real Italian. We called ahead for a reservation and they said they were full but when we walked in there were plenty of seats at the bar. The tiramisu was the real de!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIMW9qXzhnRRAB",
            "text": "Dined here last night, with my family, for my birthday dinner. I can’t express in words the amazing, food, service, ambiance and all around fabulous dinner we had! The Ginger Margarita might be the best margarita I’ve ever had. The fried olives are a MUST - I’m an olive lover and these I could eat by the bucket!!! Same goes for the amazing rice balls!! We had both the Cacio e Pepe and the Pomodoro ones - JUST WOW!! The pasta dishes were to die for - we ordered the Carbonara/Guanciale, the Rigatoni Pirata and the Lasagna. We were truly amazed at how delicious and fresh the pasta dishes are!! For dessert, we had Panacotta, the Crème Brûlée and the chocolate lava cake - ORDER THEM ALL - YOU’LL THANK ME LATER!!! Everything we ordered was exquisite! If you want an AUTHENTIC Italian experience, Via Della Pace is your place!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURad09ySUp3EAE",
            "text": "Celebrated our engagement here, and came back a week later. Cannot recommend this place enough! Definitely get the cacio e pepe rice balls and the steak! Great espresso martinis too"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyNzU3bF9nRRAB",
            "text": "Perfect, their new place is also charming (opened since beginning of may), the food always excellent and Italian owners with great service. Seven years after still the best Italian restaurant at good price for new york.next time we will try their shop. See you soon. We recommend 100%."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwX0x2WG1nRRAB",
            "text": "Nice Italian restaurant in East village. Would recommend trying the bistecca di manzo (ribeye steak) and rigatoni del pirata. The steak is big enough for two people sharing and it comes with a salad. The rigatoni del pirata pasta is quite tasty. To finish, consider getting the tiramisu, which cups in a cup and is quite creamy but not too sweet.\n\nThe place is quite cozy and has a rustic elegance. The sun roof is also nice as it allows natural light to come in during the day. Getting a reservation is a good idea for dinner time as this place can fill up quick after 6pm."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbWZMdHFBRRAB",
            "text": "fantastic italian, super delicious pasta. the sodas were AMAZING. tiramisu and creme brûlée were kinda a miss for us."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvcmVpeUtREAE",
            "text": "Quite possibly the best meal I've had in NYC so far. Stopped in for some late night food to get out of the rain and had some great drinks, amazing food, and enjoyed the atmosphere. Will absolutely return. Our waiter was very attentive and…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaHJLYllnEAE",
            "text": "While staying in NY I was looking for a great Italian restaurant. We found it 2 blocks from our hotel. Excellent food , great atmosphere , service on point. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWeVBtWUNREAE",
            "text": "abbiamo amato tutto, cibo romano DOC, cockails, atmosfera, musica italiana “epica” e poi c’è Gio, mito vero e simbolo del locale, con un occhio attento sempre su tutto e per tutti… grandissimi, sarà sempre tappa fissa quando saremo a NY 👏🏼👏🏼 (anche senza essere aquilotto 😂 io !!!!)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwd2VMYml3RRAB",
            "text": "Best birthday celebration in NYC! I booked a table for 40 people to celebrate my 30th birthday and the staff was amazing in accommodating everyone and everything. I would highly recommend Via Della Pace as a birthday celebration location. Food was amazing and drinks where included in the menu. Thank you so much for the service!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJbXZuRG5BRRAB",
            "text": "For a small Italian restaurant in the East Village it has a lot to offer in flavor. Absolutely delicious and very friendly staff, the only gripe I have is the size of the tables.. being 6’4” it’s like sitting at a kids table. Otherwise the…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWdV9PbHdRRRAB",
            "text": "We have been a few times before and as usual.. the food was great. I really enjoyed the \"home\" made lasagna.. the mushroom appetizer was exceptional.. the service was good, maybe too good. It's always a difficult balance between great service and feeling like you are being pushed out... Will be back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBemJlZkhREAE",
            "text": "We’re making Via Della Pace one of our favorite Italian restaurants in the entire city. Love the food! Main courses are nicely set up. You must try both desserts tiramisu and crème brûlée. Ufff wonderful!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlNUluZUtREAE",
            "text": "Heard about this place because I’ve seen the owner cheering on Berrettini at the US Open the past few years. I’m a huge tennis fan so when I went to the US Open this year I had to try this restaurant.\n\nIt is by far the best Italian food I ever had. The flavors are unreal. It’s 100% authentic. My rigatoni was cooked a perfect al dente and the Pizza Margherita was so refreshing. And the prices are very reasonable\n\nYou can’t get food like this where I live. I will be coming back next year when I come back to NYC. So impressed!"
        }
    ],
    "reviews_count": 73
}