{
    "name": "Lil' Frankie's",
    "place_id": "ChIJK2OWqJxZwokRVvZekLjy2wk",
    "grid": "MN3",
    "address": "19 1st Ave, New York, NY 10003, USA",
    "rating": 4.3,
    "user_ratings_total": 2058,
    "phone_number": "(212) 420-4900",
    "reviews": [
        {
            "date": "11시간 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUmRWTmlkVGxIVFdabFVHOTBUVXhWYWs5dU0zYxAB",
            "text": "Very tight, but great pasta"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxNk0yaG1ibXBQV21OVFdYWlVTemhxZVhwTFMxRRAB",
            "text": "Food was delish! Fresh. Pasta melts in your mouth! But above all the service won the day. It was a busy night and there was a mix up with seating. The team went above and beyond to make sure we were taken care of. Kaiya was especially kind. And the management team too even came over to us. THANK YOU, LIL’ FRANKIE’S!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCb1VuVldObGt6ZDBoSVZFOVphMWxUTUVaU1YwRRAB",
            "text": "Good service, good pizza, lots of people."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwSk5rNDROelk0ZDI1S1RYbE1hbHByV0ZJM1lWRRAB",
            "text": "Server is friendly and attentive, all dishes we ordered is good quality. Only tiramisu has bit unnecessary flavor from fridge."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOME4xSjBZWGRaU0ZSMGRUaExkR2x1UzE4MVZFRRAB",
            "text": "Wonderful service, warm greeting by the hostess, courteous wait staff; server was super friendly; extremely fast delivery of food and beverages once ordered! Had reservations for 11:15P on the Saturday before Halloween, but arrived a few hours earlier at 8:15; and there was either bar seating or outdoor seating. We opted for the patio seating versus the sidewalk seating, y’all be careful because to get to the covered patio, you gotta cross the bike lane, and these uber delivery drivers / citibikers are pedaling fast! Our table also had a wobble, but the staff were pretty attentive and fixed the wobbly table. Got the margherita pizza, which had a nice fluffy crust, nice char and lovely cheese and sauce ratio/flavor. Wonderful time, reservations highly recommended. Want to come back to try other entrees and pizzas."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SR00yRnJiRmR3UWpoUk5FMDBabkZpTTFOTFIyYxAB",
            "text": "Sucks, over priced and food is tasteless"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSkxYZEhWVFZOYTAxcFptaHVOV3hSYTJWTk1tYxAB",
            "text": "I recently visited this spot and was blown away by the experience. The wine list is absolutely incredible, with selections that cater to every palate and pair beautifully with the food. The pizza is a true standout—crispy, flavorful, and easily able to compete with some of the best in New York. To top it off, the place stays open late, creating a lively atmosphere that makes it perfect for a night out. Whether you’re looking for great drinks, amazing pizza, or just a fun late-night vibe, this place delivers on all fronts."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ReFpWaHJkM2xTWW04eWJraHNRVE15ZW1Nd2JFRRAB",
            "text": "Favorite chicken parm in the city."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGQmNFOVhhWHBCWkVFNWJFdDRNWEV0WkdwNU5WRRAB",
            "text": "Very high prices for OK food. If you're looking for good Italian in the East Village go to John's of 12th street- good food, big portions, low prices. If you're looking for a date spot nearby maybe the Himalayan Cafe across the street. If you're looking for good expensive pizza in the east village, that's not to be found here but at Joe & Pat's.\n\nMaybe you'll like it here more than I did though, tastes differ."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kUFNtNDNXSGRVUkhkaU4xcDZTRVptUjJOMlZHYxAB",
            "text": "Very loud and really tight tables."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaTlRFMUhTMmxTWjNrNE1HNTBXRVZZZVRrMFlrRRAB",
            "text": "Went to Lil Frankie's to celebrate a birthday. We made a reservation a week ahead and confirmed via text a day before. We arrived early and got drinks at the bar and waited for our table. The restaurant was packed but had a great vibe. The food was delish..apps were calamari and zucchini, mains were lasagna, wood fired chicken, chicken parm, and vodka pizza. Our server was attentive without making us feel rushed. We'd definitely return."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxV2JrdFBlRTkzUlhSSlZHRjRUVUZyWjNGcVYwRRAB",
            "text": "Great food and kind staff. Even though it was busy, my wait wasn’t even that long. They were playing some gems on the speakers too."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFMVVWOUdhM2RHUVhGWWVXVXpNRjk2ZVRGNlRrRRAB",
            "text": "Need better delivery pick-up process and employees."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSWFYaENSMkp5ZFZWMFpsbHpOa05QUVRnNFQzYxAB",
            "text": "They will have you wait for 35 minutes for a pasta that you can cook in 5 minutes at home, probably yours will be better quality and 1/10th the price."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KNlpsazNhVmRKVEhWbk9VZFdORUl0WWtwT1IzYxAB",
            "text": "10/10"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nd1pGcE9kVFJGZHpCdFdEaGlNbEJPV0VoUlQwRRAB",
            "text": "Delicious pastas and Italian fare !!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xRE9HMDNVM1I0TVZkVWVIRjVkVkZ3VVhoa2JsRRAB",
            "text": "Delicious pasta- also tried the pizza and was extremely surprised! SO good, fresh and tasty!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KUFVsVlphakF4YUhCTmJUZFhUMlZIWjBjM1MxRRAB",
            "text": "It's a scene. Great people watching, the family pictures and Neapolitan/ old New York Italian-inspired decor make you feel at home. House wine is always a hit. Huge portions of food, cooked well. Love their infused chili pepper olive oil, too."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMFdGbFNPVVkyVFVGeVMxYzNRakZSUVZoMVVIYxAB",
            "text": "Great little (almost hidden) gem in the East Village. Pizza was outstanding, great service and a neat atmosphere. Definitely will return."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOWllVbHBUVzFRVkcwNVR6VkhWMmRWVjBsNGJrRRAB",
            "text": "Lots of negatives but lets focus first on the positives.    Open late.  Fun atmosphere.  Interesting crowd.  The pizza looks like it could be good as does the chicken parm...  but I didn't order these.  I would order the Chicken Parm if I were to do it all over again.  Why didn't I this time?  Well, this dish is so much better with veal, I figured I would be disappointed and they don't offer it with veal.  Quite frankly one measure I use for a good Italian spot so fail number one.  Unfortunately if you didn't want pizza the menu was challenging -as in to find something interesting-  and the server staff not helpful at all.   I ended up getting the spaghetti with garlic and oil; and it was extremely disappointing.  I personally could have cooked the same dish a 100x better easily.  Basically tasted almost like plain noodles.  In other words you get very close just by boiling noodles in water.  At $21/22 dollars before tax it was just a ripoff.  Easily the worst Italian dish I've had in as long as I can remember...years and years.   Making it worse this place was cash only, just making the bad food inconvenient as well.   Nothing here to make me ever go back.  Given that other people have rated it higher, I guess I just ordered poorly...."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5VldXbHNMV2hxVldkM2NtdDFSSEpJV1ZsemFYYxAB",
            "text": "Great across the board. The grocery next door has the nicest guy who works there and the sandwiches are the best in the city. Also delivers late. Great pizza and pasta"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21keVFsRXpXRTEzWTNkeE1TMW5XV2RyZDFWck0yYxAB",
            "text": "One of the best spots for late night full meal in LES"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWbWFqSkZiVkIwTVRSU1RGZGtZM05XZUhwWFpFRRAB",
            "text": "I had the salmon for lunch. My belly was not right the rest of the day. But they seem to try hard there."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMGFyN293RRAB",
            "text": "Foccacina and grilled eggplant to die for !!!\nBuratta it’s amazing too …. Pizza napoletans as well … all menu amazing ❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toM1pITXpXa3AwU1VWRGNHeFZSMGxFY3pCb09IYxAB",
            "text": "Fantastic dining experience. Food was so delicious, and came out quickly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWE5EQnlkVEJSVUhGdk9WQmtlRk53UVhCT1RuYxAB",
            "text": "Best pizza ever. Just cash."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21velEyRTBjRFZKZG5sUU56aGlOR1E1WVVKMFIxRRAB",
            "text": "Had a great family meal here last night. The vibe is very LES/EV- if that is your thing: close seating, people bouncing around around you, two single bathrooms total, service is European in the sense that you usually have to ask to get something, and it’s apparently no issue … That being said, the Burrata Mozzarella and the house made Tagliatelle special were phenomenal. The ‘famous’ lemon pasta, meh- great for a child, as we said. The Wine selections were really enjoyed by the table. I had great local, Craft Beer- think I stuck on the Talea Al Dente Pilsner- clean, frosted mugware every time- no clinging bubbles- but definitely isn’t a pint, my guess is 12oz. The Affogato was memorable, and our waitresses were very nice. Could be back, and eat EARLY again- place turns into a zoo around 8pm if not earlier. Front door guy reminded me of the pushy maître d’s in Trastevere, but less welcoming - not necessarily my vibe, and even a borderline vibe-killer. “Oh, the East Village…” We did truly have a great night."
        },
        {
            "date": "1달 전",
            "language": "fr",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kVmJGOUZaVWQyWXkxc09XeGhNek5rZERoSmFYYxAB",
            "text": "Trop de retard"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwRWRHWlRWRGxMUlV4TWJIRkhia3hHYjFKelIxRRAB",
            "text": "i love lil frankie’s and have been so many times over the years but i got food poisoning just now. prob a good idea to avoid their pastas with meat after 1am."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oaVVrdHBRWGhCWW1oZlprRkxXa05VTWxKVmRIYxAB",
            "text": "It is ok. I ordered the butternut squash ravioli; the flavors were good, not great, and the portion small for a $30 dinner. The service was ok. Only cash but there’s an ATM inside de restaurant if needed. We dined outside; 3 adults. Bicycles going by between the seating and the building. In my personal experience, this is one of those places that perhaps had an epic status in the past, that has lost their mojo."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRVkxVlFUMnMyTmtoR1JrRkVWRmhaZW5KVVoyYxAB",
            "text": "The bread was quite stale, suggesting it had been sitting out for a while. That’s not a deal-breaker. However, the “lemonade” arrived far too late, and by the time it did, the ice had melted, leaving it tasteless.\n\nOn the positive side, the pasta was quite good. We ordered the lamb ragù, and I opted for the classic limone, which was enjoyable, but got boring after a few bites. Portion sizes were generous.\n\nThe desserts were also solid. We indulged in tiramisu, chocolate cake, and panna cotta, which was my personal favorite. Interestingly, the pastas were served before my friends’ pizza and salad, and we had to wait a while to finish our meal together. This slight delay seemed a bit disorganized, and not everything was of exceptional quality. Nevertheless, the pasta was still quite good, which is a positive aspect. Wine was good too."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dmEySnlXbU5uYTJkQmVXbzJiekZWU1hwVU9FRRAB",
            "text": "Great late night food and drinks.  Mussels and pizza were on point."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNGVHVkVRbVZCWldWaVQzQXlaMWhNVVV0bFVtYxAB",
            "text": "LEMON PASTAAAAAAAA best meal in the planet 🙌🫶"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21seWMwRkVlQzF5VEZSeUxYQk1VbU5WZUMxdlJHYxAB",
            "text": "Genuinely one of my favourite spots when I visit NY. I come for the Spaghetti a Limone and Zucchini Fritti every time, they are simple and so so delicious. Tried their tiramisu last time too and was able to convert a previous tiramisu hater, it was that good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOUVMyWlJla3gwWjBvNU5qVk1YMjA1YW5CYWRYYxAB",
            "text": "I came alone after work at 1 am and both the service and food were incredible!! Starting from the hostess, super quick to offer seating and super nice, to the bartender and the kitchen, everything super fast!! Got chicken parmigiana which was actually amazing and a pretty big serving, mwah chefs kiss love it, perfectly seasoned, delicious, felt like a home cooked meal!!!\nthank you so much for getting me food and a drink after my bartending shift YESSSSS I’ll be back!!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTFNuTTJWWEpQWkVGSGRXbzRSV05aZFU4dFgwRRAB",
            "text": "Such a nice waitress and good prices for food! Will definitely be back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSWWQzbE1ZbVZ2WHpSV09FeGxOSEZaUmpsb1VIYxAB",
            "text": "Nice, no frills place. Went for brunch and had the spinach and goat cheese omelette which was decent.\n\nThe chocolate cake was the star of the show.\n\nCash only so bring money!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25relkwTkNjVm8wUmt4WFlVNUhYMHRaTVhObmRVRRAB",
            "text": "The back garden room is so charming- what an oasis! And the pizza was delicious. Remember to bring cash!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GSFgxWjRhamhNYUZaV09UaDFkSG90WTJ0MmIwRRAB",
            "text": "vodka sauce pizza was perfectly savory and the margarita pizza was delicious. little char on the crust and bottom but still little floppy and moist pie - perfectly cooked"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwLVpiMkdnEAE",
            "text": "Fantastic food! Horrible service. Took 15 min to greet us and offer water. Then rushed us and asked if we were finished 4 separate times. Couldn’t even finish our pizza. Also my old fashioned came in a martini glass with no ice? Maybe this is the Italian way. Weird."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wd1JYQnJORnAxUWtwSGVEbFBaM1I0UTFwNmJuYxAB",
            "text": "Unfortunately a big let down, a 1/5. We had the garlic bread as a starter, a safe bet, you would think. I don’t understand how they managed to make something so easy, so disgusting!?! Bread is dry and not good quality and garlic was brown and cheese was low quality, making it inedible. The pasta was at best mid-level, the same level as airplane food in economy…. The lasagna tasted like it was straight from Costco that you put in the microwave. And the service was nowhere to be found. The atmosphere is probably better if you sit inside. We were seated in the street, and that wasn't very pleasant.\n\nDon’t know how they managed to get the ratings they have. Do yourself a favor by going somewhere else!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGdGJHb3liSFZJU1ZoNFdXNTBaVkUzTTI5VlFrRRAB",
            "text": "They only accept cash. Food was tasteless, service was good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRVJtaFlNQzFXYkV0eVRtRnNTamRXWVZGNFdVRRAB",
            "text": "The decoration was gorgeous and we were sat in an amazing place for my friends birthday. Unfortunately, the food was just ok. The pastas were underwhelming and the pizza was nothing groundbreaking. I would’ve loved to see some more interesting pastas on the menus. The tiramisu however, was actually pretty good and it was perfect the birthday. The service was good and we got sung happy birthday!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsRlZsRmtZV2N3ZERRMmVIcGtSbWhyTWpkalIwRRAB",
            "text": "This place is simply excellent! Really good food, abundant, and tasty!\n\nI was able to drink my beloved Fernet Branca w/Coke without a bartender asking me “what???”\n\nI have to say though, come prepared with some extra cash because this place cash only.\n\nI definitely recommend it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkUWFEQXRXbkZGU1V4WFYzRTFXWEZVYjBwTWEyYxAB",
            "text": "Food was eh, experience was bad. One of my friends told the waiter we had a birthday, he didn't tell her it was an extra charge for the birthday dessert. It wasn't an outside cake, they brought out a slice of tiramisu and then were quite rude to my other friends at the end after they tried to leave, not knowing it was an extra charge for a birthday dessert. Everything on our receipt was $2 more than it was on the menu, which wasn't tax because tax and tip were added like normal at the end. There's better Italian food in the city, the spaghetti limone was literally spaghetti with butter and lemon squeezed on it for $24. Make it at home."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5dlUxcHRTV2xhTjJaelRrMVhlVlpuWkMxUFkzYxAB",
            "text": "Food was good, people were nice. But service was incredibly slow."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25keVVGcHhZbEo0YWxCeGMwWm5PVXRqWjNWNVRIYxAB",
            "text": "Disgusting"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OaVJXODVTVGRrY1U5SldrdGpXVmw2UVUxclgxRRAB",
            "text": "Late night best - Little Frankie’s is exactly what it sets out to be—gritty, no-nonsense, old-school Italian that nails the essentials. The homemade pasta special of the day (ours was a tagliatelle Bolognese) was a standout—saucy, savory, and clearly made with care. Same goes for the pizza: thin, crisp crust with a char that tells you someone back there knows what they’re doing. This isn’t fine dining and it doesn’t pretend to be—thankfully. It’s cozy, loud, slightly chaotic, and full of charm. The chicken Parm is textbook in the best way: crispy breading, gooey cheese, rich sauce. Service was fast and unfussy. It’s the kind of place that feels like it’s been holding it down for decades because it has. If you want polished and pretentious, go elsewhere. If you want legit red-sauce comfort and a room with character, Little Frankie’s delivers."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSMlZFVTNRMnRqWlZNeGNsYzJaM0JqT0VnelpWRRAB",
            "text": "I ordered online and I'm okay with something coming cold or whatever cause obviously I ordered online and it won't be super fresh, but the taste🤢 idk if it was the sauce, the pepperoni, the cheese, but something was off. The dough was alright. Also the garlic bread is a no go as well. Maybe the ingredients being used are too expensive for my taste or maybe they're cheap. Never again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTlJYWnFRV1JGWVhSb09GODNOVkJmYzJ0NGRGRRAB",
            "text": "charged us for birthday dessert? weird and trashy, especially for a cash only place.\n\nfood was mid at best, prices on menu also did not match the prices on the bill!\n\nmuch much better places you can go for pasta and pizza in east village for half the price"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWFZsODNOMFpoWWswM0xYcE9WMU5ZTjE5MU1XYxAB",
            "text": "Absolutely delicious! Pizza was great, the dough and crust are fantastic. Good drinks, good salad, good mozzarella appetizer. Complementary bread and olives and olive oil would definitely recommend, and come here again!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKVFh6OGpraHJUbEZnEAE",
            "text": "Cute brunch spot, cash only. We come here pretty often, but I have only visited for brunch. Loved the French toast - it's very cinnamony. Lemon spaghetti is always our go to. I love the 3 for 1 cocktail during brunch!\nAttentive server and great food. Back room is super pretty with sunlight."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPaXlvSnJ5bmV6M25nRRAB",
            "text": "This place never disappoints! I make it a point to come here at least once or twice a year. My most recent visit was great. One downfall is that this place is cash only. There is an ATM tucked away by the bathroom so you can take cash out for a $2.75 fee. The garlic bread was delicious. The pizza was great because my son talks about it all the time. I ordered the penny pasta and it was covered in ricotta cheese. So mouthwatering. My fiancé got the gnocchi and he said it was the best gnocchi he's ever had. The drinks were good. The dish with fresh mozzarella balls were so delicious! We didn't have a chance to indulge in desserts because my son was tired and cranky. But I'll be back for sure. I can't wait to return!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGUk5rUkxZelJ4VDIxdlpYUm5VWHBDVTJKNVdWRRAB",
            "text": "Our go-to place when we want delicious and unpretentious Italian food! It has everything for everyone. If we can’t agree on a place to go, we always end up going to Lil’ Frankie’s. It never fails and stands strong as always! 👍💪"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdExhVjZRRRAB",
            "text": "I've been here twice now, this place is great! Lil' Frankie's has a wonderful vibe, even late into the night! I was there at around 12am on a Monday night and the restaurant was still quite lively. Just a heads up, this place is cash only, so do keep that in mind before visiting.\n\nThe food is wonderful! This time around I got their Handmade Tagliatelle with Bolognese sauce. I believe it was a special on the menu (not sure if it's limited time). Although a bit pricey, it was really delicious! The pasta had that wonderfully soft signature chewiness to it that is so characteristic of fresh made pasta. Each mouthful of pasta was deeply coated in the flavorful bolognese sauce. Rich and meaty with tender chunks of ground beef and an undertone of acidity and sweetness from the tomatoes, the sauce was exactly what I have dreams about! The Parmesan and parsley on top of the dish was also a nice touch. Not to mention the large portion size! All in all, it was a an amazing dish. The olive oil that came with the bread was also really flavorful, although I do wish the bread was a bit warmer. The last time I went here I remember getting the Spaghetti Limone and the Tiramisu and being pleased with those two as well, so I would totally recommend this place! It's a great late night spot if you're in the area!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnaS12NlVBEAE",
            "text": "This place is great! We are visiting NYC and this restaurant was recommended to us. We stopped for lunch and found the place authentic and charming. It was a good atmosphere in there, as plenty of people were coming in while we were there. We choose the freshly-made pasta dishes of ravioli and gnocchi. Absolutely perfect, light and delicious. It was a good sized portion as well. Couldn’t recommend this place highly enough."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJcWFxdF9NaGJhRWFBEAE",
            "text": "A cute little Italian restaurant with good service. We enjoyed our pasta dishes which were massive portions.\n\nWas quite pricey for what it was but we’re not used to US pricing. Remember to bring cash as they don’t accept card!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOZWtwdnpxNTd1T3VRRRAB",
            "text": "The food is really great, have been there twice and both times the food has been amazing. The pizza is some of the best I’ve had.\n\nThe service can be a little slow, our last visit we felt like we were forgotten by the staff. Disappointing for such a great experience otherwise."
        },
        {
            "date": "6달 전",
            "language": "ja",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvc2VQZGV3EAE",
            "text": "NYはイタリアンが美味しいので、絶対イタリアンは食べようと思った。\nだが、夜に少し重いディナーなので、軽く食べたいなと思ってここへ。\nイタリアンは、メインにミラネーゼカツレットやオーソブッコとかあるけれど、私はパスタが1番と思う。\n\nここの入り口は、わかりにくい。\nどこかなと思ったら、通りすがりの男性が教えてくれた。\n入り口を入り、奥へ奥へ。\nサービスの感じの良い男性は、ヒスパニック？\n流れる音楽もそうで、あれ？ここはメキシカン？と思ってしまう。\n料理は、レモンパスタにアンチョビピザ。\nこれしかオーダーしなかったのに、サービスの方は感じ良い。\nそして、美味しかった。\nどちらもサッパリしているから、胃が重たい時には良い。\nとてもシンプルなものなんで、自分でも作れるようなものだが、パスタの麺、ピザの生地は難しい。\n雰囲気もリラックス出来るし、この近所に引越ししたいほど。\nとても気にいったので、"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKNjE5WkRsem9LNUxREAE",
            "text": "Lil Frankie's is a highly popular spot, often praised and recommended by many--and for good reason. Here's my take on everything I tried:\n\n- Fried Zucchini: Perfectly battered and fried, these were crispy without being greasy. Paired with a spicy tomato sauce, they were an excellent starter.\n\n- Whole Fire-Roasted Eggplant: The texture was fantastic--soft and melt-in-your-mouth. However, the flavor was on the bland side. It wasn't bad, but I wouldn't order it again.\n\n- Mezzi Rigatoni Polpettini Ragu: Cooked al dente, this pasta came with mini meatballs and a rich, flavorful sauce. The combination was absolutely delicious!\n\n- Pizza Margherita: Easily one of the best Margherita pizzas I've had. The dough was perfectly soft and chewy, with a crispy crust that gave a nice crunch. Topped with fresh mozzarella, it was simple yet outstanding.\n\n- Nutella Focaccino: Recommended by the server, this dessert is perfect for Nutella lovers. While it was good, it's definitely a heavy and filling dessert--something to share if you're already feeling full.\n\nI'd definitely return to try more of their pizzas, which seem to be their specialty. The only downside is that the restaurant is cash only! :( Be sure to plan ahead!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdnJ1b1RBEAE",
            "text": "This was an enlightening experience of Italian food. Just as filling and close to home as I pondered it would be. My brother celebrated his birthday here and we had a guest from Belgium as well so she enjoyed her food too 🤓 I would recommend call ahead to see if there is any seating in the sun roof area/ if it’s busy or when are their least busy times because I believe the experience would be even more awesome if there wasn’t such close together seating when busy. I had spaghetti limoné I requested extra lemon it was so good and light. The brick oven pizza is so good it puts New York pizza to shameeeee it made me wonder if I went to Italy would I ever come back because pizza is my favorite food 😔. Soooo I think this is a good place for a first date, laid back  small celebration, family friendly eating experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQZmZvdlBVM2NyNWR3EAE",
            "text": "The atmosphere and the customer service is beyond me, this Italian establishment feels so iconic. The pizzas were baked to perfection with just the right amount of crisp, the aroma of the sauce were spectacular. I 100 percent would recommend the pizzas here after trying so many NY mainstream pizzas, the pasta were also amazing, the portions are just right."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnd01DQXlRRRAB",
            "text": "Absolutely loved this place and who highly recommend it. It’s chaotic, tight seated, and amazing food - what a New York dinner should be. The food is absolutely delicious and will definitely leave you full. I’d recommend coming out of your way for this place just for the fun vibe. Looking forward to my next visit!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21reE9WSTFOREZqY21wWlFUQm5VMUZLZDNobVJFRRAB",
            "text": "Amazing food!  The place was recommend to us for all the right reasons.  Went to a late lunch and food was perfect, so good we got our dinner to go.  Had a salccicia pizza (best Italian sasuage (made in house)) I have ever had.  Gnocchi was cooked perfectly and the pomodoro sauce was 10/10.  The mortadella sandwich with burrata and argula (The Ex) was the best I've had in the states.  Just FYI, it is cash only.  Plan ahead for that.  Also  they had grappa, which is becoming a rarity in many places."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmeHRqR2F3EAE",
            "text": "One of the best Italian spots in NYC in my opinion. It's cash only, a small spot where it can get a little cramped, but the food is unbelievably good. Start with the garlic bread that is thickly sliced and full of garlic flavour and also the zucchini fries, the whole grilled aubergine that's finished table side and some burrata. Move onto the spaghetti limone which is candidate for one of the best pasta dishes ever, the ravioli and also penne topped with mozzarella. The pizza is a crispy Neapolitan with charred bubbly crusts. Pair everything with a negroni or a glass of wine and wrap up the meal with a tiramisu."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3b3BxOURBEAE",
            "text": "Bourdain spot! A fun, unpretentious neighborhood eatery. I didn’t care much for the olive, olive oil - very olive-y. My homemade ravioli was delicious. Bread was fine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucU5hN2JREAE",
            "text": "The food is great!  Had the roasted eggplant appetizer and fried calamari to start. Both were excellent. Then we had the Cacio e Pepe pizza (thin crust), several pastas and the salmon entree. All were best-in-class. We sat outside which was pleasant but very noisy due to sirens on the busy street. I’ll go inside next time. Also know it’s cash only so be prepared (they have an ATM, if necessary). Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMHRlSjB3RRAB",
            "text": "The pasta here is absolutely amazing — the Spaghetti al Limone is simple yet classic. The Prosciutto di Parma pizza is also delicious. It’s a great spot to gather with friends — the food is excellent, and the atmosphere is just right. However, the restaurant only accepts cash now, so don’t forget to bring some with you, or you can withdraw from the ATM inside the restaurant."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndHZhOV93RRAB",
            "text": "For the location this is pretty much what you expect even though it wasn’t a super nice atmosphere with us being by the kitchen. The food wasn’t bad. The pizza was actually pretty decent even though I do prefer a regular NY slice. I will say though about halfway through my meal I realized I was paying $30 for a can of Chef Boyardee. Decent priced drinks and good espresso but there’s way better Italian in NY :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUc2ZEN0N3EAE",
            "text": "Come on this place was truly wonderful.  It was eclectic, quaint, unpretentious and the food was just perfect. From the bread and olive oil with a zest of citrus, to the steak, thick cut, just nice and perfect.  The area is great too excellent for people watching.  Didn’t get any photos of the food.. but more than enough on here already. I’m sure you couldn’t go wrong with much. note: Cash Only.  Which is amazing.  Why pay the bank tax! There is a special menu too."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQcTRTc3RBRRAB",
            "text": "If you rated anything lower than five stars, then you are miserable. The best Italian I've had. 1am, food came out perfectly, the service, the timing. Everything we needed. 11/10 hands down. (Our food options weren't listed) We got the Vodka Pizza, Penne Pomodoro, and Tomato Salad with a Dirty Martini & Lambrusco. We will be back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfcWRfVkJBEAE",
            "text": "Lil’ Frankie’s leaves a lot to be desired.\nCame in with high hopes due to a colleagues rec. brought my partner and had a really bad experience this evening.\nArrived and hostess greeted us kindly, We got placed close to the kitchen which was exciting! This was starting off great as we were stopping for a fueling sesh before a night out.\n\nUnfortunately Lil’ Frankie’s dealt a bad hand on us tonight… Service was inattentive, on the menu it states that the staff is not pushy but that doesn’t mean waiting almost 10 mins to get a greeting and a glass of water, server did not greet us and went straight with “are you ready to order?”. Okay… we got over it and placed our orders…\n\nGot a salad to start, the spaghetti lemone and the pasta broccoli for mains. As we’re waiting for food we ordered our drinks a coke and a bottle of sparkling water(important detail for later).\n\nThe pear and Gorgonzola salad arrived and the flavor was decent but the presentation lacked big time and was not easy to eat, the greens were cut very large and the pears were chunky and uneven, the candied walnuts were a good pair but again presentation can improve and in turn help patrons enjoy the experience of eating a salad (who wants to have a hard time eating greens?)\n\nPlates and table were cleared for mains. Broccoli pasta was dropped for my partner she waited a couple of mins and I told her to start eating as my lemone pasta had not arrived yet. Reluctantly she began eating, a cpl minutes turns into a few more and nada.\n\nSince we were literally at an arms length away from the kitchen I noticed that the cook was making a bulk order of lemone spaghetti— my guess is he had several orders for different tables, so he plated the big table and sent it out and finally mine came out. Got dropped on the table without any comment from the waiter at all. I tried my pasta and the sauce was not sauce it was lemonade, he had made such a big pot of pasta to save time that mine and probably the other tables got spaghetti lemone soup with a dash of Parmesan. Totally unacceptable.. at this point my partner was about to finish her dish which surprisingly was not bad at all, the broccoli was well cooked, the pasta al dente and well seasoned with a healthy amount of garlic and basil. truthfully I always feel terrible sending back food and starting an argument with a waiter so I ate and finished my lemony soupy pasta and asked for the check.\n\nWaited… waited.. casually noticed the cook grabbing chicken parmigiana fillets with his bare hands 🙈…. Finally got my check and to my surprise I find out on top of the whole experience that a 1L bottle of Pellegrino is $13 LOLz… that is CRIMINAL!!! I’ve never paid $13 for a bottle of sparkling water. Not even Michelin star restaurants charge $13 for Pellegrino.\n\nSuch a Big Hype for lil’ substance and underwhelming time."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQaVBxYV9nRRAB",
            "text": "Perfect late night experience! A few friends and I made a reservation for 10pm on a Friday night after a comedy show and it did not disappoint. Not only was our waitress super friendly and comical, but the atmosphere in general was good. And the food was DELICIOUS! I love me a good espresso martini, and this one definitely ranked high on my list. I got the specialty calzone and the fresh cured salami in it was AMAZING.\n\nThe only bad thing I would say is that the bathroom is definitely tiny and they only accept cash. There is an ATM at the restaurant but we ended up having to wait 15-20 minutes to use it since we didn't take out enough cash."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6NkwyZEtnEAE",
            "text": "We arrived here for a late-night bite and couldn't believe how pricey this restaurant was. We ordered a custom 12-inch pizza and a ravioli dish. The cheese pizza with mushrooms, olives, and sausage was nearly $30, which seemed excessive. The pizza was unimpressive, and they added parsley, which I didn't like. The ravioli tasted like it had been microwaved and was not good at all. Our bill came to almost $80, not including tips. The service was good, but the food was very disappointing."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmaDhMcmJ3EAE",
            "text": "Delicious flavours and dishes. We tried a bunch of different things. Service was great as well. The only negative thing was that the tables were a little bit small and uncomfortable. However, I would definitely return"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIem9uT2hBRRAB",
            "text": "Lil Frankie's is a cozy Italian spot in NYC that offers a warm and inviting atmosphere. Known for its wood-fired pizzas and homemade pastas, the flavors are rich and authentic.\n\nThe casual vibe and friendly service make it a great place for a relaxed meal with friends or family. If you're in the mood for delicious Italian comfort food, Lil Frankie's is definitely worth a visit. Im a sucker for a good salmon, and I ordered a medium cooked salmon + arugula salad.\n\nMy friend ordered pizza with olives and anchovies. Delicious with marinara dipping sauce. Will definitely be back!\n\nSomething to note: this place is CASH ONLY. That thankfully have an ATM on-site, but would prefer to have gone to an ATM by my back to avoid fees."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINm9USDRRRRAB",
            "text": "Some friends brought us to Little Frankie’s and it did not disappoint! Super attentive staff - you were never left with an empty water glass!\nThe food itself was just what you want from an Italian -  classic and just extremely tasty.\nThe rigatoni polpettine ragu was delicious and generous with the amount of meatballs too!\nGreat vibe from this place!\nCASH ONLY!! (ATM is located inside)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUNzZpS0dREAE",
            "text": "This place is located in a great area, very inclusive, with a lot of different people. Perfect to hang out late night.\n\nWe got very late night dinner here and I'm definitely coming back!\nSurprised with the amount of people hungry for italian food at 12am, the place was packed, very good vibes tho!\n\nPIZZAAAA!!! 🤤 can't get enough of the burrata pizza, it's sooo good and delicious. We order the eggplant appetizer, it was perfectly cooked, I added some salt and pepper to get the flavor on point for my palade. We also ordered the ravioli pasta with ricotta and parmesan cheese. The homemade tomatoes sauce is so perfect.\nThe food was so good and I was so hungry that I forgot to take more pictures, haha.\n\nService!!! Congratz, your service was great, everyone supporting each other and everybody was very nice.\n\nIt was a great experience and I definitely recommend it! Specifically for italian food lovers, pizza lovers, vegetarian, late night hungry people. THIS IS THE PLACE!\n\nNegative points:\nThe space is really small, visually uncomfortable, not that bad once seated.\nThe bathroom is also small and uncomfortable to use, but clean which is the important thing.\nParking is gonna be really difficult, don't try."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXdmMyNzhnRRAB",
            "text": "Came here with a few friends and it was a great time. We ordered some drinks and a shareable margherita pizza for the table. I then ordered the gnocchi w meatballs, and a few other pasta dishes for my guests with another shared egg plant. I have never been a huge fan of egg plant, however the server cutting it open, seasoning it, and cutting it was an experience if itself. This did not taste like an ordinary egg plant and was very unique. The gnocchi was cooked perfectly as well as the meatballs were a great small little size and was a generous amount in the plate. The service was good and helpful and patient when we were still deciding what to order. Would definitely come here again although I would MAKE SURE TO BRING CASH/DEBIT next time I do. Felt like a college student when we were all forking up cash just to cover the bill but we made it work. Support local businesses especially this amazing classic place with beautiful ambiance."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxeS1qZFRBEAE",
            "text": "This place was very good. They recommended it to us and we weren’t disappointed. The pizza was really good, pasta too and the portion size is really big so that’s good for sharing. The icecream was disappointing, it said in the menu it was homemade but it felt old and as if it has separated because of melting and then freezing again. Apart from that everything was very good and the atmosphere was good too. Something to add, this is a cash only restaurant so if you don’t have cash they have an atm on the back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dTlfNEl3EAE",
            "text": "I rate this place Top of the line. Perfect for any occasion, be it a family gathering or an important date. Its staff is incredibly cordial and friendly. Catering to specific requests too!\nEvery single time I go I have a wonderful time. Guaranteed best espresso martinis in lower manhattan. Try their Baileys martinis too! Here is a photo of a delicious meatball bowl. An item that wasnt on the menu but the server kindly prepared for my plus 2."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGR01YaGpNWGRNUjBkYVpFMUpaVGhxY0RKVGNFRRAB",
            "text": "Came in on a random Monday night after 9pm and was able to get seated quickly. Was advised before seating that it is cash only and there is an ATM in the restaurant. The fried calamari was amazing as well as the chicken parm. The service was great and the atmosphere was cute. Would come back again"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybmJ2OHV3RRAB",
            "text": "Good energy in this venue! Came here with a group of five friends. The table bread was good, nice and soft not too crusty, but the garlic bread (which was $8 for one piece) was the same exact bread just with a huge amount of butter and a little parmesan cheese added. The lasagna Bolognese was Very very good, as was the veal pasta and the chicken parmigiana. Unfortunately the pizza margherita was lacking in flavor, specifically in the sauce. I feel like for a restaurant to specialize in brick oven pizza there are only three things you must prove yourself worthy with: a quality crust, a well seasoned sauce, and quality mozzarella. The crust was on point, as was the mozzarella (I mean it's just cheese haha) but the sauce was missing some components even just a bit more salt during the cooking process would have brought it up to par. All in all it is a good little spot to visit for Italian food, I just don't recommend any of the pizza necessarily."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaMFBmR1p3EAE",
            "text": "4. Cute, family-style, Italian spot with a large menu.\nThe food is simple, what you see is what you get, a little bit no frills! Big menu and lots of daily specials- there is something for everyone. The pastas we ordered cane covered in parm (not the fresh grated kind) so if you’re not into that, let them know.\nService- it was kind of slow and lackluster- friendly enough but perhaps she was overwhelmed by the number of tables she had to serve, though it wasn’t that busy.\n\nAble to get a walk-in on a Sunday night on the patio and lots of tables available inside.\n\nCash only. Washroom is not nice but it is on the main floor.\n\nAtmosphere is nice, intimate and casual."
        }
    ],
    "reviews_count": 84
}