{
    "name": "Foul Witch",
    "place_id": "ChIJq6oPsoNZwokR1hGiiD3wy8g",
    "grid": "MN3",
    "address": "15 Avenue A, New York, NY 10009, USA",
    "rating": 4.3,
    "user_ratings_total": 272,
    "phone_number": "(646) 475-7099",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vNVNqVlZZMnR5UlhKWmFVaEVhekJvZG1KdVJrRRAB",
            "text": "Foul witch was so great! From start to finish- we had the best time. And the bathroom is out of this world!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5bVgxbE9hbWhhUldKSGRHRTJVekJRZUd0MGNVRRAB",
            "text": "Over $300 for two people for some small plates that were less tasty than I've made myself... You can get better food for half the price in NYC"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKYU5sQlFWWGxvWkZoSGVuaFJaVTVHZFZwVkxVRRAB",
            "text": "Dishes were overly vinegary/pickly and it took 40 minutes for lukewarm porchetta to come out."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psMVVrOU9RM3BrYmtwa05FaFVNMHh3TFc1bmRYYxAB",
            "text": "Really fun place & really yummy food! We visited at noon on a Sunday & got a chance to try the brunch menu. We tried the celery, the heirloom tomatoes, the mussels, & the sesame focaccia. The tomatoes were my FAVORITE!! They were on a bed of this delicious pistachio milk sauce and that went so well with the bread. The mussels were so fresh and the sauce was delicious. Highly recommend! Love the cute decor too."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSdU4xb3hTM05qUTI5aExVSnFWV1JuYm5nd05sRRAB",
            "text": "Was here in May and keep thinking about how strange this dinner experience was. Firstly, they serve no Italian wine. I think there was one bottle on the menu when we were there but it was out of stock so we couldn’t order it.. so odd for an Italian restaurant. The service was extremely odd, too - our questioning of the wine menu wasn’t well received. Lastly the entree portions were absolutely tiny. We planned to share everything family style (myself and 2 friends) and told the waitstaff that but they give no indication that the plates were not suited for sharing. Definitely plan to order multiples if you want to share. Like others said the celery salad and focaccia were very good. Overall, would not recommend as there are obviously plenty of other Italian spots to go."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdVgxZGhWSE5GUjJWNk9VcExlVEpRTFZGWWFXYxAB",
            "text": "We went in for brunch. Food was good. However we were rushed because the staff was preparing for dinner service and sat us practically at the exit. They should have given us a table away from the dinner service area so we could have enjoyed the restaurant and our food. Not impressed"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wRExUbHFOekl3Y1ZWelQwNTFWbWxKUVdoU2JXYxAB",
            "text": "Foul Witch: A Spellbinding East Village Experience\nFoul Witch in the East Village cast a delicious spell on us! Our meal was nothing short of incredible, elevated by a fantastic waiter who masterfully balanced attentiveness with space, allowing for an unhurried dining experience that feels increasingly rare in a city that prioritizes turn overs. We never felt rushed, with courses perfectly spaced. The warm paté \"Testa\" with focaccia and butter was wildly good, and the pomodoro pasta was outrageous – each perfectly cooked tomato bursting with flavor. The lamb for two, with its crispy ends and medium-rare interior, was  phenomenal. I debated asking to bring the bone home \"for the dog\" but decided that my wife would likely still love me if I gnawed the bone at the table (she still does and it was deliciously primal). on the bone right at the table! Foul Witch delivers a truly exceptional dining experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaTFkwbzVUbUpPZGpNNVIwOVlVekZqVkcxWGFFRRAB",
            "text": "one of my newly favorite restaurants in nyc. i was blown away by every dish. the service was amazing as was the atmosphere. i can’t recommend foul witch enough!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ocFRXdHdjRlpUT0ZRMFRFNW1jazFJYWs1SmJVRRAB",
            "text": "Great ambience with delicious food. Went for a pop-up event and it was hard to not order everything on the menu. Dishes were fresh, seasonal, and delicious."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkRlptWnZiazVxTUdGRVRETTVVbFJQWXpaUlkyYxAB",
            "text": "Everything is incredibly delicious and creative beyond your standard Italian fare. Prices are reasonable for the area and service is phenomenal."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210WlJIZ3dkRFJuUVRZNU1tWXdWRlJIY0haRWNuYxAB",
            "text": "Service and vibe were wonderful, but food itself was a little uninspiring. Focaccia was delicious, but not sure why it was pre-drizzled with tons of olive oil when it also comes with huge dollop of butter. And with that fatty testa on the side, you kinda wish it were some plain bread instead. Squash and sweet potato came harshly acidic, which I feel is a waste to the mild earthiness of the fresh plants. Shrimps were beautifully done to the right tenderness, but flavorwise it felt a little lacking. Lamb came in huge serving, and I had fun with the mint jelly, but with that pungent gaminess, you can just tell it wasn't very good lamb."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1c1lqTnJaakpVVUVOa1NsbGFlVmxYTjFJd2FsRRAB",
            "text": "Sat at the bar, had an AMAZING dinner. Pasta was truly spectacular. Small servings / almost tapas"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCTlprWXlUa3RTVjJ0RFIydFNTMWhUTW5kV2FFRRAB",
            "text": "Very good food, lovely setting, and unpretentious service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oeGFFZHRaVzFSZVRrNFJrSjZNMFF5VFV4ZlozYxAB",
            "text": "Excellent service here! very friendly staff."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPdkh0Sy0wenMtS1l3EAE",
            "text": "The place is too tiny and the drinks and food mediocre"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQM08zZXJ5bmFLM2VREAE",
            "text": "The focaccia was delicious, especially with the cultured butter. For dinner I ordered the stracciatella with anchovies, scallops and the veal tortellini. I was dining solo and I felt as though the portions were a perfect size. For dessert I had the unpasteurized milk gelato. It was topped with a dollop of olive oil - great combo!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMbk52NkR2ajZPY0lBEAE",
            "text": "Amazing interesting delicious food. Service is so good! They obviously care deeply about the food they are serving"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOR2pvcTJBNHBUZXBnRRAB",
            "text": "Foul Witch is a foodie place. Good food, good quality, good people. Not generic or boring. Great wine menu. Quirky ambiance.\n\nIt’s the type of place you go if you know good food but you just want to hang out with your friend and talk and you don’t want to be in a scene.\n\nInsanely good pasta options. Great vegetables too. It’s kind of like Misi if Misi were more cozy and too cool to care about being cool. (And also in a better location). Actually it might be better than Misi…\n\nAlso, always love an open kitchen!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKT3EySWE0NF9lNXF3RRAB",
            "text": "Super micro proprio a of food, mediocre quality and very mediocre service too. The atmosphere is just underwhelming as well. I just know I spent a lot for leaving the restaurant hungry with 1 shared appetizer and 1 appetizer and 1 main dish ordered per person.\n\nMaple syrup tiramisu is just a very bad idea. What you serve is not Italian food and you should not sell 5 bites of pasta for $25 unless quality is top notch . Very disappointed- won’t come back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQZVk0LTNUa3JIdFpBEAE",
            "text": "Really delicious meal. Every single (of many many) courses were just outstanding. Every category charcuterie, appetizer, salad, pasta, grilled meat. And interesting and good wine by the glass choices. This meal was substantially better than about a year ago (which was interesting and good enough that we cane back)."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNGRLRkdREAE",
            "text": "I visited this restaurant to celebrate my best friend's birthday, and overall, it was a lovely experience. The meal, from the focaccia bread and butter to the lamb dish, was flavorful and enjoyable. The restaurant also offers a nice selection of cocktails and wines.\n\nOne thing to note is that the portions are on the smaller side, which makes the meal feel a bit pricey. However, the quality of the food makes it worthwhile. I would definitely recommend it for special occasions!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbG9Pakl3EAE",
            "text": "The first time I came here, had an amazing experience. Came with 2 friends, I got the pork, a friend got the steak, another friend got the skate. Everything was delicious. The foccacia and butter were heavenly.\n\nThe second time I brought another friend.\nStarted off on a bad note - I wanted to order the steak bc it was that good last time, but they ran out at 6pm.\n\nSo then I got the veal tortellini for $26. It was incredible. But it was absolutely tiny. It looked like a joke it was so tiny. Like the kind of bowl you might put a bit of fruit in. My friend and I looked at each other in disbelief. I was so sad bc it really was delicious. Her pasta was also small but a lot more filling.\n\nWas very sad :/"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNnRia0ZREAE",
            "text": "The mains and the salad were over salted. I managed to finish but it was a tough experience.  The food was late about almost an hour; however,  the servers were super cool and tried to rectify the situation.\n\nBest thing about the dinner was the sesame bread and butter 🤷🏿‍♂️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3eFBudU1BEAE",
            "text": "Had a great time at the foul witch, one of my favorite restaurants I’ve visited in nyc. Tried a large variety of dishes and all were well balanced and tasty. Service was attentive, friendly and unpretentious and the vibes were stunning, great for a dinner with friends or a romantic evening. Loved it here"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cGVXMG13RRAB",
            "text": "I’ve been here a couple of times and this place keeps blowing me away. Obviously the atmosphere is iconic, but the food is just next level. I think they’re a decade or two ahead of the curve."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdk4yMXJBRRAB",
            "text": "Atmosphere is really lovely for a date or with friends. Best bread and butter in the city. The pastas are delicious."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnOExyYXB3RRAB",
            "text": "I loved the vibe. Frieny staff! Thank you for an amazing night!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnc09XLVRnEAE",
            "text": "Great vibes.. it was very just Friday night. The food was very unique and well prepared."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURna0tIQUVREAE",
            "text": "The food, atmosphere, and service are unmatched! I will be having many date nights here in the future!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURna042Z013EAE",
            "text": "I was quite impressed with the presentation of the food. The staff is very polite and pleasant. I loved the atmosphere of the restaurant and the food came out very fast!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBczVqMDRBRRAB",
            "text": "I don't like writing bad reviews, but this was a pretty rough experience (Feb 10th 2025). There were three major issues that went from disappointing to infuriating.\n\nFirst, the food was barely okay; the grilled wing of skate was a bizarrely flavorless pile of cartilage with maybe two bites of edible food (the potato side dish was good, though). The mackerel seemed turned, and the veal tortellini, while good, was more of an appetizer than an entree.\n\nSecond, we were overcharged by almost $80 - a full bottle of wine was added to our bill, when in fact there was only a glass ordered. We were charged that, and it wasn't reversed, despite assurances that it was.\n\nThird, and most serious, was that the server ignored the fact that one of our party is sober. She explicitly ordered the \"Fire Walk With Me\" mocktail, clearly on the non-alcoholic menu, after asking for assurances that it was in fact non-alcoholic - but was then brought the \"Laura Palmer\" vodka cocktail.\n\nWe only learned that it was the alcoholic drink after she started exhibiting signs of intoxication. The server verified that it was, in fact, the alcoholic \"Laura Palmer,\" which was further reflected in our bill. Both drinks are made the same way, and the intensity of the fennel and chili masked the taste of the alcohol.\n\nShe's been sober for over a year, and this accidental break in her sobriety was extremely distressing.\n\nIt might be a good idea to not name your stupid overpriced twee drinks something that could be so easily mistaken, especially when the consequences are so incredibly dire for the person ordering.\n\nI don't know how to get the charges to my card reversed yet, but I will never go back to Foul Witch."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfcmRDRlBnEAE",
            "text": "It was sort of like all the food in this restaurant was challenging you to think \"is this edible\"? Strange textures, ingredients, presentations, definitely in line with the spooky theme. I can't say I've ever been at a restaurant where I've felt less appetized.\nAnd yet!\nI still had a great time. The food was obviously intentionally challenging, just not my type of challenge (I am not brave with meat).\nCan't speak to the drinks because we were doing dry January, but they looked delicious.\nThe service was great. We liked the drum and bass music. And it's got the coolest bathroom I've ever seen - a big Chinese dragon head mounted over the toilet, and, mysteriously, the same Beach House song playing on repeat?\nIt was an adventure, and I don't regret it, though I certainly would not eat here again (but might come back to try the cocktails). Cheers to the chefs for your creativity, regardless."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcHIyaGlBRRAB",
            "text": "the Foul Witch is that sexy little spot you have heard about AND should definitely visit. the butter beans w Verde.... OMG. the focaccia with culture butter? SAY LESS. fresh tortellini's of veal or butternut squash melted in our mouths. HUGE SHOUT OUT TO ALEXIS who not only served our dishes but served a bad ass look head to toe and was the sweetest with info on the menu and checking in. Thank you Foul Witch & Alexis xxxo"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbGNHMzhRRRAB",
            "text": "Very innovative tastes and flavors. The portions were a little small but i guess that is just NYC dining."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmb2RDV19nRRAB",
            "text": "This place deserves to be rated much higher. Went in on Xmas Eve and everything was absolutely amazing. Highly recommend the Pork and Butter Beans. Fantastic wines by the glass as well"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MU9LeVlnEAE",
            "text": "We got the dutch baby, the honeynut squash cappelletti, and the veal tortellini.\nDutch baby was quite small and the flavor requires some time to adjust to. I…"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6LUlDR0xBEAE",
            "text": "The kitchen crew evidently boasts about their craft, resulting in delightful dishes served amidst a charming ambiance, complemented by impeccable service. Indulging in dessert was an exquisite experience."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2NWFtaVR3EAE",
            "text": "Bread, great.  Anchovy & stracciatella, can’t go wrong.  Tersa (head cheese), delish.  Pancetta kind of a rip off for the price.  Tortellini, one of a kind and worth it.  Lobster linguini, meh.  Wagyu, amazing and worth.\n\nOverall this would have been a 4 star meal—pricy but with some stand out dishes making it worth it, except the hen dish which was weirdly stringy and when we shone a light on it (dark venues hide sins?) revealed that parts were basically raw with bloody red meat around the bones.  Even this was forgivable (ish) but what was unforgivable was that when we, very gently and kindly, showed our sever the dish and shone a light on what was very obviously bloodied raw chicken and asked “we think this might be undercooked?” She scoffed and said “well it’s not, but I guess I can ask the kitchen.”  Turns out kitchen agreed with us, but how hard would it have been to simply say “let me check on that for you” instead of giving us that attitude?"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzb1BUNTVRRRAB",
            "text": "Went for dinner. the butternut squash dish is amazing. The lobster linguini is too salty and disappointing. Love the bread tho. The hen is nice. Love the vibe there but don’t love the waiters‘ attitude. Their attitude doesn’t match the restaurant at all which makes it harder to justify the price of the food and the portion."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzODVpSEN3EAE",
            "text": "Such a laid back experience. The quality of food was outstanding. The Ms. and I split meals. Places like this aren’t about huge/grotesque portions. This isn’t Cheesecake Factory. This is well crafted meals. A bottle of wine, 4 plates, came out to such a reasonable price. Great music. Staff was super pleasant and not obtrusive."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzX2RIbDZnRRAB",
            "text": "This place IS A VIBE. Service was warm but fast. Every bite was packed full of flavor with all of the dishes being so unique and deep in flavors. Love every second of our visit! Thank you for sharing your skills, passion, and art with us!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNllpcm53RRAB",
            "text": "Incredible food and vibe, but the portions are comically small. The $25 dollar pasta dish was 10 pieces of tortellini. Left this place still hungry!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYNWRQR2NBEAE",
            "text": "It’s a nice place. I really like the bread that there is"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdUlHMEdBEAE",
            "text": "DO NOT ATTEMPT A WALK-IN SEATING HERE BECAUSE THEY WILL ABSOLUTELY LIE TO YOUR FACE!!!\n\nI was in the area on a Saturday night and had seen this place recommended on the NYT Top 100 so I thought I'd try to see if they could seat 1 as walk-in. The host said they didn't have anything available right then but that he could put me on their wait-list. And that it'd be about a 35 min wait. So I agreed and went and did some errands. I circled back after about 40 mins and they still didn't have an opening. When I asked if I'd have time to go somewhere nearby to get a drink while I wait, I was told \"more than enough time.\" I took my sweet time getting through a glass of wine. It'd been about an hour and a half since I first got on the wait-list. Finally I decided they must have just forgotten about me and was just googling a different place to eat in the area when I FINALLY got the notification that my table was ready. TWO HOURS LATER!! Timestamped texts screenshotted.\n\nThat all said though, good food will cleanse all manner of sins. And the dishes here were DIVINE!!! I got the geoduck and wagyu and they were perfect. The geoduck especially was done properly - crisp and tender without being rubbery.\n\nBoth the server/bartender and the host were absolutely lovely. They apologized for the wait and gave me free bread to make up for it. I'm only scoring service at 3 stars because of the insane wait. Once I got in, the service was perfect.\n\nThe place does fall short a bit on ambiance. It's just a little loud and very dark, with not the most comfortable seating.\n\nAll in all I would def come back, but next time I'll def do it with a reservation!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuODRPdjh3RRAB",
            "text": "Just not worth the hype. Dishes are so small and the prices are so high. Not worth it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIOXZ2RmVREAE",
            "text": "We utterly enjoyed it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINExYWV9nRRAB",
            "text": "The food was amazing. My only complaint is that the portion sizes are too small for how much you pay."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3dEkySzd3RRAB",
            "text": "An amazing birthday dinner. The food was amazing, the service impeccable, and the vibe fantastic."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURialkycmJnEAE",
            "text": "We were one of if not the last table sat tonight because we came after a show for a late dinner and having worked in many restaurants myself I know how annoying that can be but the staff was so so kind. They never once made us feel rushed or seemed annoyed by us being there late, they were simply wonderful the entire time. I’ve been before so I already knew that the food and wine is amazing there but the service tonight was especially impeccable. Thank you to everyone who served us tonight for making me feel so welcome for a long overdue catch up with a close friend and letting us eat dinner at 10pm on a Wednesday without feeling like we were being rushed out or annoying you!!"
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiOGNQdVBBEAE",
            "text": "Sehr gemütliches italienisches Restaurant mit köstlichem Essen und ausgezeichnetem Wein."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMejdLRFZBEAE",
            "text": "@lydieats 💕 The space has a spooky quirkiness to it thats done in a tasteful way & could be romantic if not for the loud music. It’s worth a try but lacks the charm for a second visit imo.\n\nThe highlight is the “off menu” fire & ice, a mix of spicy nduja sausage and creamy stracciatella cheese. Two very different textures and flavors that combine together very well 😌 Unique but also familiar! This with the complimentary bread (esp the focaccia!!!) is the best bite of the night. Also their butter 💯\n\nIf you can get past the VERY small portions of the tortellini, you will taste a strong amaretto flavor that feels a bit off against the rich veal filling. And rly the 15 tiny pieces of pasta is shocking even in nyc standards 🤨 Potatoes are served cold, covered in a lovely butter blanc sauce & paddlefish roe. I rly liked but feels like a financially irresponsible reco. Oven baked hen is good, very juicy with a light ginger sauce but at the end of the day, just chicken.\n\n💕 Veal Tortellini $32\n💕 Fire & Ice $26\n💕 Dressed Chicories $24\n💕 Purple Peruvian Potatoes $36\n💕 Guinea Hen $56\n\n이름이랑 잘 어울리는 마녀의 집같은 분위기의 모던 이탈리안 와인바다. 그렇다고 유치한건 아니구 펑키한 바이브 😎 히든 메뉴인 fire & ice 주문 필수!! 매콤한 소시지랑 크리미한 치즈의 조합이 맛남. 이거랑 식전빵이 베스트. 다른 디쉬들은 쏘쏘. 뭔가 딱히 인상깊은게 없다. 토르텔리니는 맛보다 쪼끔한 사이즈가 기억에 남고, 감자는 차갑게 나와서 약간 당황쓰. 오븐 암탉 구이는 낫배드!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6bTZ2cnRRRRAB",
            "text": "Remarkably excellent food and an undeniably fun, but unfussy experience. Portion size is appropriately petite for the richness of the food. Butter is the unifying flavor through the menu. Don’t miss their pastas. The bay leaf ice cream is beautifully executed a perfectly intense and beautiful bay flavor. Interior is witchy-chic, which sounds impossible to pull off, but they do. Service is exceptional. Worth a special trip to Alphabet City."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbjZ6VjJBRRAB",
            "text": "The bread here is to die for. The fresh warm bread with butter on the side is the main reason why I will definitely be back.\n\nWe got the testa which is a pork terrine that is toasted and served with pickled peppers to spread on the bread. Delicious, fatty, and meaty. Perfect with the bread.\n\nThe scallops were huge and so tender. 10/10 would get again\n\nMasquerade potatoes reminder dme of just a baked potato. Beautiful presentation and delicious but not our favorite on the table.\n\nEnglish pea geravole was solid\n\nGuinea hen was a great dish. The vegetables paired with the perfectly cooked chicken made this a wonderfully balanced dish. I'd definitely get again.\n\nDon't miss dessert here. I keep coming back to the sake lee's cake. I can't imagine eating the ingredients separately and enjoying it, but together they make the perfect bite. They have some great after diner drink options as well!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGNXBpN0hnEAE",
            "text": "Foul Witch deserves the praise that it has been getting for creating a menu that has exquisite and subtle flavors that really lets the ingredients shine.\n\nThere were many standout dishes here but the one I kept thinking back to with how unique it was was the mackerel. Really one of the best bites of food I have eaten.\n\nAll of the food is expertly paired with unique wines and excellent knowledgeable staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUeGNQY3ZRRRAB",
            "text": "The wait between dishes was outrageously long, service at the bar area wasn't attentive.  Portions were small for the price. Acoustics are terrible. It's much too loud for dinner. Wine list is good though.\n\nThe guinea hen was tender, and moist, crispy skin, well seasoned. The scallops had good flavor, perfectly cooked, and the rhubarb and kumquat provided brightness to the dish. Nduja Cappelletti was too salty, the dish was overall flat. Dressed Chicories salad wasn't anything special. It was well dressed though."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1Z3VpdmVnEAE",
            "text": "The bread is amazing! Service is great and attentive. The server wine suggestion was great, as well. Portions are very small and, in my opinion, over price. Appetizers were good, nothing out of the ordinary. The pasta with crab was very good and flavorful. However, they give you a child's portion. The mushrooms' pasta I do not recommend it was not good at all, although I ate it since it was over 30 dollars for about 6 bite pieces. Did not stay for dessert"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNscXRXZmhRRRAB",
            "text": "Very much not worth the hype. The food was maybe a 5/10 on average. The pine nut casoncelli honestly tasted like pasta water, and their menu staple veal tortellini was in this strange maple flavored soup, and it tasted like a breakfast sausage. The complementary bread and butter was the best thing we had. The vibes and service, on the other hand, were 10/10."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkak95Qjh3RRAB",
            "text": "Every meal at Foul Witch begins with a complimentary portion of bread and butter: a wedge of crisp, oil-slick focaccia; a length of sour baguette, bien cuit; an enormous dollop of yolk-yellow butter, soft as cake frosting, salted like the sea. It’s a struggle not to finish every bite, which would be strategically unwise, given what’s to come.\n\nThere is far-reaching flavor in the duck prosciutto. It’s made in the restaurant, like the testa, which is served on a warmed plate so it melts into a delightfully drippy mass of soft pink meat and softer white fat. You might want to spread it — or pour it, really, because it is nearly liquid — over some Foul Witch focaccia or Roberta’s bread. These two are a study in contrasts; the crunchy, chewy bread requires some commitment from your jaw, while the tender focaccia almost dissolves on your tongue."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREa3FtSzZnRRAB",
            "text": "Some huge upsides, a little disappointment.\n\n$144 a person - 2 glasses of wine per person, 2 appetizers, 1 pasta, 1 protein/main. Very expensive for the portions you get.\n\nThe food - amazing: (1) bread was phenomenal (some of the best focaccia we've ever had, homemade butter was perfectly salted), and (2) the guinea fowl/hen was a truly memorable dish (the scallion/oil/rosemary sauce was super flavorful, the meat very juicy).\n\nThe food - meh: (1) chicory was super refreshing but there was literally nothing on the lettuce besides dressing, for $24 (can't even buy a smoked pine nut or two...?), (2) the potatoes w/roe were pretty tasty but $36 for like, half of one large baked potato was not worth it, and (3) the crab pasta - the flavoring was SO good, but as other reviewers had called out, we might have had 1/20th (seriously - I think one crab would fuel 20+ of these plates) of a dungeness crab in the pasta and the portion was tiny, again for like $36.\n\nThe service was great but the restaurant is still working out some kinks - it's almost like they soft launched it. The floors are weird, the silverware and tables and chairs don't match, it's not a super intimate setting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNscDdQUDBRRRAB",
            "text": "Is it worth the hype? Based on my experience on a recent Friday night, yes. Service, with the exception of the host, was friendly, warm and engaging. We started with a glass of wine at the bar where the bartender let us try a few interesting wines before we landed on an interesting and unique chilled Croatian red wine. He also gave us some recommendations, including an off menu item called Fire and Ice. This dish is a definite MUST. Spreading it on their homemade, warm, and crusty bread was almost a religious experience. Our waitress guided us the rest of the way and encouraged us to look at the menu like a tasting. This is DEFINITELY how you should approach the menu. You are not going to get an entree sized pasta. What you will get though is a few small perfectly cooked ravioli in a delectable broth that explode your tastebuds with a smooth and silky veal. Highlights were the fire and ice, potatoes, and ravioli. Extra points go to the free bread that was phenomenal. It shows they put thought into every element of the meal. We will definitely be back to try more of the menu!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxOHFTODFRRRAB",
            "text": "Fantastic meal that exceeded expectations. Every single dish was delicious - it’s tough to pick a favorite. The signature veal tortellini is a must-order. The bread really is THAT good. Just go!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0eTczTndRRRAB",
            "text": "The food we ordered was fantastic, as was the wine. The ambiance was nice (candle lit, not too loud) and service was attentive and helpful. One star off only because the serving sizes of the entrees were wildly tiny. The serving size of the veal tortellini could literally fit into a small teacup. That said, the server did warn us that we’d want to order multiple entrees and appetizers to share, even just for two people. The veal tortellini was phenomenal, as was the wagyu beef carpaccio. The chitarra with dungess crab was very good, and the sorana beans were surprisingly good. We ordered a bottle of Bellevue, which is now definitely on my wine list."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsZ1p6TWNBEAE",
            "text": "Had a new top three favorite restaurant in NYC  after having dinner here with my girlfriend. Absolutely ask for the “off menu” fire and ice. It was the top dish amongst strong competition. Also, the numerous recommendations to approach the experience like an a-la-cart tasting menu were spot on. Dishes were mostly small, so order lots of things and sharing them to maximize what you get to try!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5OWJ1RXVRRRAB",
            "text": "fantastic dishes. pasta is phenomenal, service is great, atmo is unique. go late and you and snag a seat at the bar sans reso. must get the sorana bean dip  with salsa verde with fresh bread. too good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobk9idFJ3EAE",
            "text": "VERY COOL new spot on the Lower East Side by the team from Roberta's in Bushwick. Reservations are hard to come by but I got there at 5pm and snagged a seat at the bar. I tried 5 menu items (2 of which were desserts). Loved the anchovies - super delicious especially served with their breads. The veal tortellini, also delicious, but at $28 for a teeny, appetizer-size portion was overpriced. I ordered two desserts (the winter citrus and the bayleaf ice cream) and both were sublime!!  I also tried the pork which was good but not really my thing. Staff/service is GREAT and the ambiance/vibe is amazing. They also have a large table set up that is perfect for a group dinner for 6, potentially 8 ppl. At the moment, they are open Thursday - Monday but I hear they will soon be open 7 days a week. Great new addition to the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNseXBfTUV3EAE",
            "text": "The food was for the most part great, especially the bread, anchovies, and goat. We thought that the veal pasta with amaretto that the waitress strongly recommended was overrated (and yes, it's small). The service was friendly, but was scattered; they showed up many times at inopportune times to take away food that was being eaten, and fill up full glasses of water. The vibe is nice and welcoming, but the tables are really close to each other and it gets loud."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKLTVtOFhBEAE",
            "text": "Definitely recommend going to Foul Witch for a fun date night or a wine night with a small group of friends!\nFood:\n•Fire & Ice - This dish is a dreamy combination of creamy stracciatella and spicy 'nduja sausage, which can be perfectly scooped up by their incredible bread.\n•Coppa - This thinly sliced, melt-in-your mouth Italian meat is a great pair for their delicious wines!\n•Sorana Beans - Do vourself a favor and treat vourself to this bowl of beans. The creamy white beans are doused in olive oil and a flavorful salsa verde.\n•Veal Tortellini - The texture of this dish is insane! These tortellini covered in amaretto are perfect pockets of fatness and flavor.\n•Sunchoke Caramelle - Love the intense lemon flavor here and the slight crunch from the poppyseeds!\n•Ice Cream - Foul Witch had a few creative ice cream flavors including a wildly savory Sourdough ice cream.\n\nFoul Witch has great wine and beer selections with some fun and rare finds!\nFirst we got a bottle of the 'Chette Baker skin-contact\nGewürztraminer from Barbichette in the Finger Lakes. This wine was perfectly juicy with intense tropical fruit flavors of passion fruit and pineapple as well as notes of lychee, grapefruit, and spice. Highly recommend this wine, and it was a great value!\nThen we tried a super interesting co-ferment from Veneto, Italy made with Syrah, Grenache, and Garganega. The result is a punchy, light red wine with some serious acid!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobFBLR1lBEAE",
            "text": "You know how sometimes you can tell a place is about to blow up and feel lucky to get there before it has? Those are the vibes Foul Witch is giving off right now.\n\nFood menu broken down roughly into appetizery things, vegetably things, tripe/uni polenta, pastas, and mains. We skipped the mains and ordered a bunch of the smaller dishes. Highlights were the fire and ice, uni on polenta, mushrooms in brodo, and garganelli pasta.\n\nGreat selection of beers and wines by the glass (including a very fun skin contact).\n\nService was on point and timely, vibe is perfect for date night, which my buddy's wife might object to, at least until he takes her."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwLTdDZjFRRRAB",
            "text": "Very cute spot with delicious food. Portions are small but filling, wine is great - even though you only have wine, beer and non alcoholic options. Definitely coming back! We got 2 apps and 4 mains for 5 people and it was enough. I wish we could have the dessert but we were full."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOM29fSkZnEAE",
            "text": "Amazing food and service. Each dish full of flavor. Do order the off-menu \"fire and ice\" (n'duja and stracciatella, goes beaut with their breads) as other mention. The veal pasta, the crab one, and the gelato checked all the delish carbs boxes. Not pictured, cantabrian anchovies and Sorana beans with green sauce, also delish (anchovies slightly overpriced?). Taking one star off Atmosphere bc of the high ambient noise. Other than that, we'd totally go back. Oh, super nice wine list!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaOEw2NUhREAE",
            "text": "A cute and cozy spot. As others mention, the portions are very small but the food is good. I found the desserts disappointing, but the appetizers and mains were good. I'd recommend coming here for small bites and a glass of wine. Great vibe to catch up with a friend or a date."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROb2ZISUpnEAE",
            "text": "10/10. If you’re reading this… get your reservation book and you just need to go!🍝🥬 highly recommend to start with the fire and ice… (epic)… and the uni pasta is just absolutely incredible. Finish your meal off with Sale Lees Cake!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoOE1QS0ZREAE",
            "text": "Staff was lovely and seated us quick. Be sure to make a reservation as we heard there was a waiting list of over 1500 to get in last weekend!\n\nThe restaurant had great interior design, elevating the dining experience. The drum and bass soundtrack makes it all the more cool. The bathrooms also had its own separate soundtrack (you'll have to go to find out)\n\nEach dish held it's own and we cannot wait to try the rest of the menu (which has something for all diets)\n\nMost notable were the Sunchoke Caramelle and Spacatelli with aged Game Bird Pastas.\nThe puntarelle, Sorana beans, roasted broso mushrooms, upstate potatoes with the paddlefish roe were delightful entry dishes. Each coule be eaten multiple times over. The Bread and butter was addictive throughout the meal.\n\nWine list is smashing. Ask about their rare German wines.\n\nOne of the best new restaurants in NYC. Sister restaurant to the infamous Roberta's.\n\nOur dear friend Skinny Pablo gave it an 8/8"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbzlESUNBEAE",
            "text": "Yes, the bread is great. Get some and then go have your mains somewhere else. The pasta, which is their claim to fame, was underwhelming. Flavor profiles were all over the map. \"Try hard\" was my first thought."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqanMtSmhnRRAB",
            "text": "Portions may look small but they are filling - especially the pasta. My neighbourhood hotspot I’ve been wanting to try and it didn’t disappoint. Was definitely easier to find ressies earlier in the week."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibWJHQVNBEAE",
            "text": "This place was a letdown overall. It was hyped up a lot by food critics and the menu seemed great but the execution was subpar. We got the waygu beef carpaccio which was fine (at best), the linguine with California sea urchin (with 1 piece of uni for the entire plate that was bitter and gross, but the 1 piece of uni was disappointing), and the live Maine lobster with Carolina gold rice. The food was truly unremarkable and overpriced, nothing was balanced or exciting flavorfully. The wine list was pretty exceptional however with a wide selection of natural wines which was the best part of the entire experience. If we ever go back, it’ll be to sit at the bar and enjoy a glass or three of wine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUMnNTWG1nRRAB",
            "text": "Amazing food, great atmosphere, and lovely service.\nThe kitchen staff very clearly takes pride in their work and the food was delicious.\nDessert was to die for."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5b19IN2xBRRAB",
            "text": "We had high hopes for this restaurant as we heard the food was good. However, it was one of the worst dining experiences we had in the city.\n\nWe had a reservation and when we arrived, they said they were a bit delayed. Totally fine but they made us stand awkwardly by the bar in everyone’s way for about 35 minutes and no one came to take our orders or explained the menu for another 15-20 minutes so we had to wave the server down (which I hate doing).\n\nThe food was decent but the portions were so small and we all left hungry. The servers were all unapologetic about the wait and the dining experience left a bad taste in our mouths. The bill totalled to almost $500 (they also added an extra drink on there that we did not order) for 4 people with 1-2 drinks each.\n\nWe will not be returning and do not recommend dining here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoOE9hdnVnRRAB",
            "text": "One of those places you’re glad to have been because you know you won’t be able to get back in.\n\nStraightforward Italian fare with high quality ingredients.  The type of stuff you eat in Italy and wonder why you can’t get it in nyc.\n\nGreat service, cool looking space, and some of the best food I’ve had in a while."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcTdHdUR3EAE",
            "text": "Excellent meal from start to finish. The veal tortellini and dry aged rib steak were stars."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaMWJIMk5BEAE",
            "text": "Absolutely wowed. Highly recommend. A little pricey but very worth it in my opinion. Wonderful wine selection as well and incredible staff!"
        }
    ],
    "reviews_count": 81
}