{
    "name": "Fiaschetteria Pistoia",
    "place_id": "ChIJKTH6LHdZwokRtjn3XCmyqJE",
    "grid": "MN3",
    "address": "647 E 11th St, New York, NY 10009, USA",
    "rating": 4.6,
    "user_ratings_total": 977,
    "phone_number": "(212) 777-3355",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGTGRVSmhZMnM1WkZOUlZWQk5ZazFLT0VkSVZrRRAB",
            "text": "best restaurent in nyc. the pasta is homemade and  so fresh. the truffle pasta and cacio e pepe are to die for. 10/10 recommend"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sSFpqQnlNa3hzYXpkSlVFeFJWRFpRVjNocFJGRRAB",
            "text": "My favorite Italian restuarant in NYC!!! Amazing staff, amazing pasta, amazing atmosphere. 🩷🩷🩷"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taUmRFUmhVVFZwZGpCbGEzUndTM2RsVFc1SlgwRRAB",
            "text": "Food overall was good but was extremely loud inside, had to practically yell to hear over the noise, and was a very chaotic atmosphere with waiters literally running down aisles with food.\n\nStaff were friendly and food came out quick, but would not recommend for a relaxing or intimate meal."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONWVFbE9NR0pwUjNoalp6UkVjVTgyUldGWFowRRAB",
            "text": "One of the best pasta places in the city! We come here and to the West Village location regularly and all of the pastas are always lovely. The atmosphere is great for spending time with friends over amazing pasta and wine."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVFdrMXZhMlk0YlhkeFJuRkxTMjE0WkhwelNWRRAB",
            "text": "I’ve eaten here countless times and will eat here countless more. The best food in MYC. The best service in NYC. The best time in NYC."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FNGFIRkdYelZLVDFweVQwNTBWSFYyUkdkbGRYYxAB",
            "text": "Amazing, authentic food in an quaint setting."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wNWVpMVZRMWx2TlZSWlZUQkNiMU5tU201ek5tYxAB",
            "text": "one of the best Italian restaurant in the area!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbFRIUm9Na0p5UkU5Q1NYTlRMVVJtVm1ZdFZHYxAB",
            "text": "Prosciutto! Beyond everything else that tastes amazing here, this is the place for best prosciutto in town. Fiaschetteria is not only great for family and friends, but a first date!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GaVFVSkxkWFF5UmtKTlFrWXRaRWhsWW1SR1JsRRAB",
            "text": "One of the best meals that I’ve ever had in my life!!! The eggplant salad was beyond amazing. I also had the tortellini pasta and it was delicious! The overall ambience was great and the service was immaculate. They were so kind and the desserts were to die for too! Would recommend to anyone looking for a delicious, authentic Italian restaurant experience."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vM04yRlFaRFpVYzJwcWVFaHZhVUZ5VG5GM1JFRRAB",
            "text": "Amazing!!! The pasta was so fresh! All of it, the food was delicious and authentic (Tuscan style)  Italian. The staff was attentive, engaging, and very warm. All of the the recommendations from the staff were spot on. I will be back for sure and highly recommend making a trip."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NMGNEWlhTSEpDTUc1YVRtMXNXQzFQVXpRNFRIYxAB",
            "text": "Pasta is so fresh and the appetizers are so flavorful. Such a welcoming staff, you will have an amazing time coming here"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkeGVVbzRiRWw2TjFkMU1VMXhRelpEVmtoQ1NXYxAB",
            "text": "Very good pasta that was fresh. Make sure to get the tiramisu."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMVlXMU9hWGhTTTFsM1ZXbDFiWE5UV0ZKd2FuYxAB",
            "text": "We had a really lovely dinner with three adults and an 18 month old. We all had plates of pasta, thoroughly enjoyed and perfectly portioned. I particularly enjoyed the truffle tagliatelle. Service was kind and solid."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21welZHTjNVMWhJY0ZKcFFsVk5PV3BPV0dORFdsRRAB",
            "text": "Great service, great portions, great atmosphere! Great for a first date or small get together. Food is tasty and comes out relatively quick!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWmNYcEtlVms0VlV0RVZVMWFhVnBLVjI1T1ZYYxAB",
            "text": "One of the best pastas in the city definitely! Their food would never let you down"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RlprNXBha3hXUm1jelJVbFpXRE5wUVVsdFQzYxAB",
            "text": "Buzzing and fun vibe. One of the best pastas I’ve ever consumed (truffle pasta). Good wine selection. Waiters seemed busy and were always yelling in Italian. Food was just so delicious and the vibe is fun for a night out. Would definitely recommend."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paalRpMTNVVzlFVmtNd1VqTjJRa0Y0YzFOUlpFRRAB",
            "text": "I have been here so many times and will shout it to the heavens: my fave restaurant in the east village"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RNFFXUlJUamRZYlU4MFFtVnBhR1JFTURGbE5FRRAB",
            "text": "Have never had a bad meal here. The pici reminds me of being in Tuscany and the tiramisu rocks! Everyone is super friendly and helpful."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201WlEyd3piMmRCWkRaTE5rTllZV1paU3pob1QwRRAB",
            "text": "Great tasting food, portions are small tho especially for pasta which is peanuts.\nAlthough the desserts were so tasty! It saved the experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214bFdsOVRkRTFwUWs5ZmRGbGFSR2hOU1RnNWRXYxAB",
            "text": "A New York City gem! No Notes, just go!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OdU1uVlhUMDFMYm5kNVprWlZjVUZ4WTBkZlUxRRAB",
            "text": "6 out of 5 stars for playing linkin park's somewhere i belong in an authentic italian restaurant"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKb2NXeEphelI0YW1Gbk5UVjFkVWxsU2xGRFdrRRAB",
            "text": "Pretty loud on the inside - hard to have a conversation. Food was good. Service wasn’t very attentive maybe tough luck on that evening…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdFFXcE5UazlzWTNFeFJtVlllbkExWVZac1oyYxAB",
            "text": "Just amazing get the zucchini appetizer and the truffle pasta and the duck Ragu you know what just get everything"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rd2FFTlpabU16UldsTVVsUjFOV2xrUTFOWk1rRRAB",
            "text": "THIS IS BETTER THAN PASTA WEVE HAD IN ITALY! The Cacio e Pepe was out of this world, and the tagliatelle al tartufo was crazy!  The service is amazing, you feel like your stepping straight into Italy! If you’re visiting New York, make sure you get to Fiaschetteria!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5b2FUQjNXV2cwVlU5TmRHdENVMVJ4UTBOTVFYYxAB",
            "text": "Pasta: A++\nServers: A+++\nWine: A+\nVibes: A+++\nFlavor: A++\n\nI really liked eating at this restaurant and I hope to come back someday"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2preFoxOTFUa0pRWDJKdVpWQkhhSGh3YTAwdGVXYxAB",
            "text": "amazing authentic italian food! loved this place, and great service too!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kcU4zbFVlRlJZVTI5cmNHRTRTVWhFUW0wM1RsRRAB",
            "text": "Andre was AMAZING! Food was incredible, we were sat immediately even without having a reservation and he put so much care and love into our visit. Will make this a revisit anytime we’re in the city."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sUVgxRk5aM0oyY0ZVMU5EQTFTbEZCVVU4NWNuYxAB",
            "text": "The greatest prosciutto I’ve ever had. The best cacio and pepe in the east village!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSlNVTlBiRXh4Y0RCRFZYQXRYMlp1U1ZKNVVuYxAB",
            "text": "One of the best meals I’ve ever had, we popped in on Thursday night for a perfect dinner outside. Service was absolutely incredible, Angelo is king. We had the prosciutto which was truly the best. The cacio e Pepe and the ragu felt like a Sunday night at home."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214NFNFSkxNbTlaVXkxNWVteElSV3hmVGxGRlZVRRAB",
            "text": "Amazing service, everything was delicious. Get the prosciutto, cacio e pepe and ragù bolognese"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwd05uZGhUVjg0VTJwRk0waFVNblZDT0MxeFJVRRAB",
            "text": "Everything here is amazing; food, wine, service. I only have positive things to say!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjMVdVRkhPVkJ6VDNkS1kwRjJXVzU1UTBSNGVsRRAB",
            "text": "I ordered the pasta with tomato sauce and the Genovese, but both were way too salty to eat.\nI understand the restaurant was busy, but we had to wait 20 minutes after asking for the check, which was really frustrating.\nHonestly, I don’t understand why people say this place is good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twS056UTBNMDFzUVRWYWRUUlNia3QyUVhkR2FXYxAB",
            "text": "Food portions are very small and for the price you pay, not worth it. The food itself was alright, I have had better tasting pasta and mains elsewhere. Also, one thing that was interesting and annoying was they wont give you the fresh grated cheese on certain main meals? Like why even bring it to our table if you are just going to say “no, this cheese is not for that food..”??  That was a first for us. Regardless, don’t think we will be back for a second try."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aVGFURldlbVpRVUZFMlFuVnVWbVJJUm1kUGRFRRAB",
            "text": "Best neighborhood Italian place!! Lovely generous staff"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kWlVEZ3dkVU5xYm5JdExUWmFZM0JOWTBVNFdsRRAB",
            "text": "Life long New Yorkers still discovering the magic of this city … I think we finally found it. Flawless. #madonnailanarhiannafiaschettaeria"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKRlFXUkpMVFpSWnpKcE5tZE1iMFp6VkhFeGFVRRAB",
            "text": "absolutely loved my experience tonight, my waiter was incredibly amazing and so helpful. the truffle pasta was OUT OF THIS WORLD. i will be dreaming about it for the rest of my life."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paMlpGOXZRVzlFTlhKQ2IzbHlhVzFVVGpOVFUwRRAB",
            "text": "The folks here are so nice and the food is amazing!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WRlNVVm1VMlZMVUVvNVgyaGpaRmhrYURkUFdsRRAB",
            "text": "Amazing service and cosy spot. It’s a shame that you leave still hungry after an appetiser and 1 main. The portion of the pasta is ridiculously small."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2todlVHZE1SbU4yUVVVNWNISjZiMnh0V0c5TGRVRRAB",
            "text": "Pasta, the truffle one, is an absolute must."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xobWFsUXRka1pyY214NE1VdzVkV2R3UVdWWFVWRRAB",
            "text": "Amazing food and ambience, and a great wine selection. Def a new fav in the neighborhood. Love it!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0R2JXaHBNRTAwY0hSSVRucExWVk5QV0RCdlJFRRAB",
            "text": "Absolutely phenomenal!!!! Fresh pasta, perfectly aged prosciutto. House wine was amazing as well. Do not go to New York and not eat here!!! One of theeeee best authentic Italian Restaurants in the city"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjM1pVNUphM1ZUZUhCUFNtVlVhbXBFWWtSUUxYYxAB",
            "text": "Authentic Italian food, or to be more precise, from Tuscany! We were a big table of 10 people and we had a great time. They also have very good vegetarian dishes. The service was impeccable, and all the waiters can speak Italian. I would only recommend to put some fans in the room, because there's no AC"
        },
        {
            "date": "2달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWUWNrZ3dhRE5qYldsTGNIVXRSSE51Y2xwT01IYxAB",
            "text": "Pequeno e acolhedor italiano gerido por italianos, portanto… difícil errar. Pastas frescas e molhos ótimos. Comemos um râguebi tradicional e um ragu de pato, amos bons. Carta de vinho por taça com oito rótulos toscanos. A calçada é ótima no verão. Good vibes."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GalRtMVhjVGwyYW5ORGVHVmtOMWRNZWpoWFJHYxAB",
            "text": "Excellent Service, excellent atmosphere, excellent wine, excellent food. What else do you need?"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWFdsOXpZV3A1VFZKNE4wdDRkWEl5UmpGNk4wRRAB",
            "text": "I come here often, it’s one of my favorite neighborhood spots and the service and food is always on point and never disappoints:)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwNWFEWjZlV1F4V2xKbVppMXVabGt5UmpkTE5HYxAB",
            "text": "What an amazing time! We ordered 5 different pastas and all were delicious. Standouts were the truffle pasta and prosciutto appetizer (we ordered second rounds for each). Our wine pairing made everything especially delicious. Our service too was quick and super friendly! Shoutout to Andre and the rest of the crew for making our last night in NYC even more memorable. Will definitely be back again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kRlNucE5MV3RoWWtaeVpIWXdVME5MVEU1M2VsRRAB",
            "text": "So great!! Such good food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oemFsVXdaRmRvWnpsWFNGQmtSbFl3WTA4MWJFRRAB",
            "text": "It’s perfect"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWME1FcGZiRkpyYVZKamVsQlBhVmMxUTFOQ2ExRRAB",
            "text": "Cute vibe, wine selection is great. Food is simple but authentic :-)"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRdGVWRTVYMHB3Ym1FeVYyeGZibXh4TWw5R1FsRRAB",
            "text": "Muuy buen"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNeUFnYm5OX3BMUmVREAE",
            "text": "Great pasta and wine selection. We got the prosciutto for apps and then truffle, cacio e pepe and the tomato sauce pasta. The espresso and tiramisu for dessert. The pasta was so good, full of flavor and chewy and the tiramisu was nice too. They sliced the prosciutto at the spot so it was soft and good. The bread service was bread kind of cut off into small pieces so almost thought they were leftovers but it was fine. I'd definitely visit again but would just get the truffle and cacio e pepe pastas and tiramisu. Def much better than the West village location.\n\nThe service was fast and efficient, just that there were only three servers working that day so it was hard to get their attention when we needed something. (This may just have been that kind of day.)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdElyQ3B3RRAB",
            "text": "I had really high expectations before coming... It was great but didn't live up to them.\n\nThe food was delicious, fresh, tasty but not outstanding. The service was ok considering how busy they were. The atmosphere of the place was what I enjoyed the most and it was well worth it for that alone.\n\nI would go back, I would like to give it another chance to live up to the reviews I had read and my expectations. Definitely worth visiting"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeTZlSWNBEAE",
            "text": "Food was great. Nice pasta and salad. Servers can improve, they'll forget to bring water or ask for wine and such but it was terribly busy Saturday evening so I understand.\n\nIt's a tiny place and seats about 50-60 people inside and it gets loud, really loud. Ended up with a headache after the dinner. Food made it worth all the other setbacks.\n\nThey also topped off tiramisu with a lot of espresso and it was bitter. So try that at your own risk."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPUzlyYVdvaTVyX2d3RRAB",
            "text": "Una joya que no es tan conocida y merece más reconocimiento.\nLa atención fue increíble y rápida. El sabor muy auténtico.\nNos encantó que para elegir el vino, te lleven una pequeña canasta con las opciones del momento."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcmVyWDFRRRAB",
            "text": "Owners and servers were all soo lovely! Sitting at the bar was so cosy and you get to see all their collections of wine. The pastas and prosciutto are delicious! Highly recommend all the way from New Zealand!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdFphckVBEAE",
            "text": "First time I came here was for a group date and had a great time - the food and wine selection was great !\n\nThis time I went for a friend’s birthday dinner and wow, I tried the tried different plates and I went for red’s instead of white and was surprised that I liked it that much. We got the tiramisu to be able to sing and it was so good! It was buttery and basically melted in your mouth."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3ajVUQzNRRRAB",
            "text": "What an amazing evening with friends! It was made best with scrumptious food, exquisite dessert and fine wine. Love the feeling of italian dining !!! A first and definitely not the last ❤️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMUtLbUp3EAE",
            "text": "this place brought us back to italy. the pastas were delicious, the truffle pasta was so good that our group had to order another. everything was incredible - would highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBdGNxcE5nEAE",
            "text": "We got the prosciutto plate appetizer, Cacio e Pepe, the truffle tagliatelle, and the gnocchi. First of all, they sat us at a plastic foldable table near the front door, in which they had to shimmy behind one of us and the end of the bar to access said bar. Free bread also came along, the focaccia was quite good. The prosciutto plate was good. The cacio e Pepe was easily the best pasta dish that night. The gnocchi was disappointing, tasting more like a flour gnocchi than a potato one, and the sauce wasn’t noteworthy. It wasn’t bad, but not terrific. The truffle tagliatelle really had no depth of flavor, and without the truffle, would be extremely bland. Seems more like a gimmick since they shave the truffle over it. Overall, I’m sure there are better Italian places in the city that would be better."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGZldtUkdURFE0TVd0aGRWVTVkM0pCT0V0T05tYxAB",
            "text": "Cute Italian place! We had Cacio Pepe and the Ragú pasta - both delicious!! Would recommend. Also great wine selection."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvLUtpeVNREAE",
            "text": "The food was amazing! The truffle pasta and prosciutto were divine and the wine was good too. The service was definitely not great, seemed to be really rushing to turn tables. Made reservations over the phone, easily. I would come back for the food"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dDRidUp3EAE",
            "text": "Came here for dinner Saturday night—they don’t do online reservations but you can call in to make one.  The restaurant was packed and has a very energetic vibe.  Service was great!  Food was good—we got the Pici Freschi Cacio E Pepe and Tagliolini Al Pesto.  The pesto pasta was not as salty as I would have liked.  Both pastas were decent portions and reasonable prices.  For desserts, they brought out a Tiramisu for us which was so nice!  The Affogato was good too."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNWFLdlRREAE",
            "text": "This place has “the sauce”. The rustic Italian ambiance, pasta being made in the back, Tuscan wine menu in the form of empty bottles, front of house yelling at each other in Italian and hand gestures —not to mention the pasta was amazing! Love a place that still does a bread course too. A gem of alphabet city 😙🤌\n\nFor pasta we got the spaghetti con bottarga and tagliatelle al tartufo, and one of their specials (meat sauce with bread). All fantastic, I think the spaghetti con bottarga was my favorite (nice and salty).\n\nBravo! Definitely go dine here"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWE1UZE9aRWwyT0hKdFVtUmFSMkozZEVSbFZrRRAB",
            "text": "Go here. End of story. I had the most incredible dining experience paired with SPECTACULAR food. I’d go back every day if I was local. Honestly can’t recommend enough. 10⭐️"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQbU1ESGJBEAE",
            "text": "An excellent option for Fresh Italian (made to order onsite) cuisine in the East Village. Great variety of wines and daily specials, as well as all time favorites like Caccio e Pepe and Gnocchi al Pesto. Excellent service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5Nzl1NjN3RRAB",
            "text": "Enjoyed my time coming here. The pasta was very fresh as you can see the guy through the glass rolling on the dough. Such exquisite technique, can be very distracting and hard to keep my date attentive if you’re facing the dough maker. Anyway the meal was delicious!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidkxLdE9nEAE",
            "text": "Took my out of town friend here. Didn’t want to wait in line at the West Village location and L’artusi had tables at 11pm, not doing that!\n\nLove that we can buy just a half bottle. Much appreciated\n\nEverything was delicious and served quickly. The wild boar ragu was fantastic; the tiramisu was excellent just wish\nit was a larger portion because I’m a fatty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqdkxUZDF3RRAB",
            "text": "We loved this cute little Italian spot! Really brought us back to our trip to Italy. The food was amazing, incredible service, what place in NYC offers free bread AND house wine these days? We highly recommend the duck ragu, truffle pasta, and baked pear dessert! 10/10 would recommend this spot for a romantic or intimate evening with friends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUaF9LdnJnRRAB",
            "text": "We loved the food but not the experience. As Canadians looking forward to trying New York Italian food, we couldn’t wait to try the highly popular Faschetteria Pistoia. The food totally lives up the hype but we didn’t enjoy the wine we ordered. We started with the delicious burrata and cherry tomatoes but we kept having to ask for more bread because they literally give you like 4 or 5 crouton size pieces of bread in a paper bag. For mains, I had the Cacio E Pepe and my husband had the Tagliatelle Ragu. Both pastas were phenomenal. My husband enjoyed his dessert which was the baked pear with mascarpone.\n\nThe atmosphere however wasn’t what we wanted. It is a very small space and the servers literally run between the tight tables. I kept fearing that if I moved the wrong way, I’d get hit my our server sprinting through the aisles. We felt very rushed even though our reservation was at 9pm. We had a comedy show to see at 11:30pm, so we were hoping our dinner would last a couple of hours but our server made us order all our food at the same time and brought it out super quickly. I’m sure we could have asked for them to give us more time, but both of us just weren’t feeling the vibe in the restaurant. It was just too fast paced for us. Next time, we will try another Italian spot with a more laid back atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqcF91Qjh3RRAB",
            "text": "Wow, so crowded and yet such a fun place. All tables are very close to each other. Its loud and fun. The food was amazing, and service was great. The buratta and prosciutto were delicious. Fresh and yummy. We took 3 pastas - truffle, gnocchi ragu, and spaghetti with tomatoe sauce. All fabulous.  The veal lemone was tasty too. All simple and perfect. Loved it"
        },
        {
            "date": "2년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSME15aWV3EAE",
            "text": "Amazing vegetarian pastas! We got the Gnocchi con Pomarola, Tagliatelle al buro, Pici freschi cacio e pepe, and Tagliatella tartufo! All were amazing especially the Tagliatella tartufo. We also ordered the Pappa al pomodoro, Sformatino di Zucchine, Burrata e pomodorini, and Insalata di carciofi for appetizers, they were absolutely delicious."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGZmIydGpSVXBDYlRWdVJYZzNhMEZSVVZkNE1sRRAB",
            "text": "Neighborhood spot serving excellent authentic Italian in a relaxed and very casual atmosphere. The only dish that disappointed was the cacio e peppe (wayyyy too much pepper); everything else was fantastic."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0dWVXakVBEAE",
            "text": "Showed up on a Tuesday night with no reservation and got a table. Everything is great, but highly recommend the specials. We ended up with a zucchini flan and pasta stuffed with spinach and ricotta. The latter was topped with cheese and broiled to perfection."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdE1FOUJkVEF3VUV0UFVFVmtXVkJUWm1oRWRsRRAB",
            "text": "their two dish minimum policy genuinely makes no sense.\n\nI went there with my dad one evening because I was hungry since I didn’t eat earlier when he did. They seated us at a two person table & when I ordered my pasta & he said he only wanted dessert they didn’t allow that. So I was like okay, then I’ll order my pasta and then also order a dessert and they said “no since he’s sitting there you have to order two dishes.”\n\nliterally if he wasn’t sitting there no one else would be anyways unless you would put a complete stranger sitting with me…??\n\nthis policy would make sense at bigger tables because I understand space is limited in nyc restaurants but literally what is the logic in this case?\n\nI’ve been to this restaurant multiple times before because the food truly is fire but like come on people."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeUkzRVlREAE",
            "text": "This place is incredible. No matter what you order, you can’t go wrong. If you want to feel like you’re straight up eating in Italy, don’t miss Fiaschetteria. And the prices are so reasonable. 10/10 would recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNWRtakpBEAE",
            "text": "We had the pleasure of being transported to Tuscany for the night during our visit to Fiaschetteria Pistoia.\nThe pastas are house-made and are the closest thing to great Italian pasta one can get in New York. Prosciutto is full of flavor, and tiramisu is perfection.\nThe atmosphere was rustic enough to remind you of an Italian osteria. Friendly and energized service was a cherry on top."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4eFlpRzVBRRAB",
            "text": "Good spot for Italian eats with indoor and outdoor seating. Notably, the pasta with truffle and the spaghetti with clams were memorable. Also really liked the pork shoulder and zucchini flan appetizers."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4c2ZYN0p3EAE",
            "text": "This is as close as you are going to get to delicious authentic Italian  cuisine in NYC! This charming establishment features the most amazing pastas, Burrata cheese, gorgeous prosciutto and don’t forget dessert! We will be back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyNk5ua21nRRAB",
            "text": "we had a great dinner! The truffle pasta was super delicious and pretty reasonably priced for truffle. The servers were good but they definitely rushed us through dinner. We were asked to order about 5 times in 10 minutes. The wine was very good but not a huge selection. Ambiance is very good. Don’t be afraid to venture towards ave c!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0eU0wbFpRa0ZPV0ROa2FFaEpaSEIxZEZnNFprRRAB",
            "text": "I’ve been to the west village location a bunch and it’s just like insanely good food. The three waiters here fly around at like a million miles an hour serving so many tables it’s so impressive and kinda stressful. The food is so good, love the wine menu system, the table bread and olive oil is perfect. Just go here"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdS1iNUxnEAE",
            "text": "Came here on a Friday night. Great food great atmosphere! Cute neighborhood restaurant. Will come back soon!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdWFHY0d3EAE",
            "text": "Had a great meal here the truffle pasta is to die for. Service and vibe is also really good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMMDhLY1Z3EAE",
            "text": "The absolute best fresh pasta I’ve had in the city. If you miss real Italian food, come here. The servers are fantastic and there is outdoor seating.\nHighly recommend the daily specials and any of their gnocchi dishes.\nOttimo 🔝"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZbU1xN3RnRRAB",
            "text": "Thought they didn’t take reservations — but they do! Got lucky and secured a table inside even without one. The cacio e pepe was super creamy and peppery. We also got the special pasta with the olive ragu — thought it would be super salty, but was actually delicious. Highly recommend both the dishes! Burrata and tiramisu were a bit of a skip for me."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSaVlEQXR3RRAB",
            "text": "@netgonenutsforfood\n\nOne of my favorite no frills pasta places to date -\n⭐️ ⭐️Get the house wine. You just can’t beat the price for quantity and overall experience. Half a liter of white for $22 say what 🤯\n⭐️ ⭐️Truffle pasta was absolutely 🤩 just the right amount. Truffle is shaved front of you🤤\n⭐️Cacio e Pepe was good, though a bit too strong for me. Reminds me of Misi’s cheese combo in their version, but lighter\n⭐️Ragu parpadelle: good but nothing memorable\n⭐️Tiramisu: Great for rounding off the meal, not too sweet.\nP.S. East Village branch takes reservations but not the one in West Village so plan accordingly 😶"
        }
    ],
    "reviews_count": 85
}