{
    "name": "Bungalow",
    "place_id": "ChIJxUPhRABZwokRWTa40zp_N10",
    "grid": "MN3",
    "address": "24 1st Ave, New York, NY 10009, USA",
    "rating": 4.3,
    "user_ratings_total": 1520,
    "phone_number": null,
    "reviews": [
        {
            "date": "15분 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdlZtZHJabFIzYVZaeWRtUXdWV1YwTjBKNk5tYxAB",
            "text": "Check Vikas makes the entire experience unforgettable. Food was awesome."
        },
        {
            "date": "3시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dmRXMDNOMnhzVkhkWGRXZE9PVzFHYnpaVGJuYxAB",
            "text": "Bungalow is truly a celebration of what's at the heart of Indian culture and cuisine: hospitality and community. The food was excellent, I'm a new yorker and have had so many amazing meals -- trust me when I tell you, this food is so well prepared and delicious. Everything was fresh and served with so much attention and love, in some instances from Vikas Khanna himself who very humbly serves food at each table. The spices used and combinations were extremely comforting and hearty dishes both veg and non veg - highly recommend!"
        },
        {
            "date": "6시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aQ2RIbG9jRUo0UkhaclVsbElWV3hyU0UxM0xYYxAB",
            "text": "It was a wonderful experience. From staff, ambience, service to food - everything was great. Food tastes amazing; full of rich flavors and texture.\nVikas Khanna is so sweet and humble. He welcomes you and even explains the dishes while serving you with a smile. If you are visiting New York, its worth adding it in your itenary."
        },
        {
            "date": "15시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVNWNtWmlWMGw2WldSM2Rqa3RYMk5rVlhoblEyYxAB",
            "text": "Been a few times and the food is always excellent. I think the portions are mostly a good size and unique. For me this is the best Indian restaurant dining experience in NYC and comparable with any top Indian restaurants globally."
        },
        {
            "date": "15시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkR1IwazFOR0ZYU1d0UGVVVTNZWHBtVEdwdlRGRRAB",
            "text": "One of the best dining experiences of my lifetime! Thank you Chef Vikas Khanna and his entire team!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GdllVTm5NVmwzT0U5NFNUazRlbmc0V21kT1JGRRAB",
            "text": "The food was good. Moreover, service was great. Chef Vikas Khanna is the best part however as he asked about our experience and politely allowed us for a photo with him. He is probably one of the most humble people I have ever met!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUVdtRlpNRkZGU2xOSmJFZzFiVXBaYzFjd1pWRRAB",
            "text": "The food was really good (nothing outwardly) and Chef Vikas Khanna made the time to greet us. We were walk ins and waited over an hour to get a bar seat. One of the hostesses had a permanent scowl on her face and most of the staff were tired and disengaged which was a downer. Honestly not worth the wait but if you manage to get a reservation it might be."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWmIzVXhXbVpOTlc5dFJFRm5ZVjlFZDNoeVNtYxAB",
            "text": "I visited with my boyfriend and friends in the city, this was one of my favourite meals in NYC. Chef Vikas Khanna and the entire team were so attentive, kind and made us feel at home. We did not have a reservation but were still given a space to wait and order drinks prior to being allocated a table. We will definitely be visiting again."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwT1YyWkxMVkZrWWpCQlVuUXlaR2Q1Um5oTVltYxAB",
            "text": "got a reservation 2 months before, and it was worth the wait!\nThe food was incredible. High quality ingredients cooked to perfection.\nThe staff was friendly and attentive, we never had to wait more than 5 minutes per course.\nAs an added bonus Vikas himself made a visit to every table to check in.\nAll in all 5 out of 5 in every category."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xNFVrZEdkak10TTBOSlRrcEhkVWQwU1UxeFUyYxAB",
            "text": "The food overall was great, but the whole atmosphere and chef Vikas Khanna's hospitality made it an amazing experience. This was my first time experiencing a world class MasterChef in front of my eyes!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pseU1HNXlUR2xhYmpkaVpXbDBSMnh3T1ZoUlJuYxAB",
            "text": "I cannot recommend Bungalow highly enough! From the moment we walked in, the service was top-notch; attentive, warm, and truly focused on making our experience special. We were celebrating my husband's 40th birthday, and the team at Bungalow went above and beyond to make it a night we will never forget.\nThe food was genuinely amazing. The Stuffed Paneer Appetizer was a major hit at our table. Our main courses, especially the Chicken Biryani and the Pineapple Curry were incredibly memorable.\nThe incredible dining experience culminated in a truly special touch: the Chef himself delivered his birthday cake to our table! This personal gesture made the celebration feel so exclusive and demonstrated the team's commitment to exceptional hospitality.\n\nIf you are looking for fantastic Indian cuisine, stellar service, and a restaurant that treats its guests like family, Bungalow is the place. Thank you for making my husband's 40th birthday one for the books!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pack5GbEtRbVpNY25OeU9XNWxkM1V3TW1GRGRWRRAB",
            "text": "One of the best Indian restaurants in the world. The food was amazing, full of flavor and authenticity. But what really makes Bungalow special is Chef Vikas Khanna — so humble, warm, and genuinely kind. He personally greets everyone! It was my birthday and he made it extra special with his kindness. Truly a heartwarming experience."
        },
        {
            "date": "수정일: 3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdFpTRU53EAE",
            "text": "The food was absolutely amazing! Every dish was so unique yet familiar for Indian taste buds. The ambiance was great and the venue is so stunning, it feels like I’m transported to a bungalow in India. Vikas really made our experience so special by visiting our table every time we received a new dish to give us history of how he came to create it."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFM1JGRlNNSE01YTJ4M1RrZDFNVmxsV0ZKWFJYYxAB",
            "text": "Food was excellent and the chef made us feel at home."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WSlpEWmFSVkpvT0VsclYxVm9NWFZsYTI5VmRsRRAB",
            "text": "Went in with very high expectations. Surprisingly exceeded all of them on Food, Service and warm atmosphere. Everything was great the drinks, starters, entrees and desserts. Favorites were Banarsi puri, Yogurt kabab, Chicken Amritsari, and Biryani. Rose faluda was fantastic too. Overall liked it better than even Semma tbh. Especially when it comes to food and the warm energy from everyone you interact with."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3amQ2RDNRRRAB",
            "text": "The place might be hyped but some of the dishes have unique flavors which we enjoyed. Also, the hospitality is amazing including the fact that Vikas Khanna greets all guests if he’s around.\n\nWe liked the Yogurt Kebab, Anarkali Chicken, Shrimp Cones and Rose Kulfi.\n\nWe went in knowing that mains aren’t exceptional so we skipped it.\n\nAdditional touches like sugarcane + turmeric shot before the meal along with fryums were much appreciated. Since we were celebrating a birthday, we were also served coffee moose.\n\nEdit: Tried Daal Bungalow & Spiced Pineapple and both were delicious. Absolutely should try the mains on the menu too!\nStill amazed to see how Vikas Khanna is so humble and enthusiastic about meeting all his guests."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnMlRGcHplbXBOWDBaMFNFOVBObEppUVd0clExRRAB",
            "text": "An absolutely incredible dining experience at Bungalow NYC! Every detail — from the ambiance to the service — was perfect. The highlight of the evening for us was their Yogurt Kebab — truly a masterpiece! 👌 Perfectly balanced flavors, melt-in-the-mouth texture, and beautifully presented. It’s easily one of the best dishes I’ve ever had anywhere.\n\nWhat made the night even more special was meeting Chef Vikas Khanna himself — such a humble, gracious, and inspiring person. His passion for food and hospitality shines through every bite."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WVlZDMWhZa1pZYkVabU5GbFhUV3R6YjA5UU0yYxAB",
            "text": "Location is in a bad part of town. The it is next to a funeral home. Walked in on time. There were plenty of open tables. (Marketing gimmick makes it hard to get in). We were seated past the long hallway and a right turn, under double height glass ceiling panels covered with leaves and debris. The cocktails were below average. We let the server know, she swapped and got new cocktails and they weren’t any better!! This is after we followed her recommendations!! She seemed to have merely memorised the script. No depth of understanding of the cuisine. Service is average.\n\nStandard one Tequila, one Gin, one whiskey etc. based cocktails. It’s laughable. No imagination!! The star anise was overloaded. As were all the other spices in the other cocktails. Doesn’t the sommelier get it that making an Indianized cocktail is more than just throwing a spice in? They tried too hard. And have no knowledge of ingredients. Or flavors. Or balance.\n\nThe food is really nothing to write home about!!. We ordered many dishes. All below average flavours. Baingan Bharta was bad. Yogurt kebab was tasteless. The naans were average, too. Presentation is sub-par. Not even worth a photo.\n\nI kept asking myself and my friends - THIS place is a Michelin Star? The Indian Cricket team came here? Oh dear!!\n\nHonestly, we saw a lot of young couples who probably were fooled into bringing their dates to a “Michelin Star” place and we all felt so sad for them. The prices are very, very high and if you factor in the poor quality of the dishes, I overpaid 4X.\n\nAdd to it the shenanigans of bringing a person around who does the flowers. I guess Gen Z falls for this kind of stuff?! This place is sheer hype. Exploitation. Opportunism.\n\nThe ambience is nothing to write home about. Artificial flowers and all. Furniture and wall hangings don’t make sense. NOT a fine dining place AT ALL.\n\nRather this is a classic example of a tourist food trap. Instagram hype. Our neighbouring table the couple were from California and we heard another couple was out of state as well. Recall the \"Tavern on The Green\" in Central Park… and how they cashed in on suckers before they went bust? This food is that poor in quality. 100% marketeers. Food is NOT their core business (I have never said that of a restaurant before). Marketing or movie making (that’s what I heard) may be. Ridiculously HIGH prices. We didn’t even pack any leftovers. Better in the trash bin than our stomachs.\n\nThey didn’t get the acoustics, the music right either. Seriously a minus 10. My friends had the same experience - Amex called them that a reservation was available and they said why not. Now they deeply regret going to Bungalow. Like all of us."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMGNGVnlUSG8yV2tGcmQyZGhkVlZVUkdoVmIxRRAB",
            "text": "We recently visited Bungalow NY, and it was truly an unforgettable dining experience! The ambiance was elegant yet warm, perfectly blending modern luxury with an inviting charm.\n\nThe food is absolutely outstanding! Every dish was a masterpiece, beautifully plated and bursting with authentic flavors. You could taste the creativity and love behind every bite.\n\nWhat made the evening even more special was seeing Chef Vikas Khanna personally visit tables, sharing stories behind the dishes and asking for feedback. He is such a humble and inspiring gesture from a world-class chef. 🙌\n\nAnd to top it all off, we even spotted Tripti Dimri dining there that night! ✨\n\nOverall, Bungalow NY is not just a restaurant.  it’s a complete culinary journey. Highly recommended for anyone who loves exceptional food, impeccable service, and an unforgettable atmosphere."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNeE5GUjViVlpuYjJ4ek5sTTVaa3hJWjI5SVdYYxAB",
            "text": "Overrated and booking through reys is flawed"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkNlVXOUtMVmRoU1dOME1GRlpRMVEzZG0weFNWRRAB",
            "text": "good"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Vek4zVkRTVTF2VHpKeVZqTnpUalpmTWtablVFRRAB",
            "text": "Amazing atmosphere and service. Could not get dinner restaurant so ended up eating appetizers at the bar.  Had to wait for an hour . The food was worth it.  But the best part was meeting Chef Vikas and the celebration his team did before the opening."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVeVpESlJkekZOTlcxalp6WmpOVXh6U1hkbFdHYxAB",
            "text": "Every dish I tried here felt like a hug from home. For desis out there this place will give u a reminder of what food used to taste like when you were at a vacation during summer at your uncle's or Mama's place and ate with all your siblings. Every single corner is designed with such fine details. Chef Vikas Khanna made sure we felt at home. He not only brings the dish to you but also will take the time to talk to you. Haven’t felt so welcomed at any other restaurant in very long time."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0WmVVOXFNbVJZVkVnemJWUTNObmN5WHpKVmEwRRAB",
            "text": "All veg starters were very sweet and very pickled. Especially on panneer dish , beat and sauce was so sour and sweet that it wasn’t eatable . Dessert menu has nothing creative . Main course we had baigan bharta- very oily and okra- was very chewy and blend . Very disappointed."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VMSEk0c1dKeS1IUW1BRRAB",
            "text": "Update Oct 2025:\n\nThis was my third visit to Bungalow in the past six months, this time to celebrate my birthday. The food was absolutely fantastic as always, no complaints there. But I can’t say the same about my experience with Chef Vikas Khanna.\n\nWhen he brought out my birthday dessert, I requested a quick photo with him, but he simply smiled and said, “Enjoy the food,” before walking away. It was a little disheartening. Bungalow for me was always more than just great food, it was the warmth, the experience, and meeting Chef Vikas that made it special.\n\nWhat struck me later was realizing that the same day, Karva Chauth, Priyanka Chopra had shared on Instagram that her mom got food from Bungalow after her fast. I adore Priyanka, but it did make me wonder, you do have to be someone famous to be treated special!\n\nThis might be my last visit, though I still highly recommend Bungalow for its exceptional food, especially the Yogurt Kebabs! Just go for the flavors, not the fan moment. Not sure if they’ll keep this review or get it removed, but I wanted to share my honest experience.\n\nMay 2025:\nHad a great experience at Bungalow today! Tried the Yogurt Kebabs, Amritsari chicken and 5 cheese kulcha! Yogurt Kebabs were amazing! Highly customer centeric service! Would recommend this place to everyone."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVNE5tbzJZWE13V1c5bE5qbDBUME5PVmtaUWNsRRAB",
            "text": "Food is great and very tasteful  although portion size is on the smaller side. Overall had a good time except that the experience with going to the bathroom. They just have 2, not very clean and patrons were queuing up outside."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KMFZrcGlNRlZRWDFWME9WUmhabkpYUlRSUmRuYxAB",
            "text": "Our recent visit to Bungalow was underwhelming, to say the least. The much-talked-about Banarasi Puri lacked both flavor and portion size, offering little value for the price. The Yogurt Kabab was particularly disappointing — the filling had an unpleasant odor and did not taste fresh, suggesting it was pre-prepared well in advance. It arrived at the table almost instantly, which only reinforced that impression. The paneer cubes in the entrée were rubbery and poorly textured, making the dish difficult to enjoy.\n\nWhile the ambiance and presentation may give an impression of sophistication, the food quality simply does not match. For a restaurant that promises elevated Indian cuisine, Bungalow falls short on freshness, authenticity, and taste. Unfortunately, it feels more like a place built on hype than on genuine culinary merit."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTU9VdEhiRjlOY0ZKWFgwaGFaMUpMYjAxVFRrRRAB",
            "text": "Food was really average and also the pricing on menu is some kind of ponzi scheme when compared to portion size. Chef Vikas Khanna was acting so entitled , treating us like some third class citizens . Didn’t care to click photos with our group."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FMFpIRkhhV3hpUjFkR1ZuWmpSRmN0VjJ4M1dWRRAB",
            "text": "This was one of the best restaurant experience I have had. Yogurt kebab, pineapple curry and the Mango three way are must haves. Meeting Chef Vikas Khanna was definitely the highlight and a fan moment for us. He is so courteous and down to earth! Loved talking to him. He oblidged us with a photo too. I have rarely seen a celebrity having such a warm, down to earth and lovable persona.\nThe place is setup as a cozy colonial bungalow and the vibe is relaxed, happy, content. Reservation was very hard to get but worth it!\nOne more thing to note was - Chef Vikas Khanna was personally lending a hand to all elderly people to bring them down the stairs and he was personally dropping them off upto the streat when they were leaving. Such an amazing gesture! Things like these make visiting this restaurant more than just a culinary experience."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNNU9HRkdjbXBKZFZocVkwWXdRMFJVY2pVeVEzYxAB",
            "text": "Beautiful vibe and decor. One of those East Village spots with a hidden backyard and skylight. Tons of foliage hanging from the walls and ceiling.\n\nFor a spot that is 100% booked solid every night, in a city with more than few great modern Indian restaurants, I'm not totally sure it lives up to that hype.\n\nTried a few items on the menu, would like to come back to try more. Nothing to fault in the cooking really, but nothing blew me away either. Flavors skewed more rich and heavy.\n\nThe famous yogurt kebab are kind of like an Indian crab rangoon, even including a riff on \"sweet and sour\" dipping sauce. The chicken amritsari (butter chicken) was tasty but didn't have a ton of punch, and was room temp. The achar and chutney served on the side were awesome, though."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2todVFtNVhhRlZaWjFwZmVHUk1UME5ZUldWS2FYYxAB",
            "text": "Absolutely amazing, came here to celebrate a birthday and they had great food and service. The chef was kind and hand delivered a bday treat, it felt like a very personal experience. Highly suggest visiting 10/10"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sWFJERklkWGhTVjFGcGRHSlRWMjF0YUVOUlNGRRAB",
            "text": "The food was strictly average and a mixed bag.\nThe appetisers Dahi Kebab were good, but the sauce did not taste that great.\nThe standout on the entire dinner was Anarkali Chicken Kebab. Amazing flavor, spice and tandoori taste.\n\nThe a drinks were huge let down both Paan Sour and Clarified Mango Lassi. Definitely it's better to avoid. It's just sugar.\n\nAmritsari Chicken was below average. It did not taste anything special. The chicken was over cooked.\nTandoori roti was really good.\n\nRose kulfi was really good desert but not something to be remembered for long time.\n\nOverall a huge let down.\nThe highlights of the dinner were Anarkali chicken and meeting Chef Vikas.\n\nTraveling from CA and trying hard to get reservation was definitely not worth it.\nChef VK being at helm, the expectations were sky high. Hope it improves from here."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0bU9FRjJPRll3U1VwdWVVUlhXVFZQVTIxSWVXYxAB",
            "text": "Wowww... what a food !!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aeWFHeElNRVJZWlhWVmIwdHlOWGRpYUVOWVRXYxAB",
            "text": "Appetizers were the highlight, main was a let down. The restaurant is overhyped."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GbFIwMHlNbHBqVWxkM1JEUjVjMkppZFdJMU5GRRAB",
            "text": "Had an amazing experience at Bungalow by Chef Vikas Khanna! The Butter Chicken was rich and flavorful, the Chicken Tikka was perfectly grilled and juicy, and the roti and naan were soft and buttery — perfect with the curries. The Biryani was aromatic and well-cooked, though it had an overpowering flavor (I think it was kewra) that wasn’t quite to my taste — something that could be adjusted. Ended the meal with the delicious Banarasi Puri, which was a fun and flavorful twist. Beautiful ambiance, great presentation, and overall a solid 4.5/5 experience!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tReVJYcEZXbGhvYjJkTVVUaGFUVGxGYkdaQmNIYxAB",
            "text": "Stunning place/Excellent service/Amazing food and the kindest Chef❤️"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJelMwaEdOeTEyWm0xYU0xbHBNR0UxZFVNd1ZXYxAB",
            "text": "Amazing food, service, and atmosphere"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wa1ZpMUpNR1IzVUZZemMyOTVWVGRYYUVVNVdFRRAB",
            "text": "Food was excellent. Loved the amristari chicken, Dal Bungalow and Benarasi Puri. One of the best meals I had in a restaurant.\n\nHowever, regarding service I have some feedback - I visited for my birthday and was warmly greeted at the entrance — the staff wished me and told me they would make it “special”, which I really appreciated. However, nothing followed after that gesture, even through the end of the meal and payment.\nWhen my sister later inquired, we were told that a complimentary birthday dessert is only provided if a dessert is ordered. This policy was never communicated to us beforehand. For a restaurant of this caliber, I expected more proactive hospitality — even a simple “If you’d like to order a dessert, we’ll prepare something special for your birthday” would have avoided the misunderstanding.\nThe food was good, but the experience felt incomplete given the initial expectations set by the staff. Clearer communication or a bit more initiative from the team would have made the celebration truly special."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WmMxZzNYMjUwTVZOSWRETkZhbDkyZG1GWE1tYxAB",
            "text": "The food was honestly just okay — nothing extraordinary or memorable for a Michelin-star restaurant. Flavors were pretty standard, similar to many other Indian spots in NYC. What really stood out, though, was the ambience and the service — absolutely top-notch! The staff were warm, attentive, and made the experience enjoyable. Overall, great atmosphere but the food didn’t quite live up to the hype."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RdFFrZERibFEzTWtkclEzcHBXR3R0VTFFM2IzYxAB",
            "text": "Average ambience if you are not seating in the  sunroof section (rest of the restaurant have booths that resonate dated 50’s diner vibes).\nCocktails are basic , Baar Baar ( now closed ) and Tamarind Tribeca serves more elegant Indian mixes.\nWhile checking in , the receptionist told us we have 2 hours allocated table time, which we need to respect as they have next reservation scheduled every 2 hours.\nThe server said the entire order has to be put in at the same time (this is common in most Chintan Pandya and Vikas Khanna restaurants).\nThis rule essentially forces the guest to correctly guesstimate the portion size pre-ordering and prohibits them from re-ordering any dish that they might love after tasting .\nInterestingly, we have not experienced this at any other non-Indian michelin star restaurants  e.g those by chefs Daniel Bouloud , Michael White, Thomas Allan , Bobby Flay or the Altamarea group.\n\nFor the food , the yoghurt kebab, anarkali chicken and lamb chops were good . Flavorful chutneys.\nAttentive service."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCSVoydGhZVU5wVlRGcFowVmxkbVJzVHpKblpWRRAB",
            "text": "Last Sunday, we made online reservation and we’re on wait list, tried to call the restaurant upfront to confirm reservation but there is no phone number to reach them, so after 50 mins of heavy traffic in New York when we finally reached there, we were told there will be a 3 hour wait, they wont give any takeout food as well because they are busy.\nPrimary reason for a single star:\nCustomers coming in there are busy as well you guys should have a phone number wherein people can call first and confirm reservations or at least get wait time approximate estimate upfront. Expecting people to come there first and then telling them about 3 hours wait time is unacceptable."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTFpFSm9jMUpFTUVFeFh6bHZZMHBTU0Vsd1VsRRAB",
            "text": "The ambience is good and the staff is soft spoken and well informed.\nThier lamb chops are good one of the best. And meeting chef Vikas Khanna is an added perk. He makes sure everyone is well taken care of.\nChef Vikas when he is around makes sure he personally greets each table."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKMFpuTkRTRE5pVUY5U2JrbHNTM1kzWVdneVYxRRAB",
            "text": "Dining at Bungalow was nothing short of magical. From the moment we walked in, the space felt elegant yet deeply personal - and then, the highlight: meeting Chef Vikas Khanna himself! He greeted us so warmly, it instantly set the tone for the evening.\n\nEvery dish was unforgettable. The Yogurt Kebab were pure comfort - crisp outside, cloud-soft inside, bursting with tang and spice in perfect balance. The Anarkali Chicken was a masterpiece - tender, layered with flavor, and beautifully plated. And the Falooda? Easily one of the best I’ve ever had - delicate, fragrant, and joy in every bite.\n\nIt’s rare to find a place that blends soul, tradition, and refinement so effortlessly. Bungalow isn’t just a restaurant - it’s an experience, and one I’ll be thinking about for a long time."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUlJ6ZGFZaTFqZFhoS1QwTTJPVWhpUTJScFVtYxAB",
            "text": "Getting a reservation is impossible, so I arrived solo on a Tuesday at 4:55 as a walk in, and was seated immediately at the bar.\n\nNow onto the food. Is it objectively good? Yes! I had the paneer lazeez with a five cheese kulcha - both were delicious and perfectly spiced. But could you get this quality of food from an auntie running a stall in Jackson heights for 1/3 of the price? …also yes.\n\nIf you’re having a general craving for indian food, this spot scratches that itch. But if you’re wanting to try a new innovative version of Indian food then ehhh I don’t know.\n\nI will say - service is incredible and the atmosphere inside is really pretty! Also gratuity is auto added."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kVGVIaEZOSFpGVVhveGNrUm1Zamx0Wmt0VExXYxAB",
            "text": "You can’t get appointment at this restaurant. Not worth spending energy here.. tried from last 2 weeks."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKd1JrWkdjUzEzY0ZrNFZsSlVTVzVRVjI1MldrRRAB",
            "text": "Since its opening, I have been to Bungalow 7 times. I just love its food specially the appetizers. Shrimp Balchao cones, Anarkali chicken are a must have. You cannot miss it. Even other appetizers like yoghurt kabab, lamb seekh kabab are good too.\n\nThey have discontinued their one item which is Kiss of Kashmir, it was one such a gem that they introduced, I request Chef Vikas Khanna to bring this item back please.\n\nWhen main course or entree is considered, their chicken amritsari, rajasthani pulled lamb, lamb tellicherry fry are must try. Even Dal Bungalow is very good.\n\nIn breads, I always go for Mint lachcha parantha and Farmers sattu roti.\n\nDo try their cocktail Kali Peeli Taxi.\n\nIn deserts, Mango three way and their celebration desert is really good\n\nThe Chef Vikas Khanna warm hospitality is one such thing for which you can get awestruck of. The whole ambiance and aroma of this place is rare to find.\n\nIf you are in New York. You have to go there. Od whatever it takes to get the reservation there. I just love its food.\n\nI just want to give one feedback, please keep the music volume level, slow to moderate. High volume of music actually dont makes it difficult to talk ;)"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGU1lUVTVUbFYwWDE5MGN5MXljakV3YzNSd2IzYxAB",
            "text": "Best exparience of Bunglow is Chef Vikas Khanna himself!\n\nIf you are lucky to have Chef Vikas Khanna around while visiting, he can elevate your experience with his kind nature and being a perfect host. Food and drinks were anyway expected to be good at such a popular restaurant. We had reservation for only 4 but due to this event being celebration for two kids in family graduating from college, we became a group of eight. We reached one hour early and to our good luck met Mr. Vikas Khanna outside the restaurant performing his daily ritual of flower decoration near main entrance. They were kind enough to accommodate 4 extra persons.\n\nMost of the food and drinks we ordered were great, but notable were Banarasi puri chaat, Roasted pineapply dish, Daal Bunglow Makhni, Anarkali Chicken, Chicken Amritsari and Alleppey Shrimp Curry.\n\nAmbience is great and service is top class. Look forward to visit this place again"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kT1ZYZzJVRk5VTVZSRFEyRmtXbmR3Vlc4NGRWRRAB",
            "text": "Chef Vikas and team — absolutely phenomenal! Hats off to you all for an unforgettable experience."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkeGIxODNTMjlFYzJ0RWFXNVhkRlZwVlU5VVNHYxAB",
            "text": "I was in NYC for work and decided to solo dine at Bunglow this evening. Raving reviews and a pleasant atmosphere convinced me this was going to be the perfect dinner on a Friday.\nI was seated at a beautiful table and when the server approached, I asked him to bring me whatever chef thinks is best today, no dietary restrictions but I have a small stomach.\nThey brought Dahi kebabs, very tasty. Next was shrimp curry, brought with rice, naan and accompaniments - this was average and for a small stomach it was a lot of food. I picked my dessert, mango three way was below average. The experience quickly began to fade into poor.\nI saw chef Vikas go to 90% of the tables. I was billed per menu but charging for both rice and bread without asking which I would prefer was, I felt, sly.\nThe chef politely smiled when he saw me at my table. I will not return, even with a bigger group."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNUlTbDZnRRAB",
            "text": "Hey, so after trying for days, I finally got a reservation for four people to celebrate my son's birthday. The restaurant was beautiful, and the ambiance was great. The staff was super friendly and helpful.\n\nWe started with yogurt kababs, tandoori avocado, lamb chops, Anarkali chicken, and shrimp cones. Everything was cooked perfectly and full of flavor. The plating was also beautiful.\n\nFor the main course, we had lamb shank nihari, amrit chicken, paneer chandni, and amritsari chhole with garlic naan and tandoori roti. I can't even describe how good the food was. Everything was so flavorful and perfectly spiced.\n\nIn desserts, the rose kulfi was amazing. The mango three ways was also really good.\n\nFrom the bar menu, we ordered the holy moli spice drink, golden temple, and jamani fizz. They were all great drinks.\n\nAnd guess what? Celebrity Chef Vikas Khanna was there! He's such a down-to-earth person with a big heart. He treated us like family, took pictures with us, and even gave us complimentary dessert. He's an amazing chef.\n\nI highly recommend this restaurant.\n10oct2025 update.\nAgain revisited the restaurant,  food was phenomenal,  they changed few dishes.  Missed the chef this time."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WV1luWllXVzUyYkZsdE9Ga3dZMEZ6ZVMwMlVsRRAB",
            "text": "Food was awesome- Tried the Fish Tikka, Yogurt Kababs,Prawn Balchao cones for appetizers. All three were delicious & lip smacking good. For entree we ordered the Shrimp Allepey Curry along with Sheermal & Garlic Naan. Again everything was good. For dessert we ordered the Mango Three ways which was average.Icing on the cake for us was the chance to meet Mr Vikas Khanna himself whom I have always admired for all the great work that he does for the needy apart from being a Michelin star chef & restaurateur."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psamFHTjZheTF5UkdORlJuRlZRVEpvWVVsUFZFRRAB",
            "text": "Pleasant dining experience while celebrating a special ocassion at this hottest Indian restaurant in the NYC. Our group tried almost all the vegetarian dishes and many varieties of drinks on the menu. Each one was uniquely flavorful and had creative touch to it. The ambience in the main dining area is very nice but that is not true (still good but not the same across entire restaurant) for the entire dining space.  The staff is super efficient in keeping this very busy place flowing smoothly. Our host Hannah and server Pablo and others were on point. Chef Vikas is a celebrity himself, but has the most down to earth demeanor. He came over to our table and gave us insight into the dishes we had ordered and brought the candle with a cake for the special couple  to celebrate their engagement. Very refreshing experience overall."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNMmNFZ3dVMlF5WlZwRU1FaEZNSHBIUW1rNFNrRRAB",
            "text": "We (me, my wife and my mother-in-law) visited Bungalow NYC today on 9/13/25 and it’s a dream come true moment for us! It’s more for my wife as she is one of the greatest and the most die hard fan of the legendary Michelin-starred Chef, the pride of Indian Culinary world - Vikas Khanna! She (of course us as well) had a dream of meeting him in person and satisfying her taste buds by dinning at his restaurant! Since the day Bungalow NYC was opened in the heart of Manhattan, we were trying to get the reservation but it’s no luck for us as it gets filled up in fractions of a moment! So, this time we thought, let’s give it a shot with walk-in and we flew all the way from Atlanta to NYC to try our luck and it favored us! From the moment when we were waiting outside the entrance of Bungalow till we left after dinning in, it’s truly a heavenly experience! The taste of all the items that we ordered for - Golden Temple, Yogurt Kabab, Chicken Anarkali, Mint Lachha Paratha, Chicken Biriyani, Chicken Amritsari, Rose Kulfi Falooda and Mango Three Ways - were heavenly delicious! On top of that, what touched us more was the warmth and hearty welcome that Chef Vikas Khanna and the entire team of Bungalow showed not only to us, but to each and every guests at the restaurant - which is very rare to find at any restaurant. It made us us feel completely at home! And we were amazed and taken aback with the humility, kindness, politeness and the grounded nature of such an epitome of the culinary world - it’s truly inspiring and something to learn. He himself was attending each and every guests, serving dishes, accompanied the diners which is remarkable! The way Chef Vikas Khanna shook hands with us, hugged us, cared for us while dinning, chatted with us, complemented my mom-in-law, showed love and affection to my wife and to me, that made this day an unforgettable moment which we will cherish forever! Of course I would also mention about the entire team - everyone was so welcoming, smiling, courteous and at the same time highly professional! Overall, it’s one of a kind moment/day for us! Extremely satisfied and happy! And hoping to visit Bungalow NYC very soon again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poT1ZYTTNWbEV0U0dGUmVtaFFVRVpWUW5aVFlWRRAB",
            "text": "Dinner at Bungalow was supposed to be highlight of our NY vacation but it was a mixed bag.\n\nFood is great, Desserts are below par. Atmosphere depends on where you get the table which was a bit annoying. We didn't like the first table we were offered but weren't given a table in end section of restaurant citing that they are reserved for party of 4 while we were only 3. We saw some tables with only 3 people sitting in that section. We were offered booth which was at least better.\n\nAfter a great 1 hour food experience, it all went downhill. While we were eating our desserts, we were asked to empty our table and move to waiting area. I have never felt so embarrassed / insulted at any restaurant in my life.\n\nThy kept asking us what they can do to make it better and kept offering us free desserts but damage had been done. Owner also came and mentioned that it was a miscommunication and we should have never been asked to move. They were nice to take off some items i didn't like but moving us mid dessert is something I have never heard anyone ever experience anywhere else so I am not sure i would be going back."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5emVXeHVURXRwUlVsak9XczBOa0pSZUVWRVdWRRAB",
            "text": "This is a must try, it was on my bucket list Chef Vikas wasn’t in town so that was rhetorical only down side, but all in all great atmosphere great vibe, I would recommend ordering more of apps than the mains , the yogurt kebab was excellent. Service was good drinks were ok have had better for sure , I went as it was on my bucket list , the staff was very polite and courteous. I would say if Bunglow reads it we need a few more innovation on drinks and mains but apps are just amazing . Thank you for making my New York experience amazing 😊"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kblNEWnVVWGRITmxadFdUTjNSbkk0WDJ0YVQxRRAB",
            "text": "Reservations are so hard to find and husband and I waited outside (we arrived at 4.20pm ish) and there was 1 party ahead of us. We got a seat at the bar as soon as the doors opened at 5 pm. The ambience is nice, very traditional, warm yet modern decor. Lot of carved wood which very colonial Indian inspired.\nMusic was a bit loud imo.\n\nWe started with the paan sour and clarified mango lassi. The paan sour was good, mango lassi was alright. For apps, We got:\n-  the dahi puri - which was good, nothing crazy to write about\n- Malvani fish tikka- this was good, the salmon was fresh but I don't think there was anything Malvani about it. It definitely felt fusion. It had banana puree which really threw us both off and dint go well with the fish.\n- yogurt kebab - my husband loved this. The texture was too much for me.\n- Lamb chops - this is the only thing we absolutely loved!!! Cooked to perfection and perfect spices! Loved it. This had to be our favorite from all the things we ordered\n- Rose kulfi - cloyingly sweet. I had really high expectations for this one but I thought this was hyped.\n\nService was attentive and not intrusive which I appreciate. Vikas Khanna will stop by your table probably with one of the dishes that you ordered, very sweet.\n\nOverall this place has had amazing marketing and I feel people come here for Vikas Khanna more than the food here.\nWill I come here for the food again? Probably not."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGTUxYbERaMFl6VVVkZloxTlFXRkpQZW5GUmVWRRAB",
            "text": "Bungalow perfectly nails a beautiful dining space that is a pleasure to sit in. Service is active and friendly, with some surprise appearances from the wonderful chef. Everything here is worth it, in flavor or new experience. Their portions are plentiful and their curries/ yogurts are stellar. Even a simpler preparation like the chicken Amrit was some of the best I’ve beer had!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OUmNVd3lOVEprUkRJek1qRk9SVWgwVDJWNlJFRRAB",
            "text": "I was very excited to visit Bungalow restaurant since open. But when I try to make reservations I read some notes regarding kids. They don’t allows under 10 years kids, no high chairs. So I refused to go Bungalow. Because of my 6 years old daughter. Where can I keep her,if I visit Bungalow, it was my mind. But September 1 I was visited New York and I was just passing through from Bungalow. And I stop there and meet Chef Vikas Khanna. I spoked with him and informed my situation, he said very sweet word that, no worries, you can make reservations, we will welcome you. Ohh my gosh. I was very excited and every single day try to make reservations. It was very hard to get it. But finally I got it. I went to celebrate my wife’s birthday on 30th September. And we r here. He wormed welcome & remember us. Ohh my gosh. He brings celebration dessert for my wife and his staff Daniel also bring “Mango three ways” dessert for my wife. Very great service. Very delicious foods. Out standing 10-10. Highly recommend. We are very excite to go back again soon."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWZk9FdEJPRUZRY1dKUVl6QXlXVTkxVGtGSGVIYxAB",
            "text": "The best part about Bungalow Restaurant was the music and the atmosphere - the vibe was stylish and relaxing. Unfortunately, the food and drinks didn't live up to the setting. The dishes looked nice but lacked flavor and freshness, and the overall experience didn't match the high prices. Service was also slower than expected. For me, the ambiance was the only highlight."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205MllrazFTRFp1T1ZNNFp5MUlPSEZhTWtSRWRIYxAB",
            "text": "Long Review for Bungalow, NYC — but totally worth the read!\n\nI had been hoping to score a reservation at Bungalow, but it was all booked up. So I decided to take my chances and wait in line for a walk-in — luckily got a spot at the bar, and honestly, it turned out to be the best seat in the house.\n\nWhat stood out right away was the personal touch. Chef Vikas Khanna, the man behind this entire concept, makes it a point to greet every guest. Even if he misses you at first, he’ll stop by later to chat about the cuisine or the dishes — something you rarely see at a restaurant of this level.\n\nTo start off with drinks, I went for the Bangalore Club, a perfect mix of Bangalore whisky with a hint of orange bitters. Smooth, balanced, and just the right way to kick things off.\n\nFor appetizers, I ordered the Banaras Puri, and wow — what an explosion of flavors. Tangy, sweet, creamy, and crunchy all at once. It’s one of those bites that makes you pause and smile. Next up were the Yoghurt Kebabs, a dish I’ve seen Chef Vikas talk about on so many platforms — and it truly lives up to the hype. Wrapped in crispy kataifi, the creamy hung yogurt paired with tamarind and green chutney is warm, comforting, and unexpectedly delightful.\n\nFor the main course, I went with the Lamb Tellicherry Fry — easily one of the highlights of the night. The lamb was incredibly tender, with that slight char from the tandoor that adds a smoky depth. The knife just glides through it like butter.\n\nTo end the night, I couldn’t resist the Rose Kulfi Falooda — a must-try dessert. The combination of vermicelli, white chocolate bark, and that sweet rose-flavored kulfi is pure heaven. It’s one of those desserts where you instantly want to grab another spoon and share (or maybe not!).\n\nWhat made the evening even more special was Chef Vikas stopping by at the end to ask how everything was. Such a humble and genuine gesture that really sums up the spirit of Bungalow.\n\nOverall, Bungalow was an absolute hit for me — the food, the vibe, and the hospitality all come together beautifully. It’s the kind of place that reminds you of home, but with an elegance and warmth that’s hard to find. I’d go back in a heartbeat."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjdFRFNVBTblJET1VaWWRsZHRZMUZPZVUxbVZWRRAB",
            "text": "Review: A Memorable Birthday Celebration at Bungalow NYC\n\nTo celebrate my birthday, my family decided to dine at the world-renowned Chef Vikas Khanna’s signature NYC restaurant — Bungalow. My son began looking for reservations 20 days in advance, and thankfully, he was able to secure a spot.\n\nWe arrived 15 minutes early and were pleasantly surprised to find Chef Vikas Khanna himself in the lobby, personally greeting every guest. He graciously agreed to a photo session with us, making the evening even more special from the start.\n\nOur table was ready on time, and while the vegetarian options on the menu were limited, the few selections available were thoughtfully curated. We chose his signature dishes: Dahi Kebab and Sweet Potato Chaat. Just as the starters were being served, Chef Khanna stopped by our table and mentioned, “This will be the dish you enjoy the most tonight.” And he was absolutely right — the kebabs were simply outstanding, full of flavor and finesse.\n\nFor the main course, we ordered Pineapple with Coconut Curry, Baingan Bharta, and Mushroom Paneer. Each dish was rich in flavor, beautifully presented, and left us craving more. To top it all off, the restaurant surprised us with a complimentary coffee cake to celebrate the birthday occasion — a thoughtful and delicious gesture.\n\nThe entire experience was nothing short of exceptional. From the warm hospitality to the Michelin-star-level food quality, it was a celebration to remember. While it’s a premium dining experience, I truly felt it was worth every penny.\n\nHighly recommended for anyone looking to enjoy modern Indian cuisine in a refined, personal, and unforgettable setting.\n\n— ★★★★★"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4amRXcGlZbnBIVEhCU2RIRk5UMDgxYjFOd1ZtYxAB",
            "text": "I had an amazing experience at Bungalow in New York! The food was delicious, bursting with authentic flavors, and beautifully presented. The ambience was warm, elegant, and made the evening so special. The highlight of my visit was meeting Chef Vikas Khanna himself — such a humble and inspiring personality. Truly an unforgettable dining experience, and I can’t wait to come back!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wMk9HeHdlamxEZVdGWlpEVXhVVk0zV1VkR2JrRRAB",
            "text": "I recently dined at Bungalow NYC, and unfortunately, my experience was overshadowed by a serious issue. The mango lassi I ordered contained a piece of hair, and when I brought this to the staff’s attention, their response was surprisingly indifferent. While mistakes can happen in any restaurant, the lack of concern and accountability from the staff was disappointing and diminished the overall experience.\nIn terms of the food, it was satisfactory but not exceptional. The dahi kabab was the standout dish, flavorful and well-prepared. We also ordered the chole and the five-cheese naan, which were average. The rose kulfi offered a unique and enjoyable dessert option. The ambiance of the restaurant was pleasant, making it an inviting space to dine.\nOverall, while the restaurant has potential with certain menu items and atmosphere, the hygiene lapse and insufficient customer service response are areas that require serious attention. For a restaurant of this caliber, I expected a higher level of professionalism and care."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FNVYybHpNbkppVmpkb1JXVkJkVGxEVUU1RU1tYxAB",
            "text": "Walked in on a Friday at 7 pm and they happened to have availability for two! We ordered the yogurt kebabs, daal, paneer lazeez, a side of naan and rice. The food was solidly good. This was my second time dining here and I somehow remember the food the first time being better than this time around. Great restaurant and we were happy to be able to get a spot."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPNjA5cDdwb2ViSFVREAE",
            "text": "A Gem in the City – Bungalow NYC Delivers Every Time\n\nBungalow NYC is hands down my favorite restaurant in the city—and for good reason. The Indian food is absolutely impeccable—rich, flavorful, and beautifully presented. Every dish feels thoughtfully prepared and full of authentic flavor that never disappoints.\n\nBut what truly sets Bungalow apart is the incredible warmth of the service. From the moment you walk in, you’re treated like family. Samir, the manager, runs the place with such grace, and Vikas is especially wonderful—so kind, attentive, and genuinely invested in making your experience perfect.\n\nIf you're celebrating a special occasion, this is the place to be. Vikas personally comes to your table with heartfelt recommendations and often surprises you with their signature dishes or a complimentary dessert to make the moment extra memorable. It’s these small, thoughtful touches that turn a great meal into an unforgettable evening.\n\nWhether it’s a casual dinner or a celebration, Bungalow NYC always feels like a special event. Amazing food, outstanding hospitality, and a team that truly cares. Couldn’t recommend it more!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsU2NrSTFUa3BDT1V0c04wZDNUM0p2U1c1UFgzYxAB",
            "text": "My family and I had a truly memorable evening at Bungalow. The restaurant's short and carefully selected menu was a highlight; while the vegetarian options weren't extensive, each dish was a masterpiece of flavor and preparation. Every bite was delicious, showing the clear passion and skill behind the cuisine.\nWhat made the evening truly special was the personal touch of being served by Chef Vikas Khanna himself. It was such a sweet touch and an experience we'll remember for a long time. Bungalow isn't just a meal—it's an evening of great food and great memories. We can't wait to return."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSeWNGZFVURTh3WTNaR2VtSTVZaTB0VlVKaFlXYxAB",
            "text": "Bungalow is extremely beautiful restaurant. The entrance itself is so beautiful. It reflects India's beauty. It's large, reflection of Indias art and culture and obviously very busy.\n\nI absolutely love flowers and there are lots of flowers and also flower tree. This ambiance of this restaurant is bit different. The restaurant gives a feeling of festive, occasion or a wedding.\n\nWhen I entered, Mr. Vikas was standing and I got to shake his hand.\n\nWhen we got seated they brought 2 crispy puris sandwiched with Avocado.\n\nBased on the review, for Appretizer we ordered Puri and Dahi Kebab. I liked puri better than Dahi Kebab. Somehow I did not find Dahi Kebab to be as flavorful based on the reviews I read.\n\nFor Entre we ordered Paneer Lazeez and Spiced Roasted Pineapple. They also served onions and pickle sauce which was amazing. Honestly the tastes was normal like we have in a regular restaurant. It did not stand out as I had expected considering the hype.\n\nFor Bread, we ordered Farmers Satu roti with Pineapple and then rice with Paneer Lazeez.\n\nFor Dessert we ordered Mango 3 ways. I liked the taste.\n\nThey had also served special dessert  for birthday which was made of coffee and centre was filled with Banana. It was okay.\n\nThe decoration is very good. They have a lounge, bar and a dining area.\nHowever the noise level was too high. Mr. Vikas Khanna had also come to our table and our adjacent guest to meet.\n\nOne thing to note is that, based on my experience is that, the reservation is for a limited time approx 1.5 hrs. My reservation was at 6.30 and I had arrived 15 mins late.  I had informed them earlier that I was running late for 15 mins. Upin my arrival I was told that my table will be reserved upto 8pm. Because of the noise I couldn't hear everything what the lady at the Concierge told me.\n\n5 mins to 8, a manager requested us to have the dessert at the lounge area which is understandable. Atleast there's some accommodation and we were able to finish our dinner.\n\nI have also dined in Mr. Vikas another restaurant called Junoon. Compared to Junoon which is creative and very different taste, the taste of food at Bungalow is normal.\n\nI sense, the focus is more towards the concept of giving the experience of celebration, culture, heritage of India.\n\nI personally think the noise level of the music must be kept low."
        },
        {
            "date": "3달 전",
            "language": "zh",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ScGRWbFpSR0p2YmpoVFdWUlpVblZyYkRkWFJHYxAB",
            "text": "Bungalow来自前米一星餐厅Junoon的明星主厨Vikas khanna，开业一年还是十分火爆。餐厅布置很有印度风情，还充满着香火味儿。\n\n食物没有很吸引到我 - 就是完成度高、味道正正常常的一顿晚饭。最喜欢的是蒜味儿的馕 - 蒜味没有很重但香，饼烤的一面软乎乎一面微微脆，蘸着咖喱酱也是很让人满足了。最雷的是点的那杯clarified mango lassi鸡尾酒 - 那味道就像是水里混了一丢丢酒精和一丢丢芒果。"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oTE9HTldRM05qTW01SGMxWTRhelJCY1VGUmNHYxAB",
            "text": "Bungalow is a casual dining place with prices of a Fine dining. We tried all veg appetizers on menu including dal and paneer in main course. Food is good and but not great. Mixing of flavors may/ may not click. Definitely not worth the hype; for similar price I would have preferred Junoon and Tamarind Tribeca"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKaWVtcFdjWEpTVlZaRGRFdHNTVk4yYURCRlIwRRAB",
            "text": "We celebrated our second engagement anniversary at this incredible restaurant, and from the moment we stepped in, it truly felt like we were transported into a different world. The ambiance was beautiful, warm, and immersive. Every staff member we encountered was welcoming and attentive—they listened carefully to all our requests and made us feel completely at ease. Even the waiting area was cozy and inviting.\n\nAlthough our reservation was for 9:30 PM, we arrived a bit early, and they graciously seated us 30 minutes ahead of time, which we really appreciated.\n\nWe started with their famous **Yogurt Kebab**, and it was absolutely delicious—the flavor and texture were unlike anything we've had before. Then came the **Banarasi Puri**, which was equally delightful and full of flavor.\n\nFor the entrées, we chose **Paneer Lazeez**, accompanied by **Tandoori Roti** and **Farmer’s Sattu Roti**. The dishes were rich, perfectly spiced, and incredibly satisfying.\n\nFor dessert, we ended the meal on a beautiful note with the **Rose Kulfi**, and it was the best one.\n\nThe highlight of our evening was meeting **Chef Vikas Khanna** himself. He was incredibly humble and warm, greeting every table with a genuine smile. It was heartwarming to see how personally involved he was in making each guest’s experience special.\n\nTo top it all off, since it was our anniversary, the team surprised us with a **complimentary cake**—a thoughtful and sweet gesture that made the evening even more memorable.\n\nOverall, this restaurant gave us an unforgettable anniversary celebration filled with amazing food, lovely ambiance, and heartfelt hospitality. Highly recommended!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21seFJteHhWRXBoU2tvMFVuVnhXVGhSV25saVNWRRAB",
            "text": "My girlfriend and I visited Bungalow on August 5th at 9:30 PM with high expectations, we booked almost three weeks in advance and were excited for our first Michelin-star dining experience, especially knowing Vikas Khanna’s reputation.\n\nWhile meeting Vikas Khanna himself was a highlight, unfortunately, the overall experience fell short. We arrived 10 minutes early but were seated 10 minutes after our reservation time, which felt disappointing given the advance booking.\n\nFood Review:\n\nYogurt Kebab: Unique in concept, but served cold and overly sweet — more like a dessert than a savory starter.\n\nShrimp Cones: Served cold, lacked freshness, and seasoning was underwhelming.\n\nAmmi’s Lamb Chops: Initially served cold, but after mentioning it to the staff, they brought a hot portion, which was much better.\n\nAmritsari Chicken Curry: Average taste, nothing particularly memorable.\n\nFive Cheese Kulcha: As cheesy as expected, but otherwise ordinary.\n\n3-Way Mango Dessert: Too sweet for our taste; rasmalai was hard and didn’t feel fresh.\n\nGolden Temple: Our first choice (ganne ka ras) was unavailable, so we ordered this, it was fine.\n\nGiven the reputation and the premium nature of the restaurant, we expected more consistency in freshness, temperature, and flavor. The service was polite, but the food and overall experience didn’t live up to the hype for us."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSE5YcG1OMWRqZDNCNmJtMHliR05uT0RVM1lsRRAB",
            "text": "We made a reservation for six to celebrate our 50th milestone birthdays and had high hopes going in. The restaurant was absolutely packed when we arrived, which contributed to a rather chaotic atmosphere. To our surprise, we spotted Rishab Rashiraj Sharma dining there, and Chef Vikas Khanna was present as well—though he looked visibly stressed, which perhaps reflected in the overall service and experience.\n\nThe food was authentic north Indian style. Nothing extraordinary. We appreciated the Chef serving his famous dal, but to my disappointment, he did so while most of us were not at our table. We also ordered the much-talked-about dahi kebab, which was decent, but serving it with ketchup felt like a missed opportunity—it deserved a more thoughtfully paired sauce.\n\nWhat was most disappointing, however, was the lack of warmth and hospitality. For a special occasion, we were hoping to feel celebrated or at least acknowledged, but the ambiance felt cold and impersonal. If you’re looking for a place with energy, warmth, and a memorable vibe, this may not be the spot for celebration. Adding to the discomfort was the unexpected location—right next to a funeral home, with a shared wall, which definitely affected the mood.\n\nOverall, we left feeling underwhelmed. While we respect the culinary legacy of Chef Khanna, the experience fell short of expectations, especially for such a meaningful occasion."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5V1RXZFpYMGhSVHpjMFlrSTBlbWQwVEZwc1lYYxAB",
            "text": "Every moment spent here was filled with immense pride and joy. I can’t remember the last time I enjoyed a meal with a smile that never left my face. Chef Vikas’ warmth and personal touch in welcoming his guests adds a rare charm to the experience — but it’s the food that truly speaks for itself. Every dish deserves all the praise, and I loved it all the more for that."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oc1JEbE9TSGg1ZWxZdFJFNXhWbWhZWVc5M01sRRAB",
            "text": "Whilst the food was tasty, with a good selection of vegetarian dishes, it felt as if we were very rushed. We had a 5pm booking, however by 5.30pm we were already being served our main dishes. Our starters were being served within 5 minutes of ordering.\n\nMy husband and I were enjoying our first night out post baby and were finished with our meal in just over an hour!\n\nWe asked for more time between receiving our drinks and ordering starters and our waitress returned 3 minutes later. We then asked to just order our starters but were told we had to place the full order all at once.\n\nIt felt very rushed and we did not get adequate time to enjoy the restaurant and its atmosphere.\n\nWorth noting no other tables around us, who also had 5pm bookings were being rushed."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200NVEwUm1TekUzV2xKWk5HcHNTM0JmWDBwcmRsRRAB",
            "text": "The food was really delicious! We ordered the yogurt kebab appetizer, palak mushroom masala with garlic naan for our entrée, and the three-way mango for dessert. We also tried Paan sour and holy moly drink, both of which were very good.\n\nWe were a little disappointed not to meet Chef Vikas Khanna, as we had been looking forward to that experience.\n\nAnother area that could have been better was the service. When I mentioned we needed a few minutes to decide on our entrée, our server said she would unfortunately have to take the menu away, which didn’t quite make much sense and left us a bit uncomfortable.\n\nWe also shared at check-in that we were celebrating our anniversary, but the complimentary celebration dessert was never brought to us. Normally, this wouldn’t matter, but since the team asked about the occasion, it felt a little disappointing that nothing was done to acknowledge it.\n\nOverall, the food and drinks were excellent, but the service experience left something to be desired."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKR05sWlZjbnBOUmxJMlVXWm9ibkV3VjBobmIyYxAB",
            "text": "Very nice Indian restaurant with authentic flavors and warm hospitality in NYC. The head chef personally ensured a wonderful experience with great treatment and attention to detail. We were welcomed and presented with the signature dish yogurt kebab by vikas sir himself. We ordered most of the vegetarian dishes. Everything for perfect in taste and decent quantity portions. In the drinks -kaali peeli taxis, blueberry fusion was nice. The was one of the best experiences for us. Highly recommend!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oNGNtbGZSSHBQTVU5YVkwSmZYemxsTkhCT2VuYxAB",
            "text": "Visit to Bunglow restaurant happened to fall on a Monday in my 3 days Itinerary for NYC. I like a devout Indian waited for 2 hrs outside not knowing that it was maintenance day for the restaurant. I could see the lights being switched on inside and some caretakers were cleaning the place . I assumed that they were preparing to open the gates for the guests at 5:00 p.m which did not open and I anxiously knocked at about 5:05 p.m. The caretaker and me tried making a conversation through the closed glass doors and of course none of us could be hear each other but on my request via actions he decided to open the door.\nAnd there I saw chef Vikas Khanna standing behind him who of course must have asked him to open the gate for me.\nI felt really obliged and appreciated his humility. I congratulated him and told him that he is a role model & looked up to by all upcoming chefs from our country, India.\n\nOne of them being my own son Dhruv Hiteshi who also is an alumni of  Welcomgroup Graduate School of Hotel Administration (WGSHA), a constituent part of Manipal Academy of Higher Education (MAHE) super junior to the Chef VK.\n\nChef Vikas Khanna was humble enough to spent a few minutes with me . He even spoke to me to my son Dhruv, a chef in Canada, on WhatsApp and motivated him for good work .\nAt the end I would really want to say that though I could not taste the food there but yet I can say that it surely would be palatable, delectable and sumptuous Indian cuisine ❤️.\nGod bless 🙌🏻 the Chef and his team."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paZmJIZG1hRlZFVG5weGVVTmtlazF6Y25SUlVGRRAB",
            "text": "We visited Bungalow in New York to celebrate my dad’s birthday, and it was truly an unforgettable experience. The food was absolutely amazing, and the vibes were just perfect — lively yet classy. The staff went above and beyond to make the evening special, and we loved how beautifully they showcased Indian culture through the decor, flavors, and hospitality. As a sweet surprise, they served us a complimentary coffee mousse that was divine! Meeting Vikas Khanna was the highlight of the night — he was so gracious and kind. A perfect place for a celebration!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SMU5UWmhVRVZ0VUhreFlWQkZiazVxWm5SbkxVRRAB",
            "text": "After dinner at Semma on Tuesday. we cabbed to Bungalow to have more dessert. With no reservation, we hoped once again to do a walk-in. Pallavi at the front desk gave us a table in the bar lounge. Out of three desserts, we chose the Rose Kulfi Falooda. First we were given a plate of two tiny boondi ladoos. Tears welled up in my eyes as this ladoo had taste that made me feel that I was in India. Authentic and with a superb flavor. No restaurant or mithai (sweetmeat) store here even comes this close. Shobha asked if she could get two more and Ashley, our friendly server, gave her a box of four. Then came the dessert. Each bite was ambrosial. Where does one get falooda here? In my mind, I could have eaten a dessert by myself even though I was now stuffed and needed a wheelbarrow. The interior resembled Dishoom in London according to Shobha. The decor was bright, colorful and I liked the old fashioned telephone. Perhaps I could call the chef to give me a reservation? Pallavi at the front desk told me to come around 4:30 pm as a walk-in and I would be seated at the bar where I could order from the main menu. Tuesday turned out to be a gala day with lunch at Indian Accent, dinner at Semma and dessert at Bungalow. Such divine memories will be there forever!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWWREaExlRVZpWHpsTlRIVTFlblpzWnpaaFdsRRAB",
            "text": "We had an amazing experience here. We reserved a table through resy, 20 days in advance to celebrate our wedding anniversary and so happy we did.\nThe food was delicious and lip smacking. We started with cocktails. I ordered paan sour (a must try for any one who loves paan) and bangalore club.\nFor vegetarian starters were ordered yogurt kababs (a must try) and for non veg, it was ammi's lamb chops. Both, again were delicious. Entrees were egg plant bharta and chicken amritsari (read butter chicken) with garlic naans and 5 cheese kulcha. For dessert, we ordered rose kulfi falooda and mango three way.\nWe also got to meet the celebrity chef, Mr.Vikas Khanna. A very down to earth, soft spoken person and also very kind enough to take a picture with us."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUVoxVTNVbWwxYzBoa2RreFBWRmhCVTBSSVJYYxAB",
            "text": "We absolutely loved the ambience and the team at Bungalow. From the hostess to the bartender, everyone was attentive, friendly, and genuinely caring—it’s clear the staff takes pride in creating a great experience.\n\nFor starters, we ordered the Sweet Potato Chaat, which was fantastic. It had a thoughtful balance of flavors and textures—creative and refreshing. The Anarkali Chicken was another standout: juicy, flavorful, and well-balanced without being overwhelming. Compliments to the chef for both dishes.\n\nThe one miss for us was the Yogurt Kabab. It felt much heavier than expected, with more cheese than yogurt. When you hear “yogurt,” you anticipate something light and refreshing, but this leaned rich and dense, leaving us a bit thrown off. We shared that feedback with the bartender, but I’d suggest a rethink of the name or the recipe—it’s very heavy and not what we expected.\n\nOverall, we’d return to Bungalow for the atmosphere, the service, and a few menu items — but next time, we’ll skip the Yogurt Kabab."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205MlVuTmlOelJmWm5wR1lsbG1XRmhmUzFsQmJHYxAB",
            "text": "It was a pleasure dining at Vikas Khanna’s restaurant. The Dahi Kabab was absolutely outstanding-one of the best I’ve had, and the drinks were creative with unique, well-balanced flavors. For the mains, we ordered the Paneer Lazezz and Chicken Amritsar; while good, they were fairly average and similar to what you’d find at many other Indian restaurants, which was a bit disappointing. The rose kulfi, however, was another highlight-refreshing and beautifully done.\n\nA special touch was Vikas Khanna himself coming by to personally greet us, which made the experience even more memorable. The service was warm and attentive, and the atmosphere was excellent.\n\nTip: Be sure to book well in advance on Resy. Weekend reservations open 20 days ahead at 11 AM EST and sell out within minutes."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dDdPSjdRRRAB",
            "text": "Finally got a table at Bungalow and got to try Vikas Khanna's new restaurant. We got seated promptly at 6:30pm and ordered drinks and appetizers. Our table was at the back in the courtyard with jasmine tree branches decor. It was beautiful. We got bunch of cocktails - Kaali Peeli Taxi, Holi Moly, Lucky Cheng and Paan Sour. All were delicious. For appetizers we got Yogurt Kabab, Five cheese kulcha and Ammi s lamb chops. We liked them all but highly recommend the lamb chops. For mains we got Chicken Amrit which was a spin on butter chicken and daal bungalow which was a delicious daal makhani. Desserts were rose kulfi, mangoes 3 ways and Chef Vikas Khanna got a special mousse dessert for my  Birthday which was on the house. Loved everything and would definitely come back again. Came back and tried Chicken biryani, shrimp balchao, paneer, sheermaal and molten lava cake dessert with gulab jamun ice cream. Enjoyed our dinner."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFek9USXpOVmt0VFhSVWNWSnpNbEJwYjAxNGNFRRAB",
            "text": "Just finished up what my partner and I agreed was one of the best Indian meals we’ve had in NYC recently. The food was uniquely flavorful and very well prepared, but what made it a top notch experience was the excellent service we had at the bar from Freddy the bartender.\n\nThere were only bar seats available when we tried to walk-in today (after a 45 minute wait) at 5:30pm on a Sunday, and we were so very happy with Freddy’s extensive knowledge of the menu, his warmth and attention to detail, and the hospitality he showed, which was very unique especially when dining at the bar. While I normally prefer table seating in the main room, I felt that Freddy’s service went above & beyond many of the fine dining services I’ve had at Michelin restaurants of the past — would totally recommend to any one thinking about dropping in. Food was excellent, with the yogurt kabobs a surprise hit, the shrimp curry to be very flavorfully spiced, and the lambs packed a nice punch while still being tender.\n\nAtmosphere was nice, but I do wish the music was just a tad softer (at least in the bar area). Regardless would definitely visit again and would recommend to my friends"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201b2VXNHdNamRtWlZWWFVqUjRjMDgwZWtKYWRVRRAB",
            "text": "Food here is great but I really wish they had a better way of organizing people for walk ins. I was the first at the door at 415 and didn’t even know that the restaurant was open around 445 until someone just went in, cutting in front of me. Once in, it was a chaotic rush to get bar seats especially since there are multiple people ushering you in. It was overwhelming. Having said that, once seated, the rest of the experience was pretty good. Food was tasty and slightly inventive without being awkward. They auto-added 20% gratuity which was surprising given that were just two people but I had to catch it myself."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNekZ1dVdPaFlmOHZRRRAB",
            "text": "Excellent Indian cuisine, unique and pleasant vibe, and friendly staff - highly recommend!\n\n✨FOOD✨\nFrom Chef Vikas Khanna, judge of MasterChef India, takes traditional Indian food and adds unique modern elements. We loved all of the following dishes:\n\nBanari Puri $12\nAchari Stuffed Paneer $20\nShrimp Balchao Cones $18 **favorite**\nFive Cheese Kulcha $14 **favorite**\nMango Three Way (dessert) $16\n\n✨VIBES✨\nThe entrance is decorated with flowers and greenary. I liked that there was an actual reception area next to the host, where you can check your coat or umbrella, the spacious welcome is a rarity in NYC restaurants.\n\n✨LOGISTICS✨\nIt was hard to get a reservation, but worthwhile! It's a short walk from the 2nd Ave F train station."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xacFVYZG9SV2gzWVRkdGJHMWtaMG8wTFhrdFNrRRAB",
            "text": "Rating 4.5/5\n\nI thought the food was good and nicely presented, I’d expect that coming from a legendary Masterchef judge like Vikas. Restaurant also felt really good with some nice decor and ambiance. You’ll find Mr. Vikas busily strolling around the restaurant and attending his guests. You can ask him for a picture and he will kindly oblige most of the time unless he’s busy. Definitely an experience for once in a while.\n\nShout out to their mango lassi which felt homemade and unique compared to the generic store bought lassis they serve in other restaurants.\n\nI thought the desserts were kinda disappointing with falooda being the subject here. I’d expect falooda to come in a glass ina liquid form similar to lassi but they served it on a plate which was quite weird/strange to me.\n\nOverall, I’d give it a 4.5/5"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKS05qWkNFcVA2eUpBEAE",
            "text": "Dining at Bungalow was an unforgettable experience, made even more special by Chef Vikas Khanna’s warm and gracious welcome. From the very start, the fresh sugarcane juice set the perfect tone. The appetizers—Anarkali Chicken and Ammi’s Lamb Chops—were bursting with flavor and cooked to perfection. The Five Cheese Kulcha was absolutely out of this world—crispy, cheesy, and addictive! We ended our meal on a high note with the delicate and fragrant Rose Kulfi. Every dish reflected Chef Vikas’s passion and artistry. Highly recommended for anyone looking for a soulful culinary journey."
        }
    ],
    "reviews_count": 88
}