{
    "name": "Royale",
    "place_id": "ChIJ8UwiNndZwokRdRVevqF6DWw",
    "grid": "MN3",
    "address": "157 Loisaida Ave, New York, NY 10009, USA",
    "rating": 4.5,
    "user_ratings_total": 725,
    "phone_number": "(212) 254-6600",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUlZWaFhiMWhvZUcxRGRtbDZWVTQyTUc1clRGRRAB",
            "text": "what a greeeeeat burger! simple, savory and juicy 🍔 delicious 🤤"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfLWRUQzNBRRAB",
            "text": "The royale burger is very good and my wife enjoyed her classic margaritas"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnMk03MWp3RRAB",
            "text": "Great outdoor space, good burger."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xcVpWRklaRnB2ZEhScVZEZFFNSFF6UTBKM2FGRRAB",
            "text": "Food was very good! They had both vegetarian and Meat eater options. Surprisingly, it’s hard to find a place that is fitting for both.And the service was optimal. My gf and I were like, it was worth the trip. After all, we looked for an hour for a place to eat that suited both our tastes."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swM2FtODFXbVJOVkRCNlVtMXVUVXB2UkhWQlRVRRAB",
            "text": "Service and atmosphere was awesome. Great bar burger."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTGVtNWphME5WVkcxWU5tOVdWM2RrZG1sMmRrRRAB",
            "text": "Nice pub if you want a very good hamburger together with a draft beer while you are watching sports!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxR1ZVRlJlblUzVTFWRlZXUTBOV0ZvYldGVWQwRRAB",
            "text": "good spot in the center of alphabet City. the tater tots are a standout, and the burgers are obviously delicious. their patio is great. bathrooms are cramped, if thats going to bug you. decent beer list."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNlRsaHRaVmRwYmt4d1FWUnVRMlJWWDJwclpsRRAB",
            "text": "Best local bar. Never did this because I’d rather gate keep this place.\n\nGreat beers on tap and drinks, great burger / steak sandwich is killer. Staff is friendly and fast with food and drink. Love the backyard.\n\nDave’s okay.\n\nHad my engagement party in the backyard. Was a beautiful night."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGc2FXNVZOMFUwVUdwd00wUmpNMUZWU2pBMVowRRAB",
            "text": "Actually, I think THIS may be the best burger in the world\n\nEdit: AND best chicken sandwich. The folks at royale make such good food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xob04ycDVaRVk0VmpZMmJqTmxkekpGWWw5V2EwRRAB",
            "text": "Nice hidden gem in Alphabet City, featuring some top notch burgers. I found this spot through a well known burger page on Instagram - and sometimes highly touted places fall short of expectations, but this one did not. Their $15 burger and beer special on Monday is one of the best around for the quality burger they offer. I felt the bar was nice and could see myself hanging there for a bit. Service was friendly and top notch."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ONGVtWnZSbWRaYjFNM1Ixb3hlbGd0TkRCQ1puYxAB",
            "text": "Burgers are tip top. Great drinks menu. Staff (Ethan) and food cudn’t be better. Not sure how I found the place but well worth the visit."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJbngwSjYwNWMyTVlBEAE",
            "text": "Great burger and back patio"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN1p6V2R3EAE",
            "text": "Excelente bar y mejores hamburguesas. Recomendada por el personal del hotel no nos decepcion y disfrutamos de una autentica experiencia culinaria americana con excelente carne vacuna para una delicatessen hamburguesistica. El local esta limpio y bien decorado y con una ambientazo por la noche que hace que tu velada sea de las mejores en la City. Recomendable entre semana para evitar el colapso del fin de semana."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbzlhS2NnEAE",
            "text": "Zak and Ethan knocked it out of the park. We had a few bad experiences at other places before landing here by accident. Best accident!\n\nWe were immediately served! Great food, bartender was on POINT!!! Drinks were perfect and the food was amazing. This spot is an absolute go to and it's the people that work there that create the vibe.\n\nWhen you go, you will not be disappointed!\n\nOnly have one photo of the chili because the burger went to fast!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOG9idXZ3RRAB",
            "text": "So far the best burgers we've found in town, and they're well priced!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3aHVmTUpnEAE",
            "text": "This place saved my life!!! My partner and I went to the bar next door for sushi and their kitchen was closed all evening! This place was pretty much closing their kitchen and saved my hangry dying life that hadn't been fed in over 8 hours. The bartender was so nice and realized that my partner was in trouble for making me go so long without food while on out travel day and saved him from my hangry butt. Their nachos are to die for!!!! I'm not kidding! Just get them and the truffle Parm fries. Thank you Royale!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MU82NG5RRRAB",
            "text": "Solid burger, great onion rings"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRd2VPNE1REAE",
            "text": "This neighborhood staple bar and grill serves up AMAZING burgers and hand cut fries in modern, cozy digs. The burger was amazing, the fries perfect and the service was friendly. I can’t wait to go back and try the chicken sandwich.  Chef Luis said that he marinates it overnight in buttermilk. That’s got to be delicious. I can’t wait to go here once the weather is warm and the cute little patio opens up. 6 ⭐️"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMjZhOWVnEAE",
            "text": "They got great burgers."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBdTRDalJ3EAE",
            "text": "Great dive with great burgers.  And a really good happy hour deal too."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBdk12OWZBEAE",
            "text": "The bartender pretended I am racist because I didn’t say “tortilla soup” in a way that he liked.\n\nWe’re not doing this anymore."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBanIycXdBRRAB",
            "text": "Best burger in NYC."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmaXZQSE9REAE",
            "text": "Fantastic burgers!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQb3NhUGVBEAE",
            "text": "Wow"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzLUx2cGZBEAE",
            "text": "Fire spot"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbzdDc3JnRRAB",
            "text": "Amazing food, service and staff. Neighborhood spot that never disappoints!  Best backyard in the East Village."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYd19PMFl3EAE",
            "text": "Mateo and staff treated me so well. Food is good, ambience, games are class. A hidden gem in east  village, 10/10 would recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYZzZQOTR3RRAB",
            "text": "Take your order twice and it’s not in the system. Don’t come here :)\n\nUpdate: they charged us for the food and tell us to leave for the next party. Food never came! This is wild"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdE5qdjlnRRAB",
            "text": "The grilled cheese sandwich is amazing! A must have!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bGZtRjFBRRAB",
            "text": "Food, drinks and service are great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURub1piOXRBRRAB",
            "text": "Burgers were good! Service was friendly. Backstreet Boys playlist was terrible."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuMTZQWGl3RRAB",
            "text": "Good vibes, food and beer excellent place to enjoy with friends"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubk9fajdRRRAB",
            "text": "No, you did not say anything that it will take 30-40 minutes, You said it would take 10 min, neither did you say you only serve those who make reservations before hand. Why would I stay if that was the case. You were not interested in serving at all. Probably you were interested in people who ordered alcohol as well. After around 40 minutes I left hungry. You don't defend your mistakes, you own it and don't repeat it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNud08zVFd3EAE",
            "text": "We got married at Royale and we couldn’t have asked for a more perfect venue. Dave is fantastic to work with and made the evening so special. The place was perfect for cocktail hour, ceremony in the back, dinner, and dancing! Dave and team made the whole night magical with delicious food and drinks and the best vibes in all of NYC. Can’t wait to continue to host more things at Royale and go back for the delicious steak sandwich 🤤!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIcS1EWHNBRRAB",
            "text": "So tasty food we was went for dinner it was verry good experience love that food special margarita ❤️❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3ejdTanNBRRAB",
            "text": "Came for food and drinks in the middle of the day. Ordered buffalo wings, mac n cheese and a smash burger. I wanted to like everything but it was all so dry. The food was a bit disappointing. The atmosphere is cool so we will come back for drinks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dkp5VVN3EAE",
            "text": "still in love with this beauty of food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3dC0zNUhREAE",
            "text": "Everything here is great. The food is restaurant tier along with the cocktails. Staff is always friendly and welcoming. I’d recommend the royale double cheeseburger and the nachos with steak ;)\n\nLove y’all baddies ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3eF9mNW5RRRAB",
            "text": "I hosted my 30th birthday party at Royale and we had a fantastic time! The drinks were great and the food was amazing. The service was on point and management was really easy to work with in booking the space. We had a fantastic time! Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMWFfb25RRRAB",
            "text": "We were here for a get together yesterday and we had such a great time. The burger and chicken sandwich were amazing and our bartender Andrea was the best! We will definitely be returning soon"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyN0plaE9REAE",
            "text": "This east side pub has a good menu. I came in here on a Friday night and got their \"royale with cheese\" (a cheeseburger). The meat had a great savory flavor of one that's been cooked to perfection. The music selection is great too, making the whole place fun to hang out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNEw3UEhBEAE",
            "text": "shout out to \"John\" for playing Charli XCX. we love you <3 we will never forget you!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyNzdmNHR3RRAB",
            "text": "The beers were amazing, and the food is great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNycjRPRWtBRRAB",
            "text": "Everything is AMAZING!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMbXZQV2dnRRAB",
            "text": "Real enjoyable romp! Great vibes, well priced beers, good bartenders…… but mediocre burger. I’m sorry, it’s just a little bland. Poor seasoning, poor cook, solid bun and accoutrements"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMeXRpVUtBEAE",
            "text": "Great burguers"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6eE91bzZRRRAB",
            "text": "Please do yourself a favor and book Royal Bar for your next event! Working with Dave’s team is a breeze – he's upfront with pricing, flexible, and communicative. We recently rented out the back deck and patio for our corporate Pride event. Despite a slight hiccup due to weather, the team acted quickly with the retractable roof and provided options to move part of our event inside if needed.\nDave's team was incredibly gracious with the event setup, allowing us to reconfigure the deck to accommodate our photo booth activation and speaker system for our drag entertainer’s performance. The food and drink service was unbeatable – Brooklyn prices in the city are hard to come by, and the quality of the food was a highlight.\n10/10 – I will definitely consider rebooking with his team for both personal and corporate events!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6X3B1ekxREAE",
            "text": "we came here for an afterparty for our small wedding and had an absolute blast! john and mateo took amazing care of us from start to finish and we had exactly the experience we were hoping for. there are lots of bars in nyc but not all of them have this kind of customer service; we felt like they really cared that we had a good night. would recommend to anyone"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6OXRubUN3EAE",
            "text": "Ordered a smash burger and it 100% was not a smash burger. Wasn’t smashed, over cooked, and had bacon on it. Who puts bacon on a smash burger????\n\nAtmosphere was chill. Outside is nice. Drinks were solid. Fries were solid"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUcmVlTjdBRRAB",
            "text": "The perfect grilled chicken sandwich.  Need to go back and try the hamburger next time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbGRxRWN3EAE",
            "text": "Went with the crew for dinner after track workout. Loved the setting at the back. Very spacious. Spicy chicken burger was on point. The price was very reasonable. Would love to go back & try other dishes."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPb3JPSC1BRRAB",
            "text": "Simply delicious.  They say it is the best burger in nyc.  The meat is pure.  It is cooked a perfect medium rare.  The bun is soft, never soggy.  The burger is accompanied by a perfect ipa or whatever you chose from the bar.  And then there’s the beer batter onion rings. Mind blown."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXcU91WlJREAE",
            "text": "Not plus size friendly.  Tables are very close. Chairs for small bottoms only. Brunch pitcher strong and delicious.  Limited brunch menu. Burger good."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2NnNfYWVnEAE",
            "text": "So…Best Burger in NYC? Yes, this is the place! Burger are super juicy, pub style patties. Incredibly fresh fries. Solid selection of brews as well."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadGRqR0tnEAE",
            "text": "The whole staff is just amazing! Sunday's at Royale is our place to go to after coming out of the House of the Lord. Burgers, nacho dip, and wings, along with fun & board games. They also have a back patio to sit, eat, drink, and just chill out while enjoying your time there. Can't beat that every Sunday! Special shout out to Hailey, I love ya, Gurl!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhd1pHa1h3EAE",
            "text": "Royale is a great spot whether for a casual drink or an event. Really nice bar with indoor and outdoor seating, including a beautiful back patio area. Good beer selection on top of wine and cocktails. Friendly, hard-working staff. And a phenomenal burger."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtdU0zVUZREAE",
            "text": "Bar in front.\nWarm outdoor dining in the back.\nFriendly staff.\nVery clean.\nUnisex Restrooms 🚻\nDELICIOUS BURGERS 🍔 AND FRIES 🍟\nDRINKS- DELICIOUS"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxNXBMblVREAE",
            "text": "Killer wings. Great spot to watch a game or to just hang out. Fantastic draft beer selection, super friendly staff, unbeatable prices. A local classic.\nHailey rocks"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsMk1xTXdnRRAB",
            "text": "Royale is an absolute gem in the heart of the city, and I can't help but sing its praises after my recent visit. From the moment you step through the door, the ambiance is a perfect blend of classic and contemporary, making it an inviting space for anyone looking to unwind with a good drink.\n\nWhat truly sets Royale apart is its exceptional selection of beverages, and the Guinness here is nothing short of perfection. Served with that ideal creamy head, every sip is a symphony of rich, roasted flavors that dance on your palate. The bartenders seem to have mastered the art of the perfect pour, and it's evident they take pride in delivering an impeccable pint.\n\nThe staff's knowledge and enthusiasm for the drink menu add an extra layer to the experience. They're not just pouring drinks; they're crafting an experience, sharing tidbits about each beverage that make you appreciate what's in your glass even more. It's a level of service that elevates Royale from a great bar to an exceptional one.\n\nThe atmosphere is lively but not overwhelming, making it equally suitable for a casual night out with friends or a more intimate gathering. The decor exudes a timeless charm, with a well-thought-out layout that encourages conversation. Whether you're at the bar engaging with the friendly staff or nestled in one of the cozy tables, Royale strikes a perfect balance between energy and relaxation.\n\nAnd let's not forget the menu beyond the drinks. The culinary offerings complement the bar experience seamlessly. Whether you're in the mood for a hearty pub classic or a more refined dish, the kitchen delivers with quality and flavor that match the excellence of the bar.\n\nIn conclusion, if you're a Guinness enthusiast or simply someone in search of a top-tier bar experience, Royale is the place to be. It's a haven where the art of pouring a perfect pint meets a welcoming atmosphere, creating a haven for those who appreciate the finer things in life. Cheers to Royale for setting the standard high in the world of bars!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDN0wyeFV3EAE",
            "text": "Best burgers, tots, and chicken fingers in the East Village! Hands down. Amazing outdoor patio in the back that's my favorite place to drink a margarita after another COVID work day."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaXRhZEJ3EAE",
            "text": "Hands down one of the best burgers you will find in NYC. I added an egg to mine but any burger you choose is amazing. The choice/choices of meat used to make the burger patties is phenomenal. Bartenders are friendly and make good drinks as well."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDdkplalBREAE",
            "text": "All the food was great nice outside seating.it rained but we were under a nice umbrella. Drinks were nice and strong. Wonderful waitress."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3OXRURUNREAE",
            "text": "Must try the onion rings if you're grabbing food!  This is great gem if you're looking for a good bite, beer and true bar feel..... And interested in traveling East. This place has a fun night life & good date spot as well. We came here on a Friday night, so we grabbed food then stayed at the bar after. Great outdoor space too!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1X01URlRnEAE",
            "text": "Spent my birthday here and it was LIT! Great music. The burgers were amazing. And liquor was flowing. Jay the bartender is amazing. Must visit for NYC."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1Z1luXzZBRRAB",
            "text": "Really cute restaurant/ bar with ample outdoor space. Creative cocktails and delicious bites."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOeV9ubG5BRRAB",
            "text": "Your perfect neighborhood watering hole and burger joint. The staff is incredibly friendly and hard-working, the drink selections are always on point, and the burger is delicious & reasonably priced.\n\nI always take family and out of town friends here because I know it’s going to be a good time. Bonus points if you ever take advantage of the backyard seating. It’s very pretty and you couldn’t tell that from walking down the street.\n\nHighly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwak8tcDhBRRAB",
            "text": "Absolutely incredible vibe. Burger was spectacular, beer variety was great, but the real winner was Hailey’s Picklita, 10/10 would pickle again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWM09DV1pREAE",
            "text": "Royale was great! Recommended by the owner of another venue a few doors down.\nIt was bustling with...not noise but what sounded like good ole conversations and loads of fun.\nThe staff was very accommodating and genuinely attentive and conversational.\nMy group of 4 sat out back under heaters and it wasn't bad at all.\nWe had the spicy hot apple cider and vanilla dessert balls. I forget🤦🏾 but we  played the board games and just hung out a bit. Cozy spot.🙆🏾‍♀️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMnRPUWZ3EAE",
            "text": "Nice atmosphere, has indoor and outdoor seating, burger was good but nothin to write home about, you can tell its quality ingredients though! Fries were decent. Food came quick but service after that was a bit slow, the bartender was the only one walking back and forth waiting all the tables and then serving drinks at the bar. The thing that caught me off guard was that the ketchup tasted like they poured beer in there, not sure if it was just the bottle at our table or what."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0cTdhSEVBEAE",
            "text": "Great local. I've been coming here for years and never bothered to leave a review, but had such a great time through it seemed worth it. Food is stellar and diverse, beer selection always has what I want, and staff is engaging, cheeky, and make you feel welcome. Recommend anyone in the area stop by."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKM1BuZlp3EAE",
            "text": "We recently hosted my buddy's pre-wedding party at Royale and it couldn't have been more perfect.  We took over the back patio space and the ambiance, food, drinks, music, good vibes from the staff were all top notch.  Dave from the events team was awesome to work with in the lead up and planning. Ryan (our on-site contact) was efficient, and easy going - he kept the drinks flowing and in order which is no small feat!  We were also impressed by the quality of the food which we added with our open bar package.  GREAT experience overall and would happily and without hesitation host here again :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwajl2cW9nRRAB",
            "text": "Royale is a true neighborhood bar in the East Village; it’s rare to stop in and not recognize a customer or get a friendly greeting from the staff. The food is consistently high quality and delicious with a great selection of beers on tap. The back patio is a fantastic hidden gem for relaxing in year round. All in all it is a great bar!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdC1lZWtRRRAB",
            "text": "Typical atmosphere for the neighborhood, which is a good thing. Very good service especially when you consider how crowded it was: very attentive, friendly and accommodating. Really good burgers. Recommend the Double Royale and the Marcellus Wallace.  Hand cut fries were a bit cool but really good. Some people might have considered the truffle parm fries undercooked but I loved them. Bring an appetite. Excellent beer selection. Mixed drinks looked awesome. Definitely going to make this a regular stopover when I’m in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwOUkyOU1REAE",
            "text": "I had my daughters going away party in their backyard garden area and everything was just PERFECT from the atmosphere to the service to the food and drinks! Shout Out to Ryan, the manager, who made it simple and seamless from start to…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKeTlPUDNRRRAB",
            "text": "If you're looking for an incredible bar experience, look no further! I had the most fantastic time at Royale and I can't wait to share my wonderful experience with everyone. From start to finish, this place had it all – great atmosphere, delicious drinks, and most importantly, an outstanding staff!\n\nHailey, Bridget and Ryan’s genuine interest in getting to know their customers made the day even more special. They engaged in friendly conversations, sharing stories and jokes, making me feel like a valued guest rather than just a customer.\n\nOverall, my visit to Royale was nothing short of exceptional, and I have the staff to thank for it. The incredible service they provided made all the difference, turning an ordinary night out into an extraordinary one. If you're looking for a bar with an outstanding staff that goes above and beyond to ensure you have a fantastic time, Royale is the place to be!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcGZpdG53RRAB",
            "text": "This was the first bar I ever hung out in when I moved to NY, and I can’t say enough amazing things about them. The food is amazing, and their burgers are some of the best I’ve had in the city. The service is wonderful and the staff always make me feel welcome.\nThey have outdoor seating and a beautiful patio. It’s a great place to go solo or with a large group of friends."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcExlVDlnRRAB",
            "text": "Oh, The Royale bar in NYC is an absolute gem! From the moment I stepped in, I was captivated by its stylish ambiance and chic decor. The staff was incredibly friendly and attentive, making me feel like a VIP throughout the evening.\n\nTheir cocktail menu is a work of art, boasting a delightful array of creative concoctions that left my taste buds dancing with joy. Each sip was a burst of flavors that transported me to a euphoric state of bliss.\n\nThe live music performances were top-notch, adding an enchanting touch to the already magical atmosphere. I couldn't help but groove along with the tunes and lose myself in the moment.\n\nThe Royale's attention to detail is truly commendable, evident in every aspect of their service. The carefully curated selection of spirits and the presentation of each drink showcased their dedication to delivering an unforgettable experience.\n\nWhether you're looking for a cozy spot to unwind or a vibrant place to celebrate, The Royale has it all. I left with a heart full of happiness and memories that will stay with me forever. Without a doubt, The Royale bar in NYC is a must-visit destination for anyone seeking an extraordinary night out."
        }
    ],
    "reviews_count": 77
}