{
    "name": "Ladybird",
    "place_id": "ChIJdWfZe5FZwokR8k6hhjU5uQo",
    "grid": "MN3",
    "address": "111 E 7th St, New York, NY 10009, USA",
    "rating": 4.6,
    "user_ratings_total": 894,
    "phone_number": "(833) 328-4588",
    "reviews": [
        {
            "date": "수정일: 5시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FNFRVNU1abVpLVWsxNlRuWkZjM3BaYzNGbkxYYxAB",
            "text": "Excellent food, ambience, and service! Highly recommend."
        },
        {
            "date": "6시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GelkxbzRRMDVFYjFnNGRVMUhOVkZpWkhoM2JIYxAB",
            "text": "Amazing customer summaries by our waitress Maya. The food is so yummy. We will definitely come here more often. The bow buns are very, very good.sandwiches are so good."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sc05qSXlNRFpFYmpsalUwUm9SelJPT1VkTU5XYxAB",
            "text": "Omg food, drinks, vibes were great. Catrina was a fantastic bartender and obviously knew what she was doing and loves her job!! Will be coming back"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toa1psSkJTbFJuTldSSVVqSnJhV0Z5ZWs1SlNtYxAB",
            "text": "Genuinely favorite place I’ve been in East Village! The bartender was absolutely amazing and kind. Food was phenomenal and flavorful. Love the vibe a lot. Gotta go here!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoclNuVlNjR2RDVVVSNmMxSnpSbFpYT0hsWFExRRAB",
            "text": "Yes yes yes, Bao buns were amazing. The service was amazing service! The dodo drink, soooo good! Ambiance and decor, soooo cute! Would high reccomend excited to try the other restaurants that they own."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRNFZrYzVhV1JIUm5SdlRXdDBUMEpXYm5SMVRXYxAB",
            "text": "Delivery is slow and some days they just ignore their service . Food is ok and drinks is good but delivery is potato and tomato’s hold the carrots"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVFZERXpWVEowZGxCeFpqaEtjMGhrWlY5RGFHYxAB",
            "text": "I dined here because the menu is accomodating to allergies and different diets (fully-vegetarian menu!) The staff was nice and we didn't feel rushed during peak lunch time. The drinks were good;  food: okay."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOV1RrZEVhblZyU20xd1MwUTBhV2RYUVVZeVpWRRAB",
            "text": "Brought my family here. We had a blast. The food is delicious!\n\nWaitress was quite rude to our family, did not appreciate being asked questions about the menu... But we did not let her sass dampen our moods for our lovely night out.\n\nThe names of birds for the cocktails are clever -there were also mocktails for the other half of our party that doesn't drink!\n\nCocktails were alright, a little weak. But we did not mind, as we came for the food. The macaroni and cheese was insanely delicious. We could not get enough of the broccoli! Flavourful and ADDICTIVE!\n\nWould definitely come back. The area is cute, and the atmosphere is decorated so fun."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5M1ZEUnBNRWQ1WlZkbFNrbHJlR1oyV1VsTWVrRRAB",
            "text": "Ladybird is an exceptional vegan restaurant that truly elevates plant-based dining. The presentation of every dish is absolutely stunning — colorful, creative, and plated with real artistry. The variety of dishes is impressive, offering something for everyone, from indulgent comfort foods to beautifully balanced small plates.\n\nEach bite is packed with flavor and freshness, making it a delight even for non-vegans. The atmosphere is chic and cozy, perfect for a night out with friends or a special date."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21seFZURkROa2hPUW5WSk1VcExaa05EWDBkRGJFRRAB",
            "text": "Several dishes we got were just covered with the same vegan spicy mayo/slaw. Need a bigger variety of flavors/sauces given that the menu is trying to be pan Asian. Ended up just being a river of the vegan spicy mayo doused slaw. Monotonous flavors across several of the dishes."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201ck5HVXhXa3BzZVVoVldFYzNiR0o0Ukc5RGMwRRAB",
            "text": "The food is delicious , the music is awesome and the service is great!!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KRVRHSkpNMk52WkVSdlZIY3dRbHBQV2tKU1VYYxAB",
            "text": "Came here for brunch and the atmosphere and food were both impeccable. They gave my partner and I a free cocktail for his birthday, and it was amazing! Definitely recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KamNUWlFVRVZTVkc5RGFVWTBkbEptV2xvMFRrRRAB",
            "text": "Delicious food and drinks , great atmosphere and service.\nThanks for the hospitality.\nSee you soon!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKak1qTm1NeTFtUWpGS2QySmxkVjlHV2pWVFNWRRAB",
            "text": "I knew Ladybird was well-situated, but was surprised by the staff's excellence. The kitchen doesn't compromise on ingredient quality. The employees maintain a friendly demeanor. Ladybird created an atmosphere that seemed sprinkled with magic dust! Nothing else compares in overall value."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOVlpYVm5RalJpZFV0d1FXRXhNVk5TZVVST1NYYxAB",
            "text": "Loved the interior and the food. Must haves are the dumplings and the Thai peanut bao. I have a bao food truck myself and will admit that I think they might of beat me with that one. Drinks are perfectly balanced and more of an experience of the drink itself rather than something to get a little tipsy off of which I love."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0bWJHdGZTVE5rV21kdlZqUk9RMVU1TTJkaVMyYxAB",
            "text": "This was my second time here at LadyBird and I came for the brunch menu. Our reservation was for 2:45 on Saturday, so we got in right before the kitchen closed. This place is such a gem and so pretty. I wished they played music, but otherwise, great experience. My friend is vegan, so he really enjoyed the menu selection. The cocktails were also good, but could be a little more stronger. The service was great. I ordered the chikin and waffles, which was to die for. My friend ordered the bao which was equally delightful. I will be back. The only thing I would say is the food is a little pricy considering there is no meat."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paT05FOHpTa1ZDYTNoWmVVMUJZMlJrUzFaQ1FVRRAB",
            "text": "incredible vegan food with most beautiful location! i always look forward to coming back !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0eE9XaFpNRUpQV2t4Q1VHOXZjalZUTld4TFQwRRAB",
            "text": "Sofia was an incredible host and guided me through through the menu extremely well. She’s an expert and so kind!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twNVFsRm9ZekZSUVRSdlFqTnVXR0ZoYVRsc2FrRRAB",
            "text": "Great and delicious food. Even my carnivorous boy friend loved it and was full. The waitress  was amazing and positive even though she was the only one."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FMU5pMHhOMUZqUXpCSFgycFhjbkJLTkVkcE4yYxAB",
            "text": "So cute, so delicious, great staff. Kinda pricy, but worth on occasion."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4d1QxQkVSVlZMZURSNWRWUXlRVVJuU2tSQmQwRRAB",
            "text": "Went here for brunch. Had the tiramisu french toast (good tiramisu flavor) and the egg sandwich, delicious breakfast classic. I also had the matcha tres leches - my favorite!! Had maybe a basil syrup? Exquisite!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKSkxVMTJZMHROTW5GUlRsVk5ha3BIVFVwRU5VRRAB",
            "text": "Amazing food, people and atmosphere!\nMy partner and I had our anniversary dinner here. Full vegan menu which is amazing and my carnivore partner enjoyed immensely. We had the watermelon  tacos, the Bao buns trio ( the contents of the buns was good but the bun!!! Omg!!!! I'm steal dreaming about those buns), corn ribs, dumplings, Mac and cheese with the kimchi on the side because I'm not a kimchi person, the Mac and cheese did not fall short without it. My baby liked the kimchi. The only problem I had was I couldn't eat anymore than I did. The portions were shareable, flavor was immaculate. Catering to the taste buds of vegans is one thing, but grabbing the attention of carnivores is top tier.\nAlso, drinks!!! Don't remember the names mine was amazing my partner felt like hers could have been stronger. Overall, our experience was amazing and we will definitely visit again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWYVdWaG9hMGxKYUhwbVdteHlNRWMwY2xkaWNHYxAB",
            "text": "Vegetarians take note - NO spongy wheat meat here! Delicious bao buns, and yes, the watermelon taco was a tasty surprise! Standout dishes include; General Tsaos Cauliflower, Kim Cho Mac and cheese and tonaktsu sandwich - yum! Recommend. Give it a try; you won't be disappointed"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SeFNIZG5XVE40VW1SNVZVdFRObXd0V205cVFYYxAB",
            "text": "Brunch was delicious, must come back for dinner. We ordered the BEC Buns, French Toast, and potatoes. Everything was perfect! Service was friendly and fast. We had a reservation, our seating was ready and waiting for our arrival. Were were celebrated with a complimentary drink for our anniversary."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5ZlREaEZNa3h0Y25waU1WVjRSRVp5UzB0SVMxRRAB",
            "text": "Had an amazing brunch at Ladybird! My friend I went with is vegan but I am not. I am so glad I found this place the food was delicious. We had James as our server, he was fun and attentive. Made great suggestions.\nMy friend ordered the French toast and egg sandwich and I had the BEC buns which were delicious! I think about the still!\nLooking forward to taking other friends and family. It was a great Sunday afternoon."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWb0xXRlJiVEJQUVMxYVVrdDRRelpyYzBWUlRsRRAB",
            "text": "Food was better than I expected as a non-vegan person. The French toast was great. They were very busy so it took a bit for us to order but it was understandable and the food came very quickly. I wouldn’t get the mushroom bacon again. It wasn’t bad but nothing at all like bacon, more like jerky and I just wasn’t wanting that texture. My friend like the mushroom bacon ok."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVWQwbGhValZaVG1nM1drMTNWR05sYkRsbmJXYxAB",
            "text": "Delicious food!! One of my favorite vegan restaurants 😍. It's not very expensive and the service was great 👍🏽. The restaurant is small but very cute. I definitely want to go back!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KclEzaHBNalpNWWxCQlExVjRUbkJpV2psUVUxRRAB",
            "text": "The vegan baos taste really like meat. The staff are super friendly and the decorations are nice."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aZk1GUXlMWHA2VWxGS2RXWlJOVWx1VjI5aGRGRRAB",
            "text": "Incredible dining experience. Staff was extremely kind and helpful, food was exemplary, atmosphere was stunning. 11/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5Sk5reHJVM1IxTTJ3dGJXUldkbTlhVEZwdmNtYxAB",
            "text": "Delicious.  My gf, our friends, & i had great time and they were very conscious of our allergies! Big fan will be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ad2RXODVVbWRpYm01bVpGRmZOMGRzVWxKbGNrRRAB",
            "text": "Went with a large group of girlfriends and we had a blast! The service was great and we got a cozy booth in the corner. I've been here a few times and it never disappoints! A few favorites were the bao trio and the watermelon tacos!! Will definitely be back when I'm in NYC again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psVmJFZHFPR055U0RoblZuTmZRMDVFTVhSUU9VRRAB",
            "text": "Cute restaurant - in all senses of the word “cute”.  Very floral aesthetics.  Good dim lighting for an intimate dinner atmosphere.\n\nThe food was only just above average, because a lot of the flavours were sweet.  The baos have sweet buns (I know that’s normal) but the sauces within were also sweet, the cocktails were predominantly with a sweet flavour, I guess it matched with the interior.  But a little too sickly sweet for my taste."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ndFluZDJkVlJuUVV4RFMwbERSMUZGVG1GTlRYYxAB",
            "text": "Enjoyed Ladybird on Monday. I felt the food I ordered was average vegan food. The Mac and cheese stood out and was very tasty. Ambience was just ok. It had a bit of a stale smell and bar seating was a bit cumbersome. The bartender was very nice and attentive.\n\nReally only visited because a friend had dietary restrictions as a vegan and my go to vegan place was closed for renovations.\n\nNice experience but I definitely left a bit underwhelmed and as an omnivore  … I definitely felt like I had just eaten “vegan” food which I don’t think is great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRlVFWllNMUIwUnkxaVEzVnljMlZIUTNKZk1rRRAB",
            "text": "Visited the day after July 4th and were pleasantly surprised to be seated immediately. The restaurant is on the smaller side with a cozy, charming bar, though it felt like the space was slightly behind on cleaning and upkeep- possibly due to the post-holiday rush. Service was efficient but leaned toward rushed and impersonal.\n\nThe cocktails were underwhelming: watered down and forgettable. I’d recommend skipping them and focusing on the food instead.\n\nWe ordered the bao trio, which was a highlight-each one with its unique, delicious flavor. The kale salad was another standout: crisp, well-prepared, and packed with flavor. Definitely a must try. The vegan macaroni and cheese was indulgent and rich. While I’m not usually a mac and cheese person, this version would definitely appeal to anyone who loves vegan cheese.\n\nWe ended with the strawberry cheesecake, which was the perfect close to the meal-light, mildly sweetened, and refreshing. Ideal for summer.\n\nOverall, the food holds its own among the many vegan spots in the neighborhood. Worth a visit, especially for the solid menu.\n\nBonus points: They allow dogs inside!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4UmFUWlZaRU5RVkZCVlNGWkJaRlU0YkRoTGFtYxAB",
            "text": "This was our first time at Ladybird and OMG we were incredibly impressed. Stunning space, super sweet/attentive server, and the food was AWESOME! We shared three different items for brunch. We had the BEC Bao Buns, and loved them so much! The mushroom bacon was great, and that is coming from someone who doesn't normally touch mushrooms. The Breakfast Potato side is outstanding. We loved the black garlic aioli. The Brunch Sandwich was really delicious and also came with breakfast potatoes. Overall we loved our meal and experience here. I can't wait to go back in the fall for dinner when I am visiting again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205aVJEaG5jMTlXVUUweGNrbEdiMWRzUzNScFpGRRAB",
            "text": "the absolute most delicious vegan/vegetarian restaurant ever. Every dish me and my wife ordered was superb. You cant go wrong with anyone. it was hard to believe none meat dishes can be so good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTU4wb3pUa3hsVkZoRU5Vb3hSRUpVTVZGNmIxRRAB",
            "text": "Our crowd received immediate seating and consistently good service. I prefer Ladybird because they excel in both food and worker attention. The food is okay but the ambiance is gorgeous. The food quality here is excellent! The expense is worth the experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aMFZGTkVlV3RGUVdweWRsRlNha2RsYzB3ME1HYxAB",
            "text": "The food is phenomenal. The General Tso Cauliflower and Watermelon tacos (when in season) are musts. Everyone that worked there was super friendly. Highly recommended."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xd05FaFlhMVJXVkZaMVJucGxSbTk0ZVRKeE1tYxAB",
            "text": "Went for a special weekend brunch and it was delicious! Can't wait to go back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSWlRuUXhaRWxtVHpSclZ5MHpNVlU0WXpNMVZtYxAB",
            "text": "The second you walk in you know this will be a lovely experience. It’s so pretty! Then they hit you with this unbelievable food. The flavors, the combinations, the deliciousness abounds!!! I have been there so many times now I’ve tried everything."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkTU5ITnlaVXBsZDFwSVZIWmZTVFJHU2xscFpsRRAB",
            "text": "I've been here over 5 different times and the staff and atmosphere are always amazing. The food and drinks are always on point too, I have yet to have anything here that wasn't fantastic."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvMFlsVXphMHQwYWxaNFptOWhaRkppVVdGaFFtYxAB",
            "text": "I went here for a small gathering celebrating one of my favourite beer brands, Back Home!\nThe food was super tasty and allergen friendly. My best friend who is gluten free had plenty of options that were so so yummy!\nIt's also a plus that they carry Back Home Beer!\nWe sat at the bar which was plenty spacious and comfy. The space overall is tight but it didn't feel like it. The decor is modern and beautiful. Can't wait to go back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLekJ6WTItMHQtWXV3RRAB",
            "text": "Unique place with the atmosphere and menu."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQzUwcTN5M29qb0hREAE",
            "text": "The cutest vibes and the food was AMAZING!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKejJuSmltOGViTjVRRRAB",
            "text": "Wow wow wow. Perfect spot. The interior aesthetic is so cute and chic. The music playing was calming and felt like I was in Europe or something. Staff was very friendly and the foooooood 🤤 my god. We got three entrees and ate it all lol. Great flavor. Fresh ingredients. Go here!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQU3Y0cFh3OGNLMF93RRAB",
            "text": "I love the dinner menu at Ladybird (I get the kale Caesar salad and Ghia spritz every time and I love the new tonkatsu sandwich) but I tried their brunch recently and want to go back ASAP. I loved the matcha waffles and grilled cheese but want to try more!! Plus the servers are always incredibly friendly."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPdjBpWVdHNFBUQnB3RRAB",
            "text": "I love everything about this place! Stellar vegan food, service and vibes. I try to come by whenever I’m in town and highly recommend the bao buns and general Tso’s cauliflower. Honestly SO good!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPWF9ndTZhNDZHemxRRRAB",
            "text": "Cute place for small bites at night or brunch in the day time .  They have some gluten free options and the whole menu is vegan ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJXy1qcTJtLVpfWE5REAE",
            "text": "We happened upon this place by chance but it’s extraordinary- the vibe, the service and the incredible tastes- and I’m usually on the critical side. This is just amazing wow"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOLXQ3YmpsbWFldnpBRRAB",
            "text": "Always looking for new vegan places when I travel to NYC. Loved this little gem of a restaurant! The atmosphere was great and all the food was delicious! The Kale Caesar salad was incredible. Several GF friendly dishes as well. Will 100% be back at some point!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfNDhiQXJ3RRAB",
            "text": "Ladybird is an absolute gem! From the moment you step inside, you're enveloped in a fantastic, cozy, and romantic atmosphere that's simply stylish. But what truly sets Ladybird apart is the incredibly tasty food - every bite is a delight! The drink menu is equally impressive, with something for every taste.\n\nThe friendly staff are the icing on the cake, making you feel right at home with their warm and welcoming service.\n\nLadybird is an outstanding destination that's an absolute must-try. Don't miss out on this hidden gem - book your table now and get ready for an unforgettable experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIZzZHQjBRRRAB",
            "text": "I had the best brunch at Ladybird in New York! The food was absolutely delicious, with creative and beautifully presented vegetarian dishes that exceeded all expectations. Every bite was so tasty, and the ambiance made the experience even more enjoyable. The atmosphere was so nice and cozy - I felt right at home from the moment I walked in. The staff was friendly and attentive, ensuring everything was perfect from start to finish. If you’re looking for an exceptional brunch spot in the city, Ladybird is a must-visit. I can’t wait to be back for both brunch and dinner!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNWNmUTZBRRAB",
            "text": "I had a blast photographing Nancy and Nick's wedding reception at Ladybird last fall. They rented the restaurant for their event and had the most amazing time. The food and drinks were on another level and the vibe was so intimate and cozy…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfakpta0pREAE",
            "text": "A perfect pick for a quaint and elegant vegan dining experience. Ladybird offers bold fusion flavors on familiar comfort foods in a setting that is exquisitely decorated (check out their bathroom). My friends and I loved the bao trio, we got two flights so we didn’t have to share. Each one is a great complement and contrast offering a zesty buffalo option and savory/creamy filling that bodes well as a handheld. The kale Cesar salad was an unexpected hit, with what tasted like rice cracker croutons and flavorful crispy mushroom bacon, I could’ve eaten two of these. We also loved the kimchi mac and cheese, so much that it was demolished before anyone could take a picture. It’s a harmonious blend of spicy and creamy served with al dente pasta. The corn ribs were also a favorite, definitely on the lighter side, but paired well with everything served. I’d definitely recommend not skipping dessert—both are fantastic in their own right. The cheesecake is a fragrant blend of berries with a burst of brightness from the yuzu. The tres leches is light and creamy with fresh fruit served in a glass.\n\nI loved how innovative every bite was and will definitely be visiting their sister restaurants part of this chain. Highly recommend if you are craving a feast for the eyes and tastebuds!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEN01PM0tBEAE",
            "text": "Came here with a vegan friend who is from way out of town. She really wanted to eat here and they were really nice to take us at the bar without a reservation. Service was good. Food was tasty. Liked the oyster mushroom chicken and waffles. Perhaps the best is the ambiance tho. Pink, fun and beautiful!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINnRhRHVBRRAB",
            "text": "Went here for brunch for the first time and the food was AMAZING! I love how much they use just egg and how flavorful everything is. We got the egg sandwich and the BEC bao buns and it was all incredible! Also the breakfast potatoes are now my favorite potatoes EVER. Our server Maya was so sweet and helped make our experience even better. Can’t wait to come back here for dinner!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3cU5MZmtnRRAB",
            "text": "LADYBIRD is one of my favorite 100% vegan spots in the city. It has an upscale, elegant-but-fun vibe. The drinks are always great - my go-to is the one simply named LADYBIRD. (Delicious and easy to remember!) The food is always excellent, and they recently overhauled the menu with some incredible Asian-inspired dishes. I went with a friend and tried almost the entire new menu: Watermelon Tacos, the Sweet Thai Bun, Cucumber Salad, Miso-glazed Avocado, Bánh Mì Toast (my favorite), the Hot Udon bowl, the Tonkatsu Sandwich, the Kimchi Mac & Cheese, and the Cherry Yuzu Cheesecake. It’s a very different menu than in the past…but, as always, it is incredibly well done. Ladybird is a perfect date spot, but you can also enjoy it with a group of friends for an upscale occasion. I highly recommend it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMN2RxdWFpbElTYThRRRAB",
            "text": "10 out of 10 even if you’re not vegan. Try it—you’ll love it. I think this might be the spot to take people to if you’re trying to convince them that vegan is not bad. :)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZak1YVzVnRRAB",
            "text": "Great vegan restaurant! Loved how friendly the staff was and amazing food. Highly recommend the croquets and the tonkatsu sandwich - very well done!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3eElMQUtBEAE",
            "text": "Our server was so kind, the atmosphere is warm and inviting, and the vegan food is absolutely amazing, especially the chicken and waffles and the breakfast sandwich. Can't go wrong with anything on the menu. Can't wait to eat here again!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdDh6VUJnEAE",
            "text": "This was such a fun place! It was my mother's birthday, and our server Maya was very kind helpful. The items on the menu were delicious, and the menu is extremely shareable. The atmosphere was beautiful and our seat had a great view of the street, this was our first time her but we will definitely be coming back!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGa2JTRFRnEAE",
            "text": "We LOVE Ladybird and have been coming here since 2019. Every single item on their menu is delicious, perfectly flavored and seasoned, and the right texture. I like that they have different types of cuisines on the menu so it doesn’t feel limiting. They also have different flavor and texture palettes which adds to the experience.\n\nFood: There were four of us and we got the mushroom toast, buns, Every single entrée was perfect. We somehow still had room for dessert and got\n\nService is always excellent here. Everyone is super friendly and nice. They were even kind enough to bring back the punch bowl drink for us because we requested it.\n\nDrinks: They have a large selection of beverages and have some great bottles of Orange Wine which are hard to find at most places. They also have these great punch bowl cocktails which aren’t on the menu but like I said they will do it upon request.\n\nPrice: For the amount of food we get and the uniqueness of everything I do think LadyBird is reasonably priced and worth it.\n\nInstagram: @TheShahLALand"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsa2FXSC1RRRAB",
            "text": "My husband and I are vegan and we absolutely loved our dinner here! The food was so good, flavorful, and comforting but it still felt healthy.\n\nWe got the mushroom and cauliflower bao buns (highly recommend!), the scalloped potatoes (also so good), the truffle Mac n cheese with mushroom bacon (also amazing) and we had the creme brulee for dessert which was lovely.\n\nThe atmosphere of the restaurant was also so cool and fun. And, the booths and chairs were super comfy.\n\nIf we lived in NYC, we would eat here all the time!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyLTZXZlBREAE",
            "text": "The food is amazing with a great taste. I’m very impressed by the flavors; all the dishes were excellent. The Bao Buns and the potatoes platter were particularly outstanding."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNk5tc09REAE",
            "text": "This restaurant turned out to be a big disappointment as I had booked a table and despite the same we were given the bar seats. The reservation systems definitely need improvement. The food and drinks were average. The overall atmosphere was ok however we wanted to leave as we were disappointed with the table reservations arrangement."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSelp2bi1nRRAB",
            "text": "The hostess was not hospitable, which isn't a good look for the restaurant or vibe. The atmosphere was cool and pink; it was intimate and chill. The food was good - I especially liked the kale caesar salad and the truffle mac and cheese. I don't know if I will return, because I did not feel very welcomed and I wasn't \"wow-ed\" by what I ordered."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1enAyRG1RRRAB",
            "text": "Longtime vegetarian here. For a vegetarian restaurant, this was just fine. But for the cost and reputation, I mean these were pretty simple vegetable dishes and not that exciting or interesting. It is really loud inside in weekends. We sat outside. It was fine. I mean. This was not bad but I guess I was just hoping for something really good. The Brussels sprouts were undercooked. The risotto special needed more flavor. Really this place was just fine and actually nice enough but just not great."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNXRyUFRnEAE",
            "text": "Ladybird is incredible. We ordered 5 dishes and had cocktails/wine and it was all awesome. The eggplant fried in the marinara sauce, the potato au gratin, Buffalo bao, po boy bao, and the aracini were all absolutely fantastic. Very…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPN09XYXBnRRAB",
            "text": "Cool ambience.  Fun and effective service. Inventive vegan dishes. The maitake buns were divine.  Sprouts were good. The chocolate fondue was fun but a little ordinary.  Some good wine selections.  We will definitely go back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlMWRPUVhREAE",
            "text": "As someone researching vegan restaurants to try in NYC this place was hyped up. We went for brunch and sat outside. Very feminine and pretty. Service was ok but nothing spectacular. We had the Sherry Mary (would not order) & Whipped Coffee (was fun and yummy), Egg sandwich (was cold and didn't finish it - and I live for breakfast sandwiches!), Chicken & Waffles (Mushrooms were bland, waffles were good, but again cold), and lastly the brunch potato (Seriously incredible, would return just for them). Overall thoughts were that the menu was laughably overpriced, cold food, lacking service but AMAZING Brunch Potatoes. It seems more of a place for Instagram photos, not dining."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUeE1uWm93RRAB",
            "text": "Have always been a fan of brunch but not so much dinner until now. The new dinner menu is so good! loved ever single dish! highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqN3RHMjlBRRAB",
            "text": "Had a birthday here and it was wonderful! The food is Asian vegan, my favorite was the kale salad that had dressing that tasted like Bjorn Corn. The vibe is very Bridgerton with glass tea cups and pastel colored plates. The music was boppin. The waitstaff was attentive! Had a great time overall."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHOG9uaWdBRRAB",
            "text": "Pretty, fancy, and feminine atmosphere.\nI felt like I was having teatime.\nI ordered a Buffalo Maitake Bun and it was delicious. The bun was perfect texture- not too gooey. And the filling was crispy with a deliciously spiced sauce.\nI shared the Truffle Mac & Cheese and I loved it too. The sauce was creamy and the truffle added dimension to the flavor.\nThe waitstaff was nice and professional and overall a great experience.\nI also have to mention the bathroom is gorgeous (take cute pics)\nand the door for the dinner hours is to the 1st one if you're coming from 1st Avenue."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4b3BXck53EAE",
            "text": "Had a reservation for when the restaurant opened. We were greeted and seated promptly upon arrival.\n\nI’m not veg myself but my partner is and it was great to be able to share dishes with her. The serving size is  generous and very filling. Don’t worry if it’s your first time eating veg food. The food is just as good if not better than it’s meat counterparts considering we left full but not that heavy feeling you get with meat dishes.\n\nFor a first impression, I was very impressed and will definitely be coming back."
        }
    ],
    "reviews_count": 74
}