{
    "name": "Little Poland",
    "place_id": "ChIJsRO_fJ5ZwokRqqVpqIrIKQY",
    "grid": "MN3",
    "address": "200 2nd Ave, New York, NY 10003, USA",
    "rating": 4.4,
    "user_ratings_total": 1135,
    "phone_number": "(212) 777-9728",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toR1JtOW5OMHR2T1d4cE1GQk5ibEF5Um1WUldWRRAB",
            "text": "Service is ok, but I have no idea why it’s rated so high… it tastes just like one of those boiled ready-meal packs you’d get at a Poland highway rest stop."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVFVWVXlORGR0YjNwMmVVTnBaazkxVmxKdk5VRRAB",
            "text": "This restaurant is phenomenal! The food is so tasty! I went there the service was amazing! And it doesn’t take a long time to get your food! Definitely coming back."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkbE4xWnRkWE54UkVGdVJuQlRPVTV3T1ZjdGVHYxAB",
            "text": "The food is great especially the home fries service is great and my food came in a timely manner"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkemNVdFZZa3RFTUVoU2FqaFdUVVZQYVdacFUxRRAB",
            "text": "My dinner at Little Poland hit all the right comfort notes. This place stands above most restaurants. The workers here are courteous and helpful. The serving size supported sharing nicely. Every dish offers taste excellence."
        },
        {
            "date": "3주 전",
            "language": "pl",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xveFJVVkxSbXRTWVU1WE9VdEtYMUJpTkdFMFRVRRAB",
            "text": "Siedziałem przy stoliku z żoną 20-25 min i nic poszedłem do baru zapytałem sie czy mogę zamowic pani kazała czekać czekałem 10 min i wyszedłem"
        },
        {
            "date": "3주 전",
            "language": "pl",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCelJHcHlibTVPVTFaVGFUUllWVmxMY1cxa1FXYxAB",
            "text": "Podziwiam jak można sprzedawać tak zepsute i nijakie Polskie dania. Wręcz jest to obraza dla kuchni Polskiej."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pORlUySnRMWEU0UlhkSkxXVk5WazFQUlRWSVVXYxAB",
            "text": "Defend  service for New York City, but I love the people who work here"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdlRFbGpRVGxmWkVkQlNGbEVjVGwxZUhKYVNVRRAB",
            "text": "Service was good. Blitzes were delicious, but a little too sweet for my taste."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGU1RFb3pNVUV4WkRoUFRrWmZWRWQzZUZNM1ZWRRAB",
            "text": "Classic, amazing and consistent!! Love their pierogis and kasha!! Coffee is solid, service is great! Never change!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FMVVGUXRObmRKWm5ORk1XZHlPR0YzT1doMlVVRRAB",
            "text": "Very authentic neighborhood place to get my favorites like perogies and borscht! I've had delicious lunch and dinner specials. Next time I will check out their breakfast :-)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnek1URXpVRVpoY0U1cGRGZHZVVUZFYldkalQxRRAB",
            "text": "This is a cute, cozy diner in the East Village. I met friends here a few nights ago and had a great time. The Polish food here is delicious and you can also order beer & wine. Would definitely return! :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGRFZVcExTbUY0Y210SWFqazBka1pSWlhWNVVFRRAB",
            "text": "Best chicken soup in Manhattan!"
        },
        {
            "date": "1달 전",
            "language": "pl",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNMlVIWTFTbHB5VDJkalkyNVJkbUZLZWtaa1gzYxAB",
            "text": "Zawiodłem się. Niestety obsługa słaba. Jedzenie przeciętne. Nie podaje się pierogów z kapustą i grzybami ze śmietana! w dodatku pierogi były w suche."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214b2JIQjZhMmR0UTBOaU9FNVhNMlZqTjNodVFsRRAB",
            "text": "Absolutely amazing food and beer. Super easy to order vegetarian and it was all amazing.\nZywiec and split pea soup were 😱 so good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGcWVXMVBVbFprWVVJd1RXWnhjV1ZFU214YWMxRRAB",
            "text": "Simple recipes traditional dishes.\nGreat lunch specials."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkeVpGQmxUWFJuWlUxTGJIazBiMk5tVmxKa1NIYxAB",
            "text": "This restaurant delivers total satisfaction. The location seems mismatched with the quality. Several of their main courses provide satisfactory quality. The employees create welcoming interactions. The place possesses distinctive qualities."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RNU5XRmFka1ZyYUhkSFFqTkRWMk16V1dOTFRWRRAB",
            "text": "Previous diners have described it perfectly. Restaurant personnel maintained impeccable standards throughout. Excellent preparation with unexpected menu items. They maintain happy expressions that customers notice. The complete dining experience here satisfies."
        },
        {
            "date": "2달 전",
            "language": "pl",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMFREUkhkMUpVVjNSMVEzRk9XVTg0Tm5oa2JWRRAB",
            "text": "Gołąbki z Amerykańskim “gravy”?? Co??\nMizeria ledwo w śmietanie i z ogórkami pokrojone dużo za grubo.\nZiemniaki gotowane bez zmaku. Zupełnie. Zresztą sałata żiemniakowa też bez smakowa.\nPierogi w ogóle WSTYD.\nŻurek… słuchajcie. To chyba znowu ten „gravy” ale z jajkiem? Banalne.\n„Schabowy” czy tam „Schnizel” jak na to mówicie? No w miarę ok. Ale też nie pierwsza klasa.\nRosół też jest ok. Chyba najlepsze z tego wszystkiego.\n\nSzkoda bo to jedyna restauracja Polska na Manhattanie. Babcia na 100% nie była by dumna. 👎🏼"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taT2JFSm9PVmN6WTNGalZHOTZSbTlHTFhaTlRXYxAB",
            "text": "Ordered on Seamless and haven’t received food after almost 2 hours. They said would be 43-57 mins. 2 hours is too long when they say under 1 hour. Also no communication. May update about quality of food, this is just about delivery service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSTVdERnRNMWhxVDI5NkxYRmhVRGQwVm1ORFZIYxAB",
            "text": "Despite some negative opinions, I found the food and service excellent. Workers display sincere friendliness and solve all issues. Little Poland is situated in a busy district. The kitchen delivers excellence without high prices. I'm looking forward to returning here!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFNVFuTnNhbk5aUWxCemFFaExZblpSYjBwcVFtYxAB",
            "text": "The meals here showcase skills that few other places can match. The workers were both pleasant and solution-oriented. Our group had a wonderful dining experience. Everything here met the highest standards. I found this place remarkably good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210NE0xVm5TamhJVFVjM016TlBOVWQyYW1SUVRrRRAB",
            "text": "Classic NY restaurant, always kind service and amazing food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21od1IzaEZUMFJUZDB0ZlUyVjJRek5PZDBSUlprRRAB",
            "text": "Great little spot. Nice outdoor seating, inside sort of like a diner effect. Good food, good prices."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tadmVqVjBPRVZJVm1zMVgzbEtTVVptT0ZkNFpIYxAB",
            "text": "This place is an absolute treasure. The food is absolutely incredible. They make the best pierogis I’ve ever had in my life and I’ve tried a lot of pierogis haha. Highly recommend their farmers cheese pierogis with buttered onions. I’ve been ordering that since I was a teenager and it’s exactly the same as it was then (I’m 35 now😭). Absolutely try this place and have your life changed. Also highly recommend it too if you need a hit of coziness with your dinner. The vibes of the place are of a very cozy 1970’s kitchen."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205R1h6aGhibFJWTFdOcGRFOHdOWFZ4TTNSZlRYYxAB",
            "text": "I ordered from Little Poland on Seamless on 8/20. After waiting for 2h for my order I called the restaurant and I got screamed at by some lady saying THEY CANT DELIVER AND I SHOULD ACTUALLY WALK AND PICK MY ORDER !!!! It’s a second time by the way. Do not order from them!! What a joke"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoaU5rSktRbFpKVEUxeFVYbHJVRzVuWTFCT1IwRRAB",
            "text": "Lovely low key Eastern European diner. Pleasant and homey environment. Staff is respectful and always there for you."
        },
        {
            "date": "2달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FMU1EUlJXVkpsUW1sRE5GQkVXakp4Y1dzMGJYYxAB",
            "text": "Um dinner muito acolhedor com um serviço muito amável. Porções gigantescas. A panqueca com blueberries estava ótima."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205VWMyMUtlbFZaWmxKVE4ySnlaRkpvWVdsNmRrRRAB",
            "text": "Actually I am not a fan of the bulky, heavy chairs in the outdoor seating area, but they may have had their reasons. The menu in the typical Eastern European East Village kind, one of the few remaining here. Yeah prices are up like everywhere. Decent service. Glad this place survived for so long. You can sit outside, at the bar, in a booth for 4 people, or at the bigger tables at the window. It's a taste of home for some of us."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNE5XZDFkMTlZUTNsYVltZGtRMHROUm04d2EyYxAB",
            "text": "Reminds me of home style cooking. I prefer a saucier beef stroganoff but the meat was tender and I enjoyed my meal. Will be back!"
        },
        {
            "date": "2달 전",
            "language": "pl",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWMVJDMWFja05EVUdZelNsaGplSEZDUXpOU1VYYxAB",
            "text": "przyjechalismy do NYC na tydzień. nocleg 32st/5ave. pierwszy dzień jedzenie we włoskiej pizzerii. nie było złe ale młoda zatęskniła za polską kuchnią. poszliśmy do Little Ooland. Było przepysznie. Zamówiłem schaba w panierce dla młodej i dla żony a flaki dla mnie+ żywiec:):). słyszałem jak ubijali schaba, czyli dowód, że poza smakiem na prawdę wszystko robione na świeżo.  kotlety ogromne ale młoda dała radę:), znaczy, że smaczne. flaki idealne. obsługa uśmiechnięta. za 3 osoby w tym 2 piwa 82 dolary + tip razem 95.\nsuper"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkbmNXTnlRa0V6VG1OdU1FeHdVSHBDZVRaclEwRRAB",
            "text": "Lovely restaurant with very friendly staff, absolutely recommend and plan to return"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVNU4wOVJPRlJHWkZSRFdFeEtiVXhoT1VodVZuYxAB",
            "text": "Amazing atmosphere and amazing food, the special pierogis are a MUST!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWeVdGSnFUbm94U1dsQk5FZzNOME00Vlc1b2RrRRAB",
            "text": "White borscht and pierogies were great!  Lovely place with authentic food."
        },
        {
            "date": "3달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JeFNEVnRaRGhWTWtWeU1GZHVYMTlLUlhWa1ZVRRAB",
            "text": "Absolutnie cudowna obsługa, przepyszne Polskie jedzenie i bardzo przystępne ceny."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGTFYzRkJORmh4YlVJelgxOXRWVGxCUW5oVGVrRRAB",
            "text": "Went for the lunch special - soup and a main. Soups were well-seasoned and tasty. Pierogi were pretty much how I remember Babcia making them. Washed down with piwo. Happy days."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205MFlsbDBjWGhyZVdWcFdYWXRXRlJET0RZeWNHYxAB",
            "text": "Very good"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSOHRhVVhnEAE",
            "text": "A classic small diner/restaurant with wonderfully tasty and well prepared Slavic menu items. I enjoyed a platter with kielbasa, stuffed cabbage, and pierogi."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aSlJVNUdYMVZ0UVdNeUxWaGZjRzE0VlhGa0xXYxAB",
            "text": "I came in with my notebook and pencil, hoping to do some work as I eat alone. It was THE perfect spot—clean, chill, and homey! The food of course is rustic and comforting, a break from the spendid and aromatic dishes of upscale nyc food scene. Next time, when I’m tired and just want to load up on carb, I will come back!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWVZURndhRk00WTBzMlIyaFpUa3N6V1dGcmEzYxAB",
            "text": "Really very nice and good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kbE5TMXVTV2REVGtaMVIwZ3pZWGhPWTB4SWMzYxAB",
            "text": "The food was undercooked and disgusting, when I complained, the waitress admitted to me that all the food comes from a supplier, and nothing is homemade. You’re basically cooking frozen food and serving it to your customers. This place is filthy and complete garbage.  Don’t expect this food to be anything like it was 20 years ago.  It’s extremely overpriced and now I see why this place is always empty. I don’t expect it to be around much longer.  What a shame, it used be a jewel in the East Village.\nNow it’s more like Kitchen Nightmares.  Eat at your own risk… 🤢"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zeFNVSnlhR2d5TWtKU1ptc3pNbk5NYVRKZmFHYxAB",
            "text": "Great service and dessert"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kRVpHaFdSbE4wWmxkNU16TXhVRTlIUjJSb2VWRRAB",
            "text": "Nice store with pretty good food and large portions"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVmQyeEdjR05CTW5Gb2N6QjBRblp2TldkalNFRRAB",
            "text": "Great food, great service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbVZGcGpOblpWT0RKNVZtNTNNSEZTZFZaMVZrRRAB",
            "text": "So good, genuine Polish food. Breaded pork chops and cucumber soup. Hmmm. Feels like home."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KcU1EWlJWbkU0TkRnemRUTnlMVGRaVUdKM1ZFRRAB",
            "text": "The meal I had ranks among the best I've ever eaten. Workers willingly adjusted to our needs and gave great care. The flavors combine perfectly. They maintain quality from what you taste to what you experience. This place has a strategic position and we'll be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRFNYYzVSWFJwVFhaemJWSlNVMjAzYUZWeU1HYxAB",
            "text": "Food was fantastic! A great Polish experience; would recommend especially because how often do you get to eat Polish cuisine? They have a combination platter that lets you experience a variety of options, totally worth getting. It's a hearty meal, so strap on the feed bag."
        },
        {
            "date": "4달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKbU4wOVRnLXJxNUpREAE",
            "text": "Przepyszne jedzenie ! Przemiła obsługa  ❤️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPR3V3Wi1YLUwyVE5nEAE",
            "text": "Amaizing food, nice people, definitely recommend 😁❤️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2todFREWmxiVE5tZEd0TldIcExSWGRCT0VOS1JWRRAB",
            "text": "Best Polish restaurant in Manhattan!\n\nLittle Poland reminds me of the longstanding family owned Polish deli’s and restaurants in Chicago & surrounding suburbs I grew up with.  The food here is authentic and highly representative of home cooking in such a commercialized time and space.\n\nAs a local resident of the East Village I’ve have found Little Poland to be one of the few true remaining symbols of our community’s past, too often overshadowed by the growth of our city and visions of the future.\n\nWhen life starts moving too fast, or you just need something to fill that empty space in your life or stomach, Pierogies are the answer!  Or anything else for that matter, vegetarian options included.  I’ve yet to try anything on the menu that didn’t fulfill me body & soul the way real Polish home cooking has a way of doing 🇵🇱"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKcXBscHlRdXVXM1lBEAE",
            "text": "An East Village institution. Good food, friendly service, comfy place."
        },
        {
            "date": "11달 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdnNTYzVRRRAB",
            "text": "폴란드에서는 살수없는 나..\n소세지는 진짜꿀맛"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZZ28zZHVRRRAB",
            "text": "Little Poland is probably the place my husband and I visit most often. It feels very homey and reminds me of the food my mom and grandma used to make. The staff is very sweet—sometimes you might have to wait a bit for service, but they’re always friendly and welcoming. It’s such a nice feeling when they start to recognize you, greet you warmly, and make small talk.\n\nIn my opinion, Little Poland has the best borscht in Manhattan out of all the places I’ve tried. The food here is truly authentic and really captures the spirit of traditional Eastern European cooking. Everything is good quality, and it’s one of the few places in the city where you can get a tasty, hearty meal for a reasonable price. The lunch specials are especially great."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmX2FTWEN3EAE",
            "text": "Little Poland in Manhattan is a gem for comforting, authentic East Europe cuisine. The fliachki and goulash were absolutely delicious—rich, flavorful, and perfectly seasoned, transporting me straight to a cozy Polish kitchen. The portions were generous, and the food felt like it was made with care. The service was friendly and attentive, though the wait time for food was a bit longer than expected. Overall, a fantastic spot for hearty, home-style meals. I’ll definitely be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRM1Blb01REAE",
            "text": "Great selection of traditional dishes. The sound are probably best I've tried in the NYC metro. The potatoes pancakes are phenomenal. This establishment is worth the visit if you're in NYC and you are looking for a home style meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaTR1M3RRRRAB",
            "text": "Absolutely fantastic and authentic polish restaurant. I will be dreaming of the polish platter (specifically the sweet potato pancakes) for the rest of my life! My sister got goulash and the meat was so soft and delicious. We never have had kompot before, and tried it. It tastes fruity, worth a try. For dessert we had the chocolate cake. It was good, but then we saw what the apple cake looked like and wish we had gotten that instead or in addition!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBa0piR25BRRAB",
            "text": "Good polish food with a pretty large selection of items like pierogi , blintzes, sausages etc. all at decent prices. If you like polish/ Eastern European food which it is definitely worth a visit. They have a nice ambience, friendly staff and a good set of fresh pastries.\n\nI got fried polish Kielbasy sausage with kasha and gravy and it was good."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNWFxNVZ3EAE",
            "text": "Extremely satisfying restaurant especially knowing the signature dishes that Poland has to offer being that we eat traditional dishes quite often.\nWe were very impressed and happy thank you"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWOUk2RWhnRRAB",
            "text": "We were just tourists in NYC at the time but we walked an hour to get to this place in the cold of late November and let me tell you, it was definitely worth it! The food was fantastic and they provide a wholesome environment. I only wish the service could've been more consistent. My wife is polish and we agreed this was a very authentic experience. Highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNGR6Y1NBEAE",
            "text": "Great traditional food from Eastern Europe. Well served. Service was amazing and price is cheap for the quality. I will definitely go back in my next visit to NY."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKZ3ItaHV3RRAB",
            "text": "Perfect quick breakfast. Reasonable priced. We got the breakfast special, two eggs, bacon and potatoes. The coffee was especially good and free refills is always a good look. Two small orange juice shots on the house makes your morning better right away too. I do recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIOW83ZFZnEAE",
            "text": "Just wow. My meal at little Poland was one of the best I've ever had. The place felt very authentic like the food was being cooked by my own babcia. I got the combination platter and the portion was huge. I cant recommend this place enough!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtZ19YWjVRRRAB",
            "text": "This is a great local restaurant. The servers are friendly and the atmosphere is very laid back. The staff is small so you'll need to have patience with them as they are cleaning, taking orders, etc. You don't havs to rush to finish your plates; you can sit and have extended conversations. It's nice to be able to take your time and eat and talk. Now the food was flavorful but not salty and the portions were very generous. Apparently everything is made on the premises. It tastes like home cooked food. I'll definitely visit again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYeDdhbW9BRRAB",
            "text": "Huge size of dining! The traditional Poland dumplings made me a special experience. You would find there's old-time coin public telephone on the restaurant's wall."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIb3VxaHlnRRAB",
            "text": "Food was so delicious and the wait wasn't long at all. I ordered the Swedish Meatballs which came with two sides; the two sides i ordered was the cucumber salad with dill & mashed potatoes w/ mushroom gravy. I also ordered 4 fried Potato Pierogi. Everything was delicious. The Swedish meatballs were covered in bechamel sauce that was to die for. I actually used both the mushroom gravy and becamel sauce on my pierogi, so good! Coming again."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRNG91MWRBEAE",
            "text": "Just as delicious as my first time!\n\nFood 8/10\nService 10/10\nCleanliness 10/10\n\nOne of my fave little spots in the East Village\n\n*I have tripe all the time, cooked all different ways (Italian, Chinese, Spanish, Korean). This one was one of the best. It was melty, smooth, and perfectly tender. The broth was delicate and didn’t over power the flavor of the tripe."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzaFlyVnJnRRAB",
            "text": "The staff were dismissive, bordering on rude. Food was disappointing! Who deep fries pierogi, certainly not in Poland. Staff spoke Polish among themselves so I can’t understand why they would serve up food that is so wrong. They weren’t busy with customers (only three others besides us) so it’s not like they were run off their feet and couldn’t at least acknowledge their customer and offer a smile. The pierogi fillings were bland. Very dissatisfying experience."
        },
        {
            "date": "9달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNXA3R3BRRRAB",
            "text": "Très bonne cuisine polonaise ! La tasse de soupe est petite, mais les pierogis sont énormes et délicieux !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkNnZQdkhBEAE",
            "text": "Great food. This place hasn't changed in 30 years. If you're visiting NYC be prepared for a different idea of wait service. I will absolutely go every time I am in the city. We spent more than usual because we had the spendier \"combo plates\" but you can definitely go cheaper and still have a humongous meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNicXBTX25RRRAB",
            "text": "Love the homey vibes! Soups were amazing and fried pierogis had much better texture than boiled, though both were relatively lacking in flavor. Will be back to try other dishes!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoaUt5TWxnRRAB",
            "text": "The food was out of this world! I absolutely loved the food. However, expect long waits to get your order taken and to get your bill. You also might want to expect your order to be missing stuff."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtMWRHVUpREAE",
            "text": "They give you orange juice in the cutest glass ever! Love the ambiance of chill. I’ve gone there to work late or early morning and grab some eggs and sausage. Country potatoes were fantastic!!"
        },
        {
            "date": "1년 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNucE1TaGtBRRAB",
            "text": "物美价廉 菜码很大。饺子不错。特色饮料类似水果罐头，值得一试。"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrMWRYU0tBEAE",
            "text": "If your in the East Village this is a must try.  The staff is incredible and food is out of this world.  The prices were not that bad considering the food is all made in house.  The tripe soup was unbelievable, while not for everyone I…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqaEx5TlJnEAE",
            "text": "If I could give a 4.5, I would. Wonderful food - there are surprisingly few places in the city for Polish, and this is one of the best. The service was inconsistent - water not really promptly refilled, for example. The atmosphere was homey, and the food was hearty."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlamZiR0xBEAE",
            "text": "Best restaurant Polish food I've had... get the combo platter. Loved the cabbage rolls and nalishniki (blintz). Went home with a bag of pierogies. Cute basic diner atmosphere. Sweet staff. Love ❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4M1lITmF3EAE",
            "text": "I was a little hesitant to go as I'm not typically a fan of Polish food but it was delicious! The waitresses are nonstop but still give perfect customer service. This was the best chicken soup I’ve ever had. My mom loved their meat pierogis and matzo-ball soup. Only thing, the hallah was dry (I’m pretty sure it just needs more egg yolks). Definitely coming back next time I’m in the area."
        }
    ],
    "reviews_count": 76
}