{
    "name": "Lavagna",
    "place_id": "ChIJOdk8c3hZwokR19MTxlKq4Ek",
    "grid": "MN3",
    "address": "545 E 5th St, New York, NY 10009, USA",
    "rating": 4.5,
    "user_ratings_total": 442,
    "phone_number": "(212) 979-1005",
    "reviews": [
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKamJzTjJqcFBHTnp3RRAB",
            "text": "Came here once cuz we're in the area. Had been back, and back, I'm back. Back. Food is amazing, the people there are super warm and friendly"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsS2FHMHhRbUZyWkdkbU1HOWFTSEk0VFRoME5YYxAB",
            "text": "the cutest cosy spot, perfect for date night or dinner with the girls, and the staff are so lovely!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVlVuSmhha1pqVlVoSWIxSmpRelJaTjA5aVQwRRAB",
            "text": "Rigatoni is AMAZING. And love the focaccia they serve from a local bakery. Such a cute, homey, neighborhood spot. The staff is really friendly and kind as well."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCZ08tRXhBRRAB",
            "text": "Update:  Wife and I, and 2 kids, and 4 friends, have all come, and will keep coming!\n\nQuite possibly the best Italian food we've had in NYC - and yes, I know that is a bold statement.\n\nI've lived in NYC for ~15 years, and when it comes to Italian dishes such as wood-fired pizza, pappardelle, mussels in tomato broth, or bolognese - this is the best I've had in the city.\n\nMaking matters better, their staff is amazing - attentive and friendly, and experts in crafting an amazing meal.  Roy, Ben, Yagosh (sp?), Maxine (sp?), and the rest of the staff made our meals so delightful, my wife and I came 3 times in one week.\n\nHighly recommend, will definitely return, and are probably eating there right now."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWmJWSlpPVWRJVUZGM2IyaHdZVUptVFROcGVYYxAB",
            "text": "Great little Italian - strong on seafood, excellent food and service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOTkxUYzFZV2M1ZFcxV1IwOVphRWMwUlhkU1lrRRAB",
            "text": "a great neighborhood spot. the food was just what i was looking for as i was passing through town. sat at the bar and ruby was spectacular!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ReFJERTBSMkprWDNjME9IVkpabk42YzJzMWFuYxAB",
            "text": "Best local spot, lovely service, good wine and a solid pasta offering. Ask for cacio pepe off menu."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JdFVrbEhlVk15UTJwbVZXeGtURTlzTW1GMU5VRRAB",
            "text": "Bustling spot, shared artichoke and scallop apps and had pork chop and salmon entrees. Service gracious despite restaurant packed. It’s very loud - bring ear plugs lol"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGdFNGaFlUbGxpZEZoVFJFSklMV0ZWVmt4TWFYYxAB",
            "text": "Our favorite Italian in the East village. Small do make a reservation. Very nice but smallish menu. Never had other than a fine dinner here. Lovely and helpful staff."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkMk1uSnNja1p1VlRsNFN6aE5OVlJTU2s5TWNFRRAB",
            "text": "Had excellent romantic anniversary dinner for two where we have occasionally dined in the past. Was a perfect choice for us in all respects: eats, service, and ambience!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKTFpHMUdkRXQ1ZUhkV2N6UXdWbTFFVFhrNFlWRRAB",
            "text": "A hidden family-run italian restaurant. A lovely date night spot or for a long overdue catch up over wine. Always skeptical about italian restaurants, but the food was extremely flavourful. Had the arrabbiata spaghetti, usually not a fan, but SO good. Lovely wine pairing as well. The artichoke and bean puree started was divine"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMeU44WkNBdC1DUGpBRRAB",
            "text": "This place is the best. Been eating here for nearly a decade. Amazing food, great staff and lovely neighborhood ambiance."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJaUpsNzJEOXVtaDZRRRAB",
            "text": "Absolutely a Gem! One of my secret favorite places to go. Typically I would go alone enjoy a three course meal some wine and head home super relaxed and at peace! This place is such a classy soulful place! Cozy; the food is always beyond my expectations! Always looking forward to sharing this place with truly special people. Definitely a memorable romantic date kind of place. Where you go for your anniversary. It’s really that special!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPdU41Sl9hZ2Nfa013EAE",
            "text": "Beautiful atmosphere and food. They packed people into a tiny space. The ohotos tell the story"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VMUDZrWnlqcHJ5OXRnRRAB",
            "text": "Really mediocre. Not bad, just reeaaally mediocre."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMXFhXzFnRRAB",
            "text": "Super ambience"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcmYzc2VREAE",
            "text": "The awning is dirty and the place is overall not a vibe."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvc1BMTF9nRRAB",
            "text": "Wonderful dining experience. Food, service, atmosphere all fabulous. Awesome to meet the owner working hard at the front of house. Look forward to returning during another trip to NY."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbGJXaDl3RRAB",
            "text": "Suuuuch a gem, me and my group of friends had the best time. So cozy and the food was so good. I wish I got our waiter’s name because he was amazing as well. Food, service, atmosphere 1000/10"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3amV1cTlRRRAB",
            "text": "Lavagna was a spot my wife and I went to for a date night and legit we just keep going back. Their staff are friendly and personable. They make you feel like you’re at a family friend’s house for Italian dinner. Very cozy and the food is 🔥🔥🔥🔥. They know their wines too! 10/10 would recommend."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3LWZESnBnRRAB",
            "text": "As an Asian American, it tastes like it is 1950 and I was invited over by my Italian friend for dinner and his grandma is cooking a classic Italian American home cooked meal for me.  Peas and sausage bits in the rigatoni vodka is just one example of this - I ask, but grandma, why peas?  To which she responds - \"it's good for your health\" and suddenly the world makes sense again. Very nostalgic, soul warming and delicious food.  Also distinctly better than the majority of other Italian restaurants I've had all over NYC."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3eE83QmVBEAE",
            "text": "I’m a loyal lavagna fan!!! When I walk in I can’t wait to see what Executive Chef Enrico has on the specials board & I don’t even have to look at the menu ! Loyd then pairs it perfectly with a glass of wine!\nThe oysters are always fresh & delicious!!!! One of favorite ways to start….. & just to start bc then comes all the best flavors!\nTrue Italian at its best with quality ingredients & passion behind each dish!\nSuffern couldn’t be luckier to have this special spot!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNReS1TNnV3RRAB",
            "text": "Went on Valentine’s Day and there was a prix fixe. We didn’t know this on the booking and we went for pasta but unfortunately couldn’t try. The food was okay but not particularly good. The service was great though and everyone was friendly. The rose was also a surprise! I heard the pastas their specialty though so maybe I’ll try that next time!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnXzZySkpBEAE",
            "text": "My favorite restaurant in NYC. Affordable for a meal out and their pastas and pizzas are just wonderful."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnLS1PWHJ3RRAB",
            "text": "We had a wonderful experience here. The prosciutto was terrific. Our server, forgot his name, was very pleasant and welcoming. The ambience was warm and cozy. Definitely a great time overall."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncV8zaVJREAE",
            "text": "One of my all time favorite restaurants. I’ve been coming here for almost 20 years. Very warm atmosphere and outstanding food- my go to is the rigatoni with a side of broccoli raab. I suggest going a little later in the evening (they serve pretty late) if you don’t want it noisy or are looking for a romantic date night."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOE9yNzVRRRAB",
            "text": "I order their rigatoni on DoorDash and it never fails. 10/10"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfeDQzdHpRRRAB",
            "text": "I can't stop thinking about the rigatoni!! So delicious and great service. Can't wait to come eat here again."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmdnZtWHBnRRAB",
            "text": "Out of this world amazing food and ambience. Very friendly and welcoming atmosphere."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNjlISTN3RRAB",
            "text": "Came here for NYE dinner. We had the focaccia and Caesar salad to start, then the rigatoni, pappardelle, and lamb shank. Everything was great! Unpretentious, old school vibes. Ruby gave us terrific service."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2eExQMmxnRRAB",
            "text": "For years I loved this place despite the grumpy old server who would always greet us at the door. Last week I went for a special dinner with a relative of mine. That server couldn’t have been any nastier to my guest. Their food is not worth the bitter taste of interacting with that person. The restaurant is also very(!) noisy so expect yelling to have a proper conversation.\n\nI wouldn’t recommend this place."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bS11VFlnEAE",
            "text": "Had a great early dinner last night, prosciutto and figs for appetizer, kale Caesar salad, their homemade pasta, and salmon for main course, and a good bottle of wine. Everything was outstanding, including the service by uncle Rob. Highly recommend this for an Italian dinner out in the East Village."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQcUxUQUF3EAE",
            "text": "One of the highly recommended restaurants from my friend living in NYC. All the meals were miraculously delicious, to which wines were perfectly matched!! Definitely coming back!! Thank you the owner so much!!!"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBXzVIVFBnEAE",
            "text": "My actual favorite restaurant in Manhattan. Romantic, cozy, vibey and alive - the top tier of dining in the world while amidst a real part of New York. Not possible to leave without a great sense of satisfaction and satiation. Get in."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzM2VxVWxnRRAB",
            "text": "Great food and great service."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzelpuUVN3EAE",
            "text": "Average food, waaay below average owner attitude. Other staff very friendly."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzZ1BfZ0JREAE",
            "text": "Our favorite italian spot in the city. The Rigatoni is my favorite dish. Been coming here for 5+ years"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuX29mcENnEAE",
            "text": "It is one of my favorite Italian restaurants in NYC"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIMUpXR0ZnEAE",
            "text": "Rarely rate anything 5*s and feel like to restaurants in NYC are overrated. But this super low key place exceeded all expectations. Our waitress was genuine in her recommendations which we loved. Scallops, salad and octopus carpaccio apps were well seasoned and fresh. Pasta we tried 2 (ragu & tomato) in half portions which was  perfect to try both. Panna cotta is light and great end to meal. Will def come back to try pizza and other mains like lamb."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURydl9YT3J3RRAB",
            "text": "Such a lovely dining experience yesterday at this restaurant. The staff is incredibly friendly. Absolute dynamite manager. Took care of us. Great time. Can’t recommend enough. The LES can be hit or miss. And this is a hit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMZ18tZVFREAE",
            "text": "This place has been here for a long time, and it's one of those real neighborhood spots that are so hard to find these days. Simple Italian food, well-prepared, friendly service, *actual* street dining (not in one of those COVID-era rat hotels). Food is always good to great. Wish it were in my neighborhood, and glad it's still going strong."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMdllfbENREAE",
            "text": "We had a late member of the party and needed to get out in under an hour for a show- not the ideal dining guests but the staff were very kind in accommodating us. The mussels and pastas were all delicious but the focaccia was one of the best I've ever had. And it was a cute space. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMN2FUeGhBRRAB",
            "text": "The service was exceptional and the food was Devine.   So glad this place was recommended to me.  I will be back the next time I am in NYC"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMeDh2RTRnRRAB",
            "text": "Seriously a great neighborhood joint! Delicious Italian... incredible service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6a3FQdHh3RRAB",
            "text": "Delicious Italian food and staff!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6aW9MbERnEAE",
            "text": "Really lovely place with tasty food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUNTUyWjdBRRAB",
            "text": "Ate here several years ago and the food was quite good. Not as good this time.\nArtichoke appetizer was bland, the pasta with rustic tomato sauce was nothing to write home about.\nFor the price that New Yorkers now pay for eating out, we don’t think it unreasonable for the meal to be better than meh."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUaTdUQXBBRRAB",
            "text": "Absolutely love this place. My husband and I got the spinach ravioli with creamy porcini sauce and the pork chop; and they were both delicious. (The pork chop was super juicy and flavorful.) The service was also great! Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMTh5bDlRRRAB",
            "text": "Favorite Italian restaurant ever. EVER."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREc3F2U3BRRRAB",
            "text": "1- Food = Average . 3/5. Nothing memorable about our 3 appetizers. My Main was delicious which was Rigatoni.  Pizza was unusually small and not the best tasting. Red sauce was average. Martinis were small and 3/4 full probably because she spilled each one she delivered.\n2- Service = Below average  2.5/5   Shout out to the kitchen for managing a very busy dining room pacing the courses perfectly. We don’t like being told that we must order all appetizers and meals all at once especially with an attitude. It’s an immediate turnoff. We’re friendly and expect the same in return.\n3- Ambiance = Average 3/5.   Very tightly packed tables in one Main dining area. Not the cleanest and needs a bit of updating.\n4- Reservations = Excellent 5/5. Open table.\n5- Value = Average 3/5. Manhatten has much better options."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4MVpHaFpREAE",
            "text": "Lavagna is a quaint, hidden gem in the East Village!  We were there on Saturday night with 21 people for a large family celebration for my Mom's 80th birthday. The food, wine, service, ambiance, and value were all exceptional. The food was so delicious and at prices that I was blown away by. I regularly frequent some of NYC's finest restaurants, so have a pretty good benchmark. Our server Rob handled our large party with grace, skill, and great humor. Owner Yorgos is a first-class restauranteur and a great guy. Everyone in our group was incredibly impressed and had the best time. I could not recommend Lavagna more highly!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlNTYzdFNnEAE",
            "text": "Awesome food. Awesome experience. There is not much to say other that this place is awesome! The pasta with lamb and pork ragu tasted sooo good. And great wine too! We had more than one bottle of an Italian red wine which was nothing short of extraordinary"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLN0kyWXZ3RRAB",
            "text": "This place is an absolute gem! On a quiet peaceful side street, the indoor space is just beautiful, and outdoors is well spaced, separated by plants creating a cozy atmosphere.\n\nThe FOOD is so good! We had the pasta rigatoni and pork chop and they were both cooked absolutely perfect. Pasta was cooked just right with creamy tomato sauce, sweet peas and fennel sausage yummy. The pork chop was huge served with spinach beans and bacon.\n\nAnd the Service was so friendly, attention was great. They brought out to dog bowls for the pups and kept filling it up with ice water since apparently they were very thirsty.\n\nGreat attention to detail, service, food, just everything. Will definitely be coming back again regularly"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMWZ2SnpBRRAB",
            "text": "For us, it's the best Italian restaurant in NY, and probably the best one globally. We first ate here years ago, during a visit to NY, and loved it so much that we returned the following day. We had dinner there this week, during a visit to the city, and the magic remained just the same. Simple, but super tasty food, creative but not presumptios, a great and friendly team, led by the owner, Jorgos (Greek name, that I'm probably misspelling). Don't skip this place!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4ajkyaURREAE",
            "text": "Very tasty Fedelini Fini which was a fine pasta that’s a little like Angel hair. A basic but delicious and well balanced sauce with garlic and fresh basil. Very satisfying. Fresh baked focaccia served with olive oil and balsamic vinegar.…"
        },
        {
            "date": "6년 전",
            "language": "it",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvNUxHS1RREAE",
            "text": "Locale piuttosto piccolo ma abbastanza accogliente, come spessissimo capita all’estero (e a New York anche peggio) di italiano ha ben poco, a partire dai piatti ma anche delle materie prime; basti pensare che servono come Parmigiano un…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEb2FUTk5nEAE",
            "text": "Lavagna is a cute Italian spot in the East Village! Perfect for a dinner with friends or family.\n\nMy party got a variety of dishes, including the rigatoni, ravioli, margherita & bosco pizza, and the pollock entree.\n\nWhile they have great (large) portion sizes compared to other Italian restaurants in the area, I thought the food was okay. They have a decent wine selection & a relatively full bar, so you should generally be able to get your drink of choice!\n\nThe service staff was lovely, and the atmosphere was great. A bustling energy, perhaps a bit cramped, but cute nonetheless."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNaXB2UUZ3EAE",
            "text": "This has to be THE BEST Italian food I have tasted inside the city thus far. I believe I may have even met the owner, if he was just a manager then he need a raise. My party of 12 was very well taken care of. The wine never stopped flowing…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJeU5qWmJ3EAE",
            "text": "So enjoyed our meal at Lavagna! We made a reservation for two but changed to four the day of and they were very accommodating despite how intimate the restaurant is. Absolutely one of the most delicious meals followed by an even better…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLN1pETXRRRRAB",
            "text": "This is a gem that was definitely unknown to me but I'm happy to have found it. There is outdoor and indoor dining, the service is great and the food was amazing. They have dishes I haven't seen elsewhere which draws me in. I'll be returning soon!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXanJUU1JBEAE",
            "text": "Warm and cozy restaurant with attentive staff.  Food was delicious.  Pappardelle with braised rabbit ... Homemade Spinach ravioli & Ricotta ... Dessert was an apple filled pastry with butterscotch and vanilla ice cream. Will definitely be dining again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoMl9Pc3hnRRAB",
            "text": "Excellent food and wine. The octopus carpaccio, rabbit papardelle, and lamb were delicious."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoejREdWR3EAE",
            "text": "Beautiful environment, amazing food and service. My favorite Italian Restaurant in nyc!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyMFBXNXl3RRAB",
            "text": "Friendly staff, homey pub feeling, amazing food\n\nGood prices for homemade ingredients"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyOV9DQ3hBRRAB",
            "text": "Amazing! Service, food, drinks, ambiance were all amazing.  Everyone loved their food, and they have gluten free pasta! Great wine list . They know Italy here, I'm pretty sure they are all from Italy. The people who work here are AMAZING! The owner is 100% committed to making sure everyone has an exceptional experience.  The bartender is top notch and so kind. I cannot recommend this place enough! Go!  You won't be disappointed!"
        }
    ],
    "reviews_count": 65
}