{
    "name": "Little Myanmar",
    "place_id": "ChIJpT0hlqtZwokRYQqPEQPFhBo",
    "grid": "MN3",
    "address": "150 E 2nd St, New York, NY 10009, USA",
    "rating": 4.1,
    "user_ratings_total": 294,
    "phone_number": "(917) 475-1183",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSSVVWbFRNbUZsTVhwVmNYcEVWRkZzZFZkYWRIYxAB",
            "text": "The atmosphere here is something I crave daily. Charges more than competitors, though environment is superior. Their cooking went beyond what I expected. The workers have known my name since my first visit and maintain impressive attention to detail. I'd dine here again and recommend it to others."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OcmEzRmxWVGxhVmxoYWRuWTRPVmh5UWw5UWVrRRAB",
            "text": "This place calls for quick action. The dishes show culinary understanding. The staff demonstrate excellent guest attention. The food reflects expertise, the drinks show knowledge and the decor shows taste. You receive complete worth for payment."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkQlp6TnZjbTQwZERCT1QwUkdRMU5CUW5SblZHYxAB",
            "text": "Their meals demonstrate cooking expertise. Servers respond appropriately. Costs reflect worth. I can't express fully how much I appreciate Little Myanmar. Every item delivered sensory satisfaction. The employees greeted everyone with sincere smiles. This place exceeded all expectations!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210MWFIbHVRamRmUmpaMVJVaEJNa3hOYkZOa1oxRRAB",
            "text": "We had a terrible experience here tonight. I’ve been to Little Myanmar a handful of times, but this visit is definitely our last. We came the night before and were turned away an hour and half before store closing. I gave them benefit of the doubt, and came back next day much earlier. I put my name down and waitress told me 45 min wait and she’ll call me as all tables were currently taken. 45 min passed, and I went inside to check how much longer. If they told me another 15-30min that would’ve been acceptable. However, another waitress told me she had no idea of the waitlist and it would be another hour on top of the initial 45 min. When asked to speak the original person we talked to, she said she couldn’t do anything because other people have reservations. What is the point of a walk in/write name down on paper reservation then? Had they had told me it would be 1.75 hour wait, I would’ve decided to go elsewhere before wasting 45 minutes. Another thing to note: we noticed the workers would “hide” behind the curtain and are rarely around if you have questions."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sck1EQkRaVmx3TVdOQ1dWTkRObnBaY1UxV09HYxAB",
            "text": "We’ve frequented this restaurant over the last few years but no longer. Their service is absolutely unacceptable. They frequently hide behind their curtain and ignore tables for 30+ minutes at a time leaving you unable to leave and pay. They have started to refuse access to their restroom for patrons, and given the amount of tables this is borderline illegal. Tonight their level of service was unredeemable. We stopped by last night for a quick bite only to find them refusing service an hour and a half before they closed. Tonight we were in the area and they put us on the wait list and told us “45 minute wait”. Upon returning (45 minutes later) they didn’t even know there was a waiting list and told us “to return in another hour” which would have been after the kitchen already closed for the night. When we asked for the manager they said there was no manager or person in charge, so they all went to the back and the same girl came back to the front and said “I’m the manager” and tried to gas light us that this is normal and there’s no reason to complain."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xbVIzQlliV3N0WDB4MU9IRjVlakoyT0VKRldIYxAB",
            "text": "Our introduction to Burmese cuisine was not a disappointment. This is a hole in the wall place. Don't let it dissuade you. We had Tea leaf salad( which had a refreshing flavor with right amount of crunch), Burmese pancake (similar to dosa: same but different), Burmese prawns curry (it captured the flavor of prawns so well ) and tamarind juice (reminded of tamarindo, but unique in it's own way). We were amazed as to how food and flavors have similar echo around the world while maintaining it's own uniqueness. Totally recommend.\nKeep in mind, it's a cash only place."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKazczNXNBRRAB",
            "text": "Wonderful experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1MWNURlNXbEpTTVdkaldsVkdSSEl5VG05MlRtYxAB",
            "text": "The paratha and nan gyi thoke are great. They run out of things too quickly though. Cash only"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjNVRqWjRlWEJCT0Y5R1UycEZkbkpOZUhKVGJrRRAB",
            "text": "I recommend this restaurant to everyone now. This restaurant's interior deserves praise. The team showed competence while maintaining warmth. This restaurant pairs delicious dishes with excellent personnel. The place shows professionalism."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxcWNsQlFOVkZUWm5aNVgyUkVNVnBzUTNCdk5IYxAB",
            "text": "Waitress got our order wrong / long waits / was severely confused / couldn’t even get the Zelle transaction right / overpriced / gave a HUGE plate of rice for what little there was. Severely let down by this experience when I was looking forward to it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxcmJ6aG5iMk5PVkVoWWNGaEthWEZZVGxOaFFtYxAB",
            "text": "Hole in the wall spot but one of the best lunch spots in the area. Perfectly spiced and balanced dishes. Noodles always cooked to perfection."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taSVptbHpOMFJqWW1KaVdqWk9RbkJ0TlV3dE1GRRAB",
            "text": "I used to enjoy this place because of their tea salad which is delicious, but the beef curry is very hard to eat and stringy. We ordered coffee and was given hot milk tea instead which didn’t taste right. The staff though are frienly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taV1puTmtWMFpUZVVoR1JUaFZTMUpOY0hGSlFYYxAB",
            "text": "Delicious food and kind service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RMFJGVm5OMGxhYTNWUlVISnhiMDg0YTNkSmRFRRAB",
            "text": "August 31st, 2025\n\nThis was perhaps our seventh or eighth visit, and sadly, it was the first time we left disheartened.\n\nFrom the outset, there was a shift in atmosphere—most notably a new and rather puzzling policy that barred us from using the restroom, something we had always relied upon in past visits.\n\nThe food, which has always been this establishment’s saving grace, fared no better. The goat curry—once the crown jewel of the menu—arrived drowning in oil, its once-balanced richness reduced to a greasy broth with tough cuts of meat. It took three requests before a proper serving of curry emerged, and even then, the anticipation of savoring a longtime favorite turned into disappointment. The chicken thali, another staple, was equally uninspiring: the chicken unexpectedly sweet and unyielding, the accompaniments stripped of the depth and nuance that once defined them.\n\nThe service too fell short. We found ourselves repeating requests multiple times before being understood—an avoidable lapse that reflects not only inattentiveness but also a lack of basic common sense in guest service. For a restaurant once marked by warmth and efficiency, this decline was as noticeable as the dip in food quality.\n\nNot all was lost. The Yangon tea and fish cake skewers still carried a touch of the charm that first won us over. They remain bright spots amid an otherwise lackluster spread.\n\nWe sincerely hope this decline is the result of a transitional phase or a new chef still finding footing. This restaurant has been a place we’ve cherished, and we would like nothing more than to see it flourish again. But flourish it will only if the kitchen and service return to form—because the food, after all, is its only true USP."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CQ2RuVTBYMnRoTlc5elJ6UjNjM1ExTjA4NE1FRRAB",
            "text": "Pros\nGreat food. Loved it. Food is very flavorful and authentic.\n\nCons:\nCash only.\nThey increased the price of tea salad and goat curry. Now it's not worth ordering those. Basically they took their best dishes and made it such that no one orders those ever again. Some weird business decision they made there.\n\nI didn't end up ordering those items for obvious reasons but the chicken thali was good nonetheless. Still, wanted to try the tea salad but I'm not going to spend $20+ on a salad."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FM0xVRkROMDVuU0U5Wk5UTlhTVEZGWjNKTVExRRAB",
            "text": "Come early because a lot of things sell out. Get the anchovies tea salad, the curries, the coconut cream noodle."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25STE9VZHFNbEF4ZVVoUFJqaHVjakZFVVdOU2QyYxAB",
            "text": "The kitchen here knows exactly how to win my complete devotion. Every employee showed warmth and readiness to help. The dishes avoid generic interpretation. They prepare meals with clean, fresh ingredients. I'm anticipating a return in the near future!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWbloyZG1URGhWUjJKMlJWSkRYMGN0UVhOVlVYYxAB",
            "text": "Had tea leaf salad, tofu salad, and a dragon fruit juice and it was the perfect summer meal. My friend and I are both south Asian and love tea leaf salad. It was super tasty and authentic. You can also choose your spice level. I love that this is a small, family run, restaurant with no bells and whistles. There is a simple bathroom you can use but you have to go through the kitchen. Price is right for the neighborhood."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GeWJubFdjMFF5YlZGSVMzTTBhSFpRU0d0YVduYxAB",
            "text": "The lahphet was really salty. Burmese tofu was okay. Staff was nice enough but would have been nice to know that it was cash only at the beginning. No restroom so plan ahead."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wTmMwWkVPVTB3Vms1U1JqQnhNWGRoVGpOeWNIYxAB",
            "text": "This place is cash only. Didn’t bring the cash but luckily they take Zelle"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1T1JDMTFRbEJzYTIxT1RtMWFTa00yTFhVMU1WRRAB",
            "text": "I picked a good spot to try. Their food deserves recognition. The workers show outstanding attention to preferences. The staff doesn't disappoint and neither does the food. This spot delivers satisfaction and I recommend it!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GdldUYzBlWGsxV1U5VlUwVXhSRGhYZDNSR00yYxAB",
            "text": "Food is good, delicious\nThere are only two staffs\nBoth are customer service, waitresses, chefs and cashier.\n\nVery fewer table as the restaurant is very small."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMk1rbEJUbkZ3Vmtsb1pHNXJkSEpZVFU1cU9YYxAB",
            "text": "Cash only, no bathroom, tea leaf salad has old vegetables and way too salty, soup tasted like water , over priced for 5 pieces of overcooked shrimp . not good at all"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKWGRIbGZhMTlWWXkxbkxWQTBUV3R1WHpOWlZtYxAB",
            "text": "incredible place. the mohinga is nothing like you would expect from a fish soup— the broth is light, mild, and the chickpea fritters compliment it wonderfully. we asked if we can purchase the fritters anywhere, and they said they get it from a friend who makes them at home and does not sell. the iced milk tea is strong and refreshing. the tea leaf salad with anchovies has the right crunch without any fishy smell and the chilli that comes with it adds a nice depth— it was rich in flavor without being spicy and just refreshing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KV1p6VlFObXBFU1ZaV1RUWTVOR0YzV1RkcFNXYxAB",
            "text": "This restaurant surpasses verbal expression. The pricing at Little Myanmar reflects the area correctly. The portions match the price point. The entire workforce treats guests respectfully. This place shows mastery in its field."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jelUyaDNOa0ZwUTFoVlZHSXdUV3BWVms1bWNVRRAB",
            "text": "Ordered takeout in person because no one picked up the phone. Told me to come back in 20-30min. When I came back the order wasn’t ready because they didn’t have some of the ingredients so I had to reorder. Shouldn’t they know before telling me to come back in 30 min?"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWaFUzQTFaa1pMYmtjelJFNXhlbWRGWW1aS1FrRRAB",
            "text": "The food is amazing the service is amazing"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMmJWVnZPVU5QWkZjd1IxVm5WbGRJY0ZWUVoxRRAB",
            "text": "As someone who is Burmese, it’s so great to have a spot that is authentic, super accessible in the city and vegetarian friendly! Definitely hits the spot for when I’m craving food from home. It’s run by Burmese people which is nice! They prefer cash if possible. Drinks are yummy too. My favorite just in general is the Shan noodles but they haven’t disappointed me with any of their other dishes like the salads and noodles !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204eVFWVjBkVGRyVmxkMmFHVkxSRnBoUkhsamNHYxAB",
            "text": "Tasty goat curry 🐐"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCNVZVVnVSbE5TWkhaWU1FTjBWRWxVYlRkR2RrRRAB",
            "text": "Nothing fancy but it was the best and super authentic in downtown Manhattan"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxbWEwcFhOVjlNTUVOVlQyVk1aRlk0UmtGM1dWRRAB",
            "text": "Worst"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aNFJUTlJZME15WkVwRU9UTmxXVFpzYVhSelRrRRAB",
            "text": "They offer halal Burmese cuisine"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQR1N1YUtra0tEaUl3EAE",
            "text": "Very delicious and highly authentic coming from my Burmese grandmother. Very friendly staff who are very hospitable, however not a lot of seating inside."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYlIxWV9rcGV6bjBnRRAB",
            "text": "Always love coming here, and everything on the menu is great. A review from a month ago said the place was cash only, but I went for lunch today and they do take credit cards with a slight upcharge. I like the laid back service and everyone here is friendly. You don’t feel neglected, but the waiters are not hovering over you. You can have a slow solo meal here without being bothered or you can come with another person and be able to have a conversation without a waiter coming to interrupt you multiple times throughout the meal."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvX1BPN25nRRAB",
            "text": "Homey delicious Burmese cooking! Went here with my Burmese friend and I definitely want to go again. The tea leaf salad, the seafood salad, and the mohinga were all amazing."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcS1xSHJ3RRAB",
            "text": "Little Myanmar is a hidden gem that feels just like home- like a warm Burmese home….  The food is comforting and flavorful—every bite tastes like it was made with love. The staff are incredibly kind, attentive, and genuinely warm, making the entire experience feel personal. The cozy space, with about 14 tables, adds to the charm—intimate, welcoming, and perfect for a relaxed meal. A place you’d want to keep coming back to."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaTVyeEhBEAE",
            "text": "Absolutely incredible experience! The food was nothing short of fantastic—full of rich, authentic flavors that truly reminded me of the traditional dishes I’ve had before, but with a unique twist that made it special. Every bite was delicious. The pricing felt more than fair for the quality and portion sizes. On top of that, the cozy, welcoming atmosphere made the whole dining experience even better. It’s halal friendly which is a bonus! Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNva2JYUnhRRRAB",
            "text": "Very tiny, no restroom, cash only.  Friendly staff, great lamb curry-it melted off of the bone."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbXFUMmtBRRAB",
            "text": "This is a very informal restaurant- we were served a dish that was made with just one of the two ingredients in its recipe, because the kitchen had run out of the second ingredient! We learned this only after we specifically asked about it, and wish we had been informed about it when we placed the order!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveU5PVzJnRRAB",
            "text": "I’m surprised by how good the food is. Tea leaf salad is really amazing!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJczdMNHV3RRAB",
            "text": "My favorite restaurant in NYC hands down ❤️ love the tea leaf salad, lemon salad, mohinga… extremely sweet and accommodating people as well!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdFlXUmVBEAE",
            "text": "How can a restaurant not have a restroom open to customers?! The waiter told me to go to Marshall’s to use the restroom, which is like 5 mins walk away and I had to get down 2 floors below - so inconvenient and customer-unfriendly! This place is also cash only as well.\n\nThe food was good but in small portions that we still felt hungry after finishing each of our entrees plus an appetizer. We also highly doubt that the rice was frozen before or not fresh and was reheated in microwave because it came in lumps and didn’t taste freshly cooked that day.\n\nAlmost no service at all. The waiter and waitress were mostly behind the curtain and has not come to us and ask us anything about the food, the water was also self-served through a big bottle.\n\nNot a good experience, wouldn’t come again.  The no bathroom aspect was the most unacceptable part!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaWF5SHBRRRAB",
            "text": "The spices and sauces were delicious! But the meat in the dishes was something a butcher would throw in the trash. I got a piece of chicken- not a leg, not a thigh, but a hip- a bone in a cartilage socket. And the beef was all grizzle. The food would be ten times better if they would spend a few more pennies to get decent meat. The space is small, cramped, and uncomfortable. No bathroom. We were served tiny plates with only a fork and spoon. We received one broken knife for 3 diners. How bizarre. The knife was a joke, especially because we needed a chain saw to cut the meat. Don’t go here."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOHAzUHNBRRAB",
            "text": "First of all food are nice decently price but the staff are worse. Not respecting customer while serving this young kids need to respect customer and not differentiate between American and Asian. Worse service experience I ever had I visit this place when I visit New York to try Burmese delicacy but end up leaving because we wanted to split check 2 ways. And they are not up for it. New staff needed and properly trained with work ethic"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJck1IWWV3EAE",
            "text": "Was treated disrespectfully with such attitude, wish we never visited."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJckw3MTl3RRAB",
            "text": "Rude waiter, I don’t recommend"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJckl6bXN3RRAB",
            "text": "we had a reservation for 10 people, and this was one of the worst dining experiences we’ve ever had. the staff were incredibly disrespectful handing us dishes with such attitude and carelessness. it wasn’t just one person either, it was the…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaVlPNElBEAE",
            "text": "I really wanted to like this place but the food was just mid. also, they only take cash and don't have a restroom. I get it's a hole in the wall spot but I was at least hoping for good food :("
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRX1BYRF9BRRAB",
            "text": "Food is ok.Two women spent $120 for dine in and take out . We coming from Connecticut two hours drive way so purpose to go and eat with my native food.But she said they allowed to go to bathroom for only  14 Customers. They recommended to go to bathroom in Marshall. Never Ever come! So Bad!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnOUlfT25BRRAB",
            "text": "Cash only eatery with a wide selection of burmese dishes, taste was okay. No bathroom."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSekstcFZ3EAE",
            "text": "It has been a while since our first try of Burmese cuisine in SF. We had high expectations before our visit to Little Myanmar.\n\nWe tried 7 dishes, the portion was great with reasonable price. The flavor was overall not our type and a little different from our memories. Our favorite dish today was the Yellow Noodle Salad, the sauce was rich but not greasy at all.\n\nI personally like this pancake. The filling was flavorful with crispy layer but our friends thought it tasted a little abnormal sour . We might not visit it again but recommend it to people who would like to try something new."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3amZtcXJ3RRAB",
            "text": "Their food is excellent and inexpensive (compared to other NYC restaurants). We ordered Shan Noodle and Burmese Pancake - both were delicious! Would love to try their other dishes in future! Location is also very good. However, you have to pay in cash and they do not accept cards or any other forms of payment. Although they have put a sign board indicating they only accept cash, we only noticed the board after ordering our food. There is a ATM nearby but I felt it is very inconvenient in these days and age."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUMG9DTDBRRRAB",
            "text": "Our first time trying Myanmar food and we're impressed. We found this restaurant on Michelin's list and wanted to give it a try. Just give everyone a heads-up that they don't take cards. Only cash or you can zelle/venmo them. The place is quite small, it fits 2 big tables and 2 small tables. It's seems like a family business, so please don't expect professional customer service here. They're slow but friendly, I think they try their best.\nDiving into the food. The tea salad was on point, this is my first time trying it, and I was in love. The seasoning is balance, and the textures of all the ingredients make this salad so special. Then my husband ordered one of their soup (they added vermicelli in the soup, and in Myanmar they eat it for breakfast), and I ordered my stir-fried noodles. I prefer mine better. My dish has a familiar taste with all the Asian dishes I've tried, that's why I like it. The price was not expensive and we were satisfied with the dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYd2VLcTFRRRAB",
            "text": "This hole in the wall spot serves mind blowing flavors!!! FYI- it’s a small spot so expect to wait a little. We came without a reservation and were seated after 10-15 minutes of walking around the block. From past experience with Burmese food I knew we would get a salad or two, since Burmese salads are the most exciting taste and textures. They had run out of a few dishes (beef skewers and tofu salad) which was a bit challenging but luckily with a vast menu it was easy to replace parts of my initial order. We went for the tea leaf salad, the chicken noodle salad, the chicken curry, a chicken skewer, and the banana cake. The tea leaf salad…WOW. It may appear a little “ugly delicious” with the dark color of the tea leaves but holy moly. The crunch and flavors (garlic, baby shrimps, peanut, etc) made every bite delectable. My second favorite dish of the night was the chicken noodle salad. There was beef or chicken options but we had a Hindu friend with us so opted for chicken. WOW! The creaminess of the dish stood out. Served room temp like a salad. The chicken curry was bone in, but nothing too special a typical curry with basmati rice. Highly recommend the banana cake if you love bananas and coconut. Perfect couple bites of sweet that wasn’t too heavy. The menu also shows what magazines recommend like the New Yorker or Eater so it’s easy to pick out the star dishes. FYI almost all these pics are after a few bites of eating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsaS03S3pBRRAB",
            "text": "Very authentic Burmese food. The place is extremely tiny but the food just taste like home. Everything we had was amazing! The goat curry was the best! No smell or what so ever and taste amazing! The Fish noodles was really good too!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcnItRnRnRRAB",
            "text": "I rarely get to have Burmese food, but @littlemyanmar_nyc was very yummy I’d recommend to try them out! The group’s favorite was the yellow noodle salad. Very flavorful and we actually liked it more than the tea leaf salad which is the usual go-to at Burmese restaurants. The seatings are not that comfortable though, so I’d suggest doing takeouts instead of dine-in."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKc0ktZzdRRRAB",
            "text": "Everything was great!\n\nWent on a Saturday for lunch with 6 people and we were the only ones in their up until the last 10 minutes when two people came in to eat. The staff are super nice, maybe because one of our friends was Burmese? But maybe they are still super nice?\n\nFirst time trying Burmese food, it was very good! Some of the apps had some unique and interesting flavor profiles that combatted each other but in a good way.\n\nDefinitely better to split something since it is a little pricey."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkZ1B2eGhRRRAB",
            "text": "What a phenomenal surprise! I had this restaurant marked from an article I read, and had lunch there solo. The dining room is very small and I took the last table. The flavors and textures were balanced, memorable, and unique. I've never had Burmese food before, and the menu was a great glimpse into the flavor profile. I only wish I could have tried everything on the menu! They are cash-only as of this writing, so come prepared. If you ever need to expand, come on up to the Upper West Side please!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bWU2NUNREAE",
            "text": "A very tiny shop at lower east side and one of the few restaurants offering good Burmese cuisine in the city. Was still setting up the shop when we visited, ordered a lot of different dishes. Tea leaf salad with anchovy was great as usual, noodle are tasty. Goat curry a bit disappointing, tiny few pieces of meat and mostly bones. The two desserts were very interesting. ~10 seater so reservation is recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdzRIOWhBRRAB",
            "text": "My experience was good! I was happy that they had vegan dishes. I didn’t order much, but the appetizer I had was delicious! The roti and potato curry was tasty with a little spice. Would come again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybnBmcXJ3RRAB",
            "text": "As a Burmese resident here in Manhattan, I’m always craving good authentic Burmese food so I was thrilled when Little Myanmar opened up. The food & portion sizes never disappoint. Plus friendly staff! I’ve introduced so many of my friends here and they’ve all had positive reviews. Only downside is there’s no bathroom but the restaurant next door is nice enough to let customers use theirs."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeXJUeVhREAE",
            "text": "A cozy, hole-in-the-wall type place with all halal options and good service. I tried the beef curry which was alright. I was expecting a bit more flavour wise, but to be fair it was my first time trying Burmese food. I also tried a corn skewer and a chicken skewer, which I liked the most of the things I tried. They were seasoned well and the meat was pretty tender, as compared to the beef curry."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtOWNhR1RBEAE",
            "text": "This place is a fantastic Burmese restaurant! 🇲🇲 Little Myanmar offers a wonderful selection of delicious 🤤 and distinct dishes! 🍽️ Definitely try the Beef 🍖 Skewers 🍢. Service is quick and staff 👨‍🍳 is super friendly, welcoming, and professional! Ambience 🎶 is great and their are plenty of indoor and outdoor seating! 🪑 I wish I knew about this place earlier!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2b2VQbG1nRRAB",
            "text": "You have to get the green tea leaf salad!!! Idc how odd it sounds man the earthy and tangy taste is so hard to describe, it was fresh and had so much depth of flavor. Also eat it with a side of warm fluffy rice… trust."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNldWVPLTBBRRAB",
            "text": "My son who stays in New York wanted us to try out a new Burmese restaurant located in the East Village called Little Myanmar when we visited this past weekend.\n\nVery small inside with some seating inside and a small kitchen you need to pass before going to the 1 restroom, my wife who was born in Burma spent some time chatting with the owners before we started ordering.\n\nThe menu is large and we noticed a few important differences from our local restaurant. The squash fritters was not on their menu and several dishes were served cold than our local restaurant in Virginia serves warm.\n\nCoconut chicken noodles, ginger salad, paratha with chicken, goat curry, chicken skewers (served late) and shrimp curry (cold but good. Serve warm suggestion). Chicken fried rice was good and samosas. Chicken roti was good also. All were decent and served as they were prepared. So several new to us and some good some decent. Made us appreciate the restaurant we have in Virginia.\n\nWe hope it stays as there are a few but not many in this city and there are many who have some family or cultural tie to Myanmar."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMydjhHQk13EAE",
            "text": "Small little place run by a family serving up authentic Burmese cuisine. They just recently opened and it’s already popular! Unique flavors, great selection of food. Definitely try the tea leaf salad, rice noodle dishes, and stews/soups.\n\nThis place is also halal, and most (if not all) items are gluten-free. You can dine in (there’s only ~6 tables) or takeout (no app, so call or order there). It’s cash-only. All items are well-priced.\n\nDefinitely give this place a try!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6cS1DRmFREAE",
            "text": "I've become more of a spice guy recently. Over the past year my order from the local Thai spot went from mild to medium to hot spice level and I've been feeling myself I can't even lie. I think it's the Mexican blood running through this 5'10 174lb frame.\n\nI bought this habanero sauce from Trader Joes 2 nights ago thinking nothing of it. \"Pfffttt how hot could this be? I'm like that now...\" It ended up going scorched earth on my food and made it completely inedible. I couldn't breath because it was so hot.\n\nFast Forward to last night, I found myself in the authentic Burmese hole in the wall restaurant that is Little Myanmar, the waitress asking me in her heavy accent if I want my Mala Xiang Guo normally spicy or extra spicy.\n\n\"Okay but how spicy is extra spicy? Like really spicy?\" I inquired. She smiled, nodded, and said \"very spicy!\" I backed down and opted to go normal spicy and thank GOD I did.\n\nWhen the Mala Xiang Guo came, I was in a fight for my life with this heat. I would randomly interrupt my big bro with a heavy cough and a quick reach for the water to battle the heat. I really should have asked for some milk lol. I still ate the whole thing because it was DELICIOUS in a masochistic way, but this was the absolute limit for my spice level. It was a dog fight. Think Timothee Chalamet vs Austin Butler in Dune 2.\n\nFor you dorks who don't know what Mala Xiang Guo is (this was my first time eating it), it's a spicy stir-fry hot pot: An amalgamation of noodles, meat, seafood, and assorted veggies in a spicy mala sauce. Damn, I can't stop working \"amalgamation\" into these reviews my fault.\n\nAll in all, my big bro got the chicken curry and that was the move. I had one bite and was like yup, that's what I should've got. Man in the Arena though.\n\nIG @jnov_\nTiktok @jnov_reviews"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1cTd6WFd3EAE",
            "text": "A much-welcomed edition on their move to the East Village from their ‘pop-up’ in Queens as it’s not only more accessible but also giving the people of New York a chance to taste the Burmese cuisine.\nI ordered the O.G. tea salad, Shan noodles and they did not disappoint (thank you Yelp community!).  Both were so tasty yet a flavor which is hard to describe (in a good way). Regardless, there was certainly a ‘kick’ to both dishes, and one might want to tone down the spice level during order.\nThe restaurant itself is tiny with joint with limited seating both indoor and outdoor. Nevertheless, great and friendly service, I’ll be back to taste the rest of the dishes.\nGo and show your love to Little Mynmar!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtaGZtSV93RRAB",
            "text": "The best and most authentic Burmese cuisine in NYC! The place is small but the food is good! A to-go restaurant! And it’s halal. Recommend Shan noodles."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0dE9lbGlRRRAB",
            "text": "This place is so good. ❤️ we had the tea leaf salad with anchovies…omg so so yummy. Goat curry so savory and delicious. Pancake was good like a dosa but with rice flour. Tamarind juice was perfect. My new fav neighborhood spot. Please support local businesses. They came from Jackson heights in the subway station. Super authentic!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcU9uS19RRRAB",
            "text": "First off, this location is cash only. There are many ATMs at the shops around there for you to take money out.\n\nI got the chicken paratha, yellow noodle salad with potato and tofu, and a Burmese tea. I cleaned the plates and was absolutely stuffed. The dishes aren't like how my mom makes, of course, but the flavors and spices are on point. I didn't feel that the dishes were neither under nor over seasoned.\n\nThe chicken paratha was so yummy. The dark meat had more flavor and was juicier than the breast meat, but there were just enough pieces of chicken. For one person, almost too many. I'd recommend sharing with 1 or 2 other people if everyone is having their own entree. The only suggestion here is that I wish they served the paratha on a separate plate so it stays crispy when you eat it with the curry.\n\nBe careful when you order something spicy. The spice is no joke. Go mild and you can always add more if you like. The portion of the noodle salad was perfect, bordering on too much. I loved the sour slices in the dish too, which made the otherwise heavy dish, a bit lighter and more enjoyable.\n\nBurmese tea tasted perfect. If you've ever had Thai tea, it tastes very similar. It's a bit sweet, so maybe ask if they can reduce it if you prefer less sugar. Overall would go again to try some of their other dishes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4OHJEc0d3EAE",
            "text": "No frills, hole in the wall spot, serving authentic tasting Burmese food in lower east side. Went on a Friday so they had oxtail available, tried the oxtail curry and mohinga (fish soup). Oxtail serving size was a little small but very tasty and came with rice and vegetable soup. They also had an interesting juice menu. Fully halal menu as well! My wife and I tried the dragonfruit smoothie and lemonade and both were tasty and refreshing. Very satisfied and will definitely be back again the next time I'm in the city!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPaTl1U09BEAE",
            "text": "Small and cosy restaurant. Has about 10-12 seats inside, and about the same outside. It has a nice atmosphere and the waitresses are quite friendly. One can easily see it is a family-run business. The food was very tasty, and not expensive at all. I ordered the noodle fish soup, which I recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4MXFQLWl3RRAB",
            "text": "sometimes a late light lunch is what you need in NYC where everything is constantly in motion. ordered a Burmese pancake (appetizer) and banana cake for takeout…the pancake is a savory fried thin crepe-like bite filled with lentils, tomatoes, and more. the pancake is light and flavors but rich bc it is fried…so it feels filling without being heavy. the banana cake is a must order if you want a sweet bite. served warm. extremely banana-y, soft, and spongey. this dessert item is really enjoyable. the restaurant is a small casual one with small tables in a clean well-maintained space. there is also outdoor seating on the sidewalk. the restaurant has the home-style family-run feel. my order was packaged neatly. if you’re looking for a menu of foods that you won’t encounter in many parts of NYC—then Little Myanmar is worth a stop for lunch or dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINk9pcmxBRRAB",
            "text": "This place is sooo craveable. If I lived in NY, I would be here all the time. I had yellow pea paratha, mohinga, and tea leaf salad. As someone born in Burma, their food is exactly what I dream about. They were so kind too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYck9pOFBREAE",
            "text": "I love the Fish Noodle Soup (Mohinga) . It’s so amazing. Apparently ,all the foods are good .\n\nI wish , they could upgrade the atmosphere Kitchen and customers dinning area ."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdDc2eGJnEAE",
            "text": "Nice little place, if a little tatty! The food is beautifully flavoured, and you’ll definitely taste something you never have before. The space is a little small and chilly in winter."
        }
    ],
    "reviews_count": 77
}