{
    "name": "Kalye",
    "place_id": "ChIJzxi2CEFZwokRGLb3H5aeHDU",
    "grid": "MN3",
    "address": "111 Rivington St, New York, NY 10002, USA",
    "rating": 4.8,
    "user_ratings_total": 331,
    "phone_number": "(646) 287-9153",
    "reviews": [
        {
            "date": "8시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ST01uWmplVk5NV2xnNWNGcGFabUpHYXpCaWNXYxAB",
            "text": "Stunning location, flavor filled food and kind service. LOVE Kalye !"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWbllrdG5ibmRXWjB4NWNuaE1jVmREUTJsUk9GRRAB",
            "text": "Amazing food! Reminds me of home"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sdlYzVTFkbk4yWmt4R2JHTlNObmxsWVdwUlpsRRAB",
            "text": "Amazing authentic Filipino food!! Loved the food and drinks!!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4MWF6UlpjM0pVVUV4a05XdFJhamxyZDJsS2QzYxAB",
            "text": "We just had an amazing experience at Kalye NYC! The food was packed with authentic Filipino flavor — everything from the lumpia to the ube dessert was on point. The atmosphere gives cozy street-style vibes but still feels classy and welcoming. The staff were super friendly and attentive, always checking in and making great suggestions.\n\nYou can really feel the passion behind every dish — it’s like a taste of home with NYC vibes. Highly recommend this spot if you’re looking to experience Filipino comfort food done right. I’ll definitely be back for more! 🇵🇭✨"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMVJuRTRjWHBETm5WVmRFWkNSWFpOTjIxblNtYxAB",
            "text": "Everything was good but rice was a bit undercooked. Felt dry and rough"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjMVoyZERVQzFGTTBsSlVGcGZkamxuY0VzeFRYYxAB",
            "text": "Not sure if I was there on a really bad day for the restaurant, but multiple dishes on the menu were not available during peak dinner hours. The food we did get was greasy and had no flavor. Unsure how this restaurant has such a high rating. It’s deceiving for sure. The atmosphere and service were decent but if you want a good meal, look somewhere else."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nMGNHY3hRMlpJU2s4NWNWZzBjWGRzVDFrNU0xRRAB",
            "text": "I went with a totally party of 4. Had the best time. The food was amazing and the service impeccable. The ambience was heightened by their selection of music, which was nice. The bill (we didn't get any booze) was more reasonable that we expected. Definitely recommend. Will go back."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMVJtTnpRbVZtUkhCR1JqWTRUa2hGU2tGdFdVRRAB",
            "text": "The experience here stands head and shoulders above average places. Workers here show outstanding assistance alongside truly kind attitudes. You receive a proper amount of food here. This place should top your dining list! Incredibly tasty dishes consistently!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGeFEyMURiRWs1Y0MxcVUzZFphR3BmUjE5c05GRRAB",
            "text": "Honestly such a terrible restaurant- we ordered 5 dishes (noodles and beef entrees) and ended up not eating 70% of it. The beef was not edible- zero taste. The noodles tasted like magi cubes with some pork and 4 pieces of shrimp. So expensive for taste and quality. So disappointed. Gratuity is also included for big parties but no one told us so make sure to ask. All together- really unsure how they got this rating.\n\nLast thing- they ran out of 2 dishes on the menu as well as a drink when we were there. Crazy."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVeVdWSnNibUV4U25Fd1VFbHNlRzg0TVVjMVRXYxAB",
            "text": "The kalye team were super sweet 💕💕💕"
        },
        {
            "date": "수정일: 6일 전",
            "language": "fil",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnMmEyaEpkMlZNVFhwTE9IZFlNWFExYVhOWmJFRRAB",
            "text": "Ang sarap ang cocktails! Alesi is the best bar tender! 10/10 would come back here!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KdFozaGhabUoyWXpSbmNIbHhjblZWWmkxV1luYxAB",
            "text": "yummy filipino taste! good choice"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rNVZVZFNkRVZwUVVsSU5FRkNTa0ZFWVVVM1QwRRAB",
            "text": "Amazing place! If this was was in Midtown they could charge 3x......"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJMFdqbE9SSFpTVDJkSE56TnlSMUZtU1Rsc1dFRRAB",
            "text": "Great Filipino restaurant! Delicious dishes - I had the Garlic Beef, fragrant, tender and delicious! Innovative Cocktails - I had The Valentina which is Rum, Fruit Juice and Malbec. Vibrant Decor and Super-friendly staff! A must try!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aS2QzbHJWV0ZEU1VwdFpGbzRkMHBhT1ZwM2RtYxAB",
            "text": "Looking for a spot to eat in LES and immediately went on Google to look at some choices that were in a 5 block radius. Found Kalye and could not believe the vibes of this place on A MONDAY! Live DJ banging tunes and it felt like I was in an episode of “The Boiler Room” young local folks there just vibing, enjoying food and drinks. Service was GREAT and could have totally been the opposite because of how crazy it was in there. The food was also delicious and so was the dessert, we had this coconut pie and this delicious ice cream. We even saw the 2025 Project Runway winner! We will definitely be back to experience more. Can’t wait…\nGo here!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsVk4yOW5NbXN4V1VvMVMyaHVkVmw2YkhKelEzYxAB",
            "text": "Great pork skewers! Great Laing! And Alesi is a great bar tender that knows what he’s doing and contagiously passionate! This place is a straight up vibe!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoek0wWm5lRzk0V0VGbk1EWldNMGwyYW5kU1ZIYxAB",
            "text": "The bartenders are so talented and the service was excellent! Highly recommend the kare kare!!!"
        },
        {
            "date": "1주 전",
            "language": "fil",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaT05tNUZOVU42V0dkVldraFlTMjlHWjJ4SGRsRRAB",
            "text": "I LOVE KALYE, SOBRANG SARAP NANG KAIN AT DRINKS DIYAN. SHOUT OUTS SA ALESI ❤️❤️"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUE1taDRWVFpzY1dneVJGOWFaRFl0WW5JNU0zYxAB",
            "text": "Great vibes all around! Nice ambiance when theres live music. And of course the food 👌🏻Special shoutout to Alexis the bartender the man can make a drink and put on a show 👏🏽👏🏽👏🏽"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xMWQyaFdhaTFWYUd3emFrRTVRalY1VDJ4Q05IYxAB",
            "text": "Alesi gave us the best service i’ve had in NYC and i’ve been too A LOT of places. Nothing tops that!!! 100% have to check this place out!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twelNVeHZiMjVaV1dJNVZUVjZRbkpsUzFwaVprRRAB",
            "text": "This place rocks! Food is great, atmosphere kills. Alesi is the best, definitely recommend."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0QlpYaFJZMnByWjFsVWNGaDVZelZKZWpOWmRuYxAB",
            "text": "Such a good vibe! Alesi (the bartender) made great cocktails. Also, Happy hour is 10/10"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNd05sbHJUemxPYVdOTFQxZEdiV0V5YmsxNWJVRRAB",
            "text": "Great food, great drinks and great vibes."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGT05VZzVTRkI1UlZWWWRWZEdPVkphY1UxWVQwRRAB",
            "text": "Went here for dinner with a friend and we had a great time! The food was delicious and tasted like home - just what we were craving for. So glad there’s another tasty Filipino restaurant in the city that i can add to my list. Will definitely come back to try the other dishes!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBd09HUkVWRjlmVG04d1pIbFdURTk2TWtReVFVRRAB",
            "text": "Highly recommend going here!! Staff are friendly and the food and drink options are delicious. Can’t wait to go back!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTVdtTTFja3RWVFRONmREQXhMVk52UTB0cmMzYxAB",
            "text": "Classic Filipino kitchen style food. Great customer service and energy. Aesthetically beautiful with a vibrant atmosphere. Killer cocktails!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4M1RuVTJZMUZSUW5SME9FWmhZMDlqVDNsTWJGRRAB",
            "text": "Was strolling around the city when the smell of home cooked Filipino food lured me into this Filipino spot, and wow no regrets! 😋 The pork sisig slappeddd, the skewers were delicious, and the sinigang tasted like my Lola made it herself 🥹\n\nThe cocktails are 10/10. Bartender… also 10/10 mostly for being hot and flaring bottles like he’s auditioning for a telenovela"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KQ056ZHRhMWRGWjBGRVZXcFlhRmhxVTI1SFQzYxAB",
            "text": "Best place to bring a group of friends for some really good Filipino food and their cocktails are on point. A must try place , u won’t regret it . Alesi, behind the bar and Charlie will take care of you"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGS2R6SnNXWEZpZGtkd01EazBVM2xWT0VoNmNHYxAB",
            "text": "Love the vibe here! The decor is spot on, and the service was excellent — Brendan, Justyn,\nand Eamon were fantastic. Portions were generous and the food was flavorful. Overall, highly recommend!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210MFZXSkdVSFJQZUdaeVJuWjJRVEk0VWtGUVVFRRAB",
            "text": "Everything was so delicious I can’t wait to come back! 😋"
        },
        {
            "date": "수정일: 2주 전",
            "language": "fil",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ka2FqWndiR0pqTFZoWE9XcFJUSFJtUnpkTllXYxAB",
            "text": "ANG SARAP!!\n\nS/O to Brendon and Eammon"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4dWRHbHhlRUpqUm5oQ2JVZFNkR0Z1VERoM1lrRRAB",
            "text": "I had such an amazing experience, very attentive service and outstanding food, drinks and atmosphere. No notes!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swMFUxWnFSVmgwZVdaQmFETjJkMmxJVjFaUVdWRRAB",
            "text": "I loved this place, Brandon and Jeremiah treated me like as if i was home. 10/10 definitely recommend. When you come in ask for Brandon and Jeremiah!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205VVJrSlZXRzlEVEhGMFNFaEVWWFExUmxvMFlrRRAB",
            "text": "Great food and even better vibes. Perfect Filipino spot here down here in LES. Super friendly owner and staff, during their industry night during Monday nights."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OeFQxRnhRMXB6U1VsV1ExVTJOM1pEY1dOVVFVRRAB",
            "text": "Food slaps. vibes great. Had chicken inasal and it is to die for"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SblJUbFlaMDlaWlVSV1JsQnFVemRPU2xobFJWRRAB",
            "text": "The staff was phenomenal!! The food and drinks were top tier!! I HIGHLY recommend this place"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rd1VYZDZTRlZrUldaTGQyUndWbEU0WW1OU1RIYxAB",
            "text": "Thank you Justin and Brandon for the best 23rd BIRTHDAY! EVER!!  Ever say I love you so much. Never silence me."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkSlVVOVROVVoyT1VSTGVuTkllbkEwUkdOT1NsRRAB",
            "text": "Wanted to find a Filipino spot for a quick dinner. Was a plus that this location had a bar.\nHad the Lumpia and Pork BBQ. Both very good. Alesi provided great service and conversation. Very personable."
        },
        {
            "date": "3주 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2treWNtZ3llbEpaWjNJMExXUlFTbmMwVFVKVVJXYxAB",
            "text": "Trop sympa top merci"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KdVYwVTJiMlp5WkhsQ2VrTkZVVTl1U2psZlFsRRAB",
            "text": "I love this place!!! The food is incredible, wow! the service makes you want to stay all night. We had a great time here for my friends birthday. The staff was so sweet accommodating and welcoming to us and our celebration. I also love how LGBTQ friendly are, never have I seen a restaurant put this on their receipt! We love it here and we willl be back!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RdGRIQnZlVWhDU0hwWWRXbEpja2hEUVUxRlNXYxAB",
            "text": "Alesi made incredible drinks! The Manila martini was to die for! If you love, coconut flavor or coconut base drinks, this is a spot for you"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214NlVGQTRSMmRKTVZoR1dsQnJWbUV5V1hKbmJVRRAB",
            "text": "Kalye is my favorite spot in the LES!! Food is always fab. Love Charles and Jacob, they are always so welcoming and the atmosphere is the best, no matter kind of night you plan of having!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taUWRsWm1ZWE5wV0dRM1EwOXVha2hFWjJRNVlYYxAB",
            "text": "As soon as we walked in, amazing vibes. The place smelt amazing, clean vibes, the team was fantastic! 10/10 would come again. Also get an Elektra 😍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaa1ExZE5ZbE0zU1ZOUmJHMDJNV3BNT0c5UVowRRAB",
            "text": "Amazing experience"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTFZWbFRUbTQyTlRKSk1WWmpZazlXWlZSdWFGRRAB",
            "text": "A quaint Filipino restaurant that takes you back home🏠 We enjoyed each dish and loved every bite. Presentation is the best and service was excellent!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wUVRHOUxZVjkzTVdvNGVHdFZiQzExWVZkdGRVRRAB",
            "text": "Ordered the large Darna with a group of friends and several plates to share. Great taste, especially the lumpia! Will be back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwMFFuSmFia0ZuTFRKWllXeDZPR2s0WlhCbVZIYxAB",
            "text": "The service here was awful. Came during lunch and the restaurant was a bit empty with one other table of women. When we sat we noticed it took a while for them to take our order and hard to wave for their attention because they were taking shots with the other women at the bar. Eventually they took our order but the vibe was off the whole time. They spent so much time speaking to the other women that it was difficult to get their attention. The food was ok but we ordered extra rice which never came. I was originally fine with it but we were still charged for it (my fault for not checking the receipt). Then at the end paying the bill the server showed me the payment pad and told me you can pay tip by just changing the gratuity percentage but I saw it said “extra gratuity”. So I asked for the receipt and found out there was already a gratuity percentage on our bill. Felt like he was trying to sneak in extra tip at end."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMGIzWm9aRGhvU0RWUGVqZHRWVXh6TkVRNVVWRRAB",
            "text": "Food was remarkable and the staff was super friendly, we chilled at the bar waiting for our friends and they were just chatting with us and being incredibly welcoming"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVGJqTlpSMWRxYTI5WVdXcFlObWRJYlVwWlZGRRAB",
            "text": "Justyn was a great host. The vibes and food were amazing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3MFFubDFOR0ZGWm00ek1EUkVZbFZCTjBsdk5VRRAB",
            "text": "fire food and amazing staff <3 love them all"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JdFRWQlRSRk5KWkdaQlQxSk1ObXhOY210WWRVRRAB",
            "text": "This place is great for a casual date night or hangout. You get the filipino staples like sinigang, sisig and palabok and they have great drink selections that are unique. Try the elektra - great lychee and calamansi combo w vodka. Our server jerrimiah is the best! He's so attentive and explained all the dishes and you could tell he genuinely loves talking about the food and giving good service. Been back twice now. ❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsbGJrWk9iSE5uV1dwMmVHRXlUR2RoZFc4emJFRRAB",
            "text": "I’ve been wanting to try Kalye for a while, and it did not disappoint—what an incredible way to celebrate my birthday! I booked a kamayan boodle fight brunch for a party of 14, and from start to finish, everything was seamless. The staff made us feel welcome right away, and the attention to detail and exceptional service truly elevated the whole experience.\n\nThe food? Absolutely phenomenal. You get plenty of it, and the flavors were spot on—balanced, bold, and beautifully presented. I loved how they incorporated a mix of meats, seafood, fruits, and veggies so well. It was a full-on feast that felt both festive and comforting.\n\nThey also have a creative drinks menu inspired by Darna, the iconic Filipino comic book heroine—such a cool and thoughtful touch. The ambiance is the perfect balance between modern, hip, and deeply rooted in tradition.\n\nKalye isn’t just a place to eat; it’s an experience. My friends had a blast, and I already know this will be a regular spot for us. If you’re looking to introduce people to Filipino food—or just want a fantastic, unique dining experience—Kalye is a must."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sb2MzVXdUWGhZTlhkcFVXcDFOVEozWm5kcVExRRAB",
            "text": "We had the beef kare kare and the chicken inasal and both were delicious. The chicken was crispy but not dry at all. The space is really nicely decorated and the service is great!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWMlVFZEZiRXhLTWpscFRqaFJjVWxSTkV4V1UwRRAB",
            "text": "Good and fun experience for Filipino food in NYC! Their sari-sari store bar is a fun touch! Although food and drinks are a little on the expensive side, its a must try!\n\nDefinitely try:\n- Sizzling Pork Sisig\n\nParking, as always, is difficult to find since its located in Lower East so we took an Uber from JC. Be careful of the toll and added prices for uber too!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gd01IYzBiVlpUTVZSWFgyUlNTM1pLVlZoc1VsRRAB",
            "text": "They have a makeshift sari sari at the bar.\n\nFood is good! Try the pork sisig and the lumpia. Had the ube ice cream too. Had a bit of saltiness to it. The menu they have on Google might be old because I was looking for Lechon kawali which is my favorite, but it wasn’t anywhere on there.\n\nGonna make it a thing to go to all the Filipino restaurants in NY as my go to restaurant - Purple Yam (chef Romy) retired. Still very missed.\n\nUnsure if it was just the time we went, but the music can be a little too loud. They lowered it eventually to a moderate volume.\n\nSupport Filipino restaurants!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CSlZWUjJWMHhMUW5oUVkwRkdZWEpZTFVWMlNVRRAB",
            "text": "Awesome vibes!! Justin was our server and he was so pleasant! Enjoyed the food and experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GamNWbFRMVW8xYURod2FGUTFPRUZGYURWRFJsRRAB",
            "text": "The atmosphere feels warm and inviting, perfect for a casual meal or hangout with friends. It’s a great spot for groups, with plenty of shareable options and space to relax. Staff were attentive without being overbearing, and everything…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKdjRvdUh2LTlEN3RRRRAB",
            "text": "We had a memorable retirement party at Kalye. The food and service was fantastic. Damila was very helpful with me planning the event.  Thank you again to all the staff I’m looking forward to come back and try other dishes in your menu."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WUk1uaFdVMDlZUzJFeVQycFlkazV3UVZFeE1VRRAB",
            "text": "Delicious, reminds me of back home. Sisig is a must try, and they don't play with the level of spice! 😋 Restaurant has cool hip vibes. My only suggestion is that the 4-sided cube each containing a QR code for a particular section of a menu is overkill. Just let me scan 1 QR code 😩...I shouldn't be flipping blocks to land on the side where I can see a list of cocktails."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kS1dGSnRVVTl5U1RoS1JFZ3lXVzVMTW05RWJXYxAB",
            "text": "One of the most open and social atmospheres. Similar to a hole in the wall, mom and pop, but couple that with sweet jams, bar, and restaurant space; you’ve got it all, first-hand. Tuesday, midsummer, overcast day, still popping.\n\nChris, the man, great bartender, great service and hospitality; several years in the making. He’s the man. I appreciated the service, thank you. Sociable and attentive.\n\nTried Filipino food in NYC, extremely good, and highly recommend if you’ve never indulged. Had the Tinapa Caesar Salad as an appetizer and Lechon Kawali for my main with a Red Horse Filipino beer. The Lechon came with banana ketchup which is a sweet ketchup like consistency and very good dipping sauce. All cooks/chefs are Filipino/Spanish-esque, made with culture. Jimmy, w/ braces, and Markye are cool. Raheem, waiter, and bartender, can mix. Makes a mean green cocktail.\n\nBathroom is clean. Atmosphere, hip and present. With that being said, overall, I’d come back again. Great service, great amenities, great aesthetic. 10/10. Thank you."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkeFExTnVhbVpPZGtwWFNGbFFUM0ZXVWtoMVpVRRAB",
            "text": "Decent filipino food. We tried the Boodle Fight Club so we get a variety of options. Definitely sharable amongst 3 people with an appetite. I wasn’t a fan because all the seasoning was heavy on the salt. No protein to rave about not cocktail. Very loud as well, this spot is a fun spot for groups it seems."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5c2RteGxVMmx2UlV4a1gyZzRhM3BSV0ZveWFFRRAB",
            "text": "This place is so authentic and delicious! The ambiance is great and the vibe is amazing.\n\nThe cocktails were perfectly crafted.\n\nThe Boodle Fight was soooooo good! We had a blast and the food was so great!\n\nRoxy and Brandon are awesome!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213eldHbFBkazlHWW5KQkxVOUxNWGhKWDFORVpIYxAB",
            "text": "Excellent food, excellent service, friendly and accommodating staff! I was pleasantly suprised finding a location right off the Delancy/Essex stop. My friend had a LOVELY birthday and it was thanks to this restaurant!! Kayle Staff truly know how to ensure their patrons have a good time and that's all the cherry on top of amazing Philippino food!!\n\nThank you Roxie and Brandon you rock!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbU9EQm9ZWFk0VkZOcWQxOXpkUzFNZFhsVlptYxAB",
            "text": "Lovely decor and friendly, attentive service- they made us feel pampered. Dropped by after a disappointing ube fest where the lines were long and the food looked just ok - luckily, my companion found Kalye had a storefront nearby and saved the day. The skewers were juicy, smokey, and flavorful. I especially enjoyed the sauce for the skewers. The uber burgers were portioned well- light (for a burger) but filling- the ube flavor in the bun was subtle, but noticeable."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaU0ycExnEAE",
            "text": "Just like their OG location on Broome, Kalye is VERY savory. With that being said, the rice paired very well with the beef AND skewers. I really liked the marinate on the skewers, plus they were SO tender! The sour pepper sauce and pickled slaw they gave was perfect to cut through the savoriness of the meal.\nStaff here were super chill. They let me take a seat while I waited for my order (~15 min)."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcnNtbTBBRRAB",
            "text": "Had a great time with my Filipino dad for his birthday! We chose the Club 85 Kamayan (boodle fight) which was a ton of delicious food for a very fair, affordable price point compared to similar experiences in Manhattan. My favorites were the Chicken Tocino, Pork Skewers, Longganisa, Seafood Gambas and Inasal rice.\n\nTruthfully, as a Filipina, I found the homemade Lumpia Shanghai only “okay,” but certainly not a dealbreaker as I have higher standards than the average non-pinoy diner. While the Ube Ice Cream was great, I thought the Mango Cheesecake was too frozen for my liking (I don’t think it was supposed to be like that). The presentation for both, however, was excellent.\n\nI also was a little off-put by the fact I wrote a specific request in our reservation note, and despite being the only diners (around 4:30pm), our server did not read it. He was nice, but showed a lack of understanding of the food being served, which was a touch disappointing.\n\nOverall, however, I thought the presentation of the food was impressive, the meal itself satisfying, the atmosphere inviting, and the touch of an old-school Filipino movie projected on the wall very entertaining.\n\nI think this restaurant is best for a group looking for a tasty, fun food experience at an unbeatable price than a harsh Filipino food critic. I would definitely come here again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOMVpIaGZaRVp0T1c0MVJFc3dUR2xXZGtOZmEzYxAB",
            "text": "Incredible food and huge portions- better to share large plates because they can’t be eaten alone! The service is amazing, kind and accommodating. Absolutely great value for money. And the ambience is awesome and super fun. Would absolutely recommend and will come back soon!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnelVWRllVV0kwTmtaaGJEaGpaekZUWVdKYVMwRRAB",
            "text": "Jerremiah is so sweet and kind ! My third time visiting and I always enjoy the food and ambiance !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201RVdtaExORVpxV0dwdlJUazFObll4TkRKdlprRRAB",
            "text": "I’m always skeptical of Filipino restaurants but this place is incredible. The food tastes like my childhood and the service is on point. Many thanks to Chris for being so helpful with recommendations and for his hospitality.  Thanks, Kalye!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFeGRVUnNVRGxPVlRCNFRXcGhiREYzY1dsbFRrRRAB",
            "text": "Best drinks, amazing food, and great service from Alessi. Good vibes all around. A chill and fun place to hang out in the LES. Perfect for a date or to hang with friends."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OWmRqbHZSbUpUV2tSNmRrWjJNM1J5TVhOcWVYYxAB",
            "text": "Celebrated my bday last night. Everything was amazing. Our server Jerremiah was very friendly and attentive. Food was a 10 out of 10. We will definitely come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWMlFWQTJTMUJ2UW5OdldUaGpiMlZzWjNReFNHYxAB",
            "text": "Amazing service, great bartender. Get the surprise me happy hour and it won’t disappoint. Sit at the bar and enjoy."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJN18tcDNRRRAB",
            "text": "If you’re looking for a delicious EXPERIENCE look no further. Kalye is the answer. The food is delicious, the drinks are craft and tasty, and the ambiance is amazing. Depending on the night, they program cultural events, have karaoke, drag brunches, live bands and more. I’ll definitely be back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOGEyZllnEAE",
            "text": "Loveddd the food and the vibes! Never had Filipino food before and the pork sisig did not disappoint! I’ll definitely be back for that. The staff and bartenders are very friendly. And the drinks are pretty. I got buzzed after 2 drinks. Plussss the live band/karaoke was hype! Perfect place for a pregame in LES!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21scVYxVlVaRlZaWTB4VWVtWkVjM1IyVFZwbmIyYxAB",
            "text": "Me and my friends have our after party in Kalye and we order a bunch of drinks! And its all good in very artistic way. Naming the drinks with the famous heroes and villain characters in Philippines and the vibe feels like home! Staff are very polite and attentive!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGV1QwVk1SMDVsUnpsTVpXRldXamxWVmkxRmVHYxAB",
            "text": "We went to try this restaurant. We had the Tapsilog and chicken skewers. It was a little difficult to locate this place, but we managed! Excellent service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBaExiSjFRRRAB",
            "text": "We came here specifically for the Boodle Fight 95 dish aka Club 95 ( a variety of skewers, lumpia, beef, seafood, veggies and rice). This was a good portion for 4 of us average sized girls to eat for dinner. From this, we absolutely loved the pork skewers, the beef, the lumpia, the two rice options, and the mango/cucumber salad. The seafood was agreed to be subpar. The presentation of the dish was stunning though! 4/5\n\nWe also ordered the Kinilaw (Tuna Ceviche) dish. Sadly this one was barely touched. The taste of it was pretty tangy. The cucumbers helped. 2/5\n\nThe staff were very friendly and kind! We came without reservations but they kindly sat us at a table and asked if we could be out in 1.5 hours before the next reserved party was due at the table we were at. We really appreciate Kalye Rivington for accommodating us! Thank you! 5/5"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NU5ETmZREAE",
            "text": "Kayle is cozy restaurant with amazing cocktails, great food and live music 👏 The staff is warm and helpful. The shared dishes allow for sharing with friends. Would visit again 👌"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MEtTYjZ3RRAB",
            "text": "The restaurant reminds me of home, the Philippines. The food were perfect plussssss there was a live band!!!!! The servers were really accommodating. I went to the restaurant on my own and they did not make me feel alone. Everyone part of the restaurant were so sweet!!!!! It made me teary-eyed. The owners were hospitable even keeping me company!! Everything is perfect!! I can’t even put to words how happy I am to be here. Food is perfect and goshhhhh they have my favorite beer, pale pilsen!!!!!!!!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkU1UybGpjR0ZhUW1reGREVXRXa294U21FME5WRRAB",
            "text": "Fun place! The food was amazing, but what really stood out was the service. Everyone was super friendly and welcoming, and the staff was really accommodating the whole time. The vibe is relaxed and inviting. Definitely a go-to if you’re craving Filipino food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214Q09GSXpOR2RqUm1KbU5VZHFSMGxmY0hWelJIYxAB",
            "text": "Omg I love this place. I think it’s going to be our go to when we have visitors. They were super accommodating to our large group of 8. We even brought kids and they made sure they were okay. Rica and Keiana were the absolute best!!!!!! ❤️ Friday night had great jazz music!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMHVXbnV3RRAB",
            "text": "Went for Sunday Drag Brunch and had the most amazing time. Great food and atmosphere with the friendliest staff. Definitely a new favorite spot!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pndFJYbEhNRWhOTkRjNU1WWkJTbEphY0ROblFrRRAB",
            "text": "Amazing food and service! I will for sure be returning. As an LES local, this restaurant is a new neighborhood favorite of mine. The quality and presentation of each dish is 10/10. The staff were super accommodating and friendly. I already know what I want to order next!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVd1NWZDNja3hIYTA4d01HaHJPVUkzTFhGb1duYxAB",
            "text": "I really wanted to love this place, but the lack of attention to detail and the absence of that welcoming vibe left my family feeling let down. Maybe they were just having an off day, but it’s hard to overlook how that affected the overall experience.\n\n1st: We had a reservation around 7PM they didn’t tell us there’s gonna be an event. I understand that sometimes expectations can really shape our experience. The atmosphere was overwhelming, and it made it hard to enjoy the meal.\n\n2nd: It's frustrating when the staff seem rushed and doesn't take the time to ensure everything is right. Having the wrong order just added to the disappointment.\n\n3rd: It’s usually the staff's connection to the culture that adds authenticity to the dining experience. It’s surprising to encounter a place where the staff lacks that cultural background.\n\nThe food is good. So, despite the lackluster service, I found myself planning my next visit."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GS1kyVjJVV3Q2VVZGTmVtVTFWRVV3WmpsalFVRRAB",
            "text": "Food was so good! We had the best pork sisig in town. Drinks are so good as well we tried Manila Martini as recommended. Service is exceptional our server Jeremiah was so nice and attentive. We will definitely come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aME0wOXhNR0oxWWpWaVdWSnNNRE50TFRScGNGRRAB",
            "text": "First time here and it was a wonderful experience! Great food, reasonable prices, even more than reasonable portions, and wonderful servers! Brandon and Eamonn were especially helpful. Would definitely recommend this place, especially in the LES, for some worthy Filipino eats!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWFUySnVUWEJYY3pKdGVHTkVkbEJPWlhodmRXYxAB",
            "text": "The whole staff was amazing, especially Rica and Keiana. Extremely friendly and accommodating, they offered my inaanak water while we were waiting for our tables. Despite the busy dinnertime they were still very friendly and attentive! Glad we brought our family here from CA and looking forward to returning. Maraming salamat!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNaV9wLUNpaDhqY2RREAE",
            "text": "I met the most welcoming bartender, I was walking by looking for a cute spot to have my last drink of the night and he stopped me and said this was the spot! I ordered a spicy margarita with mezcal and it was perfect‼️ 🍹…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRejV2dnB3RRAB",
            "text": "Had a great time at Kalye! Rika and Chris made sure my food and drinks were good. My friend and I had the lumpia, chips and Laing, and lechón. Everything was delicious and good portions. I recommend the darna drink. Definitely coming back!"
        }
    ],
    "reviews_count": 89
}