{
    "name": "Giano",
    "place_id": "ChIJIQ-tSJ1ZwokRnzgbXzA6coI",
    "grid": "MN3",
    "address": "126 E 7th St, New York, NY 10009, USA",
    "rating": 4.7,
    "user_ratings_total": 545,
    "phone_number": "(212) 673-7200",
    "reviews": [
        {
            "date": "2주 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aeGJVTjNXak5JZEhKb2JFMXFkV3RwYWpaRFRsRRAB",
            "text": "Tutto buonissimo (soprattutto il tiramisù) e personale molto educato e simpatico!  E da italiana vale doppio🫶🏼"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwNk9VMUlaVWREZWxoRUxVcEtjUzB3UW5RelRGRRAB",
            "text": "Amazing food and service!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204eGNqTklXR3cwVDBwTlZUbHdYMGxxY3pGaE1YYxAB",
            "text": "Found this spot online while looking for an Italian restaurant. The amazing reviews and low prices convinced me to try it, and it totally exceeded my expectations! Cool vibe with dim lights, brick walls, modern chandeliers and the perfect lounge music.\n\nWe had burrata, meatballs, two pastas (sausage & truffle — absolutely incredible, and the amatriciana that was awarded best in NYC on The Best Dish Ever), plus two glasses of wine for just $9 each. Finished with a light, creamy cheesecake — honestly the best I’ve ever had.\n\nFantastic experience, highly recommended!"
        },
        {
            "date": "1달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1VldYWmpUbEZKVkVwaVYwNVBaM2hGUlVOUVlVRRAB",
            "text": "Wir sind während unseres Urlaubs in New York durch Zufall auf das Restaurant gestoßen. Es war ein Volltreffer!\nIch bin viel in Italien unterwegs und muss sagen, selten so gut gegessen wie bei Matteo. Top Service, Top Essen und ein tolles Ambiente. Und preislich absolut fair und gerechtfertigt für das tolle Essen....\nVorspeise Oktopus und Bruschetta, Hauptspeise Ravioli mit Pilzen und Speck in Butter und Salbei und Lasagne, als Nachspeise Tiramisu, Espresso und Cappuccino. Außerdem 3 Gläser Wein für gesamt 150 $. Für mich ein tolles Preis-Leistung-Verhältnis für ein wahnsinnig gutes Essen. Danke Matteo für den gelungenen Abend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taeVkyNVViWEZCUkMxZlJXMUVZUzFmV0d0VU9IYxAB",
            "text": "Everybody here is so fricking nice I swear, service is top tier, our server Matteo was excellent to say the least! This is my new italian go to spot"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWaWNsZHdjVTA1VVVacllteERSMlZPVjBGRFdYYxAB",
            "text": "As soon as we got in we knew we were in the right place. The whole staff was so sweet and friendly with us and specially our server “Matteo”- that guy loves what he’s doing over there. We will definitely come back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sWmRqUkNSMjUzWkdaR1J6TTNSVzF4VkV4amRXYxAB",
            "text": "Not well managed, mid food. After making us wait 20 minutes for our RESERVED table to be ready, they didn't even apologize for seating us so late. Mind you there were plenty of tables empty and had EXTRA tables they could set up. We had to tell 3 separate waiters about the situation and all of them were unbothered. One of them even said \"it's ok\". No free food or dessert to apologize either. Then, after we FINALLY sat down and ordered our food, the food took 30 minutes to arrive (literally 3 pasta dishes, which is the entire menu??) the pasta was undercooked and hard + it was swimming in grease. Don't ever go to this place. Bad food and bad management."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oNVkxQkZlVVl0TW0xVFJEUm1SVzFCV0VNNWRGRRAB",
            "text": "service was impeccable and the ambiance was great"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MFZGQjNUbnBGU0dGR2NtVnRXRFJYUVhVeFQyYxAB",
            "text": "Just found this beautiful amazing Italian placed owned by Italians with truly good and fresh products , it’s delicious thank you for this experience"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxS2QwUmFZbU51YW5kTWVqTk9PWGxvVjIxcU1GRRAB",
            "text": "banger food guys - give it a try"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5WldteGlOa0prWDBOTE5rMWpWMk5xVWpOS1FrRRAB",
            "text": "We LOVED Giano! Incredible food made with so much love and care. Wonderful, attentive, nurturing owners that make you feel like family. Every dish we had, from appetizers to mains to a sensational dessert, was spectacular. I’m so sad I don’t live in NYC anymore — I would make this a regular spot if I was in town!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGdFpuVm9jR0ZYTmpoT2RVTlhOVlp0ZUd0TFVsRRAB",
            "text": "Stumbled upon Giano on a rainy Wednesday evening and it turned out to be such a gem.\n\nThe food was very good and very well priced. homemade pastas and tasty appetizers that felt authentic and comforting and very fresh. The vibe is cozy and intimate, making it a perfect date night spot.\n\nWhat really set the experience apart was the service. Our waiter was incredible-warm, entertaining, and so passionate about Italian food. The way he described the dishes made you want to try everything. He’s honestly one of the reasons I’d come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWlQzSmhVbVpvWkhjdE9USTJjWGhQZFZod2MyYxAB",
            "text": "Went to Giano’s on a Friday night and it was amazing - will 100% be back. We loved our server Marco who helped us pick a wine and part of our meal. The food was amazing and fast and the service was a 10/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psRk1UbEZNVUZLUzA5MlZXMVVZazFrT1ZsV1YxRRAB",
            "text": "This restaurant was amazing! I only had the spaghetti and meatballs, and it was the best plate of spaghetti in my life!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWRGNXczRiSHBFWTNwdVQxaEtaM1V6ZEZRNVUxRRAB",
            "text": "Excelente atención de parte de su encargado y recepción .\nMuy ricos platos , la bebida no estaba bien fría .\nEl lugar bien ambientado , un poco ruidoso .\nMuy buena relación precio y calidad .\nNivel de gasto sin postre con tips , 40 dólares por persona , sin vino\nDeberían ser un poco más eficiente en el tiempo de preparación de los platos"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twV05IUTNSVU4yZWtsU2JsOHplVmhzYTNveE4xRRAB",
            "text": "Best Italian food I have had in the US, which makes sense when you learn just how fresh/authentic their ingredients/cooking is... The truth is, this place would have gotten a high rating for their service/atmosphere alone - such amazing people!\n\nOur party of 4 shared 4 pasta dishes (for variety) and 2 Appetizers and were blown away. Add another 2 bottles of wine and the bill was still not high whatsoever. To say this place is a bang for your buck would be a massive understatement.\n\nShoutout to Marco who stepped in last second to wait tables and took care of us. Potentially a top 5 human being of all time.\n\nTill next time Giano!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wek9XbENiMHhrUW5RdGFqZEVkWEkwZHpaRmIzYxAB",
            "text": "We were in town for a few days and after seeing a Broadway show, I asked my New York friend for a great Italian restaurant recommendation. He suggested GIANO on 126 E 7th St. Although it was a bit out of our way since we were on 42nd and 8th, we trusted his taste and took a cab—and I’m so glad we did.\n\nWow! He couldn’t have recommended a better place. The dishes were absolutely delicious, full of flavor, and beautifully presented. Paolo and Roberta were incredibly authentic, professional, friendly, and caring. The atmosphere was so relaxed and welcoming, making the entire experience even more enjoyable.\n\nBelow are a few photos of the amazing dishes we ordered. This place truly deserves 5 out of 5 stars. Highly recommend it to anyone looking for an authentic and memorable Italian dining experience in NYC."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQR05sZlRsdExtN1VBEAE",
            "text": "Absolutely delicious! Best pasta I’ve had in a while , bruschetta was also absolutely yum and so was the wine"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQTFc0TUd1b0lHczJ3RRAB",
            "text": "Amazing food and service!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKSFNxSzZMdTlTbnRRRRAB",
            "text": "Outstanding service and food. The waiter was a great spokesman who knew the dishes, and was a bonafide sommelier in his own right."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJS2FrNlhCLXBtM2F3EAE",
            "text": "Phenomenal service, phenomenal food, phenomenal wine. If you want Italian food just go. Great, good, you got it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvemQ2NVF3EAE",
            "text": "Skip it - The food was barely just ok. bolognese sauce was one of the worst i’ve had. Service was poor. borderline obnoxious waiter. Bread served in a bag, cute but not very good."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbU82aVlnEAE",
            "text": "I got the homemade spinach and ricotta ravioli. It was amazing!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3bHVyRV9BRRAB",
            "text": "Amazing food, truffle pasta was fantastic and the tiramisu was fluffy, creamy and delicious!\n\nI had a great time for my birthday here!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ak8zaWlRRRAB",
            "text": "this food reminded me of the service, quality and taste of Italy. You can tell the ingredients are high quality and authentic, if you can’t, then I firmly believe you’re too Americanized and used to the most basic and bare ingredients and sugar in our foods here. This place is beyond delicious and the service is exceptional. This place is well priced for what you get in my humble opinion. The carpaccio was thinly sliced and perfectly cured with shaved Parmesan atop ($19) and the Spaghetti and meatballs was incredibly flavourful ($23). Yes, they serve you bread in plain paper bags and plain evoo literally very similarly to Italy. I’ll be back!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdUxMaUFnEAE",
            "text": "Absolutely delicious food. Atmosphere is fun and the hosts are lovely."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRa2FpMWdnRRAB",
            "text": "Our first impression was the absolutely lovely and warm staff. Food was delicious. You can taste that everything is made with fresh, simple ingredients which unfortunately is so rare nowadays!! 10/10 experience, we will be back!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaWJUVXJ3RRAB",
            "text": "The gluten free pasta here is amazing! Great vibes and service. Roberta at the bar really made it such a great experience!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMXR2TTNnRRAB",
            "text": "Like Lisa Singer said in another review, I have ZERO idea how this place would get over 3 stars anywhere but especially New York City. Many jarred sauces are better than what we had here - we were asking ourselves if this was frozen Costco food. The service was lacking, certainly not polite save for the hostess at the front."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncUliTFRBEAE",
            "text": "We used to live in NYC full-time, and now that we are in Texas, every return trip to NY must include a visit to Giano.  All pasta is freshly made, and you immediately taste it.  Amazing food quality and service. The proprietor talks to you like you are his long-lost friend.  The atmosphere is quaint and pleasant, so if you are looking for a bougie place, this isn't it.\nHighly recommended!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBeWV5NmtRRRAB",
            "text": "YUM!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNmRlX3lRRRAB",
            "text": "It is our favourite Italian spot in the city. It has a warm, inviting ambiance with great food. We take anyone who visits the city here for their authentic New York Italian experience. 5 stars!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmZ1pQOVJ3EAE",
            "text": "Some of the best Italian in the city. Low key / no frills atmosphere with excellent service. The pasta was fresh and al dente and sauce was out of this world. I really loved the tiramisu which was not too sweet but creamy and delicious. Everything came out fairly quickly considering how busy it was. I’ll be back for sure!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmanNMbk9BEAE",
            "text": "Tremendous food, phenomenal tiramisu, amazing staff, this place has everything I love about a restaurant.\n\nNot at all pretentious and the perfect place to hang out with your loved ones with a plate a pasta and a bottle of wine."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2OHItVEhBEAE",
            "text": "I'm REALLY confused how this place has great reviews. The service was awful and the food made us sick. A server didn't come to our table until 20 minutes in. The 'server' was wearing a black hooded zip up sweatshirt and jeans, extremely casual and really odd. They also handed us a brown paper lunch bag with COLD bread in it. I was really surprised. I've never seen that in a restaurant. Zero effort to heat the bread or put in a bowl. Not to mention the tables are SO close together that the people next us ruined our dinner because they were talking SO LOUDLY. We came home and actually got SICK from the food. Look, I don't have a sensitive stomach at all so something was really off about this place. I can't pin point what exactly made us sick - and all we had was pasta dishes: The butter sage ravioli and the butternut squash special. Please avoid and go somewhere else!!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQbmVpMVFnEAE",
            "text": "Giano is my go-to Italian spot in the East Village. The owners from Milan bring authentic flavors to every dish, and the warm, welcoming vibe feels like home. The Rigatoni Con Salsiccia is a must-try—I’ve ordered it countless times, and it’s always perfect.  Giano is a true neighborhood gem!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzOUxtSE5BEAE",
            "text": "Giano was a delicious and fun experience. The owner who served us was lively, friendly and hilarious. He made fantastic suggestions and we ordered the specials of the night including the burrata appetizer and the pasta carbonara entree. Both were delicious, but the pasta was amazing!!! We didn't have time for dessert which was sad as we had to run to a show, but I'd love to come back to try the tiramisu!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzaTZQZjl3RRAB",
            "text": "It was simply perfect. Authentic Italian food 100% and you can tell the ingredients are of high quality. Bravi!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcEtlb0t3EAE",
            "text": "We were a table of 6 on a Saturday night with a 7PM reservation. Understandably this is a busy time for any restaurant.\nWe placed our orders for both the appetizers and 6 plates of pasta altogether at 7:10.\nAppetizers arrived 15 minutes later. 5 pasta  plates arrived at 8:40, the 6th plate arrived at 8:45.\nAcceptable? You tell me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMU5PckVnEAE",
            "text": "Excellent food and service!\nI’ll be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuN0tfc09nEAE",
            "text": "This is my go to for a cozy quick Italian meal. Very easy to get a table and the service is always great!\n\nFamily run with warm vibes"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNk9YQXBRRRAB",
            "text": "Excellent food, service and ambiance."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdHZLX0RnEAE",
            "text": "Amazing food and hospitality, will be back again soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMXRYVmV3EAE",
            "text": "I kind of feel like I need to gatekeep this place but the service and food are so amazing it deserves to be wayyyy busier than it is. Our server Mattéo was so nice and knowledgeable. We went on a Monday night and it was so cute and quiet, we got seated right away. The whole menu is amazing it’s so hard to pick what to get. The burrata appetizer special was incredible, along with the homemade pasta dishes. I highly suggest going with someone who doesn’t mind sharing because you definitely need to get one red sauce and one white sauce pasta. Really great wine list and the prices are great!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINk8yVm9nRRAB",
            "text": "Very cute and delicious Italian spot in East village. Everything we tried was authentic and well made, and our waiter had a great wine recommendation for exactly what we wanted! Staff is very friendly as well, will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3NXZ6TTBnRRAB",
            "text": "Absolutely incredible food and the best customer service I’ve ever received. HIGHLY RECOMMEND!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3aHU3bTBRRRAB",
            "text": "Great place. The owners make you feel at home."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3MzZXY2lBRRAB",
            "text": "Delightful food and very amiable staff. Heavy emphasis on pasta above most other dishes. Good appetizers too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3N3JtVTZRRRAB",
            "text": "In the East Village’s heart, Giano is a cozy Italian spot serving delicious homemade pasta dishes.The staff is very friendly, the food is fresh, and they boast a solid wine list.\n\nGiano is one of our favorite Italian restaurants in NYC! And we don’t say that lightly…\n\nWe first found Giano when apartment hunting back in 2021. It was one of the few restaurants offering indoor seating at the time as things reopened after COVID restrictions. We’ve been over a dozen times now!\n\nWe love the burrata, Tagliatelle alla Bolognese, and Rigatoni con Salsiccia!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURicjdMMW5nRRAB",
            "text": "Giano is a cozy Italian spot with warm mood lighting located in the East Village.\n\nI was surprised by how much I enjoyed my meal - I got the tagliatelle bolognese, and the pasta was fresh and cooked to the perfect texture. The tagliatelle was perfect in its thickness & chewiness, and the sauce had depth to it! While I cannot speak for the other dishes there, my friends all enjoyed their meals as well.\n\nOur waiter was attentive & humorous, and added to the dining experience as well.\n\nOverall, a solid Italian spot that I would definitely return to!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyOC03Y3FRRRAB",
            "text": "The restaurant has a nice and cozy atmosphere and the waiters are real Italians and are all friendly and efficient. That’s the good part. The food we ordered was good but nothing to write home about. Every pasta we ordered was a bit heavy on the salt. In fact the best part was the Appetizers we ordered.\nIts a nice enough place but we’d probably won’t come here again."
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxd2NiNTlnRRAB",
            "text": "Wir hatten unser Weihnachtsessen mit der Familie in diesen tollen Restaurant. Wir hatten reserviert und das würde ich auch hier empfehlen. Der Service war sehr aufmerksam und professionell. Es gab eine sehr gute Weinberatung und der ausgewählte Wein schmeckte auch hervorragend. Alles Speisen waren sehr gut zubereitet und schmeckten wirklich sehr gut. Als Dessert hatten wir leckeres Tiramisu. Ich finde es gut, wenn wie in diesem Falle Italiener ein italienisches Restaurant betreiben. Wir kommen sehr gerne wieder."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxM0pUd01nEAE",
            "text": "Such a fantastic restaurant.\nWe we‘re here on Christmas yesterday and had a super delicious meal.\nWe had burrata, calamari, lasagne and the best ravioli I‘ve had in a long time.\nThe service was super. They were so friendly and made a good job. They just do it with passion.\nAnd the interior is super comfy.\nI can just recommend to try this restaurant out (especially the ravioli)."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvbDdQRzNnRRAB",
            "text": "To say that the food here is amazing would be a complete understatement. I was with a party of 5 people and we each deliberately ordered something different on the menu to see what the quality of food was like. Needless to say, all of us…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsa09hWFNBEAE",
            "text": "My favorite neighborhood Italian spot. Every pasta I had has been fantastic and I love the complimentary bread. Also have a great affordable wine selection. Highly highly recommend for a date night."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxb3ZMSlVnEAE",
            "text": "Homely Italian restaurant with Italian sound, Italian aroma and Italuan taste.\nWe ordered a Chianti wine that accompanied the excellent dishes.\nThe homemade pasta was excellent and the sauces Met the pasta with love.\nThe Italian atmosphere is refreshing.\nGIANO is highly recommended."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKdjRQSGJREAE",
            "text": "Incredible food with quick, homely service. Both rigatoni dishes we got were hearty and delicious - highly recommend as a first/second date spot or lowkey small group dinner!"
        },
        {
            "date": "2년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNzg2NHVnRRAB",
            "text": "Sehr herzliches Personal und fantastische Pasta! Eine der besten, die ich in meinem Leben gegessen habe und viele in Italien übertroffen hat. Das Tiramisu war auch traumhaft. Allein für diesen tollen Ort würde ich wieder nach New York kommen :)) Wein auch sehr zu empfehlen!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDaGVuVWtnRRAB",
            "text": "Always the best homemade pasta dishes equal to any in the city. The pleasant and efficient service makes the dining experience a great time in an open and safe atmosphere. Try it you’ll like it!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNTVHYWFREAE",
            "text": "I went on a Saturday night. I strongly recommend making a reservation to ensure you get a table. Also, if you are not fond of truffles, this is not the place for you. I had the Rigatoni con Ragu di Salsiccia al Tartufo which was delicious and featured in the pics below. I also had the broccoli rabe. The wine list is pretty good. I sampled the Port and Cabernet and had a Bellini. This place has great ambiance and relaxed atmosphere. The staff were attentive and engaging."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5bkpIdlRnEAE",
            "text": "Excellent food and great customer service. The person who took my order on the phone was jovial and friendly. When I arrived to pick up my food the place was packed with people. The food was excellent and at a price comparable to the…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRcXZ1MzZnRRAB",
            "text": "What a wonderful place! My parents, sister & I dined here and loved everything about Giano. The ambience is so nice & cozy, the staff was friendly and did everything with a smile & the food... so so delicious!\n\nWe started with two salads, which we all split. We got the 'Insalata Mediterranea' and the 'Insalata di Rucola e Parmigiano'. Getting two salads and splitting them amongst the four of us ended up being the perfect amount. The salads were very generous portion wise.\n\nFor mains, I had the four cheese gnocchi, which was to die for! I tend to order gnocchi whenever I see it on a menu and this may have been the best I've ever had! My sister also ordered the gnocchi and felt the same way. It's so soft it nearly melts in your mouth. Truly delicious. My dad ordered the lasanga, which he also raved about being just wonderful. My mom wanted eggplant parm. It's not listed as a main course, but instead an appetizer. The waiter explained the pieces are pre-cut, suggested she start with one piece. One was plenty! It was a similar size slice as my dad's lasagna. Eggplant parm is her favorite, and she was happy with her choice!\n\nI was pleasantly surprised at how well priced this place this is. The pastas and sauces are all homemade. All of the entrees were under $18 and generous portion sizes. We really wanted to have dessert, especially after reading how amazing the tiramisu is on Yelp, but we were much too full.\nDinner at Giano was the highlight of our day in NYC! Thank you thank you!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtdnVEMUh3EAE",
            "text": "Delicious Italian food in a cute spot in the lower east side. Found it randomly after walking from a nearby happy hour and craving some Italian food. Confirmed if it was a good place on Google/Yelp and had good reviews.\n\nOrdered the Pasta Al Pomodoro Fresco (DELICIOUS). Very good service and sat outside in the garden area which is lovely in the evening.\n\nThey even gave us complimentary bread. Will definitely recommend and come back with friends or for a romantic date night!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNjZLeTF3RRAB",
            "text": "Amazing food, service, vibes. Authentic Italian hidden gem that I will surely be returning to! Get the tiramisu, you won’t regret it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMM0l1SFpREAE",
            "text": "Delicious food and friendly service. I’d definitely go back. Great gluten free pasta too!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJdlpxV2tBRRAB",
            "text": "Delicious pasta dishes, 2 out of 5 are vegetarian friendly. the restaurant is fairly small, so waits can be long, but there's bar seating."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtOEwtZmh3RRAB",
            "text": "Very romantic Italian spot with very friendly staff and great food. The pasta with mushrooms and white sauce was great, as was the bruschetta and the tiramisu."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHZ3FpT1ZBEAE",
            "text": "It's always a bit awkward to leave a poor review when the owners are so pleasant and nice but alas, these reviews won't be useful unless we're honest.  I ordered the tagliatelle Bolognese. It was just ok. Better than pasta from your corner…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXeHZpemlBRRAB",
            "text": "Spectacular food! Beautiful dining space. Every dish was on point. If available, you HAVE to try the octopus with mash potatoes. We also had the lasagna and salmon! Everything was served hot and fresh and don’t get me started on the…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXalBMMFdnEAE",
            "text": "Beautiful restaurant, delicious food, and friendly staff. Went here craving pasta and they did not disappoint. I asked for a pasta with no speck and they accommodated my request and it took nothing away from the pasta, was still delicious.…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJOXNPVlNREAE",
            "text": "Phenomenal\nThe food, the wine, the service, the authenticity, down to the jazz music background music selection. We came late night on a Tuesday but nothing short of amazing\nThank you!"
        },
        {
            "date": "7년 전",
            "language": "ja",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRczdQNm1RRRAB",
            "text": "素敵なイタリアンのお店でした。お店の奥の中庭で食事もできます。   パスタも本格的です。ティラミスのお持ち帰りも できました。"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4MnJmLUJnEAE",
            "text": "An absolutely fantastic dinner. Homemade pasta, incredible atmosphere and the best staff. Places like Giano is what makes east village so incredible"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcWNxaUV3EAE",
            "text": "Authentic Italian cuisine with good service. Our server was great and helped us choose our dishes. The spaghetti pomodoro I ordered reminded me of being in Italy, it was so fresh."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxel9yOVBBEAE",
            "text": "Oh...my.... God! Authentic, delicious, wonderful staff!!!!  I am in AWE!!! this is delicious. I have almost no words for how good this was. Prices are very reasonable!!!\n\nI wish I didn't live in Texas because this would be my go to spot all the time."
        }
    ],
    "reviews_count": 75
}