{
    "name": "Poco NYC",
    "place_id": "ChIJfzEPgnhZwokRhw7PfinbuYc",
    "grid": "MN3",
    "address": "33 Avenue B, New York, NY 10009, USA",
    "rating": 4.3,
    "user_ratings_total": 1454,
    "phone_number": "(212) 228-4461",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvNVFUWXpUV010VUZKblRVZzJiazlvYzFoUVoyYxAB",
            "text": "Austin was a wonderful server, was super sweet and was the best!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWMmFWRjRja1ZCZUc5V04zRTJSbHBIZURCc1VHYxAB",
            "text": "Austin was a wonderful server and made our night! Great vibe"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4elVqSnJNa3BSYUVoclYyTXlaVU4yUXpGNGRHYxAB",
            "text": "I attended their pumpkin carving event, which I found via Instagram. My friend and I had a terrible experience and I would not recommend going here, especially for an event.\n\nA few days before the event I went to check the post details, but the original post was removed from their account and a new post is up with different dates and prices. Many people, including me, left comments expressing confusion as to if our tickets were still valid. They said they had to add more dates due to high demand, which is understandable, but why different ticket prices and removal of posts? That was the first red flag.\n\nAt check in for the event, we are told we have to pay another $5 to carve the pumpkins. We asked why and even showed the hostess that on Eventbrite it says everything is included. Her response was “well everyone else just paid the $5 you’re the only one saying anything.” For her to have such an attitude for their discrepancy is very unprofessional and unwelcoming.\nIt makes no sense for carving supplies to be included but not the pumpkin. If someone does not want to pay an extra $5 they are then stuck with a non refundable ticket having to pay for supplies they didnt use. Seems like an at the door money grab to me.\n\nWe then asked if there were specific drinks included in the open bar or if we could get anything we want from their regular menu.\nShe says yes we can order whatever we want. However, when we tried ordering pumpkin espresso martinis we were told that the open bar is only for well drinks, wine, or sangria. Another disappointment.\n\nThe night turned around as I ended up winning second place in the pumpkin contest, and signed my email on a piece of paper for them to contact me. I was told I would receive an email on Monday (Oct 27th) about how to claim my prize, which was a margarita tower. However, I never received the email and I checked my spam.\n\nDays after the event, I see more instagram posts advertising the same event- again with different prices. One post said the price was $50 and a few days later the next post said $60. I dont even feel the event was worth the cost when I paid $40! I commented on one of the posts explaining that I never got the email about my prize and no one ever responded to me. The posts were then deleted and I still have not received the email about claiming my prize."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsM1FUQnZWemxzU1hjMk5UTmtNVGsxYW10QmQxRRAB",
            "text": "We had the best time here - all thanks to our lovely server, Avery! She was so attentive even though it was busy and made sure we were constantly taken care of. She had a great energy that made our afternoon super lively and fun. The cherry on top was the food that was super delicious! We will definitely be back to see Avery"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQ1lXTlVjblZ2ZFRNd00wRnpUMjFVTlVkbGRHYxAB",
            "text": "Came here for an event and had a terrible experience, would leave 0 stars is possible.\n\nI booked the pumpkin carving event which was posted via Instagram and specifically stated everything including supplies as well as open bar was included with the ticket.\n\nThe week of the event I notice the original post is removed from their account and a new post is up with completely different dates and prices. Myself, and others in their comments were very confused as to if our tickets were still valid.\n\nUpon arrival to the event we are told we have to pay another $5 each to carve the pumpkins. When we asked why and even showed how on the ticket it says everything is included, we are told carving supplies are but not the actual pumpkins. Why would i pay for supplies but not the actual pumpkin? And if i didn’t want to pay the extra $5 i would still be getting charged for supplies i didn’t use which makes no sense. When we ask about this, the employee just acts annoyed and said “well everyone else is just paying the $5 soooo”.\n\nThen we ask if ANY drinks on the menu are part of the open bar, to which we are told yes. However when we tried to order espresso martinis, we are told that is not part of the open bar and only a small selection of drinks are included in the deal. Of course the lowest quality drinks.\n\nI emailed the contact on the website to explain my disappointment with the experience to which I got a very unprofessional reply. Lack of correct grammar and just being told it’s still a good deal. Despite if it’s a good deal or not, it is not the deal that was advertised or that i bought a ticket for. Especially when the tickets are non refundable.\n\nWill not be back and would not recommend."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poMkxWTTNkbXB4WldVd1dGcHhOMU50Y0VKelpXYxAB",
            "text": "I quite literally don’t remember the last time I had such bad service in New York. Mind you I’m in the hospitality industry so I know how much shit can go sideways. So after 45 minutes of waiting for our 2 entrees (a burrito and eggs Benedict) I want up to our server to ask about it…her response “oh did you want me to cancel”…I was beyond myself but kept it professional so I just asked her to go check how much longer it would be. She returned and said it was going to be an additional 15 minutes. No apology no empathy. I went back to our table and waited for someone to come to ask for a manager. To my biggest surprise, the same girl who just said “do you want to cancel” comes up to us…..again no apology no nothing. Long story short it was an absolutely terrible experience. AND mind you the food was maybe a 3 out of 10 at best….Bill was crazy overpriced with tip included"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WNmFuSlBhMEY1UW5kaWRYVkJVVkpoT1VNMVZYYxAB",
            "text": "So good!!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFNWVrdDBiRE5wYmpKT1RIUkVXbXgwVEV3eGEzYxAB",
            "text": "i love picks nyc everyone was so nice"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twd01GbG5VRm8yTTFCTFV6SlFkVkpwZFhwRVlsRRAB",
            "text": "so so amazing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTmRtMXdMV1ZTZFRSdVNscFBhRlpDUlVkeFVYYxAB",
            "text": "It’s the first time being here, and it’s also the last time. We walked passing by it on Saturday morning, and it looked fun with music and open space. We ordered steak&egg and the Benedict with lobster. The portion was very small. Steak& egg was okay. The benedict got done wrong twice. It missed lobster the first time and missed the guacamole the second time. The Benedict was served with corn bread, which tasted a bit weird for me. No one paid attention to us even though we were seating right near the door. Also, it doesnt make sense to me that they automatically charge 20% tip for all tables. To be honest, I dont feel like the service was worth 20% tip even though they are nice people. In the end, i was waiting for my partner in bathroom and the server came to clean the table including our water cups. We didnt even stay that long for the meal. I think it was just less than an hour. Anyway, i dont recommend people to go here for food. However, the atmosphere seems fun."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jdGJVNURjMEl0VXpSck5XMUdjblZYYXpSaGJIYxAB",
            "text": "Went for bottomless brunch and it was such a good deal. There are 4-5 drink options that you can switch between and you got an entree. Hash browns and fresh greens were sides for every dish, making the meal perfectly balanced. Staff were awesome and always present when needed!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toME5uQlVVVGxCVWt4T1VHOUROR2hHYTNKWmRWRRAB",
            "text": "Would definitely recommend for brunch. Avery was a great server!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pad2JqQlVkbmhNVFVOTmFsQm5XbkkxUlZSTVEyYxAB",
            "text": "Amazing experience!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMVNtcHFXRGR2Y0hVelNsOUhjRUowUzNOWlFsRRAB",
            "text": "Great food great deal!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxT1VYRnpNSHBsV1RCc2QxRnlha3R3ZG5KNGFXYxAB",
            "text": "Turn up"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkSFNVSkdRVXN3VnpZelgxRXpZa0pVYjFsdmFXYxAB",
            "text": "great place, great drinks"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WcVYwSjRVM2RRZEVKbFYzQXRia1ZUZVhSTk4wRRAB",
            "text": "Great bottomless deal, wonderful service! All the portions are generous and the food comes quick. Would recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcGVGVlBWekpETTFsUFVFZFRiRWhpWWxSTFQxRRAB",
            "text": "Happy hour food is so good especially for the deals, the marg pitcher creeps up on you after a while and is def worth it! DJ on Thursday is also so good, kept the vibes going all night long with hip hop, r&b, and even freestyle throwbacks"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSWJWRmlXbkJIZEd4bVJVUkJhblUwTlcxblIxRRAB",
            "text": "Dj is amazing"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SaWF6RkhkbDlNWWtOSFIxUkRSbmRGVjNWeWNYYxAB",
            "text": "Awesome time visiting from Belize. Food, music DJ was great… love it"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkSGFsOVhZV1ZXYW1wV2NqVjBkMDl0ZWxjNGVIYxAB",
            "text": "Tea drinks at a tea price"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOV2FrSjNibFptYlVSTmNFOWhTMkY2Y1hoMWJGRRAB",
            "text": "Great DJ AND FOOD PRICES ARE GREAT ON THURSDAY"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjd1dsSmpRMk10Vm5SNVUxTXdUWFJ5UldscGNYYxAB",
            "text": "I love poco it’s my favorite place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkeWFrVlBTbDlzUTBoRE9HZEZUMUp2YkRKbVpuYxAB",
            "text": "Awesomeness"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGcFUwUjVWRTF5ZUZONFRtMUhOVGhOTFVOMGRIYxAB",
            "text": "My partner & I had a great experience here; the food is fresh and prepared well, and the service was great. Our server, Jimmy, was very attentive and friendly- we will surely be returning!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wU2QzaEdSVjlYWVdvNVVWSlNlWGg2WkV3MlZYYxAB",
            "text": "Fun spot good music and wonderful service. Food was delicious everything was great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQ2MyTk9TSFV4TlhCeVZGTjRRVTVxVW14bWRWRRAB",
            "text": "Poco is so much fun!  They always have amazing events and the staff, drinks, and food CANNOT be beat!  We won a happy hour there for 10 friends nearly a year ago and missed the original window to use it - Sara at Poco and I texted (even though I had to reschedule 7+ times, Sara was SO patient!!!) and she was incredibly flexible and let us use it way outside the original window.  We finally redeemed it last night and Avery at the bar was so nice to us and made us delicious drinks!  I always look forward to an excuse to come back here, and can't wait for their next trivia.  Would rate 6 stars if I could!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paaWFsaHBXbVZ6TjFCcFQxWmtTRk5ST1ZneFVHYxAB",
            "text": "Drinks were ok but the food was good and the music was great"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4NVQyUlpXa3M0V1hoRmRIbEVNVlpyYzNwNk9XYxAB",
            "text": "Had a great time at Poco! Greatly enjoyed their happy hour and Grace was amazing! She was quick and the sweetest server. Will definitely be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSkxXcFdUVU00TWtka1IwdGplVTFZWmkxaVFsRRAB",
            "text": "Avery is awesome"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZNWQzZGZjVjkwWlVOelJrazRjRmt6VkV0S1EzYxAB",
            "text": "Over all great,"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JelNGTkNOVXQ1VjBjNGNuQnFibEJxWjJoeVdsRRAB",
            "text": "Bottomless brunch serviced by Michelle was the best experience!! 10/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUUxUWkxYMlp3ZWpGTGFrVldaa1ZoT0Y4emJsRRAB",
            "text": "Michelle our server was incredible, will be coming back for her service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kweFRFRkZka3BpVTFGTldUaHBOMGR3VW1GRE4wRRAB",
            "text": "Bottomless slayed"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SYVExVTJiMGxQTUdoc2NXbFZhbFpKWkVGUVdWRRAB",
            "text": "Had SUCH an amazing time here!!! Had my birthday here and it was such a blast. Service was amazing and food was DELICIOUSSSSS!!! Sara was such a pleasure to work with. Will definitely be back!!❤️❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5alZHUlZUbE5MVTFFelVERnlTMFZ5TldabmRVRRAB",
            "text": "Got it — here’s the revised review without mentioning a DJ:\n\n⸻\n\n⭐️⭐️⭐️⭐️⭐️\nHands down the best bottomless brunch in NYC! 🍳🥂 From the moment we walked in, the energy was incredible — fun, lively, and perfect for a weekend vibe. The staff is super friendly and attentive, and they never let your glass go empty. Highly recommend booking in advance because this spot is always popping!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pabVIweEJNMDFpVW1oMlREbE5hMlozT1VwYVVtYxAB",
            "text": "went for a friend’s bday party and we had fun but it was almost $90 per person for 2 hr “open bar” but rlly they just made us choose 3 drinks to be brought downstairs that barely had any alcohol whatsoever in them and then were very very rarely replenished. it was for 30 ppl. and they were late bringing them… so we got like maybe 2 drinks each that were mostly juice and some appetizers for $90 each….??? lmao not worth it whatsoever pls save ur money"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wT01uQkZlbE14WkZKeExXOUpWRUZqUXkxTVdtYxAB",
            "text": "Terrible service. Would not recommend going here for a fun boozy brunch"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCTFJuTmlTV1pHVXkxSFoxcFVSVkUxU2pkcVVrRRAB",
            "text": "AMAZING DJ"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwNWNVRTRWMVJoU2pKWGNrRlFMV2Q1VTNreVJGRRAB",
            "text": "Did not know they had a dj and happy hr till close on thursdays! Lit af!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0d1ZXOTRWM1Z5ZEdOR1MwNUpMVW96WjBKVE9IYxAB",
            "text": "Calmari was bomb, Drinks are 👌🏾👌🏾👌🏾. DJ on thursdays is on point. 👌🏾"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kTlUzTlVkR2hZYjBOaVoxTmlVVmc1TWt3elJGRRAB",
            "text": "The best"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aR1NIaFVOVzFyTmpoU1ZTMVRiVWRuVldScGRXYxAB",
            "text": "great spot! good happy hour deal"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25walJISTBSM28yT0ZKNVpuaEhOMUZWUTNZNGQwRRAB",
            "text": "Great music and amazing staff"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ORU5sbHVVMWt6T0V3MlJXNUpRWE5VUkZkSVkyYxAB",
            "text": "Dj has good tunes, the food is good, and customer service is great!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5a1RVcFpXR1ptVWpCcE0wVlFaMEkyU3pSTldGRRAB",
            "text": "DJ 10/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WZmQzSk5ialJ0YWtGblNXMUlOMlpCYjFGNFRuYxAB",
            "text": "Best place ever. Great music. Amazing vibes. Delicious drinks ❣️❣️😛😛😛…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5YVEwZDJjVk5GZWtsalpHRmZaa1ZFU21SM1kxRRAB",
            "text": "We booked a last-minute reservation for 9 people, and the staff couldn’t have been more accommodating! Came for the bottomless dinner and it exceeded all expectations. I was initially unsure if the 5 tapas option would be enough for a group our size, but they made sure we had plenty of food and drinks flowing the entire time. If you’re looking for a fun dinner, night out with great service, this is the place to be. Super easy to communicate with and absolutely worth it!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzelgzY3RkR3d6YWpKTVVuZE1aMlZsYmpoZmRsRRAB",
            "text": "Amazing music"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTWN6aHBaRTVNTUdWYWF6YzRTVlJYYWpkNGVHYxAB",
            "text": "Perfect place for a great time with friends! Drinks are yum and food was great. Service was amazing, must visit!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRWNsVmZXbVZ5Y21WRVpsUmlWRGRrTVhKWFlXYxAB",
            "text": "First of all Tess has been on top of the service since I walked in. The French Toast is a MUST!!!! The unlimited is worth it because this place isn’t delaying refilling the drinks. Tess has been attentive and so helpful the entire time I’ve been here. Highly recommend this spot as I stumbled upon it due to a wait time of almost 2 hours from another brunch spot nearby. If you want a quality brunch and great drinks, this is the place. They have so many options so you’re not restricted to only mimosas. 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaU1ZDMHdka2w2V2t4UWFrdHFTbmwyU1MxaWNVRRAB",
            "text": "Extended happy hour from 5-9 on Thursdays, $2 tacos, $5 fries, and $8 sliders! Good margaritas, love coming here for happy hour with friends. They also play fun music and have a DJ"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VKdnEyTENrb29YNHNBRRAB",
            "text": "We booked a birthday party with the event manager Sara, only to show up and find that the staff had no idea anything was scheduled. The event, which was planned weeks in advance, was somehow not communicated to the staff.\n\nThe bar was packed, nothing was prepared, and the event started almost an hour late because of the chaos. To top it off, Sara was dismissive and actually told us we could leave if we wanted to. She did not take responsibility. The only person who helped at all was Joe — he did his best under the circumstances, but the overall experience was a mess. We regret having the party here. It was embarrassing to walk into what we thought was a birthday party, only to see a completely packed bar with people we did not know. And we had to ask 4 different people multiple times to finally get what we paid for.\n\nWe had the party here after a friend had hers here a few years ago. Our experience was completely different. So so so frustrating and disappointing. I will say the drinks were good.\n\nThe attached video shows the top floor after our birthday party was supposed to have started. The event manager told us there may be a few people at the booths wrapping up dinner. The entire place was full and we only know about 7 people in this video. Wish I could write a better review but this was ridiculous."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oRlZsTTBOMW96ZHpWMVMxSklRVEZVYm1wSlpVRRAB",
            "text": "Took my daughter here for a birthday brunch! They offer bottomless options! The food was good 😊!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxbVltczVVQzFUYjBoMlJEaDJVelU0ZVZwZmJtYxAB",
            "text": "Poco is a cute spot, though a bit on the smaller side. The seating is mostly high bar stools, which took me a little while to get comfortable with. That said, the service was excellent very attentive and the food was tasty with a well-rounded menu that was easy to choose from. The bottomless drinks were strong and flavorful, just the way I like them! Prices were reasonable too.\n\nHowever, I was disappointed that there was supposed to be a Juneteenth event from 11–5, as posted on their Instagram, but when I arrived, nothing was going on no DJ, no vibe, nothing. I was really looking forward to that atmosphere. Still, I’d return if I’m in the area."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaZlNEUXRiMFkwUzNoWFpuRjFjVXBrWkhCRFJWRRAB",
            "text": "Great atmosphere and vibe live DJ on thristy Thursday is always a vibe. Food is also really good and affordable 😌"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2padFdqTlpOamhNTFRCRE9GaHpRbHBzVDBselRYYxAB",
            "text": "Michelle was the best server! She made sure we always had our drinks filled & food was so good! We didn’t have to wait for a single thing! Amazing service, food & vibes! Definitely the spot to be!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQdXFfZWVEaWZlT0VBEAE",
            "text": "Tess, Michelle and Vicente were amazing hosts!! It’s my birthday and they helped celebrate me to the max. They accommodated us even though they were closing soon. We switched the brunch reservations at the last minute, and def don’t regret our decision. The food was so bomb, the spinach and truffle mac & cheese, the French toast, the burger were all really good!! We’ll definitely be back, everyone should come it’s such a great time and a vibe!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201TlNFVlRZblJITUdWUWFtUlBkV3BKYlRSSmQxRRAB",
            "text": "Jimmy and Cierra are phenomenal. Legit could kiss them on the lips. Best service I’ve ever experience. The tacos are delish but the pitches are even bettter"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVVpXcHBXbTVNWjJkbmEwZDVWM1JzVm1rNVZrRRAB",
            "text": "This is my second time here and it's always a spectacular experience. The DJ is always on fire, the food is high quality and delicious, there's a little something for everyone. The service is phenomenal the staff is friendly and polite plus they help out with the party atmosphere. I love it here and I highly suggest coming here!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlb2Y3OW93RRAB",
            "text": "Be cautious! They are very scammer vibes with how they charge. Margarita pitcher is supposed to be $25 but they charged $30. When we called the waiter over he was like “I told u it was gonna be more.” I don’t care about the price, but his attitude was terrible. FURTHERMORE, he did NOT tell us it was gonna be more. This place is OUT to charge us more. The wings were also not that great and they charged $1 per wing. I rather get wings elsewhere.\n\nOverall I feel they were good at advertising, but our experience itself was not that great. Visit elsewhere if u can because they were honestly not as nice as they advertised on Tiktok"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kRGFuUXpSVTFrTVdaeE1teHFhRmxCWkROSk1GRRAB",
            "text": "tiara is one of the best servers so patient and kind. she came to check on us every few minutes. the drinks are super good and food, the restaurant is gorgeous and the scenery is amazing for a night out 20/10 from me."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSRVQwVmtibVJpU0Mwd0xXMUViMFJ0WjFkVldrRRAB",
            "text": "My sister and I came here for dinner and were seated promptly, food was served immediately and we were willing to taken care of. The music was top tier! Food was delicious! Drinks were good! We had a blast!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5d1dYUkNPRWhDVkVOSVRrcHNUSGRKTjBGc1gwRRAB",
            "text": "Poco Bar is a great atmosphere and wonderful place to go with your friends. My friends and I had a blast and they have an amazing taco deal for happy hour! 10/10 recommend."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcnJfZmpBRRAB",
            "text": "Great service!! The food was absolutely amazing, Armando is the best host. Definitely recommend the this spot to come with your friends or a girls night out!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoTVJtVlpkbWhNYlRWeWNYb3hMVlU1VVhaUFpWRRAB",
            "text": "Jimmy was the most respectful bartender I've ever met. Kept it super chill and was always making sure some good music was on. Definitely recommend coming here.  Thursdays are fire to come."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkM1ZWSmpkSFZzY25sWFVuSXRaMGMzUW1kMlRVRRAB",
            "text": "Poco is one of our favorite Thursday night spots. Cierra and Jimmy are so kind and have impeccable service. The drinks are incredible and never fail us. If you are looking for a perfect Thursday night party come to Poco, vibes are up DJ is great and life is good!!!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdjdqcTl3RRAB",
            "text": "They serve bottomless mimosas in champagne bottles and red & white sangria in pitchers on the weekends. Portion sizes were okay and the hash browns were the best part of the food!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMycy1tbE5nEAE",
            "text": "I was excited for their bottomless mimosas and brunch but was pretty disappointed with our experience. The staff was not very friendly. The food was barely edible and after wondering why they kept bringing what looked liked tampered…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SMlJuTmtOVWxZWmxFNVoySTRTVjl6YzIxUFRYYxAB",
            "text": "never leave reviews, but our experience at this restaurant was unacceptable and needs to be shared.  We came in to celebrate a birthday which we had pre planned with the manager sara. During the planning we discussed, everybody could order drinks and food as  pleased. When we got there we had a nice space and people ordered. The server Joseph explained bottomless but not that everyone had to do it. We only found out after the bill came that we were being charged unexpectedly -- something that felt misleading and unfair. Over $1200  When we tried to clarify, the manager was incredibly rude, dismissive, and completely unwilling to explain the charges. What made it worse was that they hung up on us when we tried to call afterward to resolve the issue. She even said she doesn't know us or what we were talking about. We even have messages to prove it.   Needless to say, we won't be returning EVER -- and I'd caution anyone thinking of going you also can be scammed."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcC1Pd0RnEAE",
            "text": "Racist staff, don’t bother going here if you’re a person of colour. Average food. Plenty of better brunches in NYC.\nWhen we arrived we were seated in the basement, despite there being seating available upstairs and outside. We asked if we could sit upstairs and our blonde white waitress refused, saying they fully were booked. The table we were sat at in the basement was infront of the aircon, which was making us really cold because we were in summer clothes as it was 32°C/90°F outside, so we moved to another table away from the aircon as the basement was empty.\nA few minutes later our waitress comes over and says we can’t sit there because they had a large booking coming and that table was going to be connected to the one next to it for that booking; not wanting to cause any issues, we moved back to our original table. A few minutes later, we see that same waitress sit 2 white guys at this table for 4 and take their order - so she clearly lied about there being a larger booking needing that table, as she didn’t connect the tables and sat 2 white guys there instead - for context, we were 3 Indian girls.\nBy this point, we were extremely frustrated and not having a good time, so we were ready to leave, but I went upstairs and checked for any suitable tables of which I saw 3 empty and asked another white waitress if we could sit there and she said no, go back downstairs.\nI went back downstairs, and my friends and I hadn’t ordered food at this point just our sangria, so we were contemplating leaving until a mixed race black waitress came over and said “you guys don’t seem like you’re having a good time, is everything okay?” And we told her what happened, and how we wanted to sit upstairs or we were leaving, and she literally moved us upstairs within 2 minutes.\nOur initial racist blonde waitress didn’t serve us for the rest of the visit; a different brunette waitress took over. We ended up having a good time and the food was decent but nothing special that you couldn’t get elsewhere.\nI definitely would not come back here or recommend this racist establishment to anyone. NYC is extremely diverse/multicultural, so it was really shocking to experience racism like this especially at one of the city’s most popular brunches."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwaGV1cnh3RRAB",
            "text": "I found the place a little bit controversial as the service is great (Angel was AMAZING) but the food is really not good. We order poached eggs with chorizo and our eggs were literally boiled eggs, chorizo we couldn’t even see in our plate, I noticed that the table next order the steak, eggs and cheese sandwich which wasn’t look at the best as well. The bottle less is worth it, the amount that you will drink will make worth it for the food. Would I come back for food or dinner? Absolutely No, just because of the food.\nThe place is super cool, facing the streets, they have large doors which can be open during the summer, giving a lot natural light to place, which I absolutely loved it. Our waitress was 10 out 10, very attentive, top service, constantly checking if we were ok for drinks, she is a great audition to the team. I absolutely loved the place shame the food were not good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Jd1lYQm9WV0UyWjFodE1YbG9lRTlJWlZKYU5uYxAB",
            "text": "Brunch here isn’t just a meal—it’s a riot of flavors and bottomless cocktails, with plates of smoky beef, spicy eggs, and pastries arriving in a relentless parade that would make any hangover beg for mercy. The staff keep your glass full and your spirits higher, while a DJ or live music pulses through the room, making conversation a contact sport. This is not a place for quiet reflection, but for celebrating life’s chaos with friends, laughter, and another round of mimosas. If you’re looking for subtlety, stay home; if you want to taste the city’s pulse, pull up a chair."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xodllVVlhVWHB4WDFsMVRYSllUa2xvUWt3M1RsRRAB",
            "text": "My boyfriend and I come at least 2x a month.. Avery has been our waitress every time she helped us answer any questions we had about the menu, made sure our bottomless stayed bottomless, and her energy is the reason we travel to come to brunch on Sundays!!! If you needed a reason to go THIS IS IT, girl deserves the best !!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaU5lTVFnEAE",
            "text": "At first I was skeptical cause of the reviews online. But once we got there we received amazing service from the waitress Eva(p.s. give that girl a raise) Them bottomless drinks was really bottomless. Never had to wait for the next round. The food was so much better then expected. Especially the mac and cheese. Highly recommend if your going out with some friends. Very good vibes there. Whole staff is incredible and polite. Will definitely come back again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZZ1o3OGx3RRAB",
            "text": "Poco did not disappoint. Our sever was Eva And she would NEVER let our glass run dry on Sunday brunch. This made me a Poco Champion!  The music and vibes are solid. I took my Godson into NYC to experience brunch and he was like “this was the best place I’ve ever been to!” Thank you so much for a great time."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMydWNEWlVnEAE",
            "text": "Kind of stumbled upon this place, but the food was great. The service was good. The food came out fairly quickly. We had bottomless mimosas - we noticed by the 2nd bottle there was definitely less orange juice.\nSooooo the French toast was EVERYTHING! Might have been the best French toast I’ve ever had… feels like now I’m on a quest to find better French toast.\nOhh and it’s cash only at the time of my visit…that was a bummer, wish they would have told us ahead of time but there’s a bodega across the street with an ATM."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCeFIzcDRaekJTZG5odWRVUm5OMUZUTFdocWJrRRAB",
            "text": "Food was fairly solid but did take awhile to come out\nDrinks were meh - we did the bottomless option and they felt a bit weak.\nVibes were good but it was sooo busy and the host was basically alone down here which I imagine wasn’t fun for her but she did great and was very friendly!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURycUpyVzZBRRAB",
            "text": "Had such a wonderful time here celebrating a bachelorette party! Gorgeous atmosphere, so bright and welcoming, good music…and the service was delightful! Our server Joe was very attentive, fast and friendly…and THe fOoOoOd…girl. So good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5RU56WlpOMVl6Y2xaNGMwRndVRkV5YUVnMlVrRRAB",
            "text": "Chill atmosphere to go for quick and GOOD drinks. Al pastor Wings were to die for. Avery our waitress was very kind and made sure we were well taken care of."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2ME9MX0FnEAE",
            "text": "The staff and manager were awesome, friendly and helpful. We went after a big storm and they made sure we were taken care of, after a few mistakes were made with our orders. The margaritas 🍹 were amazing and the sangria too. I had the pulled chicken sandwich w/egg and homefries....it was prefect....BUT the must have which I only tasted my friend's is THE FRENCH TOAST 🤤....it was so yummy and came with fresh fruit, made just right! Will definitely be going back to this spot!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNWE41dFNha2FDcmpBRRAB",
            "text": "Beautiful place, I love the outdoor atmosphere, food, prices service even the customers were great.. the music was good but then it wasn't for me only due to my taste, but others liked it. I will definitely go again. Happy hour was the bomb and we are going again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMklUMGxBRRAB",
            "text": "My husband and I came into Poco after we couldn’t get into Beetlehouse and let me tell you…. We’re glad! The food at Poco was absolutely delicious. We ordered the churrasco, spicy shrimp, wings, fish tacos and lobster Mac and all of it was amazing! To top it off, we had the best server! Joe was awesome! He recommended food, drinks and was very attentive throughout the night. I had no idea what I wanted to drink and after 2 questions Joe figured out exactly what drink I needed in my life! We’ll definitely return for the food and the service! Thanks Joe!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRMTlHX2VnEAE",
            "text": "Nice spot for weekend brunch. I'm not a frequent brunch attendee but have been to a couple places prior and many of the drinks were a bit weak/watered down so I was really happy to find out Poco's were quite the opposite. Both the Sangria…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taMlZEVTRkbVYxUlVwWVJUWXhORGN6TnpKV1FtYxAB",
            "text": "michelle is a great server! this is our second time with her and we always come back for her! she’s super sweet and efficient! def ask for her next time you come!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SRlVXTnphblJUWVVSR1RXdGZiMDF3YmtremQxRRAB",
            "text": "Had a lovely evening here! Tiarra and Avery were our servers. Both super friendly and attentive, great deals here. Will definitely be back 😊"
        }
    ],
    "reviews_count": 86
}