{
    "name": "44 & X Hell's Kitchen",
    "place_id": "ChIJ1QtpBVJYwokRUPSabwKYsyA",
    "grid": "MN4",
    "address": "622 10th Ave, New York, NY 10036, USA",
    "rating": 4.4,
    "user_ratings_total": 1313,
    "phone_number": "(212) 977-1170",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsaldEUXlXbkI1UW1reVdURTJWVTF2U1VwbFdXYxAB",
            "text": "Delicious food and service. We were 6, works great for groups up to 12 or so."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMGEyUjZXbDlQYlVsdFJubEhTVWRFWjJwWlFVRRAB",
            "text": "Food was great. Mac and cheese looks amazing but underwhelming. That was the only disappointment we had. Bartender was great and made amazing drinks."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WS1N6azJhM0o1VW10NFdXNVJlbmx0VjBSMU5IYxAB",
            "text": "Was disappointed, especially after how well it was referred by friends. A very expensive lobster dish was overcooked to the point of inedible. Our starters were fine, but the overall experience was not great."
        },
        {
            "date": "3주 전",
            "language": "zh",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwU1pVVjBObEJITUdOTFpUaDZPVTg0UXpCNlEyYxAB",
            "text": "沙拉和鲈鱼都不错"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUFpUUlpaMHh1VERWMVlXOVRaV05XYTFGdVQzYxAB",
            "text": "Great place for brunch. Slightly on the higher price but worth it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CWFNXSmxXV0ozVkRoamQzVlVURTFaWTFoYWJIYxAB",
            "text": "I will not dine where there are mouse just running free that's disgusting. Never again will I eat there."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210V1dqbFNWakp0Vms4NVJVUlFNMHBOTFdwb1ExRRAB",
            "text": "Excellent ambience, food and service! Perfect place to meet an old friend and catch up"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xseWMxcHZNR1JTWmxsUE9VazBOa2hsTFdWalFsRRAB",
            "text": "Service was great and everyone was friendly. Food was average or underwhelming. And very expensive for what was offered.\nPlenty of better high end spots for $100+"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnd2VURnpMVkJwY0c4dFJYSmxkekIxT0VJdE9HYxAB",
            "text": "44 & X Hell's Kitchen"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKaWIwZ3pUbEpEYVhCNWJ6ZzFTSGxHU2pWbk0yYxAB",
            "text": "The restaurant had a beautiful outdoor setting, perfect for a balmy New York summer evening. Our waiter was excellent—attentive, friendly, and helpful. The food was outstanding: I enjoyed a perfectly cooked salmon along with starters of goat’s cheese and a Caesar salad. The wine was also excellent. To finish, we shared a chocolate soufflé and a peanut butter–flavoured dessert, both of which were exceptional. Overall, the food was fresh, delicious, and faultless. A truly wonderful dining experience. The only negative was the bread at the start which was somewhat stale. Definitely recommend!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psemFVSmhTVGcyY1hKS2FVcFZabVpSTFROZk9XYxAB",
            "text": "Let me begin by saying that my family and I have been coming to this restaurant for over 20 years. We are locals and have always loved and supported this business, it’s been at the top of our list for recommendations. The staff is always kind, the space is clean and beautiful, and the food has consistently been delicious. You really can’t go wrong with anything on the menu.\n\nThat’s why I feel it’s important to share our most recent experience, which was unfortunately very disappointing. We came in on Labor Day weekend, excited to enjoy a nice lunch together. Shortly after we were seated inside, a large party of six or seven twenty-somethings was sat in our dining area. From that moment on, it felt like we were dining in a frat house extremely loud, literally yelling,  banging their fists on the table , laughing and shouting to each other  at the top of their lungs like they were in a school cafeteria, and disruptive to the point where it was impossible to carry on a conversation. I couldn't hear my mother who was 7 inches away  from me. The tables around us, including one with children (who were better behaved then the rude table next to us), were clearly uncomfortable as well and covering their ears from the cacophony of noise. We found ourselves literally covering our ears as well because the noise was so overwhelming.\n\nWe all work hard, and coming here on our day off was meant to be a chance to relax and enjoy a meal together and catch up. Instead, it felt like our nerves were being tested the entire time, we couldn’t enjoy our food or even hear each other speak. It was hugely disappointing and, frankly, felt like a big waste of money.\n\nWe did inform the staff, who were and always are very kind, but they did not take steps to address  or manage the situation even though they told us they had heard and seen what was happening before we mentioned it to them and that it upset them as well.. For a restaurant of this caliber, and at this higher price point, it was disappointing to walk away with a headache and fried nerves instead of the lovely dining experience we’ve come to expect here.\n\nWe truly value this restaurant and hope that management will consider how to better handle situations and prepare their staff like this in the future so all guests can enjoy their meals."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOZmRsWk9aa2w0WmxGRE1YcGZTR3huVTNkWVZYYxAB",
            "text": "Miguel provided outstanding and attentive service for this tasty lunch. It’s been on my list for awhile and I can’t wait to come back!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "fr",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxM2NHaE9NVEUxUVhWRE0yRmFhVWQxVkZaUFRuYxAB",
            "text": "Endroit sympa et calme\nLa cuisine est classique\nLe service est de qualité"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jNGN5MVlTSFJ4VW1kcE9UVjFOVWxHWkU0dFFWRRAB",
            "text": "We had a corporate event of about 40 people here. The food was superb.   They were also able to keep the food and drinks flowing, which can be difficult for a large group. We all walked away with a very positive experience and have been talking about the meal all night. I'd highly recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUVVEVnNaRXRsWjNNek1XdElYMk5zYUVobWRsRRAB",
            "text": "The food was ok, and the service was typia\ntypically cliche. 🤔"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SbFQwRkhjazVpVEcxQ1FVcHhVMDFhVERkQlJFRRAB",
            "text": "Shared 4 plates across the table cuz we just couldn't pick. Everything was so delicious and filling 😋"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTGJtWlBhR1pQWDNvd2FscGZaSGc0ZUdsR2RFRRAB",
            "text": "Fresh Flavors, Mixed Execution\n\nTucked in the heart of Hell’s Kitchen, 44 x X offers a lively spot for a night out, pairing creative mains with a reliable NYC buzz. We started with the salmon tartar, strawberry–spinach salad, and a watermelon–tomato summer salad. The salads were fresh but straightforward—pleasant, though not especially memorable.\n\nFor mains, the filet mignon with potato gratin was the standout: generous layers of potato, minimal cheese, and a perfectly cooked steak. The mahi mahi over coconut pistachio risotto was another high point, with a balanced sweetness and satisfying texture. Unfortunately, the salmon missed the mark—served undercooked and cooler than expected, it lacked the warmth and flakiness that make the dish shine.\n\nService was attentive without being overbearing, and the ambiance matched the neighborhood vibe: casual yet polished, with enough energy to feel special without shouting over the table. The bill came to about $340 with tip, which felt a bit steep considering the overall food quality.\n\n#NYCEats #HellsKitchenFood #FoodieAdventures #DinnerInNYC"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0R01YSlhkVVF4T0hkdGRHdDFOV1p2TUZWMFFVRRAB",
            "text": "Had a great brunch"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbmJsZDBjVEJmVFdORWJHZHBWVWhGYlhCSmNtYxAB",
            "text": "We to NYC to celebrate my wife’s Birthday and had dinner before seeing “Hell’s Kitchen” on Broadway.  The food was excellent, the service was on point.  My two complaints were a few annoying flies and gnats in the building.  Also the didn’t do anything for my wife to help celebrate her birthday.  No mention from the waiter or a complimentary birthday dessert. Recommend the food very good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MFEwNHpOSEppTFVGSVVHdG1VWE5UWnpCM1lsRRAB",
            "text": "Love going to this spot, it always hits.\nBeen going 3 years never disappoints."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWU1RYRkpVbTgyWDFOelRubFhXRFJvT1ZrellWRRAB",
            "text": "Damn. Went there for brunch. Sat outside. Me and my girl both got egg white omelettes and some drinks. Wonderful. What really sets this place apart for me is the service. Next level. Food was quick, lots of refills, constant yet not annoying checking the table. Love it. Will return."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poS2RGOUZWVVpXZDNObVVYVkthRFp6YWtoRWRYYxAB",
            "text": "I had a great time here with my friends. The staff were great and the owner Scott was lovely. We felt very welcomed here and taken care of. The menu was varied with something for everyone. I especially enjoyed the lobster ravioli appetizer and the filet mignon. Chefs kiss! Highly recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGeldrVTNTREJyU2tzMmVrcHhRMUJHVFZBeFpGRRAB",
            "text": "I’ve been coming to 44 & X for many, many years — and they never disappoint! The quality of the food, the warm atmosphere, and the consistency over the years keep me coming back.\n\nMy absolute favorite dishes include the lobster salad with warm vegetables, the salmon tartare, scallops, and the short ribs — all prepared to perfection every single time. These are not just meals, they’re experiences.\n\nI’ll continue to return again and again. Highly recommend to anyone who appreciates great food and a welcoming environment."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjM2FFZHROMlJLYkZWdFpEZHRUV2RNV1MxdWFHYxAB",
            "text": "We have not eaten here in a long time and I know prices everywhere have gone up but the prices at 44&X are ridiculous.  $42 for Tilapia, really? I ordered the Mahi Mahi for $46.  It was overcooked. If I am going to pay that for an entree I expect it to be delicious.  The last time we go there."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xac05UZERVWGxaVHkxMlRuQTBURGxTZVdkaVluYxAB",
            "text": "Stopped for morning cocktails. Great bartender and very pleasant atmosphere!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOVFNrTllYMWgwVURKNU0zWmlhV1V5Wm5SWGIxRRAB",
            "text": "Great location in HK for lunch or brunch."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5WU5EbEJPVkJyVGtWUk5WWTNXRFI0TWxrMVgzYxAB",
            "text": "Host was rude about 2 people in my 6 person party being 10 minutes late, would’ve rather him had said he can’t seat us than be passive aggressive about it. And food was mid"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25neGNqTXdhbGR2TjBOVVZsVmZTV3BvYnpOTlZWRRAB",
            "text": "I had a large potion of salmon, served medium which was, by itself, dry and without flavor. The accompanying vegetables were tasty. You may find it helpful to know that it is exactly across the street from a Target store."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xU2JWTnVjRE10Tmt0TVFVY3dRa1JJZEdsck9VRRAB",
            "text": "AC is off during the heatwave. You’ve been warned."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21od1pVNDFhM0pwTVhCRGIyOWFVSHB5Tm5VeVYwRRAB",
            "text": "23 dollars for eggs Benedict, laughable at best, an egg is a dollar maybe 2 bucks for a slice of ham and hollandaise (if you even make your own) and an English muffin which you purchase down the street..."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSlozaGFWbFkyWlhWTlNrSjJUbk5hYjJkaVJVRRAB",
            "text": "This place won't add a protein to a salad."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOYTY5NWJQeWU2YjJBRRAB",
            "text": "For using bathroom you need reservation. What a stupidity . The host needs to learn some ethics"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJdjFzcnpuNnRTVVpnEAE",
            "text": "Five people eating at the table and everyone was happy.  That's difficult for any restaurant to pull off.  Thank you"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLYTZqUEs0OFBLS1pBEAE",
            "text": "This was our second time visiting and the food was delicious."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJU091OXowNF9hY213RRAB",
            "text": "I went to the theatre and needed a place to have dinner with friends. The first restaurant that came to mind was 44 & X.\nWe were greeted with a friendly smile as soon as we walked through the door and seated immediately.\nThe service was great, food presentation and portion size was impressive. Lots of flavor. This restaurant does not disappoint even after 25 years.\nIt was nice to see Scott again. Looking forward to going back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wc2NqQmtiRGh6UlRFelFYUjZaMjFmZURoaVdXYxAB",
            "text": "Loved everything about this dining experience! Great atmosphere, the staff was super friendly and the meatloaf and mashed potatoes were fantastic!!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQc2NDRDlnRRAB",
            "text": "Located in Hell's Kitchen, we found a piece of heaven! Truly knocked us out last night! On a friend's recommendation, we made reservations and gave it a try. As soon as you step through the door, you realize you're in for an unforgettable dining journey. The atmosphere is great, and the service is A+. Thank you, Steven!\nWe selected  Scallops as our starter. Devine!! Every last bite was a tiny piece of heaven.  For entrees,  I went with the house special, Branzino, and my dining partner chose the chipolte and citrus marinated pork tenderloin. We're still debating on who had the more delicious dinner. Unbelievable flavor medley in both dishes.\nWe were too full to indulge in desserts, so we're headed back for a second meal here on our 4 day visit!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VMaUM1UEtnNXBxWEVBEAE",
            "text": "Food was good.\nBut the service was hell!. it was maybe the 1st day of that waiter, he knew nothing about the menu- when I asked what this come with, he said on a rude way 'it s written on the menu\". My friend tipped him, I would have left nothing. That guy does not deserve money!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOenJvLUh3OU1ETXR3RRAB",
            "text": "love this place !!!! but the shrimp taste “off” periodically.  If it happened once, not a big deal because that would be a one off. But it continued.  Good news - the restaurant is receptive and will attempt to make you whole. Just don’t order the shrimp during brunch, and all will be great!  I definitely recommend this place w that caveat:-("
        },
        {
            "date": "수정일: 5달 전",
            "language": "it",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIXzRTZVhREAE",
            "text": "Buon locale. Da ritornarci sicuramente"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VQS2FuYktEbHRydVZREAE",
            "text": "The host and wait staff fine , but the outside table by the street was loud but fun to watch , the food was just average."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvck1UOGNnEAE",
            "text": "The hands down best part of this brunch was the complementary mini muffins. They were soooo good, I’d come back just for them!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJb3NuU2F3EAE",
            "text": "Stopped in for the Sunday Brunch: Although the restaurant was packed, we were seated at our reservation time. Quick service for coffee - we needed it! Lovely muffin basket to start followed by three excellent entrees. We were then graced with a fantastic array of sweet treats to complete the meal. ADDED BONUS! We got both Scott and Bruce to sit with us and share laughs, memories and updated news."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOVBPdktBEAE",
            "text": "A wonderful place for brunch. Service was terrific and the food was wonderful. We were visiting with a friend we hadn't seen in 15 years and there was no push to to weave the table the staff was gracious and thoughtful"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOUlqYXJRRRAB",
            "text": "Unpleasant host experience here,  similar to what other reviews have stated. Would not go back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3a2ZUVFh3EAE",
            "text": "Food was excellent, my fillet was cooked to perfection, the sauce was divine. Service was good, restaurant ambiance is just what New York is all about\nSorrounded by the hustle and bustle of New York life, yet very quiet and relaxing inside."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dnUySjJBRRAB",
            "text": "Fantastic food with amazing service. Their bathroom is stunning! I had to post it on my Facebook page lol."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3b0oyVk1nEAE",
            "text": "I am sitting here crying after my experience at this place. I do no recommend this place to anybody unless you want to be disrespected at the whim of the host. I really feel like I let down people of color today because I reacted and I just know that  there are people waiting to say we are loud but the owner was just so condescending to me today. I walked in asked for table for one and I was directed to a table that the sun was pouring down on. I asked the host if there would be other seating because I would like to not be in the sun, the host was so flippant, saying there is not even a lot of sun there. That was my first sign I should have just left. But instead I stupidly asked the host for the  bathroom making sure to tell him it was  to remove the leggings I had under my pants which would certainly help me feel cooler. I realize now the host ignored my question when he turned away from me and started seating another party that had only just walked in. So I asked another waiter for the restroom. On returning from the restroom I walked upstairs and realizing the sun was very much still shining down on my seating I thought what am I putting myself through that for and I walked out, the host followed me telling me in a snide condescending voice that if I wanted to use the bathroom I could have just saved him the time. This is a white man talking down to a black woman. He made sure to speak quickly and low and turn away when I tried to defend myself. That's when I felt exasperated and raised my voice. So of course it looked like I was the loud angry black woman.  When I said I want to speak to the manager he said he's the manager. Well now it's no surprise his behavior hasn't changed. Good luck to you if you ever decide to go to this establishment maybe you will be as sneaky as him with your insults, what an awful experience"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NEk2Ykp3EAE",
            "text": "“44 & X Hell's Kitchen” on 10th Avenue is a hidden gem in NYC. The vibe is great, and the food is amazing. Scott, the manager, is super friendly and professional, great guy who made the experience even better. Highly recommend!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvNkpTQWdRRRAB",
            "text": "I've been going to this place, enjoyably, for years. It was always a solid 4-5 star experience but unfortunately I have to update my rating after today's brunch. Maybe they were just short-staffed, but the entire experience was a kind of awkward from having to wait 10+ minutes in the entryway because our reserved table wasn't ready to again waiting 10+ minutes for the server to come to our table. All around, the service range from harried to brusque, even gruff from the person who dropped off our dishes. There was minimal warmth from any staff. No one checked on us after the dishes were brought out. We had to flag down someone for more coffee. We all have bad days. Feel better, 44 & X."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYeXNldFdnEAE",
            "text": "처음에 아는 동생을 데리고 밥을먹으러갔을때 스테이크의 굽기와 모든요리는 환상적이었다. 입에서 모든 음식이 녹는느낌! 그래서 다음에 두번을 더갔는데 더이상 그 스테이크의 맛은 느낄수없었다. 살짝 오버쿡되서 나온 고기들.. 그이후로 실망해서 가지않았다. 직원들은 정말 너무 친절하고 분위기도 너무좋고 맛있지만 두번째와 세번째 방문했을때는 스테이크가 너무 퍽퍽해서 별로였다."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwOVB5QjlRRRAB",
            "text": "샌드위치 맛이 정말좋다.\n시저샐러드도 맛나다.하지만, 좀 많이 짜다.\n팁은 15%정도를 요구하고, 서버들도 친절하다. 분위기는 깔끔하다"
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnMGZ1c2l3RRAB",
            "text": "양이정말많아요 점심먹기좋아요"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnN0txMHZ3RRAB",
            "text": "OMG! What an amazing delight to my senses. The food is visually appealing and once you take a bite you are in for a ride of savory and creamy and sweetness. I could taste clear blue waters in my lobster taco. It’s was a sweetness and the sauce was so complete it perfectly balanced. My entire meal was one amazing surprise and gift rolled into one after the other. Please try eating here it’s an amazing experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNULXE2LWlBRRAB",
            "text": "Wow, what an amazing Mother's Day dinner. I went with my girl and her family.\n\nFrom the very start, Scott, and José were very friendly and welcoming. The food and drinks came out at the perfect time.\n\nThe host was very kind to take a photo for us as well. Everything was delicious. I can't wait to go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiNDZQSk1nEAE",
            "text": "This restaurant is exactly my type of vibe. I love it for several reasons, but the top two are the location and the amazing brunch. Nestled in a prime spot, it offers a delightful ambiance that's perfect for a leisurely meal. The terrace provides a lovely view, making the dining experience even more enjoyable.\n\nThe brunch menu is fantastic, with a variety of delectable options. My favorite will always be the Eggs Benedict – they’re perfectly cooked with rich, creamy hollandaise sauce. The omelette my partner had was also really good, fluffy, and packed with fresh ingredients.\n\nHowever, the service wasn’t the best. For some reason, it’s hard to find a place in NYC with consistently nice service. Despite this, I really appreciate the friendly and attentive staff, who contribute to the relaxed and welcoming atmosphere when they’re on point. It's an ideal spot to unwind, whether you're having a casual brunch with friends or a special meal with loved ones.\n\nI’m already looking forward to my next visit. Definitely coming back soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6MnFXNEdBEAE",
            "text": "Visited 44&x for pre-theater dinner and we were not disappointed…the food, the atmosphere, the service was everything! It was the perfect place to catch up with friends over shared plates and light bites. The menu was extensive and innovative yet approachable for every palette…there’s something for everyone! The owners are delightful and paid attention to each table, which is rare to find in a manhattan restaurant these days. We will definitely be back! Thanks Scott!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxak5YRTR3RRAB",
            "text": "Very cozy and quaint experience on an easy Thursday night. Staff was amazing and I ordered based off their recommendations. We got the short ribs, salmon and grilled chicken… ribs and chicken were perfectly seasoned and tender. We tried most of the desserts. I loved the chocolate soup, cappuccino and coconut ice cream and the dried marshmallows were very special. My friend loved the sorbet. Highly recommended, esp. if you’re visiting from out of town like we were!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMbHF2eE53EAE",
            "text": "had heard good things about this place from a colleague, but it didnt meet my expectation. maybe it's a brunch menu, but i was not impressed with the food offered.\n\nThe staffs are really friendly, but we sat at the patio there are homeless walked by begging for food, the staffs were just standing right next to our table not doing anything.\n\nI have to admit that they do have really cute drink menu with broadway name twist. and pretty big selection of brunch. I tried their crab cake dish, and the crab cake was disappointing. does not have chunks of crab, instead, more flour inside , and it only came with one medium size crab cake which is about the size of the egg, most of the plate only just filled up with potatoes for $27. I dont see the value of it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbmRTX3FBRRAB",
            "text": "A lovely neighborhood French place. Short Ribs were absolutely amazing, one of the best ones I've ever had. Scallops appetizer was pretty good too. One of the nicer places in Hell's kitchen"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3dC1qam5nRRAB",
            "text": "I hadn’t been to this restaurant in quite a few years but decided to have dinner here again. The restaurant is still very cute. Food was pretty good! The bartender was very nice and made a great drink. The waiters and restaurant staff were very friendly and accommodating. Will definitely have dinner here again soon to try more of the menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxc3EyNElREAE",
            "text": "This was one of the best restaurants we ate at in NYC. The restaurant has a great vibe. The staff were wonderful. The food was AMAZING. we spent about $100 per person (in total, after tax and tip). Considering the very generous portions and phenomenal quality of the food, the price is well worth it and cheaper (for what you get) than other places. I had the fillet and not only was it large. It was one of the best steaks I’ve ever had. It melted in my mouth.\nThe only small note I will make, just for others to be aware if they’ve never been, the restaurant is quite small and the tables are packed in quite close, so it may not be the most accessible friendly for people who have mobility devices. FYI"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNicXVUd1lREAE",
            "text": "We discovered this gem after our Broadway show ended and couldn’t have been happier with the experience.  The atmosphere was perfect and the food was expertly prepared and flavourful.  The Atlantic salmon was cooked to perfection, and the turkey meatloaf was also a treat for the tastebuds.  We will no doubt be back in the future!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVaElqOE9REAE",
            "text": "Nice atmosphere. Delicious dinner. The starters as well as mains were excellent. Good wines. Only our server could have been a bit more attentive and friendly. Had two ask two times for another Glass of wine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIaktYNDlBRRAB",
            "text": "44 & Hell’s Kitchen is a nice little find in the heart of Hell’s Kitchen. They have a pretty decent menu with options for every palate. Plenty of options no matter the diet or preference.\nPrices are a little steep, even for the city, but everything was well prepared and tasty!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoeDRfMk9nEAE",
            "text": "When Nathan Lane and Rosie O’Donnell tell you this is one of the best place to come before a show - u come and surely this place does not disappoint.  Rested in the theater broadway district, the service and the food was impeccable.  Though relatively packed in this small dining space, the food quality, flavors and choices were ample and in New York, the prices were quite reasonable considering all.  The staff is extremely friendly and the owner Scott introduced himself to a lot of of the tables and made sure all is well. 5 stars definitely"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPMHFyV3VnRRAB",
            "text": "Surprisingly delicious food all the way around. We shared all the dishes, and not one person was disappointed in any one of the dishes. The owner greeted us warmly at the door and switched our seating arrangement at the last minute to accommodate a table of eight people. How wonderful!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxcGI2dDB3RRAB",
            "text": "We were visiting over the holidays and staying very close by. A friend had recommended we try this place and wow are we happy we did! We loved it so much we went back for a second evening.\n\nThe food is phenomenal! There was nothing we tried that was less than spectacular. (Pro tip: get the Filet Mignon, it was unreal!) The dessert in the photo is the banana split. It was so good I had to have it both times we visited. The cocktails were so delicious and creative! Again, loved everything we tried. (Highly recommend the Bacardi to the Future. Definitely had a few of these!)\n\nThe service is beyond great. (Your water glass will never be empty!) So prompt, so lovely, such good vibes. The ambience was beautiful. We brought my mom for her birthday and they sang a very sweet and unexpected rendition of happy birthday for her. She felt so special and it warmed our hearts to see.\n\nThe space itself is a tight squeeze (It is midtown Manhattan) but super cozy. And the bathroom is lovely, which very important for me! I recommend making a reservation just to be safe as it was quite full on our first visit.\n\nBig thank you to Scott, David, and the rest of the beautiful staff. I would give this place 10 stars if I could. We'll be back in Hell's Kitchen later this month and are absolutely planning to return. Highly, highly recommend. 💜"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcnQzQ3hnRRAB",
            "text": "Interesting spot in Hell's Kitchen. The staff were helpful and friendly. Food was good. I had the French toast with bacon which hit the spot nicely. Reservations would be recommended as it filled up pretty quickly."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLczhIS3pRRRAB",
            "text": "Above all, this place has excellent service. My boyfriend and I came here to celebrate his birthday, and it was cold and rainy. The waiter turned on another heater for us and offered blankets and hot water bottles. We each ordered a beer, and they had a pretty good selection. We started with the spicy salmon tartar, which was good but I think it would’ve been better with some avocado. We got the short rib entree, which was phenomenal, and the pistachio-crusted tilapia, which was also very good. We also got a side of French fried, which were delicious. For dessert, we ordered the peanut butter mousse, which came with three scoops of gelato and was delicious. They have a super extensive menu, and all in all I was impressed!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwd0lUN05REAE",
            "text": "We had last gone there a decade, perhaps 15 years ago! We kind of forgot about it.  But we made up for lost time by going twice in the space of a couple of months. Scores well in every category that a restaurant should perform - food, service, atmosphere and value. I expect we'll be more regular customers over the next 10 years."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfamN6MjlnRRAB",
            "text": "Goat cheese, short ribs, chocolate souffle is all I have to say. So good!! It was worth it! The service was awesome and they were polite and attentive."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdjdYR2xnRRAB",
            "text": "What we expected was not what we received. My steak was beyond burnt that it could not even be cut. When I addressed it, the server actually tried to say they char their steaks really well. I showed him you cannot use a knife and cut it. There was no replacement of my dinner. There was no compensation. There was nothing. New Years Eve 2022\nWe requested to sit outside, and in their outdoor venue there is only one table that was taken at the time. The table they actually set us at was the only one where the heater did not work. Changing to another table was not an option with them. An hour later, when the busboy - who did not speak, English - realize we were freezing he went and fixed the heater but by then we were ready to go.\nWorst experience ever - never expected this at Hells kitchen. Wasted money & time"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6Z0tmV013EAE",
            "text": "There's nothing  better than the sweet combination of great food, ambiance, and service. I celebrated my birthday here and was overjoyed. 🙂"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXM09lVWRnEAE",
            "text": "Meh... another basic restaurant in HK. Nothing interesting in the menu. Good location & ok decor. Simple. Super loud so this may not be you spot. Service was below ok. It felt pressured and rushed. With that being said, our first shared…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcHVDZzF3RRAB",
            "text": "Food was excellent.  Everything on the menu looked excellent.  We had the crab appetizer, Tilapia, Pan Roasted sole and Gelato plate to top it off.  The tables are fairly tight but you won't be disappointed with the food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcXQ3dzVRRRAB",
            "text": "sadly this restaurant ruined my expectations. Poor presentation, the place looked battered, the tables were too close, I could smell and almost eat the food of the person next to me. The waiter didn't even bother to explain the dish I was asking him for references to, as if I had to know what he was talking about. Horrible food, no flavor, also the rissotto was half raw, the meat we ordered was half cooked, it came out well cooked, in general I think the best thing was the fries... To make matters worse, with almost 200 dollars of bill, they charge me the obligatory tip, I understand why the waiter did not give his best. In general, I would never go back and I do not recommend it at all!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJeFltM0dREAE",
            "text": "Great food, everything on the menu sounded amazing. We shared the goat cheese soufflé which was very good! We enjoyed the Sea bass and Short rib, both were delicious. We finished off with their version of a banana split.\n\nLots of variety. Staff are s on point. Service was great!\n\nThank not con is seating is tight, but then again what isn’t in downtown. Will be back and recommend!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLanVQWTdnRRAB",
            "text": "the green tea cocktail & the chicken quesadilla is something i would definitely come back here for. the family & I had a late Easter dinner/celebrated my uncles 50th! the staff is absolutely divine & the outdoor patio is dog friendly!! we had our Shiba inu dinning with us.\n\ncan’t wait to come back!!!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNneV9PUHlRRRAB",
            "text": "Light airy space, excellent food. As a seafood lover, the menu was pretty tough because there are so many good options, but I think I made the right choice! The pistachio encrusted tilapia was amazing.. and the piece of Maine lobster on…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXNDd5a2FBEAE",
            "text": "Perfect weekend bunch place with delicious food and cocktails. We ordered Eggs Royal (essentially eggs Benedict w/smoked salmon) plus omelette w/chives.\n\nThe restaurant allowed us to sit before full party arrived, which is much appreciated in New York.\n\nWe also had a birthday cake served on the table, which was an amazing accommodation as well :) in turn of course we tipped a bit extra.\n\nOverall a terrific experience!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4M1Atb3JnRRAB",
            "text": "Such a great find in Hells Kitchen.  Food was superb, had a filet mignon cooked to perfection.  Didn't have any room for dessert after, which was a real shame as it looked incredible.  Server was fantastic and the food was delivered quickly.  I don't think my water cup reached half empty the entire meal."
        }
    ],
    "reviews_count": 82
}