{
    "name": "Aria Hell's Kitchen",
    "place_id": "ChIJIWLdOldYwokROdK1xyMhYBo",
    "grid": "MN4",
    "address": "369 W 51st St, New York, NY 10019, USA",
    "rating": 4.4,
    "user_ratings_total": 1065,
    "phone_number": "(212) 541-9241",
    "reviews": [
        {
            "date": "5시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsV1IwUTRaM2c1TVV0a09HWjNObVo2Tm1aUU0wRRAB",
            "text": "OMG. This is was the best Italian food I have had in a while. EVERYTHING was delicious.  Highly recommend."
        },
        {
            "date": "2일 전",
            "language": "nl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4NllqaEZUa3hZVTJ4WmRsVkhVelJsVmtWVU1rRRAB",
            "text": "Toprestaurant met faire prijzen voor New York. Bestel je bvb hier een kannetje wijn komt dit neer op 9,5 dollar per glas. Bijna uniek voor New York! Enorm genoten van mac & cheese met truffel!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQmRYTTFRbGg1VlVndFZsSkpaMHhDWDNoM2FYYxAB",
            "text": "Every time we come here we have an excellent experience. There is no bad choice on the menu. The rotating specials are delicious and the pasta staples never fail. Mark and team are so warm and friendly. He came by to make conversation and check on how we were doing throughout the night. Cannot recommend enough!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWdU0xOWFNbVZSY2tWNUxWWkJNbVpQZHpoeFVGRRAB",
            "text": "We were headed to another place, but Aria's outdoor seating and atmosphere was so inviting. The mango goat cheese salad was incredible; very thinly sliced mango delicately arranged around a bed of greens topped with a circle of goat cheese  that was crisp on the outside, but soft on the inside. The special on the 4th was a flat homemade noodle with lamb in sauce with a crisp sprig of rosemary. Each bite was melt in your mouth incredible along with a glass of red that the waiter recommended. Tiramisu that was fluffy and creamy made for a perfect end to our meal.\n\nThe staff were welcoming, polite and attentive, and yet gave us plenty of privacy to enjoy our meal. This will be without a doubt the best Italian meal I will eat in the next 10 years."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUlV6aENkakJJVDFKelNrWkRiR0V4TW00elJGRRAB",
            "text": "If you looking for great menu recommendations, a fun atmosphere, amazing food, and impeccable service, COME HERE.  A lovely experience from beginning to hand.  The best place in Hells Kitchen!  Ask for Mark."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wYVdtaFdkazUzT0MxNVJuTmtXWEozYVVwTmIxRRAB",
            "text": "Handmade pasta. Great service. Authentic Italian. Best espresso martinis. You would be lucky to eat and drink here."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTGRYaFFUa3RLVUhCVFFVbFpYMmxYTkhwaGJrRRAB",
            "text": "Nice small Italian restaurant with awesome food!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOaVpYSjVlRWREWmt4VVdHZHZjakJRVDNsdFVYYxAB",
            "text": "Aria Hell's Kitchen is a full song of excellent ambience, cuisine, and service. Owner, Mark, and his staff welcome you in like you're having an old European family dinner. The mango goat cheese salad special was flavorful and refreshing, and the bolognese was phenomenal. Especially recommend the lasagna, and the tiramusu finished dinner off in the best way possible. Gorgeous setting and excellent recommendations from the staff. Grazie!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjeWJEVkxNVVpHT0UwM1VUVnZWMlZ2ZDBreVZtYxAB",
            "text": "We went on a Wednesday nite @ 7:30. Food, service, and atmosphere were amazing. One of our best dining experiences!!!! Felt like we were back in Italy. Highly recommend."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkYVJXZFhSVEZ4TXpsU09WazRaWGd6UzNsSVFYYxAB",
            "text": "This was such an amazing experience. My mother and I went Aria due to a recommendation from one of her friends and had the most amazing time. We went as a late lunch/early dinner prior to a Broadway show. We both ended up getting two different risotto dishes as our entrees, from the specials that night, and the atmosphere of the restaurant was amazing. As for our appetizer, we order a burrata and prosciutto dish. Our dessert I have attached a photo of. The service was great and we left smiling."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOVGIzZHJPVGxNY2tvd1NuQkhhMnRTU1dNeWNuYxAB",
            "text": "Great atmosphere,  fabulous bread & olive oil. Crab cake spot on. Lasagne and cremini risotto absolutely delicious!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxa2FWQlpaRXRUZWpOZlJFcGxTRWhUTFU1VVNGRRAB",
            "text": "an amazing moscow mule, great octopus, bread, appetizers, pasta, EVERYTHING!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SVE0zVjZRMk5YVWxodGNERmlTMjlmVDB4ck5tYxAB",
            "text": "Standout spot in Hell’s Kitchen. Came here for a bachelorette party with 12 girls, the staff went above and beyond to make our night incredible. The food was authentic Italian, made in house and fresh, and the atmosphere was lovely. Above all, the amazing staff and owner is what made our experience unforgettable. Do not hesitate to come here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTGJFcEpibkp1V2tjeWQwVlRkRlJyT0dNdGJIYxAB",
            "text": "Best service in New York! Waiters, manager, chef and all staff were so kind and put their customers first. Highly recommend! When back in New York I will be coming back!! If I could give 10/10 I would. Come with an empty stomach and an open heart"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCa2R6bHFSRFJDWlRGVlgyd3hUVlZOTWpOM1lWRRAB",
            "text": "Had an amazing experience at Aria Hell’s Kitchen! The service was excellent—timely, attentive, and so much fun. The staff went above and beyond to make sure we were taken care of, and their energy made the evening even better. The food was delicious, fresh, and full of flavor. Overall, a wonderful spot with great vibes—I’ll definitely be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCc1FWcERZbFZPYlVabk5tMDNVazFaUTJGbE4wRRAB",
            "text": "If you’re looking for the best place to be you’ve found it!!!!! Atmosphere is fabulous, food and drinks are even better. Marco is the BEST server in the world and I highly recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkaFpFMUdOalJ3VmtOVmExOWhVR2R0VGtjNVdXYxAB",
            "text": "Where to start! Such an amazing experience from start to finish. Food was mouth watering and don’t even get me started about the service …it was spectacular !!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xONWRrdHhXRjloWDNrdGFGSk1SV2czVG14NFFWRRAB",
            "text": "Amazing food, amazing service. Will come back again and again and again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xndFREZHVlRXRTY0ZsM1dURmpaV05PZDJRMmNVRRAB",
            "text": "Best experience of my life! Incredible food, even better service! Went above and beyond and most memorable moment of the whole trip ❤️❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjMGNESnNhMk5hTldwVWRVbFFRVGh4UVcxNU9IYxAB",
            "text": "Food, service, ambience…. all 10/10!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaNGVXMUVla1ZoVjI1Wk1rRTJlRkJuU2t4Q2JHYxAB",
            "text": "Amazing italian food and amazing service!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4d2VUVllWREYwTUVoaGVURTRPRFo0YWpWdFdFRRAB",
            "text": "We went as a party of 12 for my sisters bachelorette. Food was AMAZING and service was top notch. Staff went above and beyond to ensure we had a good time and food came out super fast. Vibes were amazing. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "it",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMmFXWnRXRzVPVnpCMFYwNUliVFJwYkVGRk4xRRAB",
            "text": "Pasta precotta che viene proposta come prodotto italiano.. di bassissima qualità. La cosa peggiore è stato il cameriere che al momento del conto ha preso la carta di credito dalle mie mani l’ha inserita nel pos ha selezionato 20 dollari di mancia che era invece a scelta e non obbligatoria, e davanti al mio tentennamento si è sbrigato a confermare l’operazione. Un sacco di soldi per mangiare in modo pessimo. Non ci andate."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWc1lsbFRSbXR0ZFRoamFGaFNkV3hyUkY5blNIYxAB",
            "text": "The food was delicious, the service was great and the vibes were good as well. I had the pesto pasta and it was amazing but the best thing was definitely the price! It’s genuinely so impressive!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGcExXUnRhbDlXZDFCUmRUVnRRekkwV0ZGQ00xRRAB",
            "text": "One of the best restaurants I’ve been to in NYC. The staff and management were second to none. The food and service  is exceptional . We can’t wait to go back. Thank you for a wonderful experience!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRWFVSkxlVEIxUjFsSE5WWnFjRTV5WjA4eFFWRRAB",
            "text": "Really nice place, the staff super lovely and the food was delicious fresh and tasty, everything you’re expecting! We’ll definitely be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WV2VrTTROVFZxV204d1ZFNXFjMFJpZFRCNVozYxAB",
            "text": "Service 10/10 Atmosphere 10/10 Food was ok and the porcion are very very small"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVmFVbEZPVTVzTlVGck5WOUZiSEJ3TFUwdFNIYxAB",
            "text": "Beautiful and cozy place, friendly and fast service, delicious food. Thank you guys for our wonderful evening 🙂"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOQ2RVRk9SazgzVTNkQ1FrNVRXR2xrWkRsamFVRRAB",
            "text": "Romantic and uplifting atmosphere. Waiter was extremely personable and excellent, fast service. Did not rush the check. Food was amazing!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGTFMwcDBXVTlDZEhKcWNWZEdia1IxVVdrd05GRRAB",
            "text": "Wonderful food and even better service! Mark runs an efficient and kind staff. Definitely coming back for more!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NNFVVNXRWamhGT1VsNmNucGtUbDlDZUdwMVZHYxAB",
            "text": "Always delicious food and a great experience!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwTlVEbGxhV1pQYzNSSlZWRnVXV05XV0RBd1dtYxAB",
            "text": "Every dish was a winner. Started with meatballs and warm goat cheese. Tuna salad and feta salad super fresh. Shrimp pasta and orchiette pasta with sausage was deelish! Tiramusu finished the night a bottle of water dropped off so we're never without. New fave! Grazie mille!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOR01qZFlkbkYyUzJoWlFrTXlVbWs0ZVdzM1JXYxAB",
            "text": "Love the vibe 💯 food is classic and straightforward! Staff and service is good!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CSFExVTNRMTlSWldkNWRrcGpSbXhWZFRFM1VIYxAB",
            "text": "This place is among my favourites in New York, all of their pasta is fresh and unbelievably nice with great specials and is very reasonably priced, and the staff are really friendly which creates a great atmosphere"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twSk9XTm5NbEZQUkUxTlpUUjFRV2M1T0hKVGVVRRAB",
            "text": "Had a blast in a party of 9 - Mark was an excellent server and host - we had fabulous food and enjoyed the night immensely!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WaVRqaFpTRFJIVkRSRmVIaGtObkpRVnpGR2VFRRAB",
            "text": "Mark was amazing. Food was amazing, wine so so good! Take all the recommendations from the staff! Will be back!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Nd1JtazJabGswZEdSZmNrVklNM0JyZWw5RlZGRRAB",
            "text": "Wow! We just enjoyed the best dinner!  Seriously one of the best meals and dining experience we have had in a long time.  Mark welcomed us and provided excellent recommendations. Lamb and risotto - get it - amazing!  Everything from drinks and wine, prosciutto appetizer, lamb ragu, lamb risotto, cheesecake = perfection. Service was spot on.  Not one flaw.  Thank you for an enjoyable evening!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214TFkzaG9aVTl0Wm1kRk16Ullia1pEZVdoQlEzYxAB",
            "text": "Recently held a birthday dinner here for a group of 18, and everything was perfect from start to finish! The staff was incredibly accommodating with our large group, the service was impeccable the entire evening, and the food was absolutely delicious. Everything came out in a timely manner—no long waits, even with so many of us. Highly recommend for both small and large gatherings!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1cU9GcE1RbTlwUkRsaGNHUlFORzFSVFdWWGFVRRAB",
            "text": "Great authentic Italian.  Bolognese was closest I've had to what I remember my Italian friend made for us in her home!\n\nFriendly and welcoming. Cozy and casual bistro and bar.\n\nNeed to improve red wine list to include good cabernet sauvignon!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxelpscElUVGhGWlRWSE1rcDZkekV0VlZSSFUxRRAB",
            "text": "Perfect place to feel at home and well taken care of with ‘out of this world’ Italian food. I asked fora “fruit fwd” red wine and I don’t even know what I have but it’s perfect. The bread is very difficult to stop dunking it in the oil and…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcFgyVjJWVGREUTAxUlRWOVNTWE5FVURGSFJtYxAB",
            "text": "Great food, friendly staff, & lovely atmosphere! A real gem!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201RVUwRjFWVlZIYjBkSFlWRlFjVTV4UlZGUlNuYxAB",
            "text": "Have lived near this spot for the last three years and it is truly a neighborhood staple. Open late with excellent service and food as well. The specials continuously impress and at an excellent price point. I’ll be coming back here for a long time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213NFpsVTNhREZXWW5oaWEwTmZNamRWZFZwQlJFRRAB",
            "text": "This place is an absolute gem. Everything about this place is perfect. The food, the wine recommendations, the service, the atmosphere. I’m in love. Mark curates an unbeatable experience. 10/10."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CQ1gyeGtRMnhrYWtodUxWbzBaWGxGUW5oUlgwRRAB",
            "text": "Buena comida ( pastas y salsas) bebida sin frio acorde .\nEncargado o dueño le falta aptitud comercial , camarero IMPECABLE .\nVale la pena visitarlo"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNNVV6SkdRemcxYWtWclZFWTFTVVpRVkZGc1NGRRAB",
            "text": "Cool vibe"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tORlUyVXliRW8xWmt3NWNXa3lRVEk0TVVaaU1YYxAB",
            "text": "Favourite restaurant in the whole city, the cheese gnocchi is breath taking the clams are amazing the wine the whole experience is 10/10 our server Katerina was incredible we will be back on Thursday!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVMWJuaGphR2RZVlRodVZ6VmZjVUZzZURZMmVWRRAB",
            "text": "Sydney was a wonderful hostess, food was great & the atmosphere was A+"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCb1YzTnFiV3h5V1ZkVlNsOTBlbVJ1U2twd2ExRRAB",
            "text": "A reliable and delicious Italian spot with cute ambiance. Love going for a cold martini and yummy pasta - and reasonably priced too!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMWNERXdNV2QyWWxOaFNVRldjUzFrUm1GM09VRRAB",
            "text": "Excellent vibes and great service!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KNWFVTnZVM2d6Wmt0QmFHeFljVVo2UWtWNU4yYxAB",
            "text": "I had the best evening here with my lover. The eggplant parmesean was too good to be true. The wine was crisp and satisfying. The pasta was truly unparalleled, and the sauce was truly boss. Host was amazing. Broke a glass and they came back with more wine. Will be coming back again soon. Peace and love❤️❤️❤️ - Leah S."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1Z3ZuZVJREAE",
            "text": "너무 맛있으니 꼭 가세요"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLSE4yXzY4N2F1cDZ3RRAB",
            "text": "I truly loved this restaurant—delicious pasta! My husband said the lasagna tastes just like in Rome (and we lived there). A real gem in Hell’s Kitchen."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJZ0xhdE93EAE",
            "text": "og ny spot in hells. great pasta and fun specials every night. staff are nice but felt not super well attended to. we went on a friday and it was busy but managed to get a walk in. we got the best salad, lobster ravioli, shrimp, mango and goat cheese salad and the truffle cream gnocchi. all very good but not wow. would go as a local spot in the area but not worth going out of your way."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnNE1xbWNnEAE",
            "text": "A beautiful display of Sicilian cuisine.  Presentation is A+, service is extremely attentive and atmosphere cozy and comfortable.\n\nWe ordered several small plates which we recommend you do so that you get a flavor of many different dishes."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3eG9lMkZnEAE",
            "text": "This is the most delious and delightful atmosphere. In fact I loved it so much after my first visit I spent time looking on google maps to refine it just to take my husband on a return trip. They have a gluten free pasta option, the appetizers were fantastic and can we pause to speak about the ricotta cheesecake!!! It deserves its own review it’s so amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqaDVYWHR3RRAB",
            "text": "Loved the wine, food, and service here! The presentation and taste of everything we ordered was amazing, especially the eggplant appetizer dish (I would return just to eat this again with a glass of wine)! The waiters were also very attentive and kept clearing out used plates and glasses promptly and checking if we wanted to order more. We spent more than 4 hours there!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTUNRcEpVNxAB",
            "text": "A quaint neighborhood restaurant but the service and food were rather lacking. In the beginning, the waitress spilled wine onto the floor and my company’s white pants. She gave us soda and salt to wipe the stains off, but they still remain even after washing with soap and detergent. (It’s probably unwearable now.) We did not even get a refill of the portion of wine that she spilled on the pants, table, and floor… No other compensation of course.\n\nThroughout the evening, the service was quite slow, to the point where we had to walk up to the counter to ask for our bill. We didn’t even get our starting bread until we asked about it in the middle of our meal. The food was mediocre, the taste perhaps sullied by the overall experience of the meal. All of this might be an issue of low staff numbers, tight space, and a lack of attention to the tables outside. Not the pleasant experience we were hoping for on a Saturday night out."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRczlLZExnEAE",
            "text": "I only got a photo of the appetizers( tuna tartar and grilled octopus), which I highly recommend! BUT I highly recommend the lamb shank. It’s so flavorful.\n\nThey also have a great selection of wine. Mark is well knowledgeable of both food and drinks. Will def be coming back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paa1VGVlZSM2xRU0VWWVVVTnpVRjlFZWpRMVNHYxAB",
            "text": "Stopped in for lunch today.  I live in Philly now but this used to be one of go to spots.  It’s still greats and fabulous.  Great high ceilings, open air on nice days and great vibe.  Love the food and very reasonable prices for NYC.  And service is top notch. Very attentive and personable.  Highly recommend. I miss living near this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5OE11OVJ3EAE",
            "text": "Aria continues to outdo itself. From the intimate vibes inside (always has a great playlist going) to the delicious wine and food - it never misses. The manager, Mark, and the service staff are incredible. $19 authentic Italian pasta! You don’t come across that often in NYC. My go-to spot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeTdqb1B3EAE",
            "text": "I have walked by this place for years and finally tried it out last month. I have now been coming 3x a week. The food is absolutely delicious. The drinks are great. The staff is super friendly! The manager, Mark, is a gem.\n\nI have been promoting this place to all my family and friends. Last night, I held my cousin’s 40th birthday dinner at Aria. My entire family left that dinner praising their food, atmosphere and service.\n\nAria is a go-to when in Hells Kitchen."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwM05LYkFREAE",
            "text": "An awesome restaurant in Hell’s Kitchen. The manager, Mark, is very accommodating and the food & wine is excellent. No canola or soybean oil. Italian healthy and yummy cooking. I recommend the octopus salad, calamari, arugula and feta salad as well and the truffle gnocchi.\nThanks for a lovely lunch!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXbnAzQzFBRRAB",
            "text": "Update: we dine here all the time but this time we decided to take out. We were sent to the sister restaurant Briciola. What a joke - the fish was tiny and there was barely any salad. Lost another star for this\n\nThe ambiance was great. From the start everything was great. The wine we chose was perfect for us. We started with the shrimp scampi and grilled eggplant, which by the was my absolute favorite! We then also ordered the tagliatelle bolognese and one of their specials, which was a truffle gnocchi dish. The tagliatelle was good, but the gnocchi hit the spot for me. So rich, flavorful, and just delicious. I probably would have been happier splitting the gnocchi because the entire dish might be a bit to rich for one sitting, but I loved it! Would love to come back to try other dishes for sure."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJN0xlb0JBEAE",
            "text": "For a little tiny space in the side of a building, the food was fantastic. The service was great. We went for dinner and the place is a little dark so my eyes had a hard time seeing the menu in my middle age status, lol. Lots of wines to…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIOXBuekhBEAE",
            "text": "We have been scouring our credit card receipts trying to find this place we visited 2 years ago-( my son had the gnocchi last time and has been talking about it ever since. It was all he wanted for his 16th birthday.)\nIt’s SO good! We had the Gnocchi and the octopus salad. Both incredible. I cannot understand why it’s not five star reviews all the way. Such memorable food and leagues better than the other restaurants close by. Probably coming back again this week.\nAbsolutely love this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkeUp2Y0VnEAE",
            "text": "Food was fantastic and came out all in very timely manner. Service was great and our waitress was so sweet! This places is certainly a favorite go-to of mine because I know I will always get the same well rounded quality experience each time."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSeDg2QmlBRRAB",
            "text": "De esas apuestas que salen bien. Pasamos por la puerta y decidimos cenar en el lugar. Ambiente acogedor, buena carta de vinos y unas pastas que estuvieron deliciosas. El broche de oro se lo llevo el tiramisu que pedimos de postre. La…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKMlU1ZGlOeUlMLUR3EAE",
            "text": "We had a glitch in the system in the beginning of the evening but these guys went above and beyond to make us feel comfortable. I was very impressed how everything was handled. true customer service! We enjoyed the evening and left very happy! I thank everyone for looking out for us and for really rescuing our evening in the best possible way!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYdE5EcGZ3EAE",
            "text": "This place is a gem in the heart of hells kitchen off the ave.  Super friendly and considerate staff, food is exceptional for a great price. The eggplant with goat cheese is insanely delicious and the pastas are so fresh you can almost see through them. I want to try them all!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMF9LclZREAE",
            "text": "What a lovely place! The food is delicious, the service outstanding and the whole atmosphere simply great. My favorite italien restaurant in Hell's Kitchen!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveGFLUVh3EAE",
            "text": "Everything about this experience was amazing - the food was divine, drinks are perfect, and the servers made us feel like family. We came on a sunny day and sat outside and the servers were very attentive. Would definitely come back here. We got aperol spritzes, the burrata with prosciutto, and the meatballs and everything was great!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbVl1VW5nRRAB",
            "text": "I absolutely love this restaurant! It is perfect for a date or for dinner with friends! It is lively but also charming and intimate. It’s a blessing they have a location in midtown because this is my go to pre-theatre dinner spot as well. Get the truffle gnocchi!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCeTZIenBnRRAB",
            "text": "Very friendly staff, beautiful ambience for conversations. Reasonably priced, good variety of wine and cocktails. The eggplant with goat cheese was incredible, and we loved the truffle gnocchi as well."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtemY3NjJBRRAB",
            "text": "Went out for a late dinner after our broadway show. They seated us quickly after checking vaccination card. The place has a very cute decor and the staff is very friendly. I had a glass of montepulciano wine. The wine was really good. I wanted to try another glass of a different wine but the staff was busy so I didn’t get to it.\n\nWe order the shrimp rigatoni, penne pesto and lamb chops. The shrimp rigatoni was very good but my favorite was penne pesto. The lamb chops were somewhat hard to eat and a little less flavorful than our preference.\n\nWe ended the meal with some tiramisu and cheescake. Both were phenomenal!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4c1pHWVRREAE",
            "text": "This restaurant is amazing. The food is phenomenal, the service is amazing, the owner is so incredible nice. I may be bias because I live around the corner but this restaurant really gives Hell’s Kitchen a plus in the food category Love y’all!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQcXFEcHdnRRAB",
            "text": "Absolutely amazing restaurant. Mark was our server and he was incredibly friendly. Beautiful restaurant. 10/10 would recommend."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtclotR2Z3EAE",
            "text": "I decided to have dinner on December 31 at this restaurant after having toured like 4 restaurants in the city. It was a spectacular dinner, I was alone and they made me feel like family. It is one of those places that you should not miss if you go to ny. Very local people, nice people and better servers cannot be."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wUGEwcG9MV3RXTjNaaFZrbFlWMVpLUzNFd2JYYxAB",
            "text": "Consistently the best Italian spot in Hells Kitchen. This is my staple and my go to. Highly recommend for anyone - whether it’s a date or a large group, they will always accommodate. The most friendly and wonderful staff and great food!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlZ0tyajlRRRAB",
            "text": "Fresh. Delicious. Generous. I was a solo diner for a late lunch and I was treated like a VIP. The fettuccine is homemade and perfect, and the tiramisu is REAL tiramisu (not pudding on cookies).  Also, just drink whatever wine Sara recommends. Cant wait to go back."
        }
    ],
    "reviews_count": 79
}