{
    "name": "Tacuba",
    "place_id": "ChIJRbKnYVdYwokREjd_9BBOSis",
    "grid": "MN4",
    "address": "802 9th Ave, New York, NY 10019, USA",
    "rating": 4.3,
    "user_ratings_total": 1819,
    "phone_number": "(212) 245-4500",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21adVJEVnlYelUwWlVGVlRqUk9WV2hoYVdwMU1uYxAB",
            "text": "The enchiladas de pollo en mole are delicious and not crazy spicy. La Sandía margaritas are so good. Friendly staff."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVdE1tVjJiM1ppVkZKaVZXMHRWazFTZDB0SVMwRRAB",
            "text": "Beautiful ambiance, great service, and the food was delicious! The only downside was the table full of drunk people next to us making a lot of noise. Otherwise, the spot itself was wonderful for a night out."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnM2VYUTFTMkpOWldGc2NGb3RkemxRVDJSV1NWRRAB",
            "text": "⭐ 1 star\nI came to Tacuba with my partner and we ordered food and drinks. We waited about 20 minutes — then only one plate of food came. When I asked the manager, he said we didn’t order food, which makes no sense. He was very rude and unprofessional. How can I order food for just one person when we were two? Terrible experience. Not recommending this place at all."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCaWNIbDBjMmx0UVVKWGVWRnNhWFE1VlU5eVgxRRAB",
            "text": "Decent food, service a bit slow. It took ages for someone to attend our table and take the order"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oa1RISjFUVkp5Y0hnMFFreGpUWFJqV0ZOSmFGRRAB",
            "text": "This place is a most in NYC!! As a mexican, I Can definetly recommend this place, tacos were 10 out of 10. Excellent service as well, bar tender, Sofia, made the best margaritas in town!!! For sure I will come back on my next visit"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GelNqY3pka2RoVVZSWVJsSkRSVU41UTJKVWFFRRAB",
            "text": "Good sangria, tacos were tasty, but the restaurant had a dark, mystical, unexplainable energy that put me in a bad headspace. Anyone else?"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWUlFXZG5NbU5zYW1kM2NrVlhZMk5EYlZwVVVIYxAB",
            "text": "Fun atmosphere and friendly staff. They serve water and nachos with guacamole right away, which I loved. The brisket tacos were delicious, and my friends enjoyed Frozen Margaritas and Sangria during Happy Hour. Great spot to relax and eat well."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205UFdESXdUVTB5WTNaNExVWnhTR3RvZERkTFgzYxAB",
            "text": "🌮 The shrimp tacos with cheese were absolutely delicious! I also tried the chicken tacos—equally tasty. They’re on the smaller side, but every bite is packed with flavor."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdGFsRXhSRTVIY21GQmFXeEZXVXBwYTJSTFdFRRAB",
            "text": "The food and the frozen margaritas was great! Thank you Carlos for the good vibes :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CblFXZzJWVmRVUkdKU05EaE5lVUZ1YVRod2MyYxAB",
            "text": "We went to Tacuba and had an excellent experience. Carlos was our server and he took amazing care of us, super attentive and welcoming. The margaritas were delicious and the food was full of flavor. Definitely coming back"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nMlZubEtOemwzTVhOSFdtcEJMV2hMVlVaWGMxRRAB",
            "text": "Excelente comida y trato muy agradable. La ensalada de aguacate 🥑 muy rica y sana. Importante descubrimiento en NY."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200d2JYSXdXVlpDWW5CUllsbFJkazlUTjJFdGNWRRAB",
            "text": "The food was DELICIOUS. The queso was unreal!!\n\nAlso I got the half chicken dish, it was so good.\n\nHighly reccommend the food here."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25waFdYRldSRGhUVWpZM01GRXhOVVJaWkc5a1ZIYxAB",
            "text": "Okay I do understand that Mexican food is spicy but I had fish tacos in better places and at this place it is way too spicy and they don't even mention it on the menu not even the server warns us of how spicy it will be. Anyways to make the story short.  Guys there are better Mexican places than tacuba. With a better price and please don't order the white sangria is terrible. Everyone at my party tried it and they all agreed.  We did pay the bill we didn't complain the food wasn't all that.  Prices ridiculous. We tip very well but for us it's the last time we ever go there.\nAnd for the management please check your menu.  And try the drinks . Cause that white sangria was terrible."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aNGVDMW5WRlpwV0dkMFN6Tm1lblZrUXpsaVlsRRAB",
            "text": "This is great place after work and on weekends. Great atmosphere and drinks and food to match if you enjoy seafood and cerviche, this place for you. The seafood cervical cocktail called Siete Potencias is in my opinion the best seafood cerviche in Manhattan at an amazing price of $18.00. I have spent twice that around town for seafood that did not cost the owners $5.00. Here you will get a goblet loaded with quality seafood. The octopus Toscano is loaded with octopus and a deal a $20."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kUVgwZERUWEpIYWtaWmVuVlhiRlJxUTA5UFJHYxAB",
            "text": "Came in for a last minute reservation; sat at the bar. Very accommodating, friendly staff. Great food!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTFZHbENXa05FTW5seExURTBVbTVzYTI5aFdHYxAB",
            "text": "It was a bad experience they overcharged my bill was 72$ and they charged me 172$ I called them and they didn’t fixed the problem also the food was horrible no flavor and the service bad we wait 20 minutes for the waitress to take our order and to have overcharged it’s ridiculous. Truly I don’t recommend this place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poblIzZHJlbTVrVjE5UU5FMVJRWHBIVFhGS2NrRRAB",
            "text": "The food and staff (all but one) are great! That is my reason for 4 instead of 5 stars. Unfortunately, I will not be returning until a staff member named Aracely is gone, and it saddens me. She makes the otherwise perfect staff and food impossible to enjoy. She's incredibly unprofessional, speaking (screaming) at other employees, making them cry, being incredibly unprofessional\nTo the point that multiple people dining were leaving or about to leave due to the hostile and awkward environment she creates. Please let me know when she longer is employed and | will return often."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ac1V6VkpUWGRFWWxCRVUwb3RkSEJzTkZkTFMyYxAB",
            "text": "Fantastic find. We visited twice in our trip in New York. Guacamole was delicious and fresh. Tacos were also a highlight. Decor added to the atmosphere. Highly recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205emNISklVRm80ZUVGa09YUlJlbGhQWjJ4emFVRRAB",
            "text": "This place used to be good, but the service has become terrible. The last time I visited the restaurant, the hostess was rude, and the waiter just took our order and forgot we existed. I had to go to the bar to get my check."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OaU9HdHhVa3hCTTJOT1QyMXFSRFJPUWpkUFFsRRAB",
            "text": "Extremely non-inclusive behaviour on the front desk"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKeFFscGFkRGhRUjNVeVJ6SkJkbDlsTmtkcmIwRRAB",
            "text": "Only stopped by for guacamole, chips and salsa. All were decent. The lemonade was refreshing though I watered it down as it was on the sweeter  side."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRNVJFOXhkVzUyYm5GSmNraHNhRkpJWjJoU1dWRRAB",
            "text": "the nachos here are delicious! but i was disappointed about the size of their steak burritos - even if they’re two of them, they’re so small. it’s underwhelming for a $20+ dish"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1UVR6Sk1ZbTB4UnpVNFptWk1SMnd3TW1GZmFrRRAB",
            "text": "Tacuba in Midtown is a solid spot for Mexican food with a beautiful, open patio concept that adds to the vibe. The chips and guac were fresh and flavorful, and the birria tacos—though a bit small—were delicious! Lunch service was impressively fast, but evenings were noticeably slower, so be prepared for a wait. Still, the food and atmosphere make it worth it. Great spot for a casual meal or drinks!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLWHM1YkdBOFAyVktnEAE",
            "text": "Food was bland, oily, and heavy and made me and my sister sick. Barely received any service since the waiters didn't really check on me and other tables too. The margarita my sister got did not make her feel good. The chicken especially was bland with not even salt or pepper being noticeable. It is a crime to call this Latino in any capacity."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMamV5OGk0dzk2UjRBRRAB",
            "text": "The food was exceptional, I had Tacos Birria WOW, you have to try it!, the staff attentive, and the ambiance was perfect for a cozy evening. Highly recommended! Thank you Araceli for your attention, def you will have great time and delectable food!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJRFRucGlpdTZUcnpnRRAB",
            "text": "Margaritas and chips are on point here 👌👌👌…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOWE5ocEhuNzd1ZEhREAE",
            "text": "If it’s nice out, try to get the tables by the open windows.\n\nGreat place to meet up with friends and eat some delicious carne asada and suadero tacos.\n\nThe margs are very potent. I was loopy after one drink and I had to get another to be even loopier.\n\nI’d add photos but i was too busy stuffing my face with tacos."
        },
        {
            "date": "5달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKeldwTGZTdE5fUk5BEAE",
            "text": "Très agréable restaurant. Les plats sont délicieux et authentiques."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMYVhuY09QMmRlUWR3EAE",
            "text": "Very slow service. Mediocre food especially for the wait. Several plates came out cold. I don’t begrudge the staff. They seem to be very understaffed."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMRFlfcnVEci0yWFlREAE",
            "text": "Excellent food, drinks and service!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJMjkxUERudzdTaVNBEAE",
            "text": "Cute. Good option for a group or family. Great shrimp tacos and margaritas."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJdXQ5cXJ1ME9mTVFREAE",
            "text": "I had raw chicken in my burrito and the restaurant didn’t do anything about it. So bad."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJV0YxdUhXbjZEQktBEAE",
            "text": "Don’t waste your money. The tacos are miniature and mediocre-tasting at best. I also ordered the rice and beans; rice was hard, cold and dry and the beans was basically a soup (strange consistency). The service was quick and friendly."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKTDV3cWpJcWNHZXlBRRAB",
            "text": "Place was really good for a group! We walked in on a Tuesday night. Servers were friendly. Queso appetizer was the best"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLZnF1TnpGck1LbGlBRRAB",
            "text": "Birria tacos and margaritas were good"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfa3U3cUZnEAE",
            "text": "We're impressed by the food and service every time! Our favorites: queso fundido, carnitas, and all the tacos. All the cocktails are great too.\nWonderful lively spot for a date or gathering."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJXzdMMmh3RRAB",
            "text": "Found this place in NYC and the food and service were excellent. Would come back if\nI’m around!"
        },
        {
            "date": "7달 전",
            "language": "nl",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcktUU1JREAE",
            "text": "Gezellig Mexicaans restaurant, goed eten"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbUxqd3F3RRAB",
            "text": "The nachos and drinks were so good!!! The atmosphere was very pleasant and the service was amazing!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eEk2eTV3RRAB",
            "text": "Solid but not regrettable tacos. Cool atmosphere and good service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3b042UzVRRRAB",
            "text": "Saturday 3/22. We walked in at 11:07 (7 minutes after opening) and were seated promptly, by an indifferent hostess. Water came a few seconds later….at 11:17 we walked out. No contact from anyone else during the 10 minute interval. No other guests in the place. When we walked out there was no host at the host stand. We heard some chatter coming from the kitchen area and saw a staff member in the back of the dining room folding napkins. As an industry veteran of 30+ years I find it quite disheartening that this is happening in a competitive market like NYC. We stopped in randomly to try a new place but ended up going to a favorite place and waited to be seated."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cXZ5dFlREAE",
            "text": "If you want tacos, do not come here unless you want micro tacos. I really just wanted good tacos, and I ordered chicken tacos that cost 20 bucks, and I ate them within 2 minutes. It was very upsetting. I should have just gone to Chipotle or even Taco Bell. They tasted good but were not a meal at all. I had to  get more food somewhere else. They could have doubled the tortillas on each taco to make it more filling, but it was the most unsatisfying taco experience of my Mexican life."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdGRQUGFBEAE",
            "text": "Delicious food, decent portions. The place is not too loud, nice options for lunch."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRZ2FTRHd3RRAB",
            "text": "Sitio estupendo para tomar, brunch o aprovechar Happy Hour!\nEl servicio muy atento las\nCarnitas están Deli y la variedad de mezcales y tequilas es excelente!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNXV2Um5RRRAB",
            "text": "Amazing place, amazing vibe the margaritas and guacamole are great perfect for enjoy with friends or ourselves the waiters and bartenders are also great and helpful best place for having a nice time !"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNXBPc3RnRRAB",
            "text": "Great staff is great and the frozen margaritas are fantastic."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcG95dGNnEAE",
            "text": "Great service, fresh food server/host Carlos was very tentative and on point with my order, drinks were fresh and good very refreshing and cryspy… the chef Julian top top of the tier art on taste and presentation I am glad I found my go to spot with friends, family and colleagues hopefully a date soon lol… really hidden gem in midtown and also affordable, money well spent !!!! Thank you so much Tacuba🌞☀️"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbXRXeE13EAE",
            "text": "While food is good. The alcohol is tampered with the intention of being deceptive."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnN0pqREFREAE",
            "text": "It was a great nice. A bit pricey for what it is but good quality overall. I recommend this place"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNF95N0xREAE",
            "text": "Mid service, food is alright, wishing it could be served hotter. Coffee is really good. Try their cappuccino 😃"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYM05hUWVnEAE",
            "text": "This place is fantastic. The drinks are really good and well balanced. The atmosphere is so mature and welcoming.\n\nFood:\nI had the Carne Asada and it was sooo flavorful and juicy. Great combination of flavors for sure. A friend ordered the Enchiladas de Pollo en Mole and he had nothing but good things to say about it. Another friend ordered the Carne Asada tacos and he loved those too.\n\nDrinks:\nWe order the De La Casa Margarita, the Refrescaritos, and the Frozen Margarita....all great choices. Strong and balanced properly.\n\nService:\nFernando is superb. I will come back to a restaurant or bar because of the service and he really enhanced my dining experience. I didn't know what to order and he understood what I was looking for which I appreciated. And he was nice! It may sound weird saying that but I'm NYC, you will run into a very cold and dry waiter and it sucks the life out of a night out. He was the opposite. Big fan of Tacuba.\n\nI have seen other reviews about the service not being great but that wasn't my experience. I recommend this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6eTdmZzBRRRAB",
            "text": "The restaurant looks really good aesthetically and is a fun place to eat but the let down was really the food, prices and service. The food was quite over priced for small portions. The taste of the food was great though. The service was just a bit lacking but not bad, although our order was mistaken. Really too bad that a Mexican place doesn’t being chips and salsa while you wait considering the price point. Drinks however were prices well and looked interesting. Overall won’t be coming back unless to get drinks but just a few things getting fixed can make this place really good!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSOFBEQzRRRRAB",
            "text": "Went for taco Tuesday . Service was exceptional. Veggie Nachos were amazing . We took the fish tacos, shrimp tacos and chicken tacos - they comes in threes and you can’t just get one taco of each . The tacos were good. Not the best I had though. The shrimp was probably my favorite. The churros for dessert was not great and we would have skipped it if we had known ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdzdMNElREAE",
            "text": "My husband and i went there late in the evening and the front was noisy and warm. I asked for us to be seated in an air-conditioned area... and the back which was huge... was pretty, chill, and had good service. I tried some foods i had never heard of but my husband thought i might like. It was all very good.\nWe found this restaurant by accident and decided to give it a try. I'm glad we did and i hope to go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwblBuMW1RRRAB",
            "text": "Food was really great, and service was very nice! The frozen margaritas were very nicely presented and tastes good and strong.\n\nWe were seated inside but right next to the entrance so we got some of the heat from outside and there were a few flies around. Otherwise pretty good!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4Nk4yT19BRRAB",
            "text": "I have been here a couple of times and it has always been a wonderful experience. The tacos are delicious, although ones I had tried a sandwich which was good too. The seating is really good for family or date. On a sunny day there are seats outside as well as conditioned tables inside. I prefer the ones near the entrance, cool AC and open doors."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbFBuWjl3RRAB",
            "text": "With all these great reviews I had higher expectations and left disappointed. The food was fine but for the price it was nothing special. I’ve had better for less expensive.\n\nGuacamole was average. Enchiladas were just old. Avocado fries - pass on those.\n\nEnvironment was great and staff were friendly though!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbTlERDFRRRAB",
            "text": "Great food. Lots of flavor! Amazing stiff cocktails. Staff was very friendly. Explore the menu!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaazlmVHpnRRAB",
            "text": "Stayed nearby, so stopped in for happy hour and appetizers.  The bartender was great, and served up some delicious margaritas.  The chicken nachos were also tasty.  The vibe was chill with the front windows open for a nice refreshing breeze, and the music was perfect with great Spanish throwbacks playing!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaOEpXVGRREAE",
            "text": "It was happy hour so we both enjoyed sangrias and margaritas.\n\nThe sea bass dinner that my brother had was fantastic and both the chicken dinner and the quesadilla with truffle, mushrooms, cheese and other fantastic items were amazing, as well."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlanF6M0h3EAE",
            "text": "Really great service and food/drinks. We got the Guacamole, nachos and carnitas along with the mango margarita. For dessert flan which was so rich and creamy and beautiful flavor. The drink was nice and strong and had lots of flavor. Food…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSblBIczFBRRAB",
            "text": "Drinks and the guac were excellent, tacos just ok. The tacos tasted very plain, and the tortillas were pretty dry. Maduros were too oily. Service was friendly and would def come back for the atmosphere."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcHU2WDRBRRAB",
            "text": "Food was great! We got the ceviche, rice (side), brussels sprouts (side), chicken tacos, guacamole, cheese dip, and various drinks. The hibiscus cocktail was excellent; the picanto picante cocktail was also great; and we tried the pineapple margarita that comes in a pineapple. Really strong and pretty sweet due to the pineapple juice. (We added extra limes.) Fun atmosphere. Would come back."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBdGVqNVFBEAE",
            "text": "Came for dinner on a whim around 8 pm Thursday night. Walking in, the place was extremely packed, there was barely space to move. Large space with great decor and high energy.\n\nThe hostess was very helpful, there were no tables available, she helped us get seats at the bar which took only about 20 minutes. While we waited for the seats, the bar tender was very attentive and handed us menus as soon as we walked over, though we were standing behind a group. Our first drink was a sort of margarita punch bowl served in a pineapple. Great detail and attention put into the presentation of everything that was served.\n\nAfter being seated the bar tender continued to be attentive and very helpful.\n\nExtensive list of delicious drinks and food. My boyfriend insisted we try the grasshopper tacos. Though mentally, I do not think I could eat it again it was interesting to try this once.\n\nOur entrees were delicious! I ordered the steak (medium) with fried rice. The meat was a bit over done but had loads of flavor.\n\nI highly recommend this restaurant!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWb0lMUVBnEAE",
            "text": "Most amazing service, atmosphere,  and food. Authentic and personal. Menu was small but comprehensive, and everything tasted like it came straight out of the personal kitchen. I recommend the Carnitas and the Carna Asada plates. This is on our must return list and if you are looking for Mexican food in Manhattan and don't visit Tacuba you definitely missed out."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBcEp5WWlRRRAB",
            "text": "We only ordered the suadero tacos which were very good and the skirt steak entry, which was a little tough, and the red snapper with trumpet mushrooms special of the night, which was very good. The staff is attentive and the ambiance is…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJN08ydld3EAE",
            "text": "We had a great night out at Tacuba.\nFirst and foremost, the service was professional and kind. The waiter helped us pick dishes from the menu and gave us great service.…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJemZXajRRRRAB",
            "text": "Came here for dinner and the food was good. However, order a bit more because the portions are tiny for the price. I enjoyed the tacos and churros - the rice dish I ordered was only so so though.\n\nService was great although it was a bit slow - not the wait staffs fault as they seemed understaffed."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwa3V5TXdnRRAB",
            "text": "The service was very attentive. The food was very tasty and plated beautifully.  We tried the saudero  and pulpo and chorizo tacos which were very good but on the small side.  We also tried the Japones Ceviche which was really really good.…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURncnBibmJBEAE",
            "text": "Food is amazing but the main course bbq beef is a bit small for American size as shown in the picture - the One with carrots and sweet baby corn.\n\nDrinks are great and deserts was excellent.\n\nOne thing I need to mention though is the ‘manager’, I think . He’s the guy stood next to counter and telling staff what to do. He didn’t come across as friendly and welcoming. No welcome or thank you for coming.\n\nWe were seated near the door on a hot day. The door was wide open so even the air con was on, It was still hot. Should have closed the door. Wasn’t comfortably seated. Love the food but not a great experience."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpN1lINnFRRRAB",
            "text": "3.5 stars. We got the Chile Relleno plate and Enchiladas de pollo en mole. Chile relleno was good- flavorful. Both dishes came out lukewarm and the portions left us both leaving slightly hungry still."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBLW9uSDF3RRAB",
            "text": "had a delicious brunch today with my family- the ricotta pancakes were very good. I just had to remind the waiter to bring the syrup. the other food ordered was also quite good. nice atmosphere- can be noisy- child friendly too as there were 2 toddlers using booster chairs"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHNW9MZ25BRRAB",
            "text": "Love their menu! The octopus and chorizo taco is my favorite! All the dishes are quite authentic and savory and well presented."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3azc3SUlREAE",
            "text": "Visited on Wednesday evening for dinner. I really liked the food. My favorite was the tostada de pulpos. My margarita was very strong. The server came by often and asked if everything was okay."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSeXNtN2h3RRAB",
            "text": "Reserve last minute for three and not dissapointed. There varied Margharitas with mezcal options was great. Our waitress was very sweet and gave excellent advice. We enjoyed the nachos, street corn was superb, veggie tacos excellent, spicy…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxc2UzRjFRRRAB",
            "text": "We had the best nachos and tacos I’ve ever had. The nachos were so tasty and crunchy. The tacos, rice and beans, and sweet plantains were out of this world. Go eat there now!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCNi0yZC1nRRAB",
            "text": "Avocado fries amazing.  Carnita nachos light weight amazing for a non-pork eating person.  I was sold. Drinks were amazing. Had the Cucumber Margarita... amazing choice of tequila choices.  The Mezcal de Pina did the job.  Don't sleep on this spot. Even happy hour drinks were fresh."
        }
    ],
    "reviews_count": 77
}