{
    "name": "Mémé Mediterranean",
    "place_id": "ChIJ09Uz9k1YwokR4YYFTqBQ5xA",
    "grid": "MN4",
    "address": "607 10th Ave, New York, NY 10036, USA",
    "rating": 4.4,
    "user_ratings_total": 979,
    "phone_number": "(917) 262-0827",
    "reviews": [
        {
            "date": "13시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wMFJrWkJSRVpsWDJreldEVXhURWN4YmxreFdGRRAB",
            "text": "Popped in for Lunch on Sunday and was seated right away with a highchair. I was dining alone with my toddler but was greeted by friendly staff that make us feel welcomed. We ordered the falafel platter with veggies and dips and a chicken kabob plate. Everything was very fresh and delicious. While I was there I witnessed the bartender come out from behind the bar to assist an elderly guest who was struggling to remove his coat- such a beautiful and simple gesture of hospitality! Thank you for the yummy lunch and the kindness from each person who came to our table."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0SlNtaG5hR1JWTmtOdVYzRnVNMEZ3WjA5V1EyYxAB",
            "text": "We went to Meme for brunch, almost accidentally, after being shut out of our first choice and in a bit of a rush before a Sunday matinee. What excellent luck for us! The food was excellent, the service speedy and nice, the space lovely and not too loud, and the atmosphere convivial. We’ll definitely be back on purpose!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cek5IWjBiVzlpTFc1T01tMXphVXBIWm5CTlpXYxAB",
            "text": "Food was incredibly expensive and not tasty at all. At least either be cheap or good. A small vegetarian tapas plate  was $18 and had no flavor. Wouldn’t recommend"
        },
        {
            "date": "1주 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pScE0xTlFXblYwTWtkeVFUWlZhRVl5UkdaVFkwRRAB",
            "text": "지중해요리, 아주 좋았습니다"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SVp6TnhabHBSY1ZoTE5YVkxXalZXUmxSc1kyYxAB",
            "text": "Wonderful pre play dinner - had the meme salad and Branzino - outstanding.  The staff was great"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FeE1uRjZNRVpZV0d4RVZqaFVRblpLWld0SmVrRRAB",
            "text": "Friendly staff and delicious food. Wonderful experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQmNtOXRkbFphU1dKd2JsVlZkMEZoUWpkTWRFRRAB",
            "text": "This is by far the worst service I have ever experienced.\n\nI am in the service industry myself and have been for more than 20 years. I go out to eat frequently and this was awful……TERRIBLE!!\n\nMy friends and I went there last night to celebrate one of the girl’s birthday.\nWe got seated at a table with 4 chairs.\nWe got seated outside. The restaurant was half empty.\nThe birthday friend was running late due to train delays.\nThe server (with the match stick earrings) can over to us after 10 mins.\nWe ordered and appetizer while waiting for our friend.\nShe asked us when is our friend arriving.\nI said she was on her way.\nShe leaves the table.\nThen she comes back and tells us if our friend doesn’t arrive in the next 15-20 mins she will move us to another small table in the corner with only 2 seats. She said they had reservations coming. I said she is on the way.\nShe takes off without any comment.\n\nFinally our friend arrived in the next few minutes.\nWe had to wave for service. We ordered more food.  She didn’t even explain the menu or if they had any recommendations or specials.\nThey never came over to ask how was the food or if we needed anything.\nWe had to wave them down every time.\n\nWhen we were done we had to ask for the check. She comes over with the hand held credit card machine.\n\nWe left close to closing time and there were not any reservations that needed a 4 chair table.  There was a lot of empty tables inside and outside. The could have easily moved the other 2 chair seated tables together if needed.\nThe pressure of us having to rush eating and felt we needed to hurry and leave was terrible.\nThe food was not very good as well. We  did not enjoy the whole experience.\nThat was our first time there.\nWe will never go back there again.\n\nI HIGHLY DO NOT RECOMMEND THIS PLACE.\n\nThe food is not this good. The pita bread was cold and hard. The combination platter was not very good. The portions were very small we had to order 2 of them.  Not worth the price you pay. There are so many good restaurants in the city with much better foods and potions."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WGREVjVWRU5vZWtwUlJsaHpWVzFLWlRSelUyYxAB",
            "text": "I went in for lunch and it was great!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poRkxVaFpiM2RSTlVnMVJreEZRVWcxVW5oWFQyYxAB",
            "text": "Went here for brunch as I was craving shakshouka but I have to say that I was a little disappointed. Serving was generous but the sauce was minimal and not overly tasty. I also didn’t like the pita served with it and would have preferred toast. We also had a share plate of dips and falafel. The falafel was very tasty. The service was satisfactory and I liked being able to sit outdoors. I would recommend it, but I’m not sure I would go again - unless perhaps to try some other dishes , as the food coming out for lunch looked good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGU04zbzRkV0Y1ZWxkU1drTkhaWFJvUmxoSFZrRRAB",
            "text": "Disappointing experience.\nCame with a party of 3 — I was the only one drinking and asked for my wine to be charged separately(mind you I got a bottle). Still, 20% gratuity was automatically added to both my food and wine tabs. Their menu only mentions auto-gratuity for parties of 6+, so this felt sneaky.\nWhen I questioned the auto gratuity on the wine, the server scoffed and said, “Because you’re being served,” even though I poured most of it myself. Worse, I overheard him talking badly about me in the restroom. Totally unprofessional.\nWe were considering coming back for brunch, but after this? Definitely not. A 10% discount text was received afterward doesn’t make up for being disrespected.\nWon’t return, and can’t recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRFRqbFVNbEJsWlhSVWNFa3RZVGxtU25WcFoyYxAB",
            "text": "This is very racist place depends how you look you are inside and I will talk you all why? I just stop today like 4 pm seem I see people there eating I said let myself to have a table and try .. I live in the area many years let’s try  this one... the first sentence by Jose idk if he's real name but I took i picture of him he said I can't. Because that’s not the clothes to go in and my availability to talk probably i speak in English .. I'm Latino very proud from Venezuela I work at the post office and I am a membet at National guard reserve and this is the treatment I have cause I'm Latino ... from another Latino .... No way .. and no more about this place in Hell's Kitchen"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WlJFMTBRVmRpVTBwWk1HSlBXbVoxVjB4V1RuYxAB",
            "text": "Been here several times in the past two years. Food quality has been consistent. Services are always good. I would say this is a solid spot for Times Square area. I’m a 11 years New Yorker and I hate TSQ lol, but if I’m in the neighborhood for Broadway show, this is my go to. (The pan fried salmon with saffron rice is my all time favorite)"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLT0Eyc2JFa3NTYUpBEAE",
            "text": "One day I had their baked meatballs ($18.00), which were satisfactory. On a different day I tried their meze combination platter ($26), which I expected a lot better of. They offer a pleasant sidewalk dining area. On a Sunday I ordered their hummus topped with lamb. The menu did not state that the chopped lamb topping was spicy, which it was. I did not enjoy it because of the spicy lamb topping. I followed that with the lamb burger, it was not spicy because it had virtually no flavor, and was dry. Although the hamburger was about an eighth of an inch thick, it was not cooked the way i ordered it, medium."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZd0xXVlFSME5XWDFwMVFqaHNNVzFLY1c5VU5rRRAB",
            "text": "⸻\n\n⭐⭐⭐⭐⭐\nThe food here is absolutely amazing! I had the couscous with chicken and lamb, and my husband ordered the tagine—both dishes were full of flavor and cooked to perfection. For our appetizer, we had the hummus topped with ground lamb, and it was delicious. We finished with the apricot bread pudding for dessert, which was incredibly soft and melted in our mouths—it even felt like it was made with babka bread. Everything from start to finish was outstanding. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWNVdIaGlORFJyYUhSeVNHcGliM0ZSZEhOblEyYxAB",
            "text": "La comida es deliciosa 😋"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURab0l5TWpnRRAB",
            "text": "The food was just OK and our server was kind. She clearly described the menu options and she was well versed with allergy concerns.\n\nUnfortunately, the first person to arrive of our party was not well treated. They changed attitude only when he showed the confirmation text message that we did indeed have a reservation.\n\nI will not be going back. They are gluten-free friendly."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KalpURlZWRXRPWm1wb1NuRXRhMDFHVEZwTWNHYxAB",
            "text": "Great food and service, wonderful outdoor seating. It was disappointing to be charged $30 for a dish listed as $24. Please update your menus."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkMldURnVNemxtUW1zdE5GUlZPRFZUVkZaalRrRRAB",
            "text": "delicious. I couldn't take a good photo."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtb1pIMXRRRRAB",
            "text": "Delicious tagine and couscous. The outside tables are nice on a warm day. It’s our favorite place for pre or post theatre meals."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VKS0UtOHJLZzVPMF9BRRAB",
            "text": "The food is great, but the drinks are bad!\nWe ordered espresso martini and man, it had no alcohol!\nThese guys are cheap and look for ways to cheat you!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQUFAydVM3MmZPQnhRRRAB",
            "text": "Excellent choice for lunch and dinner.  Good taste of food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VMeXp4WlB0cTVxQk13EAE",
            "text": "Food  was not tasty here and doesn't worth the money they are asking for it. Service was okay, and place is nice"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNLXB4Y196MzlfYVFBEAE",
            "text": "On a beautiful spring day, I visited Meme Mediterranean with a friend, and we were not disappointed! We were seated at a nice table, and our server was friendly and attentive.\n\nThe food was delicious—our appetizers were seasoned perfectly, and we thoroughly enjoyed them. The main course arrived promptly and was delightful.\n\nI liked the flourless chocolate cake, but I wish the kitchen had put more effort into the presentation.\n\nOverall, we had a fantastic time at this charming little restaurant and will definitely return!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMM1BpOUhFak42RllBEAE",
            "text": "Exelent 👌"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd2ZUNUV3EAE",
            "text": "The manager is very rude. I understand that some restaurants have a minimum number of plates per person norm but that can be conveyed in a polite manner.\nWait staff is also mismanaged. We had to give the same order several times to different people because they wrote it down but did not end up putting on the order for some reason.\n\nUpdate: In response to the restaurant's review:\nThere were only 4 of us and 1 kid. We ordered 2 drinks and 2 entrees. We were considering ordering one more plate once we started with the 2 plates.\nYou first take our order of 2 plates, bring us the drinks and then come after a while and ask us to order more.\nHad you come and talked to us properly, we'd have considered ordering more/ maybe some starters etc ."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZZ2F1QkNBEAE",
            "text": "Terrible manager."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZZ2RPLS1BRRAB",
            "text": "Unfriendly staff"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZLXBPVi1BRRAB",
            "text": "I went yesterday with my baby and a friend. He was on a stroller. When I asked to the guy at the front if it would be possible for seat 2 tops and a baby the first answer that I received was a “No, I’m sorry”. Not even a “Let me see if we have coming reservations” or “Would you be able to fold up the stroller” or “let me see how we can accommodate you guys”. I work in hospitality and I know for a fact that customer service (even if you guys don’t have the space) is a must! Very unpleasant experience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZOUk2ZGVnEAE",
            "text": "Branzino was great, highly recommend it!"
        },
        {
            "date": "6달 전",
            "language": "de",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMkx6cUt3EAE",
            "text": "Essen definitiv zu teuer gür diese location"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdGQtUnp3RRAB",
            "text": "Delicious!  The table to our left complimented the chef and the table to our right ordered the same appetizer twice because the first one was so delicious (a beet dish).\n\nWe started with an incredible hummus and perfectly fresh falafel. I ordered the salmon with risotto, which I highly recommend. My husband had the scallop risotto and ate every bite. Dessert was a bread pudding with a fresh whipped cream that was heavenly.\n\nWe’ll return. The lamb looked amazing as did the spicy margarita.\n\nRecommend opting for an early dinner if you don’t like a weekend crowd. It was fairly quiet at 5:30 but to the brim an hour later."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcUkyaUxBEAE",
            "text": "So much fun and deliciousness! Keep the small plates coming for a really entertaining evening! Our server was excellent too."
        },
        {
            "date": "6달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeF82T2xnRRAB",
            "text": "Sehr leckeres Essen.  Schneller und freundlicher Service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOWNUTnJnRRAB",
            "text": "I liked the restaurant, although, I felt pressured at the end because I hadn't asked for the bill and they brought it. So much pressure, I couldn't manage it, so agresive uffff"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTUNJenJGNRAB",
            "text": "Excellent meal at a very reasonable price. Interesting and tasty tapas plates,  would highly recommend"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3b3VLVkF3EAE",
            "text": "Basically a fast choice and we ended up at this small local Mediterranean spot for dinner. They have a friendly staff, but they're very busy, especially when it's full.   I would like to have given them a higher overall rating but the main plates were uninspired. The food looked fresh and appetizing but was kind of bland. Apparently, the cook likes red pepper flakes, but that is only one spice. The mains were hot temperatures but the sides weren't. The staff were busy and never asked if we wanted drink refills or dessert. A $30 appetizer platter was good but only came with what looked like one cut pita for four to share... Then they charged $2 when we requested one more. They are in a very busy neighborhood full of very good restaurants. Please up your game."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3M09XdHNBRRAB",
            "text": "The spices on the Branzino were delicious. Staff were very kind and accommodated my dietary restrictions."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMlpfWDhRRRAB",
            "text": "Nice and cute neighborhood Mediterranean spot. Overpriced for the quality of food and service but good if you want to try out tagines."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbks3VU93EAE",
            "text": "The food was really good- the gnocchi was exceptional. Kenny was very helpful throughout and his service made the experience even more fantastic. Went on Valentine’s Day"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBb1pubHd3RRAB",
            "text": "Food was good overall, just think their menu is a bit too pricey for what it is. Tuna tartar was really tasty"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBMXAzMEZBEAE",
            "text": "Food we ordered were great and the service was great. I liked cosy atmosphere."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbl9ycTNRRRAB",
            "text": "Adding this to the list of fave restos in NYC. Happy food + lovely staff 👌👌👌"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBbS1EWllnEAE",
            "text": "EAT HERE!!!\n\nThanks to Yelp, I chanced upon this fantastic restaurant last Saturday. My husband and I had dinner with a childhood friend of mine and his wife. The three of them couldn’t stop complimenting my research skills! Even the proprietor couldn’t believe that I found his restaurant on Yelp! I explained to him that the reviewers on Yelp usually shave off a point or so for higher pricing. Google reviewers are far more price agnostic. That doesn’t mean that an establishment must ignore Yelp. Factor in the price sensitivity and you will be led to the best restaurants.\n\nThe food was pan-Mediterranean with dishes from Turkey and Morocco. The attention of the staff as well as the proprietor made the dining experience very very seamless. Two days later, I’m still patting my back for landing us at a fantastic restaurant in a neighborhood that is rapidly losing its flair for authenticity."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfc0lxa0V3EAE",
            "text": "It was quite a surprise. When we reached we thought it's not really a Mediterranean restaurant but we stayed and thought of trying. It was quite surprising and the food was really good. We loved it. Their appetizers, kabobs, and entries were too good. We also loved their baklava. Their spicy margarita was also great."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMEluUUNREAE",
            "text": "Not good service.  Food is ok not worth the price."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfbF9YWVJnEAE",
            "text": "Nice Israeli brunch spot, food is alright for the price, though service is very welcoming."
        },
        {
            "date": "10달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dDlmOHl3RRAB",
            "text": "Comida excelente, serviço merece muitos elogios."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NnZuYjJnRRAB",
            "text": "Food and service was very good , we also enjoyed the deserts. A little pricey tho."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQb2ZHb25BRRAB",
            "text": "Love this neighborhood gem. Michelle, the sever, was incredible and steered me towards the Duck Rice, a newer dish, which was incredible. Great food and wonderful service!! Highly recommend!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdmRlbXpBRRAB",
            "text": "Nice food"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6cG9yYlBREAE",
            "text": "Delicious green shakshuka with eggs for brunch. The bloody Marys were quite good with some lovely Mediterranean pickled vegetables. The service was really good, even when the place got packed. They have a nice patio sidewalk seating that's covered, and the inside is pretty charming."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUNHEybWVBEAE",
            "text": "I was walking around the neighborhood and saw this place with empty tables and stopped as we were starving! Honestly it didn’t disappoint!!! The pasta I had was SO good!! I recommend. The entry was SO good as well!!! (I don’t remember the name, see the pictures below, the little round pot)\nI had two friends with me and we all agreed it was a good pick. Service was great too!! (Ask for that starter dish)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6b08ta0RREAE",
            "text": "This place is a great Mediterranean restaurant! 🍴 Mémé Mediterranean offers a nice selection of delicious 🤤 dishes 🍽️ - definitely try the Appetizer Platter (pita 🫓 bread 🍞 , hummus, carrots 🥕, and more) and Lamb 🐑 Burger! 🍔 Their cocktails 🍹 are good too! Staff 👨‍🍳 is friendly and professional, service is quick ⏲️, and they have plenty of indoor and outdoor seating. 🪑 I wish I knew about this place earlier!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3dDV5TnNBRRAB",
            "text": "Nice place to have a bite outside in the summer.\nWaited a bit to post my review because the food wasn’t at all memorable (or even decent) for the price point. Very dry burger. Overcooked for lamb.\nDrinks were also small but the staff was a delight and very attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMcUpuM2p3RRAB",
            "text": "All pictures were of plates almost finished… because all the dishes were fantastic.\n\nVegan here is easy - waitress quickly knew my choices, BUT worked with the chef and owner to create a plate I could enjoy with the group.\n\nIf I could change one thing it would be the wine selection… that style of eating is a celebration and on a cool NY evening after work the group was ready to sample the menu if it had more variety and quality!\n\nI’ll visit again with a large group, they know how to handle the parties and create a good atmosphere around the tables"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6OExYQ3RBRRAB",
            "text": "Overall this is a pleasant spot to go for a quick bite while you’re in the area. We did some tapas prior to seeing a show. The service was a little slow, we had been seated for a while before somebody came over to give us water - there were plenty of staff standing around so it felt a little awkward. The food was pretty decent, lacked a little flavor from what I’ve experienced in other Mediterranean places. The pita used in the tacos were delicious so I wish I had ordered more of that. Our table sat right below the air conditioner and it looked like it hadn’t been cleaned in a while - there was literal dust falling on us onto the booth/bench next to us."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoalpPUWd3RRAB",
            "text": "We made reservations for 6 people at 5pm on a Saturday evening. There was plenty of space for us to sit and we were sat right away. Our waitress was extremely friendly and attentive. After we placed our order, our food was ready very quickly. Everything we had was delicious but we loved the roasted cauliflower so much we ordered another plate! And the chocolate cake may have been some of the best chocolate cake I have ever had!!\n\nOrder Summary\nWe ordered the following appetizers:\n1) Combination Platter\n2) Roasted Cauliflower\n3) Baked Meatballs\n\nFor the main course we ordered:\n1) Steak Frites (x2)\n2) Seafood Dish (x2)\n3) Beef, chicken blend\n\nFor dessert we ordered:\n1) Chocolate cake\n2) Lemon Tart\n\nThe only feedback I had was the acoustics become difficult once the restaurant is full. It becomes hard to hear. And secondly, please provide some pita bread for the table and for your dishes."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1MmIzSHNRRRAB",
            "text": "This was a hidden gem in regard of the food. We discovered it completely randomly, after a night Cruise at the pier 83 so we didn’t have time to book and it was already almost 9:30 pm. The place surprised me! The food was so good, it made me feel I was somewhere in the Mediterranean. So original! From the bread to the seasoning, the dinner was a gastronomic experience. We came without reservation and we’re able to seat outside, the weather was great so it was awesome. I’d strongly recommend, specially if you haven’t try a real Mediterranean Food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyaDlfQUd3EAE",
            "text": "So I have been eating at mémé for a few years at their west village location and always loved it. I was in hell’s kitchen and decided to go here thinking their food would taste the same. For drinks, I ordered their old fashioned and it was horrendous. No alcohol and sweet af. I sent it back and got bourbon on the rocks. Strike 1. For appetizer, we ordered the pita hummus lamb which was delicious. They could have added some olive oil to it to make it less dry.\nFor main course, I got lamb chops, I mean easy to cook, can’t go wrong with lamb chops. I asked for medium pink center and they cook to cardboard well done. I don’t wanna be that a-hole but had to send it back. Strike 2. They bring it back, at least cooked to my liking, spinach and mashed potatoes were good but the lamb chops were like 70% bone and 30% meat, strike 3. For a $200+ tab, They somehow managed to screw up everything I asked for and it was very disappointing. My other 2 guests thght that food was ok as well. Not sure if this location has a problem but will not come back here. Will order the same dishes at their west village location and see how it goes."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURta2JfaFR3EAE",
            "text": "Lovely Mediterranean restaurant! Went for brunch; food and drinks are great! Very good mimosa, a bit too spicy Bloody Mary, good and tasty Eggs Benedict and great Shakshuka Moroccan breakfast. Don’t miss the Combo platter!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEb09URWRREAE",
            "text": "Before walking in, I knew I wanted hummus and a Mediterranean salad.\n\nAfter searching the menu, I picked just that. I got the chicken kebab and it was delicious. I arrived for lunchtime, there was no wait and the food came quickly. I may come back. The waitress was also really nice. Great day in the city with great food! I paired my meal with sparkling water. So delish!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0aHRDSGJREAE",
            "text": "Delicious food!  We popped in for snacks and wine and were pleasantly delighted. The combination platter is the best way to start, just wish they had more of their homage pita bread. Then had the tuna tartare. We didn’t stay for entrees but they looked delicious. Several vegetarian and fish options for those whom don’t eat meat."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0MU1MNzJBRRAB",
            "text": "This little Mediterranean restaurant is a gem near midtown with a solid, extensive menu. The pita platter, octopus and chicken kabob all were tasty but the french fries killed it. The wait staff was friendly and the atmosphere quaint."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURodTlMMUx3EAE",
            "text": "We have a new favorite Mediterranean place in Midtown!\n\nThe food was exceptional, and each dish was full of flavor. The combination platter, Shawarma Royale (substituting the beef with chicken) and the Chicken Tagine were simply amazing. The spicy margarita was also very good. Last but not least, the Tiramisu was a huge portion size and incredibly delicious! The service was excellent and the place had great vibes.\n\nOverall, we really enjoyed our time here and would like to return soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxblozZWpBRRAB",
            "text": "On our last day trip in NYC We went to Edge  and were on our way to a off Broadway show, we thought we should  grab a quick lunch and entered this cute restaurant. Everything we ordered was so delicious, from French toast to tacos , from hamburger to grain bowl.  This was one of the highlights of our trip, highly recommended"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eDRydkpnEAE",
            "text": "It was really good! The waitress kindly taught me recommendations, which was delicious! I ordered seafood grill, the shrimp and scallops were fresh and plump and hummus was also nice. I’ll come back later!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzOUxTNkx3EAE",
            "text": "Mediterranean food was definitely great, we tried artichoke soup which were delicious.  Shrimp 🍤 linguine was magnificent.  Chicken kebab was also great.  I do definitely come out to this restaurant anytime of the day. Congratulations chief! (And also service was great)…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUaTQzYUNREAE",
            "text": "Rather lackluster food - most dishes were plain/ bland. The octopus salad was on the sour side.\nOverall, I came for the memes, but left disappointed"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDcnYzTFNBEAE",
            "text": "Had a really lovely time here! We were looking for some Mediterranean food after visiting the High Line and found this restaurant. The outdoor ambiance is really cute and there are a decent number of tables, all well-spaced apart.\n\nFor drinks, we ordered the sangria and a regular margarita. Both were really good, the sangria was definitely not your typical sangria - it was so light, bubbly, and fruity - would recommend trying for sure.\n\nFor food, we got the pita and hummus appetizer. Among other apps, this is a good portion size, so it’s easy to share if you are with a group and wanted to split a bunch of appetizers. The pita was fluffy and the hummus was creamy but still had a nice texture. We ordered the chicken skewers for our meals, which are served with some veggies, pita, hummus, and rice. The chicken was cooked well and was really juicy and flavorful. The cucumber yogurt dip tasted delicious with the chicken and was very fresh.\n\nAdditionally, our server, Brandon was excellent. Super friendly, funny, and made our experience at Meme stand out from other outdoor dining experiences. Thank you!\n\nWould absolutely recommend coming here if you’re in the area and looking for Mediterranean food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6NklUdUp3EAE",
            "text": "The food here was absolutely delightful! My wife had a small plate with scallops and I had something with shrimp and it was done very well. We sat outside on the little patio on a beautiful day in the city. Excellent experience!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4N0lxTTFBRRAB",
            "text": "I dined outside on a really pretty day. The server wasn't very attentive, he almost seemed annoyed.  The food was good. I had the chicken kabob platter. I was charged for 2 drinks because I asked for a refill... the glass was small. I should have been told upfront about the charge."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvMk15T193RRAB",
            "text": "Loved the ambiance, service and food. Ordered the Seafood Grill, chicken kebab and roasted cauliflower dishes to share with my mom. All of it was cooked perfectly. Chicken was tender and flavorful and the seafood (shrimp, scallops, salmon) had such great spices. Really enjoyed all the food here, would come back again in a heartbeat."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSLXZLbXp3RRAB",
            "text": "Delicious food! We had the tuna tartar, hummus, warm halloumi, and burrata for apps, and the shwarma, meme couscous, and salmon for dinner. My favorites were the tuna tartar and shwarma. Service was great as well! We did not sit outside as it was raining but the outdoor area looked very nice as well (it was covered). Highly recommend if you are in the area! Reservation recommended."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzODdMbWd3RRAB",
            "text": "Average. The food was good, but the bouillabaisse was a little disappointing for $38. The service was just ok. It was noticeable that some tables were taken care of better than others."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoOTdhOTlnRRAB",
            "text": "What a hidden gem! It's one of those places that you stumble upon and leave gladly surprised. If you like mediterranean food on a relaxed night out and don't want to spend a lot, this is the answer!\n\nThe menu has a lot food options for all tastes and everything we had was delicious. It would be perfect if they added an option to purchase extra side dishes (like couscous, rice, potatoes, lentils, pita, etc)\n\nAmbience is cute, the staff is attentive and the service was quick. The prices are not inflated like most of the places around.\n\nFor the tapas don't sleep on the duck kebab, it's sublimely simple and delicious. Also try the combo platter for a taste of many small bites (I just wish it would come just with a little more pita)\n\nThe dishes are not big or expensive so your best bet is to  order the tapas to share and maybe an entree is not even necessary but I highly recommend the Swharma Royale."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdHRqNGpnRRAB",
            "text": "Overpriced Mediterranean food. Had a salad and the couscous. The salad was $17 and looked like a sad little side salad that should have been $5 with 3 sad olives. Couscous lacked flavor very blend, watered down broth and then give you unflavored chicken broth for $30 with 2 nuggets of meat and a none spicy sad merguez. The staff is great, super friendly, I just don't recommend the food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaczRXWkJnEAE",
            "text": "They have nice options for brunch and lunch. Salad tasted fresh and good, but my favorite was the complementary raisin bread & jam - took me back to Europe. Waiter very friendly, food came fast. Will definitely come back."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1d2JiVUJnEAE",
            "text": "We visited this place during lunchtime and had soup with lamb kebab. The lunch menu cost $25 per person, and everything was great.\n\nWaiters were super friendly, and I really enjoyed the ambiance. Highly recommended!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpaGVPTVpnEAE",
            "text": "Great food and drinks. In two different sittings, Gin and Berry is a good cocktail while food wise, the Shawarma Royale and Chicken Kebab were delicious especially the Royale. The lamb burger was too dry so I wouldn't recommend but a lamb…"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3LUtmaEFREAE",
            "text": "Very good food and prices are fair. They had mousaka, hummus, and truffle. So Mediterranean is the right wording. We had the lamb. It was so soft and Delicious! The Baklava was a bit too dry. Would not recommend that."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZeEpldS1RRRAB",
            "text": "What a lovely place! Stepped in for a quick bite and found the service and dishes fantastic. Yes, portion sizes are a little small for the price, but I'd say the flavors and quality are worth it. Had the eggplant/lamb and the…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNMTdySU5REAE",
            "text": "Really delicious food! Wild mushrooms, lamb chops are so yummy! Highly recommend this place if you want delicious food and cocktails! Will definitely go back!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBdTVyMDd3RRAB",
            "text": "Wonderful authentic Mediterranean meal. We were visiting NYC and of course overwhelmed by all the food options and we were so happy we chose to eat a pre-theatre meal here after hearing the dishes are made from a grandmother’s recipes. We opted to go the tapas route as opposed to large entrees and it did not disappoint. The classic falafel + hummus was up to par, followed by two of the most incredible seafood tapas we’ve ever had (the octopus paired with chickpeas, blistered tomatoes and a lemon/olive oil dressing) and the snapper/tuna ceviche (Best ceviche I’ve ever had, mixed by a beautiful yogurt sauce and with tabouli). We also enjoyed the moussaka and lafa TACO (made us wonder why Greek tacos aka the delicious meat, sauces and pita bread are not a thing everywhere). The service was also great and attentive and our server helped us decide on these fabulous dishes. I’d recommend to anyone looking for a pre-theatre meal since it was only a 10 minute walk from the shows."
        }
    ],
    "reviews_count": 83
}