{
    "name": "Westville Hells Kitchen",
    "place_id": "ChIJ_YRY8BlZwokR8m3JbEtPM1s",
    "grid": "MN4",
    "address": "809 9th Ave 2nd floor, New York, NY 10019, USA",
    "rating": 4.5,
    "user_ratings_total": 610,
    "phone_number": "(212) 924-2202",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poYVVHSlNabXQwWjFaUGNFeEpPRmN4TFZZd1puYxAB",
            "text": "Tasty food and great staff"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkaFZXVjNUa1pCZHpCWFNFZEVVRTQ0TjI4MVUyYxAB",
            "text": "Always love coming back to this place, great and kind service, tasty healthy food, and wide variety to choose from!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWaGJqWm1ha05qVmxacWJVTXRNVXAzTldOcVdFRRAB",
            "text": "Keyla was amazing!  Very attentive and friendly.  The food was very good!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWWJ6SjVOVGhIZERBMmFIcHhiVkpxVFdKelNYYxAB",
            "text": "As a mixed diet family, it’s important that I can find vegan friendly restaurants. Westville had a good balance of options for us. I had a Beyond Burger that was exactly what I needed. The Russian dressing and vegan Gouda were the extra the burger needed. The service was timely and pleasant, the vibe was chill(good music and tables clearly having a good time). The prices were respectable in an area of NYC that can be expensive for the simplest of things."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tScmNYbDBZME10YVdONVltVTVMVkZNV1RRMVQzYxAB",
            "text": "worst chicken tenders i’ve ever had in my life"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSaFpVMW9OemxZYVZwSmVUWkljVlEwYUhwMVNVRRAB",
            "text": "No vegan hot dogs, service not good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNWFrTllUekpYWWtjd2J6ZzBVRkZKVEdWWWEzYxAB",
            "text": "Excellent healthy food options.  Got the steak and chicken with a side of kale.  Great preparations and quick to come out of the kitchen.  The water service could be a bit quicker and colder temperature but overall a great experience and would definitely go back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kQ1MwTkxlVFExUzFSM2FraHVhbkI2V1ZaRlluYxAB",
            "text": "So good, awesome service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjMGVWTTVWVEpNTUdoVU5HTkZiVVI1Tlhjd1UwRRAB",
            "text": "Food was good, good price"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOT2JFcDZOalp0VW14cGFIWXljVTlZU0dkc2VsRRAB",
            "text": "Delicious brunch - picked this place out of a hat but have no regrets. Food came out VERY quickly and it was perfectly cooked/made."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wNU1IVlBVWFZEYldVMU0xcG1OemwyUm1oVlQwRRAB",
            "text": "This restaurant will go in my location of theater places to dine.  Good food, good service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WaGFYQlBWMXBLU1hCb1ZERllTM1pET0dkeFJWRRAB",
            "text": "Amazing burger. I haven’t had a burger this yummy and juicy in a long time.\nFriendly service, pleasant atmosphere. I already told my friends to come grab a burger for themselves…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1aFNXYzNaVTFLYnpNMFl6ZHNibUZRYzJKUFpsRRAB",
            "text": "Really great and fast service.  Healthy choices. Good prices"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMFlUUmpSM3BvUjNONE5rcGhSMlo0YkRRdGJXYxAB",
            "text": "I had the chicken plates 2 sides.  Delicious!  And for a good price!   Loved having so many healthy options to choose from!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWGEzSkJla1JDUWkxbk4wcGtSbGwwV1VaUWRIYxAB",
            "text": "Salad tasted of chemicals and there was hair in it. Bad service, would avoid this chain, you can do better for cheaper."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4RU1HMUZhSFI1UmtsVlJVa3hOblJYYmsxWWIzYxAB",
            "text": "I’ve only had the salads here but they’re good, the place looks clean and the staff are very nice."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oYVVHOTZUVTVrZFZnelgyZEdiMXB3VFhKT1gyYxAB",
            "text": "Honey Chipotle Salmon Rice Bowl was good. The Birria Empanadas were insipid and the sauce, bitter."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tscFNsWnJYM1JzYkRKR05VVnBXbTVTUlRSV1kyYxAB",
            "text": "I enjoyed an excellent kale salad with grilled salmon for lunch with their frozen summer sangria. Very comfortable and relaxed atmosphere. Great place to sit, relax and enjoy a meal made with fresh ingredients."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psRGNHbDVWbGxEY25GelNFWmlPVzVtVVhsNWVXYxAB",
            "text": "Yum! I love it here. Always good, healthy food. I go a lot."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tabmEweDRTMGQ0VkdrdGFsaG9TRFIwY0hrMlJtYxAB",
            "text": "Nice menu across dietary needs.  Tasty, creative, and well priced"
        },
        {
            "date": "3달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5S1ZreEpPSFpPYlUxSWNpMVdXVTVKV2tOZmFuYxAB",
            "text": "Restaurant tres agréable. Mes enfants ont pris les hot dog, à priori au top, ma salade était excellente."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWFZtRmFYM0ZTYWtOdFdtd3paVE0yVVdneFMyYxAB",
            "text": "Pick 4 of your favorite fresh vegetables. Also sweet potatoes fries. Or something else like a veggie burger or hot dog."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxR2Myd3daVmt3TVVJd1FsUXpWV1p5TlZac1JGRRAB",
            "text": "Usually super fast service, good quality food and drinks"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPLWgzZmFIdnQ2ZEJ3EAE",
            "text": "Las atención a a cliente está pésimo"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkYWN6bFZhVjlzUlUweFVUQlZkMWxZZFZBelpVRRAB",
            "text": "Good food, decent value. Lots of healthy veggie options."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJN0o4ZW5Gby1xOW93RRAB",
            "text": "I ordered a Chicken BLT sandwich from this place and got food poisoning. They didn’t cook the chicken good. Never ordering from this place again. I hadn’t eaten anything else besides that sandwich during the day."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQRHp1cEgweWNhNG1BRRAB",
            "text": "We were a party of seven. Everyone’s meal was excellent!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPT3E4TVRMdWNIdUpREAE",
            "text": "Excellent, tasty, healthy food and a kind, thoughtful waitstaff."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaWJQcjVnRRAB",
            "text": "Terribly sorry to be honest…I had high hopes for Westville HK, but it didn’t quite deliver this time. I ordered the turkey sandwich, and unfortunately, the bread was really dry—it made the whole thing hard to enjoy. The turkey itself was piled on thick, which sounds great in theory, but it felt a bit overwhelming and not very balanced. The fries were just okay, and the ranch on the side was decent but nothing special. I expected more from a place with such a solid reputation. Maybe it was an off day, but overall it didn’t leave a strong impression."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvb1p1SGR3EAE",
            "text": "Good, healthful breakfast with plenty of choices."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvZ3B6dEV3EAE",
            "text": "One of our favorite places for brunch. Nice, healthy food, efficient service, and super friendly staff with a cute ambiance inside. Their Egg Benedict is a win! We went last Saturday and ordered our usual California Egg Benedict with smoked salmon on top. The portion is always generous—fresh, crispy salad, perfectly ripe avocado, and a delicious poached egg served over crispy hash browns instead of bread (which I love).\nAlso, I really enjoy their regular coffee—it’s tasty, medium roasted, not bitter, and comes with unlimited refills. Their cappuccino is great too!\nFor dessert, we usually get the apple pie with walnuts à la mode. So good—warm, comforting, and perfectly sweet.\nHighly recommend this spot. Great value for the quality and portions!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNTRIbjZnRRAB",
            "text": "The food was wonderful and the atmosphere was fantastic"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJODkyWFVREAE",
            "text": "Fresh seasonal variety.  We had a bunch of everything.  It was great."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaE83YnVRRRAB",
            "text": "Comida de muy buena calidad y muy buen precio."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJN3N6MjFRRRAB",
            "text": "Excellent brunch place, with a variety of delicious and healthy options"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNkxmYjd3RRAB",
            "text": "Favorite neighborhood spot"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUcmF1cGpRRRAB",
            "text": "We had a team lunch delivered from here, and it had a piece of hair in it. We called to address the issue, and they offered to refund the meal without any apologies or any way of acknowledging the situation. Food is always good here, but moving forward, this will be our last business with them."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3a3M2M0NnEAE",
            "text": "Westville in New York, NY. Westville has a great happy hour and so many great specials to check out. Not only are the drinks amazing the food is so fresh and delicious! Chances are that there is a Wetsville in your neighborhood but I got to try Westville Hell’s Kitchen. Super cute decor-perfect for a date night or a fun friend’s night out. We took advantage of the happy hour and yummy food options!\n\n🌀 MARGARITA- classic, smoky, or spicy w/ lime, orange, agave\n\n🌀 SMOKY MAC & CHEESE\n\n🌀 GREEK SALAD- cherry tomatoes, cucumbers, marinated red onions, olives, & feta over romaine & mixed greens w/ balsamic lemon dill vinaigrette & a grilled baguette w/ herbed goat cheese\n\n🌀 GRILLED MARINATED CHICKEN BREAST- served with 2 market vegetables\n\n🌀 GRILLED MARINATED CHICKEN BREAST- served with 2 market vegetables\n\n🌀 ESPRESSO MARTINI- vodka, kahlua, vanilla, counter culture espresso"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbGVEbVJREAE",
            "text": "the food was very good, we ordered the buttermilk chicken sandwich with sweet potato fries & it was amazing. as well as the burger which my bf says is a 8/10. the tables are small but it’s a nice atmosphere."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcWRtS3JnRRAB",
            "text": "Normally I am not the biggest fan of diner food but Westville pleasantly surprised me! I ordered the omelette with sausage and green onions, which came with a generous portion of salad and bread on the side. For just $13 (before tax and tip), this is a great deal for a hearty breakfast/lunch in Midtown. Easy enough to find a seat and the service was quick as well."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRd3ZiNnd3RRAB",
            "text": "This place has it all. Ambiance, football games, fast service, and, more importantly, impeccable tasting food.\nCame in without a reservation, and they immediately offered us a spot at the bar, which I personally prefer a lot more. The bartender was incredibly nice and made sure we were taken care of.\nNow, about the food.\nI ordered the Southwestern Brunch Burrito, which came with either home fries or a pickled salad, I choose the home fries. Even though the burrito was delicious, those home fries were on a whole nother level.\nSautéed to perfection, beautiful onion, and pepper flavor, but not enough to overpower. The crunch, texture, and flavor were all on point.\nMy friends had the California Benedict, which they devoured within minutes. The yok was done to perfection, hollandaise sauce spot on, the arugula which came with it paired beautifully. A GENEROUS amount of avocado was set on top of a super crispy homemade hashbrown....speechless.\nEconomically, not too expensive given its NY. The three of us paid $80 total minus tips.\nOverall, highly recommend giving this place a try."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRMDkyRzdBRRAB",
            "text": "A great place for a group since there is something for everyone. The pozole was so delicious, my only regret is getting the cup and not bowl (quite zesty with the lime which makes it). The roasted sweet potatoes were great as well. Not pictured, but a great main was the birria sandwich (the consommé is spicy, so be mindful of that)"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRektLcE5nEAE",
            "text": "This place is amazing! There is such a wide selection of delicious items on their menu so I truly feel that you cannot go wrong with anything you get here. We ended up ordering the fried chicken sandwich, CBLT sandwich, parmesan asparagus, vanilla latte and the blueberry spritz mocktail."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneWZiQjdnRRAB",
            "text": "Good time and a great vibe! Staff are fabulous! A+++++++++"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBel9yQ2RnEAE",
            "text": "Great chili!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnaUxUbnlnRRAB",
            "text": "Use to love it, but with expansion of locations, quality as so often is the case, has gone down. Last 2 times, the turkey burger I used to rave about, was bone dry...almost inedible the last time. Toppings which cost extra were barely existent. Sides still have some nice healthy choices but overall, the food wasn't enjoyable recently."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBXzkzTXNnRRAB",
            "text": "Exceeded my expectations. The veggie options are fantastic. Portion was large and i really enjoyed my meal. The chili was basic, was kind of bland. Service was good, food took about 25 minutes to be served.  Brussel sprouts were fantastic, along with the other veggies i got.\nIts busy spot, Make reservations, i went on a tuesday at 6pm and there was no seating available, bar seating only available\nSpicy margarita was good with a kick, and drinks for happy hour is 3pm to 7pm. I'll be back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcWVfSUVREAE",
            "text": "Salad was amazing. Super complete. People were nice.  Prices are ok"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfcGJQWEVREAE",
            "text": "Went there for the first time last week. Very cool place and yummy food. The waitress was awesome too!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOHFqOFNBEAE",
            "text": "Best staff! Really great. Had lunch years yesterday. Loved the SHRUB drink I got too. All the staff were incredible."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREcjdxb0NnEAE",
            "text": "Looking for a brunch spot for you and your friends can be very overwhelming because there are so many options. The staff was friendly and the service was fast. But the food was DELICIOUS and didn't break the bank. This was one of the better brunches that I've been to in the city. We all ordered different things and they were all home runs. I had the Kale Salad with Salmon and as simple as it was, it was perfectly paired with the right flavors. Definitely going there again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4d2FQSS1nRRAB",
            "text": "We made diner reservations on a trip visiting from Minnesota. I have to say we had a GREAT experience. The food was delicious, well prepared and the service was extremely fast. We had opted to sit at the bar instead of our reserved table and we had an amazing experience with Frankie U as our bartender. He was fast, friendly and had great recommendations for us. We would absolutely recommend this place and definitely come back again when back in New York."
        },
        {
            "date": "수정일: 1년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMV9IekpREAE",
            "text": "Tive  a oportunidade de visitar o Westville e fiquei encantada , desde o atendimento até a qualidade da comida. É um lugar simples gostei muito.Fui recebida pela Ivana, que me atendeu de maneira excepcional. Ela foi super gentil e atenciosa, oferecendo um lugar para me sentar e um copo de água enquanto aguardava meu pedido para viagem .\n\nO ambiente do Westville é aconchegante e acolhedor, perfeito para uma pausa relaxante . Agora, sobre a comida: quando meu pedido chegou, o aroma era simplesmente irresistível. Eu pedi as Truffle Fries e o S'more Mac and Cheese. Que delícia! A combinação de sabores estava perfeita, e fiquei realmente tentada a comer ali mesmo, de tão maravilhoso que estava o cheiro.\n\nAs Truffle Fries estavam crocantes e bem temperadas, enquanto o S'more Mac and Cheese era cremoso e delicioso.\n\nParabéns à equipe do Westville. Definitivamente voltarei para provar mais delícias do cardápio!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0OGNpSE5nEAE",
            "text": "Ottimo locale con vasta scelta tra antipasti da condividere, insalate e portate principali con numerosi contorni vegetali. Ottima scelta anche per il brunch. Personale cordiale, servizio rapido. Rapporto qualità prezzo corretto. Consigliato, facilmente raggiungibile a piedi da Times Square!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0dDQzV3lRRRAB",
            "text": "My friends recommended this place for the branch, and I am glad I followed their advice. The service was fast and friendly, and the food was lovely. I am planning to come back to try their regular menu. I will post an update then."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmOWJ2MUh3EAE",
            "text": "Es un lugar muy acogedor, la atención es excelente porque la mayoría de los empleados están pendiente que no te haga falta nada así que eso hace que el lugar destaque!! La comida es buena, las margaritas le falta mejorar pero no es mala!! Es un buen lugar para compartir"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHeGNUV093EAE",
            "text": "I had the burger here and it was a burger haha. Was it the best burger I've ever had? No, but it was better than like Applebee's and cheese factory type of places. The fries were good and everything seemed fresh. I posted the food my friends got too. They enjoyed the food too, but one said he felt sick later that day and said it was the salmon, but not sure. We did eat ice cream that day so it could have been that lol. Our waitress was nice and not hovering over us so I like that.\n\nPrices were city prices so not cheap eats. Clean place. Laid back for sure."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwMTRMVjRnRRAB",
            "text": "Delicious brunch at a great price in a small, cozy atmosphere. The Cali eggs Benedict are are A+ and you get more than your money's worth just in avocados. Good cocktails as well and always great service. One of my favorite city chains."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHa0pTeHZ3RRAB",
            "text": "I think the summary here is easy you get a good meal at a reasonable price.  I ordered the cinnamon Old Fashion and was wowed so so tasty.  The salmon was also solid especially with the accompanying sauce.  So many restaurants are out of…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLNWR6WnNnRRAB",
            "text": "Excellent food and options! Wonderful\nService!  Nice vibe!  They have indoor and outdoor dining options.  Went here for brunch and we were welcomed nicely and got seated no issues.  Definitely check this place out for brunch!  I highly recommend this place"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPbzktVDh3RRAB",
            "text": "¡Hola a todos! Ha pasado un tiempo desde que fuimos allí. Era un sábado por la tarde, un día caluroso. A simple vista la comida tenía toda la apariencia de ser muy rica, con solo mirarla ya te la querías comer....! Pero desafortunadamente los sabores no se mezclaron, mi plato fue con champiñones, huevos, queso y una mini ensalada. El queso era una de las cosas que no podía sentir en la boca, los champiñones y los huevos no se mezclaron bien para mi deleite. Las tostadas de aguacate y huevo fueron muy regulares, empezando por la tostada que no estaba bien tostada y no sentimos fusión entre los ingredientes. La atención dentro de todo fue bastante buena, me gustó mucho el ambiente. Creo que deberían trabajar un poco más en la comida...\n\nHello everyone! It's been a while since we went there. It was a Saturday afternoon, a hot day. At first glance the food had all the appearance of being very tasty, just by looking at it you wanted to eat it now....! But unfortunately the flavors did not blend together, my dish was with mushrooms, eggs, cheese and a mini salad. The cheese was one of the things I couldn't feel in my mouth, the mushrooms and eggs weren't blended well to my delight. The avocado toast and egg were very regular, starting with the toast that wasn't toasted well and we did not feel a fusion between the ingredients. The attention within everything was quite good, I liked the atmosphere a lot. I think they should work a little more on the food..."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPNllURm5BRRAB",
            "text": "Westville in Hells Kitchen is a lovely restaurant for any occasion when you’re in the neighborhood.\nThe food is delicious - honestly, finger-licking good! Try the mac&cheese as a starter.\nGreat drink menu and a good selection of spirits at the bar.\nThe staff isn’t just lovely and friendly but also super attentive, even though the place was packed when I ate here. A must-visit when in New York."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMc3JHcWZ3EAE",
            "text": "Satisfying, just right, hit-the-spot, delicious & healthy, vegetable-forward fare that didn’t “break-the-bank”.  We were rushing & walking fast from Chelsea to Lincoln Center, for the Tonys, but it was a hot day and we needed beverages and a quick nosh.  The service was courteous, efficient, and friendly - and we experienced great hospitality.\n\nOf all the eating possibilities on 9th, Westville looked quick, yet full service - and BONUS!  It was Happy Hour with refreshing beers-on-tap.\n\nWe ordered lite:  Beets & Goat Cheese and Cauliflower & Tahini - SO GOOD / SO HEALTHY - and frankly, I would crave this food in future.\n\nSo we’ll definitely be back.  Lite, simple, satisfying, and convenient - try for yourself and see if you don’t get hooked too!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtZ0pfbXVRRRAB",
            "text": "Perfection. It's been a long time since I dined somewhere that was excellent in every way. We were a group of six and the place was packed, but the staff made it work and they were very kind the whole time. Our server was delightful, and we were also very impressed when our food was ready in just 20 minutes! Everyone there is definitely very on top of things, they had staff always going around to make sure that everyone had everything they needed, even though they were super busy.\n\nAnd of course, the food was delicious. Excellently made, and the perfect portion size to leave you full and satisfied but not overstuffed. I highly recommend to anyone who happens to be in the area!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXbVBydzN3RRAB",
            "text": "Brunch menu for dinner is the best! This place is always packed. I ordered roasted salmon with brussels sprouts and kale sponach. It was soooo good! My friend ordered salmon teriyaki but honestly it’s not really teriyaki. So, I’d say stick with the basic. The sides are great as well: truffle fries and fried brussels sprouts. Would def come back for other dishes!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZcXFPQ2FREAE",
            "text": "We went for lunch. The place is great and very cozy.\nThe service was excellent and the food was amazing!!\nI strongly recommend the yuca fries and the chicken cutlet. The turkey burger was dry.\nOverall nice place. They recently opened at this location. Give them a try!\nAnd I definitely will go for brunch on weekends!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyaE5mX3pnRRAB",
            "text": "I’ve always had a good experience here - the servers are nice, food comes out quick and is also delicious. Lots of great options, especially healthy delicious ones.\nThe good stuff - pesto/garlic mash, tuscan green salad, chicken cutlet, truffle fries, any margarita flavor\nAlright stuff - yuca fries, chai latte (could be good with less ice, very watered down)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpaGEtb1VBEAE",
            "text": "Went for brunch. The food was good, service was great. I think the ambience and decor could be better. But overall experience was not bad. Didn't have to wait at the hells kitchen location, which is an added bonus."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobzZDbGxRRRAB",
            "text": "Yummy healthy food. I had the Arugula and Parm salad with Salmon. It was very tasty and fresh. I also stole from my friend’s plate. I’ve never tasted beets so good and the mushrooms were well done. I’m glad I found this spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURId29yVzNBRRAB",
            "text": "Love Hell's Kitchen Westville! Chill vibe, friendly service, and great food. Best veggie burger and tea in the city!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQycE1lQUFREAE",
            "text": "This place is popular for a reason: awesome food, very nice selection of vegetables and vegetarian dishes, drinks and beer are well prepared. Highly recommend!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDMjVDN0xnEAE",
            "text": "A cute place to go to for weekend brunch for sure. Good food, pretty decently paced service, and kind staff. Got the poached eggs over the kale and sprouts Caesar salad with fried haloumi cheese and avocado. Would def recommend. Has a nice atmosphere as well."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPby1LQmZ3EAE",
            "text": "Great restaurant, delicious food, lots of greens to choose and fresh , affordable. Super friendly staff and quick service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5c2R6V1NnEAE",
            "text": "This place is a must visit for Brunch.  Alejandro is an awesome server.  Try the cauliflower side and the California Benedict."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpeHJEMGVnEAE",
            "text": "Just got a delivery. All was awful.\n1. Schnitzel was nothing to do like the photo - not herbs no charm. Soggy, bought and heated. Yak.\n2. Turkey burger was a sad patty with no taste. The buns were dry.\n3. Schnitzel sandwich as sad as the above.\n4. Hot dogs were good.\n5. Mashed potato with peso was awful too.\nWhat a mistake."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNcWVxYnJnRRAB",
            "text": "I order from Westville on a weekly basis and I must say it’s one of the best places for satisfying healthy eating. I always order the arugula and parm salad with avocado and grilled salmon. It is fresh, clean, simply prepared yet very filling. The only “con” I would say is my salads are never really consistent, the amount of avocado always varies and same with the size of the piece of grilled salmon. Last week my lemon olive oil dressing tasted only like seasoned oil (which was still very good) and today my dressing tasted like I was biting into a lemon (way too tart but I just used less and it was still enjoyable). My coworkers started to follow suit and ordered from there today, nothing but positive reviews for the Cobb salad, Greek salad, and sweet potato fries. Really great place highly recommend trying here if you haven’t"
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6bE9lVTVnRRAB",
            "text": "Super restaurant, sûrement l’un des meilleurs de notre voyage à New York. Du goût et de la qualité. Je recommande fortement surtout pour les français qui cherche un peut de saveur"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvem9yUG5nRRAB",
            "text": "Great veggies, friendly service, cozy venue. They are very generous with their market plate servings and the smokey mac n cheese could be an entree on it's own. Be sure to ask about what desserts are available, they have a wide array for fruit based options and carrot cake."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtNHBHLTJnRRAB",
            "text": "Loved the market vegetables choices. Being a vegetarian, it's sometimes difficult to find options. This place had ton load. My son loved the soy hotdog. Ordered them twice 😁. Ordered a Bloody Mary after seeing so many pictures. Not a big…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZeVBlSndRRRAB",
            "text": "Incredible place!\nEveryone should try it at least once in a live. They also have one of the friendliest staffs in NYC.\nHealthy-Delicious-Cool\nWhat else do you need?\nI will come back!! Loyal customer 👋🏼"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxdXJLTkhREAE",
            "text": "Very friendly staff and pleasant atmosphere. The food was pretty good but not great. Brussels sprouts were over fried and hard. Cauliflower was good. Kids chicken fingers and fries were excellent. Grilled salmon was OK."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2a3ViZmh3RRAB",
            "text": "Decent brunch, but not spectacular. The flavors could have been more developed in the dishes.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNldUlYWUhBEAE",
            "text": "Decent brunch place. Staff brought out the food\nPromptly. Waffle and fruit was good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHai1yZzFnRRAB",
            "text": "The staff were very friendly and accommodating, especially for a group of 6. The food was prepared much more quickly than expected for a completely full restaurant. I tried the Portuguese Eggs Benedict and their lemon lime ginger spritz.…"
        }
    ],
    "reviews_count": 84
}