{
    "name": "Amarone",
    "place_id": "ChIJSXK5RFFYwokR0FRZOB_pvDg",
    "grid": "MN4",
    "address": "686 9th Ave #1, New York, NY 10036, USA",
    "rating": 4.4,
    "user_ratings_total": 1237,
    "phone_number": "(212) 245-6060",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jNFZGWjVUVlZNTVhoTmNqSkRRbmwxT0ZFd2IyYxAB",
            "text": "A Manhattan restaurant that interprets “extra dry Martini” as adding extra dry vermouth—even after clarification, twice—is done ⚰️"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sNU55MVNURlJOWVVOUUxXZDVjR3hrU1VsT2FVRRAB",
            "text": "We hosted a business dinner at Amarone.  Shockingly, they did not have any bottles of wine for purchase, stating only glasses were available as they were in the process of changing their wine selections.  We then ordered individual glasses of wine, and the white wine was served  very warm.  Once we alerted the server, he understood and took the whites away, offering to chill the wine,  but that never was to be.  Food was adequate but nothing too impressive.  We will not return to this restaurant."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2X29xcUt3EAE",
            "text": "Beware !!! Worst Experience in NYC Stay Away!!!!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NeVIzcG9VemxtUmtneU1rWlFUbHBtVVdGMmRWRRAB",
            "text": "Tuvimos mala suerte, el pollo de la ensalada no nos gustó, sin embargo el sitio estaba lleno y muchas opciones mejores. Recomiendo con reserva"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WWk5teGxORjlTWmt0WWNrUlZWRkkwYkZoMVVXYxAB",
            "text": "The minute we walked in the atmosphere was incredible. It was very low key, exactly what we were looking for around the hotel near Times Square! The staff was courteous and polite. The food was absolutely amazing! My girlfriend and I will most certainly be going back every time we go to New York!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VelpGQmplRmxqUlRkMFpqazRVR2d6Y2pOV1ZVRRAB",
            "text": "Met some friends after a bridal shower and had a great time. Great tiramisu and espresso"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWlNWRmFSbFU1UjBGTVJFOXpOM05JT0ZoNFdGRRAB",
            "text": "Great experience. The staff is attentive, the food is terrific and the vibes are welcoming. Would recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5VlpXSnpWMlZpYlVaU2FUTmhMV1JSTXpKUlUxRRAB",
            "text": "I recently had a bridal shower at Amarone and it was a 10/10 experience! Everyone was happy with their dishes and the service was excellent. I can’t wait to go back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vMWQyWldVa1UwTjFOeVRYWjRaMTlGYldaMVExRRAB",
            "text": "This quaint Italian restaurant on Ninth Avenue is a respite from the crowded and noisy eateries that the posh set dine at. The servers are warm, the food excellent and the ambiance transformative. Visit Italy in the city"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOVVZFVTRTVGRJUW5sVU5ITm1NMmhGUXpSWVZVRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️ A Hidden Italian Gem\n\nOur experience at Amarone was absolutely incredible. From the moment we walked in to the last bite of dessert. The ambiance was warm and welcoming, setting the perfect tone for the night.\nWe were lucky to have Sergio as our server, he was outstanding. Friendly, knowledgeable, and attentive, with excellent recommendations that made our meal unforgettable.\nThe food? Next level. Every dish was flavorful, perfectly seasoned, and thoughtfully prepared. The chicken parmesan and rigatoni truly left us speechless, easily some of the best Italian food we’ve ever had. And just when we thought it couldn’t get any better, the crème brûlée arrived and completely sealed the deal. The texture, the flavor, the presentation was perfection.\n\nThis place is more than just dinner; it’s an experience. Whether it’s date night, a celebration, or just craving quality Italian cuisine, Amarone is the spot. We’ll definitely be back.\n\nHighly recommend this is a hidden gem you don’t want to miss."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3azR6U1hREAE",
            "text": "Came for dinner. Had the Beef Carpaccio appetizer which was subtle yet flavorful. Paired with the bread and sauce, I scraped the plate literally. For the main course I had the chicken amarone, the taste nearly knocked me out my chair! Incredibly delicious! Chicken wrapped around fontina cheese with an exquisite cream sauce. After I was done I grabbed another piece of bread just taste the sauce again. I took my dessert  of chocolate cake to go which I’m sure will just as delicious. I will definitely come back for more. The staff were wonderful and courteous as well. Compliments to the chef. I would recommend."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3c3R1T0p3EAE",
            "text": "This place sucks. Staff is rude, they just close randomly, no signage on the door. Overpriced. Bad service."
        },
        {
            "date": "8달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNReE9DY0x3EAE",
            "text": "Super resto Italien.\nC'est frais, c'est bon.\nRien à dire de plus.\nMerci"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMThtVXJRRRAB",
            "text": "Great place for intimate/romantic dinner.  I made a reservation at 8 but i didn't need to. The pasta was really good. They added something like lemon zest or similar that gave such a flavor 😋  the salmon was really good. With chocolate cake at the end 😋 perfection!  It is not cheap yet still cozy."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBejZHSnZ3RRAB",
            "text": "Wonderful and attentive restaurant. Beautiful inside and extremely comfortable. Great food and a better than average liquor selection."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOUs2RmRnEAE",
            "text": "Always consistently good"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNUxTaDNRRRAB",
            "text": "As others have said, what a GEM.  This is a pretty small spot, that I have managed to miss despite living in the area for over 10 years-  but wont miss again.  The service was close to what you would get in a 5 star restaurant and the food was excellent in both presentation and portion size and taste. We had Brian as our server/manager and he ensured that every thing flowed smoothly - the new owners should be very proud of the product they are putting out.\n\nAtmosphere is cute/chic, it wont impress your first date, but your wife would love going here -  if that makes sense\n\nUpdate:  Went back a few weeks later with friends and they managed to surpass my already sky high expectations. I have never experienced such professional service in a casual restaurant -  whoever is in charge of the training is doing an incredible job and Brian (the manager) was always nearby to greet us, thank us for coming and help out the servers when it got a bit busy."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNDZlN1hREAE",
            "text": "This little hidden Italian Gem is fantastic!! From the ambiance, the espresso martini, the appetizers, to the dessert, everything was beyond delightful. My sister and I dined here on a Tuesday night, Brian was our server (and bartender). We kindly had asked him if we can take our time throughout dinner as we had to kill time for a Broadway show we were seeing later on. He was so kind and accommodating and made sure we weren't going to be early and making sure we weren't late for our show! The prices were also very reasonable for the quality of food. Definetly recommend if you are looking for an Italian place to eat at in Hell's Kitchen! It's also a very convenient place to dine if you're going to show on Broadway (only like a 7/8 minute walk to Broadway1)"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dE5PMEV3EAE",
            "text": "This was a great small Italian joint that caught our eye and was totally worth stopping by. I highly recommend sharing some appetizers and trying their espresso martini. The staff is also incredibly attentive and knowledgeable about the menu, wine, and other facets of service. The highlight was the Chicken Amarone and the Arancini"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dTREd0ZREAE",
            "text": "Very good!  We had a reservation and arrived 10 minutes early and they had a table ready quickly!  Very much appreciated since it is so cold outside!  Chicken parm, bolognese, and salmon were great. Would recommend!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQaHF1TFFnEAE",
            "text": "Let me start by saying I rarely leave reviews (good or bad). We had a 5:00 reservation on Friday night and were one of the first tables in the place.  There were lots of employees wandering around but we weren’t visited by anyone for at least 10 minutes. That happens….I get it. However, what I noticed throughout the night is that most of the employees were bussers/backwaiters and couldn’t actually take an order. The main waiter seems to be the manager. He was nice but had way too many tables to manage for it to be a good experience. Everyone seemed to be looking around for service. Not good.\n\nAll of that could be forgiven if the food was good. I say this as someone who eats out several times a week. After 30 minutes of waiting, I’ve never had worse food in my life.  My kids ordered spaghetti and it was inedible. I tried it and it tasted like it was in a microwave for 2 minutes too long.  I’ve never had crispy spaghetti.  I only say that because I watched an employee come through the main dining room with a stack of store bought pasta dishes from a market nearby.  I was floored. Who knows, maybe it was for them after their shift. It’s what I saw though.\n\nMy wife had GF pasta primavera and it made my kids meal look like a Michelin star dinner. It was horrendous. You’re probably thinking….this guy and his high maintenance GF wife are insufferable. I can assure you we’re just normal, reasonable people who eat out a ton.  It was like eating bits of flavorless wood.  I’ve eaten a lot of GF meals in my life and realize it’s not always the best. This was not that. This meal should have never made it to a plate in any restaurant.\n\nMy seafood risotto was mediocre at best but was definitely the star at our table. I could have gotten the same thing from the frozen food aisle though.\n\nWe couldn’t help but laugh at the entire situation.  Food was going back left and right around us and we were trying to wrap our brains around the disparity between the good reviews and our experience.   Maybeww it recently changed ownership?  Maybe they just had an off night?  I don’t know.  There are a million other places I would go before giving this another shot though.\n\nGood luck."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdVBXNXRnRRAB",
            "text": "Excelente servicio, comida deliciosa."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQcHZXUzVnRRAB",
            "text": "My husband and I thoroughly enjoyed our experience dining here while in town to see a Broadway show. The restaurant was conveniently located near our hotel and the theatre. The service was excellent and our meal was delicious! We shared a bottle of wine along with our pasta dishes. We even ordered dessert. It was a lovely experience and we had plenty of time to walk to our show afterwards."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdlpDVTJ3RRAB",
            "text": "Great food, amazing service, wonderful atmosphere. The authenticity really makes Amarone stand out. Our server Philippe was so attentive, accommodating, and helpful - our food came out fast and all of the staff were professional and helpful. We ate here on the last night of our visit to NYC and would do it again! Incredible experience overall, could not recommend Amarone enough!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzaUlpTDJnRRAB",
            "text": "Unfortunately the worst food we have had so far. The seafood and chicken were way overcooked and our risotto and gnocchi were bland."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbjZpZUl3EAE",
            "text": "Authentic Italian dishes that are to die for"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzODgtTzRBRRAB",
            "text": "Food and service were wonderful. It was our anniversary and the staff went out of their way to make our night special. Food was delicious. Arancini were amazingly tender. The lasagna was great, ad was the lobster ravioli special. Prices were in line with NYC and restaurant was busy but not overly crowded for a Friday night. Highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMktqbnpBRRAB",
            "text": "We dined around 7 p.m. on a Saturday night in late September. This is a hard review for me to write because the food we actually got was good, but the service was bad to an extent I have rarely experienced, and there seemed to be no management around to observe and help the server who was clearly struggling. It was busy, but not crazy, so I truly was expecting more. I hate to be so critical of the service when the dining room support staff (the gentleman doing bread and water service, and helping to run and clear food) were exceptional. They were like a dining room pit crew, it was just too bad they didn't have support from the servers and management. We never get everything we ordered, not even after reiterating it to the server at least four times. And not once did she ask if we wanted more drinks. She was so confused she tried to offer us dessert after we'd only had salad and seemed baffled when we kept trying to explain we'd never gotten our appetizer or entree. The salad was excellent as was the Rigatoni when we finally got it, I was just too hungry and frustrated to even take a photo of it. Other tables were also very frustrated, with one leaving in a huff, people clearly irritated at not being to get or pay their check (took way too long) and the table next to us had at least four bread baskets since no food was coming. I cannot imagine we would go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYODhTZ3NBRRAB",
            "text": "Wonderful restaurant! Small but cozy and the staff is top notch. Francisco and Camilo were our waiters and they were very kind and extremely attentive. The food was delicious and great portions. To finish the night my wife and I share some cream brûlée and a capuchino, it was amazing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbnB1MTNBRRAB",
            "text": "Quaint little Italian joint, with reasonable portions of tasty classics. The Chicken Amarone is a star dish!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcF8ydW5RRRAB",
            "text": "The food was amazing, the service was impeccable, and the prices are on point!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMjhIazdBRRAB",
            "text": "We got there really late and were the last ones there, but they still served us, and we had a great time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuN2ZTUWRBEAE",
            "text": "Stop reading and run to this restaurant! Best Italian food I’ve ever had! I brought my sister and her friend here when they were visiting me in the city - we stumbled upon it and all three of us had some of the best food we’ve ever had. It was so good, I went back the next night by myself and I regret not going the night after."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNub2YtNWZnEAE",
            "text": "Very nice place, clean and comfortable. Good music at a low volume, great for family. Service is excellent! Carbonara and Cacio e Pepe were great, but the capelini was swimming in oil."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIczdiX1FREAE",
            "text": "This is a restaurant we would happily return to in the future . The food was excellent and the waiters created a fine dining atmosphere and experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMllINW93RRAB",
            "text": "Good local neighborhood restaurant. Hold the garlic...."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIeTRLY2RBEAE",
            "text": "Loved the food here! The waiter had lots of recommendations for drinks and appetizers they were both fantastic. But the dinners were absolutely delicious! Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3eG82cFlnEAE",
            "text": "Friendly, mediocre food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3emM3MEtBEAE",
            "text": "A great Italian spot near Theatre District. The owner succeeds in creating an atmosphere of a quant Italian spot, reminiscent of the scene in Moonstruck, thanks to our waiter Alejo. The food was great. We tried the mushroom risotto, spaghetti carbonara with guanciale pork cheeks and veal (Vitello saltimbocca). Flavorful and satisfying, the portions were large and reasonably priced. Our waiter Alejo was very accommodating and greatly added to the atmosphere of the place. We’ll be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3MWI2SGFBEAE",
            "text": "Lovely experience!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNDlQQVB3EAE",
            "text": "Llevo una semana comiendo por New York, y es de los mejores que he encontrado. Muy recomendable."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJakt2amRBEAE",
            "text": "Lovely Italian restaurant accessible to the Broadway theaters."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNieXFDb3pRRRAB",
            "text": "Visite fin juin. Très bien!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURycUxQam1nRRAB",
            "text": "The food is not great, the prices are too high for what you get"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyanU3aE93EAE",
            "text": "The staff was welcoming & couldn't have been more accommodating. I liked that the waiter actually was helpful when we asked for suggestions. The menu offered many options and special dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMzl6ZFl3EAE",
            "text": "Delicious food and great service!! Stopped here with a few coworkers and everyone loved their meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMMVpQUC1BRRAB",
            "text": "Meh! Veal and calamari were overcooked. Don't order. The spinach tortollini was good. The pear dessert was excellent. Overall, I would not return. You gotta know how to cook meat and seafood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdHJPT0NnEAE",
            "text": "Stopped by on a recommendation from our hotel & were incredibly pleased. Everything was so fresh tasting. Best pasta I’ve had in a while. Also great vegetarian options! Our server Alejo was so lovely & attentive. Will definitely be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMb3ZpWjZRRRAB",
            "text": "This is a review written by an italian customer. Nothing compared with Italian cuisine. Wrong cooking and ingredients. The price is adequate for the quality."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MUtLdXhnRRAB",
            "text": "The best Chicken Parm I have ever had."
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdHRQVEV3EAE",
            "text": "훌륭한 음식. 좋은 분위기"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMkpEZGFREAE",
            "text": "We had dinner here before going to a Broadway show, which was very close to the theater we were going to. It was also my sister's birthday and they did up her dessert plate with a candle and happy birthday on the plate. The food was very good but our waiter was really what made it a great experience. He was attentive, helpful and patient. The pear salad was excellent as a starter. The rest of our dishes were good but I'm picky when it comes to Italian food. I tasted the salmon dish and thought it was delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcVpmZVRBEAE",
            "text": "Service was great, I also love the atmosphere here. I would recommend to order Italian cuisine, they make it to perfection. However, the filet mignon I ordered was rare, the outside was too burnt and bitter. The staff were super nice, they offered a tree dessert and it was delicious. Their white chocolate cake with gelato was excellent. Less than $500 for a party of 8 in NYC. Overall, the restaurant deserves a visit, I would not recommend to order steaks from them tho…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUanJLcHV3RRAB",
            "text": "Here is a positive restaurant review for Amarone Scarlatto:\n\nAmarone Scarlatto Serves Up Amore and Authentic Italian Cuisine\n\nIf you're in the mood for an unforgettable Italian dining experience, look no further than Amarone Scarlatto. From the moment you step through the doors, the warm and romantic ambiance envelops you, setting the stage for an evening of amore.\n\nThe menu is a journey through Italy's diverse regional cuisines, with classic dishes executed to perfection. We started with the Pollo in Crusta and Scalopine Al Marsala, and both were cooked flawlessly. The marsala sauce was a rich, savory delight complementing the tender chicken, while the veal was pounded thin and sautéed to retain its delicate flavor and texture.\n\nBut the highlights didn't stop there. For dessert, we indulged in the creamy cheesecake and the heavenly tiramisu - each bite more decadent than the last. The tiramisu's espresso-soaked ladyfingers melded seamlessly with the lightly sweetened mascarpone for a dessert that was both indulgent and surprisingly light.\n\nWhat truly sets Amarone Scarlatto apart, however, is the impeccable service. The staff was attentive, knowledgeable, and went above and beyond to ensure our evening was memorable. From wine pairing recommendations to crumb sweeping between courses, every detail was thoughtfully executed.\n\nWith its sumptuous cuisine, romantic ambiance, and exceptional service, Amarone Scarlatto is a must-visit for any Italian food lover seeking an authentic taste of the Old Country right here at home. Mangia bene!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1cFBQU0pBEAE",
            "text": "Welcome from Tom started this dinner  off on the right foot! We all ordered salad and main course. All fresh and tasty! The photos speak for themselves! Nice outside seating in front of the restaurant and the help was very attentive! Give it a try... you'll be happy! We were!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcHUycUt3EAE",
            "text": "The food is just ok not much of choices. They have lots of wine choices. service is good, atmosphere is ok. Just a regular NYC Italian restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaE5TaE1BEAE",
            "text": "Looking for a great little restaurant before the theater…. Look no further.  Amarone Scarlatto has been serving delicious Italian food for years.  Service is always impeccable.  Chicken Parmesan is one of the best around. Portions are big and prices are reasonable, especially for the quality.  I just love this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCb3ZLa2tRRRAB",
            "text": "WOW! This place was phenomenal! Took my wife here for a nice date night while visiting nyc and came across this gem! Amazing nyc food for a reasonable price!\n\nFirst-The restaurant was very clean. Small, but had a cozy, romantic and pleasant vibe to it. It smelled like fresh cooked food the moment you walked in. I made a reservation on open table and got there right on time and was promptly seated 5-10 minutes. While you wait they have a small bar available for drinks which I highly recommend! The staff was probably the best part. Extremely professional, funny, and you can tell they work hard. They all did an amazing job!\n\nSecond- the food was out of this world! They have a decent sized menu with a lot of amazing dishes to choose from. Me and my wife started off with some salads. I got a Caesar and she got the same. You can tell it’s fresh homemade dressing and it wasn’t to heavy portioned, but was enough to cover the whole salad. For our meals I got the Fusilli Norcia (sweet and hot sausage) and it was honestly top 10 best Italian dishes I’ve ever had. It was a great portion size but not to much. It exploded with flavors and just fresh tasting ingredients. It was presented beautifully. My wife got the pappardelle bolognese and I think that was even better! Generous portion size and it tasted incredible. It was hard not to steal food off her plate! For dessert we got tiramisu and chocolate cake which both were delicious. And ended it with some hot coffee and cappuccino and they were great!\n\nMy only issue was that there was a good amount of time between courses, so be prepared to wait a little. But for how good everything was. It was worth the wait!\nI HIGHLY recommend!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrMjRfbTFnRRAB",
            "text": "A normal restaurant, nothing thematic, or at least not outstanding. We start with two entries; an octopus and an antipasto. If I have to be critical, I must say that the antipasto was too cold, making it lose flavor to the cheeses and meats, however the dish of very good quality. The octopus —> VERY good, recommended!\nDishes:\nfirst plate: risotto with jumbo shrimp.\nSecond: linguine with salmon and shrimp.\nThe risotto cooked to perfection, but if I have to go back, I go back for the pasta... it's amazing 😱\nThe attention it’s beautiful; all very helpful and attentive with us.\n\nDesserts, did not meet my expectations, I recommend desserts far from here.\n\nI recommend this place!\n(The service charge it’s included and it’s for 20%, I agree)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPLXNUbWZ3EAE",
            "text": "This was the most professional food experience I've ever had. Every dish was absolutely fantastic. The fish was cooked perfectly, the pasta dishes were sublime, and every aspect of every dish was the best it could be.\nIt was my friend's first time crying after eating a dish because he wished there was more to eat. That's an amazing accomplishment.\nI will always recommend this place to everyone."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJaHNXaUx3EAE",
            "text": "got in early for our reservation with no problem at all. seating was a little tight but not uncomfortable - place was so popular that there were people waiting at the door to have a table! wine selection is impressive and food came out…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOenVfaWpBRRAB",
            "text": "Great service, nice atmosphere but one of our fish was not eatable at all, we ordered lasagne which was delicious and chicken parmigiana and with this one they have definitely failed. Chicken was chewy and overcooked we even found a piece of bone in chicken breast… not what we expected"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0cUxPczVRRRAB",
            "text": "The crispy calamari was amazing probably one of the best I’ve had. We also ordered chicken parmigiana which was fine, small portion and nothing exciting about it. Dessert was fabulous with crème brûlée. Would definitely go back. Oh yeah the bread is good too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNTg2TFlBEAE",
            "text": "I have been coming here for more than 20yrs. Even though its in the tourist area enclave its really just a great little local italian speciality restaurant. Its not a red sauce house, but more of a fine Italian dining experience like when it was a special occasion and you're having veal chops or something more special instead of bolognese. They do have some classics the whole menu I've tasted many times over with great satisfaction and they have the accompanying wine to make it extra special.\nThe fish is wonderful as well as the seafoods, meats and pastas on the menu. Listen to the specials because there's always something extra delicious to entice you off the menu with a wonderful glee to yourself for being adventurous. I have brought many out of town guests and diehard foodies, all have been happily impressed, for some its on their list when in town. The service is great and everyone is friendly and attentive. Leave room for dessert because they do that well here too! The atmosphere is charming and intimate but not confining. While it won't be a cheap night, you will leave not feeling fleeced and looking forward to your next visit."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcnFLejVBRRAB",
            "text": "AMAZING! Myself nor my girlfriend are vegetarian but we ordered vegetarian dishes (gnocchi & pumpkin ravioli) and HOLY RAVIOLI it was so amazing! Melted in our mouths. Literally food that makes you smile and your heart happy. The drinks were also amazing. We had some of the martinis and wine. The service was wonderful and the staff is so sweet and welcoming. We truly felt like we were treated like family during our short time there! NYC isn’t somewhere you usually return to the same restaurants but I most certainly will return here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbHZ2STFRRRAB",
            "text": "We started very well, very nice, but there was very little light. Suddenly they have started to be very rude and rush us. The dishes were delicious but small in quantity and at a very high price for what it was. To complete the picture, they have scammed us and we were a group of 12 at several tables but they charged us together so they could charge us $100, yes, you understood it correctly, 100.00 in taxes. I find it amazing, that is, it was already expensive in itself, but this. We were amazed and on top of that they didn't want to charge us separately. I will never return"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbUllUS1RRRAB",
            "text": "If you’re looking for an amazing Italian restaurant to go to before a show, this is your spot! The food was impeccable, the service was amazing - it felt like we got a little slice of Italy here. I really appreciated the service here, everyone was very kind and attentive, even as the dinner rush built up."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwcXI2SF93RRAB",
            "text": "The food was outstanding and cooked to perfection. Every bite was heaven. This is the place to enjoy the great food and amazing friendly staff and owner and ambience. I'll vote this for my best Italian restaurant I've ever been too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdWVHYllnEAE",
            "text": "A lovely Italian atmosphere and good value for money Italian specialities.\nI particularly enjoyed their ruccola pear salad, the carbonara linguine…with a glass of Chianti.\nService was friendly and very efficient.\nWe booked through google."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6NTlmREFnEAE",
            "text": "Just moved to the neighborhood and my family is classic Italian so wasn’t expecting much. I have a high bar for Italian foods. The chicken scarpiello blew me away, nothing was heavy even though it came in a rosemary creme sauce. Broccoli Rabe wasn’t oily at all (huge refreshing change!) and the service was just wonderful. Waiters are friendly and attentive without being pushy and were present/inserted themselves at exactly the right time. I’m so excited that this can be a staple for me so close to my home. My only regret is I didn’t try the pasta but there’s always next time.\n\nPhoto is of the pistachio tartufo.\n\nI’ll definitely be back and be sharing this place with friends. Gratzie!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZa2NfdFF3EAE",
            "text": "A great Italian restaurant if you are a tourist looking to overpay for bland tasting food. We sat in the smaller of the two rooms at a 2-top affording us plenty of space, untypical for a NY City restaurant. The noise level was low and permitted conversation. The service was friendly and efficient but not totally knowledgeable. What type of Chardonnay...i don't know. Enough of the positives! To me the bread foreshadows what is to come, in this case cold, sliced bread with a soft chewy crust. Very disappointed. We began with the smallest arrugula/pear salad I have ever seen, the dressing was light and lacked any descernable flavor. My wife had the special raviolis which she rated a solid B, tasted good but not great. My spinach pasta with Bolognese sauce was a big disappointed, the pasta was fresh a d cooked properly but the sauce tasted bland, like chunky ketchup. With that said we would NOT return to pay almost $100 for 2. (including tip). There are too many other/good options on 9th avenue!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMjVib2hnRRAB",
            "text": "The staff were incredibly attentive.  The atmosphere was very quaint and romantic.  I had the portofino and it was unique with green pasta and very flavorful with a lot of shrimp mixed in."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCc3RlTW53RRAB",
            "text": "Cozy little place out of the fray. Service is inconsistent.\n\nWe ordered CACIO E PEPE 4/5, VITELLO SALTIMBOCCA 3.5/5 (good flavors, but dry), cheese cake 2/5 (we didn’t care for the ricotta).\n\nGood wine by glass choices."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyaVBLVDNBRRAB",
            "text": "Recommended by the bartender at \"On the Rocks\" whisky bar and it didn't disappoint. Great place when you're in the mood for good, comforting Italian food in NYC."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRbmJuY0Z3EAE",
            "text": "Great service, waiter was extremely attentive. Food was very good. Prices are normal for what you would see in the area. Entree price ranges from $19 to 27"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKOGNtdWhnRRAB",
            "text": "Such friendly staff not to downplay the food. Everything tasted amazing. I would highly recommend this place."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0N3FPWlJ3EAE",
            "text": "We have been coming here for more than five years. Anytime we are in the city we have dinner here. Have NEVER had anything than an excellent meal. Service is excellent, am example was this time we misjudged our time and needed to rush. No…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbnJqazN3RRAB",
            "text": "This is my 2nd time eating here. I will continue to make this a stop every time in NYC. The food, drinks and service is excellent"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2dllHcVdREAE",
            "text": "I love, love, LOVE this restuarant. The food was yummy,  the service was quick and friendly. Oh and the price was the cherry on top."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1MlAzR3B3RRAB",
            "text": "I love this place. First time having dinner here with my sisters just to celebrate life! The service was amazing 👏. The food and drinks were perfect 🥰.  The decor and ambience were on point. Will definitely return.\n(food so good I didn't take a pic, only dessert)"
        }
    ],
    "reviews_count": 80
}