{
    "name": "Empanada Mama Hell’s Kitchen",
    "place_id": "ChIJsZiFN1dYwokRtB35FstjkA4",
    "grid": "MN4",
    "address": "765 9th Ave, Manhattan, NY 10019, USA",
    "rating": 4.4,
    "user_ratings_total": 5460,
    "phone_number": "(212) 698-9008",
    "reviews": [
        {
            "date": "13시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KaGFsZzBXVTl0VTBWRFIxZHNObFV0ZGtWcGRuYxAB",
            "text": "They do not miss"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paVk5XNXZjVmhNWW5ndGFsQlhRV1ZuYXpJd05GRRAB",
            "text": "Five days in the Big Apple means countless food options, but since we were seeing Hell's Kitchen on Broadway, I sought out local eats in the neighborhood—and Empanada Mama was the major discovery. I'm hitting this spot up fa' sho on my next NYC visit!\nThey offer flavors galore that will satisfy every tastebud. The moment I saw their Jerk Chicken and Viagra (seafood) empanadas, I was sold. Our appetizer of plantain chips and guac was hittin', and the entire meal was fantastic. To top it off, the service was fast, friendly, and top-notch. I will say the music was a little loud; maybe because we were sitting by the DJ booth, but we’re music lovers, so it didn’t take away from the vibe. Just be prepared because this 24-hour spot might be jammin’ when you visit!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMVZuZEdhamMyUVVwbE5sRmhSWGRSV1V4cGMwRRAB",
            "text": "Fantastic margaritas! Must visit."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paMGVGZDVUVU55YXpSc1lrSmpiMUl5YjJsV1luYxAB",
            "text": "The empanadas were all top tier!!! I ate so many, but I just couldn't stop because they were that good. It was genuinely fun being in this restaurant, people were singing and dancing. The drinks were good too. Highly recommend."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OR1IwcHNZalpEUTNkd1kyYzFWbEpFU1cxUldFRRAB",
            "text": "Music was too loud for the mid day. Tacos were okay tortillas were cold. Flavor was okay. The full menu wasn't available for lunch."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdVoxaFJUbmxGTkZsMmMzWjNZWHBTZFV4dGRtYxAB",
            "text": "20 minutes wait for to-go soggy, average-tasting tacos.  $15 for 3 carnitas tacos and $18 for 3 carne asada tacos."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWM1ZscFJkMm8xYjFjMVVIUnBPSFpoZEdzek5sRRAB",
            "text": "I was craving an arepa so stopped by here.. wow!! Super tasty!!! The arepa was fried, which I wasn’t expecting but I enjoyed it so much! Amazing taste, the portion size was huge and the quality of pulled pork was great! 100% recommend!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Oc05tVm5OazFmVlRsU04weGtZa2RqVlZFeldXYxAB",
            "text": "They desperately need more filling options for their corn empanadas! Otherwise, perfect."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xveVRWSnVSMGRtY2twZlZXc3Ribm8zWjBaYVkzYxAB",
            "text": "It’s unacceptable when I have to wait over an hour for my check because the female staff is flirting and drinking with the male staff- visibly intoxicated and engaging in sexual acts in front of the kitchen doorway"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNdFdrRndNSFIyT1ZaamVESklNblIxYVRSMVVWRRAB",
            "text": "Super good,the value for money is what makes it a hit and being open late. Visited multiple times and always consistent."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdU5uZzVXWFpvV0ZZeGFXZHdSMFp6U1ZZeVkzYxAB",
            "text": "NYC Staple!  Been here many times, some late after a night out but this place never disappoints.  Today we had a large group for a private event and had the whole back area.  Again, food was great, drinks great and service was on point.\nIf living in NYC or just visiting this is a must and they are open 24x7 so no matter if its 2am after the bars or 2pm for a quick bite its a must!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OUGVFc3hSR0ZVZGpaNVdrSTNjSE5FVEdOYWVuYxAB",
            "text": "Fast service great food."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSRldtWmhaRkJvVlMxZlMzVk9VRWQxVmkxSE1VRRAB",
            "text": "Delicious and many varieties of empanadas!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taeFdEQlRlVTVyWVRSTk1tNHhVakoyUW01eGIyYxAB",
            "text": "Good food excellent service"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKRVdscHpjRk13VjJwWWIxRllZbE5PYUVoUFduYxAB",
            "text": "The food was sooo good"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkMk1YSjFNWFl4YlVNeFQwUlJjR2g0WDI1c1RXYxAB",
            "text": "Best empanada of my life, not even close. Must visit"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WSmVFUnpOVVYzTmxReFluZGpZMHBIU25wcVJFRRAB",
            "text": "Unfortunately my most recent experience left much to be desired. This location has gone downhill, which was evident by the empty restaurant at peak lunch hour. Each empanada we ordered (6 different ones) were LOADED with cheese and barely…"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKeGJ6UkNRbGg0VURJMVUzZ3pNVmswWlVabFMyYxAB",
            "text": "Empanada Mama is more than just \"Another Latin Restaurant\". it offers a wildly creative and very tasty empanada experience, plus a drink menu that rounds off the meal beautifully. And dare I say, those Frozen Margaritas are spectacular! Also If I were you, I'd try a flavor I've never had (maybe something wild like \"Viagra\"). Their Service was really great! the bartenders was also very attentive. I would say Empanada Mama is hands down one of the best spots in NYC."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcmRISmxiMVJXY25oSVlYQTVXR2w0VjJOTFdVRRAB",
            "text": "been to empanada mama lots of times and got to know the bartenders (ian, cece, jen and caroline). service was exceptional! they are very welcoming and that's one of the reasons why me and my friends prefer to be sat at the bar. food is really good too! i didn't know they have a lot of options. we tried carne sudada and it was delicious! my favorite empanada is the buffalo chicken and brasil! we would definitely be back in a few months and i already cannot wait! the place has good atmosphere and they're open 24/7!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xORFZVcFlVSEZ3WTJaWk5IbGlVMVk1ZFVSNlRuYxAB",
            "text": "It was 3am and the munchies hit after the club lol. The Empandas are so good. Went for my favorites chicken & el reggeaton. Ate it while my bestie and I walked to the train. It was his 1st but definitely NOT his last lol"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210aWEydFJPV3RVZFdoWFltTkVlRUZDTFhwUlRWRRAB",
            "text": "Byran the cashier was soo on point and he made sure my needs was met. I will be returning for more empanadas."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkSWQxRkJUVGN5TjBKMGFYcHhkSHBXUWtaSFVXYxAB",
            "text": "The food was ok the bbq pork was actually tasty, my only issue was the up charge for cheese which is 2.25 when I ordered something that included cheese in the name. How am I being charged extra…for example 1 CHEESE steak arepa $13.50 oh and $2.25 for mozzarella…? Not the only time also ordered 1 CHEESE burger arepa $13.50 oh another $2.25 for cheddar cheese for my CHEESE burger arepa. What are we doing bro robbing sheeple?!?!?!Probably won’t be back. I’m a student I can’t be flushing money down the toilet if you have money to blow go for it."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trMFprMXVaMjVyU0Vac2MwRm9ZVkJNZFdNdGVuYxAB",
            "text": "We love us empanada mamas, whenever im in nyc I have to stop at one normally on LES but today we stopped by the hells kitchen location. Food is always on point. Staff is kind and no wait to be seated. If you like flavorful food this is the spot to go to. Can't go wrong with a empanada or a full meal."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaM1lYSkxMWFpzVlROdlZYVXlObEJsWkdGbmVHYxAB",
            "text": "A good fried empanadas can never hurt.\nRich filling and crusty dough."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOT2RqUjVjM2RyVURab2FEYzVNR2hIU25WSVdYYxAB",
            "text": "I placed a to go order for $38.27 at midnight and didn’t leave with my food until 1:05am. I stood near the counter for over an hour after being told “ten more minutes” over and over. Three staff members promised they were “checking with the kitchen,” but only when I followed up for the fourth time did they realize the kitchen was not making my order because someone else had already been given my order.\n\nWhat did they do to make it right? Nothing. No meaningful apology, no refund, no credit. Just more waiting after their mistake. Remaking it was supposed to take “seven minutes” but it over 20. My time matters… basic hospitality means owning your error and offering a real remedy.\n\nI have spent $100s at Empanada Mama over dozens of visits. After this experience, I can’t justify coming back. It felt like getting seats at the bar filled mattered more than serving a loyal, patient customer who’d already handed over his cash."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSVVIUnFUbmwyWkU4elVYVnZPRmxDU1dWM1FYYxAB",
            "text": "I come here fairly often and love seeing Isabella! Always so nice, friendly, and consistent. Arroz con pollo is def one of my favs on the menu here!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCS1IxOW5MVTFoUWpZMWJIWlJiams0WDFsR1NWRRAB",
            "text": "Food, service and the atmosphere were all great"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GV2JVWTBTRVl3TWpCaWIxRTFieTFZYkRSRFQxRRAB",
            "text": "This place has good food but terrible customer service. We went in, asked for a table for two, and were told to sit down at a table for two in the front next to the entrance. We waited for 20 minutes for someone to come take our order but nobody came. Both bartenders saw us and pretended we’re not there, then someone came to ask if we had ordered to go or wanted to order to stay. We explained we’re here to eat in and again, nobody came for the next five minutes. When I addressed the issue with one of the bartenders and then one of the waiters, we were given attitude, and nobody apologized or tried to accommodate us. Almost half of the tables were open but we were offered another table in the main area, at the worse table next to a loud crowd, so we just gave up on eating in. We wasted half an hour for nothing. This was my second time coming in. First time, similar customer service issues happened, but not to this extent. I'm never coming back here…"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnMlJGbHBXbmh6VWw5emMwNVJTRkpXZEVORmIxRRAB",
            "text": "I was there during the night and it was amazing, manager Cyndi was so nice, excellent service and super friendly!! Definitely coming back!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VGJHdEpNa3BCYkMxdmFFRkdjRUZmTlZwT1FtYxAB",
            "text": "They're empanadas are crazy delicious!\nYou wouldn't want to share 😂."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCelFuSkRPVzk1Um5GMk9YSnFhM2xNZVZWS1ZuYxAB",
            "text": "1 am is the sweet spot. Amazing food. Lively atmosphere."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkU09WVmtiSGRJV2tkd01UWjJUbFZmTVRZMVNYYxAB",
            "text": "Manager cindy is not friendly with her employees, she talk down to them and believes her authority is enough to disrespect them, this place is not friendly with their college students!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUlFXWkhibloxVWtsVVUxVkJVMmhDUVVvdGJFRRAB",
            "text": "Delicious Empanada!!! Caroline was awesome the bartender!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25reFgxVTFjVGhDWm1oU2QwdGtaV3hHZDJnMmJFRRAB",
            "text": "I used to come here all the time for late night empanadas. UNTIL.. last night. This security guard was screaming at me telling me I have to wait outside after ordering. And the thing is the place was not even full. I’ve never had such bad service at empanada mama. Never again will I pay for my meal and wait outside."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WbGNsVk5RbTVpT1RCMmMwYzFkVFJ5VWtac1UxRRAB",
            "text": "WOW, WOW, WOW!! We ate here twice during our last trip to NYC, and this will be a staple spot for us on all future trips to the city. The menu has options for everyone, and every we ordered was delicious. If you have a bad meal here you are the problem. I look forward to coming back and wish a spot in Atlanta would open up."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGa1FucFdSRU42UlRZMk9WUnZUM2x6V1ZST09XYxAB",
            "text": "I would give it six stars in a heartbeat. The service was great, the atmosphere was fun and relaxed and the food… make sure you are hungry when you come. I am as just stopping by ato taste an empanada and ended up staying two hours eating and drinking to my heart’s content."
        },
        {
            "date": "1달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJNFdERmtTR2t5VHpNM2RraFpUMGRmVmtWT2FrRRAB",
            "text": "Nous avons pris à emporter car la musique était trop forte pour pouvoir discuter tranquillement. Nous nous sommes partagés 6 empanadas salés et 2 sucrés à deux ainsi qu’une portion de bananes plantain et c’était largement suffisant. C’était très bon (sauf ceux au fromage uniquement qui étaient quelconque). Une bonne adresse ouverte 24/24"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVU5YRjRSVmt4VDE4eWNEUkhjbGhmVVdvNE4yYxAB",
            "text": "Empanada Mama in Hell’s Kitchen is a late-night gem! The beef empanadas and carnitas tacos were authentic and bursting with flavor, and the fresh, sweet, crisp lemonade was the perfect match. Service was fast and friendly, and you can’t beat the location—authentic empanadas just steps from Times Square. Best of all, they’re open 24 hours, so deliciousness is always on the clock!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsQ09VTm5aVWhpVFdnd2MyZG9YMWxFVkU5TGRFRRAB",
            "text": "I was extremely hungry when I came there, but service was so fast. I just ordered food like in less than 10 minutes I already got my order with empanadas, entree, and appetizer. Empanadas are top tier. Never tried a such delicious thing. Entree that called Apollo with plantains is highly recommended. So many spices and so much flavor. The only thing is yuca fries. I truly love it, but there, it was over fried. I’ve tried much softer one; however, I and my mom finished it pretty quickly anyways. As you can see, definitely recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SbVltNXpZMFpSWVY4MVVEaHBMVlJhV0dOWE1uYxAB",
            "text": "Fun atmosphere and best, most stuffed, empanadas I've ever had!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WVGR6WmZUSEJhYWxGNFpFVnBUbXhXWm1JMFdYYxAB",
            "text": "“Bouncer” refused to let us sit inside to eat our food even though there were several empty tables. We kindly explained we had ordered at the outdoor kiosk under the impression that you pick up your food inside. He was very rude, refused to let us inside (group of four women), and stood in front of us as if we were a threat to the patrons?\nour food also took forever to come out. it was delicious, but other people who ordered before us, all men, got their food, some of the orders quite large, before we did. we waited about 25 minutes for our empanadas\nwill not be going back again for the unequal and very rude service we received"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gc01XNURjbE0zWmpoUGMyOW1jRkY0VWw4NFVWRRAB",
            "text": "Terrible service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TVpWSTFSM2N3UjNSb1lXaFNaVE14VkZSRFkyYxAB",
            "text": "A welcoming space with excellent service and delicious food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201bGVUQlpRbnB0U0V4dFlXSkZRVmhmYW1KelgyYxAB",
            "text": "Always missing a juice🤣🤣🤦"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rMGJqZGtTVlowTVVWbVJ5MXVlRWxQWkRaU1NYYxAB",
            "text": "Great veriaty of empanadas I really loved the Brazilian ones - excellent...\nI also had a lagunitas IPA which is a great IPA beer"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OclMxOHdVVFppZEhOd2VtbEdUbFpVTVRsbFgzYxAB",
            "text": "They offer alot of delicious food but please taste the empanada"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMlZXdExNR05mYXpGM04ySjVjSEJXT0VwbldrRRAB",
            "text": "Comida y ambiente excelente un espacio inclusivo limpio"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjdFp6ZHdabmhMYkZaVVozbGtVVlpYYW5kRU9FRRAB",
            "text": "First time here food good taste, service accurate was a saturday crowd near to Broadway"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNMnJ6aVdREAE",
            "text": "Large selection of delicious empanadas (and other food), great drinks, always a vibe, but can be a little messy when the post-bar crowd hits"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWVNrRmlYM1ZNUzJ0NmJ6STFVa2RYU3pSbVgxRRAB",
            "text": "The manager of Empanada Mama, Cindy, is very rude. She gives terrible service, is quite arrogant, and very radical when customers try to make changes to their orders or not. On top of that, she threatens other employees with punishment because they’ve been trying to please other customers. To be a manager, you need to be a leader, an example of good service, and a bit more accommodating, because we are the customers who come to this place every day to receive a service, and we don’t deserve to be mistreated with rudeness and arrogance from the manager, Cindy."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXcG9lcjBBRRAB",
            "text": "비아그라 엠파나다는 맛있음.\nPOLLO A LA PLANCHA는 음식 퀄리티에 비해 음식가격이 너무나 비싸고 포함된 닭고기도 맛없고 전체적으로 형편없는 맛입니다."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqdkl1LUZREAE",
            "text": "Flavour explosion!\nViagra랑 spicy chicken 꼭 시키세요\nOxtail soup는 향신료 갈비탕 맛"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZcE5TVkp3EAE",
            "text": "홀에서 일하시는 분 친절했어요, 캐셔 조금 불친절, 음식 맛은 호불호갈릴 듯 보이네요~단짠단짠"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCbjgtczV3RRAB",
            "text": "꼭 비아그라 시키세요 게맛살 존맛탱이에요 ㅠㅠ"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ0enAzRWlBRRAB",
            "text": "매우맛잇음"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ONFJEWjZkMFoxUVhNM1lYcERSWFZYVjJSQmRtYxAB",
            "text": "This place was so good! I love the thin crispy empanada shell. My favorite was the pernil and el toro. The jerk and cheese was more like barbecue than jerk seasoning… The spicy chicken was dry and very cumin heavy which I liked but the chicken was too dry. Overall amazing empanadas for an affordable price!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxRGRtMWZVbGwxVWpCV01qVk9kRWxCYjNSVGRFRRAB",
            "text": "Food: 5 | Service: 4 | Atmosphere: 5\n\nSeating type: there plenty of seating and a bar\n\nVegetarian options: they have some good choices\n\nDietary restrictions: staff is friendly and accommodating\n\nParking space: they don’t have designated parking\n\nParking options: street parking\n\nWheelchair accessibility:this establishment is wheel chair accessible\n\nThis place looks really nice. The interior is decorated nice and it’s super clean. I had the cheesesteak, reggaeton and Pernil empanada. They were well seasoned, packed and hit the spot. I saw some played that came out while I waited for my order, some of their dishes looks really good. I would like to come back for lunch. If you’re in the area stop in and check it out l. They’re open 24hrs, have reasonable prices with generous portions. This place is a Gem!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMTc3ZEdBEAE",
            "text": "Food 10/10, service 10/10, overall vibe 10/10. Went for my birthday. The house nachos were so good! Loved the idea of plantain chips. The empanadas came out hot and fresh! The waitress overheard it was my birthday and the entire staff sung happy birthday and gave me a flan! So sweet. Great music and great drinks. Been coming here a while and have not been disappointed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRd1lqaFRhbWg1U0hoSVUyTmlabDkzV0doM1puYxAB",
            "text": "Every time I visit NYC, I make sure to come here. One of the best eateries in the country filled with incredible food and vibes. The empanadas are made with love and packed with flavor and everything from the rice to the beans to the salsas are flavorful and made with intention. 10/10 must visit!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tadFV6UTVWMkZqVTFkUVJXSnJVSFJWU0d0TmRrRRAB",
            "text": "The empanadas were amazing!!!! Our favorite was the jerk and cheese and the viagra if you like seafood. The service was good, I just wished that they gave plates and utensils. We were only given one plate, some napkins and sauce(which was really good). They also came in bags that told you what was what. Regardless, it was clean and comfortable atmosphere. Also got the churros but the empanadas were the stars of the show by far! Highly recommend coming and trying it out!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNXB2MUNREAE",
            "text": "We had lunch at Empanada Mama's Hell's Kitchen.  The service and empanadas were amazing.  We have had empanadas in many different states and countries and these are at the top of our list.  We will definitely go back when in NYC."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205ek0zZzJUVmxrVldrMFRFRlpla3M1VEU5d2VYYxAB",
            "text": "Awesome food, open 24hrs, great milk shakes - what else can you ask for.\n\nEmpanadas are a must have (it's in the name). Maduros are an excellent compliment to any meal. I tried the pernil, Brazil and El toro. My favourite is definitely the Brazil out of the 3.\n\nPapaya shake was tasty but nothing out of this world. I'll definitely be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJak1YN1lBEAE",
            "text": "Love this place! Made it a daily stop while in NYC. Super friendly staff and great service. Awesome food! Drinks from the bar were great. Very reasonable prices! Plus, they are open 24h!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKcVdWQlJSM1ZGTkhSUVIxQndMVmhKWjNneGFIYxAB",
            "text": "Terrific empanadas, and we also had the plantain chips and guacamole (excellent!) and watermelon salad (which had feta, olives, pickled red onion and mint leaves, also excellent and refreshing as well). The empanadas come individually in labelled paper bags (so no wondering which empanada is which) and with a small pottle each of guacamole and hot sauce (which was satisfyingly hot and flavoursome). The service was good and the insides very festive, perhaps especially so since they were celebrating 20 years anniversary. Very happy with the meal and service!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxclVqaERabVJxYkhaTmRETk5SRzluVTNCc1UzYxAB",
            "text": "Had the Typical Colombian Breakfast, and Jerk and Cheese and Viagra Empanadas. Empanadas are one of the best I ever had. Breakfast menu comes with arepa and scrambled eggs. It's okay but on the next visit I'll probably stick to empanadas."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NMFpUbGtRbVpxVUhnNFJHdGtOMVpmVm5aQ2IxRRAB",
            "text": "I got togo, the service was a bit slow but to be fair they wete pretty packed! While I was waiting I could feel the energy and vibe of the place, im definitely coming back.\n\nI ordered (1) maduros (the sweet plantain), (2) Colombian empanada with ground beef, (3) cheesesteak empanada, and (4) pulled pork empanada, (5) black beans.\n\nMy favorite was the cheesesteak empanada followed by the pulled pork one and finally the Colombian one. The maduros are good and a large portion. The beans were a bit bland."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dmMtd0tBEAE",
            "text": "this was by FAR THEE best empanada spot i have ever been to. So much that the empanadas didn't even stand a chance for a picture haha. The atmosphere was chill but was giving vibes, great music and great service. the drinks were good too and the price is definitely worth it.\nAll the empanadas are so unique and flavorful\ni will definitely be going back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNejgzZmIzcHZxTVhnEAE",
            "text": "The vegetarian empanadas are excellent, fresh and great taste. Their green sause is delicious. The staff is friendly, and fast. This place is perfect for an after MoMA day.\nI would highly recommend this place!!\nThe 4 stars is because of the seafood empanada, it’s not bad, but not as good as the others (a matter of preferences)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRGNFVkZiRVpWUVdrMmNVaG1WV1J5TVZWdGJrRRAB",
            "text": "Stopped here for dinner, and it was great! I particularly loved the Hawaiian empanada. 2 or 3 is a great amount for a meal."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdzVlaml3RRAB",
            "text": "What can you expect in HK at 1am. Well, this sport is perfect to find comfort delicious Latin food after a night out. It is packed! It is loud! And there's not much going on, but it's just a great midnight snack. The service was great! The servers and host were very attentive and helpful. So definitely give it a try when around and having fun! Everything is delicious.its latin after all!."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTFlUUXRXbGxpVUVSMmJYTTNVRzh3T0VSd2VsRRAB",
            "text": "Me encantó el lugar , Gayfriendly, la atención es excelente, los chicos que te atienden son bilingües, y la comida la disfrutas, definitivamente lo recomiendo. Gracias y Saludos.\n\nTambién tienen Happy Hour 🤭\n\nI loved the place, Gayfriendly, the attention is excellent, the guys who serve you are bilingual, and you enjoy the food, I definitely recommend it. Thank you and greetings."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2aFlXUGlnRRAB",
            "text": "I love mama empanadas.\nTypically I've visited locations that are take out. This location has a nice seating area that accommodates quite a few people.\n\nIn total we had about nine people with us. We did not have to wait to be seated. They sat us immediately upon coming in. The waitress was extremely nice and patient.\n\nI ended up getting the reggaeton empanada. It's my absolute favorite. It has pernil and arroz con guandules in it with sofrito. Very flavorful. I also got the pork belly with tostones. It was absolutely amazing and a huge portion of pork. The pork skin was nice and crispy. The green sauce and hot sauce is an absolute must try on your food.\n\nEveryone really enjoyed their food. It did take some time to come out but we were a pretty large crowd and we all ordered so many different items. Everything came out piping hot and one after another.\n\nOverall we all enjoyed our meal here. The service was great. The table was clean. We all left stuffed and with doggy bags. I highly recommend this location."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oNVgzSlFTa1JSWjFWeWNsQXhkVTVTVjBKRFlVRRAB",
            "text": "Le puse 4 solo por los precios, no es lo más económico… pero sí muchísimas opciones y que esté abierto en la madrugada (after party) es genial."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcklLdF9nRRAB",
            "text": "I've been here a couple of times and I always try a different empanada and I just keep going back for more. You just can't go wrong with an empanada here. As a latino, I love everything about Empanada Mama. I'm gonna force myself to try their arepas next time.\n\nWhat I do get every time here are the Plantain Chips with guacamole. There is also an option of getting the Yuca Frita with Plantain Chips and that is a guaranteed winner. It is served with guacamole and the yuca frita has a guava sauce that makes them irresistible."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aaGRYTmxORWM1WkRObFRYTmZORTFyTUVFNFNuYxAB",
            "text": "Excellent food.  It’s open all night and was a little noisy."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2cUtTaGl3RRAB",
            "text": "Empanada Mama is one of our go-to spots in Midtown and it never disappoints. Whether it is for in-restaurant dining or takeout, the empanadas are remarkably consistent and always delicious. Our favorites are the Bombay and the Shredded Chicken, and the Veggie is also very good. We also tried the Viagra, which is tasty. The Spicy Chicken is only good for those with a high tolerance for spice.\n\nThe drinks are also very good. We tried the watermelon lemonade and virgin mojito and both were awesome.\n\nEmpanada mama is open 24 hours, and the vibe and music here is fantastic. The service has always been efficient and hospitable.  Highly highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJR2pwS25WZ01uUFh3EAE",
            "text": "This just wasn’t for me. I did like the atmosphere of the place but food had no taste to me and chips were salty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIb3ZQYUVnEAE",
            "text": "I walked up and ordered outside thinking that this was a small bakery sized empanada shop but I was surprised to see a full blown restaurant! I was impressed with the amount of options and both empanadas that I got were really good. My only complaint was that there’s no casual spot to sit and wait for to go orders. Overall the empanadas were full of flavor and were a good size for the price. I’ll definitely be coming back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJM1Z3TEQxOU5TNjlBRRAB",
            "text": "Visited based on the reviews. My kids loved the empanadas. Second visit in two days!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3N3JxamtRRRAB",
            "text": "Wonderful empanadas. The green salsa is truly what makes the experience.\nServices is wonderful. Can be a bit loud but it fits the energy.\nThe rise in prices make the empanadas a little less price friendly"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzX3YyLTlnRRAB",
            "text": "This restroom (one of two) was flavorful in the vibe of a 24-hour food joint, but with a nice mix of city graffiti. I particularly enjoyed the vibrant jungle green, and my only complaint was a single minuscule fruit fly (uncertain of genus or species) lazily buzzing across the room as I conducted my business, nearly intersecting with my stream before wisely diverting from its path and ascending towards a distant corner.\n\nBut to speak more about the rest of the place, my wife had experienced the other restroom and said it was “pretty gross”. However, I cannot personally attest to this, as it runs counter to my considerably more tranquil experience.\n\nAlso, Empanadas very tasty, service fast."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SbFkybFpPRXgwYldFemVVMXJSbk0yUnpWYU5IYxAB",
            "text": "Very fun place, good prices, and the empanadas are big and filling. I had the dessert mozzarella and caramel one and that was so good. In terms of service was a bit slow and took a while to get someone to give us a check but friendly vibes."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfd1Bib2FBEAE",
            "text": "The food here is amazing! We tried multiple different empanadas, and each one was really tasty. We walked around Hell's Kitchen while eating, it was a great time. My favorite empanada was the Mac & Cheese one, I'd love to have another one of those again. The wait time can be pretty long, though. It was packed when we came in for food, so we decided to walk around outside instead."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsMWVrTmtiSGR4YUd4TVQxbDNjRE5YT1ZwcGVYYxAB",
            "text": "This place is life changing. The empanadas were incredible, the best I've ever had. My favorite was the Caribbean themed one, but the spicy chicken and ham and cheese were amazing too! Don't forget the Nutella and banana one for dessert! We'll be back"
        }
    ],
    "reviews_count": 84
}