{
    "name": "Zou Zou’s",
    "place_id": "ChIJKVbn75VZwokRLdlBWe5rbtU",
    "grid": "MN4",
    "address": "385 9th Ave Suite 85, New York, NY 10001, USA",
    "rating": 4.3,
    "user_ratings_total": 1276,
    "phone_number": "(212) 380-8585",
    "reviews": [
        {
            "date": "8시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pscGVIWXdNV3BIY21RMGRVWlhZbFYzTUc5SlNGRRAB",
            "text": "Great, friendly staff . The dips are amazing and the menu has a great variety of foods.\n\nPricing is fair quality of food excellent, fresh and delicious"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MlNYRnpTamxqZG0xNE9WTlZWRGxwZVV0c2NrRRAB",
            "text": "Stylish Mediterranean Dining in Manhattan West.\n\nZou Zou’s is a beautiful restaurant located in the new Manhattan West development, just steps away from Hudson Yards. The location is fantastic, with easy access to nearby attractions and a vibrant city atmosphere. From the moment you walk in, the décor makes an impression. The space is warm, inviting, and thoughtfully designed, blending modern elegance with Middle Eastern flair. The lighting, tile work, and plush seating all contribute to a very chic and comfortable ambiance.\n\nThe hostesses were friendly and welcoming, and they set a nice tone upon arrival. The crowd was lively, and the overall energy of the restaurant was upbeat, giving it the feel of a trendy, upscale spot that draws a mix of locals and visitors alike.\n\nUnfortunately, our server seemed less enthusiastic that day, which slightly affected the experience. The service was efficient enough, but it lacked the warmth and engagement you expect from a restaurant of this caliber.\n\nThe food was good overall. We enjoyed the Mediterranean-inspired dishes, which were flavorful and beautifully presented. The menu felt somewhat similar to a Mediterranean version of Grand Lux Café, offering reliable comfort food in a more sophisticated setting.\n\nOverall, Zou Zou’s is worth visiting for its lovely décor, great location, and lively atmosphere. While the food may not be the at its pinnacle, the combination of ambiance, design, and energy makes it a pleasant and enjoyable dining experience in Midtown West."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRFkyOWlRbkoxTVZJd1NuTjBaVlp2WjBSRVNXYxAB",
            "text": "Food was decent. Service and atmosphere was great. 4 stars overall."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wd2JFZE1NV1Z0VjFKTGRYUjVSMlZqVEc4NU0xRRAB",
            "text": "Always delicious meal with great ambiance! 5 of us came here to celebrate after my friend finished the NY Marathon and they gave us a free bottle of wine. We got the 5 dips, Lamb Leg and Fried Chicken and it was enough for 8 people… way too much food- but she has leftovers."
        },
        {
            "date": "3일 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvMWJGcDVjWFZtVjI1UlNFaFlTV3Q2WjA1VlVrRRAB",
            "text": "Ein wirklich wunderbares Lokal, das uns Freunde empfohlen hatten, die in New York leben. Das Interieur ist modern, sehr stilvoll und äußerst stimmig. Die vom östlichen Mittelmeerraum inspirierte Küche ist sehr gut und etwas Besonderes (als Vorspeise unbedingt die Manti probieren, die waren grandios). Auch der Service ist sehr freundlich und zuvorkommend. Preislich ist das Lokal nicht mehr unbedingt günstig, wobei die Preise aber für die Leistung völlig angemessen sind. Einziger Kritikpunkt ist, dass es in dem Lokal Ende Oktober wirklich äußerst unangenehm und ungemütlich kalt war - hier sollte man sich um eine Lösung kümmern. Wir kommen aber trotzdem sicher wieder!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sRlUxTnJkVFJxZGtGUFFWOW1ZVzV0TTBKR2IwRRAB",
            "text": "Ya can't serve the same amount of food for 2 ppl and 3 ppl and charge per person. Ate here with my girlfriend first and then came back with a third friend cause we liked it. Shocker is that we got served the exact same amount of food we shared for 2 ppl but now it was 3 of us. So what exactly am I paying that extra $100 (++ tip n tax) for? INSANE!!!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tabk1qZEpkVFZ3YlVWd1RuaG9TakJrTmtWNVRGRRAB",
            "text": "Look- I don’t know if I’d give Zou Zou’s this 5 star rating if we ordered a la carte. However, we did the $74 tasting menu and honestly, it’s a steal. We were fed over $400 worth of food but paid like $150 less than that. They did accidentally give us extra food (chicken and potato pancakes), but didn’t charge for it. That being said, they are still very generous with their portions. Standouts were definitely the fish entree and their take on a Fattoush salad with the most delish sumac vinaigrette that our server informed us on. The rest of the food was okay, with some things being too salty or too strong of one flavor. As a table who mostly prefers savory foods, we were impressed by the desserts. Very unique and different. My party came here to celebrate a couple things, so it was definitely a vibe. I encourage you to get the tasting menu!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205eFZUSlZaVTF1VFRCVGJHOWFZMWxpVUVkT2RFRRAB",
            "text": "Getaway to city for a date night with wife and found a restaurant with a great ambience, food and vibes. My picks were oysters (best ever had), grilled artichokes, dips platter and brazino."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KRFR6bHpVelZsY1RKNFFXaENWQzFLUzNCQ1pHYxAB",
            "text": "We were guests at a 75th Birthday Celebration. A room was reserved upstairs. The waiting staff was amazing - friendly, courteous and helpful. The food was delicious. Meal was served family style for each table 3 appetizers, 2 sides and 3 entrees. The desert was to die for - Kaitaifi Cheesecake."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGV1YydFpkakJVVDNodlkzRkZOR3RNUm5WMVZXYxAB",
            "text": "Great service in a really fun and packed venue. They got us in and out in 45 min which we needed and loved. However, the price of the food for the quality we got, was not great. The salmon was super tasty, but of the three dishes we got, that was the only that was truly delicious."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGMVp6TlFWV1F5Um1saFQwRnhlbGh6WDBOMVRuYxAB",
            "text": "One of the best meals I’ve ever had…. Chef’s menu was chef’s kiss. 🤌🏼"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5eGVrUnNjRWRCYTFGVVJsazVPRTVNTXpGMlpsRRAB",
            "text": "Best salad ever! Huge portion and the dressing was delicious."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21acU5GVlJZMDVhWm1FME0weHBUMVJETkdsYVltYxAB",
            "text": "Fantastic experience at Zou Zous! The service was excellent. Dip tower is a must. Tuna tartar was solid. The fried chicken was to die for!\n\nWill definitely return."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOMVpFTnNVMEZaUzJWVVRXWkRhVnBQTTBNeVNFRRAB",
            "text": "Outstanding food and vibe of the place. The portion sizes are massive and so do ask your server for recommendations. Overall, a top notch experience!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWaE9ESjNiWEpvUTFSNFNYUkVNelJDTVd0aU5WRRAB",
            "text": "***READ BEFORE YOU GO***\nI came here on October 13th to celebrate my best friends birthdays and we ordered a bunch of appetizers including the yellowtail. I’ve been here before, so it was surprising to hear when my friends made a comment about the fish taste and texture, and it being drenched in oil.\n\nSince the space was dark, I didn’t have a chance to see the fish thoroughly, so when I came home and reviewed the pictures, it was shocking to see that they literally fed us SLIVERs of fish.\n\nIt seemed like it was late and we got the last of what’s left. I’ve included pictures of how the dish looks when I went in June, and now in October.\n\nIf you compare all pictures posted, none looks like the fish we were served that day. I will be reaching out to the owner to make things right, and will update once we hear back."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaNmFYaFVhblpLZWxOQ1lVMWthbTk0VUhaVmNIYxAB",
            "text": "I’ve been here over 3 times now - one with my husband and other times with friends. Every single time I order the dips tower, and grilled branzino - my favourites there. Also tried the filet mignon and chicken and both came out well. I’ve tried sitting indoor and outdoor - different experience but both lovely. Service is fab and ambience is great. Definitely a great spot to catch up with friends or a date night with your partner!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aQlRWSnNUVUp0TlZsbVRrTnpORTVUUWpaMVVGRRAB",
            "text": "We went to this place 3x now and for a reason: good food, great service and a very welcoming atmosphere. We recommend ordering their signature tower dip to begin with, then pair it with their branzino and their specially cooked house kitchen. If weather permits, take the outdoors seating."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KaFNFTTFaVVE0YjNCWGMyVnZNbGxyWmpoRVIxRRAB",
            "text": "The aesthetics are amazing and food is good too! I would recommend ordering less number of dishes as the quantity is a lot!\nWe had a reservation for 4 and one person had to cancel because she was sick, so they moved us to the patio - it was extremely cold and they had no heaters outside. We had to wait for really long to get bar seats (which are first come first serve)"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWVV6RnhTa1E1Ylc1WlJtTlFNMms1YkU1dVlXYxAB",
            "text": "ou Zou is okay—food is decent but nothing really stands out, and the vibe is fine but not super memorable. Service is friendly enough, but the overall experience didn’t wow me. It’s a fine spot if you’re in the area"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sc01saFRjRWN0VjFaeGFIQkxTRUZ3Vm1sU2NrRRAB",
            "text": "Average food, uncomfortable seating, poor/non existent service, high price. Better places in the area"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxcVJGRmxNSGd5WDJ4b2NGOVBUbEp1VUdwbE1YYxAB",
            "text": "I really liked Zou Zou’s — it’s tucked away just enough to feel peaceful, like a little escape from all the street traffic and chaos, but still close to everything. It’s quiet, calm, and such a nice spot to sit outside and enjoy a good meal.\n\nThe dip platter was amazing — the bread is warm and fluffy, and every dip has its own thing going on. But that whipped ricotta with apricots? Unreal. Creamy, a little sweet, and seriously addictive.\n\nDefinitely recommend for a date or brunch with friends — this place hits the perfect balance of fun, flavor, and atmosphere."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOSVJYTkpSSGMxTUdSYWJrODVjRGgxTnpsWGJYYxAB",
            "text": "dips in order of preference: eggplant, chickpea, whipped ricotta, tahini, mahamara"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cVVWQk1OMmhHVlZjMVR6WmtialZMYm1WVmNWRRAB",
            "text": "Food was wonderful."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKb1ZERjVRbFoyWVRoNVNXWTBabkJqVFU1MU5FRRAB",
            "text": "Chef's Menu is a Must-Try!\n\nWe ordered the Chef's Menu ($74 per person, available for parties of up to 8 guests, with the Duck Borek requiring 4+ people to order), and it was an incredible deal! It allowed us to sample a little bit of everything and left us feeling very full and satisfied.\n\nThe Dip Tower was absolutely delicious, and they happily refilled the bread. Both the salad and the rice served with the meal looked simple but were surprisingly excellent.\n\nWe visited on a Friday night, and the place was completely booked. We arrived early hoping to be seated sooner, but that wasn't possible because the restaurant was full. If you plan to go, make sure to book your table well in advance!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pObWMzVkVaM0JLWjFsbWNqQjBaRUZhYm1KcmRGRRAB",
            "text": "The front-of-house staff here was strikingly robotic. They gave me the impression that I was unwelcome, which made me very uncomfortable for the rest of my visit. Our servers were slightly more friendly, though it was oddly challenging to get anyone’s attention. The food was very good, if expensive."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSbWFVZEVUMGt6ZUVNd1UwTjNNRWxxV1c1RlJFRRAB",
            "text": "Really good food"
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSSVdVUlhOSE5zWlZZeVNsOTZlRmxTV2s5SVJrRRAB",
            "text": "Rica comida , buen servicio , el lugar muy agradable . Demasiado ruido , nos teníamos que gritar para escucharnos ."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MGRtTjJiM1kwYmpBeFdYRnNUVGwzTVVsQ2MxRRAB",
            "text": "The perfect definition of 3 stars. Neither truly good, nor bad. Floating in the middle and without a clear sign which way it's going, if it's going at all. Food is so so, same for service, and for some reason they seem to cram everyone…"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210UlJESjNVMDlvYTFsMk1uVTVkREpETms5allsRRAB",
            "text": "One of my favorite meals of all time!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nemVqVnFRVmc0YTIxUVRYZ3RkREEyUkUxQk4zYxAB",
            "text": "Great atmosphere, good food!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oNWFVbG5SRkpzYkdoNGNqSkRkekpzUm1wZlRrRRAB",
            "text": "I usually don't get too excited about restaurant options, but Zou Zou had many choices. The mezze plate was delicious, and the pita was almost like Israeli style! The menu offered a variety of dishes, which was great for my friends and me since we love sharing plates."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsblpHUTBYelo2UVcxSFRGSk1iRjluVFdOa1VsRRAB",
            "text": "“Zou was awesome! The giant elephant carrying a whole island on its back was the coolest thing ever! The air smelled funny but it felt like an adventure right away. The Mink Tribe were super strong and fluffy, and they gave us meat even after everything they went through! I liked them a lot.\n\nZunisha was HUGE — bigger than anything I’ve ever seen — and it even talked to me! That was crazy! And we learned a lot about the Road Poneglyphs and Raizo too.\n\nThe best part was getting new friends and seeing how loyal the Minks were to their allies. It made me feel even more excited to keep going toward One Piece!\n\nMeat, giant animals, strong friends, adventure — yeah, Zou is a 5 out of 5 for me!!”"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poMVQyMUtiMGxDT0RWVFpHSXlURlV0VUhoaFIzYxAB",
            "text": "The comedy and the atmosphere are very nice. The salad tastes exquisite and the steak is very, very delicious. The service is good."
        },
        {
            "date": "1달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twTlptdzNTMkUyUWtaQ2VTMWZRV1JxTm5ScFRrRRAB",
            "text": "sehr gutes Essen, vorbildliche Bedienung"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WelV6UnZkMGcwVEMxM2NscHFWa0l3WldsMGQyYxAB",
            "text": "One of the worst restaurants that I have ever been to due to host team and their manager. Had reservations for 7:45pm, host tries to force us to sit outside, we say no, they make us wait another 45 mins to get another table for some reason. But wait it gets better, you get to hear the hostess and manager whisper to each other about our presence in the host area, manager pretends to move us for comfort but instead parades us through the restaurant and makes us carry two strollers up and down the stairs to move us to a back room where no other parties are waiting and where no employee even came. Finally a host comes and grabs us from the back room they forced us into, she quickly zips off to the table, throws the menus on the tables and wobbles off. That was the tipping point there, no holding doors open, hostess’ acting like the guests are the burden. We got up and left, manager comes and tries to apologize if it was something “we thought they said.” Retrain your host and floor team to be more accommodating to guest. I wouldn’t recommend this place to anyone coming with family. You’re welcome!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SNlNXaFFaVWRhTUVwaVZ6ZzRhVVZuZFdWM1FrRRAB",
            "text": "Have been going since it opened , always a good experience until last night, which felt rushed. Server confided to us that there’s corporate pressure to move max people through each night, in fact the servers are actually pressured to turn each group in 90 min or less. We didn’t realize this is the philosophy there. So please be aware that this is the approach - owner financial returns 1st, great dining experience 2nd"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201WGFWSlpNbkZaWmw4M2RTMUtPVEZ2ZW1sT1MzYxAB",
            "text": "Very high quality and it was nice to sit at the chefs table and speak with the chef a little bit. Chicken, Dips, Lobster, Manti, all were phenomenal. Highly recommend, very nice bathroom too."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWlJXTnVXa3BoV1RSbWRsQkJaMEZrYmtOR2MzYxAB",
            "text": "I had a wonderful experience celebrating my birthday at Zou Zou’s. Their staff was wonderful and very thoughtful, the food was amazing the atmosphere is lively and intimate. I WILL BE BACK! Thank you Zou Zou’s for such a lovely memorable night."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTlREQnJjMnhyU0ZwWmFrSnVSVVV0VldabVEzYxAB",
            "text": "If you’ve ever had genuine Mediterranean food, you’ll know right away that Zou Zou’s is not it. Everything we tried had bizarre, clashing flavors — overly sweet, perfumed with orange blossom, and completely off balance. From the dips to the mains, the food was so sickly and strange that it was inedible. We were so disappointed we actually had to send it back. Definitely not authentic, and definitely not enjoyable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5dlJuWmpkbXR3VjJaeGNtOTRRbFU1Um01SGJXYxAB",
            "text": "Dinner was amazing. Food is 5 stars certainly, from the apps, to the amazing tower of dips each better than the last and the kebabs and lamb chops. Just superb! Drinks were okay, need a better cocktail and dessert menu."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSk5rVmxWRFowY3pKdmVYVjFZbEppZFZFeU0xRRAB",
            "text": "Good food great service. Could be a bit faster with drinks etc"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6MEpqb3BBRRAB",
            "text": "The food has gone down hill, and the restaurant is much too loud."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aNWVHdElSazFKTkVGVVQxSlZkVkI1ZWtzemJWRRAB",
            "text": "Good food shit service - waitress yells at the Asians. Apparently it’s famous for that 🤷🏻‍♀️ will I come back? Probably not, imagine spending good money and still being yelled at still, as the only Asian at the table"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWRE1XVnZNV2hsU0dNek5tdDNjamRVUW1oSVdXYxAB",
            "text": "2nd time here and I’ll be back.  It’s fabulous.  Explosive of flavors in your mouth"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxemFWZHhRMlpQVDFSV2JsQnRRMjFJY1dZemNXYxAB",
            "text": "I love vegetarian platter towel. So tasty"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWk1sa3lYM2gxYlc1T1ZFTkZjRzFMU2xnNVNVRRAB",
            "text": "Wow! My wife and I were in NYC for an evening prior to taking a cruise the next day. Obviously there are many restaurant choices in Manhattan for any cuisine imaginable, but we both love Mediterranean, and (thankfully) a couple of other spots we checked had a long wait. I saw that Zou Zou's had good reviews, so we decided to try it and were immediately seated outside on a beautiful late summer evening. This turned out to be an outstanding choice. Our waiter came right over and introduced himself, and when we asked for suggestions he gave us his personal opinion and some details of a few dishes we were considering. My wife had - get ready for this - the caramelized cabbage. Cabbage as a main dish? Oh yeah, and it was incredible! Perfectly seared and seasoned, every bite was a delight (we shared). I had the branzino, which was good and perfectly cooked, and we also shared the appetizer of assorted dips. Definitely try that, the dips are a slightly different twist on some old favorites as well as some I've never had (carrots? Great!). Overall this was a delightful meal, the service was perfect, the setting was great. This is absolutely a must-try if you're in the area and are a fan of Mediterranean food. Outstanding!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWMFFpMTZVbFl4T0cxM2RHTm9SM1F5Y2xkQmMwRRAB",
            "text": "I strongly recommend Zou Zou Restaurant as the food is both unique and delicious. Their dishes are exceptional and worth trying."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wS1ZVa3plVTk0VW00NFRWSmFXbG8yWkcxQlFtYxAB",
            "text": "If you go to Zou Zou's you will leave very full and very satisfied. The atmosphere is vibrant, busy and loud -- but when the food arrives, the sound seems to disappear as the numerous tastes consume your senses. The food can be eaten family style, and the four of us gorged on everything from a variety of dips for an appetizer to Moroccan fried chicken, grilled branzino and numerous sides. All were delicious -- and that's an understatement. Our waiter, Victor, was fantastic -- personable, responsive and made our night with not only a complimentary side dish but also dessert. Class act from a class restaurant. The establishment is incredibly popular so a reservation is highly recommended."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KSmNubEplRkZ2UTNGM1YwVnZPVGt5YVhadFQyYxAB",
            "text": "10/10 for this category of food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbGJFbDROSGhyYVdOUFVtZG1PRTV4TWxJNU0wRRAB",
            "text": "The food is quite good... now on to everything else:\nAfter walking into the restaurant the front entrance had about 6 staff standing and laughing (it becomes important later).  It wasn't busy so no big deal so we get a seat and then the waiter asks \"Would you like water or sparkling water?\" We get sparkling water but little do we know it is $12 after we get to see the menus.  Then I notice this waiter is running all around managing the tables while most of the other staff continue to stand and laugh and do nothing.  At the end of the meal, I ask for my check and he brings the bill.   I visibly put my card on it, and after sitting there for 15 minutes I look all around over and over again, no one comes over.  I go to the front to ask if I pay up front and they say no go to the table and pay there, I say simply that I've been waiting for 15 minutes.  So I go back and someone's already cleaning the table and he is very confused asking me if I am coming to sit down here to eat, then another staff comes over and is very confused telling me to go somewhere else.  I get frustrated as I thought it should be quite simple to pay the bill.  I see a staff member find the waiter and seem to reprimand him which makes me more frustrated as clearly there was a large staff doing nothing.  I felt bad for the waiter as he seemed to be one of few really working and not laughing and standing around but he's seeming to get in trouble.  Then a staff member puts my card into the machine and SELECTS the HIGHEST tip option and turns it to me to pay... wow.\n\nI was left speechless, I have never had a situation like this.  After reflecting and talking to friends about this everyone felt I should leave a review about what happened.  Any one of these issues I wouldn't have left a review, but the combination of everything just ate at me so I had to do it."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtbE5yekNBEAE",
            "text": "Amazing food, staff and interior design. The dips were so good. We ordered 3 dips; whipped ricotta, chickpea, green tahini (green tahini is the best), ‘our manti’ and moroccan fried chicken. You should try our manti for sure, but fried chicken was too much for 2 people to eat. 후라이드 칰인은 한쿡이 쵝오입늬닷 리터럴리 한바가쥐가 나와욘 오엠쥐"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUdVBLdHhRRRAB",
            "text": "음식 맛있어요. 실내분위기 좋고 직원들도 친절하고 서비스도 좋아요"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUZ2JqV1dREAE",
            "text": "친절하고 맛도 좋았습니다.\n미국식 지중해음식이 괜찮았던것 같아요"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyeGRQejdnRRAB",
            "text": "뉴욕에 다시 온다면 꼭 들릴거임\n직원분들 친절하고\n분위기 좋고\n음식 맛도 괜찮음.\n예약은 필수로 해야함"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zNE1URmtkMm8zUkRWQlpXa3hjMUZrV0RJdFdFRRAB",
            "text": "The dip platter here is worth a try and makes a nice choice for a date. Each dip tastes good with plenty of variety, so switching between them feels fresh, and the veggies on the side are great for snacking while chatting. The beef skewers were a pleasant surprise, tender and well-cooked, paired with a light, refreshing sauce. The setting is also a highlight, with a cozy atmosphere."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aRWRHdDBlbFZHWkZCUlVreFpielF5WWxGbk4yYxAB",
            "text": "The dips were all great super flavorful and none of them were too salty. My favorite was the half chicken: cooked to perfection with the tenderness with a slight char on the skin. The shallot boat with cream added a lot of creaminess to the chicken. The duck borek was also delicious. Really loved the crispy layers paired with soft duck. The cheesecake is a must order. Not super sweet and has so many different textures crispy creamy crunchy… lovely service as well"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SldrZFZSbEZmU0U5RFowaG9PWEZuWlZBMk9FRRAB",
            "text": "This is the PERFECT summer spot (aka bread and dips heaven!!).\n\nTheir dip platter, served with veggies and their fluffy homemade bread, is a MUST GET! So fun to try all their dips but the whipped ricotta with dried apricots was a knock out! So creamy and sweet, it reminded me of a creamy honey bread.\n\nMains are good but the starters and desserts are definitely the highlight. (Moroccan chicken is tasty and so is the fattoush salad).\n\nBut do NOT skip dessert here! We got their sticky toffee pudding which tasted like a gingerbread cake and was served with spiced ice cream, dried apricots and crushed pistachios. This was AMAZING!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPYkhnN2pLOU03MVJBEAE",
            "text": "I visited on a Thursday evening for a private dinner in one of the restaurant’s private dining rooms, which featured a full family-style tasting menu. It was an incredible opportunity to sample a wide variety of dishes—and every single one was exceptional. The presentation was stunning, and the flavors were thoughtfully crafted and perfectly balanced. Even the desserts put a creative spin on classic favorites that had me going back for seconds.\n\nWe also spent some time in the main dining room and lounge area, which really showcased the beauty of the space and its amazing views. I highly recommend this spot for a special night out—whether you’re with close friends or enjoying a romantic evening with your partner."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQYXZrUFdHbDRqSGd3RRAB",
            "text": "Highly recommended!\nWe had a reservation for four on a weekday evening. The vibe of the restaurant was fantastic—relaxed, chill, and perfect for unwinding. The atmosphere was also great for taking pictures.\n\nWe ordered several appetizers and main dishes to share. The standout was definitely the beef—absolutely 10/10. You have to try it!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkTWMwWlpTRWRTVTNGblRrZENVa1J6TFdGbFNWRRAB",
            "text": "The service was impeccable.   The food was amazing and our group at almost everything put in front of us.  I'm not super adventurous,  so some of the times we got with the chef's menu were out of my comfort zone, but I tried almost everything and enjoyed it.  Great experience!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SRFIwOTVhR296U25SRWRHcE9hMHhWVFRCbVVFRRAB",
            "text": "We had a great experience dining at Zou Zou's in Hudson Yards. Our group sat outside, where the ambiance was lively and stylish -- perfect for a relaxed evening with a bit of buzz. Service was a standout: attentive, warm, and impressively knowledgeable.\n\nTo start, we ordered the Dip Tower, beet salad, and fattoush salad. The Dip Tower is a must -- beautifully presented and packed with flavor. The salads were fresh and well-prepared, though the combination of ingredients in the beet salad felt a bit unconventional.\n\nFor our main, we shared the whole fish. It was generous in size and paired with tomato and oil accompaniments, which helped elevate the somewhat mild flavor of the fish itself. On the side, we had rice (very well done), sweet potato (a bit bland), and broccoli (a touch too spicy and saucy for our taste).\n\nWe kept it simple with drinks -- just sparkling water and an espresso. The total came to over $300 with a 20% tip, which felt a bit steep given we only had one entrée and no cocktails or wine.\n\nThat said, the overall experience -- from the setting to the service -- was memorable. Despite a few uneven notes in the food, I'd definitely return and look forward to trying more of the menu."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMVpsUlhOMmhaWDBVMFoweElhVXRCZDAxS2MzYxAB",
            "text": "Loved the food, atmosphere and vibes. The appetizers dips were amazing! A were the other tapas that we tried. The outdoor seating is really nice as is the service provided."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cE5VbERXbVIyVEdoWFVHNXFTRk5KY1VOVGVWRRAB",
            "text": "Hudson Yard. Midtown West. Nice lofty venue. Bar scenes as well as outdoor seating.\n\nMiddle Eastern cuisine.\nMust have is dips with vegetables and bread. Assortment of hummus, yogurt, with pomegranate, caviar, cilantro garnish.\n\nHad sangria which is more white wine base screwdriver with white melon slice, orange, and mint. Good presentation as poured into prepped chalice.\n\nGrilled chicken so tender inside while exterior open fire burn marks. Best in the City.\n\nScary long skewer for Yemeni filet mignon kebab. Olive oil chimichuri another great dip for bread.\n\nDessert bit short list. Will try Lebanese arak next time.\n\nServers juggling for long line at bar. Quite busy Monday night.\n\nIndoor access from hotel Pendry. Quiet lobby bar also look nice contrast."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQelM5cHFuX05yU2RREAE",
            "text": "Our experience was truly delightful at zou Zou’s. Service was beyond impeccable and food was perfection. Our chef was generous with his time and patient to our needs. We were addressed with a smile every time.  The hospitality was so warm . We accidentally spilled our nearly full glass of non alcoholic beverage and server was so polite to help us right away with the spill and reserved us the beverage without asking for and at no additional cost which we appreciated much. The food was so full of flavor. We ordered all the five dips which were served with pitta and salad.our personal favorites were green tahini and smoked carrot.Moroccan fried chicken is a must try which was so delicious and the spice was amazing , our mouth exploded with different flavors. The ambience was fascinating and calm. Can’t wait to visit again really enjoyed our time there."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQanFvcEhmN3U2eFl3EAE",
            "text": "Ordered the Moroccan chicken which was a mistake, it was dry and not that tasty. The broccoli was too spicy.  The yellowtail crudo was excellent though, very thickly slice like sashimi.  The toffee pudding was bad though, the ice cream was largely melted by the time it was served.  Service was excellent but the place was extremely loud where we were sitting and it was difficult to hear her.\n\nIt’s worth another visit and we want to try the tasting menu so it might get upgraded but 4 stars for now."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rellYb3RWSE5TVFdKcVZIQTRPVE5EVDNwSWFsRRAB",
            "text": "We stopped here for dinner before a show at The Shed and it was utterly delightful. We had the Dip Plateau (a must-try), the tuna tartare, the Manti (my favorite!), and the Golden Beets (delicious). The sticky toffee pudding was also a knockout. The restaurant is elegantly decorated and the service was impeccable. We would definitely come back, especially for the Dip Plateau and the Manti!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNk52SGFnEAE",
            "text": "This was my 5th time at Zou Zous. I love it because the space is gorgeous and I always have an amazing dining experience. The cocktails are beautiful. Food presentation is on point and flavors are wonderful.\n\nI almost had my wedding reception at Chez Zou because it’s just so gorgeous and cool.\nI always have good service and a great time when I go.\n\nThis was my first time for LUNCH. Get the latkes and some baked spinach eggs if you like savory. Avocado toast is spicy and delicious but like… it’s spicy. They were these little beef dumplings things my friend was obsessed with.\n\nCinnamon French toast if you like sweet was amazing.\n\nAnd get the unlimited spritz’s if you’re with friends around brunch. The value is unbeatable."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUE1FWTNkblJHVkRWTGMxQTNUWEpvYUVOR1owRRAB",
            "text": "Great Mediterranean food but surprisingly not a ton of vegetarian options. Enjoyed the delicious seafood, oysters, lobster skewer, and dessert options."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTU0yWm1jMk0xZFZoMVZYaFJTR2RPUjE5dWMyYxAB",
            "text": "If you're looking for a fun night out, Zou Zou's is the place to be! The vibe is super welcoming, and the food is just fantastic.\n\nFirst off, the dips are a must! You can’t go wrong with their creamy hummus or the smoky baba ganoush. Nevertheless, carrot puree wasy favorite! Branzino cooked perfectly with a crispy skin and flaky inside—just delicious! And you’ve got to try the Au Poivre Kebab. It’s super tender and packed with flavor. Seriously, you’ll want to savor every bite.\n\nThe Kataifi Cheesecake is out of this world. It has this amazing crispy crust and a rich cheesecake filling that’s the perfect way to end your meal.\n\nOverall, Zou Zou's is a fantastic spot for great food and a relaxed atmosphere. Definitely worth checking out!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KeVpYTlhNVWxTYUVWeFYxWjBOVXBYT1ZWVU9GRRAB",
            "text": "I loved the fact that we sat at the chefs table where the grill is happening. I was so excited!! We ordered the chefs set. When we got our food I had doubt feelings. In one hand there was ENORMOUS amount of food!! We took home 3 bags!! At the other - all of that was grilled and OVER-SPICED (not spicy, I mean too many different types of spices) EVEN tho I’m a fan of that and personally add bunch of spices, but at this case that was tooo much. No blend dishes so to say to make the taste a little smoother as my mouth was exploding!\nGenerally speaking absolutely must to go, but getting chefs menu? Nah, I’m ok."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSSGVuTnFXbUYwTmxrNFpHWTRRVFJOYTNWa1MyYxAB",
            "text": "The atmosphere of the restaurant was great. Gorgeous and relaxed but it could get rather noisy at times. Had lunch around 1 pm, and the place was rather busy. The three dip special that we had was tasty. Grilled half chicken was my main, and while it was cooked well, it was flavorless. Overall, I would not return for the cuisine, however, I am an avid enthusiast of their Menga Sangria, which was an absolute delight!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvM1ptQXVnRRAB",
            "text": "Stopped in, Mediterranean food with a twist - this by Hudson Yards. We had the chefs tasting menu for 3. The dips mix was excellent (the bread was good though, like a thick scallion pancake), the yellowtail was solid but unspectacular, the manti (beef dumplings) was fragrant and ok (labneh under it), fattoush salad was ok, the grilled branzino was smoky (the veggie was good smoked though), as was the yemini au poivre kebab. Wadi rum rice and charred broccoli.. smokey theme throughout. The kataifi cheesecake was lighter than expected, crunch and a bit of tart fruit. Fried chicken added was ok (moist but the flavor didn't carry through much), and the lamb chops were perfectly cooked.  Overall some good, a lot of smokey/grilled flavors so if you don't like that, might be tough. Will be back for the dip!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWdk9IbDZaVUpJUkV4V1gwdzFVSEpCTWsxRVRYYxAB",
            "text": "Decent Mediterranean/Lebanese in Hudson Yards. Recommend the yellowtail, lobster kebab and the kataifi cake. Fairly priced for quality."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUZ3FiYVNREAE",
            "text": "The chef's tasting was indeed a feast. The food kept coming, and it was a great experience to know that I couldn't possibly finish all of it and would have leftovers to recreate the feeling at home the next day.\n\nI was a big fan of the appetizers and the mains. The meat was a perfectly tender rare, the hamachi had a crisp flavor, and the manti had a gorgeous crisp and were juicy inside. The charred and wood fired vegetables were very tasty, with excellent spicy seasonings. The fish was good, but it's flavor didn't come through behind everything else. The dresser cheesecake was the largest dessert I've seen at a restaurant. At first simple, but with subtle notes of pistachios and spices.\n\nThe dip tower was less exciting. The dips were good, but few had a flavor that pierced through. Maybe 3 with more focus would be better than 5. The veggies in the crudite were fresh, but the bread disappointed me by being in a boring middle point between elastic and crispy.\n\nThe decoration of the place is lovely. A mix of modern and Art Deco. The staff is attentive and friendly, but very busy. If you've been to Ci Siamo next door, it's quite similar but louder.\n\nQuite fun, recommended to go in with time to contemplate the food on your table while talking with friends or family."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNXFuY3FRRRAB",
            "text": "Food, service, decor, and atmosphere all really great here. Stopped by for a work lunch and left impressed.\n\nYou need to try as many dips as you can; we tried them all and all were unique and tasty in their own way.  The smoked carrot dip was to die for.\n\nThe burger, chicken, and salad all made for good entrees. Good portions.\n\nGreat spot to try."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gc1JUTjNZVEphTmpKT2JuVndZMDlJTlVwSmVIYxAB",
            "text": "Zou Zou’s delivers a polished and enjoyable dining experience in a beautifully designed space. The service was excellent — attentive, courteous, and well-paced throughout the evening.\n\nThe entrance is impressive, and the overall infrastructure and ambiance are top-notch. The outdoor seating is particularly lovely: spacious, stylish, and perfect for a relaxed dinner with good music and a warm atmosphere.\n\nWe started with the mezze platter, which was a highlight — fresh, vibrant, and thoughtfully curated. The branzino was also superb: delicately cooked, full of flavor, and beautifully presented.\n\nAmong the sides, the Wadi Rum rice was magnificent — fragrant, perfectly textured, and deeply satisfying. On the other hand, the charcoal-grilled broccoli was covered in too much sauce, which overpowered the natural flavor of the vegetable. The sweet potatoes didn’t stand out either — underseasoned and somewhat flat in flavor.\n\nThe evening ended with a well-made coffee, strong and clean, which helped close the night on a good note.\n\nIn summary, Zou Zou’s shines for its excellent service, standout dishes like the branzino and Wadi Rum rice, and a beautiful setting. With a bit more restraint and refinement in the sides, it has the potential to be truly exceptional."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYnR0Y0R5eE5DN3dRRRAB",
            "text": "Great food great service It’s a good place. Nice location. Nice atmosphere. Zou zou dip. It’s really good. even outdoor looks nice. very close to Hudson yard. Very good cocktail drinks. I will definitely go back again. We had good food and good time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4eVYxTkxWV2xKTkhWRWNVTkRPVUkwVjNWd1FtYxAB",
            "text": "Wow. I had such a lovely time here. Being a solo diner is hit or miss--this was undeniably a hit.\n\nI started with the octopus carpaccio, finished with the Yemeni kebob and Brussels and had the sticky toffee pudding for dessert. The highlights were the carpaccio and the pudding, both recommended by Lamisse, my server for the evening who took such great care of me, made sure I had the right amount of food as a first time diner, and truly had the best recommendations.\n\nAs a server in the industry, it is always a treat to be given excellent hospitality. Zou Zou's will be one of my regular spots after this experience and I will be thinking about that sticky toffee pudding until I have it again. Genuinely one of the best desserts.\n\nLamisse!!! Thank you so much!!! What a treat!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcVBUZ3lnRRAB",
            "text": "Every single dish..from the appetizers..to the main entry ..to the drinks..were superb..totally recommend dinning here. GREAT FOOD. It tasted home made. The sampler appetizer with all the dips and the warm homemade pita was outsanding."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdmI3OTN3RRAB",
            "text": "The food on a whole was pretty good. The service however was bad. It may just have been our waitress as we noticed other tables getting better treatment. The food is also not consistent. We ordered the Brussels sprouts first and really enjoyed it and then ordered again and it wasn’t cooked fully and was rushed. The Chicken also wasn’t cooked well and was burned. It’s a nice place in terms of vibe and feel but it needs to improve. It’s not worth the money so I’d recommend going elsewhere to celebrate or a date night."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5b1pqRkNRazEzUzFSM0xYcDJPVjlETVRsbFQzYxAB",
            "text": "Amazing food, special dishes, definitely Mediterranean with a twist. Recommend to order family style and share. The service was great and the place is beautiful."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3eEp1cE1nEAE",
            "text": "I visited on a Saturday at 6 pm, and the place was already buzzing with energy. I was seated at the chef’s table, where the staff was attentive and the drinks were on point. Don’t miss the dip tower—it’s a must (I skipped it during my first visit and regretted it). The tuna tartare looked beautiful, but the green jelly/sauce was a bit too overpowering for my taste. Can totally skip the fried artichokes.  The standout dishes for me were the gem salad and the branzino, both absolutely delicious. To top it off, the cheesecake had a unique presentation and tasted delish!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyMXZPNnZBRRAB",
            "text": "This Mediterranean restaurant is a rare find at Hudson yard area! Delicious and beautifully presented dishes, attentive service, and in a spacious and elegant setting. Last but not least, the price is reasonable. We ordered Chef’s Menus for $74 per person. Highly recommended!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psYWNFczVTR0p0UjB4YU4wTXlYMGx5TTFscWEyYxAB",
            "text": "This place was unbelievable!!! We got the board of dips and each dip was phenomenal. I got the Yemeni Au Poivre Kebab and it melted in my mouth. The peppercorn hawaij was amazing. I also got the side Roasted Sweet Potato with Hazelnut Dukkah. Everything was excellent. Nicole was our server and she was so sweet and amenable! Jesus was also very helpful and kind. Thank you to the entire staff for your courtesy and continued service excellence!!! I will definitely be back!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmMHFXRGpBRRAB",
            "text": "Absolutely loved this place! Came for a weekday lunch and left very fulfilled.\nIt’s not a large menu but what they do offer is quite unique and delicious.  The dips is a must try.  My kid ordered the burger and loved it; it’s huge so can probably share with a parent.  My seared tuna salad with beets were fresh and tasty.\n\nLastly, the charred pineapple was amazing!!!! Probably one of my favorite desserts because it’s sweet, tasty, and so refreshing. It leaves you wanting more and more!! Will definitely return and highly recommended!"
        },
        {
            "date": "5달 전",
            "language": "ja",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQbVVpcXY3OGRQOFF3EAE",
            "text": "平日ランチの時間帯に予約なしで行きましたが入れました。\n\nフムスのセットとても美味しかった‼︎\n料理は美味しく雰囲気もいいのでオススメです✨"
        },
        {
            "date": "9달 전",
            "language": "ja",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBazVQM2V3EAE",
            "text": "料理は美味しかったです。\nただ新人が多いのか、ワインを倒してしまい、そのガラスがサラダの中に混入してました。\nそのサラダを下げたら別のスタッフがお土産として持ってきてしまい、逆に面白かったです。。\n\n評価が高い理由は、担当のスタッフが凄く気にかけてくれて、気の利いたサービスなど謝罪の意思を感じたので、また行きたいと思いました。"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNkxHVEl3EAE",
            "text": "Excellent experience every time I come here with clients. Creative Moroccan and Lebanese dishes in a beautiful high end setting. The portions are so generous that someone always takes home the leftovers. The staff are so nice, which is frankly not the norm for a buzzing place such as this, but they have gone above and beyond to accommodate, even when we didn't have a reservation last week."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0ek1FaDRTbTVxWWxaWVRYUk5kMlpZTTA5UmVXYxAB",
            "text": "Zou Zou’s has a beautiful ambiance that really elevates the dining experience. I visited about a month ago and meant to leave a review then—so this is long overdue. The food was good, but didn’t quite blow me away; everything was solid, just not particularly standout. The grilled branzino wasn't it for me! That said, the vibrant atmosphere and stylish setting definitely make it worth checking out for the vibes alone."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyMTdQMHF3RRAB",
            "text": "Get the dips. All five are great. The atmosphere was a bit too loud for me personally, but it was upbeat and the decor is cool. This is a popular business lunch spot, but somehow they didn’t have any vegetarian mains (!). We got a lot of sides instead. This is a good restaurant and convenient for those working in Hudson Yards, but I’m not sure if I’d come here otherwise. That being said, again, the food was good and it has an upbeat atmosphere."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGc1RYazBTazVFV0ZsWWVUWnlTRGxVVFU1Uk1GRRAB",
            "text": "Very disappointed. I ordered a full chicken, and when I asked for it to be packed, a piece mysteriously went missing.\nI counted every part before it was packed — and one was clearly gone when I got home.\nThis isn’t just careless, it’s disrespectful to the customer.\nI won’t be ordering from here again.\nCustomers deserve honesty and full portions, not food that’s been tampered with."
        }
    ],
    "reviews_count": 91
}