{
    "name": "Kitchen 46",
    "place_id": "ChIJmX1a4alZwokROmk9tCzmJbQ",
    "grid": "MN4",
    "address": "343 W 46th St, New York, NY 10036, USA",
    "rating": 4.7,
    "user_ratings_total": 525,
    "phone_number": "(212) 757-0788",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOemIyVkpWbVo0TjBveGRsYzNRWEJSYlV0U1FVRRAB",
            "text": "Gourmet food, small place with super attentive service, and low-volume soundtrack in the spirit of Spanish guitar"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paNk56aFZPR1ZrUmtNek9IbDVOVE5JTm1KSVFsRRAB",
            "text": "The food here was quite good. The atmosphere is nice but the space is definitely tight. It’s a small space and they’ve done the best they can with it.\n\nI thought the mezze appetizer left a little to be desired in the flavor department but the main courses did not disappoint. Cocktails were also solid. I would definitely come here again."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZd1RGQnJYM2gxVVVjdGVscG1OWFJPV0U4d2VsRRAB",
            "text": "My husband and I tried Kitchen 46 with our 4 children (ages 9-17). Everything was delectable. My daughter ordered the mixed seafood with saffron rice and the octopus was incredible! I’ve never known a restaurant that serves it like them. I had lamb and others in my family had the salmon, chicken, and mushroom pasta. Everything was phenomenal. The service was prompt and attentive without being overbearing. The server seemed unfazed that we had kids with us and treated them well."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvelRsZHpkWG8wT0dsbWRYVlhjMFJ5TUVWeU5GRRAB",
            "text": "Every bite at this restaurant feels like a special treat. The cuisine surpassed expected excellence. The employees maintain good standards. The place isn't expansive but maintains tidiness and a pleasant setting with city character. Helpful staff, wonderful meals, and a charming neighborhood."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSNU1EWkhhbGRpVG05TlFXZGthR0l3VVZaRE9IYxAB",
            "text": "I am visiting NYC from a small town so my expectations are not as high as others, but this restaurant for dinner was a huge disappointment. It was raining so we walk in and it’s so empty, that should have been our sign to walk away but again, rain. I ordered from the pre fix, Greek salad, salmon tagliatelle, and cheesecake. The Greek salad tomatoes were sad and the only thing edible was the small piece of feta. The salmon was not seasoned at all. The pasta was basically lazily cooked, not even in salt water since it too was under seasoned, and it was all sitting in a pool of lemon water on the plate which was supposedly the “dill sauce”. I could have done a better job cooking this meal at home and I’m not a chef. The cheesecake had a weird texture and was sub par. I can’t believe this restaurant has supposedly 4 stars. If you’re reading this and considering this place for dinner, walk away!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCR1JWaG5kRU41VERNd2FFMUJhMU01YzJ4eVRsRRAB",
            "text": "It's a nice place, good and friendly service, caring for their customers.\nWhile setting is somewhat simplistic, it is done in style and reminds of Mediterranean. But don't let simplicity fool you - food is better than your average tavern, by far.\nIt was a very nice experience, interesting salads, very good fish, cozy dessert."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRVRVODJRVVZvTFRoc1UzUlFiREJ4TFVoUVpIYxAB",
            "text": "Service was nice, food was delicious. I think the portion sizes were great."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oeU56aElTR0phWDFsRmJFSm1SRVJETFVSd1MzYxAB",
            "text": "Tourist trap waste of money"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVlNXWTBhWEJEVFdsZk9XeFdiM0ZGY1VoWU4zYxAB",
            "text": "Great Mediterranean food. Got the pre fixe 3 course and everything was exceptional. Friendly and prompt service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRVMzZDRPVVJsY3paU2Vra3dOWG90U1Rsb1gwRRAB",
            "text": "In town for business travel and looking for a fun spot on “restaurant row”. I love Mediterranean food, so I stopped in. I asked if I could be seated outside and the host said yes as they we very busy inside (5 tables max) but okay, I sat outside for 15 minutes and was going to leave, but decided to cut them a break, so I popped my head back in and asked if a waiter had been assigned to me. He said they “must have forgotten as they are busy”. I ordered the pre fixed menu. The village salad was recommended and was fine. The salmon tagliatelle was SO bland and dry. The reviews were positive for this, so maybe it was just the portion I received."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNWVuZFBObEI0TVZoVmJFOUpjVzFpYlU1TFRYYxAB",
            "text": "Wyatt and the rest of the staff were excellent. We ate outside on a perfect evening and loved the atmosphere and the excellent food!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRmNHOVplalo2UkdZeWExOXlNa3huVmpsR2EyYxAB",
            "text": "It’s a decent place on restaurant row but you can definitely find better Mediterranean food and cocktails."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwUk9FRnlNMXB3VjNoS2RrZHpZMnR4Vm5WdlpGRRAB",
            "text": "The entire staff seemed to work together seamlessly. We gave them leeway since Sunday night was extremely busy. They've created a nice layout and keep it very clean. Kitchen 46 creates memorable dining experiences. This restaurant demonstrates real expertise."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSS1Iwa3hVWFJ3ZDFadGNFaE5jV2xQYnpSWmVtYxAB",
            "text": "Efficient, friendly service and fantastic food! The lentil soup was super tasty. The chicken was cooked to perfection, full of flavour, juicy and so soft it was falling off the bones. The veg that came with it was perfect too. And finally, the cheesecake: wow. Extremely creamy but also heavy in texture. Sweet and tasty on its own but the strawberry accompaniments worked with it too. Excellent restaurant!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNFRWYzVXVmM1Vlc1MVpuTTJka1o0VnpSbU1WRRAB",
            "text": "Not a memorable meal. It was good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25adE1tUnZRbTlNVDBsUlprMUdhbEZOU1Vjd09HYxAB",
            "text": "Great place. We pretty much ordered everything the waiter recommended and it was all good.  Octopus was incredible. Fresh pita and taziki was the best I've ever had"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201YVltZFBjbkY2ZDBoVVZteHFURzlEU2xWSWJWRRAB",
            "text": "Very nice spot, great food, nice service. Came with a friend and we both loved it"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCTlFVTk9TRkpSYnpGblIwRjRPWEZoYVhBM1VXYxAB",
            "text": "Nos encantó este lugar, la comida es magnífica, la porciones son perfectas, la temperatura ideal, los cócteles buenisimos, el servicio es el mejor, del menú, el sofrito me pareció el mejor, el pollo y la pasta buenisimos, volveremos a este lugar encantados, si están en NYC les recomiendo no perderse este restaurante, la relación precio calidad es la mejor."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OU2FsZE9YMng2YnpSUFNUZFRiRXhHT1UxWWMyYxAB",
            "text": "We arrived a little late(15 minutes before close of kitchen). Coln and Fredy welcomed us anyway without hesitation. We ordered an appetizer of prosciutto croquettes that were delicious. We each ordered a different main: Burger, grilled local white fish, and a prix fixe option with a a salad of heirloom tomato, cucumber, red onion, cauliflower, Greek olives, feta, all dressed with a tasty oil/vinegar dressing. The second course was pasta and wild mushroom with a white wine sauce. All were terrific and all finished completely. We ended the meal with a desert called Prada. It was a chocolate bomb of cake, mousse, ganache, coffee, etc. . Amazing!!! Lastly, before leaving,  we asked Coln and Fredy if they liked the live piano music that was playing next door during our visit. They said it was great. In fact, while we were settling the check, Fredy went next door and arranged with the bar host to set up a table for us. Not knowing what to expect, we sat at our table. Before the first song ended, we were hooked and stayed another two hours. Please consider going to \"Don't tell Mama\"(the piano bar) after your meal at Kitchen 46. You won't be sorry!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSWFUVjZUV2xaWkhGNGRFeGpkMXBEYTJkR2ExRRAB",
            "text": "Excellent food and great atmosphere"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTmQyUjZNMnhmVnpkSmMwZENkazlxWTFSaExXYxAB",
            "text": "Amazing!!! So glad we happened upon this restaurant. We will be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xVk9GTk1ObVZ1Um10alEyOUdkbVJZU1hOTE5WRRAB",
            "text": "Amazing experience. The food is fantastic and Kyle is an excellent server. We demolished 2-dozen East Coast oysters. I highly recommended Kitchen 46."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GemRHZERWakZEWldoZk1ucEhOVmMwVHpSelMyYxAB",
            "text": "One experience here was enough to know I'd be back. I noticed how the design created ambiance. Nothing here feels second-rate. Staff delivered an experience worth mentioning. No alternative offers this consistency."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjMFdXRmpUV3h0TmxwRWRrcENaVkpKZUdVNGEyYxAB",
            "text": "The food was delicious, the waitstaff was friendly, the restaurant was clean and relaxed."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQk56aEtXVlJYY1V0NFJGVjRhMVZ2YzFrMlVYYxAB",
            "text": "Home made Pita bread, home made hummus, home made ice cream, Octopus & Chorizo was amazing, service was outstanding!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twelZrNVNPVVl3T1cxVlEyOUpXbGhGUjA4dGEzYxAB",
            "text": "Great experience! The server was kind and very attentive. We went around 5:30pm and there was no wait for 2 people without a reservation. We had the lamb and beef ragout pappardelle and the octopus & Spanish chorizo meal and both were delicious. I also had the passion inferno drink and I thought it was delicious with the right amount of spice."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTFNETTBZVVEyVlVOVFRqaDRaek5XYnpWU1lVRRAB",
            "text": "Great spot for light Mediterranean fare.  Menu isn't so big that you'll have trouble deciding, but they may have seasonal options that aren't on the menus here on the Google.  Flavorful, complex, filling dishes. Super friendly and helpful wait staff.  The restaurant does serve as the overflow for the Piano Bar next door, so it gets loud and crowded on the weekends after the kitchen closes."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5M1pFMWxkM1ZzTkd4MVdXZE1ObEZpU21OU1lWRRAB",
            "text": "Had the mix 46 salad and sofrito. Food was nothing special. No flavor bombs occurred. The descriptions were more exciting than the actual plates, at least for those dishes.\n\nWe sat outside on the patio and saw a roach. That could just be New York though and it must be acknowledged that my group & I were sitting outside.\n\nIf you’re reading this, my recommendation would just be not to order the same items I did."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KdGJEa3lOakpWU0d0amRIUlFWa3RDTjFCalpYYxAB",
            "text": "This place is just not good enough. The staff, although friendly, seemed kinda disinterested. They were kinda just hanging out, eating and chatting with each other. They were attentive enough, but it didn’t seem like they even liked the place. The food was pretty bad. The tomatoes in the salad were soft, no real texture, and the dressing was basically tasteless. The raw oysters were a bit off and there was on way to add the Mignonette was not well done, also there was no way of getting it on the oysters because there was no spoon for it. Octopus and Chorizo was awful. The octopus was tough like shoe leather. The air conditioning was on then it was off and it was hot at points. Just a terrible experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJU3EzckRWc1lMQmpRRRAB",
            "text": "Kitchen 46 is a hidden gem in the heart of New York City’s Theater District, offering a fresh and flavorful take on modern Mediterranean cuisine. Led by Executive Chef Guy Kairi, the restaurant blends classic dishes with creative touches, all served in a warm and welcoming atmosphere. Guests consistently rave about the grilled octopus, salmon tartare, and vibrant salads, while the friendly service and cozy vibe make it a perfect spot for a pre-show dinner or a relaxed night out. Kitchen 46 delivers a consistently satisfying experience—and it’s a place you’ll want to return to again and again. Highly recommended."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VOdnRyLUd3N3JIOXlBRRAB",
            "text": "I am a New Yorker, but I cannot stand noisy restaurants- This was one of the noisiest restaurants I have ever been to-\nnot because it is big or there was loud music, but probably because the construction is very poor and not absorbing any sound at all- Within minutes of us being there, my friend and I had to literally scream to be able to hear each other- It became a total nightmare and we could not wait to leave-\nFood was average to ok (also disappointing), nothing to be excited about- Service was good-\nRecommended sound level in restaurants is 60 to 70 dB- I had my sound level app on the whole time- our exposure to sound that night was constantly between 75 and 87 dB- It was a very disappointing experience for my friend and I ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKR3Y4Zlh2c1kySHpBRRAB",
            "text": "Had a prefixed menu, loved choices"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZX1BtTm53RRAB",
            "text": "Don’t tell mama burger is best in NYC very rare find! Amazinggggggggg"
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdmZxR1l3EAE",
            "text": "Mignon petit restaurant avec une carte à 3 plats délicieux pour 49 $ imbattable. Soutenez cette initiative et allez-y, vous ne serez pas déçus."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcGZuZ0xnEAE",
            "text": "Fantastic meal tonight at Kitchen 46! I had the salmon tagliatelle and my date had the seafood over saffron rice. Both were fresh, and were perfectly complemented by a light lemon butter sauce. Seth K was our server and he was so on point- knowledgeable, speedy and friendly. We’ll be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveE5yMU1BEAE",
            "text": "Very accommodating. Clean and delicious."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJelBmWldnEAE",
            "text": "Gianonna Chicken had excellent flavor. Decorations relatively simple but work."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3OTl1VXRRRRAB",
            "text": "The food and cocktails were both fantastic!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRenVPWUpnEAE",
            "text": "Everything we had was great, but the standout was the chorizo in the chorizo and octopus dish.  I asked the staff where they sourced it....in-house!  Excellent service, we were celebrating a special day and appreciated the fun recognition."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnLWJfQ19nRRAB",
            "text": "Great spot!  Staff was very helpful and food was fantastic!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBaWN5c0ZBEAE",
            "text": "Gorgeous!!! You will never regret it. Five stars. 👏👏👏👏👏"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcE5iay1BRRAB",
            "text": "I really enjoyed the service and the ambiance. However, I thought the food was just OK. For the price, I wasn't wowed and had high expectations coming in. Some of the people in our group did enjoy their food more than I did, so I still rated generous."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmdnE2VHNBRRAB",
            "text": "The service was wonderful - Jack deserves kudos for lively conversation and prompt attention. It was very cold outside, but warm and cheerful inside."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmM3ZMbzF3RRAB",
            "text": "Lovely meal in mid-town Manhattan. The food, service, and decor were all nicely done."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmaGUtMktREAE",
            "text": "One of my all time favorites in NYC"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmOG82bXVRRRAB",
            "text": "Good lunch place"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2ejRYQ1V3EAE",
            "text": "Food was so freshly prepared, great place before or after a show! And the service was great- thank you Jack, such a nice,relaxing dinner after a crazy holiday weekend!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2anJ1bVpBEAE",
            "text": "Very good Sushi, Personal is very good.  Will come again! Steven from Germany"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dk9hbFBREAE",
            "text": "Avoid at all costs. For a $100 per person , keep looking , don’t believe the four star reviews. The first red flag was the espresso machine being down. The second red flag was the missing flavors in our apps. The tzatziki and hummus were probably the best thing out of the whole meal. We got the mezze platter , salmon tartare and octopus salad. The octopus salad lacked flavor and the salmon tartare tasted like a Subways tuna salad. All were very mid. Then came out entrees a burger and a steak that we requested to be cooked medium and both came out practically well. The steak had no flavor and the chimichurri sauce that came with it was dry. The final straw was the color of our fries , the fries were dark brown , which is most likely due to the oil in the fryer not being changed . When we sent them back I overheard the person working the bar make a comment, when we asked for the fries to not come out so dark , he said we must want them raw, no we just want regular French fries! Overall terrible and waste of money. The owner clearly does not care about the customer experience. Who doesn’t replace the broken espresso machine ??"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2ak91YUtnEAE",
            "text": "It was a very cute place to eat dinner. Small, but definitely fun"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNU12ODBRRRAB",
            "text": "Kitchen 46 is a small, intimate and warm restaurant that offers great food and drinks and excellent service. I randomly stopped in for food and was thoroughly pleased that I decided to try them. I opted for their 3-course pre-fixe option which offers a great selection of items for each course for only $49 and was more than worth it. Every item I had was flavorful and delicious and well-portioned. The staff was warm and friendly, but also very knowledgeable and efficient and made the experience that much more enjoyable.\nAnd given that it's connected to the Don't Tell Mama piano bar and centrally located, it's a great place to have dinner before or after a night out in the city."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKaDVXeEJREAE",
            "text": "Went for lunch on a Sunday. No waiting needed.\nOur server was very cool and attentive. We didn’t ask for our water to be filled up every time but did it just by observing.\nFood was served on a timely manner with good proportions.\nWe loved the fresh octopus salad and oysters.\nMust try before or after watching Broadway"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiMG96UkNnEAE",
            "text": "This was a great find next to Times Square.  Grabbed a pre-fixe for Restaurant Week in New York and was pleasantly surprised by the food and the value. With the set menu, I received the mezze platter, salmon tagliatelle and dessert.  I saw the fries at a nearby table so had to try those, and glad I did, they were thick cut potatoes with the perfect crisp. Everything was prepared to perfection and the service was great,  If you're around Times Square, head a block or so down to Kitchen 46 for a Mediterranean meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROaHZEa2p3RRAB",
            "text": "Wyatt was the best waiter, the food was amazing and the drinks were so good. It was intimate, great music, ambiance. 10/10 would recommend. We had the cauliflower soup( best soup ever) the chicken and the raspberry delight. Everything was on point! Thanks for taking such good care of us Wyatt and team!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUenRfaS1RRRAB",
            "text": "Thank you Google reviewers! You did it again!! We were on a mission to find great food and the “right” atmosphere.. comfortable, warm, chic, (is that a word?) - this place is amazing, food was more than great, hospitality made us feel like we were locals! Atmosphere is so nice and they have a few out door seats. We got there right at 5:00 pm so be sure to make a reservation - again google reviewers, thank you"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCOVlXZ0lREAE",
            "text": "Had dinner at a brand new place on restaurant row last night called Kitchen 46, and everything was fantastic! They had great service, great ambience, and especially great food. The Gianonna chicken was fall off the bone tender and seasoned…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsOVllLTJBRRAB",
            "text": "In the home of legendary “Don’t Tell Mama,” a modern Mediterranean restaurant called Kitchen 46 has been founded. They offer Mediterranean cuisine with a Manhattan twist and the highest of standards. Whether it may be pre or post show, this is the perfect destination. Drinks are crafted beautifully with an amazing kick. Lamb Chops are not gamey at all with an amazing flavor. Entrees are both appetizing and flavorful. Fresh authentic Mediterranean food can definitely be found here. Pre or post show, this is the place for a great meal.\n\nTale of Two Gins 20\nCosmic Elixir 20\n\nMezze 25\nLamb Chops 35\n\nSofrito 32\nMoules Marinieres 23"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxc0ozOXdRRRAB",
            "text": "We came for an early dinner before seeing a Broadway show on a weekday. The food was flavorful, the staff was friendly and attentive, and we thoroughly enjoyed the experience! I ordered the Eggplant and Sausage appetizer and it was lovely!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyb1BlTFFBEAE",
            "text": "Pappardelle pasta was horrendous, it came out late so it was clear the kitchen forgot about it. When it did finally come out the it was very bland and watery. I ate two bites but another was unpalatable.. salt and pepper couldn’t even save it unfortunately.  Wait staff was friendly but shouldn’t have recommended this pasta dish.  The only saving grace was that the starters were decent."
        },
        {
            "date": "2년 전",
            "language": "ar",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbnVmbk13EAE",
            "text": "لذيذ جدا\nالمقبلات ولا غلطة فيها\nالأضلاع جدا لذيذة مع اللبنة\nالأرز بالزعفران مع السي فود خيالي،خيالي،\nالمحاشي،ماعجبتني،مدري ايش محشية فيه وفقط فلفل بارد كنت اتمنى تكون كوسا و فلفل وباذنجان وتكون مليانة زيت زيتون مع رز وخضار بتصير يمي يمي،\n\nالمكان بشكل عام جدا ممتاز\nالخدمة ممتازة\nسريعين في الطلب .\n\nشكرا كثير على الغداء اللذيذ\n\nلكن لدي سؤال بماذا محشي الفلفل ؟"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREMF9ldU1REAE",
            "text": "Wyatt was wonderful! I couldn’t eat due to a health issue and he was kind enough to let me join my friends at dinner to celebrate a birthday, which meant a lot to us. He’s kind, warm, and friendly. Great service. The birthday girl’s mushroom pasta was incredible!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0a0lMbGxBRRAB",
            "text": "Good food and good service. I noticed a lot of theater goers. The muscles are delicious just as the fries! The fries are super crispy. The lamb/beef kabob is good! Should have added a side of persian rice to mix with the grilled tomatoes. Would definitely come back to Kitchen 46."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqc0tMT2x3RRAB",
            "text": "Very nice restaurant. Just honest ingredients with excellent flavors. Service was great, attentive but not pushy (unlike some other restaurants). Go here for proper food and a general nice evening.\nHad the mezes and NY tenderloin steak, both good dishes. Nice steak that comes without fuzz (butter, unnecessary sauces etc)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNEpySGVnEAE",
            "text": "I had the pleasure of having a late afternoon lunch at this lovely hidden oasis of tranquility. I ordered the mezza and wild fish. Both were great but the best thing was the kind bartender Mato.\n\nI don’t drink alcohol, and was going to be fine with just water but Matowent out of his way and made one of the best mocktails I have ever had. Last but not least the classic 80-90 music made it all the more memorable."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCNVpfVkVnEAE",
            "text": "Really solid burger! Loved the pretzel bun. Fries were so so good, addictive really! It’s kinda pricey, service is decent and the space is cute!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdy1MT01nEAE",
            "text": "This restaurant is new to Restaurant Row. Next door to the world famous Piano Bar Don’t Tell Mama it is a welcome addition to the street. The sleek elegant modern vibe inside is matched with the class Mediterranean fare which is featured on the menus. The fries are out of this world, very similar to the frites one would get in an upscale European bistro. I particularly enjoyed the Octopus Salad. The pizza was crispy and the shrimp cocktail was delicious. perfect setting for a casual night out with friends, pre and post theatre dining and romantic outings. Definitely check out Kitchen 46 on restaurant row."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOU5UaUp3EAE",
            "text": "Restaurant row would be an understatement! While in the city to see Hells Kitchen (a MUST!) we came a bit early to find an early dinner. As expected it was very busy but we walked around a little and this place felt super cute. We always appreciate menus outside the restaurant and the hostess was readily available for a couple of questions.\n\nThey offered gluten free options and dishes, so we decided to give them a go. And so happy we did.\n\nTheir house Sauvignon blanc was tasty and we both enjoyed the mussels + fries. The broth with the mussels was delicious (but unfortunately we both had between 6-8 unopened mussels which seemed a lot as an entree. The fries were delicious (+ I’m not a fry person!)\n\nThe service was fast, efficient, personable and very welcoming. One could/should add this spot to your pre-show dinner options."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCZ0lmLVBnEAE",
            "text": "The food is excellent and special. The chef is Israeli and brought the taist and the accent of the Mediterranean food. We ordered so much and every dish was excellent. The service was very good and attentive. I will go there again for sure"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6OXVISEp3EAE",
            "text": "We couldn't dine in, so got take away. Which is so hard to do right. This food was terrific, even as takeout.  And we are super picky. Chicken is literally fall off the bone and great flavors. Carrots and cabbage we're done beautifully. Fries were great. Pasta was perfect. Village salad is solid. A real hidden gem, and we look forward to dining in next time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoajZqWHN3RRAB",
            "text": "Amazing food with a great bartender! Would come here again in a heartbeat! Great music playlist as well. He even got us a spot at the piano bar!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNENkt1S3RnRRAB",
            "text": "I had a delicious pre theater dinner at this small restaurant on restaurant row on 46th Street. The hostess was friendly and helpful with the menu, and I enjoyed the Lamb and Beef Ragout pappardelle pasta that she recommended."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4a2JLUklnEAE",
            "text": "We were walking by and not sure if we wanted to have dinner here. So many choices on restaurant row. Fredi and Ashlyn lured us in and promised a great experience. Boy did they deliver. The service was excellent and the food was outstanding!!  Don’t pass this place by. You will not be disappointed. My wife and I have been back three times now. Well done Kit Chen 46!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdXRDWjd3RRAB",
            "text": "Great restaurant! Excellent food! The fish of the day was absolutely delicious. Patrick was attentive and accommodating to all our requests. Very knowledgeable of all dishes and gave great recommendations!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxb2Nmd0pBEAE",
            "text": "Service was incredibly fast, we did not wait long for our food. I highly recommend Wyatt, he was my waiter and he did an amazing job! The food was delicious, highly recommend the pappardelle and lava cake!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1dk5PM1Z3EAE",
            "text": "Super personable staff and great atmosphere. Very relaxed and cool. The custom light piece above the bar is beautiful. I got the Cosmic Elixir, it was complex and tasty. The oysters were tender and fresh. Everything was excellent. Highly recommended"
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxdXV2TUhnEAE",
            "text": "Ein sehr süßes Restaurant mit grandiosem Essen und perfektem Service. Wir sind durch Zufall auf das Restaurant aufmerksam geworden. Wir konnten an Weihnachten ohne Reservierung dort abendessen. Wir waren danach so begeistert dass wir am nächsten Tag gleich wieder dort waren. Das Essen war unglaublich gut und der Service sehr sympathisch jnd aufmerksam. Beim nächsten New York Trip gerne wieder :) vielen Dank!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0Mm82emlnRRAB",
            "text": "Wyatt was so sweet and wonderful!! Patrick the bartender was also amazing and gave me some delicious shots for my birthday! The service and food was top notch, so glad I chose to spend my 30th here :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5MGVtTlBBEAE",
            "text": "Nice experience overall, accommodating for large party and dietary restrictions. Prix fixe was a nice option; the Wild Foraged Mushroom Pasta was inspiring. The Prada chocolate cake was flavorful but a bit dry. Will visit again to explore the menu!"
        }
    ],
    "reviews_count": 78
}