{
    "name": "The Harrow New York",
    "place_id": "ChIJNwKq-VBYwokR_j9BzG-OvgM",
    "grid": "MN4",
    "address": "720 10th Ave, New York, NY 10019, USA",
    "rating": 4.5,
    "user_ratings_total": 324,
    "phone_number": "(212) 757-6977",
    "reviews": [
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWd2JVWTFaalJyYWkxNVMxQnFUSGRqU0U1bGNXYxAB",
            "text": "The braised octopus, the lobster Mac & cheese & the chocolate cookie dessert are my favorite here. I’ve had a great time each time I’ve visited. The restaurant has a lovely spacing & the staff was just awesome."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbjlLWWdBRRAB",
            "text": "This place shut down. They really need to remove it from google."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSMDlDQ2VBEAE",
            "text": "Pretty damn decent. Food was great. Decently priced. A very quiet day. So it was a very personal and attentive experience."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHM2RTejBBRRAB",
            "text": "Took first bite and stopped to review. OMG amazing food! Make a reservation... right now. Third or fourth visit here... It just keeps getting better... Seriously! MAKE A RESERVATION."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSblpPQ3B3RRAB",
            "text": "I live near and have loved The Harrow for years. I've recommended it to friends and had company dinners there. I'm a fan. I'm hesitant to write a \"bad' review, but this needs to be said. We were a party of 4 that had a 7:45 reservation on a recent Tuesday night . We were seated immediately as there were only a couple other occupied tables. We noted it took a long time for the waiter to take our drink order. Then it to another long period of time for our food order to be taken and a long time for the food to arrive. Specifically it took until 9:15 (90 minutes) to get our food.\n\nEarly on we realized that they had only one person covering both the bar and the entire restaurant floor. They were kind and efficient but obviously overwhelmed. There was a slight mention that they were busy behind the bar when they realized they hadn't taken our food order. Beyond that -- Two of us were pleased with our orders. The other two ordered their burger and both were disappointed. It was formed into almost sphere, and plopped onto the middle of a huge brioche bun, with a few leaves of arugula no tomato, onion, condiments (non offered or brought separately). It was listed on the menu to include cheddar cheese, something that dawned on me half way through,  then checked. There was indeed cheese but it was white and very light maybe Monterey jack? I dunno. I ordered it cooked medium, which was probably a mistake because it was most definitely cooked well-done, therefore dry and even tasted a little kinda \"old\".\n\nI'll go back and hope for another great meal, but this review is more for the management: Folks, if Tuesday night is a losing proposition, simply take financial hit or don't open at all.\n\nDefinitely do not open short-staffed and offer a lack luster frustrating dining experience.\n\nPlease!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSek5hamFREAE",
            "text": "nice place with very good food and nice people"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoblpXMlVBEAE",
            "text": "Marvelous location. Great decor. Staff was extremely friendly and engaging.  Food was out of this world.  Octopus salad was yummy.  French Onion soup was great and baby arugula salad was perfect with the lemon dressing.  Outstanding experience!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoalpfVzF3RRAB",
            "text": "Great spot in Hells Kitchen with amazing cocktails, good food, and friendly service! Go for the spicy margarita, espresso martini, burger, crispy pork, and the cookies!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoMWR5V21nRRAB",
            "text": "Great cocktails, tasty food and outstanding service"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoeVo2RzNnRRAB",
            "text": "The cocktails are a great way to start, they are sophisticated and well crafted.\n\nThe octopus and the merguez were solid.\n\nAnd we love the duck and the mussels"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNHFhYy1nRRAB",
            "text": "Everything we ate was a step above delicious - pate, salad, mushroom risotto, as was the rose wine. Service was friendly and attentive. We will go again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoZ29HdzNRRRAB",
            "text": "So close to all 5s! A great date night, drinks with friends option on the west side! Unique cocktails and menu choices in a chill setting."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoOE1TN0t3EAE",
            "text": "Food and drinks were okay but coming here with a large group is difficult. A good date spot but not your best group weekend brunch"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoLTlHRHhRRRAB",
            "text": "Really not as good as the reviews make out.\nNice setting and friendly staff.\nFood:\nTuna Tartare - mushy and below par\nSpinach Salad - tasty, fresh but mushy\nPasta e Verdure - fresh but so oily it was inedible and overpowered by garlic\nBurger - Good but not great. A sloppy mess with crispy potatoes on the side, which were the best part of the mains.\nToo expensive for what it is and so many better options close by"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoblktZ2VBEAE",
            "text": "The food was great, nice atmosphere.  The staff were all friendly and attentive.  Recommended!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNXZTb2lnRRAB",
            "text": "Fine brunch fare in Hells Kitchen"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoaWNLejl3RRAB",
            "text": "I went for happy hour. It wasn't too good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoOGVQMDhBRRAB",
            "text": "I so enjoyed our dinner here, the food was excellent the cocktails were interesting and the service was friendly.\n\nWe'll be back to try some of the other dishes for sure."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoOFlpNF9RRRAB",
            "text": "This place always has amazing cocktails and food. The staff remembers us, so it's like a fancy neighborhood bar. The cocktails rotate so they're always changing and have different types that appeal to different tasts."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoam8zRlNnEAE",
            "text": "Consistently excellent food and service. Cocktails are very tasty. Great vibe, great staff."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoOXEzWmlnRRAB",
            "text": "This is a wonderful spot with delicious food, chill atomsphere and a friendly staff. I had the Smoking Glass cocktails which was quite elevated. I had the short ribs for dinner which I highly recommend. Give them a try, you won't regret it."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCaDhpQzd3RRAB",
            "text": "Visited The Harrow on our last evening in NYC. Our waitron (Augustina) was very helpful and made a great recommendation on the Pinot Noir. The menu came across as focus and promised much, but lacked a bit in terms of portion size and execution.\n\nWhile the Cider Braised Bacon, Braised Short Rib and Cast Iron Mac & Cheese didn’t disappoint - My Crispy Pork Shoulder was anything but crispy, and the Warm Apple Tart needed something more than the fancy knife work to make it special.\n\nOverall, not a bad experience, but it promised to be so much more, which I guess detracted from the evening a bit - Especially considering the bill came to $200+ for two adults and a child."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMmQ2RWN3EAE",
            "text": "The staff were very helpful and professional.\nMenu was interesting.\nWe enjoyed our brunch."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCOHBhRElBEAE",
            "text": "Great atmosphere and service, as well as great food on a menu that changes constantly, and a good selection of wines."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMHFfYjB3RRAB",
            "text": "Cold food. Slow service. Bad quality food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCbmVEZzBRRRAB",
            "text": "Very nice atmosphere and delicious dishes. I'd love to go back there. 😍"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCN2NuV2hnRRAB",
            "text": "Cute, cozy atmosphere. The food for brunch and drinks were just ok."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPa3FxMXRBRRAB",
            "text": "The staff was wonderful and so welcoming. The drinks and food were delicious. We will definitely be coming back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtNGYyUnN3RRAB",
            "text": "Loved it! Went there last night. Both the chicken and the risotto were outstanding. Especially the chicken. It was just perfectly cooked and tasted amazing. The waitress was lovely and the service was excellent! The ambiance was also very nice."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtd2VpeHBBRRAB",
            "text": "Service was excellent, ambience and location was great, food was a hit or miss.\n\nThe appetizers were excellent, would recommend the octopus salad along with the chicken liver pate. Deserts were also very good. All worth the price.\n\nThe server was very nice and attentive.\n\nThe entrees were subpar. I ordered the Steak Au Poivre, with medium doneness, and it was cooked all the way through to the point that it was tough and chewy. The scalloped potatoes side dish was raw in the center and had the snap and starchiness of uncooked potato. I sent it back and ordered a burger instead, which could have been cooked better; the meat was tasteless and tough. The wedge fries were crispy on the outside, but the inside was not soft.\n\nI think if the kitchen staff can nail down the preparation of the meat and potatoes, this can easily be a top tier dining experience, especially for the prices."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbnFPZnNnRRAB",
            "text": "We randomly picked this place and wow!   So good.   Real chef must work there cuz food was exquisite.  I had hummus and the pita bread was fresh.... Not some bagged stuff.... but made from scratch for my order. Grilled with yummy char marks.  My husband had a slab of meat... I'm vegetarian so I'm not sure if it was beef or pork.... Looked like beef?  Any way he ate it with a fork.  Never used the steak knife they provided.   Absolutely so tender.   My friend had a huge plate of mussels and commented how good they were.  I also had the pannacotta.   Freshly whipped cream on top.  Very good flavor to the pudding.   The place was Empty.  We kept talking about how is a place this good empty?   We live in battery park by world trade center and yeah there's a ton of great restaurants in the city but there are also a  lot of mediocre.  Sadly, the not so good ones are often packed.   This place was amazing.  Nice decor.  Prices were good.  Comfortable chairs/ tables.  Very clean.  Very nice wait staff.  They even were nice about my little service doggo.   Why is no one there?   If you're visiting Times Square, it's a short walk and worth it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlbjdyTDd3RRAB",
            "text": "Overall rating: 4.8\n\nI absolutely loveee this place & brunch. The deal. Guys, the deal alone. Make a reservation immediately. $44 brunch entree PLUS 3x brunch cocktails. There’s nothing in addition, it’s all in.\n\nI only knock off a few points because, man, it is quite a trek! But if you’re in the area or just want to to live a little I highly recommend. I also like how it’s away from the bustle of HK. I went on a Saturday towards the tail end & I really liked the calmness.\n\nThe service was so nice and just so sweet. The food came out reasonably fast & our waitress timed the drinks pretty well.\n\nI"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlMnUtNkd3EAE",
            "text": "Atención y servicio exquisito (Agustina). Las raciones no son muy grandes, el producto es de muy buena calidad. Amplia carta de vinos. La carta de cervezas es más escasa. Decoración estilo industrial muy elegante. Música de ambiente…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyeWJlRElnEAE",
            "text": "Very good food and nice ambiance! We’ll definitely go again to try more other plates! Mushroom toast was delicious!!!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHemE2aUNnEAE",
            "text": "Cocktails are delicious! Our host was awesome would come again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1c2JDNnNBRRAB",
            "text": "Came for dinner with husband and had a Wonderful experience. Great food, great service. We had Duck Breast in Tamarind Glaze and a Hanger Steak au Poivre, with vinegar and onion potatoes.\nDefinitely recommend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1bE1XMVJREAE",
            "text": "Very quiet and unassuming. Food and service was excellent. Wish we could have returned for brunch."
        },
        {
            "date": "3년 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPa3E3dnVRRRAB",
            "text": "食物烹調精細美味,份量充裕,環境舒適,地道美式餐廳."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPaVBtd0lBEAE",
            "text": "Just outside of all the chaos. Nice relaxing meal. Great food"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPc0xXb0R3EAE",
            "text": "Great service"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPZzZtYVVnEAE",
            "text": "Fantastic food!!! Great place to be. Beata is the best!!! Highly recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPazlQQ3hRRRAB",
            "text": "The harrow, 100% recommended!\nA must try the fish tartar. The fish and that avocado touch blends perfectly! This place feels like home.\nI’m coming back for sure!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPc1pMcEVBEAE",
            "text": "So good! The food was great, the brunch special 3 brunch drinks + entree for $44 is a steal. We got the eggs Benedict, cheese and bacon omelette, buttermilk sandwich, and biscuits and gravy - all so good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPb2M2Zm5RRRAB",
            "text": "Modern decoration and very tasty food.\n\nThe price is reasonable. We opened a bottle of Champaign so the cost per person is high."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPa3RxRlZnEAE",
            "text": "Beyond just the trendy atmosphere, the staff, food, and all the drinks live up to a specular experience!…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPaE5xakdBEAE",
            "text": "What a wonderful restaurant!\nNice atmosphere, wonderful high quality food food and beverages, attentive, nice and fast service. If I lived there, I'd go there quite often. Highly recommended!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyNGJ5c1RBEAE",
            "text": "Very good food and service! Nice bar as well with great cocktails in Hells Kitchen! I recommend"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyanRmUjRRRRAB",
            "text": "Couldn't find anything special in this place. The food taste too ordinary for that price range."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyckt1XzlnRRAB",
            "text": "Consistently great food. The bacon is out of this world (if you also like blue cheese). Great cocktails as well, stone quite unusual. I have not had any bad meal there so I would definitely recommend this restaurant in the neighborhood"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyak02dGVREAE",
            "text": "Everything was exquisite and delicious!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZNjdMVDB3RRAB",
            "text": "The food was mind bogglingy good. Every ingredient was perfect, and the dishes were really well balanced. I had the pork torta, and the pork was perfect, but the amazing stand out was the perfect red peppers adding this fantastic sweetness…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNb29lbkNREAE",
            "text": "The Harrow is my go to brunch spot, they have great entrees and drinks! The drinks will get you by surprise though! I love the entire brunch menu, but the crispy pork is probably my favorite, followed by the toasted coconut French toast. The staff is also really nice!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHX1AzLVlnEAE",
            "text": "If I lived close to here, I would go broke!\nTruly an exceptional dining experience.  The cocktails are second to none and every dish was delectable.\nThe Maine Mussels were superbly seasoned and the duck was crispy and juicy.\nBoth whisky cocktails were delightful for different reasons.  I’m still in a euphoric state after enjoying this delicious meal."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRMVpfek9REAE",
            "text": "We arrived a few minutes before the kitchen was closing at 11 and the staff were so accommodating for our hungry group. The food was amazing - every single dish! Would definitely come back. In addition the ambiance was perfectly dimmed and the music was good. So happy with this find!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJMDhDeTlnRRAB",
            "text": "This is lesser known spot in Hell’s Kitchen because is not super noticeable from the outside. I walked by it once and decided to try it out for dinner on a Saturday night. Our dinner experience was very enjoyable and smooth. The food is delicious, the ambiance is nice and cozy (think dimmed lights) and the staff is friendly and professional. We ordered the duck (5 stars, yummy!), the hangar steak (soft, but too much pepper in the sauce for my liking), an octopus starter (delicious, but not to die for) and a Rosemary Blush cocktail (fantastic!). We were seated at a table but the place also has a bar with awesome cocktail offerings and a lively bartender. Prices are reasonable for NYC, and the seating is not too crammed despite limited space. Overall, great neighborhood spot... will be back for brunch!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2NWJLWXBnRRAB",
            "text": "Beautiful ambience and amazing cocktails! A bit pricey, but great for a nice night out. Their Happy hour deals seem extremely good. We loved the za'atar spiced pita and their hummus. The sage infused vodka had an amazing flavor to it in The Wise Woman which also I'd recommend."
        },
        {
            "date": "4년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2Nm8yLS1BRRAB",
            "text": "This place in Hell’s Kitchen is a farm to table. The restaurant serves new American cuisine with a great atmosphere, courteous and efficient service, good food are and it is a nice spot for cocktails with interesting creations.\n\nEste lugar em Hell’s Kitchen é uma serve alimentos da fazenda direto para a mesa. O restaurante serve a nova cozinha americana com um ótimo ambiente, serviço m eficiente, boa comida e, também é um ótimo local para coquetéis com criações interessantes."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3Z3JDRFBnEAE",
            "text": "This place has a great ambience pretty cozy and is bigger than it first appears eith seating in the back. The staff are attentive without being overbearing. I recommend this place mainly for the cocktails, they're a bit pricey at $14 a pop but they are tasty. I had the Oaxacan Monk which is a mezcal cocktail and then the Smokey Rye (might not be the actual name) which is bourbon based, both really nice especially if you aren't a fan of sweet drinks. Unfortunately, while the food is well presented I think in terms of flavor its unfortunately a bit mediocre to my palette. I tried their oysters, escargot, hummus, duck and hanger steak. The oysters didn't taste as fresh as I would have liked; the escargots were served in a basil garlic butter sauce that felt a bit too much; the hummus was quite tasty actually; so was th duck and the hanger steak but it also wasn't the best I've ever had. Overall I recommend this place for cocktails and maybe a date spot."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNna3R1ZGFREAE",
            "text": "Beautiful place, perfectly dimly lit, romantic or not, organically sourced small restaurant with an awesome, very attentive staff. I had a wonderful time! Definitely a great spot for dates, friends, and coworkers from out of town. Creative,…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxMHJxdTZRRRAB",
            "text": "Maybe I caught them on an off day, but the Saturday brunch wasn't great. Our waitress seemed new/confused. She asked if I could change my iced latte order because it wasn't in the system? Haha then my girlfriend's pasole come with the egg yolks cooked and the egg white liquid. Not too sure how the chef pulled that off. Anyways, breakfast is pretty simple and I'm pretty laid back reviewer but I took off a couple stars - 1 for service and 1 for the food."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvNWZPZG5nRRAB",
            "text": "I like the ambience:  minimalistic elegance.  The food: well seasoned.  My husband had the pork shoulder with chimichurri crust, very good-he said.  I had the Cod with celery root pureé with leeks- I would recommend it.  Dessert was Spiced…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRbHJERUJ3EAE",
            "text": "Tasty, great staff, and very well priced for the neighborhood. Four of us shared two salads then each had a main dish which was plenty of food. Kale Caesar was my favorite of what we had. Crispy Pork shoulder was good, Octopus pasta very good. Steak and burger looked great but I didn’t try."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwdk51R1Z3EAE",
            "text": "Good quality food, nice selection of wines and really friendly staff. Another good sign is its always packed with locals. Recommended dishes include the slab bacon, duck, hanger steak and lobster pierogis"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRMk0tQXR3RRAB",
            "text": "Ordered the hanger steak medium rare which had very good flavor and was filling. It came with finger potatoes and asparagus which was also very good. Restaurant was clean, service was great and Peter, one of the owners made sure to stop by and see how our meal was."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzbXN2Q3BRRRAB",
            "text": "WOW!! First time at The Harrow and it was a pleasant surprise.  Hidden Gem in the heart of Hell's Kitchen and sheltered from the TSQ crowds.  Craft cocktails rival some of the best in the city!  Food was fantastic! Small but impressive wine…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBd2EyTDZRRRAB",
            "text": "We went in for a Saturday dinner with friends  and got a table right after we got in. We got a cocktail each which was good. The bacon covered dates were good too. We ordered the kale salad and the burger for mains. The salad was good but the burger was ok. The spaghetti was ok too.\n\nFor dessert we ordered the cookies and the chocolate cake. The cake was just burnt and crunchy. We asked the server if this was right and he said that that's the way it is. If you like burnt crispy cake then you could go for it."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndjQyeFZREAE",
            "text": "Beautiful space that just opened in Hell’s Kitchen. Great pasta and duck. Solid drinks. Awesome addition to the neighborhood"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwLUtlYm5RRRAB",
            "text": "The server was phenomenal and the food was great, as well.  I recommend their Pozole dish. Very tasty!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnMzRHVjhRRRAB",
            "text": "Great service, amazing food! Can’t wait to come back to try more of their delicious  creations."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwbDdhMmRREAE",
            "text": "Very nice,  yummy food and  great service. Or waitresses asked if we were going to a show in order to get us served in time."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHOGMtNDN3RRAB",
            "text": "What a fantastic experience. The host was energetic and welcoming, our server was kind and provided suggestions for every course including drinks and the food was tremendous. I've sent notes to several friends to not only go, but go and have the exact menu I did. For a party of 2, we had the bacon, the squid ink risotto and the octopus salad. Hurry there."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpZ05mRmZBEAE",
            "text": "Lovely little restaurant with a nice ambiance.  Indoor seating well spaced out for social distancing in this time of Covid.  We had happy hour appetizers, drinks and the crispy pork.  The food was tasty, unique flavor profiles and good size…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNa18yNzlBRRAB",
            "text": "Edit, 5/2021\nAs great as always!  Had brunch today. It's so good to be back in the city, especially at the Harrow. Great food, great service, as always. The French toast dish is one of the best things I've eaten in a very long time. Get to this place.\n\nWow, wow, wow! The Harrow was fantastic! Great food, great wine list, great service. Every bite was simply delicious and better than anything you've eaten. Don't miss the Cider Braised Bacon and the Grilled Octopus. Can't rate this high enough. Go there!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnai1HWEFREAE",
            "text": "We stumbled upon this place by chance and were so happy we did. We had a truly magnificent dinner. Mushroom tart and steak tartare were delicious, flavorful and fresh. For my entree I had the burger, my companion had mussels which I’ve…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBay1DbmlRRRAB",
            "text": "I live just a few blocks away from this place and visited twice already. First time out of curiosity, second time because it was so great. Very pretty, cozy interior. Mushroom tart for starters was delicious and full of flavor. The pork…"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnaW92MjN3RRAB",
            "text": "Wonderful dining experience.  Beautiful space with delicious food, tasty cocktails and attentive service. Loved the mussels, what an innovative and flavorful dish. Same can be said about the octopus pasta, creative, simple and so delish. The rosemary blush cocktail was wonderful. Great addition to the neighborhood"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDOGNYeEJnEAE",
            "text": "We love the food at Harrow and the cocktails have been amazing consistently! We’re thrilled they are reopens for outdoor seating. Please let them know you’d like to eat there even if they look full- they have space to expand! Our server,…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVNmNxbFlREAE",
            "text": "I went to this place for the first time and to i am so happy about it! The atmosphere was so sexy and intimate, perfect for a date and to get some drinks! The staff was so attentive! They made our night amazing! We had  mushroom tart and it…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0dUs3bXd3RRAB",
            "text": "A place of knowing what they are doing. The 4 stars I gave for their food and drink. We went as a party of 3. The lamb I had was nicely cooked. I ordered medium, and it came out just as I expected with acceptable very slightly lamb smell.…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwNnNIbk5BEAE",
            "text": "Great brunch spot. We have been several times and tried a bunch of things, everything has been very good. Upscale feel but in a very relaxed way. Excellent and super friendly service. It’s small and cozy but we have never had to wait for a table."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwNm9HREF3EAE",
            "text": "Wonderful place tucked away from the crowds. I have been here a couple times now for brunch and love it. Delicious food and friendly staff, plus we have never had to wait for a table. Eggs Benedict is delicious especially with the avocado! Highly recommend!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHa2VEcnhBRRAB",
            "text": "The staff made us feel welcomed. Bea was an amazing server and our host Hailey was so sweet. The food was amazing. The brunch special with three brunch drinks was a steal at $39 per person. Can't wait to come back"
        }
    ],
    "reviews_count": 82
}