{
    "name": "Añejo",
    "place_id": "ChIJUWd2llFYwokR7LA8HroSFMk",
    "grid": "MN4",
    "address": "668 10th Ave, New York, NY 10036, USA",
    "rating": 4.4,
    "user_ratings_total": 1759,
    "phone_number": "(212) 920-4770",
    "reviews": [
        {
            "date": "4시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4dmRIZHRlbUZoU1V3eE0xZG5SRlJ4Ym1WYWMzYxAB",
            "text": "Fantastic cocktails! Beautiful presentation and great flavors"
        },
        {
            "date": "7시간 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210UlkwOWhaVFJmWjFSM05sTlJiV3h1YkdNdGNXYxAB",
            "text": "The service at Añejo was really good, very friendly and attentive. Unfortunately, the cocktails weren’t the best; I think they could use a little improvement. The food had good flavor overall, but the excessive use of fresh jalapeños overpowered the other ingredients.\nHowever, the Tres Leches dessert was absolutely amazing, the best I’ve had so far."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ka09GSmlWWEZQUVZSTVlUTnNhR1JUVUdGd2FtYxAB",
            "text": "I spent my birthday here. It was meant to be a few drinks with friends at a place with cool vibes/ambiance. Thanks to the incredible service of the staff and manager, it turned into an hours-long dinner and drinks with laughs and memories I will have forever.\n\nThe cocktails are fantastic - amazing sangria and espresso martinis. You should aaaaabsolutely ask about the margarita flights AND the MARGARITA TREE. It’s both beautiful and absolutely worth the price.\n\nThe staff were friendly and so, so accommodating and welcoming. PLEASE go for dinner, drinks, or to celebrate like I did. You will be happy you did!"
        },
        {
            "date": "1주 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psYVNGSk1Xa0ZYTUhWdlEyRmZNbWRHWWt4R09HYxAB",
            "text": "Le restaurant est très bon. La nourriture est délicieuse et le service est gentil. J’aime beaucoup"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Vek9VSjBaVEY1ZUdkUWEyWmZaVkZLWlhscFpYYxAB",
            "text": "Best fish tacos.  Love spicy, and these were hot.  Originally stay way from fried fish, but they nailed it.  Paloma waa delicious!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnd1oxOVFkbmQ2WjFKT2IyUmZTa3QxTTA0MFZIYxAB",
            "text": "Fantastic! excellent service, food delicious, cocktails a must to have. Reasonable price."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGd1dWQlpiazAyUjA5V1VqWXROMnA2Wkdkd1RsRRAB",
            "text": "Love this spot for weekend brunch!\nThe food is consistently delicious and the staff is incredible friendly and attentive. It’s definitely a great place to enjoy a meal.\nOn the weekends they offer a brunch special with all-you-can drink for $29 over 90 minutes, plus the cost of food.\nHighly recommended trying the crispy cauliflower tacos, French toast and tacos al pastor. They are all must haves!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWMFNWTnJPRWhWTmpWak9IbFlTMDVITkhSdlgyYxAB",
            "text": "Great Mexican fusion restaurant.   The ribeye steak fajitas was very well cooked and seasoned.   Food was delivered pretty fast.  Their pork belly will recommend.  Didn't have any reservations thru open table however I saw the restaurant empty and allow us to seat right away on the street table"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NMmFrZFZaV3hYVDBGbGVsRlVkRGhzVmtsRlpuYxAB",
            "text": "Great flavors. Lovely environment."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21neWNubHRiWHBQZWxKdU1WaFZTM1F6UTAxcFJXYxAB",
            "text": "Very attentive and accommodating employees. We arrived early for our reservation, but were quickly seated and our server was phenomenal.\n\nThe food was delicious, the chips, guacamole and salsa sampler was superb. The jalapeño margarita had the perfect level of spice and was a good compliment to the meal."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KNVppMXBNRloxWjJkMVNVNDRjblptVmxWdloyYxAB",
            "text": "Overall food was decent but not outstanding for the price.   Biggest issue is their slow service."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVVlXaHBTbU5ZVkZab0xWODJVMm8yYW14aGFuYxAB",
            "text": "Absolutely amazing.  Wonderful food, service, atmosphere- oh and the food is insanely good!!!!!  Get the cream sauce."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sS2NscEJTV1pJTTJkSFNrRnFZbUZVV2tJMFZVRRAB",
            "text": "Food is great but the kitchen is under staffed. You will wait a lifetime for your food to come out. So don’t come hungry, enjoy like 5 drinks, and hopefully you’ll forget you ordered food cause it takes that long."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFeWVWQlpRVFJHUzBZeWFraHdMVUpYTkdNdGRuYxAB",
            "text": "This is my go to place in NY. Amazing food. Great tequila. Some of the best tacos in NY surely. Love it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTFdIWkRhSFZQTWtaUlNIUmlWRVppUTA1eVFrRRAB",
            "text": "Service is super slow. Food needs salt. Rude vibe from hostess. Server was very nice, but way too overworked and over sat. Would only recommend sitting at the bar if you are on a time crunch. However, The lunch special is a great deal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xemRuTmlWek5OZEVveFZTMUdaVWRaV1ZGemEyYxAB",
            "text": "Great service, great margaritas and lively atmosphere, special thanks to Benny Ramos for making us feel welcome to NYC"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRNExWVTNVbnBvUWpKNVJrdHNaalJUWkdGcU1HYxAB",
            "text": "Best Mexican in the area. Don't miss the lamb tacos and cocktails"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkNk5WVk5Xa3h4YkVOR1UwMTJabUpZVXpZdGExRRAB",
            "text": "good mexican food, had quite alot of gluten free options. didnt like the cocktails so much."
        },
        {
            "date": "1달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOZmVscFVaVGxTVUhCSGFtVjNhMGc0Y21kMWRVRRAB",
            "text": "Ottimo cibo, personale qualificato gentilissimo"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sb1lVb3pVa0ZFVWxKZlptODJUelY1WkVWRVlXYxAB",
            "text": "Love it. The music was great. The food was amazing and the service was awesome. I love it 😍"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wZlRFMUhkM0V3WlhWeVZHbDVkMFF5ZDFSU2JuYxAB",
            "text": "Es un buen lugar para disfrutar algunos sabores mexicanos, su menú varía con las temporadas, lo que lo hace atractivo, sus guacamoles y salsas con chips son deliciosos, el pork belly de esta sede es el mejor; tiene buena variedad de cocteles, el mezcal con jalapeño es muy rico!!!"
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxM2FXUkpaMUo0TjNCc2IyVlpSM1ZuU25kU2EzYxAB",
            "text": "Preso un tris di guacamole da condividere, decisamente molto buona; buoni anche i tacos e le empanadas, discreta la birra. Il servizio è stato troppo veloce, ci è stato servito tutto insieme subun tavolino troppo piccolo per contenere il tutto."
        },
        {
            "date": "2달 전",
            "language": "la",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sVFoxVnpRM2h3TVhNeVFVbEVPVEJHU1ZWQlRGRRAB",
            "text": "Great margaritas"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWSlNFMW5VVVUxZGxaS1N6TjNSRTFIYlRGcE9WRRAB",
            "text": "Añejo NYC is one of my absolute favorite spots in the city. The atmosphere is vibrant and welcoming, the service is outstanding, and the food is incredible. The tacos are full of flavor, the guacamole is fresh and delicious, and the margaritas are some of the best I have ever had. Everything came out quickly, and the staff made sure we were taken care of the entire time. Whether you are here for brunch, dinner, or just drinks with friends, you are guaranteed to have a great time. I cannot wait to come back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVE5HbE5ZVGhLUkVkbWRGRnFYekZMTjJwcFlrRRAB",
            "text": "A little pretentious for the neighborhood and food quality isn't what it once was. Still good but not amazing. There is a lack of balance in the dishes, specifically the ceviche, which hides things behind the avocado and salsa rather than focusing on the octopus."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210bWJGcDZjMVpKWDJWaFNqVm1XSEJvVVhWRGVrRRAB",
            "text": "Appetizer was excellent , also main course."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GclJHWnRjSEF6Ukhwek5XbzNXRkZDVEVaT1VrRRAB",
            "text": "Wonderful place. Awesome food. Enjoyed the cocktails as well. The price is reasonable for Manhattan."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVME5USkhkMnAxTmt0WE4xRnpkemhRTFd4MGRVRRAB",
            "text": "Everything is amazing"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CNVVHZ3pkMVJEYldGcmIwRnZNMFJwWmxoa1oxRRAB",
            "text": "Delicious food & a good variety option for vegetarians.\nStaff were polite and made good suggestions from the menu.\nOutdoor seating is available and pets are allowed which was just perfect."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taTE9XcERTMWt5WkdOS2JFcGFZazlMVG05T00yYxAB",
            "text": "Excelente lugar, la atención del personal insuperable y las recomendaciones de la comida, simplemente ideales, sin duda visita obligada."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsSVdVRjJWV05wWmtnd2MwSnBXVlpRUVY5c1IwRRAB",
            "text": "Comida increíble y servicio excelente. Nos explicaron toda la carta y nos hicieron recomendaciones adaptadas al grupo. Todo buenísimo!! El personal muy servicial y profesional."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0NGVHWjZNSGRTWW5aZlIwRTNSVUZrWkhGQ2JYYxAB",
            "text": "Pork belly tostadas, fried yuca,  beef beria tacos, all excellent. Definitely recommended"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wd1Rta3hWRGhMUW05eE5uRXhhMlpuWHpkVVpXYxAB",
            "text": "Great authentic food and very nice service"
        },
        {
            "date": "3달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CelZGcFFkemRtTW5KUlFXaFFaMGxhVEd4RVVFRRAB",
            "text": "Cuisine excellente et service impeccable."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTmFWTk5WamhYVlc1aVZtMXFRa3gwZWkxVGIyYxAB",
            "text": "Great and friendly service. Good ceviche selection and reasonably priced."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CamJVSTBUMWN0VVV4Q1EydDNSelZKZDJOMFdGRRAB",
            "text": "Delicious margaritas (I had the mezcal), superb guacamole and salsas, the enchiladas Verde were fantastic, but the brussel sprouts were the dinner winner. Fantastic! Eat here anytime you can."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xORVQyRTJPRlpEYmxZeVFVRk5iV3RFUm1kMGFtYxAB",
            "text": "Last night me and my husband went to Añejo. I am going to start by saying that the atmosphere is very nice! Our server Edward was very friendly and attentive. We asked him for some recommendations and everything was spot on. Food was delicious!! My husband had a tequila/mescal old fashioned and it was amazing! The guacamole, ceviche and the Carne Arrachera is to die for.\nDefinitely a place to go back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twME5YVmpNbGhpWkY5VlRXY3laV3RCTVRsWVVtYxAB",
            "text": "Food was really good, the staff did a killer job, and the environment was classicly New York with great people watching.\n\nFirst rate fish tacos!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taV09EQk5jbHBYTm1GM1NFNTFXREJ4UmxNNGVHYxAB",
            "text": "Great place for Mexican cuisine. Had the crispy fish tacos. Nice taste and flavor."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnNFNrNVFVRlk0TkhZM2VISk9RVGwxTm1OWVNFRRAB",
            "text": "Great service, great food and loved the margaritas. I’m very hard to please when it comes to margaritas but they were delicious here, clearly made with fresh squeezed lime and not too sweet. It was LOUD inside, I would recommend some noise-canceling acoustic panels for the ceiling. You never see them and they make a huge difference. Other than that, everything was fantastic and I’d happily come back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SlJuWmlVUzA0U2toVVkwaHdSMVUwWVRSSE0yYxAB",
            "text": "Delicious tacos!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGUFpVaHZTbmxyUkRsblkxRXpSMlJGYXpOMldsRRAB",
            "text": "Took a start for service because the restaurant was empty, yet the hostess decided that the only available seats were at the bar. We spent about 1.5 hrs and by the time we left, the tables were still empty.\n\nBar service was great so boo to the hostess!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sb2REVmtjMDVOZUhWdlZHbFZjVFpaY1Y5UU5GRRAB",
            "text": "I live in the neighborhood and by far the best atmosphere and service you’ll find. Come here if you want a great time and Mexican food!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSVdGWmhNMDFUZVRWd1oydHdOa0pWZWsxellrRRAB",
            "text": "The food is way too expensive for what it is. 3 mediocre tacos for $25 is ridiculous. Service was slow, not particularly attentive, and splitting more than 3 credit cards seems to be a huge inconvenience. If the food was better, you might put up with it, but there is plenty of better Mexican food in HK and NYC."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205VFZrRnhTV3BmU0RWS01sWnBhSE0xVFVWaVUxRRAB",
            "text": "Great spot! Had the lamb barcacoa tacos and Jalapeno margarita, both were delicious."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KWU9XUmhXV2wzZWxGTVQwRktlVVJyV2poM2RVRRAB",
            "text": "Great service and drinks."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFM2MzaHBXVnBhTWxsaFNHUjNNQzF1YWpaRmRuYxAB",
            "text": "Good casual place. Delicious tacos, and awesome drinks. Personally loved the jalapeño margaritas"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrMVEzTnFjREJ6ZW14RlNsSnFhRkl3VTFOMlNsRRAB",
            "text": "The best Mexican food I've ever had. Everything we tried was out of this world. It's a place that wouldn't be what it is if it wasn't for all the noise the guests make. The servers were great; she made sure we were looked after despite it being very busy."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Oa1lrWlpXbFZmT0ZOeVFqaFdVRGgwTVhkb1RFRRAB",
            "text": "What happened with the staff at Añejo HK today, Tuesday?\nThe hostess, runner, and even the chef in charge were exceptionally rude (Damian was off today). As a regular customer, I was denied the opportunity to order a dessert and potentially an espresso martini at the bar. It is concerning that owners would permit employees to deny business in such a manner. I was particularly disappointed because I was eagerly anticipating the delectable flan they serve. Consequently, I am no longer inclined to return. Very sad."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KaWIzbHRWMVo0YVdwUlJUSklTR3c0UWxJeFEwRRAB",
            "text": "Anejo was great for a quick bite after The Daily Show. I had the octopus ceviche. The octopus was tender and the sauce was vibrant and so tasty."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwb3Iza1BBEAE",
            "text": "늦은 점심으로 직원의 친절한 안내덕분에 맛있게 편안하게 먹었습니다"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcnU2Wmp3RRAB",
            "text": "Great spot to swing by for great Mexican food and a margherita. All very delicious.\n\nI think things are a bit pricey (more so food than drinks, which are priced fairly) but it’s a good vibe and attentive staff."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMN1E1YnpkaHIyWk1nEAE",
            "text": "Guacamole was super fresh! Both salsas were delicious. Drinks were great - chicken Al pastor tacos were excellent and so was the carnitas quesadilla! Rice and beans were excellent."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvM0o2Z3l3RRAB",
            "text": "We were at the crosswalk heading to Jolly Goat Coffee mid day when we saw this place and decided why not. They were able to sit us, the service was friendly, the drinks refreshing, and the chips+guac was a favorite. Will be back to explore more of the menu."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2eHE3c19RRRAB",
            "text": "I recently visited a fantastic Mexican restaurant with a warm, inviting atmosphere and excellent service. The staff was attentive and friendly, which really enhanced the experience. I particularly loved the cauliflower taco—flavorful and perfectly seasoned. The shrimp empanadas were another standout, crispy on the outside and deliciously tender inside. However, the octopus was a bit too tough to chew, which was disappointing compared to the other dishes. On the plus side, they have a great happy hour menu with great deals. Overall, it was a lovely dining experience, and I’d definitely return!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPV2E2YVhBbTc2Z1lBEAE",
            "text": "¡Me encanta la comida aquí!\nThe añejo margarita has very fresh juice, half rimmed salt (which pleases me), and dried slice of orange.\nThe birria taco lunch Plato for only $16 is classic with a modern touch.  The micro cilantro greens top a plentiful amount of tender beef that has marinated and cooked in a delicious birria broth, garlic, no onions, but subbed for a fresh slice of cucumber and rábano! Perfectly julienned radishes.\n\nThe side of black beans and rice.  Beans were smoky, a nice touch.  Topped with a Honduran style tomato cream sauce.\n\nSo lovely and I will be back!\n\nThe servers suggested some good mezcals and a Latin dance club for salsa dancing.\nGreat service!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twdVNYSkJSVTgwYUZOZk1uVnNiRGh5WVV3MU5rRRAB",
            "text": "I got the blanco margarita and it was delicious ! We went during happy hour and we order the short rib nacho and it was deli’s! No oucs ! We ate before I remembered ! Would eat there again !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjemJXa3RObEJTWW1Sb1dXczJWbmd6UW5kQldYYxAB",
            "text": "Food was cooked to perfection, drinks were tasteful and well measured… chips with all salsas and gac was yummy…. Our server was a  very nice man"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPZUN0OFdwbXZua1VnEAE",
            "text": "Very good food and tequila. We tried all the tacos we could, pineapple quac, tequila flan. All delicious. We would go here again when we are back in the city."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQeWFUMnh3RRAB",
            "text": "Good spot to grab some Mexican food. The location, the staff, and price are just perfect.  We went by with the family and had a great time. I’ll give this place another shot because of the staff and service! They were amazing.\n\nThe food was a bit shy of what I expected but the drinks were amazing. Both ceviche were lacking the kick but that’s the first time I’ve had ceviche from a Mexican spot so maybe that’s how they do it. Keep up the good work guys!\n\nI love how cozy the venue feels, you can identify where you are just by the design."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyMFpuVGlRRRAB",
            "text": "Got a shrimp taco. That was good.\nThe chicken platter dish was very basic. The rice had less salt, the chicken thigh skin was chewy. The dish overall was very dry with no extra sides given on the table.\nOrdered hot salsa and chips. The salsa was more like an orange hot sauce. The chips tasted stale and were a bit raw and hard.\nOverall wouldn’t recommend the place for food as such."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbkpyVTNRRRAB",
            "text": "Highly recommend making a reservation to secure a table without worry— they get busy. Very delicious dishes, we loved everything we got. Happy hour deal is convenient for tasting a few different things. The presentation of food and atmosphere was great, the waiter from Spain (didn’t catch his name) was very kind but one waitress felt a bit pressuring/rushing. Didn’t bother me too much though, the drinks and food were delicious so I was happy.\nRecommend giving this restaurant a try. Would love to come again :) Happy hour menu attached if that helps."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNucEpqc3VnRRAB",
            "text": "Very delicious, excellent service and unbelievably great food! The cauliflower tacos (recommended by our great server) were a huge flavor surprise, so well done! I cannot wait to return, highly recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUROelB3RRAB",
            "text": "An upscale Mexican dining experience, the food never disappoints— the dishes are always prepared to the utmost perfection— Rice and beans so elegantly served, the tacos are so hard to choose from b/c they are all delicious— and the salad is truly fresh, delectable, and a generous serving size.\nGet three tacos for the best deal— and if you are free between 12-4, the lunch specials come with rice and beans and chips and salsa— which oh!! Btw, the salsa selection a true delight for any palate. You will again find it difficult to choose. They also have a great happy hour menu if you don’t mind sitting at the bar— all the selections at great prices!! This is the best place for a pleasant and delicious dining experience— in a bustling neighborhood in Hell’s Kitchen!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqXzdtOGRBEAE",
            "text": "It’s a nice restaurant that offers inside and outside dining. There’s also an outside patio with warmers as well.\n🦋 make reservations, place was a full house on a Friday night.\n🦋 the red wine sangria was beyond disappointing. It was mostly thick ice and juice. They couldn’t even fill the cup full. Look at the photos.\n🦋 the mushroom quesadilla was my favorite item here. It was thick and filling. Good quality.\n🦋 the fish tacos were very plain. Needed more seasoning &/or love.\n🦋 lastly, we got the the goat cheese guacamole, since it was recommended from the 3 by our waiter. It was so dissatisfying for me. No where in the menu it said there was raisins inside ( I hate raisins). No where in my life (I’ve been to Mexico over 10x , have I experienced such a sad case of guacamole… it was like sauce, very plain, it needed seasoning and spice and definitely some love. ..\n-the nachos though were very good\n🦋 our waiter was very friendly\n\nOverall this is my opinion and my experience"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4ejY2bzNBRRAB",
            "text": "The waitress was really pleasant and accommodating, and the service was quite nice. She gave us a thorough breakdown of the menu and gave us her recommendations. I have to admit that all of her recommendations for food, beverages, and overall quality were well received. The food was also perfectly seasoned. I have no complaints given the pricing. Despite not being a big drinker, I had to get more drinks since they were so excellent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyaXE3RHF3RRAB",
            "text": "Incredible spot for real genuine Mexican food. Everything was freshly cooked and so so tasty. The pork belly was the highlight for us. Absolutely incredible. Staff were also incredibly helpful and efficient. Really really recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCaUpuMXBRRRAB",
            "text": "Went there one of Thursdays for lunch, was empty that was cool.\nThe service was very fast.\nGuacamole was delicious and big portion.\nBurrito was very good.\nAlso quesadilla was good, but a bit too much fried for me. I don’t know the correct way, and I don’t claim that I know how it is supposed to be done, but I prefer when quesadilla is not very fried, without the excess of oil.\nThe overall quality was good and especially loved the presentation of guacamole."
        },
        {
            "date": "2년 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcnNYTGN3EAE",
            "text": "Przez przypadek trafiliśmy tu poszukując meksykańskiej restauracji. Poprosiliśmy kelnerkę aby nam skomponowała zestaw dań do degustacji będących typowymi dla.kuchmi meksykańskiej a.zarazem popisowymi szefa. Było bardzo dobrze.  Deser nie jest chyba typowo meksykanski ale był bardzo ok."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5cDYyN2J3EAE",
            "text": "Made a reservation for a Saturday night early enough that they weren't hopping yet. As the evening progressed it was consistently busy and the vibe was upbeat.  They have liters of margaritas, which our group ordered...more than once. Go ahead, give yourself permission, it's more efficient. Every dish we ordered was well-plated and visually enticing and the flavours did not disappoint! Servers were friendly and we left feeling stuffed because we wanted to try so many of their tasty options! Recommend!"
        },
        {
            "date": "수정일: 11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcjc2WUVnEAE",
            "text": "La carta nos resultó algo compleja de entender, sin embargo la camarera que nos atendió fue muy amable. La comida estaba rica y abundante, quede lleno y satisfecho. Los nacho traían 5 salsas distintas y estaban ricos como aperitivo. Muy recomendable"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMbEo2V2R3EAE",
            "text": "I visited during the happy hour, and the atmosphere was great, with decent drinks. The food was great, but I would highly recommed it if you have friends and family to have fun."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdFpib2RBEAE",
            "text": "Loved it great atmosphere, they where great with my service dog. Loved the skirt steak, my friend J.LO has nachos and some red wine we were happy. I have. Rottweiler Service Paramedic dog. Thomas was our waiter he was amazing so sweet and he loved my dog too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bU1yckJBEAE",
            "text": "Fun spot. We had a reservation and it was busy but felt like we might have been lucky without one. The shrimp tacos were delicious…, very lightly battered and three plump ones in each taco. Chips and guacamole were essential eating and the pitchers of margaritas (plural) went down very well."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dGNTTWdRRRAB",
            "text": "El ambiente es muy bueno, con música a un volumen perfecto para que puedas hablar con tu acompañante. La atención  fue buena y nos ayudaron a decidir que ordenar para comer y la comida es buena.\n\nEl baño si le faltaba como un poco de limpieza u organización."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyOUtTS2p3RRAB",
            "text": "Great Mexican food here and a great lunch menu. The restaurant is beautiful inside and outside. The food was all fresh, cooked properly and flavorful. Would return anytime. Special call out to the chips and salsa— amazing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNDRyU3JBRRAB",
            "text": "Wonderful little spot with affordable delicious small plates during happy hour. When you walk in there is a nice bar and small tables for people to sit. They have a small outdoor patio area that they open on nice days.\n\nWe came as a party of 2 and got the shredded chicken nachos, the guacamole and the empanadas. The guacamole is delicious. They left some whole ingredients on top instead of chopping them up but it worked out nice. The shredded chicken nachos are probably the best thing that we got and were quite delicious I highly recommend them. The empanadas tasted more like a samosa that came with a mint green chutney.\n\nThe happy hour menu also had a lot of drink specials. I would come here again during happy hour."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvajVuMDV3RRAB",
            "text": "We had an amazing new York brunch experience , last Sunday at this place in Hells Kitchen area. It's a full sit down brunch , course by course with bottomless sangria-margarita-bloody mary & mimosa for 120 mins. The waitress was super…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMHVqVkdnEAE",
            "text": "I ordered the pan seared salmon a la Ueracruzana ($26), it was cooked to medium rare as I asked. It had little flavor and caused mild stomach pain that lasted a few hours. The waiter was very attentive and concerned about my dining needs."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUZ3VfeWRnEAE",
            "text": "Excellent food, very tasty, well presented and well proportioned. Friendly and prompt service. The place was a bit loud, noisy inside from all the people but all in all a great dinner."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrejYtdENnEAE",
            "text": "Absolutely delicious food and perfectly crafted drinks. Staff are friendly and have a sense of humor. Great for brunch on the weekends around 11:30 am"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbUp5aGhnRRAB",
            "text": "Went with a friend. Had their guac / salsas + tuna ceviche + 3 birria tacos. Small portions. Our bill came up to $104 including an 18% tip. Sorry but I’ve had better for much less. Also their “nada margarita” is just lemon with water and they want to charge 14 bucks for it 😂 be serious."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyX2FxMEt3EAE",
            "text": "The food is wonderful...... but the drinks SUCK big time. The margaritas were like lemonade with a splash of tequila. The soda was as flat as my a**...... I just stayed with the water.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbE9uWEZ3EAE",
            "text": "One of my favorite places to grab a pre-theater sit down meal. The drinks are solid. The food is delicious. The service is attentive. I especially love the flan - easily the best I've ever had. That cotija cheese on top is perfection. Even my usual travel friend, who doesn't like flan, liked this one."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREajVPbkh3EAE",
            "text": "Limited menu but pretty good and affordable! Ordered the spicy pineapple guacamole, chicken pastor tacos and cord which was all delicious!\n\nWas excited to try the shrimp ceviche, especially because the host recommended it, but wasn’t a huge fan of the coconut based sauce it came with. Wouldn’t order it again.\n\nLove the vibes of the place though, would definitely come back for the happy hour!"
        }
    ],
    "reviews_count": 85
}