{
    "name": "Miss Nellie's",
    "place_id": "ChIJnxEXkVNYwokRITzoANd2S14",
    "grid": "MN4",
    "address": "321 W 44th St, New York, NY 10036, USA",
    "rating": 4.7,
    "user_ratings_total": 465,
    "phone_number": "(646) 360-3012",
    "reviews": [
        {
            "date": "13시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFMVFYcHlkRXhqVHpsSVEzUXRabXB2T0ZveFNuYxAB",
            "text": "I came here just for drinks. The prices are a bit on the higher side, but the seating by the windows overlooking the street feels very cozy."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZNGJtRnRSekZUWkdKNVNqY3plbmx2WVZjNFVtYxAB",
            "text": "Solid brunch spot"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201dFp6ZHFibk4zTkRseWNVbDVkazB3YjFkek5WRRAB",
            "text": "Food and cocktails on point, went for a dinner but also paid for tickets for an event. On the event side — the worst Dj :( and an uninspired “ well “ menu of drinks at an event I paid for a ticket\ncome here for dinner but avoid the events I wish I could get a refund we left after the 10th song from before 2010 it was really bad"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0c01URklUVTVOZGs5S05IWnZkWFUyVFcxcFpHYxAB",
            "text": "This place is incredibly fun. Halloween decorations were top notch! 👻🎃 so was the service and the food!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaMWJUaFVjSEpYWWpWRVRVWTBjSEYzWjNkWlMxRRAB",
            "text": "Such a great vibe in here! Food is consistently delicious, drinks are creative and good and they don't bang you over the head with prices. The wait staff is over the top attentive! Less than two blocks from Times Square, it has become my go to for before or after theater spot. The French Dip is AMAZING!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkMGNUUTJRblJuTFRoRGVFTlRhRzlYWDNobFNrRRAB",
            "text": "Great vibes and yummy food! Celia was outstanding and took excellent care of us!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25weGFtNXhUMlZ2VlUwMVpIbFROVk42ZGtOVGNIYxAB",
            "text": "This place is amazing. I had the best brunch of my life here. The food was so amazing it genuinely left me speechless. The vibe in there was so cool, so much to look out and the photo booth is a great touch. The staff was also so sweet especially the bartenders. I highly recommend the eggs ranchero"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTVMwbGhSRFJZVW00NVFYQXpRMGhpVkRkWFNYYxAB",
            "text": "Didn’t have food, but definitely a cool place. Will definitely be back 🙏"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abWVWUm1jMHBrTlhkalQwaDJZMFp2VEdGWE1HYxAB",
            "text": "Recommend by another bar!\nReally loved the experience here! The drinks were phenomenal and mozzarella sticks are a must try!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5MFYxaHBNMnRFYUZaMVRVUmhRemxTVEVOak5rRRAB",
            "text": "Came here for brunch as a walk-in. Had the Mc Nellie's B.E.C.- bacon, egg, hash brown, and cheese with sauce on a toasted English muffin - absolutely delicious! The combination was perfectly balanced and the sauce gave it an amazing flavor. The ambiance is unique and charming, a cozy spot that feels both casual and special. The service was great, everyone was friendly and attentive. Definitely want to come back and try dinner next time!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWRlZuWXRTVXBFTkRnNGNXRTVhR2hJWTJSaGRHYxAB",
            "text": "It was great! Great food, service, shoutout to Astrid, she was our server and was amazing and made my moms 70th birthday so special!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KS1MwTTRVVlpDVTFwcmVITjJlRk40ZGpOSE9IYxAB",
            "text": "It was a very nice dinner with great food and ambience. My only complaint is that I had noted in our reservation it was my boyfriend and I's anniversary. It was never acknowledged. I wouldn't have cared as much but a table was sat right next to us and was also celebrating their anniversary and they were greeted with a congratulations and a complimentary drink."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wWFp6WkdWVEJOVVZwbk9GRnZaMDk2Y2tsdmNsRRAB",
            "text": "Atmosphere was 10/10, Halloween decor was cute. Service was great, food & drinks came out fast. My only complaint is that the filthy one & dirty dill Martini were extremely sweet.. almost like they had the same mix with different garnishes. I would come back again but get a different drink. Smash burger was so good but apps and pasta were mediocre."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oUFQzZ3hVVk5XTFhwbFJtVnNiRU5CTW1scmFIYxAB",
            "text": "The Irish girl Caelinn made my night so special, so warm and welcoming ☺️"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSQlNqSkdaV0Z0U25KelIyVjBOVzVmWm5kVVIwRRAB",
            "text": "Great atmosphere and drinks were 10/10! Caelinn was amazing, will definitely be back!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOQ09TMXRPVk15UnpoTlkzRXRSVTFSYkU1T1puYxAB",
            "text": "Great spot for a business lunch.  Good specials , lightning and atmosphere."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjeVZtNWhXRGhwZFhkbFRtSlhTa3RGUVdSMk1FRRAB",
            "text": "Got food poisoning from the egg brunch dish"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoTU9URXhMV0ZUYWkwM1lVWmZNVVZGUTBGWk5rRRAB",
            "text": "Great drinks!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMGVGaGxNM1YzZFZkWE9YVkNZMVZKU0ZoUk9YYxAB",
            "text": "Came here for the anniversary event which included a free drink. Full bar, huge space with a room that also included a bar by the entrance. Very mature looking.\n\nThe bartender Sarcha was nice and polite. I had the Negroni which was ok but I can tell it's me of a gentleman's drink. I order the spicy boneless chicken bites which was good but not spicy. I loved the cute envelope that is given with the bill and the uniforms are different.\n\nIt was a good experience and I works definitely go again and recommended for after work."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KS2RuWjFMV1ZLY2xJdE5EZHRXRkZoUlhsWU9IYxAB",
            "text": "So originally made a reservation for 6 people at 6pm. Wanted to change it to 5pm so I called the restaurant.  I was assured it was changed\nSo I arrive at the restaurant to find out that it want changed. I was told I had to wait till 6pm. There were still people at the table\nSo we went to the bar had a drink (money I didn’t have to spend if I didn’t have to wait)\nSo it’s now after six and I have to ask the girl what is going on with our table.  Was  told the people at the table I guess didn’t want to leave and were being rude about it.\nSo the girl then decided to make a table for us in the bar area.  Now that was ok but the fact that they could have done that when we arrived instead of making us wait an hour is unacceptable especially since we had to spend the additional money at the bar due to your error\nCan’t say I will be returning or recommending\nIt was my first time there and I was celebrating my daughters 40th birthday"
        },
        {
            "date": "2주 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vMU5tUkxRV1JTYmtsYVVTMHpka3d6WDJFMlNuYxAB",
            "text": "Wir waren zum Dinner hier. Wir hatten vorab online bestellt und u.a. Steak und Burger gegessen. Das Essen war sehr lecker, es war lediglich sehr laut im Restaurant.\n\nSchade, dass an diesem Tag die Zapfanlage defekt war."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wNmJuRm1kbWhhVlZCQ2FqSk1TakF6V0RsYVNtYxAB",
            "text": "Simply put, this was some of the worst service I’ve ever had. And to top it all off the food was bad. No one at my table liked their food. I don’t understand how this place is rated so highly."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWQ2NsaFFXbDlSUWkxRlRuTldOVkowVWt0dVdrRRAB",
            "text": "Great vibes and a surprisingly good burger. Noah A was wonderful!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOS1dGaFZaRmxpV1ZnMmFWQmxSbkpWWlMxclJsRRAB",
            "text": "Francesco at the bar was one of a kind! Our party of 4 from Texas enjoyed getting to know him and he worked so hard in trying to perfect his craft! The vibe was awesome at Miss Nellie’s. We highly recommend! We only went for drinks so we can’t speak on the food."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psdFNqQm5aVmgxVm04eFlVNDFiMU5MY1U1U01YYxAB",
            "text": "Was very excited to eat here after NYCC, but the service was by far the worst we have experienced. We had reservations at 6pm and no one came to take our order or check on us until I got up to let them know we’d been waiting for 20 minutes. The two tables next to us ordered after us and they got their food and drinks before us. Didn’t get our food until 6:41pm and only to realize that our server never brought us our drinks. We only saw our server when they took the order and when we let him know that we didn’t get our drinks. Someone else took over and brought us our iced teas after we had finished our meals. We should’ve just left when we saw the mouse in the waiting room."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psRGVtbFFNMUZ2UmxWR2VWVTJObFo0VUdOdWJrRRAB",
            "text": "Absolutely amazing food and service. A big thanks to Carleigh!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0cWJ5MUxkelI2WTI5UlJEUlJWMHROZDBGR1psRRAB",
            "text": "Love this little place in the heart of the theatre district. Had brunch, and it was very good.  Server was friendly and attentive. Gotta love all the $10 taspestries on the walls and ceilings.  It gives the place a cozy warm feel to it.  Not only are they colorful, but they attnuate sound so you can actually hear the person across the table from you - a rarity in busy restaurants."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxRWJWbHFjR3hmYWxSWVNIZFpiRXhMTUVoaFZHYxAB",
            "text": "My husband and I were in town close by and fancied some food and drinks.  We came across miss Nellie's and what a treat it was.  The fabulous bartender Megan looked after us the remainder of the evening and recommended the Hugo Spritz which was delish. This is definitely my new favourite drink. We also got a lobster roll and smash burger. Yum!. Thank you Megan for being a wonderful host and we will certainly be back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaT2FucHJWRlJxVVhkMFRXc3lTRWhGVTFCbkxVRRAB",
            "text": "This is a cute bar near the theater district. We stopped in for a drink and the bartender Saoirse helped us pick out some cocktails we really liked.\n\nWe will be back again!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGaGIwaG5NMGxRU1RKQ01tMUtTMHM0WlRaVFptYxAB",
            "text": "Very eclectic decor restaurant/bar. The food was excellent, the staff very welcoming. A good menu variety.  You will not be disappointed!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjMWRYVmZjVFJGYms1UlRtRmhTbVkyZUdSMFVsRRAB",
            "text": "The smash burger was amazing! Drinks were great, and we loved the atmosphere. Would totally visit again someday."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kclYxVmFaSEpxWkd0cVRWRk1iM1pwT0RSS1ltYxAB",
            "text": "Went here before seeing a show. The vibes are perfect for a pre-show bite. Everything on the menu is delicious. Our server Saoirse (hope I’m spelling that right) was amazing and got us to our curtain with plenty of time. Will definitely be visiting again."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWbmMybFJXWE42WTBwRldIZDJWVGxEVG5CWlNIYxAB",
            "text": "Absolutely loved Miss Nellie’s. It was cozy, stylish, and full of character. The cocktails were creative, and Saoirse behind the bar made the whole night by being warm, funny, and clearly knowing her craft. She went out of her way to make great recommendations and made us feel totally at home. Easily one of the best bar experiences I’ve had in the city."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNNWEyd3liSGhOWkRWMU5HMXdaRGhOYkRCVWRVRRAB",
            "text": "Miss Nellie's is great, perfect location for the theater district for before or after a show. And Saoirse was wonderful!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkTVkxUkZNRWd3YVUxb1ExSlpWbWRHZDJSdGVsRRAB",
            "text": "Haven't had their food (yet), but their drinks and vibes are on point. Was served by Saoirse when I went in, and her service was stellar; great conversationalist, makes a mean drink. Highly recommend this spot"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0MWRYUmpUR3hmVUhrME1rVnVkMUJJUkdSU1JuYxAB",
            "text": "We began our Saturday night at Miss Nellie's- and it set an amazing tone for the rest of the evening! Our bartender was AMAZING and so helpful! She made us delicious cocktails, and helped point us in the right direction for the perfect night in the city. For the best food, drinks, scenery, and STAFF, make sure you pay this gem a visit."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkcVJFTkRTMlI1VEdkTVNGRjVjbVkzYzB0elkzYxAB",
            "text": "Visited miss nellies on our anniversary trip to New York with my husband. We stopped off after some exploration and it was a great night, thanks to Megan and the service and food and drinks recommendations. The Irish espresso  and an old timer was the stand out on the drinks side and the fish was a great choice. I would highly recommend nellies to friends if travelling to New York, ask for Megan if she is working"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GSE1tWnhOakpDTWs1T09HZzFaa05VYUVSM1dXYxAB",
            "text": "Noah was amazing!! Loved our visit, super attentive service and the drinks selection was perfect for what we were looking for. Will 100% be back!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWWJHRlNUMDh4TVZSSmFESm5kemd5UTA1SGNVRRAB",
            "text": "Megan made me a fantastic martini. The experience was in a sense, life changing. I will definitely be back."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KNE0yTk1SWGd3TW1SWVRVZEVkRTAwUmtaRmIxRRAB",
            "text": "Miss Nellie’s is the best! One of my go to post show spots as a fellow worker. The late night happy hour deals are so great, as is the food. The service is also top notch. Saoirse took great care of us!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJeGJVczRkbVE1UlZKRVZUVnpTMWcyTVRWd1RXYxAB",
            "text": "Perfect place to have dinner and drinks before the show."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOTE9WOXFlamN6WW1GMGVsSjJXVEJPUm5kYVZVRRAB",
            "text": "Sam was a wonderful waitress! The whole experience was awesome. The atmosphere was adorable and the food was so tasty. The drinks were also so fun!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210alJUazJURkIxUzJ0U2FXaHNOM1IyY2taWWVVRRAB",
            "text": "Alright, had a cocktail that was smoked and served in a box. That was a pretty cool experience, and the spicy chicken nuggets were killer. The bartender, Saoirse was killer, even though apparently she’s brand new. Will definitely be coming back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201QlNITXRhWGxXUW5GSGJFRm1WWHB5YzFNM1FrRRAB",
            "text": "Had a great time at happy hour. Loved the atmosphere and the bar tender, Saoirse, was delightful with great recommendations on all their specialty cocktails. Definitely a new favorite spot!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sVGVFVTFiVzB6UmsxWmIwbDBNVTAzWDFodE1YYxAB",
            "text": "This place is fabulous. Very cool vibe and atmosphere. Our waiter, Noah A was awesome! We did miss the Brussels sprouts and Mac and cheese!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxQllrRnZRVXN3V0hCelNrcG9jMUZXYWsxMVZYYxAB",
            "text": "My husband and I visited Miss Nellie’s before seeing a show on Broadway and we were blown away! Our server Noah was wonderful! Noah was incredibly kind and attentive, the food was excellent, and the moody ambiance was amazing! We also thought the photobooth/photo prints were a nice touch and a nice souvenir from our visit. We will definitely be returning and will be recommending this spot to friends visiting the city!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkb2NVVlBjREU1U1dkUmVubEdWQzB6VmxNMWNVRRAB",
            "text": "My wife and I visited Miss Nellie’s before seeing a show on Broadway and we loved it! Noah was a fantastic server and very insightful about the menu. The ambiance was also 10/10."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1eWNHVXpibmREU1RaUVlYVnBSR2xzVldwYWNYYxAB",
            "text": "Service was great my bartender Megan was Amazing! She worked with my dietary needs and served amazing mocktails both on the menu and by her own design!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tReFpFaGZOVTVITTNGSGNuUk1iMU5yU0dKd1ozYxAB",
            "text": "Noah was a fabulous server !! We had such an amazing experience here ! We will be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkS2JuWktWRXBtVG5FNVdEbFBhREZKWkVWeGFrRRAB",
            "text": "Noah was a great waiter!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNeGVtWjRRWGd6UldwUFNXNTVja3hWWHpJM1RrRRAB",
            "text": "This place is so cute! I had seen it on Instagram during my last NYC trip but the reviews were mixed and we weren’t staying within walking distance so we ended up going somewhere else. However, on our recent weekend trip this was nearby and my husband and I thought it looked cool so we decided to try it—and I’m so happy we did! While the decor was totally up my alley and I loved the aesthetic, the food was good as well! We enjoyed the fluffy bee pollen pancakes and the smash burgers (we could’ve probably just shared one since we didn’t finish them). Our drinks were also just as tasty as they were aesthetically pleasing. The staff was also warm, welcoming, and helpful — from our hostess, to our servers, and even the table runner who brought me more ketchup. I would definitely come back or recommend this spot to anyone on the fence!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZeVMyVkhiSGsyVGxrM1lsSjVWVTQxYmpKRWJIYxAB",
            "text": "Miss Nellie’s in New York is an absolute gem! The Mediterranean platter was fresh, vibrant, and full of flavor—every bite felt like a trip across the Mediterranean. The chicken parm meatballs were out of this world: tender, cheesy, and perfectly sauced, easily one of the best bites I’ve had in the city.\n\nOn top of the food, the service made the experience unforgettable. Our server, Noah, went above and beyond—attentive, friendly, and genuinely passionate about the menu. He made us feel completely taken care of and added a warm, personal touch to the night.\n\nI can’t recommend Miss Nellie’s enough—delicious food, amazing atmosphere, and top-notch service. Already looking forward to my next visit!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aV2FsQnNYMGh0VjNGWGJIYzJaMHRIVXpCQ1YyYxAB",
            "text": "Stopped into Miss Nellie’s for brunch before a show this weekend, and I’m so glad that I did. This was such a cute spot, particularly for a history buff like myself. I sat at the bar and tried a few of their specialty martinis, all of which were SO tasty! The bartender was very helpful and making recommendations. I ended up going with the BEC for food, and I was not disappointed. Everything was delicious, and the service was spectacular. This is definitely a treat!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKekdySVBBbTV1MEdREAE",
            "text": "We thought that atmosphere was really nice and the service was friendly. It has a unique interior and the bathroom is quite pretty. The food was tasty but overpriced for the portion size. We asked for an alternative replacement for the french fries for the spicy chicken sandwich, the server said we can replace with a salad, but it turns out that we were charged an extra $3 for it. That was definitely not worth it and I would not have agreed to that. The drinks sounded exciting but was lacking in flavor and kick."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGaVdHaEhYM0pSZEhoS1RVUmFPRXd4VjA5SVNYYxAB",
            "text": "First impression was wow. Very nice decor and lovely atmosphere. It has a speakeasy vibe. Servers are attentive. Food is ok. I thought some are a bit salty like the eggplant chips and the calamari. I expected the lobster rolls to have more actual chunks of lobster for what you’re paying for. The mayo was overpowering. They have unusual cocktails but since they have a full bar, I’m sure they can make the classics."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4RGQzUXRjM2huWW01bVlWaGhOa05RU0d4WFUxRRAB",
            "text": "I really wanted to like this restaurant more. The service was great. The ambiance was fantastic. But when my $28 Fish n Chips order arrived, I knew I wouldn’t be coming back anytime soon, which is a shame since I live in the neighborhood. What did I get for nearly $30? Four pieces of chicken nugget-sized pieces of overcooked fish on a bed of fast food-level French fries. In London, one of the most expensive cities in the world, you’d get a huge portion of fried cod 5x the size for the same cost. Disappointing.\n\nThe sticky toffee pudding however, was fantastic. I may come back just for that and order at the bar."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxc05XMXZOM2hHV1RCMU56UlJlalJQZG1kU1NGRRAB",
            "text": "I wanted to love this place and was so excited to come here. The photos of the interior vibe looked amazing as did the food. And I will say both of those delivered. We ordered a short stack of the bee pollen pancakes to share and it was delicious albeit VERY sweet and I am a sweets lover. My friend took a few bites and had to tap out because it was just too sweet for her.  She ordered the tuna crispy rice and I ordered the shaved brussel salad with chicken. Service is where things fell short. Our server was kind, but either due to her forgetting or the kitchen blundering the order, our food was brought out and my salad was missing chicken. When the runner came over with the food I asked where the chicken was and said I ordered chicken. He first told me no which sort of took me aback and then he said he would find our server. Even then I wasn’t too worried or even disappointed, I know things happen. Our server came to the table and apologized and assured us that the chicken would be out in three minutes. The chicken took over ten minutes, probably just shy of fifteen. I didn’t want my friend’s meal to get cold so I encouraged her to eat and she was done eating by the time my chicken had arrived. I also was hungry so I began eating the salad without any protein and was halfway done with it when the chicken finally arrived. On top of it, the eight dollar chicken portion was so incredibly small. At that point I was hungry and frustrated and wanted to get on with our day. The food was good but I’m not sure its good enough to return even for a cool interior if the service is lacking."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGb2EyTmhkRkV4UzBkc1QzUldkRjlwVGxWdU1sRRAB",
            "text": "Miss Nellie’s is a must! Such a hidden gem in the city, easily the best experience on our trip. We ordered  The Mediterranean platter which was a great portion,  and chicken parm meatballs were incredible. Huge shoutout to our server Noah— absolute slay.\nAlso found out that there are several restaurants across the city by the same owners. Wish we had time to visit them all! Will recommend this to all our friends.\nOne thing I recommend is bring a sweater, was a bit chilly."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ONlJuSldjVmRuT0ZZeFNrbFRjSGhOVTBoNFkzYxAB",
            "text": "The drinks and our server were definitely the highlight of this meal!! For drinks we got the Caribbean Cowboy, the Appletini, and the Silent Film Star. The mozz sticks were amazing and my husband loved his roast chicken. I had the ravioli and it was good just a little too oily for me. I wish I could remember our server’s name because she was great. We will definitely come back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nM1JXOVZiRGhpTVZGS1NDMVRka1JFUmw5YVMyYxAB",
            "text": "Love the interior decoration. It is so unique and exquisite. Great for special occasions, date nights and friends gatherings.\n\nWe enjoyed all the food we ordered .\nSpaghetti was delicious so was the brisket burger.\nThe Brussel sprout was tasty.\nBarata and beats appetizer was refreshing and delicious.\nCocktails were carefully crafted and tasted delightful.\n\nService was attentive, staff were very friendly.\nPricing was reasonable given the area the restaurant is in.\n\nDefinitely a fun place to check out. Do recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLTHA0S25laHBXNWNnEAE",
            "text": "Rarely you can find a restaurant with everything all good around.  The deco was stunning. Very attentive service and the food was superb.\n\nWe had the ribeye Benny, turkey sandwich, and a small size pancake.  Everything was great, but  the pancake was awesome. It was super fluffy and the butter itself was a perfect match."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGeWQxQjNja3MzTlVaWlZGSnpNVGRZWWpacVQzYxAB",
            "text": "This place has a really cool vibe. A non touristy place right in the middle of Times Square. Really cool art and decoration. However, the painting of the woman in the all-gender bathroom was disturbing to me. And I like a lot of different kinds of art. However, I wasn't expecting to see a velvet painting of a bound and nude indigenous woman with tears in her eyes..\n\nIf you order anything I would suggest the pancakes. They're amongst the best I've ever had! Seriously. I'm not exaggerating! However, one of the people in my party was disappointed with her order of chicken and waffles. It was listed as hot and spicy but really wasn't at all. Her order was comped and the waitress handled it really well so I appreciated that.\n\nThe shared apps that I tried were mostly OK. Try the potato skins. They're quite good! You can get the bacon on the side so non pork eaters can have them while pork eaters can add it themselves. The banana bread wasn't anything to write home about plus the portions were not quite large enough to be considered a shared app.\n\nAnd they give out green tea shots when you close out the check. If you're not a drinker, make sure you tell them to decline this. I wasn't expecting that. They had the right amount of sweet and sour. No green tea in them though 😂\n\nAll in all problematic art aside I  recommend Ms. Nellie's for a good brunch place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOR04wSXdNMVV3YjNaZldGbFdOREZVVERSNldHYxAB",
            "text": "I love the nice design and is really comfortable chairs. The food was amazing and the lobster rolls with chips were very  delicious a must try. Then I have the crab balls which it was good. The star of the show was the mac and cheese. The mac and cheese it is definitely a must try. It's cheesy and it has an Italian flavor which made it so much delicious. Definitely one of the best mac and cheese I have ever tried. The staff was really nice and welcoming. Thank you"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJd2NtWlNWVWxhWWxkWmVUWlVWRjh3WjJ3eGMwRRAB",
            "text": "Miss Nellie’s is a hit! A friend and I had reservations before a show. Our train was delayed and we were running late. We called the restaurant to notify them and they pushed back our reservation time no problem which was so nice! When we got there we got seated quickly. Our food and drinks came so fast! Our waiter was friendly and attentive. The food was also delicious and were great portions for the price! Plus the whole ambiance of the place is so cool! Its dim lighting and eclectic decorations creates such a fun, funky vibe. It is a perfect place to go for dinner before a show!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkSlpXUllSakJvYnpkRVNXRjFWM1pGT0RjM2FrRRAB",
            "text": "I had a pre-Broadway dinner with some friends. The restaurant's ambiance was elegant and warm.  The service was accommodating, and the food was delicious.  The Dubai chocolate cake was one of the most delicious cakes I have tasted.  A slice of cake was enough to share with three friends, so just be warned."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KSU5GY3hlRzlIZDJWa05IWndSMjVIZWxkSGJWRRAB",
            "text": "This place is great!!! Stopped by for dinner before a show and everything was phenomenal! The food comes extremely fast and is delicious. Our server Dakota was awesome and super helpful. The ambiance and decorations are phenomenal. Highly recommend this place!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSVmVrRkxPRGhpWldGMmVIbE5XRkpqTjNkM1RHYxAB",
            "text": "A fabulous place to visit for Happy Hour before heading to the theatre.  Eclectic atmosphere with fun antique furnishings. Food is tasty and perfect to share. I was 'surprised' with a Hot S'mores Birthday 🎂 teaser-- sweet and tasty."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twd1NFbG1Na1ZaVlhNMVZFSlplR0pUUjJkeE5tYxAB",
            "text": "What a perfect spot before seeing a broadway show! Loved the atmosphere and the drinks but our impeccable server Dakota was the star and why we will return! In fact, after our show, we came back for post drinks in Dakota’s section again! Such a great spot and will definitely be back again. Ask for Dakota for star treatment!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGT1FrMUVkVGxyYlZWMWRrcDBTSFl5Ymw5cVJuYxAB",
            "text": "Our recent Sunday brunch with colleagues proved to be a delightful experience. The aesthetic ambiance was particularly noteworthy, and our server provided attentive and personable service. The culinary offerings were well-received, resulting in complete satisfaction for all attendees. We anticipate returning in the future."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psQllsUXdhVE5sWXpOTFV6Sm5iekp3YVhoRE1IYxAB",
            "text": "Miss Nellie’s 🛩️🛶\n- I got a smash burger double patty, it was really juicy\n- plus got warmed banana bread which tasted great\n- and got chicken and waffles which was really yummy\n- love how there are different themes inside to match miss nellie\n- great service and so many decorations inside"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPSDNrTy0wbFBXY2N3EAE",
            "text": "Miss Nellie’s is that *perfect* neighborhood spot—warm, welcoming, and packed with charm. The staff treats you like family, the cocktails are dangerously delicious, and the vibe? Pure coziness. Whether it’s brunch with friends or a low-key date night, this place just *gets it.* Also, shoutout to the killer playlist—always setting the mood right."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bHBXVlhREAE",
            "text": "We had the best time at Miss Nellie’s in March! We sat at the bar and the service was awesome. Carter, Sasha, and Shain were all lovely. Their dill cocktail was life changing and the espresso martinis were divine! The food was very good.\nWe also really enjoyed the Photo Booth in the restaurant! Overall great atmosphere, food, drinks, and people. Will definitely be a repeat when we’re in NYC!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SGVtaDNWVXN6TUZkNVUzTTFXbEpXUW1wbU1YYxAB",
            "text": "We got the pancakes, spicy chicken sandwich and the chicken bites. The pancakes were very good, we enjoyed them. But the sandwich and the bites were disappointing and we had to send it back. The chicken was very dry and felt like it had just been defrosted from the freezer. Although the ambience was incredible, food was subpar"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbU0zT2p3RRAB",
            "text": "The hostess was very friendly and sweet. The restaurant is gorgeous and so unique. They didn’t have enough servers and we were ignored for most of our meal.\nWe tried five dishes. The potato skin appetizer was dry and needed more zing. The pancakes were dry, not warm,  and served with a small tablespoon of syrup with an up charge for any more than the small ramekin. The ribeye Benedict was okay (the steak was stringy) and the French fries were great. The chicken parm was good enough but nothing spectacular. The daily special of the huevos Rancheros with steak and guacamole was the only dish that was truly excellent."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KcGFrMUZNRU5RWDJST2NTMXpiMjB4TkVaemJGRRAB",
            "text": "Brunch at Miss Nellie’s was amazing! The warm banana bread melts in your mouth and the butter that comes with it is to die for! Our server Noah was so kind and approachable. Definitely will be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNzhTMjVRRRAB",
            "text": "Miss Nellie’s has fully transformed the space—every inch redecorated, leaving no trace of the former Peachy Keen. The vibe is cheeky Victorian with tons of visual details to take in. I went for brunch, and the menu features typical NYC brunch fare. Portions are generous, and I really enjoyed the strawberry mocktail. It’s a promising spot with a fun atmosphere, but not sure if they will survive NYC’s competitive dining landscape."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPdlhrOWlObWVlM2VREAE",
            "text": "Glad I stumbled upon this place! It’s lovely! The pancakes were so yummy and fluffy!!! And I loved the bacon. They had a different take one deviled eggs, which I wasn’t a fan of. But the staff were so accommodating. They even removed it from my bill. I will definitely be back, because there are many other things I’d like to try. I sat at the bar, and the bartender was such a sweetheart. I’m so mad I can’t remember her name. I wanna say Sasha! I’ll be back to see her!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KekxVVklRV3cxYW1SMlFUVTJlV2w2TjAwelluYxAB",
            "text": "Came with my husband for a quick bite and a drink after the show and We ended up having such a great time . Drinks were exceptional , I couldn’t decide what to get , Bartender suggested a cocktail called ‘Traveling light ‘ that instantly fall in love with. Sasha was warm, extremely knowledgeable and clearly loves what she does.always nice to be around that kind of energy . We will definitely be back next time we are in New York !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOeGFERXRNM0ZLTm14NWJEUnhWSHBCVm5oS0xVRRAB",
            "text": "What a dinner experience! That eggplant was the best I’ve ever had in a restaurant, lobster rolls? FIRE. I’d go on, but it was everything we ordered. Thank you to Dakota for taking excellent care of us!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQcUVnNEhneGR6RWx3RRAB",
            "text": "Stopped by 11ish on a Sunday for Happy Hour with a group of 5. From the moment I stepped in, I loved the ambiance and vibe. Our group was greeted by the bartender, Francesco, who was not only warm & friendly, but made a top-tier Expresso Martini for me. 5/5 across the board. I’m not a local, but plan to come back!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOM2R5MHRYMDVMUVdaWlp6Um5ha2wxYWpJMGJGRRAB",
            "text": "We had a wonderful after our show on Broadway. I was deliberately trying to find a place that did not feel touristy. This place was hip, charming and delicious. Our server, Dakota was wonderful."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nd1QxbEVkbGQzYkVscmRGZDZkek0xTXpaZk1rRRAB",
            "text": "Amazing lunch experience before a show! Megan S. was a fantastic bartender—attentive, friendly, and made us feel welcome. The Dirty Dill Martini and Irish Espresso were delicious, the fish and chips were crispy with great sauces, and my wife's smash burger was the best we've ever had. Highly recommend for great food and excellent service! Huge thanks to Megan for making our visit so memorable!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnM1A3VExnEAE",
            "text": "I was really impressed by the decor and the overall vibe. It’s such a beautiful and well-thought-out space. The staff was incredibly warm and kind. Special shoutout to our waitress, Sam, who was very helpful and polite. Also, a big thank you to the hostess and manager for greeting us so nicely and even gifting us a lovely chocolate box for our Valentine’s Day dinner.\n\nFrom the ambiance to the food, everything was top-notch. The dishes were flavorful and reasonably priced and the drinks were just as amazing. I’ll definitely be coming back and bringing friends for dinner!\n\nMy only suggestion would be to expand the menu a bit, having a few more food options and more than just three desserts would be great. But other than that, everything was impeccable and totally Instagrammable. Every single detail in that place is worth a picture!\n\nOne small note: the address on Google and Instagram should be updated to 325 instead of 321 to avoid any confusion.\n\nWishing you all much success and I can’t wait to visit again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RNVZYTmxXVTFqV1ZoSmJHVjNTMUJJTWsxM1VHYxAB",
            "text": "Had brunch at Miss Nellie’s with four friends and we loved it! The food and cocktails were excellent (highly recommend the Chicken & Waffles and Scuba Diver), and the atmosphere was perfect for a group. Our server Emma was exceptional. She was friendly, attentive, and made the experience even better. I’m counting down the days until I can make it back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZLXFhMVl3EAE",
            "text": "Awesome decor, really cool theme. Very inviting and homey atmosphere. The food was just ok, the smashed burger was the best out of what we tried, crab arancini really didn't have much of a crab taste, and brussel sprouts were burnt to a charcoal color and taste."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTVozQllTRzVCUzJsMWExSlJaV3BmTkhKNFNrRRAB",
            "text": "I came to miss nellies with my partner for his birthday and the treatment was wonderful. The lovely man at the host stand handed him a birthday card upon arrival which was a lovely touch. Our Irish waitress Tove then brought a delicious s’mores dessert with a candle and some birthday green tea shots, which we had never tried before but were great! We had a brilliant time and the lobster rolls were outstanding."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GclRFdGxUMEZmZEdsdlNWQjVSa1V6Y0U5dVJVRRAB",
            "text": "We came for brunch at Nellie’s before the matinee show of Hamilton. Noah, our waiter, was super attentive, kinda, and so funny. He made sure we were well cared for, that our orders were fully correct and even insisted that he have the kitchen fix my smash burger (asked for no cheese but got a cheeseburger) after I told him it was okay! The drinks were delicious and the food even better. The atmosphere is incredible, the decor, and the lovely Photo Booth! Def stop by on your way to a Broadway show."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNeWEzZ3hVR1UxYUZCbmRYRnFOSGxNTTFSb2FFRRAB",
            "text": "Cool spot for pre-show food and drinks. Everything we ate was delicious and the Guinness was particularly good. Our server, Dakota, was helpful recommending what to order. A bit noisy, but would definitely recommend."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUlRWTjVRVU0xZWs5VGRsOVFPRmxVZVhVMGJtYxAB",
            "text": "Love the decor. My date and I arrived at 4.pm the place wasn’t crowded until about 20mins after. The service wasn’t perfect, hosting could’ve been and little better as well and serving. Love the idea of the Photo Booth which my date and I utilized."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcTRTdHB3RRAB",
            "text": "I feel incredibly honored to have been part of the opening night celebration! The cocktails we had were absolutely fantastic, offering a delightful twist on tropical rum cocktails with the Caribbean Cowboy, and a perfect choice for…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210Q1dVTjJRemcyTnpJeE1HUmFSa3Q0WkU5T1dIYxAB",
            "text": "This was an A+ experience! I generally find food in HK to be lacking, but this was excellent. The service was also great. I will be back often. This may be my new go-to pre theater spot!"
        },
        {
            "date": "5달 전",
            "language": "ja",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJR0ktb1N6c1A2dGd3RRAB",
            "text": "落ち着いたいい雰囲気、良いクラブサウンド、気軽な食事が楽しめます。\n特にフレンチディップが美味。\n行儀悪いと思わず、手で掴んで、ソースにしっかりディップして食べるのが正解🙆"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcmJDQU1BEAE",
            "text": "I gave the food only two stars for the following reasons. I started off with six Nola Baked Oysters ($21) which had no taste of oysters due to the ingredients they topped the oysters with. For my main course I had the Smash Burger ($27) which had little flavor. The pictures of the bar area and one of the two separate dining rooms I have submitted are very attractive. One of the two is just off the bar area (seen in my photo below), where I ate, and there is one in back of that one."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQM3BpTmtRRRAB",
            "text": "I was excited to check out a new addition to the Broadway district. I have a soft spot for places with newly remodeled spaces, and this one didn't disappoint. The restaurant is steeped in history, with stunning details behind every themed corner. It was already beautifully decorated for the Christmas season, creating a festive atmosphere. The attentive and lovely staff added to the experience.\nWe sampled several items from the menu. The oysters were fresh and paired with a variety of condiments, while the shrimp cocktail was also fresh and appetizing. The avocado bites and crab cake arancini leaned toward the fried side. I enjoyed the arancini and its flavorful sauce, but the avocado bites weren't to my liking due to a hint of sourness.\n\nThe smashburger with a double patty was tender and delicious. We also ordered the house-cut fries, which were well-seasoned but unfortunately arrived cold instead of sizzling hot. The cocktails were excellent and rounded out the meal nicely."
        }
    ],
    "reviews_count": 94
}