{
    "name": "SESAMO - Italian Restaurant Hell's Kitchen",
    "place_id": "ChIJzY70m1BYwokRPl3Q3N_6-Io",
    "grid": "MN4",
    "address": "764 10th Ave, New York, NY 10019, USA",
    "rating": 4.6,
    "user_ratings_total": 1368,
    "phone_number": "(212) 265-2755",
    "reviews": [
        {
            "date": "2시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTWJUTk1hV05ZZG5SMGR6UnNSRzlhUW5SSFYxRRAB",
            "text": "We went for lunch. It was so good went back for dinner after the show.   The pasta was outstanding!!"
        },
        {
            "date": "수정일: 2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5R2RTMHlOMjl0V0Rac1NGWklabUZDTjJkcU1uYxAB",
            "text": "This place is terrific for either dinner or drinks only. The drinks are pricey, but well worth it! The mixologist are on top of their game! Highly recommend. Vibe was friendly and quaint!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxRFRqZDJieTF5Y25KMk1HVk1Sall0YVdWWmJXYxAB",
            "text": "Great food here"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVk0wWmxaMlpZWlY5SFpGaFpjR1o2VW1wS09WRRAB",
            "text": "The Hostess and our server were beyond kind and attentive. The food was exceptional - I’m still thinking about the Tempura Chicken Parm and the pasta. Cocktails were great as well. Sesamo is a must."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGeExYcFdPVFJCYVc1NmFrSkRORkJMU2psNmRsRRAB",
            "text": "We spent 5 days in NYC and dined at several restaurants. We stumbled on this one by accident. It was 5 stars for everything. Not cheap (but not expensive at all by NY syandards) and so worth it!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdlNIcG1kMVV3WlRSc2NsZHdPVmxPUzNSNVJVRRAB",
            "text": "This restaurant is extremely attentive, amazing service, and even better food. We can’t wait to come back!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wa1NrZHFRMjFzWnkxalJsSnZVMU5rYUdsWlZXYxAB",
            "text": "lovely asian influenced italian spot in hells kitchen, really friendly staff and service. a bit on the pricier side but the food is definitely good here!\n\ngreat selection of starters - the best of which was the wild calamari fritti, very moreish and that tomato sauce is also a winner. the salmon crudo and stone fruit buratta salad were also very nice.\n\nthe szechuan cacio e pepe with the truffle and stuffed pappardelle was really tasty, very cheezy and rich but probably could've used more of the szechuan peppercorn for a bigger kick. the tempura chicken parm was a cool twist on a classic, nice crunchy tempura batter on the chicken with a simple red sauce spaghetti on the side. the highlight of the meal though was the  duck ragu pappardelle, the ragu was delicious with a nice warm spicing and super tender duck meat - defo a must try dish here."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNdGRXSkNRbXd3WjNSTWRXdGxVMVIwTFcxdWJGRRAB",
            "text": "Hidden gem! Creative dishes join a warm atmosphere. Everything was interesting and delicious. Beautiful place."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sR1MzZHJVbkZUVDAxNlVGTmZXVFZDV0ZkbFJrRRAB",
            "text": "Nikita and his crew run a lovely, scrumptious restaurant nestled on a quiet corner of Hell’s Kitchen. Italian meets Japanese in a delightful combination of flavors, the duck breast and charred octopus being the absolute standouts alongside the uni pasta. Highly recommend!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205cVVHSnFiSEF6VVROTlFVTnRObU00UzNWSWMzYxAB",
            "text": "Check the time, they are closed after lunch until 4:30. Mai’s has it incorrectly listed as open during that time."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuMC1xdTdBRRAB",
            "text": "Went for a late brunch and tried the prix fix. Food was great, service efficient and the place was quiet. Worth it !\n\n9/28/25 Update: came back a few times, food is still as good but prices went up and portions significantly reduced. Too bad…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCSE0yRlNSVVJ2VVZRMU5FazJUVXBMY1dKSmQwRRAB",
            "text": "Wine pairings were phenomenal, our server Melanie was a super hero! Ps get the matcha tiramisu"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pad1VFdERkVTF5U0ZSZlkzTXpUV2hNWVhJMldXYxAB",
            "text": "Russ was fantastic, the food was even better.\nRecommend if you want excellent service and meal"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKYVpHdHdOVEp4ZHpsSE5uRjROM0ZOWjI1aU5uYxAB",
            "text": "The food was tasty and presented in a nice way. The service was great, corteous, friendly and always attentive of my needs."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25seFJXNDFSMG93TFROUkxWVTFka3R4UWs5SFRIYxAB",
            "text": "My visit here was memorable. Service team has a sense of humor, is welcoming, and watchful. This place combines perfect atmosphere, good flavors and total quality. The kitchen turns fine ingredients into exceptional meals. Thoroughly happy."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZNWEwUkRXRmN4U0dGVGVuZHNla05tZVV4SE5HYxAB",
            "text": "Fantastic asian / italian fusion. The brunch menu was delightful."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSV1Z6YzNYM04wTTNneGVIUXlTVVZGYVRKTE1uYxAB",
            "text": "Russ was a really fabulous server with superb advice. The coconut curry salmon and duck with beet sauce was fab! Cocktails were lovely!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5RWNGQkxTM2xITm5aelYyUk5YMVJyWW1KVk5HYxAB",
            "text": "The food drinks and service were excellent!  Highly recommended."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWYVoweGpWVXg0TjFCSlNIbE9ZMmREUWt0UE1XYxAB",
            "text": "I love the quality of their foods and the twist they bring to Italian flavors with various Asian influences. As weird as it sounds it is actually delicious. Ask for B. She runs the bar. I keep coming back. The pic is one the best chicken parm I have ever had."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wMGMwSkJaVVpxUTNsRFdFMU5UbXcwWVc4d1kxRRAB",
            "text": "The food was fine, nothing special and we ordered the price fixed menu and it was not worth the price. There are many better Italian restaurants in NYC that have better food and are a better value. I would not go back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WdGVXbHZXbTlIZVVwT1RIWnpaRzAxY0dwa2NXYxAB",
            "text": "What a great experience.  Italian and Asian??!!! Who would have thought.  Great mocktail choices.  The food was amazing. Lobster/Octopus/duck/cod - I had it all.   Tasting menu was fun especially with a partner. Definitely recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjNVVqVlBabWRZVjFWalJYTk5OamhLVEZVeFZXYxAB",
            "text": "I went on a weekday lunch and the place was quiet. We had 3 different pasta and they were all good. Service was great as well."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214VGJtc3lVRGt0WDBaNGQySlhZV1JzUm5oUVdGRRAB",
            "text": "Delicious, intimate, wonderful service. Get the oysters!! Perfect Asian Italian fusion."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUlV6SjZUMkZDYlhJd1lUSm1kM0IwZWxGd1NtYxAB",
            "text": "Amazing food and even better staff. Food was very flavorful- definitely would come back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4NWNGZHZNRTl3ZVZSTWMwMXhVRkpKTFU1aU1XYxAB",
            "text": "The food and service was awesome. I recommend  highly that u eat at this restaurant"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4c2EzVkpOVFE1YlV0eVJGWmphV2R3YmpocFdYYxAB",
            "text": "It’s an Asian and Italian fusion. All dishes are on the smaller side and pricy but taste delicious. The calamari was only half on the dish."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RNFJrNUZOVWRYUlc0dFNYRlJZMWs0ZEhKWFZFRRAB",
            "text": "We had an amazing dinner here. That's exactly what I expect from the “restaurant food”. It’s hand made, it’s rich, it’s tasteful. Will definitely be coming back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5bE16QmxWM1JXUmt0d1R6QTNRM2xyUW5jM1JXYxAB",
            "text": "Absolutely delicious food. The owner is a skilled sommelier and the wine pairings were perfectly matched with our meal.  I highly suggest the calamari,the duck breast and the matcha tiramisu."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toU1UyTTRablZaZVd4UmJFVlRTVTVNTmxwamNVRRAB",
            "text": "Just had our anniversary dinner at SESAMO, and we’re still talking about it.\nWe tried the Uni Tagliolini and the Strip Loin & Wild Mushrooms—both beautifully cooked and plated. The service was attentive without being pushy.\nThis is our new go-to for special occasions or whenever we want a little romantic escape in Hell’s Kitchen."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUGQxSnBSRjlXVERka01Vb3RXamRNTkd4a2RIYxAB",
            "text": "Five Stars.\nThe David Webb of estabishments to eat! If you love High-end food and appreciate art, then you have come to the right place. As I understand it from Eddie, this is the dream of a husband and wife who deserve accolades for authentic creativity. Eddie, BTW shares the passion and represents the owners dreams perfectly. His drinks taste and look stunning. He is fast, attentive and thoughtful. He is as authentically genuine as the food!\n\nThe food was nothing short of exceptional, and I am a foodie who evolved within true old school italian cooking. My mother had a pasta kitchen for 20 plus years. I grew up rolling pasta on the back of forks and helping to harvest gardens! Decisive, creative and delicious. The food will take you to another level wothout overwhelming you with too many choice.  It works because the food, staff & atmosphere commands your attention!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GV1YwcFJhVkZTTlZsM05HY3pTR3BJTUd4RlRWRRAB",
            "text": "Excellent restaurant. Great service. Great food. Very artistic and creative. Highly recommend. Get the miso chicken you won't be disappointed."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHeWRyU0V3EAE",
            "text": "SESAMO is my new go-to date night spot in Hell’s Kitchen. I came here with my boyfriend and everything - from the low lighting to the intimate ambiance - screamed romantic dinner.\nWe shared the Burrata & Summer Fruits, which paired perfectly with a glass of wine, and the Truffle Cacio e Szechuan was simply mind-blowing - creamy, aromatic, and with just a hint of spice.\nWhether it's a first date or an anniversary dinner, this is the kind of place that makes the night feel special"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNVNXcHZkazgwVlVJNFFWQlFhaTFHVFhSVVgyYxAB",
            "text": "Welcoming staff…excellent tasting food….great cocktails!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRd1p2ckxBEAE",
            "text": "Sesamo Is one of the best hidden Gems in the city. Let’s start with the food! The take on oysters with a citrus sauce is amazing! My wife and I dined there and could stop eating them! Order 2 dozen! The cocktails made by the bartender were all well balance. We had amazing mushroom truffle Lasanga with tons of Truffle and the Cacio Pepe for with even more truffles, the flavors and smell was amazing. The we shared the Tempura chicken Parm, this is by far the best Chicken parm I have ever had outside of Italy! Over all the food and the drinks were amazing. The staff was standout and the ambiance was beautiful. Thanks so much for such an amazing dinner! Best date night spot in Hell’s Kitchen."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwaGRfTTdnRRAB",
            "text": "Looking for a perfect date night in NYC? SESAMO it is.\nThe lighting is warm, the music is soft, and the food is outrageously good. We had the Miso Caesar Crunch and the Morel Agnolotti - both delicious and beautifully plated.\nIt’s rare to find a restaurant in Hell’s Kitchen that feels this personal. Whether it's a romantic dinner or a second date, this place just works"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25saGMwUjVPRGRsZVU5UU16SkRNRXB4WDNGR1EzYxAB",
            "text": "Excellent food and service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ReFlWWkhYM0kzZEZoaVRFRTViVUpGV1c1a1duYxAB",
            "text": "My wife and I traveled from Minnesota to NYC for work. We went to Hells Kitchen in search of a small \"hole in the wall\" place to eat. We literally stumbled upon Sesamo's and gave it a try. What an awesome meal and experience.  The staff was wonderful and the food even better.  The portions we perfectly sized.  I can't wait to come back hungry on our next trip."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnM1luQkdPVk5zUjFaZlYxTlVlRFJLU0dKVVFXYxAB",
            "text": "Thanks ! Amazing dinner !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wNlgzQXpjbTlpY2pGTVRIbFNWVmh2V0daRVNsRRAB",
            "text": "Amazing meal! Justine was a great server. The hostess and bartender were lovely!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sR1JXdFViM2RZUTFOMlNYQnpSMkZWTW1vMmMzYxAB",
            "text": "Always great food and nice staff, a little pricey"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4R1FYWjRXa28wYkZKSVdrMTNhRWM0VWpSNFFWRRAB",
            "text": "The most delicious Italian food I have ever had - including multiple trips to Italy! Our server was extremely attentive and carefully explained each dish. I highly recommend this restaurant and the chicken parm."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4bmRXTkRUV0Y1WXpSSWQybEVObVkxUjFSWmJXYxAB",
            "text": "Me fascina este sitio por la gran energía qué tiene me siento cada vez que voy superespecial"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4Vloyb3hOa2x0Wm1vdFV6VjBjRlJsTmw5dVpWRRAB",
            "text": "Smoked peach old fashioned"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pocGJURTBXRzV2VGtzd1gxRlpWVXRzVDBObmQzYxAB",
            "text": "Very cute cozy corner spot with open brick face walls dishing out Italian food with Asian highlights in Hells Kitchen.\n\nReally interesting take  by a husband and wife duo.\n\nFriendly staff from the minute we walked in.  (Margerite, Samantha, Justin and Mario to name some)\n\nThey also have a solid wine list.\nTheir take on cacio e pepe calling it cacio e szechuan is really.good.\n\nThe salmon crudo was out of this world and I am not one that orders salmon!!\n\nTheir tempura chicken parm may have been the best chicken parm I ever had\n\nWe also had the special lobster tortellini  and scallops.\n\nThe matcha Tiramisu was interesting and very good.\n\nDefinitely check them out for a different spin on Italian food. I have been twice.so far"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5dmRuQXhWVEJETjNaa05qUnJSV1pRTnpBd1JVRRAB",
            "text": "Creative Italian restaurant with Japanese elements."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGVk5taHdTRXREZDBRdFIzUkdjakpyVTIwdFQyYxAB",
            "text": "Sesamo is a favorite spot for my family. Most recently we had our 3rd wedding anniversary dinner there. Highly recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcGRtbDZkbnB1YjNsbmRFTndZUzEzVFZkaVVHYxAB",
            "text": "Wonderful food, drinks and service! Will be back for sure!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSYVJESjBRVkZQWlVkSGJWOTJiazgzV2s1UE9VRRAB",
            "text": "Great option for pre-theatre dinner off of Broadway. Food, drinks, and ambiance were all excellent. The service we got as well was surprisingly perfect- the waiters were always present and checking in but never at inappropriate times, and I don’t think plates sat empty more than a few seconds before being taken away. Every dish we got was well executed. Definitely would recommend."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3ejRpOWN3EAE",
            "text": "SESAMO delivers again!\nSecond visit, and just as impressed. We shared the artichokes, arancini, fennel salad, calamari, eggplant, mushroom pappardelle, and chicken parm—every bite was on point. The vibe is warm and inviting, the service spot-on. Don’t skip dessert: the chocolate ganache and matcha tiramisu were the perfect finish. We’ll definitely be back!\n\n********************\n\nWe were really delighted with our dinner. Started with a great gem salad and burrata. Excellent agnolotti with pesto...really nice!  And the chicken parm was perfect. Not too much sauce or cheese on it and the chicken was both crispy and tender. The pasta accompaniment was also really good. Excellent service from start to finish. Nice chilled, local neighborhood vibe. I'm happy to have finally tried this spot as I've wanted to for some time. And based on our experience, we'll definitely be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oTmFEQTRRbTlmVEc1WVgwRnBaRWwxTFZnelMyYxAB",
            "text": "The food was flavorful, and the atmosphere was very relaxing"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOX1FvSVRyZzZ2SHJ3RRAB",
            "text": "Phenomenal. I loved every dish. Our waitress recommended the chicken dish, which I never would have considered to order on my own and she was right. It was sensational. The duck ragu rigatoni was also delicious and to top it all off the matcha tiramisu was to die for. I would totally come back here in a heartbeat. I highly recommend this restaurant for a nice dinner out."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKM2oyLXZpMmNhLVJBEAE",
            "text": "This fusion Italian restaurant was a delightful experience. The food was absolutely delicious, and the cocktails were refreshingly well-balanced. Every appetizer and entrée was beautifully presented. The cozy atmosphere and friendly waiter made the evening even more enjoyable. Definitely worth it—highly recommend!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmaUxIOGV3EAE",
            "text": "We went here for lunch, and both the chef and staff were fantastic. We thoroughly enjoyed the meal—the calamari, lasagna, and burger were all delicious. The wasabi burger was especially unique and absolutely amazing! While the interior isn’t particularly fancy, the food easily rivals that of some upscale restaurants in the city. Their house-made vodka sauce was outstanding as well."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kTFJtTXRWbTVIVUVweE5YcElTRXh0Tm5KWVRWRRAB",
            "text": "Incredible dinner! Melanie was the best waitress. We recommend the duck ragu and cacio e Pepe, the food was amazing!! Try the cocktails too."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2NnRleTFRRRAB",
            "text": "They have a $55 prix fixe dinner course, which is of good value. The duck ragu was the best dish, while the miso coconut salmon was alright. I can’t say I liked the chocolate katsu bread very much. Everyone was so kind and the service was amazing although a little slow. Overall good experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NdFV6QlpaVUV3ZDA5U016aFVhVUl4WkdFdFVHYxAB",
            "text": "Absolutely incredible meal!\nWe stumbled upon this spot and left absolutely amazed. The suggestions were unreal—huge shoutout to Melanie who was a 10/10. Her recommendations hit the mark perfectly. The chicken parm and agnolotti were both perfection. Can’t wait to come back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcV9YNnFRRRAB",
            "text": "I just stopped by a cute place for a glass of wine and met Margarita, the bartender. She recommended I try a new dish called Black Cod — and OMG, it was amazing! So delicious and flavorful! I had a great time there and highly recommend checking it out!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNVphdmdnRRAB",
            "text": "Took a group to Sesamo for a private dining experience and it exceeded our expectations!  The staff was so attentive, and the food was delicious.  The whole process of booking the space was so easy.  The menu - both food and drink - was creative a beautifully executed for our 30 person group.  Highly recommed Sesamo for group dining!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINzV6aUt3EAE",
            "text": "Tried this place after googling Italian places that have vegan options. They have a vegetarian options and one vegan dish. I tried their vegan lasagne tartufo. Wasn’t bad. The sauce was good I asked for bread on the side. I tried their lemon spritz which is their version of limoncello—was refreshing. I would say they’re more American than they area Italian. They have other Asian inspired dishes on the menu. The fried artichokes are good. The matcha tiramisu is interesting. Has a crunch and enough sweetness balanced by the bitterness of the matcha. They have patio seating. Inside seating is better on a humid day. Wish it was more memorable. Their service is good at least. Our server didn’t check on us too many times like other places. Didn’t feel rushed. I’d recommend it to those who are curious about fusion food."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2OE8tVGFnEAE",
            "text": "I hosted a corporate event at Sesamo and rented out the restaurant for a passed dinner. The space was perfect! We had a group of 40 people, plus used a corner of the room for a custom hat bar. We were able to easily accommodate everyone. The food was delicious and the staff was very kind and helpful. I worked with Sabrina to make the experience happen. She did a wonderful job with everything and was very easy to work with. I would absolutely recommend Sesamo for your next event!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRMDZLTG5RRRAB",
            "text": "Delish! Very cool vibes, seasonal menu and great service! Really happy w the serving sizes and prices. We were stuffed, gonna have to go back again for dessert. cocktails and wine were on point! Highly recco, we went weekend night and had a reservation and were seated right away."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xc1gyMVZhMFpKUWxReGEyOUtaa1IzV2t0bFluYxAB",
            "text": "Delicious chicken parm and the apps (cauliflower, artichokes & burrata for the table) were all incredible!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGejhQOWp3RRAB",
            "text": "Very nice build. Long bar. Friendly staff. I am critical about food. I owned 12 restaurants over 20 years in NYC. Salmon was really good. Cabenora pasta was horrible. It was very bitter.  It's supposed to be fusion. Didn't work out well.  Wine pour was super stingy.\nGood atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqeXY2REdBEAE",
            "text": "A great place.  Cozy, friendly, elegant and tasty food.  The chicken liver board is really good.  Grilled broccolini, Japanese eggplant and coconut miso salmon, and fried artichoke.  Not one dish was bad."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdko2QndBRRAB",
            "text": "I saw a friend post about this restaurant on social media, and she recommended it, so I was excited to try it. It offers Asian-inspired Italian cuisine, which sounds really interesting! We ordered two appetizers and two entrees. We both loved the appetizers, but we were a bit unsure about the taste of the entrees; they were just okay. The service was a bit slow, but we enjoyed the atmosphere while we waited. Overall, it was a fun experience, and I’m glad I tried this unique blend of flavors!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcnBDVi13RRAB",
            "text": "This restaurant was absolutely amazing!! We went on a Sunday evening, no wait, great food and great service. Our waitress was also our hostess and bartender and never missed a beat! We ordered the caesar salad to split.  2 of us ordered the tempura chicken parmesean, pappardelle and added clams, and the duck ragu rigatoni! Everything was simply delicious!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPR0tnNWl0Mk9DX19RRRAB",
            "text": "Had an amazing brunch with friends — everything from the food to the vibe was spot on. Melanie, our waitress, was absolutely fantastic! Super friendly, attentive without being overbearing, and made sure our coffee cups were never empty. She really helped make the morning feel relaxed and fun. Highly recommend this spot if you’re looking for a great brunch"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtM2NEN2pRRRAB",
            "text": "We came to Sesamo because of my friend’s recommendation. Even though it was a Friday night and the restaurant was full, it didn't feel too crowded. Great music, design, and a cozy atmosphere.\nIt was a Friday night before Halloween, and the team at Sesamo restaurant did fantastic work with their Halloween decorations.\nAlso, they have nice seating with a big red leather bench. I guess that space is for large groups of 6 and more, and I highly recommend requesting that spot if your group is large enough.\n\nSesamo serves Italian cuisine with some Asian fusion, which is an excellent combination.\n\nTheir service is also great. Our server Varsh was very accommodating, with plenty of great recommendations and knowledge about the dishes. Very positiveattitude and a beautiful smile. Very professional too.\n\nWe ordered a few appetizers for sharing:\n⁃\tCharcuterie board\n⁃\tSalmon crostini\n⁃\tRoasted broccoli\nHighly recommend the first two dishes.\n\nThe size of the charcuterie board is big enough to share.\nChicken liver mousse had an incredible taste with a light and gentle texture. Good combination with a savory blue fish on the same plate.\n\nSalmon crostini would be my favorite appetizer. Local smoked salmon tartare with local mustard ricotta and toasted bread was delicious, and the combination of ingredients let me enjoy each bite of that dish.\n\nRoasted broccoli was also very delicious. The curry on a peanut sauce takes one point out of this dish personally for me, but if you like curry, you will be in love with this dish as well.\n\nEntree:\nWe ordered a Coconut Miso Salmon and lobster ravioli. Both of them deserve my high recommendation. The curry sauce made the salmon taste different, and that change is in a good way. Black rice finished the picture and gave a positive word about this dish.\nLobster ravioli is very light, and even though it is pasta, it doesn't feel like a heavy dish. Very gentle texture. The temperature of the stuffing was warm enough to enjoy the taste and don't burn your tongue :-) Highly recommended.\n\nWe finished it with crème brûlée, and you’ll never go wrong with this one. Excellent finish for a fantastic dinner in a wonderful restaurant.\n\nWe have been lucky enough to meet with Sabrina, the restaurant owner. She has a great personality, and her positive and welcoming energy spills throughout the entire restaurant. I highly recommend this place, and I can't wait to come back again!\n\nThank you,\nEevahn M"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1X0tqT3NRRRAB",
            "text": "We came here for dinner on a Friday. I ordered a drink (mixed sake) cocktail but found it too sweet and i could not taste much alcohol. Other than that the food is very good. Shy of Michelin star standards but they are intentionally seasoned and well made. We ordered from their fall menu, which is a good selection. Overall I am very happy with the food, especially the Plum and the Beretta starters. I recommend checking out this place at least once, and see if their Asian / Italian fusion suits your taste. I believe the service and the food won’t disappoint. The decor is warmly, especially on a a rainy day. I live in the neighborhood, and find the ambience here to be one of the best for dates/nice dinners. Try it out!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bTdyT3NRRRAB",
            "text": "A little crammed, but our waitress was AMAZING! Appetizers were sooo delicious, I would go back just for those breads!! Unfortunately, main dishes weren't as great, but desserts were unique, and overall had a good experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoLS1ERENBEAE",
            "text": "Love Sesamo! My go to date spot for brunch. Their unique and always evolving menu never disappoints. The vibes are always great especially due to their impeccable staff. The pictures below are currently on the menu besides their “unfinishable” french toast. This place is great if you’re looking for something new in Hells Kitchen."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURad05xNmtBRRAB",
            "text": "Excellent and very reasonably priced food. Service, food, atmosphere and location are superb. We tried several appetisers; all were exceptional! The raw oysters with yuzu and caviar were fresh and flavourful. We had our dinner here before a Broadway play, which is just five blocks away."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScU43ZXRBRRAB",
            "text": "Gavin at the bar is the best. Loved my experience. The drinks are delicious. The best Negroni I’ve probably ever had. I let Gavin choose my entree and he didn’t steer me wrong. I’ve been many times but this was the first time I sat at the bar with Gavin. Very attentive and helped me pick the best things from the menu. But the truth is, there is nothing bad on the menu. I’m already planning my next visit to try his other recommendations."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaZ2YtdE13EAE",
            "text": "We enjoyed everything we ordered but their palate is definitely on the heavier tasting side, the duck ragu was a tad too salty towards the end. The yuzu blossom is also more sour than sweet so do take note of that!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1bW9MM1FBEAE",
            "text": "This was truly one of the most delightful dining experiences I’ve ever had. We happened upon this place looking for Italian food in the area and couldn’t have been happier with our choice. All of the food was exquisite— the oysters in particular were so amazing and unique, and both the carbonara and the seafood tortellini were unbelievably good. Everything we ate was divine. The atmosphere and the service were equally fantastic, and our waiter Russ was actually one of the most impressive waiters I’ve ever had. He was attentive and so knowledgeable, and clearly knew the menu like the back of his hand and had the best recommendations and insight. He was such a joy to chat with, we couldn’t wait to leave and give him a great review. Sesamo gave everything we hoped to get out of a chance NYC dining experience- exquisite food, great atmosphere, fantastic drinks, and incredible service, all at a reasonable price and without a ton of pre planning or waiting for reservations. 10/10 would dine again."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdm9PSnRnRRAB",
            "text": "Third time dining here, and it’ll definitely be the last. My friend and I got food poisoning—horribly sick for two days! The only common ingredient in our dishes? The truffle. Eat here at your own risk, but I wouldn’t recommend it to anyone."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJalEwcERaN3VuczN3RRAB",
            "text": "Great spot, excellent food. Chose a 4 star rating because we made the mistake of ordering something not typically to our liking. The octopus was fabulous! The wine selection was specially curated by the owner and was really enjoyable. Loved the Piedmont langue Nebbiolo. Service was outstanding. Can’t wait to come back!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaaTVuenZnRRAB",
            "text": "Sesamo attempts to combine Asian and Italian flavors in a stylish space. While the atmosphere was on point and service was good, the drinks and food were very disappointing.\n\nTo start off, we got the Dragoncello and Mango Boba. Both these were boring, watery, and just didn't really have any character. The boba drink was especially weird as the boba wasn't chewy - it had the texture of salmon roe... why??\n\nNone of the dishes were impressive either. The burrata was meh with a few slices of tomatoes. The mackerel carbonara was average but didn't standout. The Japanese eggplant was almost good - the eggplant part was delicious but the capers and olive mix on top was way too salty. And to finish off, the black tea creme brulee didn't taste of any tea."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbktxQzVBRRAB",
            "text": "What a great find....Sesamo's bar choices and food were amazing.  We had a fantastic night sitting at the bar and eating, but they also have a wonderful dining area if you don't want to be at the bar (but bartender was great so we hung with him).    We started with drinks and small plates.  The Dragoncello (Vodka, Pomegranate, Tarragon syrup & Lemon bitters) was delicious.  The Across the Izakaya (Vodka, Gin, Lychee Liqqeur, Lillet Rose) was wonderful, light, refreshing, not too sweet.   Then we had the Anadama Bread, Burrata, Roasted Broccoli with peanut sauce, and Winter squash crostini....can't pick a favorite because they were all so good (ok, so maybe the crostini was my favorite, and the broccoli was my daughter's favorite, but we would get all 4 again).    We finished with the Duck Ragu Pappardelle, well flavored sauce with duck and perfectly textured pasta.  We had no room for dessert so when we go back (which we will do) we'll have to try their desserts."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWLS1qbFhREAE",
            "text": "Absolutely amazing meal! Every dish and drink we had was delicious. Russ our bartender and waiter took the best care of us. The ravioli and Yuzu blossom mock-tail were the highlights. Steak was cooked to perfection. A fabulous evening. Would definitely return!"
        }
    ],
    "reviews_count": 80
}