{
    "name": "Becco",
    "place_id": "ChIJndGJ5FNYwokRricJvhT0t1s",
    "grid": "MN4",
    "address": "355 W 46th St, New York, NY 10036, USA",
    "rating": 4.3,
    "user_ratings_total": 4435,
    "phone_number": "(212) 397-7597",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nMllWazBUMTlHTTBZeVJqRkhOVE51Wmw5ekxXYxAB",
            "text": "We both Ordered Chicken Parm. It did not come with pasta. We asked for a small side of pasta and red sauce. They refused. They only said it was for Kids and would not give us any side or even a full plate (we were willing to pay the full price of the unlimited pasta for the side dish). Overall would not recommend."
        },
        {
            "date": "2일 전",
            "language": "nl",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sblZUZG1kMHRTY3psRFZUUllaVmxyWDFkSFowRRAB",
            "text": "Lekker gegeten, doch vond ik bediening enorm opdringerig en ondermaats... We deden een 6-tal restaurants tijdens onze citytrip en dit viel wel op. Wat meer duiding: heel snel praten, aan tafel blijven staan en direct moeten bestellen zonder dat er ruimte is voor overleg, je een gevoel geven dat je net een zeehondje hebt doodgeknuppeld als je geen dessert bestelt..."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xadUxVZEhZVEJyZUdoR1prNXZaRGRvZUV4WFFuYxAB",
            "text": "The Limone Chicken was tough to me but the beet salad was delicious."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjNE9XaHFRbVZQUzNoVGMzWkdiMTgxZVZGa1IwRRAB",
            "text": "Absolute perfection!! Was a Bucket List Restaurant since Lidia Bastianich is one of my idol chefs. Everything was  delicious. The only ding in service was that Google said they were open when I got there at 330pm, but apparently everyone was on a break until 4pm and the hostess was a tad snippy about it? Yet they keep the doors open? Then at 4pm, they shuffled everyone into a small space of the bar area to be seated. Otherwise it was an absolute dream!!!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pORkxUWlpVMXAwTFVGWFlURktTMXBPYXpOSkxXYxAB",
            "text": "So disappointed. As a long time fan of Lidia and her feelings about the role food plays with family, friends and tradition, I always wanted to dine at Becco. I finally got my chance for dinner on October 25, 2025.\n\nThe atmosphere was chaotic. We were seated at a table in the bar, by the door. People were coming in constantly. It was very loud and rather crowded. Service was quick and efficient but I'm guessing on theater matinee days it's not the time for a relaxing dinner.\n\nThe menu wasn't what I expected. The only pasta available was in the prix fixe \"sinfonia\" which includes a choice of one of 2 appetizers and a sampling of 3 pastas only, which are announced when menus are presented. There was no pasta section on the menu which I expected. Since I'm not much of a meat eater, I reluctantly opted for sinfonia.\n\nOne of the appetizers offered was roasted vegetable antipasto which I chose. What I got was a sparse plate of a few pieces of cold veggies and a few beans in an oil and vinegar dressing and 2 small bowls on the side, one containing octopus salad and the second 2 small chunks of what I was told was salmon in a thick tomato sauce. Nothing remotely resembling an antipasto of roasted veggies.\n\nThen came the pastas. Three individual servers with big pans or serving bowls of the 3 pastas that night: spaghetti arabiata with breaded shrimp(?), rotelle and pesto, and mushroom ravioli in a cream and sage sauce. A bowl of either one would have been fine. But 3 on the same plate? I'm Italian. We never ate like that.\n\nThe bottle of wine we shared was very good though.\n\nAt this point, given its location in the theater district, Becco has become a tourist destination more than anything else. Hence my disappointment. While I don't get into the city as much as I used to, I'm not a tourist."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WWNuUnpkbkJ5VW5FNWFWUjFkWFk0V1Vjd1RFRRAB",
            "text": "Service was poor, food was good but our server didn’t really explain anything, like how the “all you can eat” pasta option works. Not sure I would come back although I know people who love this place. It’s just not for me."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWZmMyUklZVlpJWW5aclVVWmZha0ZsWlZkc01IYxAB",
            "text": "A wonderfull place to dine. The food is delicious and prices are okay. The restaurant has a very nice ambiente. Choose the pasta trilogy as it is the signature dish.\nMake sure you have a reservation to get your table.\nHave fun and enjoy."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kVWRpMTNWa3Q2UzJkbmF5MXBTRVl5VTFvelkyYxAB",
            "text": "It was a bit overpriced for the small portions given. Overall, food was tasted good."
        },
        {
            "date": "2주 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paMlMwcGxUMjFHTFVWSGRHZHRYMmh5YzBoMU5IYxAB",
            "text": "Qualità prezzo ottimo.... e soprattutto hanno sempre la zuppa del giorno che noi italiani amiamo molto quando inizia l'autunno fino alla primavera!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMVRFWkJUMmR2UjNCWVQwNVZUVU5QWlRrMFZIYxAB",
            "text": "We came here many years ago and we had to come again. We had the trio pasta. This time it was mushroom ravioli, linguine with clams and farfalle. Food was great however it was very noisy there."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cVZqTlBPVnAzVVZGeVREazNXWHBVZDNWWE0wRRAB",
            "text": "Not worth the price"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twYWNWazRUMGg2VTA5QlprNVBSMlJxWlcxWWNrRRAB",
            "text": "Excited to have an Italian meal in the big city fell flat. It was crowded and noisy and as a party of 5 we were placed at a table for 4, but then squished more into our table as a party of 8 was placed next to us that then seemd to be more important than we were as they got attended to in a very quick manner with extras inclung free wine \"just because\". Our table finally ordered after their table and 2 other tables sat after us were served before us. The food was good and I enjoyed the lasagna.  However, we all were served different portions of the salad and they took the platter of it away while other tables got the entire platter left at their table to enjoy. My husband accidentally spilled his drink after like 2 sips and no one offered him another one. Finally, after 2 phone calls from the restaurant confirming our reservation and that it was to celebrate our 20th anniversary, there was nothing done to even acknowledge this. I did appreciate that it was able to get a side of the specialty pasta without seafood. I wish that service would have been experienced the entire time."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0ak1VNUJiMUp5T1dReVRIbHRhV3BVYVVVeU9FRRAB",
            "text": "Beautiful resturant, amazing food. Great, quick service. Perfect for theather lunch or dinner."
        },
        {
            "date": "3주 전",
            "language": "iw",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFemFUUnhVV3BOTmpWSFVsOXRkbTE1Tld0SGFFRRAB",
            "text": "מקום יפה מאוד , אוכל מצויין , ממליץ"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taT1QwSnBaMDV1UkRWNU9ISnFPWGMwU0hGaVNXYxAB",
            "text": "Great food and great service. Didn't have to worry about our water not being filled or leaving with our stomachs half empty. Expensive but worth the price you pay and its not a pricey restaurant you leave feeling unsatisfied"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOQ2J6RldUVTl6T0dZM1gyOW9iMkozWkc1dFdXYxAB",
            "text": "Very important to make reservations.  Fills up very quickly."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205eVJrNW5ia2M1WkhvdGVVc3RiWHBMTUdGRExXYxAB",
            "text": "Great staff, great atmosphere, amazing food, we went before theatre and loved it"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnX0pQdTJRRRAB",
            "text": "Great service. One of my favorite restaurants."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3ellrWjFibE5tT1U1ZmMyMXZOVlkyYlZCbVExRRAB",
            "text": "Food was excellent and service was great"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swd09YUlhha2hyTm5jNFpHcGtSazFzUlVaMU1FRRAB",
            "text": "Always our go to place when seeing a show."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSUlFrSlBOMFZ1WVdKcGRuVk1ORzlmZUVSc1JHYxAB",
            "text": "Great and unique traditional Italian cuisine that emphasizes regional specialties"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKUGRuYzNXSGhYTXpOUlRXVlBYelUwV0ZwVlRFRRAB",
            "text": "Consistently excellent.  Last night had the stuffed pepper with rigatoni.   Fantastic.   Prices are reasonable, even for drinks and wine."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOVGNuQmpTMUpXY1ZKRmFGVm1NMmgzUjJ3MldHYxAB",
            "text": "It's our favorite Italian restaurant in the theater district. They are welcoming and the food is so good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRGVHTjRNRFJCTTBseWNsZDRhMGxMWkZndGJVRRAB",
            "text": "Was extremely surprised with my experience. Ant in my napkin, a nat in one of the dishes. Pasta being tossed onto my plate. Most importantly, couldn’t even eat the pasta. There was three types and none of them were appetizing in my opinion- extremely salty. Didn’t see the good rating of this restaurant reflected in my experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RMlFscDNaRzlPU0hCS1JFbENibFpMT0V0SGRtYxAB",
            "text": "Wonderful food. Tables are close. Service was good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KbE5VTktNM1pRVHpOd1VsQXdUamhJVTBScmFuYxAB",
            "text": "Love Becco for pre-theater lunch!  Always delicious!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMFNVcHNkbTVUYjFaME5FUnVja1ZVVlRSV2RFRRAB",
            "text": "This place came highly recommended by a friend and I was quite disappointed.  We tend to eat a little later than most so I was encouraged when I saw that reservations were available for as late as 9:45. We got 8:30 reservations figuring that we could have a leisurely glass of wine and do some catching up before dinner.  When I informed the waiter of our intention,  he quite briskly told us the kitchen closed at 9. After that point,  I felt he was hurrying despite there being a number of other patrons still ordering around us. We each got the featured dish of 3 pastas with different sauces that changed daily.  While the mushroom ravioli was quite good,  one of the other selections, sausage and pasta, was downright watery and the spaghetti and red sauce was just plain boring. We ended up spending $175 for the three of us (before tip) while feeling like we were being rushed out, certainly less than hospitable.  I would not go there again and would not recommend.  I would class our server as condescending and humorless. At least the food was C-"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKWVIybFNNRzR3WW1ObWJFTlBaM0ZVTjNGNmJIYxAB",
            "text": "Food was simply delicious.  Osso Bucco was best behaved ever had. Service was meh. Incredibly busy with the theater crowd."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toeGQycEthVzg0WVU5UFdrTnhRM1pHUkZGa1ltYxAB",
            "text": "I tried the three-pasta dinner special at Becco. The antipasto that came with it was delicious, and while the pastas were good (not great), the pumpkin ravioli stood out as the clear winner. I sat at the bar, where the bartender was very friendly, and ended up next to a gentleman who’s been coming here for over 20 years. It really felt like a local favorite, with lots of return customers giving the place a welcoming, neighborhood vibe.\n\nThe meat dishes I saw going by looked fantastic — I didn’t try them this time, but I suspect that’s where Becco really shines. Overall, it’s a lively and popular spot with a loyal following, worth visiting for the atmosphere and sense of community as much as the food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25STFVscEJPVUpqUmpsMk9HOHdVVE5RTkZKME1IYxAB",
            "text": "It might be the worst pasta in my life, the only good thing was the service and the restaurant looks nice, the food was awful"
        },
        {
            "date": "1달 전",
            "language": "it",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5VVVsUkVhM1I2WW5VMlRXSktjVmRxZFVoRlEwRRAB",
            "text": "Se volete mangiare italiano non venite qui. Il cibo non è italiano. Personale scortese e ci hanno fatto pagare di più di quello indicato da menu. Non torneremo mai più . Un trauma per un italiano."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOSlRWVk5SRkJsTnpVMFZXNXlaR000ZGpOMU1XYxAB",
            "text": "Great spot for me and my girlfriend. We got the all u can eat pasta - and the ravioli was amazing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5aFpXMVFkM05LYkhoamJucGlaelJGVTNOS1EyYxAB",
            "text": "A fabulous experience with superb food!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RmJYQmhaVEExTW5aMlZuQXhja0ZIV0RGNFQyYxAB",
            "text": "Becco is always amazing and one the very last spots in Ny that is always honest and good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4RVYxUlVWVlpvZEhsaGQxRlphbnBYYURWVmRWRRAB",
            "text": "My husband and I stumbled on Becco years ago and it’s become an essential stop every time we’re in New York. In August, our 4 kids went on their first trip to the city with us. We wanted them to experience Becco, of course! My kids (ages 9-17) all enjoyed their meals, especially one of my daughters who got the all you can eat pasta with seafood! The restaurant is very tight - your table is likely to be in close proximity to several others. I don’t think that is a negative, but it could be overwhelming for some folks. They have a good wine selection, but I can’t speak to it much as I always order a cab regardless of my meal. I have never made a reservation but I can imagine Becco would be crowded on popular show nights."
        },
        {
            "date": "수정일: 1달 전",
            "language": "it",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMHFyMWZnEAE",
            "text": "Sono sconcertato… mi aspettavo di mangiare bene (non dico eccezionale ma almeno bene), abbiamo preso 2 mozzarella in carrozza e 2 piatti di spaghetti al pomodoro, i condimenti delle mozzarelle erano a dir poco deludenti ( il pesto sapeva di tutto tranne che di pesto) e gli spaghetti immangiabili !!! Scotti e troppo salati a tal punto da non sentire neanche il sapore dell’aglio che era ultra abbondante… a mio personale parere da evitare !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twaVpHdzRkSGwyTFhabFQzaFlURFoxYlVoVmQzYxAB",
            "text": "The restaurant was very loud and crowded. Difficult to have a conversation. But that’s not unexpected in NYC. The food was fine. Chicken Parmesan was just the cutlet, nothing else. But my biggest complaint was that our server wasn’t nice. He was impatient with my mom who asked for clarification on the specials and just sour with us until he brought the check. There are so many specials and in our short time there I heard the server repeating them over and over. Why not print them out or post them on a board?"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOTE5EQnhMVXA1WjJjMmVYUkJlWHBDTXpGeGFWRRAB",
            "text": "Went here with my mother 10 years ago, nothing has changed. High quality, flavorful Italian staples. The back room doesn't have the best acoustics, But all the more reason to shut up and enjoy your food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRFdXaG9XVUY2YUhaYVdsbElNVzVJZFhReGFXYxAB",
            "text": "We dined at Becco tonight to celebrate my birthday, excited after years of watching MasterChef and eager to finally try one of Joe Bastianich’s restaurants. Perhaps I had built it up too much in my head, but the experience didn’t quite meet the expectations I had hoped for.\n\nThe dining room was crowded and noisy, and we were seated at a very small two-top that made the meal feel like a game of Tetris with plates, glasses, and baskets competing for space.\n\nWe started with the antipasto plate, which felt more like a mishmash than a curated appetizer — undercooked vegetables, some beans, a lone cube of cheese, and a few other odds and ends that didn’t come together as a cohesive dish. Since I didn’t want fish, I was brought some whipped ricotta with honey and a bowl of peas. Not really sure how that made sense.\n\nFor our mains, we both ordered the popular three-pasta special — pumpkin ravioli, penne vodka with shrimp, and spaghetti with garlic, olive oil, and broccoli. The pastas are brought table-side, though the presentation felt more rushed than refined, with pots carried over and portions simply scooped onto plates.\n\nThe food itself was a mixed experience. The pumpkin ravioli was the highlight — flavorful and comforting, though the sauce leaned a bit oily. I appreciated that the waiter accommodated me with penne vodka without shrimp, which was thoughtful. Unfortunately, the spaghetti was undercooked and clumped together, which made it hard to enjoy.\n\nThe biggest issue of the evening was our seating location directly under an air-conditioning vent. Between conversation and bites, my entire plate of food became cold before I could finish it — disappointing for a celebratory meal. I packed up my ravioli to go and the rest was  tossed in the trash.\n\nOverall, while Becco has its charm and history, the experience tonight felt more rushed and less polished than expected for such a highly regarded restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4a09UaHdWWGxCUlRGSFRVWk1RVjl3VmtreWJXYxAB",
            "text": "Very nice. The ribeye was one of the best I've ever had - it is absolutely ginormous!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxelVUaE9WRWxSUzFwRlJHMW1iR3hLVW5aYVYwRRAB",
            "text": "Becco’s signature pasta trio was absolutely amazing—fresh, flavorful, and perfectly cooked. Service was great and the overall dining experience was enjoyable. That said, the back of the restaurant felt a bit stuffy with limited airflow, making the atmosphere less comfortable. With some improvement to ventilation, this would be an easy 5-star spot."
        },
        {
            "date": "1달 전",
            "language": "it",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kb1FXVlNPWEZ4Y0V4TWVtUmhUREZGY0hSTU1HYxAB",
            "text": "Questo locale si definisce \"ristorante italiano\", ma di italiano non ha assolutamente nulla. Nessuno dello staff parlava italiano né sembrava comprendere il menu scritto in italiano, il che è già un pessimo segnale.\nI tavoli erano strettissimi, praticamente incollati l’uno all’altro, senza alcuna privacy. La tovaglia era sporca, con residui di cibo visibili al nostro arrivo — un dettaglio che da solo basterebbe a farci alzare e andare via.\nIl menù è una parodia della cucina italiana: piatti che mescolano tipologie di pasta diverse nello stesso piatto, cozze servite completamente fredde, e una lasagna vista sul tavolo accanto che era un insulto alla tradizione culinaria italiana.\n\nAbbiamo ordinato due antipasti e una bottiglia d’acqua e abbiamo pagato 44 dollari. Un prezzo assurdo per un’esperienza deludente sotto ogni punto di vista.\n\nInaccettabile che questo posto si definisca italiano. È vergognoso che la nostra cucina venga rappresentata in modo così superficiale e irrispettoso.\n\nAggiungo che la pasta viene servita con modalità all you can eat, tutta nello stesso piatto."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WeE1HaEtjMmhmZVMxNlIwRjJaM2RCTm1rMk0xRRAB",
            "text": "Perfect for a dinner and show night. The paste symphony is excellent and reasonably priced. Service is friendly and efficient. We have been here several times and Becco never disappoints."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiM0pMQ3BBRRAB",
            "text": "Great food. Becco Never disappoints"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4M1VFRm9ZakJKYW1sNWVGUkhURWhhTm1WVmMxRRAB",
            "text": "Warm festive but intimate atmosphere. Phenomenal tasting dishes. Highly recommended."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKRGVVODVTV0ZSUVUxMGRIRkdZWGhQVjFCallVRRAB",
            "text": "The atmosphere is very pleasant, the service is wonderful, and they're always attentive to your needs. The food is excellent; I loved the focaccia and the vodka pasta. I just think they should put on some background music, since when you're there, all you can hear are the other people in the restaurant."
        },
        {
            "date": "1달 전",
            "language": "it",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSVprWk5OVk53T1hjNFNVZERNblJGT1VGQ1pVRRAB",
            "text": "Si fanno forti per il nome ma il cibo è veramente ordinario. Il costo è sproporzionato rispetto alla qualità"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6M0xhaFh3EAE",
            "text": "This place is excellent! I came here because I heard it was Joe's mom's restaurant from Master Chef so I wanted to check it out. I was not disappointed.  I had the Osso Bucco and the all you can eat pasta is absolutely amazingly delicious as well, come eat get full and be happy!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNM2RVZEZkRGwxVUhWUk5EaENSMUJvUmpKclRuYxAB",
            "text": "We have been going to Becco for over 20 years. It’s always our first choice when we go to Broadway. Food always incredible!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cd01tMW5lakY2TWtsZk5qZDFjSGRQY1dKWGRIYxAB",
            "text": "This restaurant was recommended to me on my recent trip to New York, and it didn’t disappoint! With 3 delicious pastas on offer each day served to your table as many times as you’d like, I definitely left Beccos full and satisfied! The cheesecake for dessert was also fantastic.\n\nThe atmosphere was also wonderful, with a skylight letting in plenty of natural light to the dining area. The staff were friendly and the food was quick due to the pasta being served to your table which was perfect for eating pre-theatre."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiOXRMWmdBRRAB",
            "text": "근처에 있다가 운 좋게 찾은 곳인데 정말 맛있었던 곳입니다. 파스타가 진하고 정말 맛있어요."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHd2RTbk13EAE",
            "text": "분위기는 좋았는가 3.5\n가격은 적당했는가 4.5\n직원들은 친절했는가 4\n양은 충분했는가 5\n맛은 있었는가 3.5\n\n맛있진 않던데.."
        },
        {
            "date": "수정일: 6년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNndnJIbTJ3RRAB",
            "text": "양이 많지만 한국인 입맛에는 맛이 훌륭한 정도는 아닙니다"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwdWNqekxREAE",
            "text": "무한리필 파스타. 가성비도 훌륭함."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNva0oySFlREAE",
            "text": "스파게티 맛있는곳"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOb2IxbGlWV0V0YTBzNGJ6SXdiMkpDZEZwelMzYxAB",
            "text": "Quaint restaurant with great food, service and atmosphere. Came here after seeing a musical and it didn’t disappoint. Their unlimited pasta was excellent with three different choices that change daily, all three were delicious! Their lasagna was very good and a great portion. Their fried mozzarella was so different than what we’ve had before but excellent and Lidia’s Gamberi (baked shrimp) were great! Definitely go check it out! Theirs dessert doesn’t disappoint either!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Jd04zWlpaWHBFUzNCdVlVRlBWRXRRVVZkNE9XYxAB",
            "text": "Lovely restaurant with great atmosphere. The antipasto was nice and risotto was delicious but I felt the pasta on sinfonia di paste was mid. Dishes other patrons were eating looked good and wish we had the chance to try more."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21veVpURTFXaTAwY0hKQlNGcFlVRjloVDJaWVNWRRAB",
            "text": "Becco is one of my favorite spots in the city! The atmosphere is warm and inviting, and the service is always attentive without being overbearing. Their famous pasta tasting is a must-try!!! Fresh, flavorful, and perfectly portioned. The wine list is excellent as well, with great options at reasonable prices. Every time I come here, I leave happy and satisfied. Highly recommend Becco for a delicious Italian experience in NYC!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJakpfajlnRRAB",
            "text": "Antonio’s service was a breath of fresh air after recent dining experiences. Our table all ordered the prefix unlimited pasta and salad. Absolutely delicious options! All great pasta. We couldn’t decide on a dessert so ordered 2 of the sharing plates which was definitely the right choice! We all had different favorites but were too full of the delicious pasta to have our own. Antonio finished the night with a complimentary round of limoncello — the perfect ending to a one of my favorite meals in a long time.\n\nFriendly service, great food and a quaint atmosphere it’ll be hard to beat Becco for an authentic Italian night out in Hell’s Kitchen."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMF8tYVNBEAE",
            "text": "Becco was a delicious meal before a Broadway show. The food was all outstanding - from the complimentary olives, bread, and compound butter to the antipasto misto. The chicken parm was one of the best I’ve ever had. And the ricotta cheesecake was heavenly. The server was attentive but much more friendly with other tables than he was mine. I would like to come back for the never ending table side pasta - very interesting for a higher end restaurant."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZb291X1JBEAE",
            "text": "Becco is a great place to stop by for a pre-Broadway show/theatre dinner. They move fast knowing people want to make it to their shows. The food is good and they provide very large portions. Easily shareable plus the entrees come with a great Caesar salad! And it’s great value for NYC. Environment can definitely get a bit loud depending where you sit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNTdIdzZ3RRAB",
            "text": "I was so excited to eat here because I’m a big Lidia fan, and it did not disappoint! I knew she would hold her restaurant to a standard.\nMy veal with capers and lemon sauce were delicious. I also got the pasta trio added on. The gnocchi was the best I have ever had. It melted in my mouth, and I’m sure it’s homemade. Serving sizes were generous.  We had a reservation made for shortly after they opened. When we walked in the door, the executive chef I believe, even said hello to us. We were seated promptly and service was excellent!\nI do not understand any negative review of this establishment! I’m from the Chicago area and next time I’m in New York, I would definitely come again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4SFJTMTFPREY0WkcxdU9FMXpUVFJJTFZSWWJVRRAB",
            "text": "Restaurant Row has only one culinary queen and that's Lydia Bastianich! Becco is the elevated Italian American dining experience that reliably delivers for thousands of locals and NYC visitors every day. We've lived in the area for 17 years. And even with NYCs abundance of contenders and pretenders, Becco has stayed at the top of our list. Friendly, always ready to seat us even without a reservation. All our favorite diaspora dishes prepared using the classic globally recognized Italian American recipes (here in NYC we have over a century of our immigrant preparations and we will take no lectures on \"authenticity\".  Gimme that veal parmigiana!).  Staff is always on their game. White tablecloths, bread to die for, never a plate left behind, great wine pours, constant attention, you'll never want for anything. And if somehow they miss just say the word and it's fixed. You'll be fed like family and feel like it too. Come eat!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2ak5MT1lnEAE",
            "text": "The restaurant is beautiful, went during Christmas time and it was all decorated. Service was good but let’s talk about the food. I got the chicken parmigiana and it was delicious and the sauce was one of the best sauces I have ever had. The chicken was delicious and mozzarella delicious. My wife had the a Seabass and she liked the fish, she thought it was a little dry and requested medium. But once she got to the end she found a gross curly hair and trust me it’s not her’s she’s got an expensive keratin treatment(hair pin straight)\nYes they took care of us and it was taken off the bill. But we would still give it a second chance. I love Lidia Bastianich, so I will go back again!\nDessert was delicious no complaints about that."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNk4yWkZnEAE",
            "text": "This is a great place for a delicious dinner before a play or for carb-loading! I was preparing for a half marathon the next day and was carefully planning my carb intake. I discovered Beco's \"Sinfonia de Pasta,\" which offers unlimited pasta for under $40, including three types of pasta and one antipasto. It sounded like a fantastic deal, so we decided to give it a try.\n\nWe arrived a few minutes before the dinner shift started, and since we had no reservation, we were seated immediately. The service was quick, even though the place was extremely crowded. The staff was very friendly and attentive, ensuring that no detail was overlooked.\n\nI ordered the Caesar salad, while my husband opted for the antipasto misto. Both dishes were good and plentiful, but the antipasto was definitely the standout due to its variety.\n\nAs for the pasta, we tried penne alla vodka, linguini with asparagus pesto, and mushroom ravioli. The texture of the pasta was perfect, but I felt that the sauces could have been more flavorful. Nevertheless, it remains a great deal for the price we paid."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SdGRrMDRia1Z0WjFCb1FUZDZTbUZTUlhaM1VVRRAB",
            "text": "Very fun atmosphere with a traditional feel, along the charming restaurant row of 46th Street. The food itself was pretty good, although there was a strong sage flavor in the polenta of my banger steak that did not go well. They changed from a few years ago, and you can only have their set three pasta dishes of the day rather than your choice. That was fine, as all three that my partner had were good. There's a good dessert selection and Zabaglione!\n\nI would not recommend this place for a romantic or cozy night out. The service is brusque, focused on getting diners out quickly (presumably so they can make a Broadway show), but it also means that we were handled pretty gruffly. It was fun, but for the price point I probably won't go back regularly."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3ajhLTXhBRRAB",
            "text": "We never get anything but the sinfonia di paste. If you’re a pasta lover, it’s the only logical choice. Check the daily menu online before you go so you can see what the 3 daily pasta selections are. One tip: if you’re all ordering the sinfonia di paste, ask the waiter to split the appetizers between the Caesar and antipasti platter. That way everyone gets a bit of both. We always roll out of there overfilled - totally worth it!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdzdhSENREAE",
            "text": "Always an amazing meal. The food , wine selection and staff are wonderful.\nBecco is consistently fantastic! 10!stars\nGrazie Mille 🇮🇹🍷\nAnother fantastic dinner at Becco. The stuffed peppers and pork chops are amazing. Thank you all again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ME5LdV9BRRAB",
            "text": "Our favorite place to get Italian food in NYC.  The daily, freshly made trio of pastas are always tender and delicious. Ravioli flavors are creative.  All the wines are $40 per bottle. 🍷Service is prompt and attentive. Try to save room for dessert, the apple strudel with house made cinnamon gelati is ridiculously amazing! We also love the parmigiana di pollo, costelleta di vitello alla Joe (veal chop)  and the calamari friti. Highly recommend!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnaXF5bmR3EAE",
            "text": "I've been there twice and have only gotten the all you can eat pasta. Its not a buffet. Its all you can eat fresh pasta. Servers come around with 3 pasta dishes that are mad fresh and put it in your plate.  I think the reason this is done because you can be in and out quickly if you have a show which is a great idea.\n\nThe pasta comes with a ceasar salad or grilled veggies. Great choice."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGZmRVMXhPWGxyVlhOWVl5MDNTR3BPTVVsVFYyYxAB",
            "text": "Great pasta - I can absolutely recommend the Sinfonia di Paste (3 choices of the day, all you can eat). Every single one was great. Service was quick and nice. Price good for what you get."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NzZPcVRBEAE",
            "text": "Loved the pasta! They had truffle ravioli, clam linguine, and red pasta. They also had a whole page of wine bottles $40 each. They come around with pans of pasta to refill. Would love to come back and bring friends or family here"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmM1BDWjJ3RRAB",
            "text": "Excellent food, good service, and overcrowded. Went on a Friday night pre-shows and it was extremely crowded. The tables are fairly small and you will rub shoulders with the person sitting next to you so consider the seating very family style. In order for several of us in our party to get out of our chairs, the service staff needed to move tables to do so. With it being a confined space, it was overwhelmingly noisy as well so for a sit-down restaurant be prepared for a lot of stimulation. The pasta is great but their daily specials are mass-produced so they're not as fresh as made-to-order entrees. Again, overall a good experience, we just weren't as prepared for the environment as we previously had thought. We probably would choose a different place in the future for a more relaxed and quieter vibe."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQbHQyMkpREAE",
            "text": "We really enjoyed our experience at this large Theatre District Italian. Although the restaurant was packed it was clear that the staff/servers were used to it and still could easily provide fine service. We started with fried calamari, tuna tartar and shrimp with a spicy sauce. All received thumbs up especially the calamari. The mains of branzino, veal piccata and the soup of the day equally received high praise. We all looked forward to dessert and we were not disappointed. The panna cotta and the cheesecake were light and tasty. Make sure to make a reservation at this Restaurant Row favorite."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzX19qTUpnEAE",
            "text": "Had a lovely dinner at Becco! We ordered the chicken Milanese and pork chops, accompanied by a bottle of Sauvignon Blanc. The food was delicious and came out quickly, which we really appreciated. Our waiter was attentive and made sure we had everything we needed. For dessert, we enjoyed the cannolis and cappuccinos, which were a perfect way to end the meal. The only downside was the noise level – it was very loud, making it hard to hear each other at the table. Overall, great food and service, just be prepared for a lively atmosphere!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRb09PUExBEAE",
            "text": "The trio of pastas was delicious and a great value.  Every bite was incredible from the first olive to a great cappuccino. The service was also wonderful and efficient. Ended up having four courses in just under two hours with attention paid to make sure we made it to the theater on time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIcHNfazJRRRAB",
            "text": "This is a great restaurant that is actually much bigger than it looks.  2 floors of dining area to accommodate plenty of guests.   Nice staff.  Clean facilities.  Daily specials.   The star is the all you can eat pasta option.   James Andrews reviewed this place and really liked the all you can eat pastas.   Card payments are accepted.   Highly recommended.   We will definitely be going back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMOTltdXFnRRAB",
            "text": "Thought we would try Becco after hearing good things as it was my first time in NYC. We were a bit let down, by a couple of things. The restaurant is tight and small so every inch is utilized for seating. It is extremely loud in the restaurant and being seated very close to others, you can appreciate why. The waiter was very charming at the start, providing his rehearsed introduction. The start of the night and the end of the night was the only time we ever saw him. I had to ask one of the poor servers for parmesan, after waiting for what felt like an eternity. We choose the pasta special though now I feel like maybe we should have tried the separate main dishes. The pasta was good but took awhile for refills to occur, I feel like a better system for this ultimate pasta is big gimmick to get you into the restaurant. The pasta tasted great and I enjoyed the mushroom ravioli, and rigatoni with shrimp a la vodka. The Pesto was just okay, I feel like the pasta was off, not cooked just right. My sister said it tasted it felt doughy. I expected more from a Bastianich owned restaurant but I feel it fell short of my expectations. Also I echo the same sentiment about how they prepopulate the gratuity on the bill. I would have loved to have had the choice to provide a tip based on the level of service provided. I definitely skip this place next time I'm in town."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURmblpKRBAB",
            "text": "Becco continues to be one of the most reliable goto Italian restaurants in the theater district. We came with a party of 4 and we all ordered the exact same thing: the pasta sampler with Cesar salad. And we all went for the vegetarian version which included three all you can eat pastas, the best one being the ravioli. You need a reservation pre-theater, but not normally after 7."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnLVBIdzZBRRAB",
            "text": "Everything we ate here was absolutely amazing and had big portions sizes and we left stuffed. They start you off with some bread and olives. We started off with CALAMARI FRITTI with spicy tomato sauce. They also serve everyone a Caesar salad. Then our main course I got the SINFONIA DI PASTE which that are known for. Every day it’s three different pastas today they served FETTUCCINE with Short Rib Ragu, Spinach RAVIOLI with Marjoram Butter, & MEZZI RIGATONI with Tomato and Fresh Basil. That all were so good I was only able to eat two plates worth of pasta. My sone got their PARMIGIANA DI POLLO which was the size of the entire plate. He said the mozzarella was so good on it. My wife got their ZUPPA DI PESCE MISTO, which had a good amount of seafood on it including the fish of the day Halibut. Then we dinged with their CHOCOLATE BROWNIE SUNDAE. Everything was delicious and it was fairly priced too."
        },
        {
            "date": "수정일: 1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6cHNIa3p3RRAB",
            "text": "Assaggiare la vera cucina italiana nel cuore di New York, a Hells Kitchen è sempre una bella esperienza. Abbiamo apprezzato l’antipasto di asparagi e uova e poi gli assaggi di pasta. le porzioni sono molto abbondanti. La pasta viene servita…"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcU5tMS1RRRAB",
            "text": "I had a meal made up of appetizers only. Their appetizer size portion of mussels ($14) I found to be delicious. Their meatballs appetizer ($16), made up of three large size ones, had little flavor, only the tomato sauce was readily distinguishable. I have included a couple of photos of the back dining area. Seen in one of the photos below is a picture showing a small area of the ceiling having glass covered sky lighting."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3eEphcTVnRRAB",
            "text": "BECCO IS My Favorite Italian Restaurant in NYC\n\nThis particular Friday we went to enJOY the Lobster Fra Diavolo. Chef Billy did not disappoint, it was Fantabulous!\n\nThe specials of the day are the way to go and the light seasoned/breading on the fish was amazing\n\nThe shrimp appetizer and the Sinfonia di Paste mid-course were all perfect complements to our specials\n\nMake a reservation EARLY on OpenTable an experience BECCO where Lidia Bastianich's recipes come to Life under the direction of Chef William Gallagher and a most Welcoming & Professional Staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNic3FhUi1nRRAB",
            "text": "Great selections on the menu. It was hard for me to choose. I had the three meat lasagna and not only was the portion generous but it was delicious.\nOur waiter was top notch. Attentive , polite, prompt and he had great knowledge of the menu.\nBig thumbs up for Becco."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyN04zazJRRRAB",
            "text": "Fresh pasta fast. They also have a menu of wine bottles for $40, all solid choices and selection. For the price and portions, you really can't beat it in NYC. Service was very attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUMGFiam9BRRAB",
            "text": "I came here 10 years ago with colleagues during a work trip. As a relatively sheltered southerner, I felt like I had unlocked a NYC locals-only cheat code. I was scared to come back, with the threats of my experiences + the pandemic popping my mental balloon of Becco glory. It was everything I remembered. A packed house, Friday night, close quarters and small tables, but if that bothers you, you forget as soon as those crispy bread sticks, Tuscan bean hummus and marinated olives arrive. Pictured are antipasti and Caesar salads, chicken Parm and pasta trio. The pasta is so fresh and the flavors are perfect. On this occasion, we ordered meatballs that never came (and weren't on the bill). The small rooms and low ceilings make it a little hard to hear, so that could be the reason, and we were so full, it was for the best. I have no idea if there's a Michelin rating, but the little statue was cute regardless. Thanks to the restaurant gods for keeping this gem in good health!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuc0pqSW1nRRAB",
            "text": "We came for an early dinner after seeing a Broadway show. Our sever and the rest  of the staff were excellent.   I had the lemon chicken and my husband had the salmon. He loved his salmon. The sauce on my chicken was delicious. The chicken was little tough,I would  enjoy that same  sauce with a lightly pounded chicken breast. The garlic mashed were delicious. All entrees come with generous portion of Cesear salad which was delicious. They also serve bread which so many places do not. I will come back. We didn’t have dessert but it looked great. I didn’t give 5  stars for atmosphere bc they sat a table next to us which was so close that we seemed like we were together. Luckily the other party asked to be moved. I’m looking forward to going back."
        }
    ],
    "reviews_count": 87
}