{
    "name": "Cookshop",
    "place_id": "ChIJZ-_BPZRZwokRBp_dcoCezqQ",
    "grid": "MN4",
    "address": "156 10th Ave, New York, NY 10011, USA",
    "rating": 4.5,
    "user_ratings_total": 3049,
    "phone_number": "(212) 924-4440",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNGJISTBRbUp4ZG00elVuZDBYM2RCVVZvNWNXYxAB",
            "text": "Nice spot for brunch."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMVNGSnZhV2RoY2xWVVkxbzVjRGRXV0VZM1dXYxAB",
            "text": "Best food I've had since ONeals."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTmFFVTJOa1l0YzFSRFExTlVSVkpTVTAxT04xRRAB",
            "text": "Food was great, chicken crispy, half the table had tuna melts."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GcVN6bHRkRmRFUmsxc1prVTNlVXhZVlhWelYzYxAB",
            "text": "The waiter so good his name is Alfredo"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWVQxQmFXVGxqTUdOQmJqTlRkRjgzUW1velNVRRAB",
            "text": "Loved the atmosphere! Food was delicious!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0aFZHVnRibkJUZEdORmJVMUplRU5KYlY5d1ozYxAB",
            "text": "Nice appetizers , Squid salad very tasty."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sWlJsRklOVWREVUZwVFNWTllSakp1VkZNd1dXYxAB",
            "text": "Greta service and food always"
        },
        {
            "date": "2주 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKZmRuTmZWRVp0UWtJNFJIaFBUbFJhY0dWM1NVRRAB",
            "text": "Tutto buono e servizio ottimo"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kNldrNXdkak5MVG5rek9URTVNVTlUVjFZMVUyYxAB",
            "text": "Bret was an AMAZING server! The food was delicious and the green juice to start and the chi to finish!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jelpURjVUMGxtTFhSc1VWZFVhVWd5YWxwV1RVRRAB",
            "text": "Just had an awesome dinner here. While everything was great, the French fries stole the show of all things. And then the dark chocolate sorbet maybe tied. Also had the chills half lobster (as an app) and the Casarecce pasta. This wasn’t my first time here but it was my first time in a while that I’ve enjoyed French fries so much."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0VFVub3RMVEF3TUhkT2N5MDNlakZYWDJSRVdtYxAB",
            "text": "Great. Clean Fresh. Helpful staff! Sal, Diana, Brett plus others. Great teamwork.Loved the farm to table aspect. Outstanding overall."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGck1pMUNkM0JzU3pCbk1tUkZZVGRQV205eGNuYxAB",
            "text": "Super"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCaFlrZFJaRlUwVkZWUk5VbEdaekEwTlU1ZlZrRRAB",
            "text": "The atmosphere, staff and food are superb!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205cldHTlJjazB3ZURsQ00zVkNhbGhLYUdadVRXYxAB",
            "text": "Everything was delicious but the portions are not big.  Excellent service"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0MFZ6TmZZMFpJYTNGTWVrOXpOblpFYUVkNk9WRRAB",
            "text": "Nice place delicious meal"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSTlNVUjVhVlJpYjA5eWFEaHJOSGRxZUhWU2JWRRAB",
            "text": "Brunch is always yummy and good service! We’ve been coming here since they’ve opened"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taU2NVaE1helpqUmpaRFVubDZiM1V4T1hjelJFRRAB",
            "text": "I love this place"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OclprRkdYM0pyTUU5RlkwUXdOVTVYWVVvd1QzYxAB",
            "text": "Incredible chicken breast!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJemRGTllPRVY0VUVzMFdsbElObXRSUm1oNk9GRRAB",
            "text": "Great food! Good Bartender. Definitely a spot to stop."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21odlJISmllbXRKUXpVMlQzaDBiMFpDZFZaM1YwRRAB",
            "text": "Always the best!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WZlpIazFPVTl4ZVZZMmJESXliMlpmU1Vwb2VuYxAB",
            "text": "Alfredo was wonderful and very attentive and kind. We love cookshop and come regularly. Thank you Alfredo for another great experience here!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kRk9Ia3lSRmhLT0MxdFQwTTBWek5TVGkwM1oyYxAB",
            "text": "Marvelous"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sRGJXSjBSek5qYm1adVpWYzJkWFY1VEVKSFFXYxAB",
            "text": "We loved Alfredo our server thank you!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twelFYaEphRTUwYmxaeVpqUjNUbWxEWjFBNWRtYxAB",
            "text": "Just drinks, tempura vegetables & chicken liver mousse.  All very good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jelNFSktMVGg0V1dSTVZXOUNabUp1YzBwMWIyYxAB",
            "text": "Excellent food.\n\nI’ve lived in nyc most of my life and I swear, I’ve never had a good burger until I tried this one. It was sooooo good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4M04xUnNlR2h0Um5WUk5uRm9kV2hJV25OeVdIYxAB",
            "text": "So good!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5VmFrODRlRzVEVDNCVFptNHlWa05UV0RkUFdFRRAB",
            "text": "Baked goods here are great, especially their bread. Appreciated that they could do a “make your own breakfast” with scrambled eggs just the way I like them. Overall good spot for breakfast or brunch!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4eVMwNWhiREZ3ZEZkdVZEWkRYMmt3TUdGRlUxRRAB",
            "text": "We just had Sunday brunch at Cookshop, and it was such a great experience. The food was delicious  (the buttermilk cornmeal pancakes were a solid 9/10, and the egg sandwich with bacon was a definite 10/10). We also tried the turmeric tonic (refreshing and anti-inflammatory) and a green juice, both really good. My only small wish is that the juices came in larger glasses instead of the smaller cocktail style ones.\n\nBut the real reason I’m writing this review is because of our server, Kwesi (hopefully I’m spelling that right, but her was the light skin black man). He was outstanding. His energy, warmth, and soft approach immediately stood out. It was the kind of demeanor that makes you feel taken care of without it being forced. We even asked why he didn’t introduce himself, and he explained that it’s not Cookshop’s policy, but honestly, that didn’t matter. His service spoke volumes.\n\nHe struck the perfect balance of keeping things casual while still being attentive, personable, and skillful with his upselling. Even another couple sitting nearby chimed in to say they completely agreed with how excellent his service was. If I could have tipped him double, I would have.\n\nKwesi is hands down one of the best servers I’ve encountered — not just in New York, but anywhere. The food was great, the vibe was fun, but if I come back to Cookshop, it will be because of the phenomenal service he provided. He should truly be considered the standard for what service looks like in the hospitality field."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNM2FtbFJVekZNWVVwRVRETjVXVkIzWVRKVlNVRRAB",
            "text": "I always pass this place on my way from the gym and been dying to try it. It's amazing!!!  Christian was so great and accommodating. Food was awesome and drinks were on point. Will definitely be back!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOaVZpMVBWR1o0VGkxSWRsZFFYMnRoTjFWUmVFRRAB",
            "text": "Cookshop in Chelsea is a great spot for brunch. The food was awesome. The huevos rancheros were some of the best we’ve ever had. I got the falafel pita, which was super tasty and a fun surprise to see on a brunch menu. The place was packed, so we had to grab seats at the bar. Definitely recommend making a reservation. The staff was really friendly and on top of everything. The menu looks kind of simple at first, but everything that came out of the kitchen looked amazing, and what we had was seriously delicious. Also a solid choice if you’re going with a big group."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NNVIyWnJkVnBVWjFSdVRsRnJTVVp1VG1KSWRHYxAB",
            "text": "Mediocre food, my dining companions and I didn't enjoy our meals. Service was well-meaning but intrusive and clumsy. Pleasant atmosphere, not too noisy."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0VGJqbG5ZMkpLVEdoUmJsVkpPR2RFWTNsbFRXYxAB",
            "text": "I NEED to come back here"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocHFDTkRBEAE",
            "text": "저녁시간에 예약없이 방문 가능 합니다. 음식의 양은 일반 음식점들 보다는 (살짝) 적게 느껴지고 파인 다이닝 한 접시 보다는 (무지) 많았습니다. 포만감을 느끼시려면 사이드/에피타이져를 시켜도 좋을 듯 합니다. 음식 맛도 적당했습니다. 제가 방문 했을 당시 메뉴판에 판매일부금액을 어려운 이웃 사회에 환원한다는 문구가 있었고 이 외 많은 인테리어들이 디테일이 있는 음식점이라고 느꼈습니다. 내/외부 장소 모두 분위기가 좋으니 한 번 들려보시길 추천 드립니다."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbXNuWWxBRRAB",
            "text": "밝고 경쾌하지만 복잡하지 않아서 좋았다. 직원도 친절했고 음식맛도 좋아서 다음에 다시 갈 예정이다."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xdFMxVnROWEZ4UTB4RGEwMVlhV050WWtaSFdXYxAB",
            "text": "Went on a special date night. Couldn’t have asked for a better evening. First thing we noticed was the professional service right off the bat. Relaxed atmosphere and cozy dining area. The service continued to be top notch. Decent service is always nice but excellent service can really make a night feel special and it did.\n\nWe have the stuffed squash blossoms, beefsteak tomatoes, scallops, pizza, liver mousse and three deserts. Don’t judge me!\n\nI really appreciated things coming out being thoughtfully timed. Especially when ordering that much food it was nice not to worry things were going cold.\n\nI had already heard from multiple people this place was it and they weren’t lying! We were able to get a table because we went early (5) but I definitely recommend reservations."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201MFNtVlZkVkpaZDJWS2EzUnVaSEJKTFdKMFRHYxAB",
            "text": "Cookshop has a great menu with plenty of variety! Great appetizers and main dishes. I personally had the center-cut pork chop… and it was one of the best pork chops I’ve had in a while. And equally good, I had the heirloom tomato salad.\n\nWhile the service lacked in speed… the food made up for it. Will be back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VdGVVZG9PVUp1U2w5YVNITktRMnh6WVROR2FHYxAB",
            "text": "Not complaints on the food or service. Everything was fresh and the waiter was attentive. A bit loud indoors so we sat outside and enjoyed the sun. Cute neighborhood brunch spot"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taamRHcHVSR1JFWm1oamNXaE5aR2RCTFhwNWRtYxAB",
            "text": "Cookshop in Chelsea was such a standout. The vibe is lively but easy, with a steady energy that feels both local and special. From the moment we walked in, Madison and Pierce at the front welcomed us with warmth and genuine kindness. They set the tone for the rest of the night.\n\nEdwin was fantastic with his recommendations, and Chef Luis came out personally to adjust my salad after I mentioned craving something like a Caesar. That level of attention is rare and made the whole experience feel personal and thoughtful.\n\nThe focaccia with whipped ricotta was pillowy, warm, and perfectly salted. I absolutely loved the little gem lettuces and the grilled chicken breast, which was simple, juicy, and full of flavor. The corn was a big hit, and the roasted cauliflower was deeply caramelized and comforting. I didn’t love the tomato-braised Romano beans—they were a bit oily—and without me even asking, they took them off the bill. That gesture alone speaks volumes about the care this team puts into hospitality.\n\nI also asked for a surprise round of sauces, and they delivered a fun, creative little selection. Everyone we interacted with had a smile, and the whole evening felt easy and special. Cookshop is a place I’ll absolutely return to."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNN09uOGJja29qbVl3EAE",
            "text": "Place served up delicious, unique food options.  Every item I ate was delicious.  Food came out very quickly, and prices were reasonable for eating in NYC.  I'd definitely return to sample more of the menu."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOEk2VmNBEAE",
            "text": "Amazing food, perfectly cooked and all taste incredibly fresh and well sourced. They also serve a warm and trendy vibe inside, with plenty of seats outside too for warmer nights.\n\nWe ordered these incredible dishes over a three course meal:\n🔥 Artichoke starters\n🧆 Short rib terrine\n🔥 Half chicken roast (!!!)\n🍔 Burger\n🍰 Chocolate Cake\n🧀 Firm goats cheese\n\nThe chicken was probably one of the juiciest, most tender and succulent roast chicken I have had in a very long time."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPeWd2cEdiN09pZy1RRRAB",
            "text": "No complaint from us. Walked straight in off the plane without a reservation to a warm NY reception, great food (oysters, salad and omelette) and lovely variations of a Bloody Mary. Good value too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYX3JTa3dnRRAB",
            "text": "Fresh food, excellent service, and dog friendly 😊\n\nGrabbed a quick dinner on a Thursday with a friend who has a service animal 🦮 and would definitely recommend.\n\nWe got a salad, a burger, and a pasta which were all very good. If you are looking for a simple fresh salad I recommend the little gem lettuce, it was simply delicious.\n\nThe server must’ve realized that we were sharing and served the burger cut in half and the fries separately. It was such a simple but appreciated thoughtfulness 🥹"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKM1dWUjNVV1pKZFZaaVVFVmxlVjlaU2tOMGNXYxAB",
            "text": "Recommended restaurant near the high line, delicious dishes with fresh ingredients. Good service and atmosphere."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRaTVYbDh3RRAB",
            "text": "Dropped by a few times now, never been disappointed! Good food and good vibes. They also open pretty late so you can get a pretty good feed even if you're out later in the evening.\n\nTheir burgers are good, roast chicken is very moist and well cooked and if you're looking for a side, their roasted brussel sprouts are pretty tasty too. You'll definitely walk out full!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnOW9lSHhRRRAB",
            "text": "I visited this spot with my boyfriend in November 2024, and we had an amazing dinner experience. The restaurant has a warm and inviting atmosphere, with a clean interior and a cozy vibe. We walked in without a reservation and were told there would be a 25-30 minute wait, but we were seated in under 15 minutes, at most, on their heated outdoor patio. Still, it’s a good idea to make a reservation, as the place got pretty busy later on.\nThe menu is seasonal, so it changes to feature fresh ingredients based on the time of year.\nWe shared a few appetizers to start:\n- The Savoy spinach was super fresh and had a nice balance of flavors.\n- The grilled Carolina shrimp cocktail was cooked perfectly, with just the right seasoning.\nFor our mains:\nI went with the Cookshop Burger, cooked medium rare, served with pickles, onions, and crispy fries. It was juicy and packed with flavor—definitely worth trying. My boyfriend had the fish, and he was very happy with his choice.\nWe were satisfied with the portion sizes and had just enough room for dessert.\nDessert:\n- We opted for the apple crisp, which had a delicious pecan streusel topping and a scoop of creamy vanilla ice cream. The warm, crunchy topping paired perfectly with the soft apples, and the ice cream brought everything together nicely.\n\nOverall, the food was delicious, and the wine was excellent! We cleaned all our plates.\n\nThe service was attentive and friendly. Prices were reasonable for the area, and we left feeling completely satisfied. We’ll definitely be back to try their brunch options!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TVpEQkJhREp5UzJSU1pYUkZOalUxVUdOaGNuYxAB",
            "text": "the hand soap actually smells good.\ndad said that rainbows everywhere was the \"best gay beer i've had yet\"\nexpensive but it's nyc so to be expected.\ngreat options without gluten, but no gluten-free substitutes"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbDZDOV9RRRAB",
            "text": "The place was crowded with a great energy. We ordered several dishes and all of them were good. The portions are small so it may take a couple of dishes to feel full.  I recommend the marinated fruit salad and scallop dinner."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSdGJHNXhkMmxITlhObGFWOUVYM0pWUlRST2JYYxAB",
            "text": "Nice enough, not appealing enough to return but can’t fault them with anything. Has the Huevos Rancheros. Good but not enough for a repeat. Service was very attentive."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlbVBPREFREAE",
            "text": "Very true American place. It's been around for several years she survived the pandemic. The food is good and since they expanded with the outdoor service it's super nice most of all the good is regionally sourced which is nice. The burger was good and french fries 🍟 we're amazing. The side of smoked bacon 🥓 was fantastic. The local hard cider was nice and refreshing. We had the brunch but we heard dinner is better. We will be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQYVYwOEhzbFo3MVRREAE",
            "text": "Neighborhood staple for great cocktails, food and ambiance.  Always a classy spot.  The burger, half chicken, crispy potatoes, and rotating pizza are always winners."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaOTdYUm13RRAB",
            "text": "Good brunch spot by the highline. Outdoor seating option but you might have to wait extra on a nice day. Food is fresh and good but not very cheap. The pulled pork croquettes were over spicy and not very tasty. The hash potatoes were also too spicy. Portions are ok size. Staff was very nice and accommodating for allergies and kids."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWLTR5TGpBRRAB",
            "text": "Nothing beats brunch at COOKSHOP.\nOne of NY’s original cram to table restaurants, this restaurant delivers delicious, savory cuisine that never disappoints!\nI recommend starting with the BLT Bloody Mary. The name says it all.\nThe deviled eggs are divine and the pulled pork croquettes are dripping with flavor.\nIf you go with a big appetite, indulge in the Huevos Rancheros.\nThey are amazing!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twa1RHNWZkV1JYYmxCblNVVmZkSGR3UzBjdFoyYxAB",
            "text": "Loved everything about our dinner here! Even though the room was open, we could hear each other talk. The food was amazing from appetizers to dessert. One of my favorite places in New York City"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4eXJqc3hBRRAB",
            "text": "Amazing meal here. I had the shrimp cocktail, which was more of a salad. The dressing was bright and tangy and paired perfectly with the seafood and salad veges. The hanger steak was amazing. Cooked perfectly and perfectly seasoned. The stringy fries were tasty, but a bit fiddly to eat - I think I would have preferred normal fries or a creamy mash.\n\nThe photos of the food don't really do it justice.\n\nA fantastic meal, I'd go back again if I lived here."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4MDRlUEd3EAE",
            "text": "Delicious spot for Brunch, lunch or dinner.\nCookshop caters for all occasions and times of the day. All the menu items are carefully thought out to provide maximum flavour and eating experience. We've eaten here many times and every time they never disappoint.\nWe even had our wedding dinner here, where the team went above and beyond to make our experience super special.\nThe cocktails are great too!\nFriendly and very helpful staff who cater to all your needs.\nBe sure to book since they get very busy.\nBathrooms out the back by the kitchen.\nGoing with kids for dinner at 5pm is a good slot."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CRFQxZzFNVlUxVTBKM05FUkhaSFZQTXpGVlpYYxAB",
            "text": "Nice restaurant that was available last minute for a large party.  The food was good as everyone enjoyed their meals. There were lots of good drinks and non alcoholic beverages too. I had to ask for a vegan option and it was a mix of beans and pasta. Both good."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bWZiYUpnEAE",
            "text": "Great spot for brunch. Food was really good. I got the egg sandwich and cinnamon roll. I would recommend the grilled chicken salad which my friend got."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0dGVpbmtBRRAB",
            "text": "Fun vibes with good brunch. The French toast was good, not the best I’ve had. It was also burning hot and waited a while longer to cool down. It got a bit overwhelming due to the large serving size after a few bites. Was a bit disappointed by the cocktail. The service was good despite the morning rush."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210T1V6aHJXR3hrYjB4a1VFUjFhRkJ3YUV4MWVGRRAB",
            "text": "Great place very close to the high line. Excellent service and delicious dishes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psNFVqWnNaMHhQYlY5dVNXTklPREJhVmpGaFptYxAB",
            "text": "What a wonderful dinner! My family (including 3 kids) of 8 rolled in and we weren’t disappointed. The focaccia was faaaaaantastic. Squash blooms were great. A tough critic brother in law said the pork chop was the best he ever had. Burgers were tasty and fries fresh and delicious. The turmeric tonic was fresh and even better when I added gin 😆 The staff were all very nice. It was a bit loud but I take that as a sign of good times!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREODR6YTdnRRAB",
            "text": "This place rocked. We wanted something close to the High Line and this place popped up. We made a reservation via Open Table. After getting delayed on the subway, we were a little late. The hostess was understandable and we were seated at a table right away. It was busy and lively. We ate the sourdough bread, citrus salad and deviled eggs. It was all good. I am certain anything is good on their menu. Thanks Cookshop!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabU9uZnp3RRAB",
            "text": "A great place for outdoor dining along the high line/west side of Manhattan. The service is attentive and atmosphere is fun but you’re not sitting on top of each person. Food is not value-for-money but tastes good. Plan for a starter or side as mains aren’t very filling."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJeFdtSmhja0ZWYlZoUlNUWkxSRTB0YTNKUVFrRRAB",
            "text": "We had a wonderful dinner at Cookshop - so great that we forgot to take photos of our food! The chilled tomato soup was a standout in the appetizers, and the corn on the cob went beautifully with my scallop entree. The service was warm and generous - and with helpful guidance on wines and food! The desserts were out of this world. Overall, the dishes were inventive and perfectly prepared. This was our first visit to Cookshop and I look forward to returning!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtNTlEb3JnRRAB",
            "text": "Came here for New Years Dinner and it was great! Very friendly staff and great food. The cocktails were reasonably priced given the location, they had a great photo booth and even gave out party favors. One of my favorite restaurants"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsM1JVSXpjVzExVmxsVU5uQkNhVkptWkhWVVZuYxAB",
            "text": "Came here with my date for breakfast on a sunday because, he works in the area and wanted to try it. We didn't need a reservation and was sat in the dining room; they also have outdoor sitting  but it was sa little warm.\n\nThe decor is really nice with tropical plants and nice lighting. Ample space for singles, couples, and groups. The staff is very attentive and polite.\n\nI wahted to try the poached egg but ordered the scrambled eggs with toast instead with, bacon on the side, and a watermelon juice. My date had the cornmeal buttermilk pancakes with peaches. The food exceeded our expectations and was really good. The eggs contained zucchini which I found to be a weird mix but blended well together. I tried a piece of pancake and it was heavenly."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMydjZ5YWhRRRAB",
            "text": "Popular brunch location for the locals, reservations suggested or you'll find yourself waiting on average of 1/2 to 1 hour for walk in.  The ambiance is good for large groups or a friendly brunch, too transactional feeling for a date. Servers are friendly and make great suggestions. The highlights are the chicken liver mousse, chicken salad, tequila bloody mary, and the grain bowl. The beignets are a little too heavy and cakey, the burger overcooked for \"medium rare\" (which is probably busy or understaffed kitchen?), oysters were suspiciously watery."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1N3IyLU93EAE",
            "text": "Cookshop is definitely one of my favorite weekend brunch spots. Always fun, good atmosphere and good food. Prices are fair, but the service levels may vary depending upon how busy it is, and it can get very busy so I recommend to making a reservation. They have a good selection of brunch menus and they use all fresh ingredients. The huevos rancheros is my favorite. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUU1VeGtPVlYyWTJ4WlVrdG1hRUp2Ykc4ME5VRRAB",
            "text": "Yummy experience! Outdoor is so fun. I always wanted to come and finally made it. Sal was so sweet and helpful and made our night with fresh strawberry dessert. Very friendly fun place definitely coming back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPeTZxek93EAE",
            "text": "A brunch restaurant near the high line in Chelsea serves good breakfast pastries and brunch menu. Atmosphere and service were great. All the food we ordered were fresh and great. Especially Huevos Rancheros was delicious as our server strongly recommend.\nThe restrooms are in front of the kitchen so customers can see the open kitchen during waiting. A great location for a walk on the High Line after eating."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLZ09mQ0JREAE",
            "text": "Love this place for brunch but had never tried their dinner. Extremely friendly staff and great drinks. Had their pizza and the pizza crust is bomb! For drinks the Pomelita is amazing! Highly recommend\n\nEdit: 10/30\n\nCame here for brunch the other day and can confirm how amazing the food is!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0bUxUaW9RRRAB",
            "text": "What an experience! Their brunch was one of the best in the city. Beautiful, simple interior. Beautiful light coming in through the large windows. The noise level was reasonable. The food! Their Huevos was absolutely delicious. Their Bloody Mary’s were perfectly created. The service was excellent, especially the bartender Roberto."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURScVBMUWNREAE",
            "text": "This is just over-complicated classic American diner fare. The service and aesthetic are excellent. The coffee is great, too.\n\nThe seasonal ramps pizza (ramps being a relative of leeks, something new to me) was incredibly delicate and had an excellent depth of flavor given the simple construction. Plus, it was cool that the waiter could so knowledgeably recommend seasonal items. But for $24, if this had been my entree, I’d have been left feeling hungry for more. My coworkers and I split the dish.\n\nThe tuna melt was also apparently seasonal, coming sandwiched between two slices of cranberry rye bread, and next to a plate of entirely unsatisfying vegetation. I don’t remember what it was, maybe radicchio, and I do love a good bright, fresh, crisp salad side dish. But the sandwich was small enough and didn’t at all live up to the aesthetic or bougie, im-better-than-your-usual-spot energy that the restaurant radiates with, and the bitter purple leaves didn’t necessarily help make me feel like I made the right choice.\n\nDon’t get me wrong: the food is good by all objective standards. That’s fair. However, given the prices, lack of creativity, and the need to “fix something that ain’t broke” mentality of the menu, I have a hard time recommending it to anyone. If you really want a taste of what the restaurant is trying to serve you, just go somewhere like Bubby’s in Tribeca.\n\nIt’s not fundamental enough to go there in lieu of any other diner or bodega in the city and it’s not upscale enough for a special event. It’s just kind of there when it doesn’t quite need to be."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROb2ZqZlJ3EAE",
            "text": "The albacore tuna was overall excellent. I had expected it to be a little more moist, but maybe because I'm more used to having salmon. Nevertheless, the fennel, grapefruit, orange, etc., contributed to a great combination of flavors.\n\nFor the starter, I had ordered the brandade fritters, but they gave me house-cured bresaola instead. To be honest, looking at the thin red slices, I thought this didn't look right, but wasn't 100% sure, so I didn't say anything 🤣. I ate it anyway, and I have to admit I enjoyed it a lot 😄 I think the sweet taste of pomegranate and the cured meat went quite well together.\n\nOverall 5 stars for food. 4 stars for service and atmosphere (the starter mix-up didn't affect my rating)."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHdXRlRUp3EAE",
            "text": "Came here for their famous Bloody Mary. Food was outstanding. Their bread tasted so good!! Amazing cappuccino in great temperature with thick milk foam. Definitely one of my favorite brunch places."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVb3ZXV0dBEAE",
            "text": "go for brunch this summer and get the poached eggs! they’re refreshingly delicious while paired with its plump heirloom tomatoes. i heard they were picked fresh that morning from the farmers market, which is amazing that it’s sourced locally.\n\nservice was also great. their AC broke (of course on the hottest day of the summer) and they had to move us from our seated table twice, which i would have been super upset about, but their associates were so kind and truly just wanted it to cool down. they comped all of our drinks for us too, which was a cherry on top. 10/10 would recommend!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxLS1TcXFRRRAB",
            "text": "I don’t often give a 5 but this restaurant was excellent. Interesting menu, fresh fresh food, beautiful plating and great service. Was also a spectacular evening to dine outside. Wine selection was my favorite, had byodynamic and organic offerings and the menu noted each type.   Shaved zucchini appetizer was great, a nice bite to the zucchini with lemon and sharp feta, a great combination.  Ricotta and peas, another great choice. Perfectly toasted bread with creamy ricotta and sweet peas with a hint of mint. Onion pie and roasted pork (pork is not on the online menu). Were both delicious. Did not order dessert but they brought us one to share anyway, goat cheese cheesecake, it was amazing. Rich flavor but light and airy. Overall have nothing but good things to say!!!"
        }
    ],
    "reviews_count": 76
}